{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207",
            "title": "Simple MakerDAO \\xe2\\x80\\x94 Governance from first principles ",
            "index": 16207,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "governance-restructure"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#1",
                    "likes": "47",
                    "time": "29/06/2022-16:49:05",
                    "content": " Executive summary This proposal describes a series of simple governance changes to MakerDAO that would address many problems that exist in governance today. These include a general lack of vision and strategy as well as low accountability to MKR holders.  Table of contents  Executive summary Why we need to talk about this now  Problem statements  Maker has an identity crisis Maker has a governance crisis    Proposal  Main idea #1: Create a Constitution for Maker Main idea #2: Establish a Council of Makers   Expected impact on Maker Implementation Appendix A - How is the constitution created? Appendix B - How is the council elected?  Thanks to all contributors: @adcv @Aes @SebVentures @Eumenes @hexonaut @teej @luca_pro @MarianoDP @Nadia @pipko  Why this matters now We are at the foot of an unprecedented opportunity for Maker. Other stablecoins (UST) and centralized lending markets (Celsius, Blockfi, Voyager) are blowing up. Lending demand is evaporating and borrowing costs are going up. Yield-bearing, uncorrelated RWAs are being tokenized on-chain. All against a backdrop of global interest rates rising, forcing investors on a quest for financial stability. If we play our cards right, DAI can become the USD-as-a-service for the next generation of internet users around the world. At the same time, Maker is at a pivotal time internally. rune, the founder, is pushing back into the spotlight with plans for a massive restructuring of our governance model. Some of his ideas are good but I’d like to give the community another governance proposal to choose from. The best ideas are born in the fire of competition and debate and ideally, Maker can find a way to pick the best from all proposals to build a strong, unified consensus. Finally, interest in Maker governance has never been higher. While reaching consensus may be difficult initially, whatever we decide now will have unprecedented buy-in from MKR holders.  Problem statements The supply chain for decision-making in any organization basically looks like this:  image944×146 7.45 KB  These different layers of decision-making require very different skills and resources — e.g. a vision should be very high-level and long-term, whereas implementation choices require highly local knowledge & are necessarily short-term in nature. Smaller organizations can initially get away with having very flat hierarchies but as they grow and mature, they naturally run into the scaling limits of that approach, e.g. the local knowledge problem. From there, hierarchies are implemented to allow for division of labor and specialization in each layer of this decision-making supply chain. Turning to Maker, the CUs currently handle most implementation decisions while MAs/cross-CU collaborations are responsible for our tactics. However, there is a lack of vision of what Maker should be and a lack of strategy on how it should get there. (Another way of putting this would be: there’s an excess of visions and strategies and no unity about them.) Based on these observations, we define two problem statements:  Maker has an identity crisis  How much emphasis should we put on MKR holder profit vs. operating as a public good? What is the right balance between decentralization and efficiency? Should Maker stay isolated to crypto or expand to the real world? Should we burn MKR always vs. burning MKR tactically? Is Maker a bank? What is the right shape for MakerDAO (the organization)?  We are discussing these and other questions in Maker for years and are still discussing them today. In my opinion, it matters less what the vision for Maker is (although I certainly have my favorites) — what matters more is that we have a vision and stand united in executing it. If Maker had a vision, many strategic or tactical governance decisions would derive from them as well w/o the risk of falling back into the same fundamental debates over again. Instead, discussions about vision could be contained to the vision layer, and decisions about strategy could be contained to the strategy layer, etc., and wouldn’t be conflated as much as they are today. With a consistent vision, there would also be less flip-flopping around important decisions because a vision is meant to be set in stone for at least the next 5-10 years.  Maker has a governance crisis In its current governance model, almost all steps of the decision supply chain are kicked to MKR holders. MKR holders are supposed to decide on every tactic, sometimes even down to the implementation level. Most of the time, someone with more local knowledge could make a better decision than them. In other cases, it is the lack of global knowledge: in the best case, MKR holders bring their own vision + strategy for the project and vote in a way that maximizes the probability of success. But usually, decisions are made without any concern for the long-term or information that sits outside the proposal at hand. This is further exacerbated by the continuous nature of Maker governance: if all budget decisions were made at the same time, it would automatically force decision-makers to zoom out & take a holistic view of the budget; instead, budget requests are streaming in every a week, and every decision is made without taking all other budgets in mind. Finally, there is a lack of voting incentives in Maker. Most MKR doesn’t vote at all; this gives more relative power to MKR holders with an external incentive to vote. For example, they can vote to onboard collateral which would maximize their own portfolio rather than that of Maker as a whole. It would, however, be a mistake to blame MKR holders for this — Maker’s current governance system is setting them up to fail. Maker has long outgrown the time when a single person can vote on everything. Specialization within layers of the governance supply chain, and cooperation between the layers of the governance supply chain, are urgently needed. But Maker’s incentives actively discourage both: delegates have to vote on everything to get paid; specialization is actively discouraged; and the more voters/delegates participate, the less incentive there is for anyone to specialize.  image944×501 23.3 KB  In summary, the most overloaded role in Maker has been the MKR holder/delegate. Ironically, it is also the least incentivized at all. As a result, Maker has been less efficient, more wasteful, and less accountable to its holders than it could be. The status quo does not even maximize decentralization, because governance participation is minimal and important principles are not set in stone but rather depend on how who shows up to individual votes or discussions on a given day.  These two problems are related but not the same. For example, many of Maker’s governance problems derive from its identity crisis. If there was a single source of truth for what Maker is or should focus on, governance would become easier (although still not easy enough.) But because a single source of truth is never established, fundamental debates frequently break out over seemingly unimportant votes or proposals. To address the two problems of identity crisis and governance crisis, we propose two changes to Maker. Both require no changes to the code infrastructure (not even the voting portal) — they are just changes in the process that should hopefully address the problems outlined above. Both are meant as an invitation to explore and discuss, not meant as final truth.  Proposal  Main idea #1: Create a Constitution for Maker In broad strokes, the constitution would be a document that breaks out the vision and other foundational principles from the rest of the governance supply chain. the constitution would define  Maker’s vision and north star The rights & responsibilities of key stakeholders within the system Maker’s mandates (e.g. make money for MKR holders, create the most liquid decentralized stablecoin, and become the cheapest source of credit)  The overarching of the constitution is to address the first problem, a lack of identity, but also has many positive effects on Maker’s second problem, its governance crisis. The benefits can be broken down as such:  Create a rock-solid foundation of underlying principles of Maker. The constitution defines those parts that are explicitly NOT subject to frequent change and from which other decisions (e.g. on strategy or tactics) derive.  Encode in writing what we can’t encode in smart contract code. Create a yardstick against which all other parts of the decision supply chain (delegates, council, MAs, CU members) can be held accountable — both by each other and by MKR holders. Cleanly separate the what (vision, goals) from how (strategy), so they can be discussed and decided individually.  The constitution is supposed to be a living but hard-to-change document that puts Maker’s current identity in writing. most governance decisions can be derived from it. The constitution can be updated but this should require extensive discussion, a quorum of MKR holders, and a supermajority in a given vote. This locks in the slow-moving, decentralized nature of Maker as a decentralized credit protocol.  image944×501 26.6 KB  For thoughts on how the constitution could be initially written, see Appendix A.  Main idea #2: Establish a Council of Makers The overarching goal of the Council of Makers would be to break out the second part of the governance supply chain, Strategy, and give it a dedicated role. This role should be highly encouraged to specialize in what allows them to make good strategic decisions while being accountable to the Constitution as well as MKR holders/delegates directly. Specifically, the council could be tasked with  Setting a high-level strategy for Maker to reach the goals laid out in the constitution. Setting a budget for Maker.  Allocating the budget to CUs + external contributors. Managing bigger DAO transactions like buy buybacks, dividends, DAO-to-DAO partnerships, and token/debt offerings.  The goal is to give decisions that need global knowledge of Maker and the crypto credit market to an entity that has it. For example, it is impossible to make individual budget decisions for Maker without considering the budget of all CUs, Maker’s current recurring revenue and runway, overall market conditions, etc. Specialization within the council would be further encouraged. For example, the council could have a fixed number of seats (7) with different areas of expertise, e.g. business, ALM, technology, legal, and wildcards. In order to attract the best specialists for these roles, competitive compensation will be required. The council members would be ratified by MKR holders and serve on fixed terms, e.g. 1 year.  image944×501 32.4 KB  The council would sit between the CUs and delegates, and be accountable to MKR holders at all times.  MKR holders/delegates appoint council members on 1-year terms MKR holders/delegates can fire council members anytime with sufficient quorum MKR holders/delegates need to ratify every executive spell. The council can not get any decisions passed on-chain unilaterally. It is paid to serve and propose.  For a discussion on how the council could be elected, see Appendix B.  Expected impact on Maker The biggest impact of this proposal would be to move from MKR holders/delegates deciding over all parts of the decision supply chain to deciding over three much slower moving areas:  The Constitution, which encodes Maker’s vision, values, and principles The Council of Makers, which sets a strategy for Maker and manages its treasury Ratifying every spell before it goes on chain.  Instead, all decisions in Maker would be made at the right layer:  image2000×1061 175 KB  Different issues (e.g. vision, strategy, or tactics) can be discussed at the right layer without conflating them. Mapping different layers to different decision-makers finally unlocks specialization, reduces the scope of any individual decision-maker, creates a separation of power, and increases accountability. As a result, CUs can have more freedom to build while at the same time being more accountable to MKR holders and the enshrined. Governance becomes more efficient, which is needed for Maker to scale. Governance becomes more robust to attack and capture. Maker is set up to harvest the enormous opportunity in front of us.  Implementation So, what is the minimum viable way to do these things? Fortunately, nothing needs to be changed technically — only governance MIPs. MKR holders/delegates still vote on any spell. Voting/polling, which has always been informal, is abolished in favor of more local decision-making by the Council and MAs. The Constitution and Council are in theory independent of each other — either could be implemented without the other, although they do unlock a lot of synergies if they are both implemented. As a result, if MKR holders want, they could be implemented in parallel tracks. Especially the process of creating the constitution might take longer than six months, but we could benefit from a Council much sooner. The next steps would be to  create a creation process plan for the constitution (see Appendix A) create an election process plan for the council (see Appendix B) create a compensation plan for the council   Appendix A - How is the constitution created? Based on some initial ideas, the process would have two steps. Initially, someone has to prepare a constitution. This could be done by the Council if it were to be elected first. The council could then prepare different versions of the constitution and sending to the vote. Alternatively, Maker could incentivize a Constitution WG/committee that is independent of the Council. Finally, there could be many independent individuals or groups working on preparing drafts of the constitution. In the second stage, all the available constitution drafts should be sent to a vote for MKR holders to choose from. I believe the optimal format would be a multi-round vote, with a discussion period between all rounds, until only one draft remains. The constitution should need a supermajority to pass (2/3+).  Appendix B - How is the council elected? Again, many different ideas here, but some thoughts we would need to address here are:  What should the specialist seats on the Council be? By what process do we propose Council members to MKR holders? Should we create a Council hiring committee? What should the compensation plan for Council members be? They should probably have clear and measurable objectives, and a large variable pay share tied to them for maximum accountability and incentive alignment Are members elected individually, or do MKR holders vote on different permutations of the Council?  Note that the Council would also be compatible with a Party system if that is where we end up going. ",
                    "links": [
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#why-this-matters-now-3",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#problem-statements-4",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#maker-has-an-identity-crisis-5",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#maker-has-a-governance-crisis-6",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#proposal-7",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#main-idea-1-create-a-constitution-for-maker-8",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#main-idea-2-establish-a-council-of-makers-9",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#expected-impact-on-maker-10",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#implementation-11",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#appendix-a-how-is-the-constitution-created-12",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207#appendix-b-how-is-the-council-elected-13",
                        "https://vote.makerdao.com/polling/QmWYajMq#vote-breakdown",
                        "https://en.m.wikipedia.org/wiki/Local_knowledge_problem",
                        "https://twitter.com/matthuang/status/1540726260971606016?s=20&t=-jTmkPB7xkchNTN40kbqQg",
                        "https://forum.makerdao.com/t/kickoff-governance-from-first-principles-building-a-resilient-decentralized-and-uncensorable-stablecoin/15978",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3",
                        "https://forum.makerdao.com/t/governance-and-risk-197-thursday-june-30-at-21-00-utc/16216/2",
                        "https://forum.makerdao.com/t/registro-de-delegados-de-gobernanza-cientifica-orientados-a-los-negocios-traduccion/15908/19",
                        "https://forum.makerdao.com/t/endgame-plan-part-5-endgame-product-roadmap-pregame-and-early-game/16670/14",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-9/16355",
                        "https://forum.makerdao.com/t/charting-a-path-for-rwas-part-2-the-maker-standard/16725",
                        "https://forum.makerdao.com/t/kickoff-governance-from-first-principles-building-a-resilient-decentralized-and-uncensorable-stablecoin/15978/16",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-may-june-and-july-2022/17037",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-9-traduccion/16383",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/72",
                        "https://forum.makerdao.com/t/signal-request-reset-delegation-metrics-for-hasu/16533"
                    ],
                    "GPT-summary": "The post is a proposal for governance changes to MakerDAO, addressing problems such as a lack of vision and strategy, low accountability to MKR holders, and a governance crisis. The proposal suggests creating a Constitution for Maker and establishing a Council of Makers to specialize in setting a high-level strategy for Maker and managing its treasury. The post also discusses the problems with Maker's current governance model and the benefits of the proposed changes. The post does not advertise the proposal, but rather explains it and invites discussion and exploration.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.604499278499278
                },
                {
                    "author_link": "https://forum.makerdao.com/u/epowell101",
                    "index": "#2",
                    "likes": "11",
                    "time": "29/06/2022-17:31:01",
                    "content": "Just a comment that this is consistent - at least as I read it - w/ some suggestions from a post from a16z today on the overall subject:  Lightspeed Democracy: What web3 organizations can learn from the history of governance - a16z crypto And more broadly IMO is a positive pattern similar to an approach a number of us are advocating for within the metagovernance DAO wildfire (spawned by FE). This approach strikes me as similar to the approach of some successful open-source projects btw. I do not know Maker well - just lurking here - so hesitate to voice an opinion other than that such an approach seems necessary for a broad range of organizations including many DAOs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.586868686868687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#3",
                    "likes": "20",
                    "time": "29/06/2022-17:49:57",
                    "content": "As an additional data point, here is a similar project in the past to create a single vision and strategy: https://forum.makerdao.com/tag/project-compass If I’m not mistaken there was an additional, more concrete output to this that isn’t tagged there. I’ll have a look for it later. I’ll just add that, from my experience, it’s extremely hard to agree on any single vision or strategy within the DAO (unless it lacks detail to the extent that it becomes meaningless.) This has lead me to believe that it’s more useful to work on consensus-seeking mechanisms that identify likeminded groups and try to build as big a consensus as possible. Without setting the expectation that there will necessarily be a single one. That being said, if these consensus mechanisms work well enough then it may still be possible for a universal set of shared values or principles to arise. But that would require way better governance infrastructure than we have today. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.192791005291006
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#4",
                    "likes": "5",
                    "time": "29/06/2022-17:59:29",
                    "content": "So just looking at the names of those tagged as writing this, let’s go ahead and get the following question out of the way (which I don’t endorse but have already heard since this post went live): “Is this just folks on the wrong end of this week’s votes now trying to change the rules so they have a possible way to enact the platform that was rejected?” At first glance, I think @wouter is right that it will be nearly impossible to get any meaningful agreement. Perhaps whales on each side should offer to buy each other out or the DAO could just split into a PSM+RWA and then a crypto collateral in the other, with issuance of dai being the primary overlap ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.070641479732388
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#5",
                    "likes": "9",
                    "time": "29/06/2022-18:18:48",
                    "content": "This proposal simply delivers what I have described several months ago in my Delegate Platform and reiterated many times before and after. Originally I wanted to take more time to finish this proposal up but the recent interest in Maker governance has motivated me to finish it up early. The governance system that is outlined in the proposal works independently of what inputs (vision, council members) you give it, so it’s credibly neutral in that regard. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#6",
                    "likes": "5",
                    "time": "29/06/2022-18:39:35",
                    "content": "Do you see an alternative possibility where the focus is on innovation and improvement of the process of (1) identifying competing visions and strategies and quantifying the MKR support, (2) iterating on governance improvements to maximize the common ground, and (3) work towards an emergent constitution starting from there (I.e. ossification of a universal set of principles) This is a slower and more organic approach, but it wouldn’t depend on the assumption that a common vision and strategy can be found from the start. It’s basically taking the process that you describe in Appendix A and turning it into a continuous governance mechanism implemented in software. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#7",
                    "likes": "2",
                    "time": "29/06/2022-18:56:05",
                    "content": "this is a fair point but if Maker cannot build a consensus vision and strategy,  there is a growing risk that Maker becomes economically irrelevant as other players better innovate and adapt to the dynamic evolving crypto market. also stable coins have serious network economics and increasing returns to scale so there will likely be a small number of coins that reach scale.  The others will probably wither on the vine as they wont have adequate unit economics. The crypto market and other participants are continuously evolving:  they dont care that Maker is currently too divided to create a consistent bigger vision or strategy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.173076923076923
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#8",
                    "likes": "6",
                    "time": "29/06/2022-18:57:21",
                    "content": "I love that we are already realizing that on a technical level MAKER is the best example of how to approach a protocol, but I continue to insist that socially we are not taking the next step, the only reason why the USD historically came to do what it is today is due to its global use and its exposure, those of us who are in the protocol and know absolutely everything live in a bubble of knowledge, thinking that everyone knows what MAKER is and what DAI is, if we exposed ourselves to a little more to the world new users will use DAI before USDT, BUSD or USDC even though the latter are centralized. How much emphasis should we put on MKR holder profit vs. operating as a public good? Earnings for MAKER holders is at the right point, everyone is doing their job, I personally wouldn’t change it, but exposure to the public should be expanded.  pic2af3e487eb8f5a964bdaf10805456380840×437 263 KB  I always put it in context with the exposure and the bad decisions that FIAT had, of course there is no level of comparison but we realized how many bad decisions have made the dollar lose value but increase its exposure, therefore, if we make good decisions we increase our exposure and thus get them to use the protocol, but without exposure there is no use. Thanks to the Bretton Woods agreements, the value of the dollar continued to be the most important reference, so we can conclude that despite the bad decisions, the exhibition is the one that maintains the value of the dollar as an international reference, and that we must do with DAI so that be the reference value What is the right balance between decentralization and efficiency? That MAKER and DAI be used by the average citizen, small and medium investments, they are the ones that move the economy, if we increase our exposure to them they will continue with decentralization and efficiency Should Maker stay isolated to crypto or expand to the real world? Unity is strength, but I always liked the idea of ​​also adding MAKER as a brand and doing business in underdeveloped countries where regulations are not so authoritarian, and getting these supplies to be paid with cryptocurrencies and stable currencies, which in the name of Maker have a % to return to the protocol and thus the commercial volume continues to move and we increase our exposure, or simply that this money is used for the vault, thus we manage to incentivize the vault and increase the exposure of MAKER towards the public that should be an important goal  image828×1555 195 KB   FPC3n4qX0AA1qVF1200×675 57.8 KB   20220419_190423912×510 57.4 KB  These images are taken from the topic:     Recopilación de Noticias sobre MakerDAO, DAI y MKR Latin America       Hola!  No se si engancharán o les resultará interesante la propuesta, pero se me ocurrió abrir éste topic para recopilar, contar y comentar distintas noticias que salgan y nos enteremos sobre MakerDAO, DAI y MKR, sea las publicadas en grandes medios de comunicación o sea pequeñas noticias de la vida cotidiana que nos resulten relevantes. En un principio pensé en que sea sobre LATAM, pero no veo porque no podría ser internacional.  Empiezo yo:  Hace unos días se hizo viral en Argentina que un emp…     From my peers: @Marian @0xRami @Nicolas_Bernabe I place this because for decentralization you have to touch reality, and adoption is our ultimate goal Should we burn MKR always vs. burning MKR tactically? No, I still support tactical burning, as continuous burning is a waste of money. Is Maker a bank? And this is the question that makes MAKER something completely different from the rest of the protocols that practically serve as a bank, Maker by having an image becomes a reason for being, since everyone here wants decentralization, users by having all The same vision of decentralization will never be a bank, the DAO’s is a dream since the cypherpunks and without a doubt MAKER will be the first to do it, but we need that union of vision that I know we all have, but some personal interests can accident the arrival What is the right shape for MakerDAO (the organization)? I think that it is like a committee in part to give an opinion, but those who have MAKER and vote are like the “bosses” and in them they will accept or not the proposals, so it would be like a matrix model, then it would be like a matrix committee? I don’t know, but it’s practically those two models together. That is my opinion of course, I think that the use of DAI is the one that will increase the value of currency, a special value that the citizen will use more DAI than Tether for example, but for us to have that we need to expose ourselves to the real world, although they do not Like several people, the citizen uses more Tether than DAI despite the fact that Tether is much more insecure than DAI, the citizen uses more loans in a fashionable protocol or even does not use any, and all this happens due to ignorance, so therefore, we must be that teaching for the average citizen, that is where the true power is as a value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.640762613822958
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#9",
                    "likes": "4",
                    "time": "29/06/2022-19:03:12",
                    "content": "I’ll second this point shared by @wouter:     wouter:  I’ll just add that, from my experience, it’s extremely hard to agree on any single vision or strategy within the DAO (unless it lacks detail to the extent that it becomes meaningless.)   As DAOs grow, opinions become fragmented and decision-making becomes more difficult. Whether a constitution or a core member, there will be a myriad of suggestions. But that shouldn’t deter us from finding a common solution. @Hasu I applaud your ability to peruse a simple roadmap (constitution & council of makers) and deliver on promises outlined in your initial delegate platform. This seems to be one of the goal sof governance:     Hasu:  Encode in writing what we can’t encode in smart contract code   I would endorse a document that does such but allows for flexibility to include new emerging product lines or shifting values of the DAO. We need to encourage agility. As for the council - deciding / allocating budgets seems to be the most important role. How do you limit conflict of interests between CU members? Will this be mostly outsiders? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.195851370851371
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#10",
                    "likes": "8",
                    "time": "29/06/2022-19:48:03",
                    "content": "It would definitely require us to think about competitiveness outside of the box of traditional corporations. Why can democracies compete with dictatorships? Because the melting pot of ideas and internal pressure testing resulting from disagreement can beat a single-minded direction. If one consensus forms and then it fails, there are 3 others to take over and try alternatives, evolving to a better outcome. This resilience can beat a single-design bet. And it’s all very messy and chaotic and frustratingly slow along the way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#11",
                    "likes": "9",
                    "time": "29/06/2022-19:55:29",
                    "content": "If you consider delegates as elected members of the council (they’re already getting paid), you just need to ask them to set the vision through a Constitution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#12",
                    "likes": "14",
                    "time": "29/06/2022-21:33:57",
                    "content": "    juan:  If you consider delegates as elected members of the council (they’re already getting paid), you just need to ask them to set the vision through a Constitution.   This is the correct answer. We already have a decentralized team of executives, hand-selected directly by MKR holders and whose terms expire annually with the expiration of their delegate contracts. If the problem with the DAO is a lack of efficiency, then adding another layer of bureaucracy is not going to help that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#13",
                    "likes": "6",
                    "time": "29/06/2022-21:34:48",
                    "content": "This proposition needs to be looked at in the context of everything that has been happening lately, particularly with the last vote. When observed through that lens, it’s clearly a governance attack. This is an attempt to codify the values of whichever VC/whale cartel wins an inevitable “test of strength” with an immutable Constitution that has the sole purpose of silencing dissent and squashing attempts to innovate beyond what is considered permissible by the executives. At least now, we have VC/whale cartels battling one another. Under this new Constitution, we would assuredly have just one VC/whale cartel with codified morality that could not be violated. If I thought that there would be any chance that this Constitution would respect the ideals of decentralization, censorship-resistance and trust minimization that this DAO was found upon, then I’d be interested. However, there is little to no chance that this proposal would have been made if the proposer didn’t believe that the votes were there to codify the very specific centralized vision for Maker that he’s been pushing for weeks/months. This is an attempt to allow VC-anointed executives to run MakerDAO as a business rather than allowing the DAO to operate in a truly decentralized way. It’s an attempt to trade decentralization & censorship-resistance for max efficiency and a clear path to regulation. Decentralization is messy and less efficient than centralization. If we are seeking maximum efficiency, then we are simply giving up on the idea of a DAO. If this proposition is accepted, it will destroy the DAO and it will create a centralized and regulatable organization that no longer deserves the descriptor “decentralized”. Reject this very obvious attack on Maker governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.999665775401069
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#14",
                    "likes": "6",
                    "time": "29/06/2022-21:45:24",
                    "content": "If the DAO needs a Constitution, why don’t we start with the MakerDAO White Paper, which already enumerates a set of narratives and roles. What is the deficiency of this document? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#15",
                    "likes": "10",
                    "time": "29/06/2022-22:03:53",
                    "content": "    ChrisBlec:  When observed through that lens, it’s clearly a governance attack.   This is rhetorical sleight of hand, stating your opinion as fact. From my view the endgame plan much more closely resembles a governance attack - explicitly forming a block that can dilute minority with voting rewards directed to a favored subset of token holders, potential for strategic voting to control key appointments (budget allocators, executive delegates, etc), define scope map, and control focus objective prioritization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#16",
                    "likes": "2",
                    "time": "29/06/2022-22:04:33",
                    "content": "    monet-supply:  From my view the endgame plan much more closely resembles a governance attack   Lots of governance attacks going on right now! There’s a lot at stake for the VCs and whales. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 7.142857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#17",
                    "likes": "7",
                    "time": "29/06/2022-22:06:39",
                    "content": "That being said, I’m not wild about the idea of a “constitution” because the power should always remain in MKR holders’ hands - if the spell passes and is executed through governance it is prima facie valid. Sound mechanism design is preferred because it is explicit and enforces itself. Would prefer the constitution part be revamped as @wouter suggested with a process where high level vision(s) can emerge through organic bottom up processes of MKR holders and other stakeholders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.481249999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#18",
                    "likes": "6",
                    "time": "29/06/2022-22:11:16",
                    "content": "    monet-supply:  Would prefer the constitution part be revamped as @wouter suggested with a process where high level vision(s) can emerge through organic bottom up processes of MKR holders and other stakeholders.   The amount of red tape and bureaucracy that we’d be creating for ourselves with this type of system would be epic. DAOs require a natural level of limited chaos. We need to maintain a decentralized system where anyone can be heard on any idea and anyone can quickly rise up as a MKR voter or delegate. This proposition, in the context of today’s VC/whale wars, is going in the opposite direction of that. It is designed to make innovation harder. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.220502645502646
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#19",
                    "likes": "22",
                    "time": "29/06/2022-22:20:45",
                    "content": "    ChrisBlec:  Reject this very obvious attack on Maker governance.   We need to be able to have a discussion about governance on Maker without launching into calling everything a ‘governance attack’. Recent threads on the forum have seen an unhelpful shift away from  fact-based debate to conspiratorial mud-slinging and that is its own threat to Maker’s governance. This thread is a serious attempt to debate governance from first principles and address Maker’s deficiencies, it very obviously is not a ‘governance attack’, and the quality of the discussion falls precipitously when we descend into bad-faith accusations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.726190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#20",
                    "likes": "1",
                    "time": "29/06/2022-22:25:40",
                    "content": "    Matt_NZ:  We need to be able to have a discussion about governance on Maker without launching into calling everything a ‘governance attack’.   I outlined exactly how it is a clear governance attack. I don’t take the term or the accusation lightly nor do I use it often (or ever on this forum). If this proposition passes, power will be consolidated with whichever VC/whale cartel emerges the strongest. Independent voices will be silenced. Innovation will be slowed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#21",
                    "likes": "4",
                    "time": "29/06/2022-22:28:33",
                    "content": "This is much more akin to the difference between a representative democracy and a direct democracy than it is a governance attack. In this case, MKR holders would ultimately decide exactly what goes into the constitution (& to make the analogy work, “elects” some written text). If a VC/whale cartel can emerge to dominate votes, they don’t need a constitution to do this. If they can dominate votes once (to elect the constitution they want), they can dominate votes every time, for everything. Your take is silly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#22",
                    "likes": "6",
                    "time": "29/06/2022-22:45:36",
                    "content": "    juan:  If you consider delegates as elected members of the council (they’re already getting paid), you just need to ask them to set the vision through a Constitution.   Not answering for @Hasu but don’t really see how you could consider the delegates as playing the same role as the Council. As Hasu outlined, the Council is tasked with:   Setting a high-level strategy for Maker to reach the goals laid out in the constitution. Setting a budget for Maker.  Allocating the budget to CUs + external contributors. Managing bigger DAO transactions like buy buybacks, dividends, DAO-to-DAO partnerships, and token/debt offerings.   The Delegates have not performed these duties, they have not been directly asked to, and we don’t know if they even want to! Part of the motivation for the delegation system was to pass executives more easily without having to harass MKR whales, but also to enable people to participate in Governance more efficiently (small holders can delegate to those with similar views and not incur the frictions with on-chain voting). I still don’t think there is any consensus on what Delegate responsibilities are or ought to be. To me, Delegates gain voting power based on their values and the delegators alignment with them and express those views in on-chain votes. Today, delegates are forced to look at proposals largely in isolation because that’s how our Governance system is currently designed. It seems logical to me that there be a group that carries out these higher level decisions (and existing delegates could indeed decide they want such a role with more defined expectations) and be rewarded for such efforts. The Council also has a fixed number of seats with different areas of expertise - I believe having a multidisciplinary team and more diversity would be extremely beneficial for solving some of the DAOs toughest problems. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.658549783549783
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#23",
                    "likes": "1",
                    "time": "29/06/2022-23:09:14",
                    "content": "    lyt:  If a VC/whale cartel can emerge to dominate votes, they don’t need a constitution to do this.   It’s not about effectiveness. It’s about appearances. They can’t do it now because if they overwhelm every single vote it will be obvious to regulators what they’re up to. If they have a “Constitution” they can just set it and forget it and let the Constitution keep out the riff-raff while they do conduct their business peacefully, sans interruption. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2976190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#24",
                    "likes": "3",
                    "time": "29/06/2022-23:12:35",
                    "content": "I don’t understand why delegates need to then delegate their power? If MKR holders want term-limited representatives, why the  aren’t they delegating their MKR now? And if they don’t, what’s the difference between Rune/a16z-owned delegates and a council appointed by those same delegates? Just seems like an extra layer with no purpose. Delegates already have complained loudly about this same group trying to always cut them out of discussions. Other than formalizing that end run around delegates, I don’t see what it accomplishes other than further bloating the payroll obligations ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MRKWHG",
                    "index": "#25",
                    "likes": "1",
                    "time": "29/06/2022-23:22:53",
                    "content": "What a horrible Idea, i bet some idiotic idea without proper risk consideration will then make it in next and kill Dai entirely. Why adding a trust component? Did you really think all that through? Real world collateral so we can extend the risk of defaults? Treasury bonds when dai liquidity would be more profitable and healthier for the ecosystem? Whose horrible take is that and why keeps that being considered? This will do nothing but destroy the foundation of the trust people have in Dai. But if you follow through with this, i propose myself as i called the collapse of ohm ust bnt and risk considerations of some people here seem to be mainly personal bias. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.106060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#27",
                    "likes": "1",
                    "time": "30/06/2022-00:01:00",
                    "content": "Do all delegates get paid ? I thought that is only if people have delegated MKR to you. What if you are a small shadow delegate ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#28",
                    "likes": "17",
                    "time": "30/06/2022-00:25:35",
                    "content": "    SelenaPotter:  Whatever the intention was in trying to orchestrate a bunch of funds coming in without so much as a how-do-you-do, a lot of these contributors have terrible reputations now and are probably lucky no one has suggested to oust them.   This is a very unconstructive commentary and the anti-thesis of what Maker should aspire to - namely, a Forum for which ideas are debated (regardless of source) and ultimately voted on by the Maker token holders. This type of commentary basically suggests that individual contributors to Maker DAO Core Units cannot express an opinion and make proposals to the Maker community. That type of approach is, in effect, a powerful form of censorship. Censorship is more pernicious than the decentralization/centralization debate. It is this type of comment that, in my opinion, creates a climate of intimidation for some of those most intimately involved in the day-to-day execution of Maker token votes. It may be that individual contributors have thoughtful views and contributions. Should they not be encouraged to share them for the benefit of the community. Or is your proposal that the only way I can share a “legitimate” opinion is if I leave my role as a contributor to the Maker community? As a contributor to the Maker community and someone with ideas (some good and some bad) to share, I would like to know. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.544444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#29",
                    "likes": "6",
                    "time": "30/06/2022-00:45:23",
                    "content": "Perhaps try engaging on the substance of the proposal instead of ad hominem attacks? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#32",
                    "likes": "1",
                    "time": "30/06/2022-01:18:57",
                    "content": "The Maker community is free to ask me to leave if my contributions are not deemed valuable for the onboarding of Real World Assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MRKWHG",
                    "index": "#33",
                    "likes": "2",
                    "time": "30/06/2022-01:19:34",
                    "content": "The onboarding of Real World Assets is not deemed valueable. If anything it’s the beginning of the end and a huge systemic risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#34",
                    "likes": "7",
                    "time": "30/06/2022-01:21:55",
                    "content": "    SelenaPotter:  Where I sit, it looks like a bunch of funds thought they could walk right in here and do whatever they pleased like corporate raiders.   And the dastardly goal of these ruthless corporate raiders was to support… additional lending oversight?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.785714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CYJFC",
                    "index": "#35",
                    "likes": "1",
                    "time": "30/06/2022-01:22:56",
                    "content": "    Hasu:  The constitution should need a supermajority to pass (2/3+).   Hey, so I have a question about this. The protocol itself only needs 50% plus .00000001 or whatever to pass. Would this just be an internal rule for the dao? Because whatever is in the constitution could just be enacted by like 55% and not need the constitution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MRKWHG",
                    "index": "#36",
                    "likes": "0",
                    "time": "30/06/2022-01:23:00",
                    "content": "additional oversight like with 3AC probably ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#38",
                    "likes": "2",
                    "time": "30/06/2022-01:25:55",
                    "content": "This would be an off chain rule with nothing being executed on chain. So we can set social rules like 2/3s. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#39",
                    "likes": "5",
                    "time": "30/06/2022-02:00:27",
                    "content": "    Hasu:  low accountability to MKR holders.   Respectfully, I beg to differ.  Maker was handed off to us from the foundation as a very successful, high revenue-generating protocol. The inventive structure was rather elegant, although I will admit that smaller holders did not feel heard, and felt comfortable leaving the decision-making in the hands of a few, while they sought yield elsewhere. There was not enough tangible incentive to keep the MKR participating.     Hasu:  If we play our cards right, DAI can become the USD-as-a-service for the next generation of internet users around the world.   Fully agree man, this was, and still is the vision.     Hasu:  there’s an excess of visions   Taking words out of my mouth lol     Hasu:  Should Maker stay isolated to crypto or expand to the real world?   A question I ask myself all the time, but to bring in the real world, you have to integrate it. We were already on the right path with this. Many many years ahead of any other protocol. It was what made MakerDAO unique. Every other project launched in the crypto space has been cloned dozens of times over and gone nowhere. We had something unique, an elegant incentive model:  Untold upside for proper governance:  BURN  Ultimate downside risk for poor governance: MINT   The arranger model alone, years in the making, live, cloneable, and infinitely scalable had us on track to grow exponentially regardless of macro conditions. The revenue from that alone would have sustained growth and burning through any market conditions. Regrettably, we chose to put those efforts on hold, effectively killing our revenue stream. Collectively, we chose to redirect resources toward efforts that not only produced zero tangible results, but our investments in those efforts also drained our treasury. (This was a decision we consciously made while having a perfectly good model that was already live.) Naturally, as the bear market began we continued to remain confused, discussing the same things over and over again. The way our governance was operating? Nothing could ever happen,  -We became a global central bank, run by 4chan.  Without revenue, and with a scary-looking market… pausing burning somehow became a popular idea.  The most crucial incentive structure built into MKR… the only thing that gave it any value whatsoever… removed, and replaced with… ???  Maker was turned into a pure risk asset. Zero upside. Only downside. To this day, MKR has negative value. DAI is fine tho, of course. With a completely broken incentive structure, what followed next was entirely predictable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.876052940115439
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#40",
                    "likes": "6",
                    "time": "30/06/2022-02:02:14",
                    "content": "I just want to try to understand something and make sure I have it right. Are you telling us that this forum post by @Hasu was published on the same exact day as this a16z post, co-authored by @Porter_Smith of a16z, about the same exact topic with the same exact kind of messaging… and you guys didn’t collaborate at all with a16z on this? Is that really the story here?    a16z crypto – 29 Jun 22    The Potential for Democratic Governance in web3 a16z crypto is a venture capital fund that invests in crypto and web3 startups. We back bold entrepreneurs building the next generation of the internet (what many call web3), which unlocks a new wave of creativity and entrepreneurship.  Est. reading time: 18 minutes       ",
                    "links": [
                        "https://a16zcrypto.com/lightspeed-democracy-what-web3-organizations-can-learn-from-the-history-of-governance/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.032941017316017
                },
                {
                    "author_link": "https://forum.makerdao.com/u/auntymary",
                    "index": "#41",
                    "likes": "0",
                    "time": "30/06/2022-02:10:32",
                    "content": "Dear lads, Back in my days, lads that worked in a project were paid for doing work that brought value to the company. There was no “DAO” (what is it again?) back then. The old lady in me is exquisitely curious. How is the work done by these beautiful lads related to what the “DAO” pays them to do? The lady in me is confused. It was indiscreet in my days to ask “how much”, but my grand son tells me the world is changing. How much are these beautiful lads paid to work for the “DAO”?     Hasu:  Thanks to all contributors: @adcv @Aes @SebVentures @Eumenes @hexonaut @teej @luca_pro @MarianoDP @Nadia @pipko   Love & Light, AM ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1923076923076925
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#42",
                    "likes": "4",
                    "time": "30/06/2022-02:14:07",
                    "content": "The intent was to support establishing a centralized board and a corporate structure they have extensive experience managing. This a16z structure is homologous with this structure proposed (the exact same). It would allow smaller whales to collectively elect an executive team to have disproportionate impact to their holdings.     epowell101:  Just a comment that this is consistent - at least as I read it - w/ some suggestions from a post from a16z today on the overall subject: Lightspeed Democracy: What web3 organizations can learn from the history of governance - a16z crypto    This board of director structure and proposal stands to leave the  proposal authors, delegates, and MKR whales to gain personally or financially if enacted. For example, those seeking C suite roles, executive delegate roles, or  executive operations roles. These large MKR holders are concerned with their own influence, which is of course understandable. Yet, to pretend that this structure does not privilege these large maker holders who seek it is disingenuous at best. This structure stands to undermine the community and small MKR holders. It also means that if the largest MKR holder does widely delegate their votes, they will no longer have the ability to protect the system from this outsized external influence. This structure will centralize decision making. MKR Distribution is not uniform Dr. Andrew Hall’s analysis applies to democracies, but the distribution of MKR tokens does not follow the distribution of votes in a democracy. Therefore, claiming this will increase representation is inaccurate in this case. Based on the true distribution of MKR, this plan is likely to centralize power among the conglomerate of whales and leave MakerDAO in a position of perpetual capture. There should be no engagement with such an initiative. Spine It is deeply concerning and shameful that we have delegates, whales, and internal Core Unit members continuing to push this structure after last week. Hiding behind the argument of “merits” over the medium, does not obfuscate the reality here. As Marshall Mcluhan reminds us, “the medium is the message.” Merits Aside from that, there are no merits to creating a centralized board. It does not scale and cuts out the ability for small MKR holders and community members to get involved. There is also a curious absence of the necessary legal and risk anslyses to debate the merits. If the authors are serious about this proposal, I would suggest they put in real time and analysis rather than moonlight here and expect the community to carry the stone.   Screen Shot 2022-06-29 at 9.41.56 PM1200×682 98.5 KB     twitter.com    Hasu⚡️🤖 (is hiring! jobs.flashbots.net) @hasufl  @lex_node @MicahZoltu Okay, I agree. Maker marketing, same as most defi projects, is disingenious. I don't care that things are centralized because I believe in private companies built on public blockchains. But I also stopped saying MakerDAO a long time ago. I just say Maker now.   10:45 AM - 10 Dec 2019           4            ",
                    "links": [
                        "https://twitter.com/hasufl/status/1204351511133925376",
                        "https://twitter.com/hasufl/status/1204351511133925376",
                        "https://twitter.com/hasufl/status/1204351511133925376",
                        "https://twitter.com/lex_node",
                        "https://twitter.com/MicahZoltu",
                        "https://twitter.com/hasufl/status/1204351511133925376"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416588345864661
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#43",
                    "likes": "8",
                    "time": "30/06/2022-02:26:22",
                    "content": "    auntymary:  Dear lads,   This old pirate doesn’t have much opining to do on this subject, but this here lass caught me eye! I’ve sailed the seven seas, and you’re the sleekest schooner I’ve ever sighted. What say ya come grab some grog up in the crow’s nest?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.152777777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#44",
                    "likes": "4",
                    "time": "30/06/2022-02:41:03",
                    "content": "    MadShills:  demonstrates a remarkable lack of awareness.   Lack?    @MadShills, I’m sorry, but I think you really aren’t giving enough credit here. While you may not appreciate it and disagree with the intentions and visions proposed… I think it’s quite clear that there is no lack of awareness. All that happened was a record voter turnout, nothing special. I don’t see what’s so bad about that? More governance participation? It’s what Maker was always lacking, to be honest. The next time there’s 17 random polls… maybe, even more, will participate. That’s true decentralization. : ) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.770408163265306
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#45",
                    "likes": "1",
                    "time": "30/06/2022-05:49:59",
                    "content": "    Hasu:  there is a lack of vision of what Maker should be and a lack of strategy on how it should get there. (Another way of putting this would be: there’s an excess of visions and strategies and no unity about them.)   I believe if this is the case what the dao should do is put more effort in governing the vision and the strategy. Delegates and core unit facilitators should do cross team meetings to coordinate on the best approaches, and put everything to vote for the sake of visibility and discussion.     Hasu:  This is further exacerbated by the continuous nature of Maker governance: if all budget decisions were made at the same time, it would automatically force decision-makers to zoom out & take a holistic view of the budget; instead, budget requests are streaming in every a week, and every decision is made without taking all other budgets in mind.   I believe this could be improved by having tools at hand that show the impact of budgets. Also it would be useful if some core units would comment objectively on other core unit budgets proposals. Core unit presentations should also come with more audiovisual material explaining who is the team and motivations behind core units. (There are already online meetings orgnaized where the core unit is presented to delegates i think, so that also is a good moment to ask questions).     Hasu:  Voting/polling, which has always been informal, is abolished in favor of more local decision-making by the Council and MAs.   Is this all decision-making going to be public? It would only make sense that all the decisions were comunicated openly to Maker holders and the community, in order to showcase that there’s no individual interestests in say, blocking a core unit budget, stablishing a partnership with a friend or other corruption cases.     Hasu:  What should the compensation plan for Council members be? They should probably have clear and measurable objectives, and a large variable pay share tied to them for maximum   Would you be comfortable if no one of the people involved in the creation of this proposal would be available to be elected for the council? (If there are no individual interests at play it should be like that)     MadShills:  This board of director structure and proposal stands to leave the proposal authors, delegates, and MKR whales to gain personally or financially if enacted. For example, those seeking C suite roles, executive delegate roles, or executive operations roles.   Sounds more and more like creating a corporate structure. And in that scenario the ones at the top have a lot to gain.  Being said that, there are a couple of things that i liked about this proposal, saying that no executive will be passed without the approval of MKR holders and trying to find some strategy / vision. But i believe there are other ways to do this in the current status quo without having to go back to be a centralized entity.  Put more checks on Core Units to ensure they deliver what their mandate dictates and quaterly updates on their roadmaps More tools to easily visualize the impact of budgets Do more cross core-unit + delegates meetings to align on vision and strategy Less spending in trivial things not aligned to the Maker core If people want to point in some direction in the strategy, create polls and forum threads or try to unite teams around that vision/strategy instead of creating more power structures. (Seems like now is : I don’t like the current strategy, but instead of trying to fix it i’ll create a power structure so no one can dispute my strategy)  Personally i don’t want to work for a boss, or a team of bosses who decide what is my task, my compensation, my place of work or any other thing. Many of us are here working for a DAO with the purpose of seing a decentralized organization move forward, and working professionaly with the vision of doing the best for the protocol and the users of it. If somehow we had the capability to make sure that the teams are working on that direction, ensuring cross-team communication and making sure no budget usage is “stupid”, that would probably work. But i understand some people have the need to have more tight control on the strategy to make things move faster or more aggresively. Efficiency could be used, but a DAO does not exist for the sake of efficienty, but for the sake of decentralization. My own opinions, and also not set in stone, more a vibe kind of thing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.247825091575091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#46",
                    "likes": "5",
                    "time": "30/06/2022-08:14:37",
                    "content": "As you can see, somme of those idea are as well in the Cryptobank Thinktank. I don’t have any influence on VC (or the opposite) nor do I engage with them. I’ve provided what could be called a constitution , proposed a strategy and a discussion of pro and cons on a dual board system. On the constitution, we don’t have to be dramatic. It’s a piece of paper to record what are the boundaries of actions of MakerDAO. It is not like MKR governance is bounded by its word. But having anything is better than nothing. On the council, while I’m for it, I want to stress how difficult it is to get it right. Its main job is to be a counterpower to CUs and to do the least.  They need to do little to keep an high-level view. While they set the strategy and the budget, it should come from mandated actors. They need to be experienced and have the readiness to act (which means firing a CU facilitator/cutting budgets).  ",
                    "links": [
                        "https://forum.makerdao.com/t/the-cryptobank-thinktank-for-scientific-governance/15838/13",
                        "https://forum.makerdao.com/t/the-cryptobank-thinktank-for-scientific-governance/15838/4",
                        "https://forum.makerdao.com/t/the-cryptobank-thinktank-for-scientific-governance/15838/13"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.184193121693122
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#47",
                    "likes": "12",
                    "time": "30/06/2022-10:04:10",
                    "content": "Does anyone still remember core principles for Maker ? Feels like decades ago … https://blog.makerdao.com/foundation-proposal-v2/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#48",
                    "likes": "3",
                    "time": "30/06/2022-11:07:50",
                    "content": "Thanks for this really well written and deeply thought out proposal. It seems to me that it tries to control the difficulties of decentralization by adding a layer of gatekeepers. At a time when most centralized companies push decisions to the edges and experiment with holacracy and agile systems, your proposal aims to centralize control of a DAO. (!) I’m having a hard time understanding why this empowers MKR holders. They’d just care less. Plus politiking would reign unchecked. The way for decentralized orgs is to stay small, intact and with clean interfaces to the outside world. This is what rune has nailed with his endgame. Whatever other problems there might be there. And I’m sure there are many, the basic design is the one of the soundest I’ve seen in this space. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.572916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#49",
                    "likes": "1",
                    "time": "30/06/2022-11:31:20",
                    "content": "    rspa:  At a time when most centralized companies push decisions to the edges and experiment with holacracy and agile systems, your proposal aims to centralize control of a DAO. (!)   I don’t agree with this characterization, though of course we should discuss the differences. The mental model that I have in mind is: Governance of software wherever possible. For the rest, while it still needs a workforce, align the interests of the humans by having clear and explicit structures that protect the token holder, rather than implicit hierarchies. Over time, it should all converge towards smart contract code. MKR holders are unfortunately not empowered no matter how you cut it. The token holding structure is very concentrated and plutocratic. For what it’s worth, you shouldn’t really need a delegate system with such a concentrated token holder base. Worst-case, it just amplifies the token holder power of large holders by giving them leverage through other delegated stacks. But the system actually works and helps by making the representation of token holder interests more liquid and active, as well as catching small token holder views that are otherwise difficult to represent. It could still continue to be an essential part of governance in the future for this reason.     rspa:  Plus politiking would reign unchecked.   Politiking reigns unchecked today. This proposal buckets it to one window a year when a new Council is elected (or whenever a Council member is replaced).     rspa:  The way for decentralized orgs is to stay small, intact and with clean interfaces to the outside world.   I agree. The specialization described in the Simple Plan incentivizes this. At the moment we have sprawl.     rspa:  At a time when most centralized companies push decisions to the edges and experiment with holacracy and agile systems, your proposal aims to centralize control of a DAO. (!)   EDIT see exchange below. I don’t agree that most centralized companies are experimenting with holacracy. For what it’s worth, holacracy is notoriously difficult to implement and only works in highly idiosyncratic scenarios. Most complex organizations eventually tend towards specialization to stay afloat and/or scale. I also don’t agree that this proposal is aiming to centralize control of a DAO. Quite the contrary, given the starting point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.44790854978355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#50",
                    "likes": "4",
                    "time": "30/06/2022-11:42:31",
                    "content": "    adcv:  For what it’s worth, holacracy is notoriously difficult to implement and only works in highly idiosyncratic scenarios. Most complex organizations eventually tend towards specialization to stay afloat and/or scale.   This to me seems a completely false dichotomy. How is specialization incompatible with decentralized decision making? It is not. There is no need for a single controlling group in order to specialize. Delegates can specialize today by forming coalitions among members with different professional backgrounds. The only difference is: a group like that wouldn’t hold the monopoly on decision making. And monopolizing it, clearly, would be much more centralized. So let’s not confuse things here:   Specialization is perfectly possible in a decentralized system.   A single council/board/director team with a power monopoly is more centralized than having competing groups.   Subscribing to a single vision and strategy is much more centralized than tolerating a plurality of future visions for MakerDAO.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.311428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#51",
                    "likes": "3",
                    "time": "30/06/2022-11:44:38",
                    "content": "    wouter:  This to me seems a completely false dichotomy. How is specialization incompatible with decentralized decision making? It is not.   I agree actually, and I think that is the point of Hasu’s post. In this model, the single controlling group is the group of MKR token holders and their delegates.     wouter:  A single council/board/director team with a power monopoly is more centralized than having competing groups.   The Council as presented above does not have a monopoly on power. The only actual decisions that can reasonably take place are executing executive spells. Token holders can recall Council members at will. Token holders remain in control. This is a sketch of a decentralized but specialized structure imo. EDIT: I will claw back my dichotomy on holacracy vs specialization, which is not accurate as you point out. It was meant to be a specific knock on holacracy as panacea, but is unrelated to specialization, you are correct. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.982142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#52",
                    "likes": "6",
                    "time": "30/06/2022-11:54:59",
                    "content": "    wouter:  There is no need for a single controlling group in order to specialize. Delegates can specialize today by forming coalitions among members with different professional backgrounds.   Anyone can do anything, but what are the incentives?  Delegates only get paid if they vote and communicate on everything. Informal collaboration between delegates + CUs and even CUs + CUs is painted as shady and centralizing – rune went on a giant rant about that on Discord just recently. Concept of working groups equally shot down Now let’s say you do specialize in spite of the financial disincentive AND the social disincentivize, you still run into the problem that your voting power on these issues is the exact same as before.  Sure, expert committees can start giving delegates recommendations on how to vote. And that is basically what my proposal describes, except with clear roles, incentives, and accountability toward a vision + MKR holders at every step. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1687830687830685
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#53",
                    "likes": "2",
                    "time": "30/06/2022-12:22:39",
                    "content": "    Hasu:   Delegates only get paid if they vote and communicate on everything.    If two delegates team up, each can copy the vote of the specialist in the other area. But I do agree that the current setup is optimized for “all-knowing individuals.”     Hasu:   Informal collaboration between delegates + CUs and even CUs + CUs is painted as shady and centralizing – rune went on a giant rant about that on Discord just recently. Concept of working groups equally shot down    I won’t get into who paints what as what, but while I recognize the sentiments you’re describing, it’s my impression that the issue is a perceived lack of transparency more so than groups collaborating. Cross-CU initiatives have been around for a relatively long time now. My own synthesis of the emergent coordination mechanisms is the following:    Core unit on strategic planning   One way of looking at this emergent structure from high-level vision and strategy to practical tasks:  MKR Voter Committees - connect MKR holders and delegates Strategic Initiatives - connect delegates and core units (such as RES) Cross-CU Initiatives - coordination among core units around roadmaps and launch plans (such as L2, CMON, CMOFF, and SEC) Internal CU roadmaps  We (@SES-Core-Unit) have been supporting the formation of these collaboration structures. We are also working on our DAO Performance API and Dashboard which will formally document these elements in one place.       Hasu:   Now let’s say you do specialize in spite of the financial disincentive AND the social disincentivize, you still run into the problem that your voting power on these issues is the exact same as before.    That’s difficult to say, it depends on the voters’ thinking. A delegate X who presents themselves as part of a coalition Y would still collect votes on their own proxy contract. Now the voter arithmetic is the same as political parties:   Some voters may vote for the person X, despite or thanks to their association with Y. If every voter votes like that, the delegates would collect the sum of their individual votes.   Some voters may vote for a random delegate associated with Y because they like the coalition (party vote). These are extra votes.   The same reasoning may go in the opposite direction: not voting for X or Y because the voter is deterred by the associated Y or X. These votes are a net minus.   The bottom line can easily be one where 1 + 1 is bigger than 2. Again, I do agree the governance infrastructure today isn’t optimized for this case and there would definitely be some practical annoyances. Which is why I’m saying: let’s improve our consensus building governance infrastructure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.150848765432099
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#54",
                    "likes": "0",
                    "time": "30/06/2022-14:38:02",
                    "content": "    Hasu:  Delegates only get paid if they vote and communicate on everything.   Delegates can easily vote Abstain with a boilerplate and still receive full compensation though. We’re thinking about that to allow more impact on stuff where we can actually make the best decisions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.559523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#55",
                    "likes": "1",
                    "time": "30/06/2022-14:41:40",
                    "content": "    adcv:  MKR holders are unfortunately not empowered no matter how you cut it. The token holding structure is very concentrated and plutocratic. For what it’s worth, you shouldn’t really need a delegate system with such a concentrated token holder base. Worst-case, it just amplifies the token holder power of large holders by giving them leverage through other delegated stacks.   That is definitely a pain point, and why I think that having a very simple core plus metaDAOs or sibling DAOs and clean interfaces could also help with. But this remains a large pain point even in the endgame plan. I’d love to see a merit-based system that cannot be financialized. Something akin to what some gaming guilds do where more experienced members have more sway and they get some sort of tokens to show for their quests. Or like medals in the military, where if two equally ranked members argue, one with more decorations pulls more weight… One of the most fascinating frontiers of DAO research atm, if you ask me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.18641774891775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leggevents",
                    "index": "#56",
                    "likes": "4",
                    "time": "30/06/2022-15:00:43",
                    "content": "Well, we have tickets for you both at our next event if you fancy a romantic trip to Paris? (PeglegEvents) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#57",
                    "likes": "6",
                    "time": "30/06/2022-19:48:55",
                    "content": "So, based on the confusions I had before the call I’d like to clarify the proposal as I understand it now:   The proposed Council does not have any special privilege or authority compared to any other community member, other than that they receive compensation for their advisory role (and that they are expected to have social authority.)   Any responsibilities really just fit within that advisory role: it’s expected that, given that MKR holders and delegates agreed to pay for the Council, that they are likely to listen to this advise and use it to inform their vote.   The council would use the same mechanisms as anyone else to do their job. For example, hiring and firing of MAs would happen through the usual MIPs process that anyone else has access to. There’s no multisig or anything; the council can’t unilaterally create or drop dssvest streams.   No one is blocked from making competing proposals, or even create competing Councils, not on a UI level and not on-chain (even though that wouldn’t be in the spirit of the proposal, which pleads for unity.) It’s just that outsiders may be ignored if MKR holders and delegates indeed chose to listen to the Council all the time.   I guess the council may at some point propose a number of MIPs that allows them to skip the Governance Polling phase and where some of their proposals (hiring/firing for example) go directly into the executive.   So, if a delegate doesn’t agree with the proposed structure, they could basically just ignore it and continue doing what they’re doing. Although that would work against the intended united action of the proposal. @Hasu is that a fair representation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.23015873015873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#58",
                    "likes": "5",
                    "time": "30/06/2022-20:42:40",
                    "content": "Thanks for the proposal @Hasu From my professional experience, processes and tools enforce habits. If the habit doesn’t exist in an organization and you put a tool/process on top it tends to fail. What we need is: start every proposal, signal request, idea, with 4 elements: what’s the goal, what’s the strategy, what’s the opportunity size, what are the suggested tactics. CUs will implement the tactics/strategies and will get voted on chain and during the executive. Once the DAO starts thinking in terms of the 4 elements above, then we bring a process to standardize, stream line and enforce the basics elements. By that time, the DAO would have created a habit. These habits can be created by just putting a template in the forum for new posts/signal requests or a Google doc with the template in it. We will continue falling if we get proposals such as “D3M protocol X”. That’s at most a tactic/implementation which normally hardly explains which exact goal, opportunity size and potential different/competing strategies can be considered to achieve the same goal.   Hence, governance votes in an incredibly narrow view of the topic, in this, i completely agree with your problem statement. Explicitly defining the 4 elements in a proposal helps succinct communication. if we don’t structure business proposals in such a way, we are adding noise and entropy to the system, as we need to guess the goal and other strategies.  We all need to work to reduce noise and cognitive overhead in the DAO. (Actually, i would say @Hasu did manage to communicate very well the topic in a single clear piece) Ossification: In Blockhain, the only osified element is the one you “can’t” change. The ones you “won’t” change will be changed, meaning not osified. I would suggest we all star using ossification with that exact meaning. I wouldn’t clearly state anywhere the things we won’t change. (Bitcoin and Unstoppable Code: The Difference Between Can't and Won't - YouTube) Constitution: it is easy to think about it as a concept we all understand, but i would take it’s very basic concept and implement it in our Blockhain-decentralized context. Maybe just reach agreement on a set of important values, business areas of interest and use continuous voting to gauge the token holders sentiment and use that as a North Star that is less specific but alive. something along the lines of what @wouter  suggests. MA: mandated actors.  Mandated Actors are more a bug than a feature. There is no MIP definition (i couldn’t find it). I’ve asked and i cannot get a clear definition of which criteria makes you a Mandated Actor. It’s a vestigial element from the Foundation that either gets ratified or dissolved. In @Hasu proposal, Mandated Actors take decisions at tactics levels, i would prefer CU members coordinate to create especialization groups to take decisions over tactics and implementation together. There are technical implementations that can unlock new tactics or even strategies. You don’t want to minimize the cross pollination at such low level, that’s where innovation happens: self organized cross functional teams is the key to success. CU members should feel free to join/create especialization groups that coordinate business areas. Example: CMON, CMOFF, L2. As long as there is a governance decision making artifact, as it happens now.  Council: i would like to achieve delegates especialization through incentives, the voter committee initiative and undelegation forced once a year or so. ",
                    "links": [
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/28"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.369202226345084
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#59",
                    "likes": "1",
                    "time": "30/06/2022-21:55:01",
                    "content": "Speaking for myself and not ISCU. I want to respond narrowly to the Council part of Hasu’s proposal. I do not take a position for or against the proposal as a whole, but I think the Council part of it is poorly conceived.  The Council has a social mandate and C-suite level compensation to form opinions but no ability to make anything happen. On the other hand, Recognized Delegates are regarded as brain-less voting automations that merely make things happen. What is the point of severing the power to act from the responsibility to guide the strategy of the DAO? I suggest that Recognized Delegates are the Council. These roles should be merged, as they are in the status quo. “MKR holders/delegates appoint council members on 1-year terms” – I think this is better addressed by adding MKR compensation on top of DAI compensation for Recognized Delegates. The MKR compensation would use DssVest for a 1 year vesting delay. I think this would achieve the same intent as 1-year terms, but without the baggage of archaic annual elections. Nobody seems to appreciate the liquid democracy innovation that we have implemented here where anybody can be elected or unelected at any time. We can do liquid democracy because we have the blockchain and elections are practically cost free compared to archaic paper ballots. If we need to address the uncertainty that Recognized Delegates feel about their duration of service, we can double or triple the level of DAI compensation, problem solved.  Lastly, I want to point out that adopting my suggestions would make your simple proposal simpler and more feasible to adopt. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.324404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#60",
                    "likes": "1",
                    "time": "30/06/2022-23:02:06",
                    "content": "I would like to make a couple of matters clear on the instance of RWF-001 on the matter. For the avoidance of doubt, views and opinions expressed in this thread by members of the RWF-001 Core Unit do not represent the official instance of the core unit or that of its representative role to the community, its facilitator.  Unless otherwise stated, RWF-001 as a Core Unit remains focused on its mandate of onboarding and risk managing structured finance transactions as requested by Maker Governance and hence is neutral on this topic. Likewise, as a CU RWF is not involved or engaged in any of these informal groups, but individuals in their own individual capacity are free to participate as long as such participation does not impact their core CU contributions or work output related to the CU mandate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RogueTortoise",
                    "index": "#61",
                    "likes": "2",
                    "time": "01/07/2022-02:35:10",
                    "content": "I think a constitution is a good starting point. I understand people feel nervous that a constitution could harden a brand of governance that is antithetical to the founding values of Maker. I think it’s the opposite. This is a free market. Anyone can buy Maker tokens and start voting. If you want to protect a set of values, enshrine it in a constitution now. Whatever protections or rights you are afraid of losing, participate in the process and ask for it now. We have a head start against institutions. VCs and hedge funds are relatively small compared to the big baddies out there. The big banks and investment shops are working on policies and procedures for custodying crypto in a compliant way. Maker’s market cap is under a billion and we’re in a recession. 6,12,18 months from now we can have big institutional funds with lots of available cash start buying Maker tokens and voting on proposals. Whether they want to change Maker or sabotage it to take it off the board, it’s a much bigger threat than the current whale fight. So I think this is a great opportunity while there is a good group of people who genuinely care to codify Maker’s values and ethical responsibilities to DAI holders. This internal political tension is a good pregame for when capital markets really start opening to crypto. I’m not a lawyer, but maybe it’s also possible a constitution could help with regulation concerns. Regulatory agencies care mostly about protecting retail investors. If we have a document that instructs the DAO operation and emphasizes protecting DAI holders, perhaps that can give some cover. If we live in a world where there are billions of DAI giving economic lifelines to people, it’s harder to take it away compared to a scenario where a cohort of future Maker Holder’s execute an action that benefit themselves at the expense of DAI holders or screw something up causing funds to be lost. If someone with legal expertise thinks that’s way off then please share. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.83685064935065
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#62",
                    "likes": "12",
                    "time": "01/07/2022-04:07:14",
                    "content": "I generally don’t think it’s appropriate for me to opine on discussions with a regulatory flair in the DAO given my past position (General Counsel for the Maker Foundation). Yet here it would be wise for contributors to this proposal and their supporters like a16z @Porter_Smith to take heed of @lex_node’s recent tweet (https://mobile.twitter.com/lex_node/status/1542503445394968577) and consider how what you want to do could change the entire project, from what Dai “is” to how flips, flaps and flops function. I’m not sure if you’ve fully grappled with what may come if you’re successful. But maybe I’m wrong. Good luck. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.795454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#63",
                    "likes": "0",
                    "time": "01/07/2022-04:50:31",
                    "content": "    Aes:  Managing bigger DAO transactions like buy buybacks, dividends, DAO-to-DAO partnerships, and token/debt offerings.   To Bri’s point above ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#64",
                    "likes": "3",
                    "time": "01/07/2022-05:15:32",
                    "content": "    Bri174:  change the entire project (e.g., from what Dai “is” to how flips, flaps and flops function).   The whole thrust of this proposal is to change the project the least. No token ICOs, no complex interactions just simple approaches. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#65",
                    "likes": "1",
                    "time": "01/07/2022-07:37:03",
                    "content": "    psychonaut:  The Council has a social mandate and C-suite level compensation to form opinions but no ability to make anything happen. On the other hand, Recognized Delegates are regarded as brain-less voting automations that merely make things happen   To date, Delegates aggregate voting preferences but have little scope to influence the long-term trajectory as the governing process is so ‘liquid’ as you describe. The point is that by introducing a new player you can really focus on task specialization in the governance supply chain. Would disagree with the qualifier ‘merely’ - they would retain all of the actual power in the protocol. Your words regarding the Delegates as brain-less automatons, I do not share the same view.     psychonaut:  I think this is better addressed by adding MKR compensation on top of DAI compensation for Recognized Delegates. The MKR compensation would use DssVest for a 1 year vesting delay. I think this would achieve the same intent as 1-year terms, but without the baggage of archaic annual elections. Nobody seems to appreciate the liquid democracy innovation that we have implemented here where anybody can be elected or unelected at any time.   Of course you’re right that nothing prevents us from leaning into innovations such as liquid democracy. But for the purpose of a protocol that seeks stability for its users, is such volatility desirable? This is what @Hasu alluded to with  ‘slowing down the heartbeat of governance’. At the moment its racing fast. Adding a social construct such as a 1-year term is a way to slow it down. But of course, ultimately, token holders could always recall them at a moments notice so this concept of a ‘liquidity’ is retained as a fail safe. Very good point on MKR vesting as another mechanism that could also be used to achieve similar effects, or in combination with others, as well as with Delegates. Thanks @psychonaut ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3029102841602835
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#66",
                    "likes": "6",
                    "time": "01/07/2022-09:36:36",
                    "content": "    rspa:  That is definitely a pain point, and why I think that having a very simple core plus metaDAOs or sibling DAOs and clean interfaces could also help with.    image1688×872 91.7 KB  Maker’s token holder cap table is highly plutocratic, very much centralized, and it’s not clear that having more meta DAOs would solve this. Rather, it risks exacerbating the principal-agent problem by creating smaller, less accountable and yet equally as risky platforms for the Maker Core. The fundamental theoretical problem with meta DAOs is massive adverse selection and corruptibility. Rune yesterday seemed to make corruptibility a key feature of the Endgame Plan. I believe you can incentivize the system to push corruption out - should it want to, but always leave the choice to the token holder. The simpler the incentives are, the fewer attacks surfaces are available. In Spanish you could use the term Taifa to describe the adverse selection meta DAO outcome, after the splintered Moorish kleptocratic mini-monarchies of the 11-15th centuries. They were parochial and inwardly-focused warlord kingdoms with no accountability and a thinly coherent common platform. They wasted themselves by squabbling amongst each other and allowed the Visigoths to slowly push them out of the Iberian peninsula. Instead, minority interests are better protected through an accountable independent layer of oversight that can propose changes if principal-agent interests fall out of alignment. If MKR holders wish to be plundered, they are still free to replace the Council and allow it.     fig:  I would endorse a document that does such but allows for flexibility to include new emerging product lines or shifting values of the DAO. We need to encourage agility.   Fully agreed but here a simple approach, just common-sense extensions of the existing foundation, can achieve the same outcome with much less risk to the Maker Core.  image1972×1104 297 KB  Conceptually, layers of senior or cordoned-off risk-capital can more appropriately allocate layers of risk on the Maker foundation depending on the type of project envisioned. In this framework, tokenized wholesale RWA lending could be a senior layer of stDAI in the capital stack. You can still do the meta DAOs, or Moonshots, or whatever you want to call them, just providing the infrastructure. You pigeon-hole Moonshots into using Dai from the beginning and by default they must stake some capital first rather than free-ride on the Maker platform with adverse selection. MKR holders could always allocate additional stDAI capital on top if they believe the project is a worthwhile risk. But the project proponents always face first-loss and have something to lose well before the Maker Core starts to bear any significant risk. This is just a sketch of an idea, I’m sure it can be improved. But it already seems like a massive improvement in risk exposure and technical feasibility (no token ICOs, etc) vs meta DAOs, with very very little changes on the existing protocol, which can continue operating unchanged. Thank you both for your constructive feedback. ",
                    "links": [
                        "https://forum.makerdao.com/t/financial-report-2022-11/19096/5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.631045653907496
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#67",
                    "likes": "3",
                    "time": "01/07/2022-09:55:56",
                    "content": "I believe that both proposals do not (yet) face the ultimate most important issue: adverse or constructive selection. Even the most elegant decision making structure fails if good information isn’t incentivised to flow towards decision makers. Traditionally, very concentrated ownership/ control incentivises bad info flowing up because it supports lobbying vs quality - which doesn’t have time to lose and moves somewhere else. This is the Vladimir Putin Decides to Invade Ukraine paradox. You are super smart, super rich, super powerful, but then because of this you incentivises sycophants and ultimately take decision based on adversely selected / poor information, decisions that have adversarial effects for both parties. I have never doubted @rune good faith and ability to vision, but I’ve been sceptical he has been exposed to the best info package. That’s what I tried to do but ultimately those with higher economic incentives had better access, as it always happens. This is what we should avoid on the first place. We should construct IMO a system that incentivises plurality of opinions and fair playing field of ideas, otherwise there won’t be any protection layer to save us. MetaDAOs will be managed by the best connected folks (and not the best collateral), council members will be the most connected folks (and not the most independent). If we don’t incentivise plurality, it’s a castle on water. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.614880952380952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rob",
                    "index": "#68",
                    "likes": "4",
                    "time": "01/07/2022-11:32:22",
                    "content": "    adcv:  thrust of this proposal is to change the project the least. No token ICOs, no complex interactions just simple approaches.   I think maybe this right here is part of why people are talking past each other. The old lawyer guy is saying all these social layers don’t exist for a reason (maybe he or someone can elaborate). The tweet by that other lawyer guy suggests there’s potentially major legal ramifications of something similar to this. I’d like to hear more from both sides about that ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.368409863945578
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#69",
                    "likes": "7",
                    "time": "01/07/2022-11:37:50",
                    "content": "    luca_pro:  This is what we should avoid on the first place. We should construct IMO a system that incentivises plurality of opinions and fair playing field of ideas, otherwise there won’t be any protection layer to save us. MetaDAOs will be managed by the best connected folks (and not the best collateral), council members will be the most connected folks (and not the most independent).   In other words: don’t expect there to be a single vision/strategy or advisory group (council) with a high likelihood of echo chambers forming. Instead, map out the diversity of ideas and build the best governance processes to select the best ones based on merit. Like so:     wouter:  (1) identifying competing visions and strategies and quantifying the MKR support, (2) iterating on governance improvements to maximize the common ground, and (3) work towards an emergent constitution starting from there (I.e. ossification of a universal set of principles)   I understand the urge to try and somehow skip the slow and frustrating consensus building part. The reality is: we won’t be able to, unless we let MakerDAO devolve into a centralized structure because that is the only way to obtain quick alignment. I believe this lies at the heart of the concerns people may have with this proposal: this proposal in itself doesn’t present a centralized structure. However it presents a solution that will only work if it is combined with further centralization. A more realistic view may be that DAOs are by definition political due to their decentralized nature. We will need to build better consensus forming mechanisms if we want to give MakerDAO the ability to present a coherent future vision supported by a majority of token holders. And it won’t be the only one. So, I personally love the way this proposal focuses on the decision making process and does not push for a particular vision in advance. That is one step in the right direction compared to Growth Task Forces. I do think it still needs a couple of iterations to come to terms with the fact that we’re operating in a decentralized environment, and the core challenges related to that. For now it seems to be ignoring that elephant in the room by assuming we’ll be able to somehow come to an agreement once and for all relatively quickly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.067216117216118
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#70",
                    "likes": "1",
                    "time": "01/07/2022-11:48:25",
                    "content": "    wouter:  So, I personally love the way this proposal focuses on the decision making process and does not push for a particular vision in advance   Thank you wouter and indeed that is the point, to try and focus on frameworks and process and then let the community chart the outcome and the specific vision.     wouter:  In other words: don’t expect there to be a single vision/strategy or advisory group (council) with a high likelihood of echo chambers forming. Instead, map out the diversity of ideas and build the best governance processes to select the best ones based on merit.   Would be really interested in hearing more from you around this process. V good perspective ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.85465367965368
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#71",
                    "likes": "0",
                    "time": "01/07/2022-12:10:12",
                    "content": "I agree @wouter, As you know following the vote I don’t represent any core unit nor official role in the DAO. I remain observing what is going on for the alternative proposals with the spirit of dialogue and mutual improvement. We have interacted for months so we know our mutual positions. One thing is clear: we should think carefully and debate intensely the direct and indirect effects of any profound governance change. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.319444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#72",
                    "likes": "7",
                    "time": "01/07/2022-12:49:58",
                    "content": "    wouter:  So, I personally love the way this proposal focuses on the decision making process and does not push for a particular vision in advance. That is one step in the right direction compared to Growth Task Forces.   I’d like to say that this proposal is completely independent of the Task Forces one and not an evolution or anything. As the MIP75 author it was a means to address the bottlenecks I was observing coming up. I am a practical guy, so when I see issues my impulse is to fix them. Task Forces was always a pragmatic half-measure and in retrospect probably should have been pulled instead of sent to vote as it was clearly generating hostilities. I’ll take the blame for that. I know these proposals seem to come from a block of people, but MIP75 was mostly me and this effort is mostly Hasu and Adrian. Writing social-layer stuff is not my interest. Personally I spend (and prefer to spend) most of my time doing coding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.417989417989418
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#73",
                    "likes": "3",
                    "time": "01/07/2022-13:10:36",
                    "content": "Old Lawyer guy?! It’s okay, I’m not offended. fr fr.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#74",
                    "likes": "0",
                    "time": "01/07/2022-14:06:42",
                    "content": "You address some key issues. A constitution has two competing interests: (1) Preservation of key principles, rights and governance process (2) Allowing innovation and adaption, particularly for issues not covered in (1). How does one draw the line between what elements are in group #1 which are quite slow moving and difficult to change versus what elements are in group #2 which is by design more flexible and innovative?  This is a key key question. In terms of a Maker Constitution: (1)  What are the key rights/responsibilities/governance that should be enshrined in a Constitution that are quite sticky and slow moving? (2)  The crypto world is incredibly fast moving and changing and thus Maker needs to be able innovate/adapt to succeed.  How can Maker preserve the key elements in (1) but also still enable innovation in this massive opportunity? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.784313725490196
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#75",
                    "likes": "3",
                    "time": "01/07/2022-16:07:27",
                    "content": "So is this proposal the official position of strategic finance? We see every SF core unit member as a proponent of it on the call yesterday and on this thread. This is getting a little bit ridiculous. Is this proposal the SFCU official position or not? @strat-fin-core-unit You have strategic finance making formal slides, pitches about governance design, product, politics, etc. This in conjunction with a subset of delegates. This is all done in private and not what you are paid to do. Your knowledge to produce these materials only comes from the finance work you are mandated to perform.  Some of that work is parallel and even included in these slides. This is clearly inappropriate. Other MKR holders are confused about what is going on and whether you consider this part of your role and your official position they are paying for. Please Advise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.408854166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#76",
                    "likes": "2",
                    "time": "01/07/2022-17:00:37",
                    "content": "Question: Are SFCU or any other CU members not allowed to propose  ideas to improve governance? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#77",
                    "likes": "1",
                    "time": "01/07/2022-17:04:29",
                    "content": "There is no data here as far as I can tell. You (TRUEMAKER) modified your post but your question was regarding “data driven” proposals.  When a proposal, whether data driven or not, is outside of your mandate, it is probably not appropriate to coordinate as a single whole unit. That of course depends on what a core unit’s mandate is.  Proposals Require Data With regards to the merits of the proposal. I did not find any substantive analysis or empirical basis in the proposal text. This absence makes evaluation of the merits impossible. It also suggests the proposal authors would do best to return when they have provided enough information for us to have an informed discussion. Once we have real data points and an impact analysis, the community may offer critiques on the pros and cons. This approach will yield a productive dialogue rather than a thread of confusion. I may have missed the analysis or data.  If I am wrong, please simply reply here quoted.  Understanding Core Units Returning back, can SFCU please address whether this proposal is the official position of the mandated strategic finance core unit @strat-fin-core-unit? Other CU above have already weighed in definitively above. (PE @Protocol-Engineering and RWA @Real-World-Finance ) Perhaps it is possible to hear the official position of other core unit facilitators as well? For example, @Risk-Core-Unit and @collateral-core-unit, as this proposal would change their operations and some individual contributors may be involved?  Clarifying Mandates For organizational clarity, it makes sense for us to understand how the proposal contributors and their core units view their roles here. Is this proposal official and part of the SFCU mandate or not? If not, where are we drawing the line? If SFCU does believe this is within their mandate, we likely need to review and update the SFCU mandate to get everything into conformance.  Communication Avoids Conflict Without answering these questions we will be unable to disentangle miscommunication and avoid future conflicts. Communication heads off conflict.  We must clarify expectations between core units, MKR holders, and the community. Repairing communication and transparency is the path to rebuilding trust. To fail here, and move forward without clarity, sets us up for unnecessary and continual drama. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.689880952380952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#78",
                    "likes": "2",
                    "time": "01/07/2022-17:07:33",
                    "content": "Thank you for this post and conversation yesterday. I included some reflections in my Delegate Platform update just now, so wanted to share them here as well. FYI all - I have adopted a personal code of conduct “Daverington House Rules” and wanted to distinguish what I think we’re talking about here in terms of a constitution. Also, I am holding ACREinvest office hours next Wed, 6 July to answer questions about the MIP55 Chief Legal Officer proposal. I saw some questions in the event chat yesterday and someone may have posted here wondering if there is a connection (no!) or has there been private coordination between myself and @Hasu (no!) or was any VC involved in directing my proposal or desire to serve (no!). Details in the post: ACREinvest Delegate Platform - #28 by ACREinvest One urgent issue we don’t spend enough time on at MakerDAO is the social/human dynamic of what we do here and how. I believe membership in the Council should have requirements about reputation and character that demonstrate members have sufficient EQ to understand and support the most sophisticated and advanced technology asset we have here - the HUMAN SPIRIT.  What is emotional intelligence or EQ? Emotional intelligence (otherwise known as emotional quotient or EQ) is the ability to understand, use, and manage your own emotions in positive ways to relieve stress, communicate effectively, empathize with others, overcome challenges and defuse conflict. Emotional intelligence helps you build stronger relationships, succeed at school and work, and achieve your career and personal goals. It can also help you to connect with your feelings, turn intention into action, and make informed decisions about what matters most to you. Emotional intelligence is commonly defined by four attributes:   Self-management – You’re able to control impulsive feelings and behaviors, manage your emotions in healthy ways, take initiative, follow through on commitments, and adapt to changing circumstances.  Self-awareness – You recognize your own emotions and how they affect your thoughts and behavior. You know your strengths and weaknesses, and have self-confidence.  Social awareness – You have empathy. You can understand the emotions, needs, and concerns of other people, pick up on emotional cues, feel comfortable socially, and recognize the power dynamics in a group or organization.  Relationship management – You know how to develop and maintain good relationships, communicate clearly, inspire and influence others, work well in a team, and manage conflict.   I’m supportive of a new effort to create a community/MKR holder ratified constitution-like document, but this should NOT be a Code of Conduct or set of rules for community member behavior. ",
                    "links": [
                        "https://www.helpguide.org/articles/mental-health/emotional-intelligence-eq.htm"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9934269162210345
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#79",
                    "likes": "5",
                    "time": "01/07/2022-17:15:08",
                    "content": "If anything, high EQ seems like a handicap when interacting with the Maker community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#81",
                    "likes": "0",
                    "time": "01/07/2022-17:57:31",
                    "content": "At a professional level, maintaining a balanced EQ is quite beneficial for the community, but it is extremely difficult, although conflict will always be necessary for a feedback of ideas, the EQ should not be excessively high because it would create a dosile community that is guided by a single vision that it may not be of benefit to the community, just imagine a community that does not have conflict and say yes to absolutely everything, practically we are at the mercy of a single thought and it is not healthy ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.729464285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#82",
                    "likes": "0",
                    "time": "02/07/2022-13:02:54",
                    "content": "A quick idea I got after Call, why don’t we use quadratic voting for governance, then several smaller voters would have a larger power ratio and for some whales it would be harder to assert themselves dictatorially, but the advantage of high gas prices, so that the whales do not simply fragment their holdings, could be applied to delegates. In the conversation it came up as well as often in this discussion. To quadratic voting I have found here nothing ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.280952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#83",
                    "likes": "6",
                    "time": "02/07/2022-13:25:32",
                    "content": "Big fan of quadratic voting, but unfortunately it requires some degree of Sybil resistance to work. Big holders would be able to split their MKR to several accounts to defeat the point. I’m very hopeful that some form of decentralized identity will emerge in the not too distant future, and we can start experimenting with more elaborate mechanisms to protect small holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.386363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#84",
                    "likes": "1",
                    "time": "02/07/2022-19:36:07",
                    "content": "    hexonaut:  Big fan of quadratic voting, but unfortunately it requires some degree of Sybil resistance to work   True, it opens up a larger workspace. Still not unattractive, even if the gas costs for individual are expensive, this effect just comes out bigger for a whale, making it all the more unattractive for a Sybil attack to take place. If a whale decides to perform its vote fragmented also costs him X times. Making the effort are also an additional obstacle. Find it super exciting how this could be approached     hexonaut:  decentralized identity   A true game changer ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.180555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#85",
                    "likes": "3",
                    "time": "04/07/2022-18:39:47",
                    "content": "I was watching the recording of the call and I disagree to a conceptual element, at least based on my understanding from the call. In the call, it was mentioned that The Maker Council would propose a Spell for the next executive cycle and delegates and token holders to vote on it, or reject it for another different spell. To me, this feels very top-down and micro management approach on contributors when I compare it to a “Release Train” deployment approach. I understand our executive cadence as a release train: the development teams add to the Executive Spell the code that is ready to be deployed (readiness definition in this case is a mix of technical + governance process completion). If a tech team feels they prefer to wait one or more executive cycles, so be it. They are the ones closer to the code, to the readiness and are in fact the ones taking the final decision on adding their code base to an Executive Spell or not, not a Maker Council. Maker Council should wait and tech teams deliver when ready. The proposal starts bottom-up, not top-down. The Maker council, or other stakeholders in general, must provide prioritization at a high level based on a set of inputs: goals, strategies, opportunity size, effort estimations or risk mitigation urgency, but once a priority is set at high level, it is up to the teams on the ground to agree on readiness and propose an Executive Spell. My preferred approach would be that The Maker Council or other stakeholders must agree on prioritization frameworks, on business proposal frameworks, on strategies to be raised for voting, but not be closely involved on Executive Spell granularity level. Lastly, let’s remember that anyone could potentially craft a Spell, so even if the Maker Council would be “the decision maker” on Executive Spell scope, the permissionless ness of our protocol would not allow for that in its current state. Happy to hear your thoughts ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.242105263157894
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#86",
                    "likes": "2",
                    "time": "06/07/2022-05:17:50",
                    "content": "    M_C:  My preferred approach would be that The Maker Council or other stakeholders must agree on prioritization frameworks, on business proposal frameworks, on strategies to be raised for voting, but not be closely involved on Executive Spell granularity level.   It is exactly my understanding of the Council. One of the main issue at MakerDAO is that the system tends to absorb all governance bandwidth on low priorities. For example, the Council could say, go full ahead RWA, get stuff done and wouldn’t care about HVB or SocGen per se (to the extend that nothing crazy comes out of it). The analysis level should be more of profitability vs crypto alternatives, speed of scale, private credit vs public credit, … ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.300925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#87",
                    "likes": "8",
                    "time": "13/07/2022-11:00:17",
                    "content": "Thanks everyone for the spirited discussion. I’ve gone through the thread and call to collect what I see as the most substantive question, and answer them to keep the discussion flowing. Please let me know if I missed anything.  Disclosures  As I also lay out here and here, I have been doing this work for free and without expectation of future profits. I have no plans, nor have I had any plans, to join the Council I am proposing. The same is true, to my knowledge, for my co-contributors (although our excellent stratfi CU today is doing some of the work that I’d envision the council to do)   List of FAQs  What is the role of the Council? What is the interface between Delegates and the Council? Can’t the Delegates just be the Council? What is the interface between MAs and the Council? Who decides the composition of spells? How does this proposal address the problem of governance apathy? Who sets the vision? How does the Simple Plan protect minority holders? How complicated will the Simple Plan be to implement?   What is the role of the Council?  I think the most pressing jobs for the Council are to set a high-level strategy for Maker, then design Maker’s balance sheet (asset side + capital structure) to maximize the likelihood of realizing our strategic goals. The way it does this is by making high-level budget allocation decisions The Council has no formal decision-making power — that stays entirely with MKR holders and delegates. Everything the Council suggests is sent to voting as MIPs/SRs The important part isn’t that only the Council can do these things but that there is now a party who is explicitly responsible for thinking about a strategy and budget from a holistic place, and in this role it is accountable to the DAO. So I think of it as division of labor in governance, not as introducing hierarchy   What is the interface between Delegates and the Council?  The role of the Council is to propose strategic + budget + personnel changes in the form of MIPs/SRs. These are then sent to delegates (and other MKR holders) to vote on Delegates will remain a valued and important part of the governance system but it would change from a role of low-level decision maker to a role of active oversight Delegates are entrusted to represent MKR holder views in selecting the right members of the Council and providing ultimate oversight to their activities and performance They are, and anyone still is, free to submit their own MIPs and SRs as today   Can’t the Delegates just be the Council?  The reason a Council should be a separate group from Delegates is that someone needs to watch the Council and approve all changes before they go on chain, and that would be the role of MKR holders and their Delegates The Simple Plan establishes an explicit separation of proposal and decision, which increases (not decreases) accountability If, for instance, the Council were also Delegates and represented a commanding amount of MKR itself, their power would be much greater than if they could only create MIPs, and needed token holders to review and ratify them   What is the interface between MAs/Core Units and the Council?  The Council sets a strategy and a high-level budget for Maker. The MAs should steer Maker in accordance with that strategy but are otherwise left greater freedom to execute than today This is because in tandem with introducing an independent Council, you can replace manual governance processes to approve work, that we largely operate on today, with process-driven governance that relies on ultimate approval/disapproval from MKR holders In return for the greater freedom, the Council can evaluate the performance of MAs and Core Units and can recommend their hiring & firing independently   Who decides the composition of spells?  The spell is created entirely by MAs and their CUs. There is huge potential in the local knowledge sitting inside CUs and even more that can be unlocked by cross-CU collaboration. From there, the spell is sent to MKR token holders and delegates to vote on In the past, the community has been allergic to CU collaboration or CUs making clear recommendations what to prioritize - we explicitly want to turn this on its head and empower CUs to drive the day-to-day of the protocol This is welcomed provided there is independent accountability to MKR holders on CU performance The community and third-parties could and should also be free to submit their own spells in a bid to increase protocol decentralization   How does this proposal address the problem of governance apathy?  The Simple Plan reduces the number of operational decisions MKR holders have to make. Their most important decision becomes electing and overseeing the Council rather than deciding the day-to-day of the protocol It’s much easier to engage token holders to vote for their desired candidate, than to get them to stay informed on dozens of complicated decisions per week. If other representative governance systems are any guide, the result is more participation, more oversight, and less risk of capture by special interests, in spite of making fewer formal decisions   Who sets the vision?  The most important aspect of the Simple Plan is to start from the beginning and make sure a foundational vision is set by token holders & Delegates How this vision-setting process takes place, or what specific vision ends up emerging, is less important than having one in the end There are many ways to execute this vision-setting process, for instance:  You could take many competing visions and have them read from each other and exchange in a vigorous and meritocratic debate. Then host a voting process, perhaps even including Dai holders and borrowers Another way to do it is with groups of individuals having a go to write it, who might not even need to hold MKR. Some cross-CU initiatives are already in place that resemble what this process could look like, e.g. the Resilience Improvement Initiative      How does the Simple Plan protect minority holders?  Simple Plan goes even further than we are today for minority protection Firstly the ESM is not going anywhere - the Simple Plan makes no changes to the core protocol The Constitution codifies explicitly what is and isn’t appropriate to change via governance, and thereby hardens the DAO against governance attacks The council would drastically remove the ability for special interests to get proposed passed due to voter apathy, which tends to be the biggest risk for minority MKR holders Finally, the Council can have independent parties, who might not be MKR holders, and provides a counterbalance to an echo chamber of large token holder views Focus is to keep governance programmatic and leave as much untouched as possible   How complicated is the Simple Plan to implement?  The Simple Plan looks at what minimalist additions are possible to the existing governance structure to maximize accountability and overlays them with minimal changes to governance, no changes to the core protocol, and no changes in tokenomics The Simple Plan is the result of looking at core governance issues that have stemmed from a lack of vision and a lack of accountability, and aims to tackle them by building up from common sense first principles Practically speaking, I would recommend starting with creating a constitution, because it strikes me as an improvement with no downsides no matter what plan (Endgame, Simple plan, etc.) is ultimately enacted.  ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-reset-delegation-metrics-for-hasu/16533/26",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/87#what-is-the-role-of-the-council-3",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/87#what-is-the-interface-between-delegates-and-the-council-4",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/87#cant-the-delegates-just-be-the-council-5",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/87#what-is-the-interface-between-mascore-units-and-the-council-6",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/87#who-decides-the-composition-of-spells-7",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/87#how-does-this-proposal-address-the-problem-of-governance-apathy-8",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/87#who-sets-the-vision-9",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/87#how-does-the-simple-plan-protect-minority-holders-10",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/87#how-complicated-will-the-simple-plan-be-to-implement-11",
                        "https://forum.makerdao.com/t/dao-resilience-improvement-initiative-status-update/16413"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.767925561029009
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#88",
                    "likes": "0",
                    "time": "13/07/2022-16:16:33",
                    "content": "    Hasu:   As I also lay out here  and here , I have been doing this work for free and without expectation of future profits.    Important to note you cited this work as evidence of the value produced when asking for your special treatment on the other thread request for compensation. Why not put an SPF together or contract a CU if you want to get paid for this “research”? ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-reset-delegation-metrics-for-hasu/16533/26"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.032142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#89",
                    "likes": "2",
                    "time": "13/07/2022-16:20:36",
                    "content": "Thank you for this summary and outline @Hasu. We co-sign with strong ++++ everything you say here. One question about the “constitution”: Would framing the exercise as drafting a new whitepaper (Whitepaper 2.0) work equally well from your perspective? For the benefit of those considering ACREinvest’s MIP55 proposal to engage @DaveringtonPLLC and have Kianga Daverington serve the community full-time for 6 months in the role of an Interim Chief Legal Officer, we have posted the video of last week’s office hours where Kianga talks about how she sees the limited “special purpose” role interacting with this “Simple MakerDAO” plan. The 6-month role would potentially overlap nicely with the selection and implementation of the council, and serve to provide specific stewardship and cross-DAO coordination across the numerous legal and regulatory initiatives underway, provide support to lawyers already engaged by the DAO and additional outside counsel that might need to be engaged, as well as assist MKR holders and delegates in evaluating current real-time issues of a legal, compliance and regulatory nature that would be crucial inputs for making strategic decisions. MIP55c3-SP5: Interim Chief Legal Officer - #66 by ACREinvest Kianga will not be seeking a role on the Council if this Simple MakerDAO plan is adopted, but would continue in her role leading ACREinvest as a Recognized Delegate whether or not the MIP55 proposal is approved next month. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.527296777296778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#90",
                    "likes": "0",
                    "time": "13/07/2022-16:26:10",
                    "content": "The question regarding the CLO role was explicitly asked during the live session. The reply from AES was that there was no room and no CLO role was contemplated. It does not fit with the structure and not a DAO oriented solution. Has that changed, @Aes ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.840909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#91",
                    "likes": "0",
                    "time": "13/07/2022-16:34:35",
                    "content": "    ACREinvest:  For the benefit of those considering ACREinvest’s MIP55 proposal to engage @DaveringtonPLLC and have Kianga Daverington serve the community full-time for 6 months in the role of an Interim Chief Legal Officer, we have posted the video of last week’s office hours where Kianga talks about how she sees the limited “special purpose” role interacting with this “Simple MakerDAO” plan.   Why do you keep referring to yourself in the 3rd person? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.1607142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#92",
                    "likes": "3",
                    "time": "13/07/2022-16:57:58",
                    "content": "    Hasu:   Practically speaking, I would recommend starting with creating a constitution, because it strikes me as an improvement with no downsides no matter what plan (Endgame, Simple plan, etc.) is ultimately enacted.    I agree with this observation. Forgive my forum absence (trying to catch up) but, it seems like the DAO-structure conversations going on here are not zero-sum but have more parallel features. Facilitating larger discussions to steward more cohesive alignment seems like a win for the DAO, and kind of what is happening in the DAO operations (formerly Resilience Improvement Initiative ) already. More practical questions if you’d humor me:  Is there an ideal size to the council? Could we start with two that compete and reduce? You mention not being a delegate and on the council, it would be possible to migrate between responsibilities correct? Assuming elections etc.      Hasu:  I think of it as division of labor in governance, not as introducing hierarchy   Underrated. Though I’d be remiss if I didn’t say it still seems like it introduces hierarchy (reading that map again). Perhaps unpacking the election part might help? also, is the deck from your call available somewhere? the map of functions to me is the most important bit. As a DAO we’re missing critical functions like strategy so would like to understand those functions/outputs/controls more. @adcv maybe? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.346875000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#93",
                    "likes": "0",
                    "time": "13/07/2022-17:07:35",
                    "content": "I think it’s a way to formalize? Also saw other delegates that are under entities do something similar     ChrisBlec:  Why do you keep referring to yourself in the 3rd person?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#94",
                    "likes": "4",
                    "time": "13/07/2022-17:14:57",
                    "content": "ACREinvest is a third person, a business entity providing delegate services to the community. Kianga is the founder and a natural person. @DaveringtonPLLC is also a third person, a New York legal practice. So, given the separate legal reality of the three related parties and different roles being performed and proposed here, there are some communications where it is clarifying and helpful to use “we” when posting as ACREinvest - although often Kianga is speaking and uses the pronoun “I” - which in context legally speaking refers to the actions and views of ACREinvest, the firm (unless otherwise specified). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.318181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#95",
                    "likes": "3",
                    "time": "13/07/2022-17:45:39",
                    "content": "But there is a human named Kianga doing all of the typing. Yes? Just want to confirm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#96",
                    "likes": "1",
                    "time": "13/07/2022-17:46:40",
                    "content": "There are no traditional executive positions in the proposed plan. I don’t want to speak for all contributors, but I believe the Council should be multi-disciplinary and consist of various experts in their respective fields. Given the legal and regulatory uncertainty in the space, I believe the DAO would benefit strongly from having a Council member with a legal/regulatory background, ideally with a broad understanding of the global regulatory landscape for the web3 industry and how MakerDAO can best position itself to ensure the protocol and DAO contributors are operated within legal bounds and protected. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.397916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#97",
                    "likes": "1",
                    "time": "13/07/2022-17:53:00",
                    "content": "Does a law firm representing a single delegate fit that model? The title of a CLO seems again to miss the mark (no pun intended). We already have a legal incubation unit that has been diligently working for a fraction of the proposed cost. I would put MKR down to vote layerzero on a council before someone who is also a delegate and has yet to deliver any substantive value. I want to reiterate here – a single council is not the way to go, and based on the live call, the implementation and analyses require to understand the risks are sorely lacking. Rune’s model will leverage the positive aspects of this proposal without sacrificing decentralization. We should seek to take what we like from the centralized model and port it over without losing the decentralization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.29076479076479
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#98",
                    "likes": "1",
                    "time": "13/07/2022-17:57:38",
                    "content": "Are you posting in right thread? As I mentioned above, there is no “CLO” in this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#99",
                    "likes": "1",
                    "time": "13/07/2022-18:00:03",
                    "content": "Referencing the post above on thread which muddied my understanding. I am trying to get clarity. There is confusion about how these various proposals relate. We need to clearly draw boundaries on the proposals and it is important for the various authors and contributors to explain how they relate, etc. That is all. Thanks     ACREinvest:  For the benefit of those considering ACREinvest’s MIP55 proposal to engage @DaveringtonPLLC and have Kianga Daverington serve the community full-time for 6 months in the role of an Interim Chief Legal Officer, we have posted the video of last week’s office hours where Kianga talks about how she sees the limited “special purpose” role interacting with this “Simple MakerDAO” plan. The 6-month role would potentially overlap nicely with the selection and implementation of the council, and serve to provide specific stewardship and cross-DAO coordination across the numerous legal and regulatory initiatives underway, provide support to lawyers already engaged by the DAO and additional outside counsel that might need to be engaged, as well as assist MKR holders and delegates in evaluating current real-time issues of a legal, compliance and regulatory nature that would be crucial inputs for making strategic decisions. MIP55c3-SP5: Interim Chief Legal Officer - #66 by ACREinvest   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.533834586466165
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#100",
                    "likes": "1",
                    "time": "13/07/2022-18:13:01",
                    "content": "I’m assuming you’re referring to ACREinvest’s CLO post - this proposal has no relation to it. I’m not sure what you’re suggesting. You seem to imply that ACREinvest would be interested in sitting on the Council, which we have not discussed with ACREinvest. ACREinvest also said they were not interested in the role in the most relevant part of the quote you excluded above.     ACREinvest:  Kianga will not be seeking a role on the Council if this Simple MakerDAO plan is adopted, but would continue in her role leading ACREinvest as a Recognized Delegate whether or not the MIP55 proposal is approved next month.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.484375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#101",
                    "likes": "0",
                    "time": "13/07/2022-18:18:44",
                    "content": "Thanks for the clarity. To be honest, I am simply confused what the structure looks like if both are approved. I also think we should work together to pursue a decentralized version that actually evaluates the implementation, not just  a proposal idea. The devil is in the details so until we have a concrete implementation to evaluate the threads will probably be less productive. IIUC If both were implemented:  There is one council, and there is a CLO floating off in the distance advising a single delegate? Are they are offering opinions to the council?  Trying to understand for Kianga’s sake, otherwise there will just be a pile of money being burned and low efficiency of the spend. Also unclear what it means if the CLO only represents her other delegate entity? Is that acceptable from the DAO perspective? Is there some analysis or thinking that establishes this is truly the best path, compared to something like what SES is doing? I understand this seems somewhat orthogonal but it is also very much related, by defining the boundaries each counterpart becomes well defined. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.49454365079365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#102",
                    "likes": "0",
                    "time": "27/07/2022-19:59:04",
                    "content": "The comment above was to clarify for the community that neither ACREinvest nor Kianga was or would be seeking a permanent full-time role on the Council. There were questions in light of CLO proposal as to what our intentions were regarding a Council position. The comment about “overlapping nicely” simply meant that had the proposal been submitted and approved, and there was also traction in this proposal or others, then the CLO role could work to assist the implementation of the Council, constitution or whatever comes out of this conversation. cc @MadShills     Aes:  You seem to imply that ACREinvest would be interested in sitting on the Council, which we have not discussed with ACREinvest.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving clarification on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bruno",
                    "index": "#103",
                    "likes": "3",
                    "time": "09/08/2022-03:19:47",
                    "content": "Based on the ideas discussed here, I was curious on how DAO governance could take advantage on lessons learned from corporate governance. How the good practices there could be adapted to the DAO reality. By writing the article below, I hope to contribute to the discussion and bring one more perspective on the improvement of DAO governance systems. Thanks @SebVentures for the comments on the article.    cryptokailash.substack.com    What DAOs can learn from Corporate Governance? Hello Kailashers, let’s talk about DAO governance today. One of the most relevant DeFi protocols, MakerDAO, is under an interesting discussion on how to improve the community decision-making process by creating a constitution and establishing a...      ",
                    "links": [
                        "https://cryptokailash.substack.com/p/what-daos-can-learn-from-corporate"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#104",
                    "likes": "0",
                    "time": "08/11/2022-09:20:24",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}