{
    "poll_list": [
        {
            "title": "Inclusion Poll for Staking Rewards (MIP49) - May 10, 2021",
            "index": "6331",
            "option": "No",
            "supporting_mkr": "69,665",
            "highest_fraction": 0.84
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip49-staking-rewards/6331",
            "title": "MIP49: Staking Rewards ",
            "index": 6331,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "voting",
                "mips",
                "tokenomics",
                "rewards"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "21",
                    "time": "03/02/2021-14:58:52",
                    "content": " MIP49: Staking Rewards  Preamble MIP#: 49 Title: Staking Rewards Author(s): Payton Rose (@prose11), Sam MacPherson (@hexonaut) Contributors:@LongForWisdom, @juan, @Elihu Type: General Status: Rejected Date Proposed: 2021-02-03 Date Ratified: <yyyy-mm-dd> Dependencies: Replaces:   References  The initial idea for Staking Rewards can be found in this forum post    Sentence Summary MIP49 proposes the creation of Staking Rewards that would allow the Maker community to reward MKR holders for locking their MKR tokens in Governance.  Paragraph Summary This MIP covers the creation of a Staking Rewards process for MKR token holders, designed to distribute DAI as a percentage of protocol profits. MIP49 would entitle MKR holders to a share of this percentage based on the weight of their MKR staked in the Governance Contract. The implementation method is intentionally left open so that the protocol can adopt a more efficient method of distributing rewards, should one be developed.  Component Summary MIP49c1: Staking Rewards Structure Defines the scope of Staking Rewards. MIP49c2: Adjusting the Staking Reward Percentage Parameter Clarifies how changes may be made to the Stake Reward Percentage parameter. MIP49c3: Potential Risks Defines potential avenues for abuse that should be considered if Staking Rewards are enabled.  Motivation The main motivation for this proposal is to help secure the MakerDAO Protocol. The amount of MKR available to borrow on the open market remains a security concern. MKR token borrowers do not have economically aligned incentives with the Maker Protocol, and represent a danger even if there is not enough MKR available on the lending markets to pass a malicious action. By offering incentives to MKR holders who lock their MKR tokens in Governance, this proposal hopes to encourage MKR holders to participate in securing the protocol. The following outcomes are also expected:  It should provide a more direct value accrual mechanism compared to the burner by distributing assets to MKR holders engaged in Governance. It should encourage more members to participate in the governance process, as the opportunity cost from locking MKR tokens is reduced. It should act as a partial subsidy to the gas cost of participating in Maker Governance.   Specification / Proposal Details MIP49c1 - Staking Rewards Structure Staking Rewards will be “opt-in”. Users locking their MKR tokens in governance will be able to choose to either receive Staking Rewards or not. The Staking Rewards will be distributed in DAI. The amount of DAI distributed as Staking Rewards will be directly tied to the MKR burn, with a portion of DAI that would have been used to buyback and burn MKR being diverted to Staking Rewards. The percentage of funds redirected will be controlled by Governance and referred to as the Stake Reward Percentage parameter. Proceeds from the Stake Reward Percentage will be split among opted-in holders, based on their relative weight in the Governance Contract. Note: MKR holders should be aware of any tax and legal implications in their jurisdiction relevant to opting-in to Staking Rewards before electing to do so. MIP49c2: Adjusting the Staking Reward Percentage Parameter The Stake Reward Percentage parameter will be expressed a percentage, between 0 and 100, and will dictate what percentage of funds otherwise destined for the flapper (surplus auction) will be instead spent on Staking Rewards. For example, if Governance were to set Stake Reward Percentage to 25%, for every 100 DAI the protocol generates when the Surplus Buffer is full, 25 DAI would be diverted to reward MKR tokens staked in the Governance Contract. Adjustments to the Stake Reward Percentage parameter may be made through the Weekly Governance Cycle, allowing for the community to respond quickly to changing market conditions. MIP49c3 - Potential Risks Directly rewarding locked MKR in the governance contract introduces risks to the Maker Protocol that have the potential to result in a protocol shutdown or a fork in certain scenarios. At the time of writing, actively-voting MKR comes to at most 10% of the total vote weight. The introduction of voting rewards encourages more MKR to be locked in the governance contract, which in turn reduces the barrier for that MKR to vote. If enough MKR becomes active in governance solely due to the staking reward incentive, this introduces the risk of successful proposals that increase the staking reward beyond what is beneficial for the Maker Protocol in pursuit of immediate, short-term gain for MKR Holders. This outcome could happen gradually or more quickly, and could take a number of forms. It is strongly recommended that MKR Holders that wish to ensure the long term growth and stability of the Maker Protocol view the following types of proposal with skepticism:  Proposals that increase the percentage of surplus revenue that is diverted from MKR burn to Staking Rewards. Proposals that seek to detach Staking Rewards from the surplus revenue generated by the MKR Protocol. Proposals that mint MKR for distribution as Staking Rewards. Proposals that by other means increase Staking Rewards in an inflationary way.  It is essential that the Staking Reward mechanism maintains the incentive alignment between MKR Holders receiving the reward, passive MKR Holders and the Maker Protocol as a whole. ",
                    "links": [
                        "https://forum.makerdao.com/t/discussion-activating-mkr-staking-rewards/7480",
                        "https://forum.makerdao.com/t/exit-polling-mip49-staking-rewards-informal-poll/8054",
                        "https://forum.makerdao.com/t/weekly-mips-update-32/7464",
                        "https://forum.makerdao.com/t/delegate-compensation-informal-poll/10042/6",
                        "https://forum.makerdao.com/t/working-group-autonomous-makerdao-closed/8320",
                        "https://forum.makerdao.com/t/maker-relay-ep-45-en-espanol/8141",
                        "https://forum.makerdao.com/t/maker-relay-ep-45/8127",
                        "https://forum.makerdao.com/t/mip41c4-sp12-govalpha-facilitator-onboarding/7994",
                        "https://forum.makerdao.com/t/consider-voting-for-mip49-staking-rewards/7988",
                        "https://forum.makerdao.com/t/maker-relay-ep-44/7974",
                        "https://forum.makerdao.com/t/discussion-activating-mkr-staking-rewards/7480/52",
                        "https://forum.makerdao.com/t/weekly-mips-update-34/7668",
                        "https://forum.makerdao.com/t/weekly-mips-update-33/7573",
                        "https://forum.makerdao.com/t/informal-poll-increasing-the-sourcecred-payments/7489/34",
                        "https://forum.makerdao.com/t/weekly-mips-update-31/7232",
                        "https://forum.makerdao.com/t/weekly-mips-update-30/7083",
                        "https://forum.makerdao.com/t/weekly-mips-update-29/7000",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/weekly-mips-update-28/6791",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/weekly-mips-update-27/6649",
                        "https://forum.makerdao.com/t/know-your-mip-06-governance-rewards-friday-february-19th-18-00-utc/6615",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-feb-7th-2021/6469",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/16",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-127-thursday-february-4-17-00-utc/6261/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589/7",
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890/27",
                        "https://forum.makerdao.com/t/against-the-burn/13412/27",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684/42",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684/36",
                        "https://forum.makerdao.com/t/delegate-compensation-informal-poll/10042/77"
                    ],
                    "GPT-summary": "MIP49 proposes the creation of Staking Rewards that would allow the Maker community to reward MKR holders for locking their MKR tokens in Governance. The proposal aims to encourage MKR holders to participate in securing the protocol and provide a more direct value accrual mechanism. The Staking Rewards will be distributed in DAI, and the amount of DAI distributed will be directly tied to the MKR burn. The proposal also outlines potential risks and clarifies how changes may be made to the Stake Reward Percentage parameter. The post includes a detailed specification of the proposal and its components.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Community and engagement",
                        "Privacy, Security and risk management",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.926237161531279
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "03/02/2021-15:10:33",
                    "content": "Nice! Is this based on a Weighted Average? Also, retrospective to previous lock-participation, or irrelevant?     prose11:  It will be up to Maker Governance to determine the percentage of surplus revenue to be set for rewards   What is the opinion of the Working Group? What numbers were spoken? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "5",
                    "time": "03/02/2021-15:37:07",
                    "content": "So the idea here is to let the community debate having Governance Rewards and then if it is approved, have the community propose the specifics. There are a lot of potential implications so I don’t want to get too far ahead of myself and start throwing out numbers that may or may not make sense by the time we are able to implement them. With that said, the general discussion has been around utilizing something like the Keg to stream rewards based on a percent of the “profit” (really excess revenue to operational actions) that would otherwise be headed to the Flapper. With the intention that the rate is proportional to the amount of MKR on the borrow markets. That way when the Hat is potentially vulnerable (ie there’s a lot of MKR out there to borrow from) MKR holders are fiscally encouraged to deposit their tokens in governance, and that incentive would decrease as the MKR on the borrow markets dried up. All just hypothetical at this point, but I thought that was a good question and that it might inform votes to know how this is being thought of in terms of utilization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#4",
                    "likes": "1",
                    "time": "03/02/2021-15:45:07",
                    "content": "Also I’m still not always entirely sure what I’m doing with markdown so I’m sorry the tags went away when I edited the preamble. Huge thanks to @hexonaut for proposing this idea and writing potential code for it! Sam helped a lot with the editing to this proposal and it would not have been possible without the feedback and suggestions from @LongForWisdom, @juan, and @Elihu! I hope it goes without saying, but just to be clear any mistakes are my own and this would be a mess of a MIP without all these fine, smart people taking time to help improve it  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is thanking contributors and acknowledging their help.",
                        "Author of proposal is giving credit to contributors.",
                        "3rd party giving entirely positive feedback on proposal.",
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.798160173160173
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#5",
                    "likes": "1",
                    "time": "03/02/2021-15:53:13",
                    "content": "The proposal is great and offers a very tangible way of encouraging people to participate in Maker Governance. I’m hoping to see some interesting discussions in this thread. Thank you for your work, @prose11! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "1",
                    "time": "03/02/2021-16:20:02",
                    "content": "Votes Weighted by the Number of MKR Tokens Voter Holds (X) Voting Weight of Voter Increased by Time Lock of MKR since the Inception/Release of Multi-Collateral DAI. (VW = T) x (TL) = Rewards ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#7",
                    "likes": "8",
                    "time": "03/02/2021-19:40:34",
                    "content": "I think this is a great proposal, thanks!  I have a couple of doubts though:   What about tx-fees for ‘streaming’ the DAI to the active MKR-holders? Are these paid by MakerDAO? Is this really scalable? One of the reasons for the MKR-burning mechanism was gas efficiency…  Tax-efficiency. As you observe, there are some countries where these rewards could be taxed (more than the MKR burning mechanism). It seems kind of unfair to design rewards if we know from the beginning that they will not be very valuable in certain countries.  Regarding both (1) and (2): might it be possible, instead, to give MKR-holders other types of incentives (and not streamed DAI?) One thing that @SebVentures has proposed a few times (in a different context) are, e.g., MKR CALL options (e.g., \"MakerDAO gives you the possibility of buying 1MKR for 1600usd in the next 24 months). These CALL options might be redeemable by the user (so that they pay the fees, not MakerDAO) so this would fix problem (1). Question for our american friends (@flipflopflapdelegate): how would this Call Options distribution work tax-wise (point 2)? Thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.642485119047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "3",
                    "time": "03/02/2021-19:59:12",
                    "content": "Not Legal or Tax advice for my American brothers an sisters, but since Tokens are taxed as property–a $1600 MKR option would mean a short-term capital gain taxed at 45%. Even if you don’t exercise it–once it hits your Ethereum address, IMO you are liable to pay that 45% short-term capital gain. Assuming it goes down to $1,000 you can also sell and deduct the $600 loss from your total yearly gains. Again, I am no tax expert–but it seems & feels like the IRS is nowhere near thinking about ta Crypto Token “Call Option”, can be treated the same as Company Stock Options( incentive stock options & non-qualified stock options)–which are more advantageous for tax purposes. Ain’t no love for crypto. Not yet. Hopefully soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 4.840972222222223
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/02/2021-20:14:55",
                    "content": "Yeah, I’m not happy when airdropped tokens cause tax liability. Taxes are bad enough when you can control when they are assessed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.1666666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#10",
                    "likes": "3",
                    "time": "03/02/2021-21:36:57",
                    "content": "For this very problem, my solution was to weigh the voting power by the time spent in the voting contract and/or the number of votes you made in the past. It’s a real-world problem and real-world solutions already exist. I understand it requires a new chief. I also hope that people coming for the reward will not vote at all. Like if all the new ones vote for the hat of the day then disappear taking their rewards we will be in a trouble, how do we move the hat forward? It’s already painful currently. Nevertheless, the proposal is well written and might solve the problem without modifying a core component of Maker which is always a good thing. My MKRs are in the chief and I live in France, so all is good. And I don’t think we should buy & burn at all for the next 5 years. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.316287878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#11",
                    "likes": "8",
                    "time": "03/02/2021-22:06:38",
                    "content": "This is a good point. I also think there could be some attack vectors where voters start to automate their strategies to follow the “right hat” and a malicious entity takes advantage of that. We want real votes  not just idle MKR. I like this whole idea as a concept, but think we should carefully scrutinize the potential impact. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#12",
                    "likes": "2",
                    "time": "03/02/2021-22:15:03",
                    "content": "Sound amazing, this is probably the best MIP proposal. There are a couple of catch with farming or no voter as said but overall it is definitely better to have it than not having it. Regarding taxes, I believe we can’t please holders from 195 countries with each of them having a yearly change on taxes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#13",
                    "likes": "4",
                    "time": "04/02/2021-13:44:42",
                    "content": "So would this be the MIP where we would discuss adding veMKR or would that be separate. I think adding a timelock feature like Curve or Aave have would help price appreciation/stability greatly as well as committing users to actually stay participating in the ecosystem. Having the ability to lock anywhere from 7 days to 3 years (or some time in the future) would go along way towards backstopping the price during a collapse (in theory). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#14",
                    "likes": "0",
                    "time": "04/02/2021-14:21:06",
                    "content": "    Aaron_Bartsch:  Having the ability to lock anywhere from 7 days to 3 years (or some time in the future) would go along way towards backstopping the price during a collapse (in theory).   Good point! Perhaps one idea is to have a ‘withdraw delay’ when unlocking. 15 days might be sufficient (although I think it took some times after BT to mint and sell new MKR, I am not sure how long it took, actually). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.592803030303031
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#15",
                    "likes": "2",
                    "time": "04/02/2021-14:24:23",
                    "content": "Giving users a choice to lock vs having some arbitrary unlock time period makes more sense in my opinion. Tying the amount of time you want to commit to being locked in with how much you get rewarded proportionally to everyone else makes a lot of sense. Some examples of this working effectively can be seen here: https://dao.curve.fi/locker    app.frax.finance    Frax Finance      ",
                    "links": [
                        "https://app.frax.finance/staking",
                        "https://app.frax.finance/staking"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#16",
                    "likes": "0",
                    "time": "04/02/2021-14:32:22",
                    "content": "I would say the main problem here is that we can’t get it right at the V1. So the question is, can we apply some modification/update/upgrade easily? I would say yes, as far as it is outside the main components. Last code I have seen from sam looks easily upgradable. If that didn’t change we can accept a less perfect tool. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.209523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#17",
                    "likes": "2",
                    "time": "04/02/2021-14:44:34",
                    "content": "curious if there is a way to have “rewards” that are allocated but not claimed… (think UNI release)… the user had to do something to get ahold of it… but technically (s)he could do so at any point in the future… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#18",
                    "likes": "0",
                    "time": "04/02/2021-14:47:39",
                    "content": "It is how the last version I have seen worked - long time ago- . It was based on uniswap reward actually. Interestingly as you meant that fixed the taxes issue so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#19",
                    "likes": "2",
                    "time": "04/02/2021-15:00:22",
                    "content": "I wouldnt say “fixed” as much as probably “deferred”…  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "0",
                    "time": "04/02/2021-15:01:05",
                    "content": "Good point. That could be an option. But personally I would like to see folks use their MKR token rewards to govern and secure the protocol—which as we all know is the main purpose of MKR. After all — we are all guaranteed death and taxes  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#21",
                    "likes": "2",
                    "time": "04/02/2021-15:24:37",
                    "content": "I believe it “fixes” the issue as you can withdraw it after resigning your nationality for ideological reason and move to El Salvador or some under-war country. ( after-all taxes are here to solve issue that lead countries to civil war) You just need to commit it or pay taxes.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#22",
                    "likes": "1",
                    "time": "04/02/2021-15:27:57",
                    "content": "I imagine ppl locking their MKR over here and with the rewards buygin more MKR to locked it again (don’t know if it’s possible a harvest+buying+lock again button), so we ensure even more the protocol. Excellent proposal ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is receiving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#23",
                    "likes": "1",
                    "time": "09/02/2021-12:13:08",
                    "content": "Moving this back up for Visibility. In desperate need to motivate Community members to participate in Governance–including but not limited to on-chain Voting. Please have your say. If you’re waiting for an L2 solution–it’s ways away–which means we are probably looking at a poultry Voter turnout going forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.059523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#24",
                    "likes": "2",
                    "time": "09/02/2021-22:09:05",
                    "content": "+1.  With all the opportunities on Ethereum to have productive assets that have yield + upside, I feel like MKR is not particularly desirable.  It’s my only asset that I can’t really put to work, and the ways I can put it to work, decreases protocol security  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Malgaph",
                    "index": "#25",
                    "likes": "3",
                    "time": "10/02/2021-02:21:57",
                    "content": "I like the idea of ‘governance rewards’, but currently there is the issue of gas fees eating any sort of revenue a person makes from said ‘governance rewards’. Also, we should aim to keep things relatively simple in concern for how protocol profit is handled. By keeping the buy and burn method as a way to provide a price floor I feel way more comfortable investing in MKR than I do in any other crypto. All currently revenue should go to a greater and greater size Stability Buffer so that we may further protect the protocol. I see where you are coming from, but due to gas fees and the stability buffer a governance reward for MKR would act as a gimmick that would only benefit the few whales who could afford the gas costs and own enough MKR to make it profitable for them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.732142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#26",
                    "likes": "0",
                    "time": "10/02/2021-03:06:59",
                    "content": "I posted this on another topic–but this is what you get when you don’t provide incentives:  Times up. Lets get it done. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#27",
                    "likes": "1",
                    "time": "10/02/2021-08:38:02",
                    "content": "    Malgaph:  that would only benefit the few whales who could afford the gas costs and own enough MKR to make it profitable for them.   I kind of agree with this, honestly. Now even setting up a wallet for voting costs >300usd in gas fees. Crazy. Something that could be done cheaply in the short term is an initiative (just like Sourcecred) of the following type:  Governance devotes a certain amount of DAI/month to incentives The DAIs are periodically (e.g., once/month, just like SourceCred now) manually sent to the addresses of the MKR holders in the form a xDAI (i.e., on the xDAI chain).  Gas fees on xDAI or in the order of 0.00001 usd. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.733766233766233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#28",
                    "likes": "2",
                    "time": "10/02/2021-13:40:28",
                    "content": "Hey everyone! I really apricate all the feedback and thoughts that have gone into the idea of Governance Rewards. To me, this is a proposal about keeping the protocol safer and allowing reasonable incentivizes to aid to that end. With that said, I would like to move this MIP forward as soon as possible provided the community thinks it will add to the security of the protocol. So are there parts of this MIP that you think need to be edited to safeguard  the protocol? Are there changes I can make that could ease the perceived tax burden of the Rewards? Basically I would like to put this MIP forward in the next monthly Governance cycle and I’m wondering if there are edits I could make to improve it during its RFC period, or perhaps some changes that would make the MIP more palatable for those unsure. Either way would love some feedback, so thanks for the engagement! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.178571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#29",
                    "likes": "1",
                    "time": "10/02/2021-13:58:10",
                    "content": "I would just urge against issuing a receipt veMKR token in this process.  Nothing against time locking MKR (I’d sign up for max), just want to avoid a MKR → veMKR taxable event. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#30",
                    "likes": "0",
                    "time": "10/02/2021-14:14:33",
                    "content": "@prose11  reward in MKR if possible, not DAI. Otherwise excellent proposal. Just possible we will have to invest in an MKR tumbler or similar at some point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#31",
                    "likes": "0",
                    "time": "10/02/2021-14:24:26",
                    "content": "Like a balancer smart pool?  Other protocols are making smart treasuries, which may be good to learn from ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.254464285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#32",
                    "likes": "0",
                    "time": "10/02/2021-14:32:47",
                    "content": "@Uncle I do not now the details of Balancer, I am working from the assumption that at some point all the worlds’ governments will have worked out how to trace every single blockchain transaction. In this case our pool of contributors could be limited to those few living in crypto-friendly countries. As we can’t all live in Switzerland some generalized tumblr/zk-fixer for ERC20 would be highly useful. Both for the spread of DAI and for the continued MKR-related governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.093506493506493
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#33",
                    "likes": "1",
                    "time": "10/02/2021-14:35:29",
                    "content": "Yeah, way different.  I was just thinking of a Maker controlled MKR/DAI pool that is freely tradable on the market but only Maker can add/remove liquidity, which might be nice to tap into for MKR payments ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#34",
                    "likes": "0",
                    "time": "10/02/2021-15:03:11",
                    "content": "@Uncle That is MIP31? Right? Please feel free to add feedback there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.714285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#35",
                    "likes": "0",
                    "time": "10/02/2021-15:08:13",
                    "content": "Actually Day is better for the protocol, we lend all Dai as backed value. More dai are out more money we make. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#36",
                    "likes": "1",
                    "time": "10/02/2021-15:32:52",
                    "content": "yes - but this is related to tax purposes. Holding MKR passively = capital gain ->capital gain tax (maybe 25-28%). Actively using MKR for voting and getting compensated could result in this getting taxed as work (!!!) = tax of 30-50% !!!. This “interpretation” is what we need to avoid. Compensating with MKR is better in that regard, but not a potential show-stopper. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.989217122395834
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#37",
                    "likes": "2",
                    "time": "10/02/2021-15:40:26",
                    "content": "Oh, I have already expressed my point of view on it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#38",
                    "likes": "1",
                    "time": "16/02/2021-17:39:49",
                    "content": "   github.com    banteg/yearn-vesting-escrow token vesting escrow with cliff and clawback. Contribute to banteg/yearn-vesting-escrow development by creating an account on GitHub.      @cmooney @brianmcmichael  Assuming veMKR ever comes into fruition  ",
                    "links": [
                        "https://github.com/banteg/yearn-vesting-escrow"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#39",
                    "likes": "1",
                    "time": "16/02/2021-18:38:51",
                    "content": "There is another MIP for this one probably MIP42 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/banteg",
                    "index": "#40",
                    "likes": "5",
                    "time": "21/02/2021-16:36:07",
                    "content": "This sounds like a Yearn Vault material. It could claim the DAI rewards and use them to buy and compound the underlying MKR amount. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#42",
                    "likes": "2",
                    "time": "21/02/2021-16:47:10",
                    "content": "It was address only or whitelisted from the last thread, as far as I am aware of. Tho I am not too sure if it is still the case / implemented. But that can be discussed and voted I guess. Is that can solve the tax issue? Probably, I guess. If not, can yearn do something tax specific? As far as I understand if you return the MKR into your vesting contract it should work. I believe people would like you to renounce admin control on it ;), but it is already implemented. Silly but the taxman is the taxman. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Menagerie",
                    "index": "#43",
                    "likes": "5",
                    "time": "21/02/2021-19:40:34",
                    "content": "Assumption:  DAI as a global USD-pegged settlement tool is decentralised & uncensorable only if its governance committee shares those same characteristics Maker is decentralised, antifragile, resistant by design to government powers as long as its voters act selflessly in favour for a global payment system with minimized/no nationalistic biases  Yet here I am, seeing a lot of argumentation referring to local tax laws, potentially hindering true global innovation. If a design similar to CRVs (i.e. MKR → potentially timelocked veMKR) were to be seen as the soundest solution for incentive alignments across all timeframes, then I don’t see how local fiscality should play a role in any argument. It feels like we’re trying to build a dirtroad around a forest instead of making space for a proper & efficient concrete highway through it. (i.e. harm minimization by catering to personal/local tax preferences VS disregard for localities as a global framework is needed for a globally decentralized governance structure). The “I don’t want to pay taxes on my revenue” comes across as disingenuous, out-of-place & potentially jeopardizing to Maker’s global mission as a global actor. Furthermore, historical voting costs are more of a hindrance for smaller participants than any to-be enforced tax law, so why not put the dialectics that go into minimizing tax payments on revenue towards protocol-level fee saving & L2 solutions for governance. (and yes they are getting closer by the day, Colony specialises in DAO governance and they’re operating on xDai as of now) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.215909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BigPapa",
                    "index": "#44",
                    "likes": "2",
                    "time": "21/02/2021-20:58:13",
                    "content": "totally agree with this. I thought a lot about this topic when the purple pill drama came out and I think we jeopardize Maker’s mission every time we make design decisions catered around our current systems.  We will end up with something only marginally better than what we had before. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/happygilmore",
                    "index": "#45",
                    "likes": "0",
                    "time": "04/03/2021-08:38:51",
                    "content": "I just listened to the youtube discussion and I really don’t understand the team’s concern for taxes.  First, the MIP is for an opt-in.  Second, it is clear throughout the last year or two that the buy and burn model is not efficient at appreciating MKR prices. MKR/ETH prices have been stable or dropping since the buy and burn. The market is never wrong. Governance from SNX and other projects have a roadmap for success yet MKR team keeps avoiding it. Any updates to this MIP? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maarten",
                    "index": "#46",
                    "likes": "1",
                    "time": "04/03/2021-12:04:02",
                    "content": "Good proposal! I think value should also be granted to gas fees for the different steps required to participate in governance. Perhaps we could even compensate the tx fees 1-on-1 in MKR. I think gas fees right now are one of the main barriers to participation. They’re one-off, but often really high! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.527380952380952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#47",
                    "likes": "2",
                    "time": "04/03/2021-14:28:12",
                    "content": "The MIP is still in its Request for Comments phase. If there is an easy way to ease tax concerns I would love to make that a part of this proposal. We’ll be voting on a few things that would be necessary for implementation of Gov Rewards this month, so if the community is comfortable with this MIP I would ideally like to see it a part of the next governance cycle. And I agree with @maarten that subsidizing gas fees would likely lead to a big difference in voter turnout. Are there things either of you think could be changed in this proposal to make it better? I’m starting to wonder if I should have gone with something a little simpler for the framework  and then maybe the taxation concerns could be saved for when we’re actually deciding on a rewards implementation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.902243589743589
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#48",
                    "likes": "11",
                    "time": "10/03/2021-21:10:42",
                    "content": "Refunding gas fees is a very difficult problem as most decentralized implementations are susceptible to spam attacks which could be used to drain the funding. @prose11 I really disagree in general with the intent to push through this half-baked idea without the community having reached any consensus on the specifics of the implementation. This proposal needs A LOT of work before it should be inserted into the governance cycle. There’s basically no details at all and just some hand-wavy stuff about governance rewards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#49",
                    "likes": "0",
                    "time": "10/03/2021-22:05:27",
                    "content": "    NikKunkel:  Refunding gas fees is a very difficult problem as most decentralized implementations are susceptible to spam attacks which could be used to drain the funding.   Good point. Is there any work around, such as allowed listing? Any better idea? Also, isn’t it liquidation 2.0 using gas refund too?     NikKunkel:  @prose11 I really disagree in general with the intent to push through this half-baked idea without the community having reached any consensus on the specifics of the implementation. This proposal needs A LOT of work before it should be inserted into the governance cycle. There’s basically no details at all and just some hand-wavy stuff about governance rewards.   Agree Disagree.   github.com    BellwoodStudios/dss-gov-rewards master/src Maker Governance Rewards. Contribute to BellwoodStudios/dss-gov-rewards development by creating an account on GitHub.      The initial proposal was based on uniswap reward if I recall correctly. You are alright, there is more work to do but we need to start somewhere also it is easily upgradable we just need to deploy a new contract and divert the flap. What type of process do you think we should follow? The current workflow doesn’t allow this type of iteration. ",
                    "links": [
                        "https://github.com/BellwoodStudios/dss-gov-rewards/tree/master/src",
                        "https://github.com/BellwoodStudios/dss-gov-rewards/tree/master/src"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.987373737373738
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#50",
                    "likes": "6",
                    "time": "10/03/2021-23:00:44",
                    "content": "    NikKunkel:  Refunding gas fees is a very difficult problem as most decentralized implementations are susceptible to spam attacks which could be used to drain the funding.   The governance reward as written would help to subsidise gas-for-voting by providing DAI to those with MKR locked up in the governance contract (who may then vote.)     NikKunkel:  I really disagree in general with the intent to push through this half-baked idea without the community having reached any consensus on the specifics of the implementation. This proposal needs A LOT of work before it should be inserted into the governance cycle. There’s basically no details at all and just some hand-wavy stuff about governance rewards.   The idea has been discussed for over a month. The MIP lays out the structure of the rewards fairly clearly:  Governance Rewards will be “opt-in”. Users locking their MKR tokens in governance will be able to choose to either receive Governance Rewards or not. The Governance Rewards will be distributed in DAI.   …a portion of DAI that would have been used to buyback and burn MKR being diverted to Governance Rewards. It will be up to Maker Governance to determine the percentage of surplus revenue to be set for rewards…  The MIP should be more explicit on how those rewards are divided between ‘opt-ins’. I think the default assumption is ‘pro rata based on the MKR amount’. But it would be good to state that. This MIP could be accompanied by a technical MIP which defines an implementation, but there is some question over whether that is necessary in this case, it is not a core part of the Maker Protocol, and would pose no technical risk to the protocol beyond a loss of the funds governance diverts to it (so we would obviously start with a test amount). The diversion of FLAP funds is covered by the FlapTap contract defined in the Keg MIPs. My understanding is that @hexonaut has written / adapted a contract to handle the actual distribution of funds based on staked IOU tokens. Saying ‘this needs a lot of work’ and accusing the author of ‘the intent to push through this half-baked idea’ when they just opted not to formally submit it for March and then providing no feedback on the content is unlikely to lead to constructive discussion. I feel like you could have presented your point more diplomatically. If you have input over what we should be doing differently to incentivise MKR Holders to secure the Maker Protocol and participate in governance, I’d love to hear it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.777777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#51",
                    "likes": "10",
                    "time": "10/03/2021-23:25:15",
                    "content": "@NikKunkel as someone who has publicly stated many times that you are loaning out MKR on Aave you are the intended target to dissuade from this position. By passing this vote MKR holders will begin to be able to start costing in this currently unaccounted for externality. If you want to keep loaning out your MKR that’s your choice but you’re going to have to start paying the rest of us who are voting. I don’t really hear a strong arument against this change other than it takes some work and maybe something about taxes. Whether the profit goes out in burn or rewards shouldn’t really matter all that much, so why not get some extra security for free? And yes I get farming rewards are currently way higher than what we could do to offset, but that doesn’t mean we shouldn’t do anything. Also farming rewards are not going to last forever. Let’s get ahead of this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.74861111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#52",
                    "likes": "3",
                    "time": "11/03/2021-00:07:31",
                    "content": "For the record I am currently loaning my MKR out and still think this is a good idea and will still probably continue to loan my MKR out as I think I can financially benefit more from leverage than more static rewards. It does give me pause however and depending on the risk/reward I may reconsider. I think some sort of implementation like this is a net benefit vs nothing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#53",
                    "likes": "4",
                    "time": "11/03/2021-00:42:37",
                    "content": "@hexonaut Fair, I’ll be the first to admit that I lend out MKR on Aave so full disclosure I’m implicitly biased here. That said, I don’t actually think governance rewards are bad. Though neither do I think governance rewards will dissuade anyone looking to maximize yield from having their MKR on other platforms. Governance rewards are good in the sense that they’ll hopefully increase governance participation. With respect to this proposal I just want to see consensus over what that implementation looks like. I don’t want us to get into the habit of voting on proposals that don’t explicitly define what it is they do and how they do it. There’s an argument to be made that broad proposals give more flexibility to implementers. The other side of that is that implementers don’t have any guidelines of what the community actually wants and end up spending resources on something that ultimately won’t be ratified by governance. Having a clear consensus beforehand avoids that pitfall. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.7355769230769225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#54",
                    "likes": "4",
                    "time": "11/03/2021-01:04:24",
                    "content": "    NikKunkel:  With respect to this proposal I just want to see consensus over what that implementation looks like.   Sure that’s reasonable. May I ask which piece is not clear? The idea is to divert a % from the burner and distribute that amount in DAI pro-rata to those who have locked their MKR IOU tokens in the rewards contract I cloned from Uniswap. Rewards will behave exactly like Uniswap rewards after that (minus the token inflation). We will need to tweak how much % to see what works so that was intentionally left open. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#55",
                    "likes": "8",
                    "time": "17/03/2021-13:55:44",
                    "content": "This proposal and the replies seem to be lacking a fundamental grounding in corporate shareholder governance and political science theory. Incentivized voting does not work well in either field, and the problem only grows worse as complexity is ratcheted up. The reward from voting is too low to incentivize someone who was not previously interested to spend the time to learn about the issues, and the reward doesn’t require it. You just have to vote. It’s as easy as pulling a lever. The voter’s paradox (Paradox of voting - Wikipedia) could also be discussed here, as the issue is similar in nature. An informed vote takes work, and paying someone to vote will not result in more informed votes, but rather just more votes. If the goal is just more votes then I guess it doesn’t matter if they’re dumb votes. However, this problem actually gets worse. These uninformed voters will simply take the path of least resistance by following friends or thought leaders. Half the reason the ethereum community goes with whatever Vitalik says is because 95% of ethereum users can’t understand any of the concepts he’s discussing. They know he is smart and will follow him, right or wrong. I’d prefer not to introduce this issue into the MakerDAO community. All of that is to say, this makes the complicated MakerDAO system perhaps the worst place for this. I would highly recommend pursuing a different path to get more MKR in the voting contract. Top of the mind suggestions would be board of director elections, voting proxies, and the ability to vote from my mobile wallet for the MKR that’s on my hardware wallet. As an aside, I had my MKR in during 2017 or 2018, when the bug was discovered in the contract. I decided since then that my sub 100 MKR would never matter in votes and the risk of smart contract bugs was too great for no reward. A few hundred bucks is not going to change that calculus if you truly believe in the potential of MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.103379416282642
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#56",
                    "likes": "2",
                    "time": "17/03/2021-14:39:56",
                    "content": "    Gaucho:  Half the reason the ethereum community goes with whatever Vitalik says is because 95% of ethereum users can’t understand any of the concepts he’s discussing.   This is, to some extent, inevitable imho. For example, if there is a discussion about certain security aspects of, e.g., Oracles, well I will just follow what @NikKunkel or other from his team are saying. I simply can’t invest 3 years of my life learning all the needed technical infos and then vote, lol. I think we should promote voting in presence yes, but to avoid crappy voters we need vote-delegation:  there should be a system of rewards for people who vote well (this might perhaps be deduced somehow by combining forum presence, Sourcecred, and other systems to extract some reasonable metric).   Those who don’t know enough, or have not enough time to follow, should just delegate their MKR to other more active voters, and be rewarded for such delegation.  I am not exactly sure on how to balance the system of incentives to achieve this, but as you suggest @Gaucho, a fundamental grounding in corporate shareholder governance and political science theory is needed. Can you provide some suggestions? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.219246031746032
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#57",
                    "likes": "0",
                    "time": "17/03/2021-15:07:02",
                    "content": "I agree that vote delegation is so much more important than any other feature when it comes to bringing sanity to governance. That being said, a simple voting rewards solution that takes a small % of burn and helps incentivize voting directly or delegating like what is being proposed here - seems like an easy win. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.161458333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#58",
                    "likes": "3",
                    "time": "17/03/2021-15:18:14",
                    "content": "    Gaucho:  All of that is to say, this makes the complicated MakerDAO system perhaps the worst place for this. I would highly recommend pursuing a different path to get more MKR in the voting contract.   I mostly agree, but it’s important to understand that this proposal is not paying people to vote, it’s paying people to have MKR in the governance contract. They do not need to vote to get the rewards. A nice side-effect is that people who do vote can cover some of their gas costs, but we’d be providing the reward regardless of whether people vote.     Replenish2030:  That being said, a simple voting rewards solution that takes a small % of burn and helps incentivize voting directly or delegating like what is being proposed here - seems like an easy win.   Again, it’s really important to understand that we aren’t incentivising voting. We are subsiding voting (rewards will subsidise gas costs for those that choose to vote), but voting is not a requirement to get the rewards under the proposed structure.  I 100% agree that delegation is the key to long-term improvements in governance. That is planned in the form of DssGov, and once we get closer to the release, GovAlpha will share more of our thoughts on how to ensure that delegation is as effective as it can be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.95392156862745
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#59",
                    "likes": "4",
                    "time": "17/03/2021-16:21:50",
                    "content": "Appreciate all the thoughtful responses. I will spend some time conceptualizing a framework that could incentivize better voting, although it sounds like I was off the mark in understanding this proposal, as further discussed below. Perhaps it’s not needed anyways. Regarding the proposal not being about voting: we should make this clear then. It’s not a “governance reward” but rather a “staking reward.” It’s a familiar enough concept in crypto, as we all know. Plus it’s trendy. Maybe MakerDAO will get on one of those cool DeFi yield farm leaderboards next to the sushi thing and pancake stack. Since the contract is being overhauled regardless, I wonder if some of this yield could also come from sources beyond the dai stability fee. Could the millions of dollars worth of MKR just chilling in the contract be deposited into a special Aave contract that allows no borrowing of the MKR (thereby mitigating the risk this proposal is intended to address), but enables the MKR governance contract to take out a small loan to generate returns staking stablecoins on Curve? I know that’s not a fair or light ask of the devs, but I thought I would suggest it since we discussing options. Overall, the fact that voting is not being incentivized makes me less worried about this proposal, although I do wonder what level of income would be needed to have a meaningful reduction in the amount of MKR being loaned out. I also worry that there will be an increase in uninformed voters regardless. It’s also worth pointing out this entire thread seems to have been confused on what action is being rewarded here. Thanks everyone for your time and hard work. This is why this community is so great. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.664761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#60",
                    "likes": "5",
                    "time": "23/03/2021-08:12:22",
                    "content": "I’d like to update this thread. While we don’t want to rush things, It would be nice to see some concrete progress here. Some considerations:  The current MKR burning model was conceived as a ethereum-fees efficient way to provide dividends to the MKR holders. With L2 solutions coming to fruition, this burning model might become not necessary anymore. We could just distribute DAIs directly (I am not saying we necessarily should, but its a possibility that was not available 1 year ago). Similarly, we might decide to only reward MKR-holders who deposit their MKR in the voting contract (voting is not necessary). Only these MKR holders are given dividends. Everybody is free receive the dividends, or lend/use their MKR elsewhere. Currently MakerDAO makes >100m USD/year in profits. Let’s even assume 80m USD/year are used for salaries/growth. This leaves 20m DAI for dividends/year. Currently only about 25% of all MKR are deposited in the voting contract. I think there is ample space for interesting dividend schemes to be done here.  Just for reference: https://www.nasdaq.com/market-activity/stocks/ko/dividend-history MakerDAO can do even better than CocaCola, but it is also growing like crazy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.38235294117647
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#61",
                    "likes": "1",
                    "time": "23/03/2021-09:03:57",
                    "content": "Changing to a dividend model raises the risk that MKR is a security significantly. That’s not to say it’s not a security in its current form, but this would raise the risk profile by entitling holders to an expected cash flow stream with a future value that discounted cash flow models could predict. The end result would be a voting right paired with a right to a share of profits from the system. If it walks like a duck and talks like a duck… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.705357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#62",
                    "likes": "1",
                    "time": "23/03/2021-09:22:08",
                    "content": "    Gaucho:  That’s not to say it’s not a security in its current form   Yeah exactly. I think we can call it voting farming incentives rather than shareholders dividends then.  I can’t seriously believe that MKR would be considered a security with “voting farming incentives” but not-a-security with “MKR burn mechanism”. But I am not a lawyer, so ok. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#63",
                    "likes": "1",
                    "time": "23/03/2021-10:51:38",
                    "content": "Re: point 1/2, I’m not sure gas was a motivation. You can distribute tokens among holders efficiently, eg Dividend-bearing tokens on Ethereum | by Nick Johnson | Medium. In addition to the security classification, there is also a fiscal component. I share your intuition that economically equivalent structures should be subject to the exact same rules/constraints, but it really is very often not the case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#64",
                    "likes": "3",
                    "time": "23/03/2021-14:12:16",
                    "content": "    Gaucho:  Changing to a dividend model raises the risk that MKR is a security significantly. That’s not to say it’s not a security in its current form   Dude, seriously? The entire DeFi ecosystem tip-toes around being a security. Come on man ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.052083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#65",
                    "likes": "5",
                    "time": "23/03/2021-14:30:53",
                    "content": "Curious to get people’s thoughts here as to the benefit of adding a proposal to be paired with this MIP. As stated, this MIP was written based off of @hexonaut’s awesome work on this forum post. I’m toying with the idea of a subproposal, or at least accompanying plan being posted along the MIP. Would be especially valuable to hear from people like @NikKunkel that felt this draft is lacking specificity. Basically this MIP was designed to lay a few ground rules and ultimately let the community decide what the best way of distributing Governance Rewards is from an informed prospective. Fundamentally, this is more about the security of the protocol than paying dividends. If there is a less contentious way of motivating more MKR to enter governance I’m happy to pursue that. But I will say the reason I like the idea of this MIP (especially paired with Sam’s implementation) is that it offers incentives to protect the protocol while naturally encouraging users to engage with Governance. In this way the implementation has the opportunity to better secure the hat while beginning to address the “free-rider” issue of MKR governance. My main issue at this point is I still don’t know what changes would be worthwhile to this MIP, as much of the objections ring true no matter what method we use to incentivize placing MKR into Governance. So if anyone interested in this thread has the time to address some of the following questions it would help me out a lot:  Would adding subproposal/linked forum post explaining how Sam’s DssGovRewards could be utilized with this MIP make it better? What ways could we reduce the implied tax burden of such incentives to most jurisdictions? How specifically should earning rewards proportions be discussed? (It was my view that being vague here was best as it would offer the community the ability to decide between a wide array of options from Savings Lottery type distributions to direct proportional accrual, does the community want options in the future?) Are there community members that would be interested in having a workshop session to discuss potential edits (real-time or de-sync)?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1484375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#66",
                    "likes": "0",
                    "time": "23/03/2021-14:54:16",
                    "content": "The tax implications are negligible because you get to choose when to harvest the rewards. As long as that stays true I don’t see any issue with the proposed implementation. Shouldn’t most MIPs include the technical implementation as well? That’s how a lot of them have been going. Or have the subproposal be Sam’s technical implementation and if we want to change the implementation we change the subproposal? I assume parameter changes to % siphoned from vat via keg or stream frequency could be done with a signal request. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#67",
                    "likes": "3",
                    "time": "23/03/2021-15:56:33",
                    "content": "    SebVentures:  For this very problem, my solution was to weigh the voting power by the time spent in the voting contract and/or the number of votes you made in the past.   Is this still being considered? Because God knows the true Maker Voters have been in it, day in, day out, regardless of circumstances. I take my hat off to you ALL (approximately 25 MKR holders) that have always participated no matter the environment. These are the folks that deserve more than just an NFT. Not that folks like KhanMaker need another NFT, or a few more shekels ,   but still. They should have what Seb mention above–weigh the voting power by the time spent “holding it down”–if you know what I mean ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#68",
                    "likes": "2",
                    "time": "23/03/2021-16:02:04",
                    "content": "Yeah I like the sound of this as well. Is it worth making that a requirement of any Governance Rewards package, or is there some prudence is leaving the door open to reward MKR in the Governance Contract through other means? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#69",
                    "likes": "1",
                    "time": "23/03/2021-16:54:01",
                    "content": "    prose11:  Would be especially valuable to hear from people like @NikKunkel that felt this draft is lacking specificity.       prose11:  My main issue at this point is I still don’t know what changes would be worthwhile to this MIP   At the end of the day, we ended up with 67 messages and nothing really constructive. I think we need as community to improve on it. If we want to onboard core unit from the foundation, we can’t just after 3 months end up with some non-decisions where no one wants to spend time/work on it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.066666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#70",
                    "likes": "3",
                    "time": "23/03/2021-17:59:00",
                    "content": "    flipflopflapdelegate:      SebVentures:  For this very problem, my solution was to weigh the voting power by the time spent in the voting contract and/or the number of votes you made in the past.   Is this still being considered?   To my knowledge, it never was. I have no idea how hard it can be to be implemented and, in any case, it demands a new Governance Contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.69469696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#71",
                    "likes": "0",
                    "time": "23/03/2021-18:25:28",
                    "content": "Agree, it seems complicated and it needs probably some sort of air drop for past events. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mahu_victor",
                    "index": "#72",
                    "likes": "2",
                    "time": "06/04/2021-07:12:13",
                    "content": "I’ve been following the Maker governance for weeks now.This proposal is very interesting because it finally strives to move away from the Buyback & Burn model for MKR, which works well in theory (over decades maybe) and awful in practice. Maker has one of the most astounding money generating tools in DeFi, yet somehow its token is teribly aligned with growth. MKR burning does nothing to improve the price, because the project is far from having critical mass and global adoption. At the scae in the next several years the burning may decrease the supply by 2-5% per year at best. This is quite negligible and does not have the desired supply/demand effect for the long-term MKR holders. For short term (6 months to a year) it does not matter at all. And if it does not matter in a raging bull market, ask yourself how it will be in the upcoming bear market. In my view a Buyback and Stake model would work much better. Take a look at Aave tokenomics for reference. The governance rewards the holders for safe-keeping the protocol. MKR holders already incur this risk. But are they rewarded? Theoretically through burning, but practically not. The stability fees provide almost insignificant practical incentives for active governance and protocol safe-keeping. The people who have been participating actively so far without direct payment are truly deserving of better treatment and I applaud the professionalism and due diligence in keeping DAI stable. With a Buyback and Stake model, MKR would be bought on Uniswap and other DEXes at a higher market price, by 5-10% higher. The acquired MKR would then be distributed to MKR governance who stake MKR and actively participate in governance. Thus no inflation occurs and at the same time it creates positive price feedback loops in the markets if done at regular intervals, for example once every 2 weeks. Traders will expect this buying pressure and will sell rather to the protocol at higher prices than to one another as they do now. At about 120 million DAI annualized even 5 million DAI worth of buybacks every 2 weeks will push the price upwards in a healthy way. The sentiment around MKR will change significantly in a positive way. In the last few years it has been horrendous and it is not much better now, being so utterly undervalued at 2 billion DAY marketcap. And if you worry about your local taxes, well what is better - to receive most of the rewards or nothing at all? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.72921522921523
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#73",
                    "likes": "7",
                    "time": "06/04/2021-08:14:35",
                    "content": "Hi @mahu_victor and welcome to the community,     mahu_victor:  finally strives to move away from the Buyback & Burn model for MKR, which works well in theory (over decades maybe) and awful in practice.   I assume you are referring to the price of MKR which has not kept pace with the success of the Maker ecosystem. The price of MKR, as with all things traded freely, is determined by supply and demand. I will assume you are aware of the term supply/demand balance. In the case of Maker we are in a bit of a pinch at the moment. Due to concerns about regulations and how/if these will impact Maker, the foundation that up until now has governed Maker never did any marketing of the MKR token. There were never any marketing, ICO, airdrops, incentive period - nothing. Only a low number of sales through channels you had to work at how to find, later a pioneering dex. End result is that the MKR token is largely unknown to crypto outside of the circle of stablecoin enthusiasts. And the supply? The basic problem was that starting DeFi summer some of the largest holders decided Maker was boring compared to LP tokens and NFTs. So they started selling just as the crypto market started booming. According to some estimates about 20% of total supply was sold starting in August 2020. The resulting supply/demand balance for MKR is then a high number of tokens sold into a market that does not have widespread knowledge or incentive to buy. While this goes on airdrops, LPs and degen financing steals all attention. The net result is what you see reflected in the poor price of MKR, which has a Price/Earnings ratio of a mediocre real world tech company, completely ignoring the explosive pace of growth. This is partly the reason to be cautious about any MKR minting program as you would just add supply to a market with very limited demand. Moving to a Buyback & Stake model (or any other model) will not fix this. What will fix it is waving goodbye to the foundation, start governing as a community and telling the whole world of the string of successes achieved. Just spreading knowledge of the pace of DAI growth will interest anyone with even a normal sense of greed. This fixes the demand side. The supply side fixes itself as whales eventually run out of MKR to sell. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.855026455026455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#74",
                    "likes": "3",
                    "time": "06/04/2021-09:09:49",
                    "content": "I generally agree with your post @mahu_victor. The burning model makes a lot of rational sense in the very long term, but this does not mean it is efficient now. For instance, we haven’t been burning for months now, and we plan not to burn for several more (due to the surplus buffer increase, which is a good move). I agree in particular with:     mahu_victor:  And if you worry about your local taxes, well what is better - to receive most of the rewards or nothing at all?   I frankly think these tax consideration should be ignored in governance. First, the taxation is different in many countries. For example, in several EU countries, DAI dividends and/or crypto (including stablecoins) trading are not taxed; what is taxed is only the ‘final’ event of selling for FIAT. In Malta, crypto is not taxed at all. Second, MakerDAO is an international (since decentralised) organisation, it should not make critical strategic decisions only based on the laws of a given country (even if this country is of critical importance, like the USA). Third, as always proposed, the DAI-rewards would be opt-in. So everybody is free to make their own calculations and evaluate between DAI rewards and other options (e.g., Aave, collateral for farming, just hold, etc).     Planet_X:  Moving to a Buyback & Stake model (or any other model) will not fix this. What will fix it is waving goodbye to the foundation, start governing as a community and telling the whole world of the string of successes achieved.   I agree with this too. But I personally would be even happier if, in conjunction with what you said, I could receive a daily stream of DAI from staking my MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.703951149425287
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#75",
                    "likes": "2",
                    "time": "06/04/2021-19:00:00",
                    "content": "    iammeeoh:  But I personally would be even happier if, in conjunction with what you said, I could receive a daily stream of DAI from staking my MKR.   I second that. I think that could make people take notice and put MKR on the map in a big way. At the moment there seems to be a huge disconnect between DAI’s popularity and MKR’s lack of popularity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#76",
                    "likes": "1",
                    "time": "13/04/2021-14:36:40",
                    "content": "Hello everyone! It’s past time for an update, my apologies for not engaging more on this thread. I’ve been talking to a lot of the people involved and trying to figure out a way to incorporate all the feedback on this post. The short update is that a new draft will be published (shooting for this coming Monday). The name will be changed to “Staking Rewards” and I’ll likely be making a new thread to discuss the latest version. Huge thanks to @hexonaut who has been sitting on the DssGovRewards code for a while and has been patiently waiting and working with me to get this MIP into formal submission. The main difference with the forthcoming draft (besides the rebranding) will be giving governance a parameter to set that determines what percentage of the funds otherwise going to the flapper (MKR buyback/burn) will be directed to Staking Rewards. Any last calls for tweaks to make this more tax efficient/ better defined  would be welcomed! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.969426406926407
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#77",
                    "likes": "2",
                    "time": "13/04/2021-15:59:09",
                    "content": "One of the things to consider is perhaps bundling some of this DAI to people who are already active in SC and bundle all DAI payments into disperse. This has two pluses.  People who are delegates and/or active in the forums are encouraged to sign up for SC rewards (or opt out) Bundling DAI payments into a monthly stream.  Some ideas to consider for the future  coupling governance rewards with SC payments on a monthly schedule might be warranted from a main net fee standpoint. Having a payout opting in to receive these say on (L2/sidechain) might generally save on distribution costs. Having an option on this compensation to receive in DAI (on L2/sidechain), MKR, or ETH on mainnet as well as a means to set a payment schedule(monthly, quarterly, yearly, or on signal) might be useful as well.  As to call options - if these are under market it is cap/gain or income.  If the strike is above price I think only tax consequences are if they are exercised because the options are not ‘free money’.   But I am not a tax expert. Be nice if these DAI payouts could be streamed to the debt owed in a vault (reducing the interest - unclear to me whether these are considered payments then or simply interest reduction). I would love to hear about some tax delayed option but being one who is paying taxes on DAI revenue from last year it is a whatever.   You know these rewards could also be ‘donated’ into some kind of fund that could be used by a ‘governance group’ to persue governance interests… All off the top of my head here. Something I like is that these rewards come from DAI that would be sent to burn MKR to keep interests aligned.  IMO.  I think some of the key times to have governance participation is when the protocol is losing money or stressed.   This to me indicates a suggestion to taking some small % of the surplus change and setting it aside in a governance rewards buffer and adjusting rewards upward when burn occurs, and downward to some minimum when it doesn’t and just making sure this has funds to operate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#78",
                    "likes": "8",
                    "time": "20/04/2021-12:56:31",
                    "content": "Hello hello! MIP has been edited! Some highlights:  Now called Staking Rewards  Addition of a parameter stake that dictates what percentage of funds otherwise going to buyback/burn should be diverted to staking rewards instead No more subproposal, changes can be made with the Weekly Governance Cycle  Should this proposal be accepted by the community, the plan would be to use @hexonaut’s DssGovRewards Code to implement. The MIP also mentions its intentionality behind not setting a particular path for the distributions, to allow for different implementations in the future and some flexibility around future Governance improvements. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.597222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#79",
                    "likes": "4",
                    "time": "20/04/2021-13:03:10",
                    "content": "    prose11:  Hello hello! MIP has been edited!   Thank @prose11 and @hexonaut  for writing this difficult MIP, and patiently getting and evaluating community feedbacks. Very important work! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#80",
                    "likes": "2",
                    "time": "20/04/2021-17:16:26",
                    "content": "This is a great step forward in the development of the protocol and will for sure increase participation from MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#81",
                    "likes": "1",
                    "time": "20/04/2021-20:58:42",
                    "content": "    prose11:  For example, if Governance were to set stake to 25%, for every 100 DAI the protocol generates when the Surplus Buffer is full, 25 DAI would be diverted to reward MKR tokens staked in the Governance Contract.   Perhaps the part I emphasized might need to be dropped now that revenue can simultaneously go towards the Surplus Buffer and rewarding MKR holders (before the Surplus Buffer is full)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#82",
                    "likes": "1",
                    "time": "20/04/2021-21:08:54",
                    "content": "Hm whoops, great catch. I wonder what might be a more elegant way to phrase it but maybe something like:  For example: If Governance were to set stake to 25%, 25 DAI out of every 100 DAI that would otherwise be sent to the flapper without a stake parameter would be diverted to reward MKR tokens staked in the Governance Contract.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#83",
                    "likes": "3",
                    "time": "23/04/2021-22:39:59",
                    "content": "I’m cool to lock up for years ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KriptoHayat",
                    "index": "#84",
                    "likes": "1",
                    "time": "25/04/2021-17:42:54",
                    "content": "Very nice proposal! Can’t wait to see this implemented. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#85",
                    "likes": "0",
                    "time": "26/04/2021-23:46:33",
                    "content": "And, just to be clear, which percentage gets the first bite of the apple before the remainder gets burned; the stake or the surplus_buffer? It sounds like stake, from the current wording. In other words, if stake is 25%, surplus_buffer is 25%, and revenue is 1000; it sounds like staking rewards would be 250 (25% of 1000) and 187.5 (25% of the remaining 750) would be sent to the surplus buffer. 562.5 would be burned. Alternatively, are they to be calculated at the same time and not sequentially? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#86",
                    "likes": "0",
                    "time": "27/04/2021-00:28:54",
                    "content": "Not exactly. So the rewards from ‘stake’ only come from what was otherwise heading to the burner. So in your example 750 DAI would be destined for the burner without ‘stake’ but with it 187.5 DAI would head to staking rewards and the other 562.5 DAI would go to the burner. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#87",
                    "likes": "0",
                    "time": "27/04/2021-00:56:21",
                    "content": "Ah, I see now. The scenario that I didn’t enumerate. So surplus_buffer gets the first bite at the revenue apple. Out of curiosity, why should it be calculated sequentially (such that order does matter) rather than at the same time (such that order doesn’t matter)? If it was at the same time, if revenue was 1000, stake was 25%, and surplus_buffer was 25%; then staking rewards would be 250, 250 would be sent to the surplus buffer, and 500 would be burned. Seems nice and clean. If in the future some other destination for revenue to be diverted to is added (who knows ) then we wouldn’t have to worry about where in the sequence it comes; it would just be another term before, ultimately, the remainder is burned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.545833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#88",
                    "likes": "2",
                    "time": "27/04/2021-01:22:33",
                    "content": "It’s set up this way because it’s an alternative way to distribute profits other than burning. The Surplus Buffer is set up as the default because that’s effectively where we pay expenses from and is set to a level to manage the risk of the Maker portfolio of lending assets. So once that base level is satisfied (expenses plus risk management) we want to distribute profits to token holders. We’re effectively allowing Governance to split that profit stream between burning and staking however the community sees fit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#89",
                    "likes": "1",
                    "time": "27/04/2021-01:45:29",
                    "content": "Ah, that makes sense. First, the surplus_buffer portion is deducted from revenue, and the profits are left. Then, how the profits are distributed is determined by this stake parameter. Thank you for clarifying. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#90",
                    "likes": "0",
                    "time": "27/04/2021-01:54:48",
                    "content": "I guess worth clarifying that they aren’t technically profits, but excess revenue. Made the whole thing much harder to write, but profits gets pretty close as we’re in theory only diverting above our expenses. The problem being we don’t take future expenses into account, so we could push a bunch of extra revenue to the burner/staking right before paying out a big core unit budget from the Surplus Buffer. Yay things being slightly hard to define haha ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.3246336996337
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#91",
                    "likes": "1",
                    "time": "27/04/2021-10:43:46",
                    "content": "    prose11:  I guess worth clarifying that they aren’t technically profits, but excess revenue   I believe the phrase you are looking for is “operating income?” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#92",
                    "likes": "1",
                    "time": "27/04/2021-11:55:35",
                    "content": "    PaperImperium:  operating income   Definitely closer to the meat of it. But the token flow doesn’t take into account pre-approved spending for the rest of the year, and while you could call the Surplus Buffer an operational expense for risk management, an operating income figure would reasonably include what you’ve added to the SB in the year. It’s almost the derivative of operational income in that it’s taking the excess revenue at that point in time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#93",
                    "likes": "0",
                    "time": "27/04/2021-12:32:31",
                    "content": "I’m not sure what the proper accounting term is, but it if we’ve decided to divert revenue towards either staking rewards or burning, then it seems to me that it is by definition “profit” — removing it from the system, distributing it to owners. Any operating expenses should be accounted for by the first split into the surplus buffer? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#94",
                    "likes": "0",
                    "time": "27/04/2021-12:37:59",
                    "content": "Right, but take for an example a year where the protocol loses money (I know, I know, blasphemy) - if the surplus buffer was full/we voted to lerp some funds away at any point in the year we would have used the cash flow to buyback tokens or divert via stake despite not having any profits that year. So while accounting terms like profit or operating income make the idea easy to visualize, they wouldn’t be quite right when trying to dictate our distribution methods because the cash flow is not forward looking in our set up, we simply need somewhere to put in the revenue as it comes in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.704761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#95",
                    "likes": "2",
                    "time": "27/04/2021-13:02:47",
                    "content": "You can return capital without a profit. Not saying it’s smart, but it can definitely be done, and even with a loss it could be cheaper to take out debt to do so. All depends on capital structure. But @prose11 is right that operating profit isn’t quite right, though I think it’s fairly close since CUs will be fronted funds for chunks of time and not have it come out of the budget in real time. Perhaps in the future the burner should be set up to hold the DAI (or stake them somewhere for yield) until the end of a fiscal quarter to allow us to reconcile the real-time flows with the aggregate P/L of the DAO ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.204081632653061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#96",
                    "likes": "0",
                    "time": "27/04/2021-19:58:34",
                    "content": "Ah, I see now what you mean by “derivative”; since it’s not a year-end accounting, just a snapshot. Thanks again for your responses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#97",
                    "likes": "1",
                    "time": "28/04/2021-20:52:11",
                    "content": "Final update submitted, moving to Formal Submission for May Governance Cycle  @someone I decided to leave the example as is because I believe the clarity of the example is helpful. If lerping is the new normal I will submit an amendment to tighten up the example. Only other change was stake → Stake Reward Percentage for added clarity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.161363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#98",
                    "likes": "1",
                    "time": "01/05/2021-10:55:45",
                    "content": "Thank you @prose11 for all the sustained work on this MIP. Can I ask two quick questions   If someone is opted in to DAI rewards, is the DAI automatically sent to their address or is it “made available” (similar to the UNI airdrop) and people can claim it whenever it is tax efficient to do so?   Could you tell me (or point me to the appropriate place) how the attack vector below is sufficiently mitigated? I assume this is somehow connected to the delegation of votes but wasn’t sure exactly how that connection worked.       g_dip:  I also think there could be some attack vectors where voters start to automate their strategies to follow the “right hat” and a malicious entity takes advantage of that.  We want real votes not just idle MKR   Apologies if these have been discussed already - I haven’t kept up with the discussion on this over the last weeks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.273809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#99",
                    "likes": "2",
                    "time": "01/05/2021-13:30:51",
                    "content": "Absolutely, thanks for engaging and asking some good questions!   Sam wrote the code for implementing the rewards based on Uni’s reward program, which does allow users to claim their tokens at their discretion. However, worth noting that depending on your tax jurisdiction, this may not help with taxes, as you have the ability to claim at anytime.   W/ staking rewards, voting on something in particular is not what’s being rewarded, so I would expect the opposite to be the concerning vector. Basically since people are incentivized to lock their tokens in governance (doesn’t matter which hat), they could leave them there unattended, making it harder to pass new execs. But IMO, we already have a problem with that (just take a scroll through old hats on vote.makerdao.com), and it is unlikely staking rewards would increase that problem by a meaningful magnitude. To the extent that it might, we are also in the process of sorting out delegation (which would hopefully come together not long after Staking Rewards, if the community were to support both) and thus ease the worries of idle MKR causing difficulty with passing new execs.   Let me know if that doesn’t cover what you wanted it to, happy to give more detail or explain my reasoning further! ",
                    "links": [
                        "http://vote.makerdao.com"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1060606060606055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#100",
                    "likes": "2",
                    "time": "01/05/2021-14:03:22",
                    "content": "Would adding the ability to timelock your stake on deposit get around this tax issue? I’m thinking we could add a multiplier scale for timelocked MKR 1x → 2x for 0 days → 1 year or something. This has the added benefit of committing MKR to not being sold in the event of a recapitalization event and rewards long term holders. We need to align the incentives of users to make long term decisions in the interest of the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#101",
                    "likes": "0",
                    "time": "03/05/2021-14:57:38",
                    "content": "Now that MakerDAO holds 84,000 MKR, does this change the discussion or format of rewards? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#102",
                    "likes": "1",
                    "time": "03/05/2021-15:06:01",
                    "content": "    Cassius:  does this change the discussion or format of rewards   I don’t think so. These tokens will probably be burnt. Maybe the reason that the tokens were transferred instead of burnt is because the Foundation does not have authorization to burn them. A transfer to the 0x000… address would have had the same effect as burning, but I feel lacks aesthetic appeal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#103",
                    "likes": "1",
                    "time": "03/05/2021-15:08:30",
                    "content": "Sure that’s one option, but I’d expect a pretty vibrant discussion about alternatives before that or anything else happens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.527777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#104",
                    "likes": "4",
                    "time": "03/05/2021-16:05:09",
                    "content": "    Aaron_Bartsch:  Would adding the ability to timelock your stake on deposit get around this tax issue? I’m thinking we could add a multiplier scale for timelocked MKR 1x → 2x for 0 days → 1 year or something.   So I definitely like the idea of time locking, and it is possible this would circumvent some tax liability in certain jurisdictions. However, I think there would be some Governance concerns to doing so. In particular upgrading the Governance contract, and preventing people from being able to call an emergency shutdown when needed come to mind.     Cassius:  Now that MakerDAO holds 84,000 MKR, does this change the discussion or format of rewards?   No, Staking Rewards are specifically to be paid our in DAI that is diverted from the flapper. This protects rewards becoming detached from protocol performance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.109126984126984
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#105",
                    "likes": "1",
                    "time": "03/05/2021-16:10:13",
                    "content": "I mean adding a timelock to the staking contract not the dssGov contract. This would just be for the reward portion. Edit: Oh I see what you mean since people would be locked in the staking contract. Good call. Hopefully a feature for down the line then. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.899305555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#107",
                    "likes": "4",
                    "time": "05/05/2021-11:46:06",
                    "content": "In short, yes. Basically this MIP seeks approval for a Staking Rewards Program. Sam has already drawn up a repo that wouldn’t need to change anything within our system. If we were to come up with something that directly modified the protocol we would obviously need community approval, but in this solution the only thing that needs approving is if we’d like to reward MKR holders with their tokens staked in the Governance Contract, and if so how those reward amounts would be determined. I believe I’m explaining that correctly, but will go ahead and tag @LongForWisdom to make sure. Essentially, from a Governance prospective we would be ready to start with any plan that doesn’t change the protocol code. I just tried to be explicit in the drafting (with linking the post) and discussion that Sam’s code would be the one we use at the start, without making this a technical MIP since it does not rely on changing any protocol code. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#108",
                    "likes": "0",
                    "time": "06/05/2021-08:26:01",
                    "content": "Yes. I suppose I was just throwing a new possibility into the mix. Lock the 84k MKR in the voting contract and use it as a source of Protocol revenue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#109",
                    "likes": "2",
                    "time": "06/05/2021-10:54:14",
                    "content": "Dumb question, but can I request Content or someone have a nice, non-technical explanation on how to do this whenever it gets enacted. Less friction = more participation. Also, even if you’ve coded before, you may not be really up to speed yet on smart contracts. I know I live in irrational fear of sending tokens where they disappear  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.79213048855906
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#110",
                    "likes": "2",
                    "time": "16/09/2021-08:17:27",
                    "content": "A few months (~4, as of today 16th Sept 2021) have passed since this MIP proposal was voted, and rejected (link). Some big MKR holders voted NO, and some discussion in the Forum made it clear that, at the time (May), the proposal was not adequate due to the lack of MKR-delegation. Now we have delegation in place, and it would be nice to re-test the sentiment on MIP49. To the authors: @hexonaut @prose11 thank you once again for your work on this MIP proposal. Would you like to take it up again, at least to test the sentiment of the community (and of the MKR holders who, very nicely, expressed transparently why they voted NO in May)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.430208333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#111",
                    "likes": "5",
                    "time": "16/09/2021-14:18:27",
                    "content": "So I would say we are still very early in the delegation process and I’d be hesitant to push something like this forward before VCs are able to delegate through the custody platforms. Also worth noting (and correct me if I’m wrong @hexonaut ) but I believe the delegation contract has the ability to pay rewards to delegates and delegators if Governance decides to turn them on, which might change how Governance/Staking rewards would look like if implemented. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.5375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#112",
                    "likes": "2",
                    "time": "16/09/2021-14:26:25",
                    "content": "Agree with Prose here. We should let the delegation process evolve and for the VC custodians to build out the needed UIs to delegate from their platforms. Revisiting what may be a controversial topic before those things are complete would be premature (though I support taking it up again after those things are in place). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#113",
                    "likes": "2",
                    "time": "16/09/2021-14:37:18",
                    "content": "    prose11:  So I would say we are still very early in the delegation process and I’d be hesitant to push something like this forward before VCs are able to delegate through the custody platforms.   Fair enough! This seems quite reasonable. I just wanted to see if things were moving forward, somewhat. It seems we are kind of waiting on 3rd party (centralised) solutions, but ok, I guess that’s inevitable. Perhaps we can re-evaluate MIP49 in a semester or so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.46111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#114",
                    "likes": "6",
                    "time": "16/09/2021-15:26:09",
                    "content": "    iammeeoh:  It seems we are kind of waiting on 3rd party (centralised) solutions, but ok, I guess that’s inevitable.   We are, and it is. It’s also quite frustrating. @Growth-Core-Unit has been pursuing it, and DUX have been providing technical integration support. VC’s have also been pushing the custody platforms to implement it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#115",
                    "likes": "2",
                    "time": "18/09/2021-13:46:52",
                    "content": "Staking looks increasingly untenable in the current US regulatory environment. Celsius getting hit by state-level securities regulators: https://www.ssb.texas.gov/sites/default/files/2021-09/20210917_FINAL_Celsius_NOH_js_signed.pdf ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#116",
                    "likes": "2",
                    "time": "18/09/2021-20:08:10",
                    "content": "Many things that bounce around this forum look untenable in this regulatory environment…like having a fixed income solution natively integrated with and managed by the Protocol without the proper regulatory registrations in place… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#117",
                    "likes": "2",
                    "time": "18/09/2021-22:00:30",
                    "content": "    Tosh9.0:  like having a fixed income solution natively integrated with and managed by the Protocol without the proper regulatory registrations in place…   Yeah… I’m thinking arm’s length from Maker if any yield is accruing. Especially if it’s from commingled funding in any way. My guess is eventually the DSR will need to be turned off, but I can’t imagine anyone is going to worry about it yet. I suspect we will have quite a few tough decisions to make in the coming year. But our first priority has to be protecting the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.800925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#118",
                    "likes": "2",
                    "time": "18/09/2021-22:17:07",
                    "content": "Commingling or pooling funds should be a major No-No for us; doing so invites the regulatory scrutiny many other protocols/projects are currently facing,  if we are to believe the news (I do, FWIW). The DSR is a different animal though – no pooling,  no custody,  no fractionalized lending and no other behavior that draws regulatory ire. The naming – Dai SAVINGS Rate – is unfortunate because of its banking connotation but perhaps a rebrand would be in order,  though I acknowledge how difficult that would be on the marketing side. Then again it doesn’t matter all that much given Dai demand. But I believe it can be a major differentiator vis-a-vis competitors down the road. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.821338383838384
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#119",
                    "likes": "5",
                    "time": "19/09/2021-08:08:23",
                    "content": "    PaperImperium:  My guess is eventually the DSR will need to be turned off   I guess, as it is already the case for some platforms (e.g., DyDx), it will be sufficient at the level of UI to warn US-residents that the service can’t be used by them. Not all of the world follows US-rules. As Rune said in the chat a few times, we should keep diversifying our offer(s) in several countries/legislations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.5
                }
            ]
        }
    ],
    "group_index": "3232"
}