{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-restart-the-burn-v2-canceled/14918",
            "title": "[Signal Request] Restart The Burn \\xf0\\x9f\\x94\\xa5 [V2] [Canceled] ",
            "index": 14918,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "impact-:-high",
                "signaling",
                "communications",
                "makerburn",
                "surplus-buffer",
                "sig-status-withdrawn"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#1",
                    "likes": "6",
                    "time": "02/05/2022-20:26:11",
                    "content": "Note: This Signal Request has been amended to include an actionable outcome from the vote.   TLDR  Restart Burn Immediately  Burn at a reduced rate until we develop something better.   Restore Revenue Distribution Narrative  Burn until we have a concrete system to replace it.   Retain Investors Retain our Community & Talent   Overview In my opinion, putting aside my own personal shituation, shutting off the burn at a market cycle bottom was arguably one of the worst decisions we have made as a community to date. I will admit that are benefits to operating on a model that prioritizes reinvesting into growth during early stages rather than distributing revenue. It works for Amazon, and it works for many others as well. It may even work for us as well. Unfortunately, in practice, what we’ve done is turn off the only revenue distribution model we had… at a market cycle bottom. I know it was not perfect. It was inefficient, gameable, and didn’t perceptibly return value to MKR holders. Still imperfect as it was, people liked it. I liked it, and so did many others. As it stands, we have no concrete plan in place to distribute revenue. We removed what we had but are yet to replace it with anything new. Our community members and long-term investors are dropping out like flies. Some from 2018 PTSD, others have just lost faith in our governance community’s ability to deliver. We still have revenue, though! It may be less than before, but that’s expected during a period of market contraction and a general reduction in appetite to borrow and take on risk.  This is temporary!  No market can maintain consistent negative perp funding indefinitely. A majority of market players taking one side of a position for pushing six months now are inevitably going to get rekt. It’s rare that everyone is right.  At some point there will be a new funding cycle. People will get excited and borrow again. I’m not concerned about our temporary dip in revenue. The burn is what retained many of our investors for years. Even through Black Thursday, one of the most challenging times we had to face as a community, we held through it. Yes, we did mint, and MKR suffered but has recovered since. As it stands, though, we still have the mint risk but no burn to counterbalance it. This puts many of our holders into a very tricky state of having to weigh underwriting huge codified downside risk with no clear promise of upside. It becomes very easy to justify classifying MKR as an overly risk-on asset during liquidity crunches. Dumping during times of uncertainty is a no-brainer. As each individual dumps, we increasingly expose ourselves to a governance attack. At this point, the illiquidity of MKR may be the only thing saving us from a nefarious actor buying up enough MKR to control the system. None of us want to see this. Given how essential Maker and DAI are to this space and the world in general, it would be disastrous to allow ourselves to capitulate into handing over control of this protocol to bad actors. It’s not just about “wen moon?” or \"number go up blz! Ya, I’d like that… since I’m super rekt right now… “can dev do something?” I wish… but that’s not important. MakerDAO is genuinely in a place to change the world for the better. We deliver untold value and self-sovereignty to people in parts of the world that have nowhere else to turn to but DAI. Do any of us really expect them to use UST or USDT? They want… no… they NEED DAI. We need to retain our community at all costs to succeed. Complacency right now will be the end of us.   Restart the Burn So, in part… I understand why we shut off the burn. We had extreme slippage, and it appeared like we were just wasting money. The slippage was terrible, yes. It’s a consequence of our community kicking the can down the road about implementing any sort of marketing-making scheme… but it is what it is for now. If we burn, it will be with slippage. The other argument for not burning was that we need to save DAI in the treasury to accumulate for a true Black Swan. Maybe?? It just so happened that as that sentiment creeped in and we decided to pause Burning, it was at the exact bottom (so far, knock on wood) for crypto. Yes, I know Macro fell more later on. Anyway, we got all flustered and cash happy at arguably the worst time to hoard cash. Although it may seem like everything is dumping, as it stands, BTC and ETH are just holding a steady uptrend. (Yes, I know it looks ready to go to zero any day now… but how else does a market shake everyone out?) Basically, we started hoarding cash when it was time to deploy. As the market continues to appear worse and worse, we continue to hoard. Regrettably, no amount of hoarding will protect us from a Black Swan if one is coming. The SB will be drained instantly, MKR will be minted… and nice knowing all of you! At these prices, though, do we REALLY lack so much faith in our project that we wouldn’t buyback and burn when it’s undervalued by at least two orders? Finally, IMO, all price action below $2,000 MKR can be directly attributed to removing the burn.  Poll Detials We can restart the burn with a reduced lid parameter to mitigate many of the inefficiencies we faced on our last auction. We will burn at a slower rate but maintain our original revenue distribution model until we enter a new funding cycle and/or once a new tokenomics model is developed, has community approval, and is ready to be implemented. Note: The Risk Core Unit Team suggests reducing the hump to $54M, so I will be including that value for this Signal Request.     Lower the SB? | Restart the Burn?     Yes: Reduce hunp to $54M.  No: Take no action at this time. Abstain     0 voters     This poll will run until May 14th. 2022-05-02T00:00:00Z→2022-05-14T11:11:00Z If successful, an on-chain vote will be held to confirm the changes.  Note: This poll assumes @ultraschuppi’s Signal Request to change the lid Parameter on the Rate Limiter passes successfully. I will issue a second Signal Request to change the ‘lid’ parameter if it does not. An over;y aggressive burn will be inefficient.   Next Steps  If we opt to restart the burn, we should focus on fully developing a new tokenomics and revenue distribution model complete and ready to go for a seamless transition from one paradigm to the next. Everyone should put a post-it on their screen or tattoo it onto their forehead:  \"Never again switch up a narrative at a market cycle bottom.\" It’s great to experiment with new ideas, but save that for the euphoric stage of the market. There’s a lot more forgiveness in those times.      Burning & Aggressive Growth | A Potential Marriage We can design a very efficient burn schedule based on sentiment counter trading if we decide to retain a burn model down the road. It’s not very complicated and allows both strategies to coexist. The basic premise is to accumulate DAI for Aggressive Growth during manic market phases and burn during fear and capitulation phases. These phases are reasonably easy to identify and don’t require much data. If we opt to retain any kind of burn model, I would be happy to contribute here.  A Sample Burn Schedule  4511×2516 749 KB  The chart above shows market sentiment data from 2020 to the present.  The neon dots below change colors to indicate a shift in market sentiment.  The colors correspond to periods across the spectrum of the overall market sentiment. During Manic Phases, we should pause burning and accumulate for Aggressive Growth. During capitulation and fear phases, we should ramp up the burn.    Pink & Light Pink: Mania and Euphoria | Immediately cease burning. Accumulate into the treasury.  Orange & White: Neutral | Light burn. Predominantly accumulate into the treasury.  Blue: Fear | Crank the Burn  Green: Panic and Capitulation | Initiate Nitro Burn  Red: Extreme Capitulation | Activate Nitro Burn on Steroids     Note: - Red is the maximum level this indicator can theoretically output. - However, Red appears so infrequently that waiting for it is not practical.     Final Thoughts I know the burn model we had wasn’t perfect, but I hope I’m not talking to a wall here. I want to see Maker thrive. If there’s something so much better we can implement right now, then sure… but we’re notorious for moving slow. Aggravating? of course… but it’s how we’ve built our reputation. Every change and upgrade is checked twelve times before being implemented. We build to last, but let’s not bleed our talent and community.  Words of Wisdom  850×400 41.7 KB  Whatever your view on the market is… no matter your conviction, remember to pause and look around. Can you find anyone that disagrees with you?? If the answer is no, ask yourself… are you really in the minority? Maybe I’m the fool here, and everyone else is right.   Archived: Signal Request V1 ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn/14903/21",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-26-june-01-2022/15569",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-02-08-2022/15703",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn/14903/57",
                        "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
                        "https://forum.makerdao.com/t/governance-and-risk-189-thursday-may-05-17-00-utc/14965/2",
                        "https://forum.makerdao.com/t/signal-request-deploy-a-trial-permissionless-open-market-operation-resurrect-the-burn/15381",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-5/15049",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-5-11-2022/15154",
                        "https://forum.makerdao.com/t/monthly-governance-review-april-2022/14986",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-28-may-4-2022/14981"
                    ],
                    "GPT-summary": "The author proposes to restart the burn of MakerDAO's revenue distribution model, which was shut off at a market cycle bottom. The proposal suggests restarting the burn at a reduced rate until a new tokenomics model is developed and community-approved. The author argues that the burn is essential to retain investors and prevent a governance attack. The post includes a poll to vote on the proposal and suggests a potential burn schedule based on market sentiment. The post also emphasizes the need to focus on developing a new revenue distribution model and not switch up the narrative at a market cycle bottom.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.564664314961934
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/05/2022-20:48:46",
                    "content": "To kick off the discussion on this thread, I will reiterate a few things:  I am not pro-burn indefinitely. Buyback & Make is likely a superior model, and I would wholeheartedly support it.  Regrettably, it is not live yet. Once it is ready for deployment, I would fully support a shift to that model over pure burning.   I would like to work with Wintermute, as I have built a relationship with them and believe they are good actors. I would also like to see @MakerMan’s ideas implemented alongside for on-chain liquidity solutions that our protocol can directly earn revenue on. As it stands, the only tool that we have ready on hand to deploy is the burner. Everything else, no matter how much better it may be, is nowhere near to being ready for deployment. We cannot afford to lose any more of our community members who feel disenfranchised as they capitulate and abandon Maker.  The losses from this Brain Drain are incalculable and outweigh every other argument that favors delaying taking action until better tools are developed.   If we lose our community, we lose MakerDAO.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.979237867395763
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#3",
                    "likes": "7",
                    "time": "02/05/2022-21:27:52",
                    "content": "Just a disclaimer that this is not our official recommendation on the required SB as it may seem from the language used. Btw, not suggesting any bad faith, just want to point this out.     aburban90:  Note: The Risk Core Unit Team suggests reducing the hump to $54M , so I will be including that value for this Signal Request.   The $54m figure is taken out of context. I highly recommend reading this comment which explains and adds a lot of context to the figure. It is the minimum recommended SB size for debt collateralized by volatile assets. There are other sources of potential losses, such as protocol exploits and counterparty risk that we are exposed to which are not accounted for in the figure this SR reference to. Larger SB level is highly recommended to support expansion of new products and their DCs. For those that won’t read the V1 discussion, my comment. ",
                    "links": [
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818/16",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn-v1-xxx-canceled-refer-to-updated-v2-link-below/14903/18",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-may-2022/15631"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.769602272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#4",
                    "likes": "0",
                    "time": "02/05/2022-21:31:31",
                    "content": "F… Well… I’m not trying to push through an SB that Risk deems is too low. I would like to avoid making a V3 for this SR, but if $54m is the wrong number, it’s the wrong number. It was just the number I was advised to put. What is the right number? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.107142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#5",
                    "likes": "3",
                    "time": "02/05/2022-21:34:25",
                    "content": "Every DAI we can spare should be used to attract more users and to generate more DAI from all possible systems like for example D3M, a full success on Aave maybe to open up and build more systems we can’t imagine yet.  More vaults more useres deploy on other L2s more RWA more D3M other systems build on MKR marketing and communication  Especially in this market phase DAI is king, we don’t know how long it will go down and how deep, since we can’t time the market we should consider that we might have to take a big drop in sales and revenues maybe for years to come. I hope my comment is the bottom. Even if the market is very bad, it can crash another 1k in price to finally kick out all the doubters, if we now burn a little over 10k+ MKR and thus 16Million, I think exactly then in the weak market phases we should then use the cash and what is the picture for people working at the DAO that there might not be enough cash to pay them, SB is for risk according to the CU Risk, but we are ignoring that we should have also enough buffer to maintain the CU member and even if the protocol generates less fees, these should be paid according to the MIPs that we agreed and voted for. In principle, I do not accuse any CU of only wanting to milk the DAO. Burn when we have a robust 250 million SB, or when we have diversified revenue sources that give us good cash flow. At best, the optimised tokenomics where burn is redundant or a part of it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.634212962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#6",
                    "likes": "0",
                    "time": "02/05/2022-21:49:51",
                    "content": "    makercaesar:  in this market phase DAI is king, we don’t know how long it will go down and how deep, since we can’t time the market we should consider that we might have to take a big drop   DAI is King. Cash is King.     aburban90:  Can you find anyone that disagrees with you?? If the answer is no, ask yourself… are you really in the minority?   Oh… how much I would have loved to be all cash right now lol But alas… I am not! And if I was? I’d probably immediately deploy it. (That hasn’t worked so well the past 6 months the) But a question for you! Besides me… how many people disagree with you? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.076208513708514
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/05/2022-21:51:50",
                    "content": "Actually… not going to debate the market… I’ve been nothing but wrong for months lol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/josolnik",
                    "index": "#8",
                    "likes": "4",
                    "time": "02/05/2022-22:21:22",
                    "content": "    aburban90:  What is the right number?   The number depends on the specific protocol/ecosystem state and market shock that we want to be protected against. The recommended figure is $150m with more context in the comment that @rema referred to. This is a forward-looking measure that protects us against conditions similar to Q4 2021. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-may-2022/15631"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.982142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#9",
                    "likes": "2",
                    "time": "02/05/2022-23:24:03",
                    "content": "I voted NO. I would like to see a minimal MKR burn but if we just reduce the surplus limit to 54m then we 1) burn a lot or MKR right away and 2) cap the surplus buffer at 54m. As many have noted, there are good reasons to build up a much larger surplus buffer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.385714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#10",
                    "likes": "0",
                    "time": "02/05/2022-23:36:23",
                    "content": "    josolnik:  $150m   I would argue even this figure is too low. In the ballpark of $1-2B sounds about right to me. Though, in the current climate, I see no way for us to raise anywhere near $150M in a short time frame. Even with $150B in the SB, I see us as sitting ducks if a true black swan was to hit. I am not as pessimistic as everyone else about the market direction, but $50m, $70m, $150m… none of those will protect us. In our current state, we would have to fall back on our ultimate backstop. Minting MKR. To successfully cover insolvency, we would need deep liquidity and a high MKR price. We can address much of our liquidity issues using @MakerMan’s LP ideas coupled with further assistance from Wintermute. The next issue to address is the price of MKR itself. A sure fire way to ensure it doesn’t rise is to signal to our investors that we have no intention of burning and have no concrete plan to distribute revenue. I do not want to resort to ponzinomics to bring our price up. That’s against our ethos, but sending a signal to our investors that we don’t care about them compounds the risk to our protocol as they lose faith and dump. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.584457671957672
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#11",
                    "likes": "0",
                    "time": "03/05/2022-00:07:33",
                    "content": "If you check @ultraschuppi’s Signal Request, which is set to pass…. we reduce the burn rate by about a factor of 5. I would reduce it even more. I think burning $500-700k/day is sensible, but his SR is already set to pass, I opted to stick with his plan. It’s already a massive improvement over the limitless burn we had before. If enough people are dissatisfied with the burn rate, I am open to issuing a Signal Request to override @ultraschuppi’s to reduce the rate further. As ir stands, I expect the burn to last about 18 days under Schuppi’s model. I would have opted for a 30–35 day burn, but I’m not sure how relevant that difference is. The important thing is signaling to our community that we are dedicated to revenue sharing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#12",
                    "likes": "2",
                    "time": "03/05/2022-00:48:35",
                    "content": "    aburban90:  If you check @ultraschuppi’s Signal Request, which is set to pass…. we reduce the burn rate by about a factor of 5.   Reducing the lid to 1 just means that only 1 flap auction will occur at a time, so they would happen one after the other (instead of 5 concurrently as they would with lid = 5). It wouldn’t make much difference. We would still burn off all of the surplus buffer over 54m quickly and it would cease to grow.     aburban90:  If enough people are dissatisfied with the burn rate, I am open to issuing a Signal Request to override @ultraschuppi’s to reduce the rate further.   I don’t think it can be reduced any lower than 1. If we want a slow steady burn without capping the surplus buffer, we need a different mechanism. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#13",
                    "likes": "0",
                    "time": "03/05/2022-01:45:07",
                    "content": " image1920×1071 95 KB  I really want you guys to take a hard look at this image. This is a model I tried proposing a while back, but it was dismissed. Maybe I was too shy at the time? Maybe my delivery was off? If there’s anything unclear about it, please ask away, but I think it’s self-explanatory. I’ve labeled the periods during which we would have been nitro-burning, and the periods where we could have been accumulating Dai into our treasury. I accept blame for not pushing this idea harder at the time. We burned our treasury indiscriminately. Imagine if we had followed this model instead? We’d be sitting on A LOT more Dai right now, and a much tighter supply of MKR. It would have been a win on all fronts, and we’d have free capital to burn aggressively here. That’s in the past though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.565476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#14",
                    "likes": "0",
                    "time": "03/05/2022-01:57:20",
                    "content": "Open question to everyone who voted yes on V1, but no on V2: Given the tools we have at hand, what parameters would you have preferred I proposed in V2? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#15",
                    "likes": "4",
                    "time": "03/05/2022-04:38:57",
                    "content": "As much as I love burning, I unfortunately think burning is a short sighted initiative.   In case of extreme market crash or hack where Surplus Buffer takes a hit and goes negative and has to auction MKR to replenish, MKR price will likely to go far lower. So it’s best to have sufficient SB to prevent such auction from happening.   Having a higher SB allows the protocol to fund needed initiatives as well as willing to take risks to expand. For example, SB is currently crucial for expanding multichain as SB acts as risk absorption. And we can see from other defi protocols that multichain can be extremely profitable for Maker as well.     twitter.com    Marc Zeller @lemiscate  The@AaveAave revenue on $AVAX is about to flip mainnet with only 30% of its market size  V3 emode is a beast  Wat happens wen similar emode setup launches on polygon & optimism?  Wat happens wen mainnet upgrade to V3?  Wat happens wen Portals fees kick in?  Do your homework anon https://t.co/CBCg72lAg8   10:12 AM - 2 May 2022           230                22            ",
                    "links": [
                        "https://twitter.com/lemiscate/status/1521070117915922434?t=_N6PODrS6i3Z-RbqoiXV8A&s=19",
                        "https://twitter.com/lemiscate/status/1521070117915922434?t=_N6PODrS6i3Z-RbqoiXV8A&s=19",
                        "https://twitter.com/AaveAave",
                        "https://t.co/CBCg72lAg8",
                        "https://twitter.com/lemiscate/status/1521070117915922434?t=_N6PODrS6i3Z-RbqoiXV8A&s=19"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2890625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#16",
                    "likes": "2",
                    "time": "03/05/2022-06:04:29",
                    "content": "    aburban90:  The basic premise is to accumulate DAI for Aggressive Growth during manic market phases and burn during fear and capitulation phases. These phases are reasonably easy to identify and don’t require much data   I think one reason why this isn’t being discussed is that it’s unclear how exactly to identify those phases when looking into the future. Our growth is indeed correlated with ETH price but I don’t think identifying how those prices will change in the future is as easy as you’re suggesting. You have to know how aggressively to burn/not burn before that phase actually begins. If this model worked well, all of us could buy ETH during the burn periods and sell them during the growth periods and be quite rich. That’s only usually possible with the benefit of hindsight  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.7689393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#17",
                    "likes": "0",
                    "time": "03/05/2022-07:18:28",
                    "content": "This model we built actually has a 100% success rate,  over years. Unfortunately, it’s designed for spot accumulation trading, which is boring, Once you add leverage into the mix, the 100% success rate rapidly turns negative lol ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.714285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#18",
                    "likes": "2",
                    "time": "03/05/2022-07:28:19",
                    "content": "    aburban90:  This model we built actually has a 100% success rate, over years.    press-x-to-doubt-la-noire1400×700 39.8 KB  On serious note, it’s difficult to be consistently profitable ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.716666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#19",
                    "likes": "1",
                    "time": "03/05/2022-07:37:13",
                    "content": "    Doo_StableLab:  On serious note, it’s difficult to be consistently profitable   Oh… I know it all too well! The strategy says buy spot and DCA into a range… Did I hear someone say Nitro Leverage!?   Fast forward a few months, the strategy continues to suggest DCA into spot. Meanwhile, I’ve nuked my account.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.557291666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#20",
                    "likes": "7",
                    "time": "03/05/2022-08:10:05",
                    "content": "I voted No on this Signal Request. Aggressive Growth and organic DAI demand are the way forward. While I understand the theoretical risk of hostile takeovers and disgruntled MKR holders, I’ve come to the conclusion that reinstating MKR burn with the parameters outlined is not a good business decision. When I think about a company increasing stock buybacks as revenue goes down… It just doesn’t seem right. I know this analogy is a bit of a stretch, but the basic thinking behind it holds. Growing Maker means to grow organic DAI demand. Burning MKR has no effect on that. Maker is leading innovation in RWF and D3M, and there are some other low-hanging fruits it could reasonably pick to increase DAI demand. Many of those have been outlined in the comments here. From lending more aggressively to startup DAOs to lobbying for DAI at payment providers. Also, MakerMan has a good point here:    [Signal Request] Restart The Burn  [V1] xxx [Canceled] [Refer to updated V2, link below]   DeFI now offers DAOs much better tools to invest capital that earns return and satisfies DAO goals, the flapper mechanic is completely outdated and a waste of resources.   I’m one of the people in this conversation with little Maker experience, but for me, it all doesn’t add up. If there’s one thing I learned in my life and my career it is this: Never act from desperation. It only leads to more pain. We need to act from a clear vision and from inspiration about what MakerDAO will be in 10 years. How will it look if we win? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.443303571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#21",
                    "likes": "6",
                    "time": "03/05/2022-09:51:39",
                    "content": "From reading through all the comments, it seems that this discussion is less about the burn itself, and more about a general frustration from a large group of community members that the protocol no longer returns profits/value to token holders (also see: A Letter to the CUs on Community Impatience and Trust). To paraphrase @Traster_Tray, Maker has shifted away from the initial ‘social contract’ that MKR investors originally signed up for. If that’s the case, maybe the right discussion is less about whether to restart the burn, and more about working out how Maker can address this challenge:     aburban90:  As it stands, we have no concrete plan in place to distribute revenue. We removed what we had but are yet to replace it with anything new.   Even if this signal does not pass, it seems important to address these valid concerns. Maybe a new system for distributing part of the protocol’s profits to tokenholders could be tied to reaching a certain target level on the Surplus Buffer (say, 250m). This could provide more certainty (essentially a new social contract) for community members that share the concerns above. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.853715728715728
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#22",
                    "likes": "2",
                    "time": "03/05/2022-15:32:59",
                    "content": "    aburban90:  If enough people are dissatisfied with the burn rate, I am open to issuing a Signal Request to override @ultraschuppi’s to reduce the rate further.   you can’t have a lid lower than bump - this would reduce burning to 0  we can tune lid and bump down even more, but this would not be good for keepers as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.87037037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#23",
                    "likes": "0",
                    "time": "03/05/2022-15:47:43",
                    "content": "Another option would be in increase tau but also lessens the incentive for keepers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#24",
                    "likes": "4",
                    "time": "03/05/2022-16:02:25",
                    "content": "    rspa:  I’ve come to the conclusion that reinstating MKR burn with the parameters outlined is not a good business decision.   I can agree with you here. I don’t know what the best parameters are necessarily. I chose values that were suggested to me. With the current vote distribution, it looks like this SR is set to pass, but I don’t want it to pass by a razor thin margin. That shows we don’t have community alignment on this subject remotely.     rspa:  MakerMan has a good point here:    [Signal Request] Restart The Burn  [V1] xxx [Canceled] [Refer to updated V2, link below]   DeFI now offers DAOs much better tools to invest capital that earns return and satisfies DAO goals, the flapper mechanic is completely outdated and a waste of resources.     He really does have a good point, and I have nothing but the utmost respect for him. Yet, I feel like he’s been trying to push this idea through months now, and it’s gained no traction whatsoever. Our community just doesn’t seem seem interested in implementing his ideas any time soon, or ever. Either from apathy, overstretched bandwidth, or simply not understanding the value add his ideas will bring.     rspa:  Never act from desperation.   I am guilty of this right now… yes. For the first time in the seven years I’ve been supporting Maker, I feel like we are facing an existential threat to our existence as we bleed out talent and long time supporters due to our inaction. Capital can be lost and gained, but losing a community is much harder to recover from. I don’t believe we’re past the point of no return. I do believe we can still turn this around.     Matt_NZ:  To paraphrase @Traster_Tray, Maker has shifted away from the initial ‘social contract’ that MKR investors originally signed up for.   This ^ I invested into MKR based on its foundational social contract.  Good Governance → MKR burns, and the protocol provides the only buy pressure Poor Governance → MKR dilutes, governors suffer the consequences  To me, that was a perfect equilibrium and quite an ideal incentive structure. It requires no outside buyers to deliver value to holders. I feel like that narrative has been lost. One side of the balance is live (the mint), while the other is being deliberated on with no particular timeline in sight… “soon” —- So, yes… burning here may be symbolic. It’s a signal to our remaining investors that we still honor returning value to them on the original foundational principles that led them to stay with our community in the first place. Also, I really struggle to find a good argument why we wouldn’t buy back our own shares at such a deep discount… at least a little.     Matt_NZ:  Even if this signal does not pass, it seems important to address these valid concerns. Maybe a new system for distributing part of the protocol’s profits to tokenholders could be tied to reaching a certain target level on the Surplus Buffer (say, 250m). This could provide more certainty (essentially a new social contract) for community members that share the concerns above.   Months away… at best…. and we’ll continue to bleed out our community every day we take no action.     ultraschuppi:  you can’t have a lid lower than bump - this would reduce burning to 0  we can tune lid and bump down even more, but this would not be good for keepers as well.   Maybe $54m was too aggressive. I could raise ‘hump’ to $60m or $65m. We would burn just a nominal fraction of our SB, while still demonstrating commitment to our foundational values. From there, raise ‘hump’ incrementally until something viable to replace the burn is live. —— Re raising organic demand for Dai? The entire space is waiting for us to launch on L2’s. Just launching MCD on Arbitrum alone will open the flood gates . Is having $5-15m more or less in our treasury really what’s holding us back from that? ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688#shall-we-set-the-lid-to-30k-dai-2"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.62326146076146
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#25",
                    "likes": "1",
                    "time": "03/05/2022-16:13:00",
                    "content": "    aburban90:  Maybe $54m was too aggressive. I could raise ‘hump’ to $60m or $65m. We would burn just a nominal fraction of our SB, while still demonstrating commitment to our foundational values. From there, raise ‘hump’ incrementally until something viable to replace the burn is live.   my point is: regardless if we drop the hump to 65, 60 or 55 MM - in any case we are just going to have a 1.44MM DAI/d selloff - a couple of days of … a flash in the pan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#26",
                    "likes": "5",
                    "time": "03/05/2022-16:27:13",
                    "content": "You wouldn’t buy even $5m of MKR below $2k? If we as a protocol won’t buy MKR at these insane prices… what message does that send to the rest of the world and to our holders? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 0.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#27",
                    "likes": "1",
                    "time": "03/05/2022-16:38:34",
                    "content": "An entity should be able to recognize when it is severely undervalued, and take advantage of it. Look at Google the other day. They recognized that they were obviously oversold. What did they do with their treasury? Fund new developments? Hoard more cash at all costs? No. They did a massive buyback. They know that the market is mis-pricing them. They understand that holding cash and building their reserves at this stage of a market cycle is suicide. Cash is not king. It was in November, but hat time has passed. Today, cash is toxic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.842803030303029
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#28",
                    "likes": "0",
                    "time": "03/05/2022-16:44:59",
                    "content": "Meanwhile, we were doing buybacks the entire time we should have been hoarding cash. We burned through our treasury with no regard for what stage of the market cycle we were in. When we should have been saving, we were spending. Now, it’s time to buy, and we went to save. Can’t change the past. What’s done is done. I think very few of us have done well in this market, but we can at least recognize and admit some of our wrongs. (I think I’m just ranting at this point… but, I don’t think anything I’m saying is wrong.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.69
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#29",
                    "likes": "4",
                    "time": "03/05/2022-16:57:28",
                    "content": " image827×508 69.1 KB  Soon  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#30",
                    "likes": "2",
                    "time": "03/05/2022-20:20:04",
                    "content": "I voted YES, but mostly to support the sentiment. But I think we should do something better than burning. For example use the new DssKiln just announced here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.893939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#31",
                    "likes": "2",
                    "time": "03/05/2022-22:27:06",
                    "content": "I voted No - it’s unfortunate to backpedal and see this topic reopened soon after the previous vote passed. I’ll restate my position that although burning did bring in community members, it’s not an effective way to grow value to Maker and its holders. I understand that everyone, myself included, would like the value of MKR to appreciate. However, burning acts as a bandage. The real solution relies on growth activities through a beefed-up SB to increase revenue and the protocol’s fundamental value. It won’t result in overnight appreciation, but developing the core value props will get us there. As for revenue distribution, there are some exciting conversations ongoing for new, innovative DAO governance and token models. These ideas go above and beyond the burning mechanism to return value to the community. I’m looking forward to seeing those ideas develop for the future of the DAO. For now, we’re in tough times, and focusing on building real value is how we weather the storm. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.400367309458218
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#32",
                    "likes": "2",
                    "time": "03/05/2022-23:19:30",
                    "content": "    aburban90:  For the first time in the seven years I’ve been supporting Maker, I feel like we are facing an existential threat to our existence as we bleed out talent and long time supporters due to our inaction.   I get that and am very sympathetic to your concerns. Innovation, success and a clear and potent vision are the best ways to retain and attract talent and supporters. I do understand, or at least can sympathize with, how difficult it can be to reach for a seemingly far off, even elusive goal when faced with real adversity. But let’s do this right. You started an important discussion with this thread, I feel. One that ties into a larger one concerned about the future of the protocol. Let’s sit with that for just a while longer. I’m confident that very good things will come from that. For what it’s worth I shifted my weekly crypto DCA from NEAR to MKR. Won’t move the price much, I’m afraid, but here is my token of confidence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.971894409937888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#33",
                    "likes": "0",
                    "time": "03/05/2022-23:24:55",
                    "content": "    MightyOx:  beefed-up SB   Regrettably, we torched our SB burning carelessly throughout euphoric stages of the market cycle. Burning while everyone chanted “UP ONLY” was probably unwise in hindsight. We blew our “beefed-up SB”  burning with no rhyme or reason. It’s no surprise that the burner’s performance was abysmal. Now that “Cash is King” we’re terrified to burn.     MightyOx:  it’s not an effective way to grow value to Maker and its holders.   Yes, it was inefficient. Yes, there are much better models being built than straight burning and DssKiln is promising. Though, since the vote to stop burning passed, we’ve lost a huge portion of our community. These are people that left for good and are not coming back. I’m not sure how to even assign a value to that loss. Thankfully, we’re still retaining many of our core dedicated supporters… but even they have a breaking point. From the close split of this vote alone, it’s clear that this is an issue that matters to a good portion of our community. We all want aggressive growth and progress. We want to reinvest into MakerDAO and see it grow to its full potential. We all want to see it succeed. Is it unreasonable to view burning here as an investment? It’s an investment in retaining community members that have stuck with us this far. A single burn (at a great price), a small price to pay imo, with high upside.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.059642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#34",
                    "likes": "2",
                    "time": "04/05/2022-00:11:33",
                    "content": "Just out of curiosity I asked our wonderful intern Nhat to create a chart of DAI supply vs MKR price.  Screenshot 2022-05-04 at 01.09.233434×656 164 KB  I don’t see a lot of correlation there. So I think we can put the hypothesis that MKR prize creates DAI demand to rest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#35",
                    "likes": "1",
                    "time": "04/05/2022-00:16:19",
                    "content": "    rspa:  DAI supply vs MKR price   Oh ya, there was never any correlation. The majority of people I’ve come across that are novices to crypto know of DAI and have never heard of MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party giving feedback on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#36",
                    "likes": "3",
                    "time": "04/05/2022-00:47:03",
                    "content": "I like it. Especially the part where the burn is following market sentiment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#37",
                    "likes": "2",
                    "time": "04/05/2022-01:01:21",
                    "content": "Well what I see is negative Dai growth. I honestly dont know what the Dai from the SB are being spend on. But I know what will have an effect on more Dai-> L2 minting and EuroDai. I might not know much but what I know is that people invested in MKR (me included) due to the burn (and ofcourse faith in the brilliant engineers behind it and the safety above all approach from MKR). MKR is supposed to be like an insurance policy. Letting MKR devalue that much is irresponsible. And its going to get worse in regards to Eth-MKR ratio in a few months after the merge if there is no burn. Also there is no relieve insight. I will still continue to use exclusively DAI but I put my MKR purchases on indefinite hold. Also I think the burn mechanic is very tax efficent value acrual. For the people that dont believe in it please observe whats going to happen with Ether longterm after the merge. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.489583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#38",
                    "likes": "2",
                    "time": "04/05/2022-01:20:50",
                    "content": "Its not desperation its simple logic. Higher MKR price attracts more buyers means more liquidity for MKR that also means that incase of a blackswan there is more liquidity to secure Dai. Higher MKR Price leads to more security and credibility for Dai. With no upside but only potential risk why would anyone buy MKR? Whats the logic behind that? Governance is not a sought after quality in a token, see UNI going from 22 Billion to 4.5 Billion. (Uni is only at thar price because people hope that a value acrual mechanism is going to be released) In summary, lower MKR price leads to less security and make DAI overall less appealing atleast to the people who understand. Taking care of MKR price is as important as funding development. There must be a balance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.901960784313726
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#39",
                    "likes": "2",
                    "time": "04/05/2022-04:15:32",
                    "content": "I think what you really should plot is dai from non stablecoins.  That is where the revenue comes from and that’s where I would expect MKR’s value to be associated with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dobby",
                    "index": "#40",
                    "likes": "3",
                    "time": "04/05/2022-04:33:58",
                    "content": "    rspa:  Growing Maker means to grow organic DAI demand. Burning MKR has no effect on that.       Ber10:  Higher MKR Price leads to more security   I find it difficult to dispute either one of these statements. Maybe @Matt_NZ’s idea of distributing a portion of protocol profits to tokenholders once we reach a certain threshold on surplus buffer is a good way help both causes.     Traster_Tray:  I think what you really should plot is dai from non stablecoins. That is where the revenue comes from and that’s where I would expect MKR’s value to be associated with.   I would also be curious to see this! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.885204081632653
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#41",
                    "likes": "1",
                    "time": "04/05/2022-08:39:47",
                    "content": "    Traster_Tray:  I think what you really should plot is dai from non stablecoins.   Working on it  Time for me to be more precise: I’m not against MKR burn as a matter of principle, nor do I think MakerDAO should neglect the price of MKR.     rspa:  reinstating MKR burn with the parameters outlined is not a good business decision.   I don’t think the parameters are right, and I don’t think the reviving the old mechanism, on merit of its existence is right. I love the dialogue about how to best achieve the aim of making MKR holders wealthy, and want to see this as a part and parcel of an overarching strategy to improve Maker’s position. Thanks to @aburban90 for kicking this off. As I said, I have limited experience with Maker. But I’m constantly inspired by the smart people here. Hard not to be bullish. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.157539682539683
                },
                {
                    "author_link": "https://forum.makerdao.com/u/simonr0204",
                    "index": "#42",
                    "likes": "6",
                    "time": "05/05/2022-02:07:55",
                    "content": "If there is no mechanism for Maker to distribute returns to holders, then MKR is worthless; a circular argument unto itself. If the value proposition is now solely that it buys you a vote in the governance process, then how does that vote actually benefit the holder? If they vote diligently, and prudently, and intelligently, the platform can be a success, and even generate revenue - but then what? We can talk about “aggressive growth” or “deploying the reserves” etc. etc., but all that must be a means to some end that returns value to the holders. Otherwise holding Maker is nothing but downside, since it’s the collateral of last resort. You can’t blame todays holders for not trusting governance that one day they will be made whole. To an outsider, it looks very much like governance has been reactionary / improvised on the fly ever since the DAO transition. I consider that the burn was the mechanism that wasn’t meant to be turned on and off at will. Governance has taken something beautiful in its simplicity and started playing “Central Bank” with it - a role which I can’t help but feel it is ill equipped to perform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#43",
                    "likes": "1",
                    "time": "05/05/2022-02:56:57",
                    "content": "This vote is becoming very contentious. Win or not, I do not like the split. I’m seeing some people that voted yes on V1, voting no on V2. @rema is suggesting I pause this SR for a V3, one that includes DssKiln w/ a plan to purchase ETH and MKR on a regular monthly cadence. IMO, a monthly cadence is arbitrary and not an efficient way to deploy capital. However, it appears that the $54M parameter I chose is part of what’s contentious. Personally, I would like to see us burn about $500k-750k/day until May 15th and reassess from there on out. @rema has other ideas. I will leave this V2 live for now. If we get a better V3 ready tomorrow, I will cancel this one. The clock is ticking on our window to burn. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.030681818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#44",
                    "likes": "5",
                    "time": "05/05/2022-11:01:32",
                    "content": "Related to this although not exactly the same thing: Maybe it’s time to sell the Treasury’s ENS holdings and swap that over to MKR. I’ve personally never seen the value in holding ENS (or other governance tokens) long term. Maybe ETH/BTC but those are in a different league. The strategic value of other protocols’ governance tokens is very unclear. The ENS token has had a decent rally lately while MKR is down in the dumps making it a good moment to swap. I did suggest we offload it a while back and it would have been more profitable to do so back then but now isn’t a bad time either. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.995915032679738
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#45",
                    "likes": "1",
                    "time": "05/05/2022-15:14:05",
                    "content": "MakerDAO - Non-Stablecoin DAI (dune.com) Here you can see those two… Again no correlation.  image1703×362 47.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#46",
                    "likes": "2",
                    "time": "05/05/2022-15:23:34",
                    "content": "So actually I think there is a correlation except that at the end of 2021, core unit expenses (opex) rose dramatically.  I probably should have suggested adding that line to the plot as well…but I don’t know that the CU expense data is readily available.  You’d have to look at all the expense reports (which I think only started mid 2021) for accurate data.  But if you want to go by mkrburn’s data, you’ll see why price stopped going up even though revenues went up. Of course, the crazy ups and downs of the wider market probably had an effect too…  I’d be curious to see the price plotted in eth.  But thanks for doing the work!  Very interesting to examine and study. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#47",
                    "likes": "2",
                    "time": "05/05/2022-15:29:35",
                    "content": "i think starting in Jul 2021 I see no correlation at all. Why would correlation break at that time? Did it exist? Given the overall timeframe I would say no. If you just chose Jan - Jul 2021, you could say yes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#48",
                    "likes": "2",
                    "time": "05/05/2022-15:36:37",
                    "content": "yup one wants to see consistent correlation that suggests actual causation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#49",
                    "likes": "0",
                    "time": "05/05/2022-15:42:30",
                    "content": "Apologize for the crude screenshot but look at this chart from mkrburn.  Caveat that mkrburn annualized SB expenses for past 3 months so this is not completely accurate.  But take a look at this chart and see what you think happened July 2021.  image750×953 74.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.0833333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#50",
                    "likes": "1",
                    "time": "05/05/2022-16:40:41",
                    "content": "hmm… i wouldn’t jump to a conclusion just yet. Okay correlation departed at the same time as SB expenses jumped. What is the peak in July? After that MKR price rises as assets flatline. Then in Oct 2021 we start seeing non-stable assets really ramp up and price decline. What does that tell you? I don’t see a clear result here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#51",
                    "likes": "4",
                    "time": "05/05/2022-17:53:09",
                    "content": "Well, I’m not going to say I understand all the factors at work but I’ll tell you my thoughts.  Ethereum hit a peak in May, crashed, and then ran back up at a slower pace from July to September.  What was unfortunate was that Ethereum ran back up to an even higher place in November but MKR did not participate in that rally at all.  My conjecture is that the expanding CU budgets being proposed made a big impact in there and even though the underlying revenue did rise with eth price, there was negativity with rising expenses and the ending of the mkr burn. Anyway, it’s all good if those investments bear fruit.  Theoretically the CU expenditures are supposed to eventually produce growth.  But we don’t see it yet so some investors are probably losing trust that CU investments are actually bearing fruit.  Maybe it will bear fruit but it seems like it’s going to take awhile.  The promise of RWA is that we can finally grow without being so tied to the crypto markets.  If you see revenues start growing from non-crypto collateral, I think MKR price will start to become more disconnected from the broader crypto market.  But crypto loans basically make up all of our revenue right now so it will be awhile before that actually happens. If you are a long term investor, you really have to remind yourself that the protocol is still profitable so if you believe in the vision, you can give it time to bear fruit.  There still isn’t too much in terms of competition for crypto bridging into the real world so it’s not clear how all this will end up.  There are a lot of risks that give us some urgency though.  There’s a lot more competition on the crypto side so if MKR loses market share on its bread and butter crypto collateral, revenue will go down.  Or if the fed interest rate actions start affecting DAI demand, and you’re forced to defend the peg by increasing the DSR, spending will go up.  And if we ever start to be unprofitable without clear revenue growth…well, look out below. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.359126984126984
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#52",
                    "likes": "3",
                    "time": "06/05/2022-06:26:33",
                    "content": "It would be great if we could demonstrate that we’re committed to our holders today, but burning here would be purely symbolic. The parameter I chose was arbitrary, and it wouldn’t go into effect for some time anyway. The window will have passed, but there will always be another window! Still, the absence of a revenue distribution model is clearly an important issue to many of our community members. The conversation started here was necessary and should continue. I will pause this vote for now, but if @rema and I can devise something sensible, we’ll relaunch this in a V3.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.269132653061225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#53",
                    "likes": "7",
                    "time": "06/05/2022-09:13:22",
                    "content": "Thank you @aburban90 for considering our concerns and hearing us out! Me and Burban discussed this SR extensively and agreed that it is contentious as the current vote outcome is very tight and there is general lack of consensus on the topic. We also agreed that burning MKR must resume asap as it is an integral part of our community, even if the amount burned is symbolic. We are working on a new solution, which will include burning and allow growth of the surplus buffer simultaneously. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.95422077922078
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#54",
                    "likes": "0",
                    "time": "12/05/2022-20:49:15",
                    "content": "Just wanted to chime in on the topic of ENS tokens as I’m very enthusiastic about the strategic significance of metaGovernance. ENS is unique and an important infrastructure for the future of how the masses will interact with Web3. We very much want a stake in that community. Co-sign @ultraschuppi comments on the post you referenced.     Proposal: Use the ENS airdrop to subsidize MKR holder onboarding into ENS Proposal Ideas       Off-topic here, but it does not have to be costly. We could also just delegate to one/some of the >1000 ENS-delegates - I already spotted @monet-supply and @MakerMan on the list, and I will be active there as well. I am also fine with just keeping it in the treasury for now until we have the bandwidth to do something with it. I just want to avoid dumping it right now    ",
                    "links": [
                        "https://discuss.ens.domains/t/ens-dao-delegate-applications/815",
                        "https://discuss.ens.domains/t/ens-dao-delegate-applications/815/742",
                        "https://discuss.ens.domains/t/ens-dao-delegate-applications/815/1153",
                        "https://discuss.ens.domains/t/ens-dao-delegate-applications/815/881"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.490029761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Breezy",
                    "index": "#55",
                    "likes": "1",
                    "time": "27/05/2022-00:01:24",
                    "content": "This is such a powerful statement.  We should be burning.   It was always a core principle of Maker.  The halt was due to inability to code a solution to slippage.  If the Core Units are unable to solve, then we should turn back on and acknowledge we will have slippage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.675000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#56",
                    "likes": "0",
                    "time": "26/06/2022-10:01:54",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}