{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/what-can-we-learn-from-the-wir-franc-how-makerdao-can-become-a-force-of-global-economic-stabilization/10445",
            "title": "What can we learn from the WIR Franc? -- How MakerDAO can become a force of global economic stabilization ",
            "index": 10445,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#1",
                    "likes": "10",
                    "time": "22/09/2021-19:05:45",
                    "content": "To read about the WIR Franc, also known as the “Swiss WIR,” check out the following links:  Swiss WIR—80 Years of Stability No One Knows About - Global Genius Currency WIR Currency – Reinventing Social Exchange - Resilience WIR Bank - Wikipedia  Gemeinschaft. Mehrwert. Schweiz. | Die Bank WIR - Bank WIR (homepage in German, French and Italian) https://base.socioeco.org/docs/wir_and_the_swiss_national_economy.pdf  In 1932, as the world was enduring the worst year of the Great Depression, Silvio Gesell, a German-Argentine merchant and amateur economist, brought forward the idea of a “community currency” that would exist alongside State-issued fiat. In 1934 the idea was formally implemented in Switzerland by two businessmen named Werner Zimmermann and Paul Enz as the “WIR Franc.” The word WIR stands both for “we,” as the WIR was intended to be a community and supplementary currency – supplementary meaning that it was intended to compliment rather than compete with State-issued fiat – and for Wirtschaftsring, which roughly translates to “the economic circle.” The WIR Franc has been circulating in Switzerland for almost 90 years now with a nearly flawless record of fiscal stability and its issuing agency, the “economic circle”, is structured as a sort of cooperative. MakerDAO community members may find the mechanics of the WIR Franc familiar. A WIR is generated when a borrower pledges collateral to the cooperative. The cooperative then permits the borrower to generate a fraction of the fiat-value of this collateral in the form of newly minted WIR and credits it to the borrower. The borrower pays an interest rate on this loan in WIR. The WIR is pegged 1:1 with the Swiss Franc and is kept in line through a variety of economic incentives, principally the ability to cancel debt at face value. When WIR is repaid, it is destroyed. If a borrower does not comply with the terms of their loan, their collateral serves as the primary method of cancelling the debt. So what can we learn from the WIR Franc? For one, something very similar to the MakerDAO model (albeit more centralized) has been empirically tested for nearly a century in Switzerland. It works. Yet this empirical evidence produces some results that I do not believe we’ve currently contemplated at MakerDAO. In Switzerland, the WIR acts as a complimentary currency to the Swiss Franc because of its place in the business cycle. When the economy is doing well, WIR has little demand and credit flows easily from the country’s banks. Yet when the economy turns down, and credit is scarce, the WIR becomes popular and helps to stabilize the Swiss business cycle. Now, the WIR is strictly limited to Switzerland given its various constraints (specifically the lack of the international loan demand in Swiss Franc), but Dai is a global currency that compliments and supplements the world’s reserve currency. An often overlooked mechanism in MakerDAO is that historically when crypto asset prices decrease, Maker is incentivized to source more credit, not less. This is in contrast to the legacy banking system where credit is generally reduced in economic downturns. At scale, MakerDAO can have the same stabilizing effect on the global business cycle that the WIR Franc has had on the Swiss economy for almost 90 years. But what are we missing? A key component of the WIR Franc’s economic stabilization force is that the members of its cooperative will accept WIR at “face value” (i.e. 1:1 with the Swiss Franc) as payment for goods and services, regardless of its market price. This is something with which MakerDAO should reward its current/future borrowers and integration partners for implementing. Let me illustrate why this matters with an example. Let’s say that MakerDAO lends Dai to an invoice factoring company and things go south. The factoring company has a significant percentage of its loans in default and barring some kind of intervention, will cause a drain on the surplus buffer. But this invoice factoring company, as part of its deal with MakerDAO, must accept Dai at face value for the repayment of its loans. Maker can now examine the defaulted borrowers, lend directly to defaulted borrowers who can survive the economic downturn, and in doing so drive MakerDAO’s loan to the invoice factoring company back into compliance. It also ensures that the end borrower (likely a supplier) accepts Dai at face value in exchange for its goods and services, increasing Dai demand in the real economy. Maker has now (1) gained new, higher margin business (effectively refinancing the debt of the factoring company at a higher rate by going directly to the end borrowers), and (2) helped to stabilize the economic sector that the factoring company is lending to. Let’s also use a crypto example. Maker intends to lend Dai into the Aave D3M. Suppose that Aave has a credit crisis and our Dai is at risk, causing Dai to trade down to $0.95. This will cause all those depositing Dai as collateral in Aave to risk liquidation, which would exacerbate the Dai instability. The same dynamic would play out in the other direction, in that borrowers of Dai would risk liquidation if Dai was trading above the peg. Liquidations due to Dai instability almost always cause further Dai instability in a vicious cycle, and cause needless overall instability in DeFi protocols. If Aave were to “hard code” Dai into their system at $1 rather than using a DAI/USD oracle price, this would create a more frictionless experience for borrowers and a more aligned on-chain economy. So what is the takeaway? I believe that MakerDAO should subsidize and give preference to borrowers who agree to integrate Dai, at face value, across their own supply chains. This will provide MakerDAO a competitive advantage at the trough of the credit cycle and create network effects that could last for centuries. If it wished to mimic some of the mechanics of the WIR system, MakerDAO could (in coordination with the growth team?) create a sort of cooperative that is governed with NFT membership to manage this network. Additionally, companies like RWA Co. can attempt to source borrowers that will provide a good fit for the overall Dai ecosystem.  Bonus: Negative rates are (empirically) not a solution to Dai instability \"The hoarding of money which Gesell found so inimical to the national economy is to be thwarted by applying a constant devaluation mechanism, thus forcing money to circulate. At first glance this notion appears to contradict the postulate of price stability. But Gesell discovered a sophisticated trick for resolving the contradiction. A bill with a face value of 100 francs would maintain its buying power. But in order for it not to lose its validity, the user would be obligated to paste a stamp worth e.g. one franc on its reverse side every month. Annually, then, the money would be subjected to a negative interest of 12%. This device was practiced in WIR’s early years, from 1934 to 1948. It proved less than fully useful, however, and was finally dropped.\" Credit: https://base.socioeco.org/docs/wir_and_the_swiss_national_economy.pdf ",
                    "links": [
                        "https://www.resilience.org/stories/2016-09-28/wir-currency-reinventing-social-exchange/",
                        "https://en.wikipedia.org/wiki/WIR_Bank",
                        "https://www.wir.ch/de/",
                        "https://base.socioeco.org/docs/wir_and_the_swiss_national_economy.pdf",
                        "https://base.socioeco.org/docs/wir_and_the_swiss_national_economy.pdf",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-17th-23rd/10475"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.517521086717515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#2",
                    "likes": "4",
                    "time": "22/09/2021-20:00:17",
                    "content": "Good writeup @g_dip and I see your point. Why it would be hard to convince Aave to hardcode DAI is simply because if for some reason the price of DAI increases during a volatile event (PSM breaks or whatever) they wouldn’t want to have their loan book off balance, because some borrowers might need to deleverage anyway at that moment so they aren’t liquidated. And they wouldn’t want to give the borrower the impression his loan is fine, while he actually needed to buy DAI with a premium on the market to deleverage. Now, I think MakerDAO is fairly confident that PSM will prevent DAI going off-peg so all should be fine. If Maker proposes to Aave to hardcode the DAI price to 1$, Aave might think we aren’t confident in PSM maintaining the peg. They would also need to monitor our governance all the time to see if we potentially decide to abandon PSM for some unknown reason. Don’t also forget there could be Emergency Shutdown triggered in some edge case scenario and how bad potentially this could be for Aave if DAI price is hardcoded but DAI claimable underlying assets for some reason decrease in value. It also depends what exactly you are concerned about. There is chainlink oracle malfunction risk which has nothing to do with a PSM mechanics preserving the peg. This would probably be the number one reason why we wanted DAI to be hardcoded to $1. But if we are afraid of chainlink failure risks, we would be exposed to it anyway, since D3M’s DAI deposits will be borrowed and collateralized by crypto assets, valued at chainlink prices. TL;DR we can try proposing it, we obviously have some leverage, but I can also see good arguments why they wouldn’t accept it. And if we believe PSM will work flawless, there is no issue, if we are afraid of chainlink failure, we’ll have problems anyway even if DAI is hardcoded. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.389583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/09/2021-20:02:01",
                    "content": "This is super interesting Greg—I learned something new today, “WIR”, cool. Question? From the articles you posted, WIR seems to be a seasonal currency and its also used as a currency to purchase goods. From your write-up, you stated that if an RWA (collateral type)business defaults—Maker can try to stabilize other components of said business (suppliers/distributors)  to revitalize the borrowers ecosystem—what type of resources (maybe more RWA & Risk CUs) will Maker need to have in place to provide analysis if funding the ecosystem is profitable? (Maybe I’m getting go ahead here) And with regards to granting integration partners with a hard coded/pegged DAI—what does it entail? Is it as easy as minting say, 500M DAI and providing it to AAVE at par? I don’t think I’m understanding that part correctly. It also sounds like there won’t be a need for an oracle price feed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1477272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#4",
                    "likes": "2",
                    "time": "22/09/2021-21:13:46",
                    "content": " Maker has now (1) gained new, higher margin business (effectively refinancing the debt of the factoring company at a higher rate by going directly to the end borrowers)  Also a riskier a business. IMO “hey, the middleman can’t pay us back, let’s lend directly to the people who can’t pay him back instead” sounds to me like neither a sound nor scalable proposition.  Suppose that Aave has a credit crisis and our Dai is at risk, causing Dai to trade down to $0.95.  Not sure I understand this scenario. What exactly does “credit crisis” mean?  I believe that MakerDAO should subsidize and give preference to borrowers who agree to integrate Dai, at face value, across their own supply chains.  Enforceability of this seems very doubtful. In the WIR case, they have recourse to men with guns if there is a breach of contract. Much harder to get recourse on a public blockchain.  Bonus: Negative rates are (empirically) not a solution to Dai instability  They seem to be working pretty well (empirically) for RAI so far. In general, I agree with what Primoz wrote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2213713219148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "0",
                    "time": "22/09/2021-21:51:21",
                    "content": "This is clever. Not sure if it would be good or bad for Maker, though ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.895833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#6",
                    "likes": "1",
                    "time": "22/09/2021-22:55:42",
                    "content": "    Kurt_Barry:  Also a riskier a business. IMO “hey, the middleman can’t pay us back, let’s lend directly to the people who can’t pay him back instead” sounds to me like neither a sound nor scalable proposition.   If our borrower has already defaulted due to these sub-borrowers being delinquent, financing them with enough Dai to repay our borrower should have a net-0 impact on our balance sheet - we’re just refinancing the bad debt at a higher rate (most likely). Obviously these kind of actions would be circumstantial, but I’d argue that if there’s the ability to secure real world integrations for Dai with a net-0 balance sheet impact, we should do it.     Kurt_Barry:  Not sure I understand this scenario. What exactly does “credit crisis” mean?   E.g. Aave governance lets in a shitcoin that goes to 0 and some of the Dai that we’ve minted into the D3M is now technically unbacked since it is circulating without corresponding collateral.     Kurt_Barry:  Enforceability of this seems very doubtful. In the WIR case, they have recourse to men with guns if there is a breach of contract. Much harder to get recourse on a public blockchain.   I don’t think this is enforced contractually. It would be much easier to use a “carrot” in saying that the borrowers rates will be subsidized to the extent that they can prove to us that they are using Dai, which if they can’t the rate just goes back to the normal level. Kind of like the recourse we’ll have with Institutional Vaults.     Kurt_Barry:  They seem to be working pretty well (empirically) for RAI so far.   Correct me if I’m wrong, but I don’t think that RAI is widely integrated across the ecosystem? It seems to be relegated to a niche currency used by decentralization maximalists. The average person can’t use RAI as a savings mechanism because it punishes them for doing so, they’re better off in cash. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.212890625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#7",
                    "likes": "0",
                    "time": "23/09/2021-02:04:38",
                    "content": " E.g. Aave governance lets in a shitcoin that goes to 0 and some of the Dai that we’ve minted into the D3M is now technically unbacked since it is circulating without corresponding collateral.  Ah okay makes sense. The flip side of hardcoding DAI=$1, for AAVE, is that they take on a different kind of risk: when the market price of DAI is sub-$1, people can take out larger loans against DAI on AAVE than they otherwise should be able to. Similar to price delay risk in Maker. This can further endanger AAVE’s solvency.  It would be much easier to use a “carrot” in saying that the borrowers rates will be subsidized to the extent that they can prove to us that they are using Dai, which if they can’t the rate just goes back to the normal level. Kind of like the recourse we’ll have with Institutional Vaults.  A soft mechanism like this is fine when all is well, but the agreement will be quickly abandoned in the kinds of serious deviations discussed earlier in the thread.  Correct me if I’m wrong, but I don’t think that RAI is widely integrated across the ecosystem? It seems to be relegated to a niche currency used by decentralization maximalists. The average person can’t use RAI as a savings mechanism because it punishes them for doing so, they’re better off in cash.  Fair point that RAI is not widely integrated yet, but it’s also newer and lacks the huge first-mover advantage of DAI. RAI is remarkably stable for having a floating peg: https://twitter.com/ameensol/status/1420048250925506561 . And finally, on a philosophical note–a fair money should buy a roughly constant portion of production independent of time. This means that fair money should have an intrinsic rate. When production is increasing, the rate is positive, and when production is decreasing, negative. Obviously there’s no guarantee that RAI’s target rate tracks real economic output (at least without scale), but it’s much closer to how a fair money should work than DAI, which attempts to artificially privilege savers by exposing them to only positive rates which comes at great expense to the resiliency of the protocol (see >50% of assets are now USDC). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.898928307464893
                }
            ]
        }
    ]
}