{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/el-camino-del-compliance-y-el-camino-de-la-descentralizacion-por-que-maker-no-tiene-otra-opcion-que-prepararse-para-un-dai-de-libre-flotacion-traduccion/17530",
            "title": "El camino del Compliance y el camino de la Descentralizaci\\xc3\\xb3n: Por qu\\xc3\\xa9 Maker no tiene otra opci\\xc3\\xb3n que prepararse para un Dai de libre flotaci\\xc3\\xb3n [Traducci\\xc3\\xb3n] ",
            "index": 17530,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "translate",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#1",
                    "likes": "10",
                    "time": "30/08/2022-14:52:26",
                    "content": " TL;DR:  La regulación financiera tiende hacia un paradignma posterior al 9/11 de “o estás con nosotros o estás contra nosotros\" con una eventual tolerancia cero por cualquier cosa que no le otorgue plenos poderes de control y vigilancia al Estado. La ventana de oportunidad para que DeFi demuestre que es digna de un nuevo punto medio de ser considerada una utilidad financiera y neutral, en vez de regulada como los bancos, ahora se ha cerrado porque DeFi no pudo entregar nada de valor real, y las caídas masivas de Terra, Celsius, etc. Arruinaron su imagen generalizada. Las medidas estrictas físicas contra las criptos pueden ocurrir sin previo aviso y sin posibilidad de recuperarse, ni siquiera para los inocentes usuarios legítimos. Ésto viola dos supuestos centrales que utilizamos para entender los riesgos de los RWA, lo que hace la amenaza autorizaria mucho más seria. Dai no puede entrar en listas negras, por lo que Maker no tiene la opción de cumplir con las normativas. La única opción es entonces limitar la superficie de ataque reduciendo la exposición de los RWA a un porcentaje mínimo del colateral total - ésto requiere libre flotación separado del USD. El Endgame Plan ofrece dos eficaces herramientas para lidiar con ésto: MetaDAOs y Protocol Owned Vault. El farming de MetaDAO token con Dai proporciona la justificación de porque debe existir una moneda de libre flotación y porque los usuarios deben aceptar algo que cae de valor frente al USD. Los MetaDAO tokens también pueden incentivar mayor suministro de Dai generado desde un colateral descentralizado, permitiendo al sistema escalar mejor mientras se mantiene descentralizado. Protocol Owned Vault (Maker acumulando una gran cantidad de ETH apalancados) es otra herramienta importante, ya que permite a Maker obtener ingresos de la Target Rate negativa de Dai, y poner un límite inferior a lo negativo que puede ir la Target Rate.   Publicación completa Éste post es para esbozar el argumento de porque es necesaria la exposición limitada a los RWA y la libre flotación de Dai, y las herramientas que podemos utilizar para convertirla de un riesgo en una oportunidad. Mucha de la información y la opinión que estoy compartiendo aquí proviene de conversaciones que mantuve con varias personas muy bien conectadas con información privilegiada al tanto de las sanciones a TC, así como el conocimiento que está públicamente disponible y que, en algunos casos, ha sido compartido más privadamente durante los últimos años.  El paradigma de la regulación financiera post 9/11 Para comenzar, hablemos brevemente sobre lo que he oído a mucha gente referir como el “paradigma post-9/11)”. Basicamente ésto es una tendencia regulatoria financiera que, cuando es llevada al extremo, divide a toda la actividad financiera en dos casillas: O eres un banco regulado que cumple plenamente las normas, o eres un terrorista. Es importante notar que es una tendencia, no una realidad en blanco y negro, lo que obviamente significa que existe mucha actividad financiera que no está completamente regulada como un banco con un control total gubernamental - pero a traves del tiempo la tendencia va en ese único sentido y la libertad financiera se erocionará, nunca aumentará mientras tanto se mantenga esa tendencia. Por supuesto que el control gubernamental de las finanzas es una tendencia histórica que data literalmente desde la primera invención del papel moneda en China (y como fue finalmente controlada e hiperinflacionada), pero el 9/11 puede ser visto como el evento que realmente creó el impulso moderno de ésta tendencia hasta llegar al punto donde, lenta pero seguramente, va a ahogar todas las formas de libetad financiera que pueda. El hecho de que la corriente mayoritaria vea a las finanzas como una industria extremadamente turbia manejada por muchachos malvados y codiciosos de Wall Street por supuesto ayuda, porque desde esa (bastante cierta) perspectiva es fácil ver porque tiene sentido regularlas al máximo hasta los cimientos.  La ventana de oportunidad La ventana de oportunidad es una idea que yo y muchos otros sostuvimos: La posibilidad de que los inmensos beneficios potenciales de la tecnología blockchain y DeFi, cuando se aplican al sistema financiero a través de las interacciones de RWA, podrían convertirse en el catalizador que finalmente cambie el paradigma de la regulación financiera alejándose del paradigma post-9/11 e ingresando en un nuevo paradigma post-blockchain. Es fácil ver como las ventajas de la transparencia, la neutralidad creíble, la eficiencia, la inclusión, etc. Ayudan a resolver los problemas que hacen que las finanzas y los muchachos de Wall Street parezcan tan malos en primer lugar. Ideas como Dinero Limpio (del inglés \"“Clean Money”) e Inclusión Financiera (del inglés “Financial Inclusion”) surgieron de ésta perspectiva, que si jugamos bien nuestras cartas y utilizamos el último gran bull run cripto para mostrar beneficios tangibles reales más allá de los que la gente estaría esperando que realmente muestren el masivo potencial positivo de blockchain al público mayoritario, como la financiación masiva de infraestructura de energía renovable a gran escala que efectivamente hizo el trabajo de los gobiernos, o acceso a gran escala de servicios financieros accesibles y eficientes para países en desarrollo, etc. En un cierto punto, si se hacen suficientes cosas, y se combinan con una campaña de prensa y PR alineada y efectiva, y visión unida de nuestra industria, la idea es que podría ser suficiente para finalmente demostrar que existe un límite para cuando tiene sentido seguir tomando medidas estrictas, aumentar el control y aumentar la burocracia para la acticidad financiera, porque la ventaja en términos de bienes públicos (del inglés, “public goods”) de innovación financiera sin permisos es imposible de ignorar, y puede superar las políticas del viejo paradigma e intruducir uno nueva tercer categoría que se ubique entre la completamente regulada y la completamente descentralizada: Un Bien público Financiero (del inglés “Financial Public Good”)\" - infraestructura financiera neutral habilitada por blockchain que no sea tratada como un banco, sino que sea tratada como roads o Linux. Incluso si Corea del Norte usa roads o Linux obviamente no vamos a prohibir eso debido al valor significativo que aporta a toda la sociedad. Pero lamentablemente, como probablemente imaginan, ésta ventana de oportunidad se ha cerrado ahora para siempre. En primer lugar, la industria blockchain ha completa y totalmente fracasado en producir algo de valor durante el bull run. Básicamente nada se ha logrado y ningún nuevo producto, servicio ni nada con beneficio tangible derivado de la tecnología blockchain ha entrado en la conciencia mayoritaria a ningún nivel. Maker es un buen ejemplo en el que tuvimos mucho apoyo inicial para Clean Money y un acuerdo teórico con el concepto - nuestras intenciones estuvieron en el lugar correcto. Pero a nadie le importan las intenciones, y fuimos incapaces de actuar concretamente sobre esos deseos y convertir las palabras en acciones, porque, como resulta, operar DAOs y hacer un trabajo útil en paradigmas descentralizados es extremadamente difícil. En segundo lugar, y mucho peor que el simple hecho que cripto haya fracasado en demostrar cualquier tipo de valor a la sociedad, están las tragedias humanas que produjeron el fracaso del último ciclo cripto y que se ha convertido ahora en sinónimo de blockchain y cripto para la conciencia pública. Esencialmente, el momento en que Terra colapsó es realmente el momento en que debimos darnos cuenta de que simplemente no hay posibilidad de que podamos persuadir al público de que cripto debería ser tratada de forma diferente a otros servicios financieros. Por ello, no sólo cripto no ha producido nada útil, sino que la conciencia mayoritaria sobre cripto se centra alrededor de desastres como Terra, Celsius y otros scams cripto que han destruído los ahorros de personas inocentes normales a las que se les mintió y en algunos casos incluso como resultado se han suicidado. Lamentablemente, logramos crear una imágen dominante de los “crypto bro” como un tipo de persona que es incluso peor que los banqueros “Wall Street bro”. En retrospectiva, tal vez haya sido algo ingénuo creer en la ventana de oportunidad cuando la deconstruyes a lo que realmente es: Pensar que tuvimos una chance de rediseñar una meta tan fuerte como el 9/11… Pero sin importar si alguna vez ha sido o no posible, ahora se acabó para siempre y necesitamos reajustar nuestra visión para ponernos en línea con la realidad.  Los dos supuestos centrales de riesgo de los RWA Las sanciones a TC no deben ser vistas como consecuencia directa de ninguno de éstos factores - más bién es más probable que sea aleatorio, incluso que no tenga nada que ver directamente con cripto, sino que simplemente fue un intento rápido y de corto plazo orientado para producir una victoria política a través de algunos anuncios y comunicados de prensa. Pero es un llamado de atención a las consecuencias de elegir uno de los caminos. ¿Quieres ser tratado como un banco, o quieres que te traten como algo más que un banco y entiendes todo el riesgo y las consecuencias de ello? El riesgo de las RWA siempre se consideró justificable, a pesar del hecho que las DAOs no tienen presencia legal real o entidad o capacidad para ejercer los derechos legales (incluso si los gobernantes erróneamente así lo piensan), en razón de dos factores importantes. El primer factor era que cualquier intento de embargar RWA o tomar medidas enérgicas contra los puntos débiles de las cripto, tal como listas negras o congelar colaterales, se telegrafiaría con antelación para otorgarles un tiempo de respuesta a los usuarios inocentes y legítimos. La idea era que los gobiernos no destruirían a Maker y causarían un daño extendido a personas inocentes, sino que simplemente prohibirían a Maker basarse en sus sistemas legales sino seguímos sus regímenes regulatorios. Eso resultó ser erróneo, ya que en el caso de las sanciones a TC fue mantenido en secreto hasta que se soltó la trampa, y los usuarios inocentes (por suerte una poca cantidad) tuvieron congelados sus USDC en los smart contracts de Tornado Cash. El segundo factor era la idea de que incluso si se produjera el congelamiento o embargo del colateral de los RWA, los usuarios inocentes tendrían alguna vía para recuperar su dinero, tal como en el caso del Value Access Plan (VAP) de e-gold. E-gold - Wikipedia. Lamentablemente, resulta que eso no ha sido otorgado como se ha visto con las sanciones a TC, donde ahora mismo pareciera que aquellos afectados por las listas negras de USDC puede que hayan efectivamente perdido su dinero, y los ETH designados como riesgosos puede que no tengan una vía sencilla para legalizar sus activos, incluso si son completamente inocentes y usaron TC por privacidad financiera completamente legítima. Ésto significa que las consecuencias de cumplir con la normativa y no convertirse en un banco son expremadamente severas. No son cosas con las que se pueda jugar, especialmente cuando se trata de los ahorros de la gente.  Por qué Dai no tiene mas opción que prepararse para flotar libre Así que eso nos deja con las dos opciones fundamentales: El camino del cumplimiento y eventualmente, en una línea de tiempo lo suficientemente larga, convertir a Maker en una especie de producto/neo banco de nueva generación de fintech. O el camino de la descentralización, lo que significa limitar estrictamente el grado en que las medidas severas pueden dañar al protocolo. Pero hay una advertencia importante: El camino del cumplimiento no está disponible para nosotros. ¿Por qué? Dai fue diseñada de esa forma, ya que los desarrolladores que la crearon tuvieron la previsión de construirla de una forma tal que nunca pudiera convertirse en una herramienta de vigilancia y control financiero, bloqueando por completo la posibilidad de que se puedan agregar una lista negra o que se pueda actualizar. A pesar de toda la burocracia y los problemas de nuestro gobierno, Dai en este sentido realmente es una stablecoin verdaderamente descentralizada. Existen ciertos hechos públicamente descubiertos, que cuando se combinan juntos con el hecho que Dai no puede nunca ser blacklisteable no importa cuanto la Governanza de Maker quisiera hacerlo, deja en claro que hay una cuenta regresiva sobre nuestras cabezas, y que en algún momento del futuro hay una alta probabilidad que Maker sea golpeado por un ataque severo por parte de autoridades mundiales, dirigido a cualquier superficie de ataque que puedan encontrar, a traves de un proceso similar al que llevó a las sanciones a TC. Una cosa que aclarar es que es muy probable que ésto ocurra dentro de muchos años - o al menos tenemos que asumir que ese es el caso, porque simplemente no tenemos ninguna opción realista en el corto plazo que nos permita sobrevivir a eso.  Tampoco estoy afirmando que eso esté garantizado, nada lo está. Nadie puede predecir algo tan complicado como esto, pero si tuviera que hacerlo, le daría “sólo” un 50/50 de probabilidades que ocurra en algún momento de la próxima década. Pero si sabes que hay un 50% de probabilidades de que un avión vaya a estrellarse, no vas a abordar ese avión. Obviamente no voy a detallar los hechos a los que me refiero anteriormente, pero es bastante sencillo sumar dos más dos a la luz de los eventos recientes. Animaría a los demás a no hablar de ello en público, no hay motivos para crear esta clase de atención no buscada y peligrosa tan temprano, incluso si aún probablemente no es un gran riesgo. Como resultado, debemos elegir el camino de la descentralización, como siempre fue la intención y el propósito de Dai. Y así como este fue el diseño original de Dai, eligiendo el camino de la descentralización, significa prepararse para la probable posibilidad que Dai tenga que volverse de libre flotación. La razón de ésto es simple: el camino de la descentralización significa límitar nuestra supericie de ataque a las amenazas físicas, y específicamente nuestros colaterales RWA como un porcentaje de nuestra cartera total. En el Endgame Plan puse este límite en el 25% (antes de aplicar medidas de seguro y defensivas) durante la Eagle Stance, que es la estrategia que el protocolo emplearía mientras no sea claro si realmente habrá o no medidas severas. La única forma de garantizar un límite estricto sobre la exposición de los RWA es permitir que Dai flote libre, ya que el exceso de demanda de Dai puede no ser capáz de ser satisfecho con el suministro adicional respaldado por activos totalmente descentralizados como ETH. La única forma entonces de lidiar con este desequilibrio y prevenir que se rompa el peg - que puede romper el sistema completo si se pierde la fé en que la Governanza de Maker tomará medidas para proteger el peg - es introducir una Target Rate negativa, que haría que el precio de Dai flote libre lejos de 1 USD a un tipo de cambio más bajo, alejando la demanda de Dai y aumentando el suministro de DAI a medida que se vuelve más barato de generar con vaults decentralizadas como ETH. Ésta puede ser una realidad muy dificil de aceptar, pero lamentablemente no hay forma de evitarla. Los intentos de Dunning-Kruger de garantizar un peg a 1 USD sin tener acceso a USD vinculados a colaterales RWA sólo terminan en una miseria y desastre aún peor, como el colapso de Terra. Por lo que nuestra única opción es prepararnos y hacer todo que posiblemente podamos para que sea una transición a la Maker pueda sobrevivir, y si realmente jugamos bien nuestras cartas, puede terminar conviertiéndose en la oportunidad que Maker estaba esperando por todo éste tiempo.  2 poderosas herramientas que puedan hacer que la libre flotación de Dai sea un éxito El mayor desafío con la descentralización y la libre flotación de Dai es que nadie se preocupa sobre ello hasta que es demasiado tarde. I me refiero a LITERALMENTE nadie, incluso la gente que adopta un personaje y se dedica a hablar sobre la descentralización no está usando Rai. Así que la desventaja de la descentralización, que es que se puede perder valor en relación al dólar, es extremadamente obvia y en tu cara, y la mayor parte de las ventajas está completamente oculta y no puede ser entendida por el cerebro humano en razón de nuestra incapacidad de percibir el riesgo de cola y a largo plazo. El Endgame Plan proporciona dos herramientas muy fuertes que pueden superar este desafío y convertir la libre flotación de Dai en algo a lo que Maker pueda sobrevivir, e incluso prosperar. El Endgame Plan ya estaba diseñado desde el principio alredor de la idea de resiliencia física y descentralizada, sólo que se trataba más como una amenaza teórica y abstracta, por lo que lo único que realmente había que cambiar era priorizar y acelerar la implentación de éstas medidas.  MetaDAOs y MetaDAO tokens La herramienta más importante disponible son las MetaDAOs. ¿Cuál es la única forma de lograr que alguien acepte una libre flotación de precio y una tasa decreciente que le haga perder valor en términos de dólar con el tiempo? Tienes que darle algo más a cambio. Resulta que, mientras que la descentralización casi sólo tiene desventajas, existe una ventaja tangible que a la gente realmente le importa. Y no es cualquier ventaja, es la cosa más poderosa que en primer lugar atrajo a la mayoría de la gente al espacio cripto: La capacidad de crear tokens. Como también se describió en el post del Endgame Plan, la creación de tokens de blockchain es por lejos la forma más poderosa de meta-ingeniería, y es en efecto tan poderosa que incluso los gobiernos reconocen este poder y con mucha fuerza tratan de cerrarlo y controlarlo. Con una moneda descentralizada, se vuelve posible la creación de una economía descentralizada dirigida por empresas descentralizadas gobernadas por tokens, y no puede ser cerrada o controlada por las autoridades a pesar de cuanto les gustaría - en tanto tengas una real y propiamente descentralizada que la respalde. Y puedes proporcionar estos beneficios a los holders de Dai “en su cara” por el yield farming de tokens MetaDAO de proyectos que tengan modelos de negocios reales, rentables, sustentables y completamente descentralizados - pero de nuevo, esto sólo es posible debido a la existencia de una moneda totalmente descentralizada, que cierre el ciclo y justifique el hecho de que Dai es de libre flotación. Mas allá de la justificación de la existencia de Dai, incluso si es de libre flotación, el yield farming de tokens MetaDAO también puede utilizarse para incentivar la generación de Dai descentralizado desde colaterales completamente descentralizados como Staked ETH (o, para la preservación máxima del valor, EtherDai), lo que ayuda a hacer crecer el suministro de Dai y a reducir las tasas negativas que los holders de Dai tienen que aceptar.  Protocol Owned Vault La otra herramienta principal es la Protocol Owned Vault - la estrategia de hacer que el propio Maker acumule grandes cantidades de Staked ETH apalancados, y de ésta forma se convierta en un emisor neto de Dai completamente descentralizado y sobrecolateralizado. Este tiene dos grandes ventajas: En principio, permite a Maker aprovecharse de las tasas negativas creadas por la demanda natural de Dai, que en realidad será exacerbada por la existencia de yield farming de MetaDAO (que sin embargo tiene que existir porque proporciona la justificación nucleo fundamental de porque Dai incluso tiene algún sentido si no tiene peg con el dólar). Debería ser fácil de ver como puede ser muy lucrativo tener una significante exposición apalancada de un activo que gana un rendimiento de mas del 5% anual, y luego, sobre eso, tiene grandes cantidades de deuda que en sí mismas podrían rendir por ejemplo un 5% al año, debido a las tasas negativas que lo hacen bajar automatimaticamente en el tiempo en términos de dólares. Segundo, y mucho más importante, tener una Protocol Owned Vault, permite a Maker controlar e impactar más directamente en que tan negativas pueden llegar a ser las tasas, ayudando a estabilizar la libre flotación de Dai y proteger a los usuarios contra la incertidumbre de ser golpeados aleatoriamente por tasas extremadamente negativas debido a algún shock de demanda o el suministro. Básicamente, si las tasas bajan lo sufiente, Maker puede intervenir y permitir que la Protocol Owned Vault tome un apalancamiento muy alto para, en primer lugar, estabilizar las tasas para que no bajen más, pero también, para cosechar el masivo potencial de rendimiento que tiene la deuda con tasas muy negativas.  Meta Cypherpunk Un último beneficio importante de la descentralización y la libre flotación de Dai es que permite a Maker volver finalmente a sus verdaderas raíces. No sólo las raíces de Maker y Dai, sino de cripto en sí mismo, que en última instancia proviene del movimiento Cypherpunk desde principio de los 90´s, cuando los gobiernos intentaron por primera vez prohibir la encriptación y formar un futuro distópico infernal donde el concepto de cualquier tipo de privacidad personal se convierte en ilegal (muy similar a lo que ya se convertido la privacidad financiera). Es defícil exagerar cuantos de los problemas culturales, comunitarios y de gobernanza de Maker se basan, en última instancia, de la desviación percibida de este ethos original, y de la contradicción de muchas de las medidas necesarias tomadas a lo largo del tiempo, tal como la estrategia regulatoria de Maker Foundation (que requiere un control muy estricto de la información), o la intrucción de USDC ilimitado con el objeto de forzar a toda costa el peg con el USD. Al final, no creo que esas decisiones hayan sido erróneas en ese momento, en tanto nos permitieron llegar a donde estamos hoy y tener verdaderos efectos de red, impulso y éxito. Pero no debemos subestimar el costo que tuvo para la comunidad y el alma del proyecto - y ahora tenemos la oportunidad de recuperar todo eso. Creo que este es en realidad el factor que puede terminar siendo el mayor comodín de todos. Si podemos recuperar ese espíritu original y nuevamente demostrar estar a la vanguardia de todo el esíritu cripto como lo fuimos una vez cuando fuimos pioneros de las stablecoins on-chain realmente funcionales y creamos DeFi, se creará un nivel completamente nuevo de atención y meta positiva en torno al ecosistema de Maker en su conjunto, que resultará en una afluencia de usuarios, miembros de la comunidad y contribuyentes - pero también aumentar la chispa en la Governanza de Maker, reduciendo la burocracia, el estancamiento y las intenciones extractivas. Maker no sólo volverá a ser emocionante otra vez, sino que será el lugar más emocionante e importante para estar en todo cripto - y tenemos la herramienta perfecta que nos permite capturar esa meta y enganchar a la gente hacia nuestro ecosistema: MetaDAO yield farming.  Meta Colapso Otro último punto que es importante debatir es como todo esto encaja en la meta global más ancha y global causada por el estado de declive irreversible y acelerado que existe en la moderna civilización globalizada. Hay multiples factores, inclupidos, la volatilidad, la sobrepoblación, el cambio climático, el pico el petróleo, el pico de las tierras cultivables, el pico de los fertilizantes, la postverdad de los medios de comunicación, etc. Es probable que el capitalismo global moderno no pueda superar estos problemas que él mismo creó, y la consecuencia más inmediata es que la política se volverá cada vez más polarizada y desequilibrada. El mundo va a entrar en un nuevo equilibrio mucho más caótico e impredecible dominado por el anarquismo, ecofascismo, la desglobalización y el sufrimiento humado a gran escala. Esto es importante para Maker y Dai por dos razones. La primera razón es que los Estados rotos y las economías zombies que conjean, o los Estados obsesionados con controles de capital y el autoritarismo general, tienden a ser más propensos a tomar medidas mas enérgicas contra cripto. Es fácil ver esta tendencia si observas la lista de países que ya prohibieron cripto: Bitcoin ban: These are the countries where crypto is restricted or illegal | Euronews Esto significa que a medida que la economía glogal y la estabilidad socioeconómica progresivamente se desmoronan a lo largo de la mayor parte del mundo, aumenta la probabilidad de un ataque físico por actores estatales contra Maker. Como esta tendencia está aceleredándose y es irreversible, esto por sí mismo agrega otro fuerte argumento a la pila de porque Maker tiene que prepararse para ir hacia la completa descentralización y esperar lo peor contra los colaterales RWA, lo que requiere volverse hacia la libre flotación. La segunda razón es que un futuro tan caótico y distópico es exactamente la razón por la que existe Dai y cripto en su conjunto. La gente necesitará harramientas para navegar en el futuro cuando ya no se pueda confiar en el gobierno y la élite para siquiera mantenerse frente al colapso, dejándo de lado tener en mente los mejores intereses de la gente. La herramienta más importante y poderosa en tal situación va a ser el dinero descentralizado y resiliente al colapso. Mientras todas las otras monedas echan combustible al fuego del esquema ponzi financiero global, que ya está profundamente sobrepasado, podemos prepararnos para lo peor y enfocarnos en la acumulación de colaterales resilientes como ETH, o incluso eventualmente RWA físicamente resilientes (como se describió en el post del Endgame Plan) y construir algo que pueda terminar significando la diferencia entre la vida y la muerte de millones.  Esta es una traducción libre del topic: The Path of Compliance and the Path of Decentralization: Why Maker has no choice but to prepare to free float Dai de @rune Créditos: Traducción @Marian - Revisión @Brigith238 - Contribución @cryptenthusiastic ",
                    "links": [
                        "https://www.euronews.com/next/2022/08/25/bitcoin-ban-these-are-the-countries-where-crypto-is-restricted-or-illegal2",
                        "https://forum.makerdao.com/t/the-path-of-compliance-and-the-path-of-decentralization-why-maker-has-no-choice-but-to-prepare-to-free-float-dai/17466"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.540091036414566
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#2",
                    "likes": "3",
                    "time": "31/08/2022-13:49:49",
                    "content": "Éste topic se complementa con éste otro que publicó posteriormente Rune donde aclaró algunas cuestiones sobre la libre flotación de Dai, los tiempos y lo que debería ocurrir según su opinión y propuesta para que eso eventualmente suceda: Timeline del Endgame Plan para la libre flotación de Dai [Traducción] ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#3",
                    "likes": "1",
                    "time": "01/09/2022-02:40:16",
                    "content": "Muy buen laburo en la traducción de un post tan largo y complejo, la verdad que aún para quienes manejamos el idioma inglés tenerlo en español lo hace mucho más accesible. En líneas generales me parece bien el planteo de Rune en éste caso. El segundo posteo de Rune fue más conciso pero muy clarificador. El contexto está cambiando y hay mucha incertidumbre sobre cómo van a evolucionar las normativas y las regulaciones. Es importante que Maker planifique para distintos escenarios y estar preparados para los más hostiles. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#4",
                    "likes": "4",
                    "time": "01/09/2022-14:48:22",
                    "content": "El segundo posteo fue necesario para aclarar mucha desinformación y tergiversación que andaba dando vuelta en twitter y sitios de noticias especializados que amplificaron de forma aislada la idea de la perdida del peg. Comparto la necesidad de que Maker planifique que hacer, sea con ésta propuesta, con modificaciones u otra superadora, pero las regulaciones contra las stablecoin son inminentes y es importante tener un plan de acción preparado y ejecutarlo, así no hay que actuar de urgencia cuando las regulaciones ya estén vigentes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}