{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-onboarding-call-30-solidblock-wednesday-april-14-17-00-utc/7052",
            "title": "Collateral Onboarding Call #30: SolidBlock - Wednesday, April 14 17:00 UTC ",
            "index": 7052,
            "category": [
                "Collateral Onboarding",
                "Collateral Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-collateral"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "2",
                    "time": "16/03/2021-19:07:28",
                    "content": " Collateral Onboarding Call #30: SolidBlock - Wednesday, April 14 17:00 UTC  SolidBlock1280×720 51.3 KB  Time in your local-timezone format: 2021-04-14T17:00:00Z  Dial In Details Zoom call Passcode: RWA-WG  Intro An open discussion where we discuss projects and potential assets for MCD, open for anyone to join. If you’d like to present, check out this thread.  Agenda  Intro by @juan   SolidBlock - https://solidblock.co/  MIP6: [SB-LDB] MIP6 Application: SolidBlock Democratizes Real Estate with London Digital Bonds - A Smart & Tradable Property Investment “SolidBlock is a smart contract development and management platform for tokenized assets. In other words, SolidBlock transforms real estate, a traditionally illiquid asset into tradable security through tokenization. Its claim to fame was the Aspen Coin - the first-ever tokenized commercial real estate project in the world whereby SolidBlock raised $18M in 4 months for the luxurious St. Regis Ski Resort in Aspen Colorado. The Aspen Coin was listed on tZERO in Sep 2020 (amidst the COVID-19 crisis), traded by over 700 customers with over 4-8% of its market cap traded every month. The issuance price was $1 and the current price stands at about $1.30 (30% premium). The SolidBlock team is hustling, simultaneously, working on diverse tokenization projects for residential, commercial, and hospitality-based properties in the United States, Europe, and Asia”  Attn: @amyjung, @juan, @longforwisdom, @aaron_bartsch, @davidutro, @sebventures, @flipflopflapdelegate, @aburban90, @monet-supply, @psychonaut, @planet_x, @Haiku, @gustav_arentoft, @williamr, @Philinje ",
                    "links": [
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715/",
                        "https://forum.makerdao.com/u/juanjuan",
                        "https://solidblock.co/",
                        "https://forum.makerdao.com/t/sb-ldb-mip6-application-solidblock-democratizes-real-estate-with-london-digital-bonds-a-smart-tradable-property-investment/6276",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/24",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-135-thursday-april-1-17-00-utc/7206/5",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-25-30-2021/7275",
                        "https://forum.makerdao.com/t/maker-relay-ep-38/7249",
                        "https://forum.makerdao.com/t/collateral-onboarding-calls-listing-2021-edition/6566",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/22",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-133-thursday-march-18-17-00-utc/6982/5",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-12-18-2021/7089",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-april-9-15-2021/7510",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-39/7330",
                        "https://forum.makerdao.com/t/maker-relay-ep-39-en-espanol/7360",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-135-thursday-april-1-17-00-utc/7206/2",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-april-5-8-2021/7381"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.047991071428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Anna",
                    "index": "#3",
                    "likes": "2",
                    "time": "15/04/2021-01:44:49",
                    "content": "Replay of this call Collateral Onboarding Call #30: SolidBlock - April 14, 2021 - YouTube ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#4",
                    "likes": "3",
                    "time": "20/04/2021-03:44:35",
                    "content": " Collateral Call Summary - Episode #30  April 14th, 2021  Agenda   00:00: Intro with Juan Guillén  00:42 SolidBlock with Yael Tamar  46:53: Outro   Video https://www.youtube.com/watch?v=bUXASghHv88  Introduction  Juan Guillén  Agenda and Preamble 00:00  Welcome to MakerDAO Collateral Call #30. I’m here with a bunch of people interested in real-world finance and real-world assets on-chain. We are joined by SolidBlock. Yael is with us and will be explaining a bit more about the project. Discussions about collateral happen in the Forum.   SolidBlock  [SB-LDB] MIP6 Application: SolidBlock Democratizes Real Estate with London Digital Bonds - A Smart & Tradable Property Investment   Yael Tamar  Presentation (00:42)  1920×1080 181 KB   1920×1080 181 KB   1920×1080 225 KB   1920×1080 150 KB   1920×1080 191 KB   1920×1080 165 KB   1920×1080 144 KB   1920×1080 185 KB   1920×1080 217 KB   1920×1080 202 KB   1920×1080 149 KB   12:01 — ?: What is the state of the market right now? UK is coming out of lockdown and I know there was a window of time in which a lot of great deals would be available. Where do you think we are in that window?   13:29 — Juan Guillén: How do you see the collaboration with Maker? How do you see the dynamics or the amount of money that would be needed?   16:01 — Juan Guillén: If you had to give more concrete numbers on how much money or the interest…?   17:30 — Sébastien Derivaux: One piece I’m not following completely is what is the loan-to-value in this SPV, because the SPV have all the assets and you issue loans against those assets. But what is the LTV?   19:40 — Sébastien Derivaux: So you try to raise US$20M for tokens which back your notes. What is the value of the notes compared to the value compared to the real estate in SPV?   21:27 — Sébastien Derivaux: Let’s say you’re making the first balance sheet of the SPV, Delaware SPV. At the end of the year let’s say you have US$20M for the notes. How much equity do you expect to have on the balance sheet?   23:18 — ?: How is it going with Centrifuge?   24:45 — ?: Could you describe a little bit about your token?   27:41 — Payton Prose: It seems like a lot of the project SolidBlock has brought to Maker so far are region-specific. Is there interest in looking out broader?   31:22 — Juan Guillén: I thought that the token was kind of like a pool of different assets, and then you said that you’re bringing new assets into the protocol. Is it added to the same pool or is it a different pool? How does that work?   34:23 — Frank Cruz: In your MIP6 application you mentioned that you were going to do the Republic listing. How’s that going? Is that something you are close to putting up to the public? If you are, are you going for the one million race or the five million new allowance that they’re allowing Americans to do?   36:01 — Frank Cruz: is tZero still a working product?   36:40 — Frank Cruz: I guess the ASPD token is ERC20, right? Is that what you’re offering to the Republic investors or…?   37:04 — Frank Cruz: What type of return have you shown, if you have a track record going back five years? Is it a return of double digits?   1920×1080 126 KB   39:24 — Juan Guillén: Is there any type of remodelation or maintenance that’s done to the properties?   40:55 — Payton Rose: I was curious if you had  a preferred way in terms of figuring out the onboarding for these? Is it whatever is going to work best or do you prefer using Centrifuge?   Closing Comment  Juan Guillén  Outro   Where can people find you and what’s the best way to contact you? (46:53). Thank you very much for coming. It was really nice having you, and thanks to everyone for the nice discussion.   Credits   @blimpa produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/bUXASghHv88?t=42",
                        "https://youtu.be/bUXASghHv88?t=2753",
                        "https://www.youtube.com/watch?v=bUXASghHv88",
                        "https://www.youtube.com/watch?v=bUXASghHv88?t=0",
                        "https://forum.makerdao.com/c/risk/collateral-meetings/23",
                        "https://forum.makerdao.com/t/sb-ldb-mip6-application-solidblock-democratizes-real-estate-with-london-digital-bonds-a-smart-tradable-property-investment/6276",
                        "https://youtu.be/bUXASghHv88?t=42",
                        "https://youtu.be/bUXASghHv88?t=721",
                        "https://youtu.be/bUXASghHv88?t=809",
                        "https://youtu.be/bUXASghHv88?t=961",
                        "https://youtu.be/bUXASghHv88?t=1050",
                        "https://youtu.be/bUXASghHv88?t=1180",
                        "https://youtu.be/bUXASghHv88?t=1287",
                        "https://youtu.be/bUXASghHv88?t=1398",
                        "https://youtu.be/bUXASghHv88?t=1485",
                        "https://youtu.be/bUXASghHv88?t=1661",
                        "https://youtu.be/bUXASghHv88?t=1882",
                        "https://youtu.be/bUXASghHv88?t=2063",
                        "https://youtu.be/bUXASghHv88?t=2161",
                        "https://youtu.be/bUXASghHv88?t=2200",
                        "https://youtu.be/bUXASghHv88?t=2224",
                        "https://youtu.be/bUXASghHv88?t=2364",
                        "https://youtu.be/bUXASghHv88?t=2455",
                        "https://youtu.be/bUXASghHv88?t=2753"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.352755468215994
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/04/2021-17:39:55",
                    "content": "I love to see new forms of real world assets in the pipeline for MakerDAO to onboard and look forward to seeing the development of this collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3939393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "0",
                    "time": "20/04/2021-20:57:00",
                    "content": "This is super cool Pablo. I like the breakdowns of the Video. Do you also do this for the G&R call? That would be super helpful (sorry if you do it already–I look at too many things at 1 time) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.016666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#7",
                    "likes": "0",
                    "time": "20/04/2021-23:22:55",
                    "content": "Hey, thank you, Frank! Much appreciated <3 Nope, I don’t do these for the G&R call. You find those notes to be too granular? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Yael_Tamar",
                    "index": "#8",
                    "likes": "2",
                    "time": "22/04/2021-09:09:40",
                    "content": "Hi Pablo, Pls see below: What is the state of the market right now? UK is coming out of lockdown and I know there was a window of time in which a lot of great deals would be available. Where do you think we are in that window? England is being released from lockdown in 3 phases, the first of which was on April 12, the second on May 17, and the final one, which will mean no masks nor social distancing is on June 21.  The London market is in a great position, prices are still rising and there is a lot of positive sentiment.  The government had prevented repossessions for a long time which made it harder for London Chelsea to acquire properties but these measures are now stopping and we have found that since the beginning of April there have become a substantial number of great deals on the market.  We are now at the beginning of the window to acquire great deals and although these deals will continue indefinitely, we expect the next 18 months to September 2022 to have even better deals than usual. Juan Guillén: How do you see the collaboration with Maker? How do you see the dynamics or the amount of money that would be needed? We are raising a fund up to 26 million USD. We can collateralize the security tokens with Maker and pay interest only at a rate of 10% annual with a five-year hold upon which the fund will reach maturity and the principal will be repaid. Juan Guillén: If you had to give more concrete numbers on how much money or the interest…? Please see above Sébastien Derivaux: One piece I’m not following completely is what is the loan-to-value in this SPV, because the SPV have all the assets and you issue loans against those assets. But what is the LTV? We are open to discussing the LTV amount based on your expectation Sébastien Derivaux: So you try to raise US$20M for tokens which back your notes. What is the value of the notes compared to the value compared to the real estate in SPV? We anticipate buying undervalued by 20-30% and reselling them at market value or above. Sébastien Derivaux: Let’s say you’re making the first balance sheet of the SPV, Delaware SPV. At the end of the year let’s say you have US$20M for the notes. How much equity do you expect to have on the balance sheet? At the end of the first year we anticipate executing on roughly 30 properties at an average of 350,000 GBP per property How is it going with Centrifuge? We are continuing to make good progress with Centrifuge. We expect to work out the details in the next few weeks. We believe their technology will enhance the process. Could you describe a little bit about your token? The (London Digital Bonds) - LDBs are a new series of Ethereum blockchain-based smart contract digital tokens meeting the ERC-20 standard as modified to meet transfer restriction requirements under applicable U.S. securities laws. Purchases of the LDBs will be paid for in British Pounds, U.S. dollars or Euro, though the Company, in its sole discretion, may determine to accept Bitcoin (“BTC”), Ethereum (“ETH”) or other cryptocurrencies as payment for LDBs. The offering price of an LDB is £1.00 (or the equivalent amount in U.S. dollars at the time of payment) (the “Offering Price”) and the maximum amount of the Offering (the “Maximum Offering Amount”) is £20,000,000 Payton Prose: It seems like a lot of the projects SolidBlock has brought to Maker so far are region-specific. Is there interest in looking out broader? We anticipate issuing tokens in various regions and in diverse real estate markets. We may also create tokenized ETF or Indices representing multiple locales. Juan Guillén: I thought that the token was kind of like a pool of different assets, and then you said that you’re bringing new assets into the protocol. Is it added to the same pool or is it a different pool? How does that work? The focus of this particular fund is single families in London/Chelsea. In addition, we anticipate having other tokenized assets coming soon. Frank Cruz: In your MIP6 application you mentioned that you were going to do the Republic listing. How’s that going? Is that something you are close to putting up to the public? If you are, are you going for the one million race or the five million new allowance that they’re allowing Americans to do? We are nearly complete with the Republic onboarding process. They are currently reviewing our smart contracts and we should be launching relatively soon. We will be going for the new five million dollar allowance. Frank Cruz: is tZero still a working product? tZero is still working and we have established a relationship with them as well to list our tokens on their exchange. Frank Cruz: I guess the ASPD token is ERC20, right? Is that what you’re offering to the Republic investors or…? Yes, that is correct. We are moving to an ERC20/1404 protocol to enhance the KYC process. Frank Cruz: What type of return have you shown, if you have a track record going back five years? Is it a return of double digits? Our real estate partner, London Chelsea has a 15-year track record with hundreds of homes with an average of 20 to 30 percent margin per deal. Juan Guillén: Is there any type of remodelation or maintenance that’s done to the properties? We look for properties that require minimal renovations. Payton Rose: I was curious if you had a preferred way in terms of figuring out the onboarding for these? Is it whatever is going to work best or do you prefer using Centrifuge? We obviously want to do whatever works best and are in discussions with Centrifuge to evaluate their process. Where can people find you and what’s the best way to contact you? (46:53). Yuval Wirzberger, Co-CEO [email protected] +13478789881 +972542561787 Yael Tamar Co-CEO, [email protected] +972544584618 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.766532809295968
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/07/2021-15:10:11",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}