{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/crvv1ethsteth-a-liquidation-parameters-adjustment/20020",
            "title": "crvv1ETHSTETH-A Liquidation Parameters Adjustment ",
            "index": 20020,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "liquidations"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "5",
                    "time": "01/03/2023-19:26:46",
                    "content": "Hey all, The recent MOMC proposal increased the debt ceiling of vault type crvv1ETHSTETH-A to 100m as we identified a user that might have high demand for this collateral. User had over $100m deposits in Convex but about a month ago decided to start migrating his assets to Maker and soon utilized the remaining debt ceiling. We lately identified user as Antalpha, one of crypto prime brokerages: Maker Risk | Block Analitica Both vaults from this user seem to be safe, having liquidation price currently set at $920. However it somewhat presents high single exposure to one counterparty for this vault type as its debt size measures $77.4m out of $79.5m all debt minted. In our opinion the current auction parameters for this vault type are too limiting for potentially liquidating such a large position and we therefore propose an adjustment to them. As seen below, auction throughput for this collateral is very limited because we always saw very little demand, plus the auction instant settlement process might be a bit more complex with this LP. The chart below shows how much time the auction settlement would take assuming 20% of a particular collateral type gets liquidated.  1600×813 53.2 KB  Source: Block Analitica Risk Dashboard - Auctions Simulations We therefore propose an adjustment to parameters that will 1) increase speed of settlement and 2) enable slightly higher throughput of cleared debt. Proposed changes for vault type crvv1ETHSTETH-A:   Ilk.hole from 3m to 5m  buf from 1.20 to 1.10  tail from 8,400 seconds to 7,200 seconds  cusp from 0.40 to 0.45  This enables similar throughput of auctions as we have it set for vault type like WSTETH-A, which implies one auction cycle of 14 minutes instead of 27 minutes previously. It also increases throughput of cleared debt by introducing higher ilk.hole of 5m (together implying 20m debt settlement in about 1h instead of 3h previously).  1600×912 137 KB  Source: Block Analitica Risk Dashboard - Auctions Simulations We would like these changes to be included in the executive spell next week on Wednesday 8th of March. We believe the situation is not as urgent as it might seem as this user always maintained safe collateralization in the past. We will continue to monitor this position and if the collateralization drops to dangerous levels we’ll ask @Growth-Core-Unit to notify Antalpha. ",
                    "links": [
                        "https://maker.blockanalitica.com/wallets/antalpha/",
                        "https://maker.blockanalitica.com/simulations/auctions-throughput/",
                        "https://maker.blockanalitica.com/simulations/auctions-throughput/CRVV1ETHSTETH-A/?buf=110&cusp=0.45&cut=99&daiDebt=79450033&percentLiquidated=20&simHole=5000000&step=90&tail=7200",
                        "https://maker.blockanalitica.com/vault-types/CRVV1ETHSTETH-A/vaults/30138/",
                        "https://forum.makerdao.com/t/coldiron-eth-delegate-platform/11193/169"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.162425595238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/03/2023-10:57:34",
                    "content": "Confirming from GovAlpha that this falls within the Risk Core Unit’s mandate to request and that after discussion with PE, we will include these changes in the next Executive Vote (currently scheduled for 2023-03-08). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}