{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-16-0-december-5th-2022/19053",
            "title": "Unified Auctions UI Release v1.16.0 - December 5th 2022 ",
            "index": 19053,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "0",
                    "time": "05/12/2022-19:58:25",
                    "content": " Unified Auctions UI Release v1.16.0 - December 5th 2022 Version: v1.16.0 Name: National Gallery London  v1.16.0 in a nutshell This week we are happy to announce release v.16.0. At the center of this sprint is the release of the Uniswap v3 auto router feature. Other than that we added support for the coinbase wallet as another wallet provider alternative to use the Unified Auctions UI. Additionally, first tests were conducted to ensure smooth onboarding of the GNO token as a new collateral type. This week’s release is named after the National Gallery in London. This gallery houses the famous oil painting “Winter Landscape” by Caspar David Friedrich. Just the right scenery for current days.  Uniswap v3 auto router support  univ3autorouter1372×720 77.8 KB  As already pre-announced in the last release notes, this week we introduce the uniswap v3 auto router support. The feature allows to automatically determine the most lucrative route for the swap that is used for auction settlement without relying on hardcoded swapping routes. From the UX perspective the auto router is an additional option that a user can manually enable. The flow via a manual trigger is because we want to keep an eye on the general performance of the auction UI. Additional resources for price identification via the auto router will only be used if requested by the user.  Coinbase wallet support After extending wallet support of the Unified Auctions UI with WalletConnect as an additional provider in the last sprint, this release includes the support for the coinbase wallet. With this additional alternative we further decrease chances that a potential user is excluded from usage to specific wallet preferences.  GNO onboarding As GNO is about to be onboarded as a new collateral type, we conducted early tests to ensure that the auction infrastructure including UI and keeper are ready from the get go. The first series of tests was conducted on goerli. Mainnet onboarding and tests will be conducted once the respective spell is ready. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.779009034443817
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/03/2023-19:59:06",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}