{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/fears-about-new-dust-limit-increase-pr-responsibility-for-new-small-account-users/5307",
            "title": "Fears about new Dust Limit Increase - PR Responsibility for new/small account users ",
            "index": 5307,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "pr",
                "dust"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "8",
                    "time": "24/11/2020-16:30:15",
                    "content": "Hello everyone, I posted this on a YouTube comment after a bit of a frustrating morning as a recent adapter of MakerDAO. I hope that by bringing it here I can generate some conversations around what Public Relations steps we should take in the future to prevent turning off new users/small account holders. At the very least I believe we should have a rule in place that any time a new governance proposal is passed that effects certain vault holders, they should receive a message on their vault with a link to the discussion and governance vote that took place. I welcome any and all feedback and really appreciate all the hard work the community members are putting in to make this platform safe and accessible. Here is what I posted: I think it’s worth mentioning here that this change [dust limit increase] is incredibly frustrating and confusing to retail end users. To take my case as an example, yesterday I was able to borrow another 100 DAI against my ETH and still stay above my personal comfort level thanks to the recent uptick in ETH. Then this morning I log on and I have a message saying all three of my vaults are now on “reduced functionality” and there is no help button, FAQ, or anything I can find as to indicate this change. I read up on the forum and it seems like this decision was made from a risk management prospective, due to the possibility of increased gas prices during a destabilizing event like happened earlier this year. While that makes sense, I believe there are so many better and more creative solutions to safe guard such an event. However, by doing so the stakeholders have severely limited smaller accounts ability to utilize the system. It may be that the majority of members think that is a worthy trade off, and I can accept that. Yet, what is really disappointing about this is that no advanced warning was given out to smaller accounts even through there was ample opportunity to do so. This could have been a great engagement opportunity, but now it seems the stakeholders don’t have any interest in courting smaller accounts. As a result, market-share will be lost to others like Compound that have a lack-luster governance but way better end user experience. While the amount of DAI generated by these small accounts is rather insignificant to the total (180k/1B), nearly 10% of total vaults currently fall under 500 DAI. With the lack of communication on this change we will surely be losing end users, which puts the entire community at risk as the point of a DAO is to be decentralized. If the platform is only for wealthy individuals to utilize, then we are adding no value to the greater financial markets. Wealthy people already have the option to collateralize their assets, the cool thing about DeFi is it gives the same rights to the little guy. As a leader in the space, I hope going forward the community is more aware of how their decisions will effect their user-base. ",
                    "links": [
                        "https://forum.makerdao.com/t/brainstorm-how-do-we-ensure-small-vaults-have-a-place-at-maker/6072",
                        "https://forum.makerdao.com/t/brainstorm-2021-mission-and-objectives/5809/22"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6799773711137345
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#2",
                    "likes": "3",
                    "time": "24/11/2020-17:31:08",
                    "content": "I could be wrong about this, but I’m pretty sure we can move it back down to ~100 once the new liquidations system is in place. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1923400673400675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "4",
                    "time": "24/11/2020-17:52:37",
                    "content": "I think that would be a great move for the community. Like proposed above, I believe communication of these changes will help keep engagement and trust for the system in place, so as long as we are communicating clearly what is being done and why I say keep changing things to meet the protocol’s needs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#4",
                    "likes": "2",
                    "time": "24/11/2020-20:58:28",
                    "content": "I fully support @prose11 here. I know that for some people in Europe and America $500 is still an acceptable level, but I guarantee you that for most of the persons in Latin America, $100 is already a very big amount! There were an important amount of talks in how we could impact those communities in Latin America, but as far as it goes this year, probably we have lost a lot of interest there (I could be wrong here). The biggest of the issues he’s pointing out (IMO) it is not only that dust limit increase, it is how bad is our UI / UX regarding the competition, and how we’re failing to communicate with the end user even single decisions! I know we’re focused heavily in new features added to the protocol, and I know there have been important updates to the interfaces as well which shows our “face” to the normal users in the internet willing to learn and use the platform (new auctions UI, new interface for Oasis, new community portal). But TBH, I’ve not seen enough debates here in the forum about these, and these are critical! IMO as critical as the most amazing of the functional features we’ll add to the protocol. Not sure if most of MKR holders think in the old style console way where what is important is to have a command which solves all the problems… I’m a developer myself and it took me some time to understand how important the look and feel is to a product. Being honest with all of you, I don’t feel that “uniqueness”  in our branding, that feeling of being in an amazing place when going to makerdao.com, and I wonder what is missing. I recently asked to the community if somebody could point out to information about our branding, to a style guideline for our designs. Still not answer there… I really hope that we start thinking as a company thinks when willing to get to a big audience. How we communicate, how we present ourselves, how a user feels when using our products… that’s part of what will make us big in the future, and that’s not less than adding RWA to the protocol, or Flash Mints, or PSM… IMHO, that’s as important as any other feature we heavily comment and discuss here. Hope in the future to create more space for the debate in this regard. I’ll do my best to cooperate in those as much as I can. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.769128158663043
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "5",
                    "time": "24/11/2020-21:04:14",
                    "content": "Try to tell y’all–product market fit man. You don’t include everyday Jane and Joe then who do you include?  “When your Customer is telling you what is needed, you’re already too late” -Mike Maples, Jr. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#6",
                    "likes": "3",
                    "time": "25/11/2020-15:31:11",
                    "content": "For 500 dai debt, you need at least $750 collateral, and to be realistic $1000 to be safe. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#7",
                    "likes": "1",
                    "time": "26/11/2020-01:13:07",
                    "content": "I recommend treating the dust of large vaults and small vaults differently, and it is best to set the dust as a percentage of value. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.205357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneBiteLawnOrder",
                    "index": "#8",
                    "likes": "1",
                    "time": "26/11/2020-06:26:07",
                    "content": "I agree that 500 DAI is a significant barrier to the end user and we definitely need to work towards getting the DUST back down over time. That said, if we look at what is happening in the market right now, and the significant increase in gas prices on a downturn I think 500 DAI is the right call. The unfortunate reality is that with gas prices reaching the levels that they do it is impossible to have keepers liquidate small vaults profitably which creates risk in the system and opens up an attack vector (open up lots of small vaults that can’t be liquidated). From my perspective, as a relatively small vault owner myself, it seems that the 500 DAI limit is actually a pretty practical threshold test to prevent small users from getting trapped in vaults that they can’t afford to maintain or exit in the case of a downturn or longterm increase in gas prices like happened over the summer with the yield farming craze. You don’t want to be paying $35 worth of ETH in gas to open and close a Vault with 100 DAI in it! The new Dutch Auction style liquidations redesign should help us but until then we are stuck with what we have and I think 500 DAI is an unfortunate necessity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.746392496392496
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#9",
                    "likes": "1",
                    "time": "26/11/2020-14:33:34",
                    "content": "Definitely understand the risk management perspective @OneBiteLawnOrder. I just feel we could have had a more creative solution to the problem at hand that a) doesn’t turn new accounts/small users away from the platform and b) puts a system in place to openly communicate changes to end users. It’s not fair that we expect everyone using the platform to wade through countless forum posts every day just to understand what is happening with their assets on the platform. If you’re in to that (like it seems we are) that’s awesome and it really helps what is trying to be built here, but if you’re not it’s easy to feel taken advantage of and lose trust from the platform. As far as different ideas go to combat dust, why didn’t we try allocating a small percentage of the burn MKR to be swapped for ETH and held in the strategic reserves, specifically earmarked for gas prices?  There are downsides sure, but what’s important about that proposal vs the one enacted is that the OWNERS not the end users are the ones paying for the need for stricter risk management. That’s the way it should be IMO, as the DeFi sphere is about empowerment and financial freedom. If you want to take an ownership in platforms offering DeFi the cost of risk management should be placed in your hands. Otherwise we could see users go to a centralized provider like Blockfi. The fees for risk management that are passed onto the user over there are leveled out by the trust of regulation. Obviously not an apples to apples comparison, but my point is that anything we do to lose trust will naturally result in users favoring centralized organizations or at the very list different DeFi apps that are easier for a casual user to understand. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.707070707070708
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneBiteLawnOrder",
                    "index": "#10",
                    "likes": "2",
                    "time": "26/11/2020-17:48:23",
                    "content": "I understand your frustration @prose11. On the creative approaches I know there are plans in the works to develop a strategic reserve. I believe there are several steps to get that going and nothing has yet been put to governance yet. Are you proposing using the strategic reserve to fund unprofitable keepers so that we can subsidize small vault holders? Or are you saying that we can just hold strategic reserves to cover any bad debt that may come from unprofitable liquidations? As for the communications, I agree not everyone has an interest in participating in the governance process and we need to work on communications. Clear and timely communication is difficult because of the chaotic nature of decentralized governance. Some might say that keeping up with governance is the price to pay for using a decentralized protocol to take out a magic internet money loan. However, I think we can do better and the community is always looking for suggestions on how to improve. I don’t know if you’ve checked out Maker Relay but they are doing good work on summarizing the work being done by governance. There is also a governance twitter account (not sure who runs it) that announces when new Governance Polls and Executive Votes are put on chain. Hopefully we can spread the word to other users! ",
                    "links": [
                        "https://twitter.com/mkrgov"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.241714015151516
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "0",
                    "time": "26/11/2020-21:24:18",
                    "content": "Those are some great resources @OneBiteLawnOrder! I’m wondering if it would be possible to link them on the oasis app? That way, in case a user sees something different that they don’t recognize, they could have an easy way to see what caused the change. As for my strategic reserve idea, my suggestion for the ETH to be stored in the strategic reserve is that it would only be used to cover gas prices in unprofitable liquidations to protect the protocol. Basically, if it is the gas prices we’re worried about it would be easy to build up some ETH and have it earmarked for liquidations when gas prices are above a certain level. I can see some objections to doing this and I think there are many valid reasons why the community would not want to engage with such a proposal, but I think it counters the notion that we needed to increase the dust limit to keep the network safe. There are many reasons why users might want to pull smaller amounts of DAI out, especially for users outside the US, and given the significant number of vaults that were under 500 DAI in dust I just feel it would have been prudent to pursue other solutions first. This is a slightly separate topic, but I have also been thinking about the poll system for moving items to the executive after @LongForWisdom’s post about ranked voting, and how that probably contributed to the dust limit decision. I think by having users choose what is “acceptable” in the polls it creates a bias for change when the sentiment doesn’t necessarily exist. Like in the case of the dust limit, by having people able to vote for what they personally could take (ie bigger vault holders wouldn’t have much of a reason to indicate they found a raise in dust unacceptable) it probably made it appear that there was a lot more support for raising dust than actually existed in the community. A better approach would have been polling if a dust limit increase was the preferred way to address the risk of gas prices spiking, rather than asking people what the new dust price should be. I think we naturally want to protect against risks as soon as they come up, but we must be careful with how polls are presented as to not stifle discussion and prudent decision making. Just my two cents, I know a lot of you have put countless hours into this process and I am thankful for where it has brought MakerDAO. We still have an impressive and superior system even if none of my ideas are incorporated, I just feel we need to be mindful of the little guys while we innovate or there will be plenty of other platforms there to scoop them up. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0197356215213365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#12",
                    "likes": "0",
                    "time": "27/11/2020-03:02:06",
                    "content": "gas hit 400+ gwei yesterday as ETH wicked down from over 600 to under 500 in a matter of hours, with tons of liquidations across many platforms when we get to the end of this bull cycle and the market really crashes the liquidations will be historic and i would expect 1000+ gwei transactions - c.f. the network congestion near the last peak people will want their gas fees covered by this ‘reserve’ when they are panicking, and that is exactly when it is most expensive to do so even without considering the potential for abuse and risks of a more complex protocol, socialised gas costs for 10% of all vaults seems infeasible the strongest point in this thread is the lack of UX/communication in a format that end-users actually engage with all these changes to dust were flagged in the youtube channels and in the forums arguably, as DAI producers vault owners ‘should’ be watching the weekly videos or at least skim reading the summaries, but just like we can’t expect gas to magically go away, we can’t expect humans to do what we think they ‘should’ if they aren’t already it makes more sense to me that we’d allocate a UX budget so the front-end can better keep pace with the back-end than adding a gas reserve to the protocol  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.67483660130719
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#13",
                    "likes": "0",
                    "time": "27/11/2020-14:28:00",
                    "content": "I’m with you @David_Meister, my idea for the gas reserve was just to show that there were alternatives to raising the dust that were not explored. Probably not a prudent use of the protocol, but an entirely different solution than pricing out a large percentage of end users. As to your point about Vault holders, I will have to disagree. Yes, it is wise to be fully aware of the inner workings of any organization that holds some of your wealth. Yet, we don’t expect the average citizen to be monitoring their bank’s earnings reports, or constantly checking the bank’s website to make sure there isn’t going to be a new rule kicking in the next day that no one informed them about. If this is the system we are trying to revolutionize, it has to be more accessible for the end user or the costs to entry are too high. Just like with raising the dust value, if we are expecting vault users to read the forum everyday we are pricing out small account holders via opportunity cost (ie if you have to work trading hours for money for a living, the cost of the time spent monitoring MakerDAO would be greater than the benefit it could bring you). Allowing quick, clear, and concise communication of changes makes the system more accessible and protects against a small group of owner/users controlling the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.824778844344062
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#14",
                    "likes": "3",
                    "time": "27/11/2020-15:55:05",
                    "content": "why do you think the average citizen should have a vault? we should maximise access to DAI, the stable coin is the end-user product but vaults involve putting leverage on ETH and other speculative assets… this is automatically highly technical and risky vaults are like taking a mortgage on a house in a world where a house can lose 50%+ of its value while you sleep and the bank fire sales it when the debt ratio spikes for one hour, or charges you $50 per repayment if you want to keep it if there is an emergency shutdown event then DAI holders are made whole, not vault owners… no matter how you look at it, vaults are simply not an entry level ‘set and forget’ deal there are higher level interfaces to vaults that handle a lot of this risk for you, e.g. yearn.finance and defisaver - but low level direct interactions with vaults require everyone to pay attention and do their own research opening vaults has no impact on the DAO, my vault gives me zero voting rights holding MKR allows for voting, and we absolutely do expect MKR holders to pay attention to the regular meetings and announcements and actively participate in voting ‘appropriate effort’ is not ‘centralisation’ your wealth is not held by the DAO or any organisation when you open a vault, it is locked in a smart contract by cryptography/code on the ethereum network ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.551984126984127
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#15",
                    "likes": "1",
                    "time": "27/11/2020-15:59:35",
                    "content": "I fully agree with the problem. Nevertheless I’m not sure we should care (because I don’t expect the solution to be easy). Let’s face it the UX is quite low in our priorities. Customer experience is not something we discuss often. The PSM will not even have an UI. Even for vault management I don’t use Oasis because DefiSaver is far better to my taste. It’s not possible to be everything for everyone. It’s the best recipe to achieve nothing. Looking just a bit at ETH-A, the 20 largest vault have more than 50% of the loans outstanding. Quite sure the highest 20% vaults have more than 80% of the volume. I would love to have a project dedicated to provide banking to the unbanked in LATAM (as I understand we have a footprint there). DAI is clearly a good tool. We an use RWA to provide capital to a company doing microloans in DAI there which would add value. If this is centralized (or in L2), the transaction costs can be null. There is a clear potential, and I think we should step up. But we will not succeed by tackling the problem directly ourselves. There is too much work for MakerDAO Governance already and a clear lack of agility. Nevertheless, we start to accumulate capital and have the tools to provide the infrastructure to such project. The Foundation is also quite good to foster innovation with hackathon and projects. Maybe there is a team to be found and financed to move forward on this subject. They will find a solution for the dust issue and provide value to their customer using the DAI ecosystem so we don’t have to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.432539682539682
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#16",
                    "likes": "5",
                    "time": "27/11/2020-21:09:18",
                    "content": "Opening a vault can easily cost $10+ in transaction fees. If a user borrows 250 DAI for 3 months, $10 in transaction fees would increase the effective cost of credit by ~16% APR. Unfortunately, due to high transaction fees, borrowing less than 500 DAI from a vault is uneconomical and would be a bad deal for users even if Maker allowed it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.168055555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#17",
                    "likes": "3",
                    "time": "27/11/2020-22:58:23",
                    "content": "It’s less about the fact that drawing a small amount of Dai is uneconomical and more that it raises the barrier for a new person to even get started with Maker and go through the experience of generating Dai if you have to put a bunch of capital up front. The Coinbase Earn program from last year probably would have been impossible if dust was so high back then. People who are able to test-drive the system with an insignificant sum are probably going to be more confident to draw a significant amount of Dai when they have the means and it is financially beneficial to them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.610780885780886
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#18",
                    "likes": "0",
                    "time": "28/11/2020-16:06:25",
                    "content": "the coinbase earn program would have been impossible if gas fees were 400+ gwei (this week), rather than about 10- gwei (last year) or 1000+ gwei (next year maybe) it only “worked” because coinbase paid the gas fees themselves during a period of relative calm and gave the users the ETH to lock in the vault in the first place like all other programs from the bear market that involved ‘someone else’ paying the gas fee, it didn’t survive network congestion training programs can still happen on test net, but main net is too expensive now and the trend is towards it becoming more expensive the idea of there being some minimum scale required to open a vault is a real symptom of the pressure on the underlying infrastructure, not something that MKR is introducing every defi platform only makes sense at some minimum scale, because gas this thread is a microcosm of the same conversations and realisations happening across the industry yes, users should be able to be onboarded at any scale, no it’s not possible yet  i think the real danger is that high gas fees also make vault auctions uneconomical we know gas spikes into the hundreds of gwei every time there is a major price crash, we can see just this week a relatively minor 20% drop caused 400+ gwei gas during the churn maybe we can socialise the auctions for 100 vaults, but what about 1000 or 10 000? when word on the street is that vault gas is ‘free’ it’s inevitable that the ‘strategic reserve’ will be insufficient at some point, and it will be very difficult socially and technically to remove the gas reserve once it is normalised let’s say we have 1 million ‘gas free’ vaults with $10 of ETH in each, and 5 million DAI floating around from those vaults, now ETH crashes and the auction bots don’t have 1 million x 400 gwei to clear the collateral out, now we have 5 million DAI effectively 0% collateralised… this is not good  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.217769607843136
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#19",
                    "likes": "2",
                    "time": "30/11/2020-12:56:35",
                    "content": "So from reading here, we might have a different prospective about DeFi and MakerDao in general @David_Meister. To me, this space exists to give freedom to the end user. No longer do you have to rely on third parties to monitor and restrict your access to capital and financial products, as long as you are properly collateralized, you can create debt for any purpose you see fit. This makes sense from the Maker side as well, they don’t care why DAI is being minted, as long as it is properly backed up with a diverse pool of assets that can be sold off if they lose too much value. Your assumptions from your previous post are just that, assumptions. You don’t have to lever yourself up with your DAI loans, as many choose to do. In fact, working with another platform you can set up borrowing and lend structures that effectively delever your exposure without selling the underlining asset and allowing you to collect interest for doing so. Or you can post USDC and borrow against that with much less currency risk, treat it like a pre-paid credit card that allows you to pull against locked funds at a low rate and no minimum payments. Sounds much better than what the banks are offering to me. And just as a quick aside to your last post, I literally participated in Coinbase’s program for trying out Compound two weeks ago, high gas prices and all. If the concern with gas prices is about unprofitable vaults, you can up the fee for liquidation or improve the auction process as well, the whole point of this forum thread from my end was that there were other options than raising the minimum, and in the case that raising the dust value was the right move, it is pretty clear doing some PR around it and why would have been much better for the end user. It’s sad to head that UX isn’t a priority @SebVentures and while that again makes some sense from a risk management prospective (a recurring theme here), it doesn’t make sense from a platform growth perspective, or even from a first principles one. The stated goal of MakerDAO is to create a stable coin unlike any other, decentralized but backed with a healthy amount of assets to ensure DAI carries the US Dollar Peg. By not focusing on UX, we are turning away a ton of new and small account owners, who can set up shop at any variety of DeFi platform instead. The DAO needs many nodes in order to actually be decentralized, and the strength of the currency depends on having a multitude of actors and collateral to prevent a single actor with a large percentage of collateral deposited from walking away (or worse acting maliciously) and leaving the whole system unstable. I want the forum members to understand that UX does factor into risk management as well, and that the user base is our greatest tool for safety and growth. Gas prices are going to be an equal concern across all DeFi platforms, and right now Compound, Aave and a few others are able to make micro loans work despite the fluctuation of gas prices so why aren’t we? Just because they are doing something doesn’t mean we should, but we at least need a solid reason why we are so much harder to work with. The argument that the higher gas prices leave users with no reason to pull from a vault is ridiculous IMO. If you really needed the money, but couldn’t part with the crypto, wouldn’t you pay $35 to access $100? If a credit card is charging you 22% APY to make a purchase (and sticking you with monthly minimum payments, hidden charges etc.) and you can finance the transaction for about 16% APY with fees from Maker, wouldn’t you chose the latter? If you have the chance to double your money by buying as asset on firesale but you’re unsure how long it’ll be before you unload it, wouldn’t the gas prices be the least of your concerns? The point is we are offering freedom, and we need to leave it up to the end user to decide if the juice is worth the squeeze. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.346328890407838
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#20",
                    "likes": "2",
                    "time": "30/11/2020-14:29:50",
                    "content": "My concern is not about risk, it’s about business and having a great product. Creating a great product is already hard for one audience. Would it be better with a wonderful UX? Sure. But I bet it’s better having liquidity and a pegged DAI. While most (weighted by their economic important) don’t care about the UX, all care about having a good DAI (which is our stated goal in your message and we spent a good chunk of the year solving that). That said, I was suggesting that we build a dedicated product on top of DAI, using Maker resources, to serve the many small accounts. But for that to succeed, it would be best to be a separate project. There will be some link like using Maker RWA facilities to foster DAI microlending inside the app. I can help on the RWA side, clueless about the rest. The Reserve Protocol is building such product in LATAM which is a dedicated strategy (they are almost absent from the DeFi world). It saddens me that we are not pursuing this opportunity. But if we want to be serious enough to succeed, it’s not just a dust parameter. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.90625
                }
            ]
        }
    ]
}