{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/debt-floor-and-smallholder-consequences/7637",
            "title": "Debt floor and smallholder consequences ",
            "index": 7637,
            "category": [
                "Governance"
            ],
            "tags": [
                "liquidation-system"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#1",
                    "likes": "3",
                    "time": "23/04/2021-20:17:01",
                    "content": "Hello all, I hadn’t followed the recent increases to the dust/debt floor parameters for the various vaults, and wanted to chime in with some thoughts. Specifically, I think we should be allowing repayments to vaults where the repayment<existing debt<debt floor, instead of requiring that repayments = debt where debt<debt floor. As a smallholder of an ETH-A vault with less than 5000 DAI with a recent windfall, I thought I’d put some of it toward paying off my DAI debt, and realized that this wasn’t possible unless I paid off the debt in its entirety. I get the logic behind raising the debt floor: we want the minimum size of a vault position to be such that profits from liquidating it are equal to at least the cost of participating in the liquidation auction. So, payments that take the vault debt from above the threshold to below the threshold are a no go. Mints are also a no go. That much is clear. But a payment on a debt already below the floor only reduces the size of the pool of capital that’s at risk of undercollateralizing the peg, ie, positions that wouldn’t get liquidated during a flash crash. In the meantime, smallholders like me who may or may not have the capital to pay off what can be several thousand dollars all at once are forced to allow interest to accrue continuously until they can save up the money to pay it off in one go. Gross. Is there something I’m missing here? If the debt floor were not reflective of the natural equilibrium point for liquidation participation, and that point was actually lower, bad actors could repay just enough to stay below that threshold, keep from being liquidated. However, this seems like a non-issue for 2 reasons:  If the debt floor is higher than the natural participation threshold, then we’re already liquidating sufficient positions. Debt floor should be set based not just on auction participation costs, but also on the basis of where too much capital exists below the liquidation participation threshold in aggregate. Remember, you can’t open a vault under the debt floor, and you can’t repay when the repayment would take your debt below the floor. There are immensely diminishing returns for a bad actor in this situation, and they’re one-way. If I wanted to game the system in this scenario, I’d need a huge number of legacy vaults that happened to fall below the debt floor after a debt floor increase–something that you couldn’t initiate. Once I played keep-away from the liquidators, I can’t mint more DAI unless I put myself back above the debt floor. You could certainly capitalize on that opportunity if you happened into it, but it’s an edge case of an edge case.  Thoughts? ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-23-29/7728"
                    ],
                    "GPT-summary": "The author of the post is proposing changes to the debt floor parameters for various vaults. They suggest allowing repayments to vaults where the repayment is less than the existing debt but greater than the debt floor. The author argues that this would benefit smallholders who may not have the capital to pay off their debt in one go. The post also includes a request for feedback and questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.796502976190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "1",
                    "time": "23/04/2021-21:08:55",
                    "content": "I’m not going to endorse any particular action here or opine about this specific situation, but we need to keep our eye on customer experience. I’ll leave it to others to weigh in more specifically. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#3",
                    "likes": "0",
                    "time": "23/04/2021-21:11:59",
                    "content": "The debt floor being raised in general is annoying as it creates a huge barrier to entry for people like me who are trying to get going in the crypto space and want the benefits of having a Maker vault, but have <$1000 to invest at a time and also have difficulty saving money at all. This may be hard for some to believe but not everyone works a white-collar job, or even a decent job. I’m a grunt, I do “shitwork” for a living, earn anywhere between $200 and $500 a week (depending on availability of work; there are some weeks I can’t get any work), and I have a family that I need to feed. I want to build a passive income for them so that if something happens to me they’re taken care of in some way; this was going a lot better before the debt ceiling was raised. Now, between the gas prices and some (poor, I think) decisions on the DAO’s part, it is almost impossible for me to get any traction whatsoever with Maker. I’ve made more progress on that front just this week with Bancor than I have in my entire time using Maker. I can’t be the only one here in the situation. Overall, I think the move may have shafted a lot more people than the others seem to realize. It was my understanding that one of the foci of this DAO was to make available to the common man the set of tools for high finance. If I’m correct about this, then have we strayed from that focus? Because it certainly feels to me like we have. Yes. We should allow those payments. But we should lower the debt floor, it is too high for the system to be in any way usable by people like me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.164616402116402
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "1",
                    "time": "23/04/2021-21:38:42",
                    "content": "These types of smart contract transactions aren’t really useable for people with your capital amount at this moment. Gas fees are a much larger percent of your portfolio, making it irrational to use. Until these services are available on L2 or L1 gas fees go down, unfortunately dust/debt floors will not go down. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0022675736961455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/04/2021-21:44:13",
                    "content": "“Go pound sand.” Best response, clearly we’re at the forefront of financially liberating people. What about the OP? What about allowing low-income holders to get out of the system so they don’t drown in stability fees? If we tell them to get bent then we’re not much better than TradFi imho. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "3",
                    "time": "23/04/2021-21:48:14",
                    "content": "    ccc:  “Go pound sand.” Best response, clearly we’re at the forefront of financially liberating people   That’s not what he said. The fixed costs and transaction costs are simply difficult to overcome. That doesn’t mean we can’t try to figure something out. I think we should, but don’t know what. But gas fees aren’t set by Maker and that puts a lot of sand in the gears. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.322916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "2",
                    "time": "23/04/2021-21:52:21",
                    "content": "We have no control over what gas fees are and the scaling solutions to make gas fees less aren’t here yet. Getting mad at Maker for raising the debt floor because we have to in order to protect ourselves is misplaced energy. Trust me, we want to keep every user we can. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.3472222222222223
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#8",
                    "likes": "0",
                    "time": "23/04/2021-21:58:50",
                    "content": "Yes, of course, you’re right; I am experiencing a migraine and what you said simply rubbed me the wrong way in this more irritable state. My fault, I apologize. Is the debt floor universal? Or can we set it on a per-ilk/vault-type basis? Not to be that guy that suggests YAVT, but perhaps we could experiment with a vault type with a lower debt floor and <dust debt repayments but with a vastly lower DC and see how that plays out alongside the current setup? The thought being that we should have options for everybody, wider nets and all that. This doesn’t solve the gas costs obviously but those are largely outside our control anyway, and the Ethereum Foundation is working on scalability. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.158730158730158
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#9",
                    "likes": "1",
                    "time": "23/04/2021-22:19:17",
                    "content": "The issue comes down to liquidation costs which is the reason for the dust floor to begin with. Check out DeFi Explore and you’ll notice a whole bunch of active vaults that can be liquidated but haven’t due to not being profitable for keepers. If we lowered the dust floor, more of these underwater vaults would accumulate and this could create systemic risk for the protocol. To answer your question, yes it is possible to set the debt floor per ilk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.238425925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#10",
                    "likes": "1",
                    "time": "23/04/2021-22:19:22",
                    "content": "Debt floor is set on a per-vault basis. That said, the point of the debt floor is to ensure that liquidations happen when they should. Scaling is coming, whether by migration to L2s, reduced congestion because others migrate to L2s, and soon enough (ETHGlobal summit today had October '21 as the target date!) the merge. I hope that that reenables people like you and I who don’t have a lot of capital to access these financial primitives. However, scaling will likely continue to be an arms race: build a network 100x as performant as ETH1 to handle more volume, and instead, increased adoption puts us at 10x the number of transactions, but ecosystem growth and complexity of what we’re doing on the network will also increase by 10x, and then we’re back where we are now. Not unlike dialup to DSL to cable to fiber: the content and number of users will likely keep pace with and/or outstrip the network. For Maker and the vaults, that means that any of the processes that are contingent on the degree of network congestion are going to cause some problems. I think we’re going away from my original question, however: What’s the problem (game theoretic, technical, or otherwise) with allowing repayments in the scenario where 0<debt after repayment<debt floor? If there’s not something I’m missing, I don’t see why we don’t at least work to make that happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.947916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#11",
                    "likes": "1",
                    "time": "23/04/2021-22:20:48",
                    "content": "I get why there’s a dust floor. That piece makes sense. I’m not asking why there’s a dust floor. Why can’t you partially repay a vault while it’s below the debt floor to begin with? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#12",
                    "likes": "2",
                    "time": "23/04/2021-22:22:46",
                    "content": "While this guy is upset about raising the debt floor, that’s not what I’m asking about. If we let people partially repay their debts who are already under the debt floor now, we reduce the risk of under-collateralization/peg instability overall, and at least don’t fuck over the most under-resourced users of the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#13",
                    "likes": "0",
                    "time": "23/04/2021-22:39:18",
                    "content": "I think it’s valid point considering the raising of the debt floor is what caused the issue to begin with, and considering how we approach that particular lever so this doesn’t happen in the first place I think is worthwhile. But you also are right in that this is for a different thread and gets away from your original question. My guess is that since the floor was so low at the start, it simply may not have been considered a realistic possibility that such a situation would really arise; no one could have predicted just how well things have gone for DeFi over the past year or two. As for what we can do about it, agreed, I don’t see why we shouldn’t work towards allowing this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.705853174603175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#14",
                    "likes": "0",
                    "time": "23/04/2021-22:48:01",
                    "content": "That I’m not sure. Hopefully @Protocol-Engineering can chime in on the reasoning behind this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#15",
                    "likes": "1",
                    "time": "23/04/2021-22:52:47",
                    "content": "New to the Maker forums, who’s @Smart-Contracts? Lol edit: okay so that’s the actual team making the Maker contracts, I should have taken the 5 seconds to click the username ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.795454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#16",
                    "likes": "1",
                    "time": "23/04/2021-23:08:23",
                    "content": "Just chiming back in here to add: I skimmed some of the original threads on raising the dust floor from last year, and one of the salient points raised was that knowing what the floor Should be a priori is really hard. You have to estimate gas costs (which is already a huge issue, hopefully 1559 helps us all out here), and you have to estimate the proceeds of the auction. Very tricky. While I want to move forward with the thrust of my OP, which is just getting the ability to partially repay debts for vaults that are already under the debt ceiling, I think there’s absolutely a broader discussion to be had about trying to calculate a debt floor on the fly instead of making it something we have to set arbitrarily via governance, particularly because it’s intended to mitigate a risk that, should it occur (ie, spike in gas prices) will happen fast, faster than governance. I’m curious why 5000 DAI (seems like a very round figure to me) is the floor for ETH-A vaults. Like I said, skimmed a handful of threads but didn’t see anything that got into the numbers off the top of my head, but that’s me not looking–anyone here followed that conversation closely enough to throw me a link? eg, what’s the expected gross profit on a liquidation auction as a percentage of the loan balance? That seems like the relevant info here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.602631578947368
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#17",
                    "likes": "3",
                    "time": "23/04/2021-23:10:18",
                    "content": "There is some analysis here: [Signal Request] Adjusting Dust Parameter (2021-2) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#18",
                    "likes": "4",
                    "time": "24/04/2021-09:33:34",
                    "content": "I’m not a SC dev, but I can chime in and say that repaying nothing but the full debt of a Vault under the dust limit is not possible, and would require a rewrite of the vat - the “vault engine” of the Maker Protocol, due to the following line of code: dss/vat.sol at master · makerdao/dss · GitHub I am not sure why exactly it was designed this way, to not allow partial repayments of dusty vaults, but when MCD was deployed, the dust limit was 20 Dai, so the gas fee landscape has definitely changed significantly since the code was written. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#19",
                    "likes": "9",
                    "time": "24/04/2021-12:35:11",
                    "content": "@lollike is correct. This can’t be easily changed. Even if we could though enabling partial repayments would defeat the point of the dust limit as someone could open a vault with dust debt then repay most but not all of it and repeat. This would allow spam attacks which is what the dust limit is there to prevent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#20",
                    "likes": "0",
                    "time": "24/04/2021-13:46:56",
                    "content": "Thanks for popping in to offer some informed perspective– If it’s a technical limitation of how dust is set up, that’s unfortunate. However, to your second point, that’s not what I’m suggesting. Currently, my understanding is that you already can’t open a vault with debt  debt floor result in debt < debt floor afterward. If you’re already above the debt floor, things stay exactly the same. But if you’re not, then allow partial repayment. Spammers would need to have opened vaults, and then a raise of the debt floor would have to occur to be in this condition, making an a priori attack a lot more difficult, no? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#21",
                    "likes": "0",
                    "time": "24/04/2021-17:45:04",
                    "content": "I suppose something like that could maybe work, but it doesn’t really matter as we can’t make a change even if we wanted to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#22",
                    "likes": "1",
                    "time": "24/04/2021-18:25:19",
                    "content": "That’s too bad. However, small holders are fucked by scaling right now more than ever, so … I hope the merge and scalability comes sooner rather than later. That said, I think @ccc made a good point earlier in the thread: Maker purports to bring finance to the people. And as I was saying earlier myself, scaling will continue to be an arms race, much like any in demand network. can you elaborate just a bit more on the dust mechanism for us? Like, what was the origin of the parameter in the protocol? I know that in some other contracts, dust can refer to the small-time scale accrued fractions of a token that night be left in an address even after you attempt “zero” the balance, like paying off a continuous interest debt in Maker, or withdrawing your earnings from a Yearn Vault. Is that how the dust piece originated here, and it’s now being conveniently repurposed as a debt floor? I guess where I’m trying to go with this line of thought is that at some point in the future, I’d love to see us (don’t get me wrong–us is really not me at all, I appreciate the immense body of work the whole Maker team has done!) split out the debt floor away from the dust mechanism-- if my assumptions about dust are correct above --and take steps to help the little guys by letting people do partial repayments when they’re already under the debt floor. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3120941558441555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#23",
                    "likes": "1",
                    "time": "24/04/2021-18:26:31",
                    "content": "Literally exactly the thread I couldn’t find before, much appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#24",
                    "likes": "2",
                    "time": "24/04/2021-21:59:09",
                    "content": "I think the intention has always been to reduce the dust parameter back down once scaling is in place and gas fees are reduced. Unfortunately, if vaults are too small that the value of gas to bid on them outweighs the potential profit then we effectively have unsecured DAI being generated. In addition to the thread @Aaron_Bartsch linked there are several threads here: https://forum.makerdao.com/tag/dust ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.781746031746032
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Scotty",
                    "index": "#25",
                    "likes": "0",
                    "time": "25/04/2021-05:37:54",
                    "content": "Hi just jumping in here on this topic too if I may. I’m in the same boat under the 5K dust level. My question however is will the “new” ETH v2 rollup (1559) etc be usable on my existing Vault in Oasis ? Or is it better to repay my debt and close the Vault and start again later with new ETH V2 on its new Vault Basically I have got the capital to get above the 5K now, or should I repay and start it all again with the this new ETH standard ? Is the contract interchangeable with ETH versions or a new contract needs to be started ?? Thanks for this info, just confusing for us guppies. Scott ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.429752066115703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#26",
                    "likes": "1",
                    "time": "25/04/2021-21:55:49",
                    "content": "    Scotty:  question however is will the “new” ETH v2 rollup (1559) etc be usable on my existing Vault in Oasis ?   EIP-1559 will not effect your Vault Ser, you’re good     Scotty:  Basically I have got the capital to get above the 5K now, or should I repay and start it all again with the this new ETH standard ?   Dust parameter is now 15K Ser–seek advice from your financial advisor Ser–I have no idea about finances–just trying to make 1 DAI out of 0.15 cents myself–sorry man. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.836363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Scotty",
                    "index": "#27",
                    "likes": "1",
                    "time": "25/04/2021-23:43:00",
                    "content": "Thanks for reply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#28",
                    "likes": "2",
                    "time": "26/04/2021-14:46:45",
                    "content": "EIP-1559 isn’t a rollup perse, it’s a restructuring of Ethereum’s fee market on a technical level–it’ll change the way gas works behind the scenes. The change should be fully compatible with your Vault as it exists now. Additionally, Ethereum as it exists now is in the middle of switching from a Proof of Work based security model to a Proof of Stake model. Proof of Work = Ethereum 1, Proof of Stake = Ethereum 2. The process of switching over will involve merging the existing ETH1 chain into the ETH2 network. This is unrelated to 1559 above, but the v2 you referenced makes me think you might have them confused. The merge into ETH2 should also not affect your vault. However, the point of moving to  a PoS model and of doing the upgrade is the scaling that that brings to the table, so hopefully at that point, fees will be tenable for even the littlest of goldfish. My understanding is that you can repay your debt to zero without “closing” your vault–ie, it will still be there even if you don’t have any collateral deposited or any debt owed, so if you have the capital to pay back all of your debt now, go for it–it won’t close any doors to using the vault in the future, and you won’t need to restart anything later. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Scotty",
                    "index": "#29",
                    "likes": "1",
                    "time": "26/04/2021-21:39:19",
                    "content": "Thanks for that info. There’s so much going on now in Defi and different protocols etc, us small guppies can’t afford to make mistakes and fees limit us on what we can actually do unfortunately. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.65
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jumnhy",
                    "index": "#30",
                    "likes": "0",
                    "time": "27/04/2021-17:36:59",
                    "content": "Ah, that does gibe with my understanding–I get the whole idea of why we’d have a debt floor. I just was curious if that had been the point of the dust parameter from day one. I’m still a bit surprised that adding a condition to the checks in the vat.sol for the fork and frob functions is non-trivial. Would I be correct in guessing that the problem isn’t in how hard it would be to write, but how hard it would be to push an update such a fundamental piece of the the codebase? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#31",
                    "likes": "0",
                    "time": "27/07/2021-23:37:01",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}