{
    "poll_list": [
        {
            "title": "Ratification Poll for Recognized Delegate Compensation (MIP61) - March 14, 2022",
            "index": "10640",
            "option": "Yes",
            "supporting_mkr": "22,038",
            "highest_fraction": 0.74
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip61-recognized-delegate-compensation/10640",
            "title": "MIP61: Recognized Delegate Compensation ",
            "index": 10640,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "delegation",
                "compensation",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "11",
                    "time": "01/10/2021-16:42:18",
                    "content": " MIP61: Recognized Delegate Compensation  Preamble MIP#: 61 Title: Recognized Delegate Compensation Author(s): Joshua Pritikin (@jpritikin) Contributors: @g_dip, @LongForWisdom, @Patrick_J Tags:  Type: process Status: Accepted Date Proposed: 2021-10-01 Date Ratified: 2022-03-28 Dependencies: Replaces: <List of MIP it is replacing> Ratification Poll URL: https://vote.makerdao.com/polling/QmTvzCjL?network=mainnet Forum URL: https://forum.makerdao.com/t/mip61-recognized-delegate-compensation/10640   References  Delegation and MakerDAO Whether to compensate delegates  Compensating recognized delegates, parameters. Introduction of the Performance Modifier   Sentence Summary This proposal describes how Recognized Delegates will be compensated.  Paragraph Summary Governance Facilitators will compute and send the compensation to Recognized Delegates starting from the MIP adoption date with payments sent monthly.  Component Summary MIP61c1: Definitions MIP61c1 defines key terms. MIP61c2: Compensation Formula and Process MIP61c2 specifies how to calculate the compensation and convey it to Recognized Delegates. MIP61c3: Payment Process MIP61c3 specifies the process for the payment of compensation to Recognized Delegates MIP61c4: Accommodation for Delegate Contract Migration MIP61c4 specifies how Recognized Delegates can continue to receive predictable payments during a contract migration. MIP61c5: Examples MIP61c5 provides examples of the calculation for a few different situations. MIP61c6: Modification of Parameters MIP61c6 is a process component that allows authors to appeal to Maker Governance to change compensation parameters.  Motivation  If I don’t delegate my MKR, why should I contribute to the expenses of those that do? I am receiving no benefit from this, and in fact may be harmed by a delegate who votes against my wishes.   Active engagement of delegates with the community and each other. This is unlikely if MKR holders hire their own delegates. Robust discussion and engagement should lead to better decision-making for the protocol. Consistency in defense of the hat. If the protocol compensates Recognized Delegates, they are incentivized to vote regularly in order to receive their compensation. If more MKR is securing the hat, the Maker Protocol is more secure. MKR holders paying their own delegates is unlikely to happen because it is not in their best interests to do so. It is in MKR holders best interests to let someone else (i.e. the largest MKR holder) spend their time and resources governing the system. Given that it is obfuscated who the largest MKR holder is, everyone assumes it is not them, and no one pays the costs.  The only way to force cooperation is to have the Maker Protocol pay for Recognized Delegates, such that the cost is divided between all MKR holders. Is this unfair for smaller MKR holders that actively vote? Yes, absolutely. But smaller MKR holders that actively vote cannot secure the hat or pass proposals without significant cooperation from other smaller MKR holders - and again, it is not in their best interests to do so given their relative vote-weight, especially in a high-gas environment, as the cost of voting for polls can become obstructive. Vote outcomes are largely determined by how well voters are informed. As Recognized Delegates hold a great deal of voting weight, MKR holders are strongly motivated to encourage delegates to be as informed as possible, deliberate on questions of Governance in depth, and engage in discussion with all stakeholders to gain the broadest possible perspective on the questions presented before them to decide. Compensation will help free Recognized Delegates from some of their other responsibilities. For outstanding Recognized Delegates, a secondary goal of compensation is to retain talent and prevent poaching other businesses or protocols.  Specific Goals  Recognized Delegate compensation should be positively correlated with MKR weight. There should be a per-delegate maximum compensation because we do not expect a large difference in performance among outstanding Recognized Delegates. Compensation should be positively skewed toward Recognized Delegates with smaller MKR weight to encourage recruitment of new Recognized Delegates. The compensation formula should discourage zero-sum thinking among Recognized Delegates. One Recognized Delegate’s compensation should be as independent as possible from another Recognized Delegate’s compensation.   Performance Modifier Motivation The intention behind the Performance Modifier is that these parameters be considered over the duration of time that a Recognized Delegate is active. The advantage of such an approach is that it allows Recognized Delegates that have been performing at high levels flexibility in terms of unexpected ability to vote, for example, in the event of illness, or planned inactivity, such as a vacation period. If a Recognized Delegate’s parameters were calculated on a rolling-basis, for example over three months, taking a week off would have an outsized effect on compensation, particularly if it was a week with a large number of Governance Polls. If it is difficult or uneconomical for Recognized Delegates to take time off when required, there is potential this could lead to burnout and this is consequently undesirable.  Relevant Information  Quadratic funding   Specification / Proposal Details  MIP61c1: Definitions   Recognized Delegates: Any delegate that has been labelled as a Recognised Delegate by a majority of Governance Facilitators according to a public and consistently applied criteria.   MIP61c2: Compensation Formula and Process  A Solution Goal 1 can be addressed with a linear relationship or many different curves. Goal 3 can be addressed by using an exponential with a factor between 0 and 1 (exclusive). A factor of 0.5 results in quadratic funding. The idea is to distribute compensation proportional to the square root of the MKR weight. To achieve goal 2, we cap the maximum per-delegate compensation.     Parameter Math Symbol Initial Value     Threshold for a large delegate T 10k MKR   Exponential factor q 0.5   Maximum annual compensation per delegate C 144k DAI    The formula is C*min(1,MKR^q/T^q). In practice, the Governance Facilitators will calculate compensation for Recognized Delegates on a monthly basis, as such the formula becomes (C*min(1,MKR^q/T^q))/12.  If a Recognized Delegate has greater than or equal to T MKR delegated to them, they will receive the maximum amount of compensation, C. If a Recognized Delegate has less than T MKR delegated them, they will receive an amount of compensation derived by the above formulae.   Performance Modifier Governance Facilitators track participation and communication metrics for each Recognized Delegate. For the purpose of calculating the Performance Modifier, we look at the minimum of the two metrics. For example, if a Recognised Delegate has 85% participation and 80% communication then the Performance Modifier is based on min(85%, 80%) = 80%. A few parameters are used to determine the effect of the Performance Modifier. For Participation, a score of 100% would mean that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Votes separately and also tracks a combined overall participation rating. For Communication, GovAlpha tracks how Recognized Delegates have communicated their voting decisions. Recognized Delegates are rewarded with a higher score for providing reasoning for their voting decisions. For example, a score of 100% would mean a Recognized Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Recognized Delegate communicated their decisions but did not provide any reasoning for these decisions. Recognized Delegate are expected to communicate their vote within seven days of a Governance Poll concluding. For Executive Votes, a more lenient approach is taken as there may be valid reasons to delay voting on an Executive Vote, so it is expected that reasoning is communicated within two weeks of an Executive Vote being executed on-chain. Their scores for each vote are combined to give an overall communication rating.     Parameter Math Symbol Initial Value     Threshold for adequate performance L 75%   Threshold for good performance H 90%   Beginning compensation scalar B 40%     For less than L, the Recognized Delegate will receive no compensation. For L or above, the Performance Modifier starts at B and rises linearly to 100% for metrics of H and above.  This is demonstrated in the below graph:  dc0d6e19d5b85b312de77d11b458a1ecb9ab2e63_2_1035x6341035×634 15.2 KB  These requirements and metrics may be adjusted in the future depending on the number of Recognized Delegates, the resources available to the Governance Facilitators, and feedback from the Recognized Delegates themselves.  MIP61c3: Payment Process  The Governance Facilitators shall maintain a note of how much MKR was delegated to each Recognized Delegate each day. Compensation will be calculated on a monthly basis using the mean average of MKR delegated to each Recognized Delegate over the course of the month, using the formulae detailed in MIP61c2. Once calculated, a summary of the compensation for the Recognized Delegates will be published to the MakerDAO forum. Compensation for Recognized Delegates will be distributed by Executive Vote, the Governance Facilitators will aim to include these payments in the first Executive Vote of each calendar month. Recognized Delegates should confirm both the amount of compensation being paid, and the receiving address with the Governance Facilitators in the week leading up to the Executive Vote If a Recognized Delegate is not able to do this, that Recognized Delegate’s compensation will not be included in the next Executive Vote and instead will be included in a future Executive Vote at a mutually agreeable time.   MIP61c4: Accommodation for Delegate Contract Migration This component addresses the situation when a Recognized Delegate intends to migrate from one delegate contract to another. The associated entity must inform governance 7 days in advance of the migration effective date and which contracts are affected. The new delegate contract cannot already be involved in a migration (e.g., two delegates merging into one). During a 30 day interim period, the old and new delegate contracts are regarded, for the purpose of compensation, as referring to the same entity and compensation is calculated using stats from both the old and new contracts. For example, MKR weight will be obtained by the sum of the MKR weight of the old and new contracts. Participation and communication stats will be calculated across both delegate contracts.  MIP61c5: Examples Suppose the parameters are set to their initial values. The effect of the Performance Modifier is B+(1-B)(clamp(min(participation, communication),L,H)-L)/(H-L) With 100 MKR delegated, 95% Participation, and 95% Communication, the compensation is calculated as C*min(1,100^q/10000^q). The Performance Modifier is 100% because min(95%,95%) >= 90%. This is 100% C*10/100 = 14 400 DAI per year. With 6772 MKR delegated, 85% Participation, and 95% Communication, The Performance Modifier is 40%+(1-40%)(clamp(min(85%,95%),75%,90%)-75%)/(90%-75%) simplifing to 40%+60%(85%-75%)/15%. The compensation is calculated as C*min(1,6772^q/10000^q). This is 80% C*82.29/100 = 94 797.6 DAI per year. Compensation can be visualized by plotting the amount of MKR delegated against the compensation formula,  Rplot01708×441 6.43 KB   MIP61c6: Modification of Parameters The parameters that can be modified are:  Threshold for a large delegate Exponential factor Maximum annual compensation per delegate Threshold for poor performance Threshold for adequate performance Beginning compensation scalar  Recognized Delegates are potentially conflicted in consideration of these proposals. There may be a temptation to approve increases in compensation and vote against decreases. Hence, a Signal Request is required to assess broader community sentiment and spotlight any positions on the MIP61c5 proposal staked out by Recognized Delegates. The Signal Request Poll must be posted at the start of the Frozen Period. The Governance Facilitators will aim to perform a review of the above parameters on an annual basis. This will provide an objective review of these parameters and take into account changes in the amounts of MKR delegated, the number of active Recognized Delegates, as well as USD inflation to ensure that Recognized Delegates remain fairly compensated, whilst also ensuring good value for MKR holders. It is expected that this will occur in April to bring it in line with the annual GovAlpha CU budget submission. MIP61c5 subproposals have the following parameters:   Requirements: 7-day Signal Request Thread, passing with 51%. If the Signal Request fails, then the proposal does not proceed to the Governance Cycle.  Default Feedback Period: 4 weeks  Frozen Period: 1 week  Governance Cycle: Monthly  ",
                    "links": [
                        "https://forum.makerdao.com/t/delegate-compensation-informal-poll/10042",
                        "https://forum.makerdao.com/t/informal-poll-compensating-recognized-delegates-parameters/10196",
                        "https://forum.makerdao.com/t/signal-request-should-we-introduce-a-performance-modifier-to-the-delegate-compensation-trial/11850",
                        "https://en.wikipedia.org/wiki/Zero-sum_thinking",
                        "https://vitalik.ca/general/2019/12/07/quadratic.html",
                        "https://forum.makerdao.com/t/signal-request-should-we-introduce-a-performance-modifier-to-the-delegate-compensation-trial/11850",
                        "https://forum.makerdao.com/t/signal-request-should-we-trial-delegate-compensation-as-described-in-mip61-over-3-months/10978",
                        "https://forum.makerdao.com/t/delegate-compensation-breakdown-december-2021/12462",
                        "https://forum.makerdao.com/t/signal-request-extend-the-delegate-compensation-trial/12686",
                        "https://forum.makerdao.com/t/maker-governance-review-2021/12478",
                        "https://forum.makerdao.com/t/weekly-mips-update-68/12460",
                        "https://forum.makerdao.com/t/weekly-mips-update-67/12387",
                        "https://forum.makerdao.com/t/actualizacion-encuestas-de-la-semana-13-de-diciembre-del-2021/12259",
                        "https://forum.makerdao.com/t/maker-relay-ep-75-en-espanol/12214",
                        "https://forum.makerdao.com/t/weekly-mips-update-66/12190",
                        "https://forum.makerdao.com/t/maker-relay-ep-75/12187",
                        "https://forum.makerdao.com/t/weekly-mips-update-65/12033",
                        "https://forum.makerdao.com/t/weekly-mips-update-64/11878",
                        "https://forum.makerdao.com/t/weekly-mips-update-63/11768",
                        "https://forum.makerdao.com/t/signal-request-compensation-bridge-for-delegation-contract-migration/11719",
                        "https://forum.makerdao.com/t/paperimperium-delegate-platform/8992/40",
                        "https://forum.makerdao.com/t/weekly-mips-update-62/11653",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/7",
                        "https://forum.makerdao.com/t/weekly-mips-update-61/11523",
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517",
                        "https://forum.makerdao.com/t/weekly-mips-update-60/11347",
                        "https://forum.makerdao.com/t/weekly-mips-update-59/11186",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/signal-request-should-we-increase-maximum-delegate-compensation-as-described-in-mip61-to-144k-dai-for-the-initial-3-month-delegate-compensation-trial/11093/5",
                        "https://forum.makerdao.com/t/issues-with-our-governance-process-and-delegate-compensation/11088",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/weekly-mips-update-58/11074",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-7th-october-14th/11003",
                        "https://forum.makerdao.com/t/weekly-mips-update-57/10921",
                        "https://forum.makerdao.com/t/weekly-mips-update-56/10691",
                        "https://forum.makerdao.com/t/maker-governance-review-september-2021/10645",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-30th-october-7th/10837",
                        "https://forum.makerdao.com/t/informal-poll-sybil-resistance-for-recognized-delegates/16810",
                        "https://forum.makerdao.com/t/informal-poll-restructuring-incentives-for-recognized-delegate-compensation/16469",
                        "https://forum.makerdao.com/t/decap-quadratic-funding-augmenting-the-endgame-optimal-infrastructure-funding-mechanism-for-makerdao/15904",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2",
                        "https://forum.makerdao.com/t/monthly-governance-review-march-2022/14428",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/46",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-marzo-de-2022/14181",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-14-de-marzo-de-2022/13917",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906",
                        "https://forum.makerdao.com/t/weekly-mips-update-77/13706",
                        "https://forum.makerdao.com/t/governance-and-risk-179-thursday-february-24-17-00-utc/13369/2",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/32",
                        "https://forum.makerdao.com/t/weekly-mips-update-73/13092",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/23"
                    ],
                    "GPT-summary": "The post is a proposal (MIP61) that describes how Recognized Delegates will be compensated. The proposal includes definitions, compensation formula and process, payment process, accommodation for delegate contract migration, examples, and modification of parameters. The author explains the motivation behind compensating Recognized Delegates and the specific goals of the compensation formula. The post also includes information on the Performance Modifier and relevant information on quadratic funding. The post may be of interest to those interested in MakerDAO governance and compensation for Recognized Delegates.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.511974148163664
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/10/2021-22:24:52",
                    "content": "Thanks for all the work you’ve put into these delegate compensation plans. Compensation is never an easy topic to discuss and I think (Recognised) Delegates need to get paid in order for this to work. I’m curious to hear more from the delegates themselves but in order for delegation to be an effective, I think we need to create a situation where:  Delegates don’t worry about gas. Delegates don’t worry about legal/regulatory risks. This isn’t to say delegates shouldn’t be concerned with legal/regulatory risks; only that we’ll have a hard time finding and retaining good delegates if they’re worried about going to jail. Delegates are able to justify the time needed to effectively evaluate proposals. In other words, if we want good work, we have to pay for it.  Ignoring Gauntlet, because they haven’t been delegated MKR or voted yet, the Recognised Delegate with the least MKR currently holds 66.75 MKR. What if we set a floor and make any Recognised Delegate with at least 50 MKR eligible for a “base salary” and use the curve to allocate additional compensation? I’m not sure what to propose as a minimum for dealing with gas so I’ll throw out 50/week as a starting point. Legal fees can easily run from 300-600/hour. Assuming a delegate wants 5 hours/month of consultation, we’re looking at 1500 - 3000/month. If we stick with the low end of these estimates and kick in 1000 for their time, we could start at 2700 or just round up to 3000/month/delegate as the base. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "1",
                    "time": "01/10/2021-23:04:23",
                    "content": "@seth Do you see your base compensation proposal as independent from the proposed MIP? If so then perhaps it could be pursued independently and does not hinder or advance the current proposal? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#4",
                    "likes": "2",
                    "time": "02/10/2021-00:04:11",
                    "content": "It could be independent if the DAO wants to consider things that way but I’m just sharing feedback. I think it’s ultimately up to delegates to let the DAO know what they want and need with regard to compensation so I don’t feel like it’s my place to make a formal proposal. To be clear, I don’t mean to suggest that you shouldn’t have submitted this MIP; like I said, I think it needs to happen and am glad to see the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "7",
                    "time": "02/10/2021-00:57:08",
                    "content": "Posting here because it’s relevant. $100-$500/hr pay at Aave is about to purchase hours from one of our delegates + one of our important risk assessment personnel. Given we all have 24 hours in a day, Maker needs to find ways to retain the full attention of key personnel, even if it’s just extra hours. People will follow the money, and you can’t blame them one iota. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.15
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#6",
                    "likes": "2",
                    "time": "02/10/2021-04:15:41",
                    "content": "This Aave Risk DAO is relevant, and MakerDAO can just cut and paste it (and probably should). This is about delegation of work (and payment for it), not delegation of voting. Governance selected individuals for a quarter term, 5-10 hours per week, $100-$500/hr (skills based, avg. $200), 10% re-hire bonus, success metrics for doing risk based work. It’s the entire opposite end of the spectrum from a voting delegate. It’s narrowly focused work that voters are funding people to perform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "1",
                    "time": "05/10/2021-14:51:31",
                    "content": "Could we also post something in here that shows how this works out for the existing delegates? Not as part of the MIP, just as an aid to help people understand how it breaks down. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "2",
                    "time": "05/10/2021-14:53:32",
                    "content": "    psychonaut:  MIP61c1: Compensation Formula and Process   We need to include some minimum requirement with respect to communication and participation metrics here, otherwise this is very abusable. I would recommend >90% for both, that leaves enough leeway for unavoidable absences / accidents while still ensuring the delegates maintain a good standard. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "5",
                    "time": "05/10/2021-15:03:17",
                    "content": "    LongForWisdom:  Could we also post something in here that shows how this works out for the existing delegates?       delegate per month     monetsupply 679   Flip Flop Flap 3255   MakerMan 118   Field Technologies 4000   Tim Black 404   Planet_X 4000    These numbers are taken from the lower block of Delegate Reward Proposal v2.0 - Google Sheets ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "1",
                    "time": "05/10/2021-15:06:08",
                    "content": "    LongForWisdom:  We need to include some minimum requirement with respect to communication and participation metrics here, otherwise this is very abusable.   If I recall correctly, @blimpa suggested that I remove the definition of Recognized Delegates and leave that to Governance Facilitators to define. @blimpa can you comment? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#11",
                    "likes": "1",
                    "time": "05/10/2021-15:17:13",
                    "content": "I did find it a bit odd to have that one definition there, which I also found to be prescriptive in tone, since delegation had been worked outside of the MIPs Framework. I suggested to add a reference to the forum post Delegation and MakerDAO. I don’t think that removed definition made any reference to minimum communication and participation metrics though, but I might be wrong. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "1",
                    "time": "05/10/2021-15:25:49",
                    "content": "I actually suggested that that go in. In an ideal world it would be defined in the MIPs framework itself. Given that no one has done that yet, the best way to define it is to refer to the governance facilitators. In practice it’s accurate, and is more or less the best we can do in the MIP. The alternative is not defining it at all, which I believe is worse. Minimum comms and participation metrics don’t define Recognised Delegates, but they do need to define who gets compensated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.020833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "1",
                    "time": "05/10/2021-20:29:12",
                    "content": "    psychonaut:  These numbers are taken from the lower block of Delegate Reward Proposal v2.0 - Google Sheets    Hey bud your numbers need to be updated – some of the Delegates have been allocated a little more MKR to their respective delegate contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#14",
                    "likes": "2",
                    "time": "12/10/2021-07:14:03",
                    "content": "Added goal 4:     psychonaut:  The compensation formula should discourage zero-sum thinking among delegates. One delegate’s compensation should be as independent as possible from another delegate’s compensation.   We certainly don’t want delegates wasting energy trying to sabotage other delegates. In contrast, let all flowers bloom.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.111607142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#15",
                    "likes": "1",
                    "time": "12/10/2021-10:17:34",
                    "content": "Since there already is a maximum per delegate compensation amount, is there a limit on how many such delegates there can be and/or a maximum total compensation amount? Note that depending on what parameters you choose, this doesn’t necessarily mean zero-sum thinking (which I agree should be avoided) with the number of delegates right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.473214285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#16",
                    "likes": "1",
                    "time": "12/10/2021-15:12:54",
                    "content": "    AstronautThis:  Since there already is a maximum per delegate compensation amount, is there a limit on how many such delegates there can be and/or a maximum total compensation amount?   No, it is in the hands of MKR holders how many delegates to delegate to. The only limit is imposed because there is a finite amount of MKR. Originally I was thinking that there should be a parameter for the maximum total comp summing across all delegates. However, this parameter could be updated by vote anyway so why not just let MKR holders determine the parameter by how they delegate. It seems more direct and simple. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.9875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#17",
                    "likes": "2",
                    "time": "12/10/2021-18:08:43",
                    "content": "    psychonaut:  Originally I was thinking that there should be a parameter for the maximum total comp summing across all delegates. However, this parameter could be updated by vote anyway so why not just let MKR holders determine the parameter by how they delegate. It seems more direct and simple.   Maybe this was discussed further elsewhere and you can point me to it if so but the last post here seemed to propose a maximum of 10 well-compensated delegates. EDIT: I see LFW’s proposal on the spreadsheet now. My two cents on this is that I prefer your original line of thought. Either a maximum number of delegates or maximum total compensation would be a good thing as it provides an additional safeguard on the total expenditure, even if it adds some complexity. This is a parameter that can be updated by MKR holders, if required. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.931818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#18",
                    "likes": "2",
                    "time": "12/10/2021-18:19:33",
                    "content": "    AstronautThis:  Maybe this was discussed further elsewhere and you can point me to it if so but the last post here seemed to propose a maximum of 10 well-compensated delegates.   Yeah, that’s correct. There hasn’t been much debate on this decision. @LongForWisdom proposed the simple compensation scheme in the current draft. I decided that I liked it because it makes delegate compensation more independent. I’m not sure how strongly you feel about this change. MIP61 is pretty much certain to pass once it is up for a vote, regardless of the details. If we need to go back and debate this detail then what process would you propose? Informal poll? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.749084249084248
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#19",
                    "likes": "1",
                    "time": "12/10/2021-18:35:18",
                    "content": "I agree - this point is very unlikely to affect whether it passes or not. It was sort of polled in your original thread and had 50% abstaining and the next highest option selected was 10 delegates. But I think things were a lot less clear back then when the question was asked and participation was low. I’m not sure what the appropriate process is here. Maybe @LongForWisdom or @prose11 can suggest an appropriate course to take. I personally think including a cap doesn’t have any downsides and is a good safety feature to have so it’s more of a suggestion from my point of view. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.618589743589744
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#20",
                    "likes": "1",
                    "time": "12/10/2021-18:39:51",
                    "content": "    AstronautThis:  including a cap doesn’t have any downsides   Well, if we had 11 delegates then they would find themselves in a situation where persuading one of the delegates to resign and drop out would increase the compensation to the remaining delegates. That is an unpleasant zero-sum game dynamic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.250000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#21",
                    "likes": "2",
                    "time": "12/10/2021-18:44:46",
                    "content": "    psychonaut:  Well, if we had 11 delegates then they would find themselves in a situation where persuading one of the delegates to resign and drop out would increase the compensation to the remaining delegates.   They could also vote to increase that parameter of max compensated delegates. Assuming we had  delegates who were all contributing and the cap was in the way, this would be a straightforward thing to get passed, incidentally, by the delegates themselves  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#22",
                    "likes": "9",
                    "time": "15/10/2021-18:03:50",
                    "content": "So my thinking on the amounts here has evolved a bit in the past few days. Given the difficulty in attracting and retaining delegates, I’d suggest that we move to a higher maximum annual compensation per delegate. To give a little more colour here, we’re seeing delegates unwilling to accept the legal and regulatory uncertainty at the proposed rate of compensation. I think it’s unlikely that this uncertainty is going to go away at any point in the near future. If we don’t increase this, I think we will end up in a situation where delegated MKR continues to centralize to only a handful of delegates. Given that we’ve clearly undershot initial compensation here I would propose leaning towards overcorrection rather than further exacerbating the issue. I’d suggest increasing it 3x the current value to 144k. This is roughly equivalent to a CU facilitator at >10k MKR delegated. To avoid low quality delegate spam. I would suggest keeping the current thresholds for communication and participation. ",
                    "links": [
                        "https://forum.makerdao.com/t/issues-with-our-governance-process-and-delegate-compensation/11088"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.974264705882353
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#23",
                    "likes": "5",
                    "time": "15/10/2021-18:16:21",
                    "content": "    LongForWisdom:  I’d suggest increasing it 3x the current value to 144k.   I have been thinking this for a few weeks already, but I hesitated to propose any change until at least the MIP61 initial amount of 48k was flowing. Given that   @PaperImperium’s Supplemental Compensation proposal failed  @PaperImperium keeps talking about taking his expertise elsewhere   Planet_X has recently withdrawn 8000 MKR and sold about 750 MKR   I’d say this has become more urgent. 100% support ",
                    "links": [
                        "https://forum.makerdao.com/t/paperimperium-delegate-platform/8992/25",
                        "https://etherscan.io/tx/0x2066ce66620997e476260686645077fcd33163e9a2a1ac14c99e31f2040a6cd2",
                        "https://etherscan.io/address/0x4e83362442b8d1bec281594cea3050c8eb01311c"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#24",
                    "likes": "8",
                    "time": "15/10/2021-19:49:53",
                    "content": "As a CU facilitator, I can clearly see the value of having delegates, it’s a clear net positive (even without agreeing on everything). The system is far from perfect, but it’s an improvement and only the start. Fully in support. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.090909090909092
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#25",
                    "likes": "2",
                    "time": "27/10/2021-11:42:29",
                    "content": "Absolutely agree with the statement that this issue has become more urgent. I was very relieved to see (surprised, even!) that @PaperImperium decided to stick around even after his signal request failed to pass. The long-term success of Maker—regardless of the mission statement we decide to rally around—will require a healthy governance process, spearheaded by a diverse set of engaged and smart delegates. We won’t be able to cultivate this as a DAO without proper incentives in place. The opportunity cost in this sector is simply too high. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916369047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#26",
                    "likes": "1",
                    "time": "18/11/2021-21:52:22",
                    "content": "Changelog:  Added text (somewhat edited) from [Signal Request] Compensation Bridge for Delegation Contract Migration   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#27",
                    "likes": "1",
                    "time": "17/12/2021-19:13:44",
                    "content": "Changelog:  Merged Performance Modifier idea  ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-should-we-introduce-a-performance-modifier-to-the-delegate-compensation-trial/11850/15"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#28",
                    "likes": "5",
                    "time": "08/02/2022-18:30:39",
                    "content": "Changelog:  Expand and clarify description of Performance Modifier Label Performance Modifier parameters to facilitate parameter modification subproposals Document Payment Process Governance Facilitators shall do an annual review of parameters to ensure that delegates remain fairly compensated Subproposal Default Feedback Period changed from 1 to 4 weeks  Thanks @Patrick_J !! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.53125
                }
            ]
        }
    ],
    "group_index": "160"
}