{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip21-edge-case-scenarios/5430",
            "title": "MIP21 - Edge Case Scenarios ",
            "index": 5430,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "real-world-finance",
                "sixs",
                "rwa-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "6",
                    "time": "01/12/2020-17:49:41",
                    "content": "As contemplated in MIP21 and the Declaration of Intent, there are some scenarios that I would like provide clarity on: Specifically:  Liquidation Emergency Shutdown  While both scenarios are theoretically possible, they are by definition the edge cases. Specific for when the DAO wants to wind-down lending for LendCo, the mechanism of choice should be lowering the debt ceiling thus impeding further LendCo lending as I wrote about here. Liquidation Liquidation of the Trust can occur in fundamentally two unique ways.  Triggered by the Community via MKR Vote Initiated by the Trustee  Starting with the first, at any time, the MKR Community can (at its sole discretion) trigger a liquidation with no justification needed. This liquidation would be triggered by passing an Executive Vote instructing the Trustee to liquidate the assets of the trust(1). This “secure message in a bottle” allows the Trustee to see and read the will of the MKR token holders. Regarding the second, the Trustee is the fiduciary over the Trust. They are a regulated Trust company under Delaware law. The Credit Agreement between LendCo and the Trust will include many covenants (both positive and negative) that LendCo must comply with. Further, LendCo has several reporting requirements to which it must perform. Should the Trustee determine that LendCo is not in compliance with the Credit Agreement it will protect the beneficaries (MKR holder) by liquidation and foreclosure. (1) The asset of the Trust is the loan it provides to LendCo (in exchange for a security agreement). Those loans (including all of the rights that go with them) are the assets. Emergency Shutdown Should an emergency shutdown of the system be triggered, what happens to LendCo, the Trust, and the TFE? Fundamentally there are two scenarios that could play out as we explore this edge case. The protocol has an Emergency Shutdown triggered and then:  The protocol is relaunched The protocol is not relaunched  In both of the above edge case scenarios, one important note is that the voting system is not shutdown with an Emergency Shutdown. Thus the “will” of the MKR holders can always be heard. In the first scenario, the debt from the vault would be transferred from the then legacy system to the newly launched system. From a Trustee perspective, unless they are sent a “secure message in a bottle”, they do not even know anything has changed. Operationally and temporarily for LendCo, new DAI could not be minted nor burned. However all outstanding loans would remain in place. Importantly, the MKR community is motivated to relaunch the system to transfer the vault as it would represent both an Asset and a credit demand source. Should that Emergency Shutdown not relaunch within 30 days, then we fall into the second camp. The second scenario is the edge case of the edge case. This is where the system has had an Emergency Shutdown and the community  decides not to relaunch the system. In this scenario, the Trustee  liquidates the assets of the trust, and the question is then raised “how does the Trustee get DAI back to the vault if DAI no longer works?”. First, the Trustee will liquidate the assets of the trust and hold them in an FDIC regulated bank. The assets are held “in-trust” for the beneficiaries. Second, will the community want to get repaid in USDC? USDT? FedCoin? OtherCoin? DAIv2? newDAI? The short answer is I do not know what the community will want in the future under this edge case. No one does. I do not think it is wise to “hard-code” in how the value would be transferred back when that decision of how can be deferred. In that “secure message in a bottle” or any number of them, the community can instruct the Trustee in which way it wants that liquidated value to be returned. (e.g. maybe USDC no longer exists at that time but a new better stablecoin is the suitable replacement). The main point is that flexibility is important and it still requires MKR holders to vote on it. It is not my decision; rather it would be up to the future MKR holders. In both scenarios, the RWA-001 token would be fractionally allocated (no different than other tokenized assets). That liquidated value would be allocated to each of the then DAI holders. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914",
                        "https://forum.makerdao.com/t/risk-concentration-of-rwa-lendcos/5188"
                    ],
                    "GPT-summary": "The author of the proposal is providing clarity on edge case scenarios related to MIP21 and the Declaration of Intent. The scenarios include liquidation and emergency shutdown, and the author explains the mechanisms and procedures that would be followed in each case. The post also addresses the role of the Trustee and the MKR token holders in these scenarios. The post provides constructive criticism and asks questions related to the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.839646464646465
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/03/2021-23:49:42",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}