{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/request-for-feedback-legal-work-for-makerdao/16772",
            "title": "Request for feedback - legal work for MakerDAO ",
            "index": 16772,
            "category": [
                "Core Units",
                "Sustainable Ecosystem Scaling"
            ],
            "tags": [
                "feedback",
                "meta-governance",
                "legal",
                "ses-001",
                "incubation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#1",
                    "likes": "11",
                    "time": "22/07/2022-12:46:08",
                    "content": "Hi fren , I am an incubee under the @SES @LegalResearchTeam I have a background as an attorney, a regulator, and an entrepreneur. I believe legal work can be done in a better and more scalable way for DAOs and DeFi-products, by helping stakeholders help themselves. During the last couple of weeks, I have put some thoughts into how I believe my contributions to MakerDAO could create the most value. I ended up finding a need for:  help with prioritization, to make sure I spend my time on the most relevant problem an open source knowledge base, as more contributors share the same problem without knowing it not compromising the decentralization of the DAO with my presence or work an easier way to encourage and coordinate a grassroot movement of e.g. lawyers supporting MakerDAO when there is a need for it.  Based on these thoughts, I put together this framework, which I am currently working under.  docs.google.com    Stack Overflow for DAO and DeFi problems and solutions Operations  🥁,Hi and welcome to a Stack Overflow-like database for DAO and DeFi problems and solutions If you are a stakeholder in a DeFi-product or a DAO, this database will help you help yourself fix your problems! Problems already identified are...      Single-player The framework has a “single player feature”, as I use it to prioritize what I work on, create transparency and accountability and publish solutions to relevant problems. This is based on the feedback I receive when talking to stakeholders of MakerDAO. Multi-player However, the framework would become much stronger if I can manage to create a feedback culture and engage contributors from other DAOs to chip in on both refining problems and delivering solutions. This will take time of cause. Request for feedback Besides from this short intro, I will not write a long description of the framework here, as it should be self-explanatory. When that is said, I am of cause open for answering any question you might have. I would especially appreciate it if you would share your thoughts on what changes should be made for having you use it as your go-to solution for finding answers to your legal questions? Thank you!  Ps. comments on the ‘strategy and vision tab’ are also appreciated - this is still very experimental and only a few days old. About me  https://www.linkedin.com/in/sorenterpjessen/ Discord: Balloonist#6963 Email: [email protected] ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1eZa4Vl6o5gSPp5wDF9kDwH2ztCjjwyLxnnQMvUj8uYo/edit#gid=0",
                        "https://docs.google.com/spreadsheets/d/1eZa4Vl6o5gSPp5wDF9kDwH2ztCjjwyLxnnQMvUj8uYo/edit#gid=0",
                        "https://www.linkedin.com/in/sorenterpjessen/",
                        "https://forum.makerdao.com/t/relay-semanal-19-25-de-julio-del-2022/16925",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.688928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#2",
                    "likes": "2",
                    "time": "22/07/2022-13:26:54",
                    "content": "    Balloonist:  I would especially appreciate it if you would share your thoughts on what changes should be made for having you use it as your go-to solution for finding answers to your legal questions?   I love this work you put together! Well done! I think its important to emphasize that the ultimate go to  solution for finding answers is to speak with a licensed attorney and this work should not be substituted for same. I know there is a disclaimer in there but in terms of feedback I think people need to keep that in mind. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.151041666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "28/07/2022-08:34:57",
                    "content": "Good stuff my dear Sir. You covered a lot of ground here, but perhaps I missed the portion pertaining to Tax Implications from a single MKR owner to CUs. Also, what if a contributor is a citizen of a region such as South America, or better yet Antarctica?  And last but not least how do you plan on trying to provide answers to our questions when Regulators can’t even provide proper visible guidance?While at EthCC I attended a legal seminar, or three — and I can tell you none of the panelist had the right answers. Without proper guidance, you and I both know—Its a hard game to decipher. Otherwise, TY for putting this together. Looking forward to it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.446924603174603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#5",
                    "likes": "4",
                    "time": "28/07/2022-10:56:07",
                    "content": "Hi @flipflopflapdelegate, thank you for taking your time to review and comment on my initial work. The tax question I will add the tax issue, it’s a good question, and if we have enough ‘subscribers’ to the issue, it will be answered. Answers to questions without guidance from the regulators This is a great question and very relevant. There are a lot of hard questions out there, many of them with an uncertain answers, working on the edge of DeFi innovation and new organizational structures only makes this harder. The answers to these questions are typically not black or white answers as one regulator might interpret it in one way and another regulator in another way, interpretations may also change over time once consequences are assessed. For these questions, we can describe how the issue is currently handled by the stakeholders of MakerDAO or other DAOs. Curation, documentation, and discussion is the research approach we can apply to those questions, until we have clarity from official guidelines, etc. I believe, that it in some cases may be helpful to support the regulators with our interpretation, as we can try to control the narrative and demonstrate what is possible/not possible before guidelines are published. General changes Based on the feedback I have received so far (discord+face to face), I conclude the database needs two front-ends.   The first front-end is meant for delegates and MKR-holders. It will give an overview, show prioritization, and demonstrate accountability. It will probably be quite similar to the spreadsheet I linked to. The first front-end will also be used for collaboration and outsourcing of unsolved problems.   The second front-end is for stakeholders of MakerDAO who need a problem solved. For them, an overview of all identified problems is unnecessary noise. All they need is to get to the right answer as quickly as possible. So far I think this can be done by a Venn diagram-like funnel and/or a search function.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.571748917748918
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#6",
                    "likes": "5",
                    "time": "28/07/2022-11:17:55",
                    "content": "I think it’s important to stress that this should not be considered legal advice. Regulatory wise, it is a mess and I believe going to an actual attorney is the only way to receive legal guidance. For example (and this is not legal advice at all), in the law we have an advice of counsel defense. Basically it’s an affirmative defense that asserts, in sum and substance, we did nothing wrong because we relied on advice of counsel. Unless the party providing the advice is an attorney and there is an attorney client relationship formed, the advice of counsel defense, which is a major defense weapon in this area, would have no viability. So in the end, anyone looking for guidance they can rely upon should seek advice from an attorney. From what I understand this is not supposed to be a substitute for legal advice. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.661458333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "26/10/2022-11:17:57",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}