{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/modelo-de-marco-de-trabajo-de-incorporacion-de-colaterales/4858",
            "title": "Modelo de Marco de Trabajo de Incorporaci\\xc3\\xb3n de Colaterales ",
            "index": 4858,
            "category": [
                "Latin America"
            ],
            "tags": [
                "collateral-onboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/JoseFerrari",
                    "index": "#1",
                    "likes": "5",
                    "time": "24/10/2020-17:19:18",
                    "content": " Tras trabajar con los equipos de dominio y algunos miembros de la comunidad, nos complace anunciar la primera versión del modelo de Marco de Trabajo de Incorporación de Colaterales. ¿En qué consiste el marco de trabajo? El Marco de Trabajo de Incorporación de Colaterales es un modelo que busca comparar y priorizar los distintos tipos de colaterales de un modo lo más objetivo posible a modo de cultivar discusiones inteligentes. ¿Por qué fue desarrollado el marco de trabajo? El Marco de trabajo fue desarrollado para permitir a los equipos de dominio, a los equipos de trabajo y a colaboradores externos tener una visión general acerca de los tipos de colateral, su estado de incorporación y sus diferentes características. También queríamos proporcionar transparencia a la comunidad y un terreno común para desarrollar discusiones y futuras colaboraciones potenciales. ¿Dónde está el marco de trabajo? El marco de trabajo de priorización de colaterales vivirá en esta hoja de Google hasta que tengamos una mejor alternativa. Estamos hablando acerca de la posibilidad de desarrollar un tablero o bien una interfaz de usuario en el futuro pero sentimos que era esencial lanzar el marco de trabajo para poder comenzar el proceso cuanto antes e iterar sobre la funcionalidad antes de explorar diferentes opciones de alojamiento. Como leer el marco de trabajo   Fila 1: Nombre del equipo de dominio o grupo de trabajo responsable por ese parámetro.   Fila 2: Peso relativo asignado a dicho parámetro.   Fila 3: Nombre del parámetro. - Fondo verde significa \"beneficio\"  - Fondo rojo significa \"costo\"    Cada equipo tendrá que decidir sobre una caso base (generalmente ETH) y comparar cada tipo de colateral y asignarle un valor para cada parámetro.  null (sin data): 0 N/A: 0 Bajo: 1 Medio: 4 Alto: 9 Extremo: 16    La Puntuación de Visto Bueno toma en consideración la cantidad de MKR en cada encuesta y la normaliza entre los valores de -16 y 16. Los activos sin una encuesta de visto bueno son destacados en amarillo y asignados un valor por defecto como si hubiesen recibido 0 MKR a favor o en contra.   La puntuación de priorización es calculada por la suma de los productos de todos los [costes * pesos] y son restados de la suma de los productos del [beneficio * pesos].   ¿Cómo mantener el marco de trabajo?  Gobernanza actualizará los tipos de colaterales. Estos pueden venir de:  El foro (aplicaciones de MIP6) Cualquier contribuyente de dominio proponiéndolo para una evaluación preliminar.   Los equipos de dominio asignados / los equipos de trabajo serán los encargados de actualizar los valores de cada parámetro. La puntuación de priorización ayudará a facilitar las conversaciones entre equipos de dominio cuando estén coordinando sus esfuerzos para incorporar tipos de colaterales.  Consideraciones y máximas  Un modelo es una representación imperfecta de la realidad. Algunos datos es mejor que no tener ningún dato. El aporte de cada equipo es subjetivo y refleja la extensión de su actual conocimiento. El marco de trabajo es un documento viviente: tanto los pesos como los estimados pueden y van a cambiar. Cada equipo de dominio retiene la autoridad para elegir sus propios items de trabajo dado que hay esfuerzos que pueden proporcionar valor que no están cubiertos por el modelo. Esto incluye:  I&D para escalar operaciones. El esfuerzo “combinado” para varios tipos de colaterales. Trabajar en actividades que proporcionan valor al protocolo más allá de la incorporación de colaterales.    Mejoras potenciales (no exhaustivas)  Ajuste de Peso para mejorar el modelo. Nuevos parámetros (si hacen falta). Definición de parámetros (explicación). Equipos de dominio para redactar documentos que permitan a los contribuyentes ayudar y escalar la lista a más tipos de colateral. Mejor Interfaz de usuario (tanto para la visualización y el ingreso de datos/ modificación de los mismos). Cualquier feedback propuesto es más que bienvenido ( pueden dejar un comentario debajo ó el la hoja de cálculo).  Firmado Actores mandados. Esto es una traducción libre del artículo original en inglés, gracias a @JoseFerrari y @Lozadaluis12 por la traducción. ",
                    "links": [
                        "https://forum.makerdao.com/t/collateral-onboarding-framework-a-model/4838"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.53125
                }
            ]
        }
    ]
}