{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ceo-of-mining-capital-coin-indicted-in-62-million-cryptocurrency-fraud-scheme/15074",
            "title": "CEO of Mining Capital Coin Indicted in $62 Million Cryptocurrency Fraud Scheme ",
            "index": 15074,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "1",
                    "time": "10/05/2022-12:15:45",
                    "content": "Last week the United States Department of Justice unsealed an indictment charging the CEO of Mining Capital Coin (MCC), a purported cryptocurrency mining and investment platform, for allegedly orchestrating a $62 million global investment fraud scheme.    justice.gov – 5 May 22    CEO of Mining Capital Coin Indicted in $62 Million Cryptocurrency Fraud Scheme An indictment was unsealed yesterday charging the CEO of Mining Capital Coin (MCC), a purported cryptocurrency mining and investment platform, for allegedly orchestrating a $62 million global investment fraud scheme.      DOJ alleges that defendant operated “a fraudulent investment scheme and did not use investors’ funds to mine new cryptocurrency, as promised, but instead diverted the funds to cryptocurrency wallets under his control.” He is charged with “conspiracy to commit wire fraud, conspiracy to commit securities fraud, and conspiracy to commit international money laundering. If convicted of all counts, he faces a maximum total penalty of 45 years in prison.” Hopefully the bad actors will still be the target of the DOJ. We all know there are plenty of bad actors out there trying to exploit people under the presumption that they can act with impunity. Maybe now people will be somewhat more deterred to act unlawfully. ",
                    "links": [
                        "https://www.justice.gov/opa/pr/ceo-mining-capital-coin-indicted-62-million-cryptocurrency-fraud-scheme"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.56198347107438
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Walker",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/05/2022-14:56:12",
                    "content": "New York is also trying to criminalize rug-pulls    Cointelegraph    NY Sen. Thomas proposes to criminalize rug pulls and other crypto frauds Through the bill, the senator seeks to provide prosecutors with a clear legal framework against crypto crimes that align with the spirit of the blockchain while combatting fraud.      ",
                    "links": [
                        "https://cointelegraph.com/news/ny-sen-thomas-proposes-to-criminalize-rug-pulls-and-other-crypto-frauds"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.389204545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/05/2022-15:40:19",
                    "content": "This is very interesting. I live and work in NY so this is great info that I was not aware of. Without the benefit of research, I suspect that this will have bicameral support as it makes it way  to state assembly and senate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.826704545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/05/2022-16:49:30",
                    "content": "Of course, all the bad actors in the ecosystem seek to profit themselves from any environment, no matter what the consequences. I am glad to see this kind of actions ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                }
            ]
        }
    ]
}