{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/spring-cluster-introduction-and-proposal/18398",
            "title": "Spring Cluster Introduction and Proposal ",
            "index": 18398,
            "category": [
                "Governance"
            ],
            "tags": [
                "endgame",
                "metadao",
                "protector",
                "cluster-intro",
                "metadao-cluster",
                "spring-cluster"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Centrifuge",
                    "index": "#1",
                    "likes": "28",
                    "time": "17/10/2022-19:51:16",
                    "content": "Hey everyone  @Centrifuge and @Blocktower are excited to present a vision for the Spring Protector Cluster.  Background This is our announcement about the existence of a group of people who are collaborating with the aim of making an onboarding proposal to a future Protector MetaDAO, should the Endgame Plan and associated MIPs pass their vote. As a point of clarification, the MetaDAO itself will be controlled by token holders only. Per the current Endgame specification, tokens will be available for anyone to farm with DAI, ETH, and MKR after launch. The token holders will then be able to vote on whether to accept or reject our cluster proposal. It’s important to point out that while Blocktower and Centrifuge have been key supporters and collaborators within the Spring Cluster, and are taking the lead on presenting it to the community on the forum, we are not the proposed internal team of the Cluster. The internal team - which is currently unannounced to reduce disruption in the Maker workforce - will evaluate the merits of continuing the work with Blocktower and Centrifuge after being on boarded to the MetaDAO, and will make a recommendation for the MetaDAO token holders to then accept or reject working with Blocktower and Centrifuge through a vote.  The Vision Of Spring Maker’s vision to build transformational tools that empower businesses, individuals, and communities always contemplated real world adoption and valuation creation… Today, Maker stands in a powerful position to accelerate the adoption of its tools outside the digital-only space and fertilize meaningful, transparent and impactful change in the real world. It is Spring time for Maker - where Maker’s scalable, open, and empowering methodologies take root in the fertile soils of the real world. Our vision is to enable the future Protector to build the long-term capability that enables Dai to meet real world business needs in an open and transparent manner. We believe that bringing Dai to the real world is the critical step in making Dai more economically successful, more politically acceptable, and ultimately, more impactful to everyday people and businesses. The cluster will leverage committed and experienced professionals who have a fundamental focus on technology, a deep alignment with the ethos of Maker and crypto at large, and a desire to see Dai have a positive impact in the real world. As the proposed cluster for a Protector, we believe we can build revolutionary new financial systems and facilitate extraordinary social impact. In doing so, we believe in being stewards of the Maker protocol. Our deeply held convictions on the future of Maker will be balanced with strong financial and risk controls, thorough due diligence, and an adherence to all legal and regulatory rules. This approach is not just necessary to integrate real world assets, but enables a higher-degree of reliability and accountability. BlockTower, working with Centrifuge, will be the initial arranger within the Protector. Together, we will create repeatable, scalable, and reliable frameworks for on-chain RWA investments. This cluster envisions expanding to include like minded partners, that are technology-driven, impact focused, and aligned to delivering real world value in a compliant and safe manner. Following the lead taken by Maker Growth in Latin America, this cluster will dedicate time and resources to building out the adoption of Dai in emerging markets, such as Dai investments in Africa, Southeast Asia, and other emerging market countries.  Who We Are We are working to source the initial resources and develop our cluster participants. Our initial grouping is as follows:  Internal Team     Role Person     Facilitator Unannounced   Legal Expert Unannounced   Credit Underwriter Unannounced     Key Partners and Ecosystem Actors     Role Entity     Arranger @Blocktower   Infrastructure Service Provider @Centrifuge    We aim to bring the best parts of the Maker protocol, the best fundamentals of traditional finance, and combine this into a progressive vision of on-chain finance. We aim to do so by operating with integrity, transparency, and a bias for action.  What We Intend to Do First, our mandate is to be a steward of Maker: protecting the overall balance sheet, being mindful of the allocation provided to us, and performing all activities with the requisite due diligence needed to manage billions of dollars of capital. Next, our mandate is to source, underwrite, structure, and manage deals that protect Maker’s interests, enable Dai’s growth in the real world, and foster the adoption of technologies that make transactions more efficient and open than before. Our true calling is to do so with a high-level of transparency, repeatability, and scalability through professional execution enabled by on-chain technologies. Navigating the complexity of real world assets is our speciality. Leveraging the structure developed and learnings from BlockTower’s Arranger proposal (MIP6), we are pioneering a scalable model where professional arrangers can onboard high-quality, well-underwritten assets consistent with Maker’s needs and principles, and the real world’s economic and social interests. BlockTower is setting the standard for all future arrangers to be structurally aligned with Maker on every deal by committing significant first-loss (junior) capital. BlockTower’s understanding and access to key RWA markets enables Maker to onboard more flagship collateral, assets that create significantly positive real world impact. Along with our experience in traditional finance, we intend to fully leverage the power of blockchain technology to break through the limitations of existing financial instructure. We can do so by pushing more data on-chain, more automation via smart contracts, and more authenticity through the use of a shared digital ledger. Centrifuge is a committed member of our cluster, providing the full weight of their infrastructure, tech stack, and ecosystem to build this vision.  1600×609 186 KB  Building on the learnings with the Centrifuge technology platform, the proposed cluster will push innovation across the entire financing value chain. Digitization and blockchain tools can radically improve many parts of the financing value chain.  While Maker vaults and the minting of Dai provides an important source of wholesale funding liquidity, the magic is not just cheap capital.The magic is the protocol’s ability to integrate blockchain-based collateral, providing a credibly neutral and reliably usable platform for funding. Naturally, the initial use cases arose in the crypto market, but today, Maker can leverage its funding liquidity to give life to new, transparent, and safe digital real world assets. Opportunities abound across multiple sectors and asset classes. This proposed cluster will challenge arrangers and ecosystem actors to utilize tested, structured finance techniques and:   Adopt programmable and automated solutions, such as Ricardian contracts that blend natural language contracts with smart contract functionality   Utilize blockchain and other technology, such as the internet of things, to birth high-quality, liquid assets   Build upon existing legal innovations - like the Uniform Electronic Transactions Act in the United States - to tightly integrate the real world with the digital    Our Cluster’s Meta We believe in a future that brings the entire credit ecosystem on-chain. Blockchain and on-chain assets have emerged as a reaction to opaque, centralized, and top-down systems. It is a technology that enables greater trust, offers full transparency, and can use immutability to provide greater authenticity to digital services. We believe that these fundamentals can be used to develop improved financial infrastructure that can better serve economic needs. Our focus, from the deals we finance, to the service providers we partner with, to the future members of our cluster, will be on RWA builders within the crypto ecosystem. We expect every member of our community to believe in building the future of finance, and not simply participating in it. Those who wish to use technology to create a fundamentally better system is where we will align our efforts and capital. To develop our vision of an on-chain world of credit requires the development and innovation of fundamentally new products, services, and interactions. We believe we can leverage the on-chain primitives and ecosystem provided by the Centrifuge protocol to promote the continuous collective development of this infrastructure. Partners from the entire DeFi landscape can engage with our on-chain services and contribute directly to an open-source platform. Beyond the core on-chain products, members of our community will be able participate in underwriting of underlying RWA collateral, contribute new primitives and data-driven processes, and collaborate together to develop fundamentally new practices in digital asset financing. Working within a ProtectorDAO, we believe we’ll best be able to harness the fundamental components of the Maker protocol while pursuing the objective of real world asset financing with Dai. We believe that the best way to accomplish these goals and make a positive impact in the world is to build it collectively, with a community of like-minded experts and practitioners who share our vision of the future. We encourage Spring community members to take a builders-mindset and truly work towards building the future of finance.  BlockTower’s Disclaimers  BlockTower Capital Advisors LP and/or BlockTower Credit GP LP, and/or any of their affiliates (collectively, “BlockTower”), have contributed to parts of this post in the forum provided by Centrifuge. Any graphs, charts and other visual aids provided herein by BlockTower are for informational purposes only. None of such graphs, charts or visual aids can in and of themselves be used to make investment decisions. No representation is made by BlockTower that these materials will assist any person in making investment decisions and that no graph, chart or other visual aid can capture all factors and variables required in making such decisions. Certain links, including links to other websites which may be maintained or controlled by the BlockTower may be provided in this document. These links are provided as a convenience and do not imply BlockTower’s sponsorship or approval of any third-party websites or their content. Links to or from this forum do not constitute an endorsement by BlockTower, and all information is provided “as is.” BlockTower does not provide any warranties, express, implied or otherwise, regarding the accuracy or completeness of information provided herein. ",
                    "links": [
                        "https://www.notboring.co/p/everything-is-broken",
                        "https://forum.makerdao.com/t/governance-and-risk-212-thursday-october-20-at-17-00-utc/18427/3",
                        "https://forum.makerdao.com/t/blocktower-credit-commercial-and-legal-risk-assessment-part-i/18790",
                        "https://forum.makerdao.com/t/mezcal-holiday-season-tasting-centrifuge-blacktower-credit-with-asad-khan-on-drinks-w-makerdao-delegates/19219",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/26",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/21",
                        "https://forum.makerdao.com/t/mip90-liquid-aaa-structured-credit-money-market-fund/18428",
                        "https://forum.makerdao.com/t/relay-semanal-20-de-octubre-28-de-octubre-del-2022/18703",
                        "https://forum.makerdao.com/t/governance-and-risk-214-november-03-at-17-00-utc/18637",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/22",
                        "https://forum.makerdao.com/t/how-the-endgame-metadaos-will-scale-faster-with-nadia-of-the-makerdao-growth-core-unit-drinks-with-makerdao-delegates/18537",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-octubre-2022/18516",
                        "https://forum.makerdao.com/t/introduccion-y-propuesta-del-grupo-de-spring-traduccion/18512",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-15/18478"
                    ],
                    "GPT-summary": "The post introduces the Spring Protector Cluster, a group of people collaborating to make an onboarding proposal to a future Protector MetaDAO. The proposal aims to enable the future Protector to build the long-term capability that enables Dai to meet real-world business needs in an open and transparent manner. The post explains the vision, the team, and the intended actions of the cluster. The post also includes a disclaimer from BlockTower Capital Advisors LP and/or BlockTower Credit GP LP, and/or any of their affiliates.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.879049713727134
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#2",
                    "likes": "7",
                    "time": "18/10/2022-20:46:48",
                    "content": "Great to see this cluster make it to the forum! As I mentioned in the Viridian cluster thread, it is crucial to have at least 2 protectors as this will allow Maker Governance to massively simplify the complexity of managing RWA from absolute decisions to relative decisions. Instead of having to figure out the best and correct way to do RWA, we can provide simple and broad guidelines and then let the two, and later many more, Protectors innovate and compete to provide us the safest and most transparent yield. It may also become possible to ringfence jurisdictional exposure at the highest level by splitting up jurisdictions per MetaDAO. This is not going to be viable in the very short term as most RWA will be US based, but later on as physical resilience becomes increasingly important we will likely look for ways to guarantee broad exposure across many different jurisdictions, preventing concentration of assets into a single point of failure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907380952380953
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlockTower",
                    "index": "#3",
                    "likes": "4",
                    "time": "20/10/2022-13:52:24",
                    "content": "Thank you @Centrifuge and @rune As referenced in the cluster introduction, BlockTower is excited to participate in Maker and @Centrifuge’s journey in bringing RWAs on-chain in a compliant, scalable, and resilient manner. Our work with @Centrifuge and the Spring Protect Cluster is an extension of the arranger model that we are actively building, iterating on, and defining for Maker. (See BlockTower’s MIP6 here). Through this cluster, we hope to share the technical and institutional knowledge that we’ve gained with more arrangers while establishing standards that protect Maker now and into the future. To that end, we share @rune’s vision in introducing greater resiliency and diversity in Maker’s RWA efforts than before. More updates to come and always welcome feedback from the community! ",
                    "links": [
                        "https://forum.makerdao.com/t/ari-paul-blocktower-maker/18787",
                        "https://forum.makerdao.com/t/mip6-blocktower-credit-transaction-documents/19019/7"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.713541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/10/2022-20:47:12",
                    "content": "Hi, have a question if @rune can take it, in order to be alive, Clusters needs MetaDAOs to be alive right? Why there are so many clusters starting to send proposals but no MetaDAOs, Am I losing something here? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.029761904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#5",
                    "likes": "4",
                    "time": "21/10/2022-20:57:06",
                    "content": "I can answer this. Anyone can form a cluster in anticipation of the launch of a metadao. I believe there are 2 protector metadaos that will launch. There can be 100 clusters that form to vie for those 2 metadaos. Ultimately, metadao tokenholders (those who farm metadao tokens) decide who to employ. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/justin1066",
                    "index": "#6",
                    "likes": "2",
                    "time": "25/10/2022-19:58:09",
                    "content": "Love this proposal - super exciting!  A partnership between two groups that really understand on-chain RWAs like Centrifuge and BlockTower seems like the right approach to protect the health of the MetaDAO. Out of interest, why has LatAm been targeted as a region to grow DAI footprint?  Plenty of other markets out there too - is there a structural advantage / reason why LatAm makes sense to begin with? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.307539682539682
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "25/01/2023-01:59:08",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}