{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/protocol-engineering-core-unit-workstreams/13795",
            "title": "Protocol Engineering Core Unit Workstreams ",
            "index": 13795,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "update",
                "pe-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "13",
                    "time": "09/03/2022-23:03:10",
                    "content": " Protocol Engineering Core Unit Workstreams  Executive Summary Protocol Engineering is formalizing its internal structure into three workstreams (Core Protocol, Cross Domain Scaling and the Safety Workstream). The team will also assign Mandated Actors to represent and support these workstreams. To support this growth, the core unit is proposing to increase its headcount by 3, from 14 to 17 people.  Introduction As the Maker protocol evolves from Foundation to DAO so too do the operational needs of its core units. One year into this journey, Protocol Engineering has identified a number of optimisations it can make to its internal structure. This forum post describes the optimisations we are considering and is intended to be referenced alongside our new budget request. This post therefore includes:  Protocol Engineering’s Current Operating Model Protocol Engineering’s Existing Mandate Formalizing Protocol Engineering’s Team Structure Setting the Team and the New Structure up for Success The Benefits of this Structure   1. Protocol Engineering’s Current Operating Model Before making any considerations for improvements, let’s first describe how the team operates today. The PE team in it’s current state is a very flat team, and aside from the Facilitator, has no formal hierarchy. Over the past year, team members have naturally gravitated towards their strengths and/or interests within the bounds of our team mandate, which has strengthened our areas of expertise. The work and backlog prioritization continues to be steered by the facilitator with input from community stakeholders. This structure works great for a tight knit team working on a specific focus area, however it starts to require clearer ownership as cross-dependent workstreams begin to form. With PE undertaking such a broad scope of work, the current budget renewal offers an opportunity to introduce structural changes to set us up for success, while also improving our levels of transparency to the community.  2. Protocol Engineering’s Existing Mandate Protocol Engineering’s team mandate can be effectively summarized in the following diagram from our original core unit proposal:  1232×586 110 KB  Here, the team grouped our work into three different categories; Execution & Implementation under Maintenance, Innovation under Growth, and Controls, Standards & Processes under Safety. Although the overall mandate hasn’t changed since the team’s formation, the definition of these vertical focus areas can be better categorized with the hindsight of the previous year’s work. Categorisation, whilst fairly trivial, does help us ensure we remain focused on the underlying work and goals - all of which help define an optimal structure for the team. The team mandate can now be better defined as falling within the following workstreams;  773×90 5.54 KB  The above can be thought of as a separation of depth, breadth and safety to help maintain efficiency and focus. Summarizing from our original mandate, this is represented through the following:  2.1 Core Protocol Workstream This workstream is concerned with depth and all interactions that touch the Maker Protocol on L1. The focus here is on:  Developing new smart contracts to extend protocol functionality on L1 Exploring future initiatives and integrations as brought up by the community Working with CES to evaluate, audit and onboard new collateral types Addressing on-chain operational needs through executive spell creation Documenting code changes and maintaining useful libraries to educate and grow the Maker protocol.   2.2 Cross Domain Scaling Workstream: This workstream is concerned with breadth and all initiatives that seek to scale MCD in a multichain world. The focus here is on:  Evolving Maker into the primary L1 on/off-ramp for rollups in the Ethereum ecosystem R&D across all fast, trustless and decentralized Layer2 solutions Identifying and auditing ecosystem liquidity flows between protocols Integrating with other L2 or sidechain teams and individuals to scale Maker Exploring the deployment of the Maker protocol on other L1s and/or sidechains   2.3 Safety Workstream: This workstream is concerned with safety and is the go-to for all protocol correctness and security related initiatives. The focus here is on:  Assisting with internal formal verification efforts and their use within developer work flows Building automation and decision assistance tooling & infrastructure Building and enhancing developer tools for community developers Contributing support to other teams via code reviews, mechanism design, FV and testing Advocating for technical security changes in the community  These workstreams help to formalize the original categorization of our mandate and focus our activities on the priorities within them.  3. Formalizing Protocol Engineering’s Team Structure Introducing the above structure is not necessarily a difficult task because it already informally exists today, but to do so successfully requires formally assigning ownership within the core unit. Protocol Engineering is therefore proposing to formalize a number of existing team members as mandated actors to assign clearer leadership to these workflows:  1432×774 141 KB  This new structure introduces minimal hierarchy yet succeeds in achieving clearer ownership, and accountability. The mandated actors will not be new hires - they are experienced existing team members. As part of this initiative their application (or renewal) will soon be presented  on the forum. The role of the mandated actors will be to represent the workstream with architectural vision, technical leadership, and strategic oversight working alongside the Facilitator for a united core unit vision. As per other mandated actors, this means that they will have greater exposure to the community, participation in mandated actor meetings and if not already, over time become the point person for their respective workstream and any Stakeholder Alignment meetings. The role of the core unit facilitator will mostly remain as it is today, managing the strategy, operations and cross-community communication requirements of the core unit while assisting the mandated actors in their duties and shielding the team from distractions. Additional work will come from having a larger team, which demands greater focus on overall coordination, cross-team management as well general team member support. Protocol Engineering has opted to continue with only one Facilitator to reduce overhead costs and keep team members fungible across the three workstreams as they are today.  4. Setting the Team and the New Structure up for Success To support this new structure we are proposing to grow the core unit by 3 individuals, including: Product Manager / Coordination Engineer for the Cross Domain Scaling Workstream This individual’s responsibility will be to organize interaction with other Layer2 providers and help prioritize backlog tasks. This will involve running the team’s weekly rituals and ensuring that we introduce agile methodologies and rigor into our processes to improve how we define our mission, vision and definition of done. This role will help our integration with other core units such as TechOps to ensure we implement adequate monitoring and alerting, and in doing so will help us implement a framework for how we scale to other L2s by ensuring we document standards for how L2 instances should behave. Smart Contract Engineer for the Cross Domain Scaling Workstream As the team branch out into other L2s, we require research and development into node infrastructure, analysis of new rollup environments as well as ensuring that we have adequate controls and measures in place for existing layer 2 implementations and integrations. Smart Contract Engineer for the Core Protocol Workstream This individual will predominantly be focused on the core protocol and working with the existing team to deliver new modules, extend existing functionality and day to day operations. In the event that this headcount is not filled, funds will be returned to the protocol on a quarterly basis in order to not build up a surplus.  5. Benefits of this structure This initiative offers a number of benefits to the team and the community, including but not limited to:  Clearer ownership and escalation paths by having a dedicated individual per workstream Improved accountability with a single representative Transparent budget awareness regarding where resources are being deployed across the workstreams Formalized structure means better oversight and resource allocation Minimal bureaucracy with minimal hierarchy, allowing us to remain focused on engineering work Persisting with the notion of fungible resources across workstreams to promote work rotation and skill sharing Introducing one dedicated planning and product support role to help maintain our core developer mandate Improved prioritization through knowledge of where resources are being allocated   Conclusion Formalizing our work into; Core Protocol, Cross Chain Scaling and Safety Workstreams will undoubtedly help better focus and communicate our work initiatives. It will also solidify team rituals such as planning and standup sessions around these initiatives, helping to keep us accountable to the community through improved reporting and awareness. We are looking forward to introducing this internal-team change and appointing Mandated Actors to represent these workstreams. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp7-adding-protocol-engineering-core-unit/6831",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/63",
                        "https://forum.makerdao.com/t/weekly-mips-update-82/14570",
                        "https://forum.makerdao.com/t/pecu-month-in-review-march-2022/14493",
                        "https://forum.makerdao.com/t/mip40c3-sp68-modify-protocol-engineering-core-unit-budget-pe-001/13797",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-2-9-2022/13804",
                        "https://forum.makerdao.com/t/mip40c3-sp-modify-protocol-engineering-core-unit-budget-pe-001/13797/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-84/14786",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/37",
                        "https://forum.makerdao.com/t/weekly-mips-update-83/14673"
                    ],
                    "GPT-summary": "The post describes the Protocol Engineering Core Unit's internal structure and proposes three workstreams to formalize their mandate. The team will assign Mandated Actors to represent and support these workstreams. The post also proposes to increase the headcount by 3 and introduces a new structure to set the team up for success. The post highlights the benefits of this structure, including clearer ownership, improved accountability, and better oversight. The post concludes by stating that formalizing the workstreams will help better focus and communicate the team's work initiatives.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.654495247021021
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/06/2022-23:03:36",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}