{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-set-both-usdc-psm-and-usdp-psm-tin-to-10-bps/11318",
            "title": "[Signal Request] Set both USDC-PSM and USDP-PSM \"tin\" to 10 bps ",
            "index": 11318,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "1",
                    "time": "31/10/2021-14:31:20",
                    "content": "Background  Screen Shot 2021-10-31 at 10.16.53 AM1074×514 67.1 KB  The USDC PSM has seen accelerating outflows as growth in demand for Maker vaults has begun to outstrip growth in demand for DAI. This is exactly what the PSM is designed for, but these arbitrage facilities work best when freely flowing in both directions. This poll is to gauge sentiment for reducing the “tin” (or toll for inflows) of the USDC PSM to 10 bps. It is currently set to 20 bps. Justification The USDC PSM tin was raised to 20 bps upon the introduction of the USDP PSM in an attempt to migrate some dollar-proxy reserves from the USDC PSM to the newly established USDP PSM. The USDP PSM is now nearly full, and accounts for close to half of all circulating USDP supply.  Screen Shot 2021-10-31 at 10.28.00 AM948×50 7.87 KB  Because of the lack of capacity in the USDP PSM, it is time to equalize the tin fee for all (at the moment two) PSMs. The goal for raising the tin to 20 bps has been met, and there is no reason to favor inflows to a PSM that is nearly at capacity. Additionally, since the introduction of a 20 bps tin for the USDC PSM, inflows to that PSM have generally halted. While credit risk from exposure to USDC is still as real as it has ever been, Maker does depend upon the PSMs to provide peg stability for DAI, and less friction is probably better – even while we wait upon more PSMs or opportunities to diversify our USDC reserves beyond simple PSM smart contracts. Exposure to USDC has dropped in both absolute and relative terms, which is good, but Maker still needs this arbitrage facility to be widely utilized and fairly frictionless to support a tighter real-time peg for DAI <> USD. Next Steps This poll will run for 7 days. Upon an affirmative vote (yes votes > no votes), an on-chain poll will be presented to the community.    Should both USDC-PSM and USDP-PSM tin be set to 10 bps?  Yes No Abstain     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-70-en-espanol/11569",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/signal-request-set-psm-fees-to-0/10894/26",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439"
                    ],
                    "GPT-summary": "The author of the post is proposing to reduce the \"tin\" fee of the USDC PSM to 10 bps from the current 20 bps. The post explains the background and justification for the proposal and provides a poll to gauge sentiment. The post also invites feedback and questions from the community and outlines the next steps if the proposal is approved.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 6.02550348202522
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "1",
                    "time": "31/10/2021-14:48:57",
                    "content": "Related: I believe we are going to see an on chain poll about setting tin/tout for all PSMs to 0 tomorrow - if that one passes onchain, isnt this poll superseeded? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "2",
                    "time": "31/10/2021-14:51:24",
                    "content": "    ultraschuppi:  if that one passes onchain, isnt this poll superseeded?   Good question! I’ll defer to @LongForWisdom and @prose11, but my assumption would be that it would be whatever passes last. For the record, I think setting all tin/tout to 0 is probably not the right move at the moment and will be voting against it. Edit: To remove any chaos should the first SR pass and then this one pass, I have edited the poll to specify that both PSM tin parameters be set to 10 bps, to avoid a situation where USDP has a 0 bps tin and USDC has a 10 bps tin. CC: @ultraschuppi ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.763392857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "1",
                    "time": "31/10/2021-15:31:38",
                    "content": "Does this mean that when the GUSD PSM or other PSMs are launched, the other PSMs will be upgraded to 20 bps? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "0",
                    "time": "31/10/2021-15:36:20",
                    "content": "I think that is reasonable (temporarily). But we do not yet have a GUSD or other PSM. That policy was highly successful in shifting USDC-PSM reserves to the USDP-PSM. I would assume we would do that again when new PSMs are created ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.201704545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "0",
                    "time": "31/10/2021-20:14:02",
                    "content": "It would be more efficient to have a system that automatically detects when a PSM is full, thus changing the commissions, to make it more attractive, I know that even so in maker it is based mostly on the interests of the system itself. But it would seem to me a bit more efficient. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#7",
                    "likes": "1",
                    "time": "01/11/2021-10:48:12",
                    "content": "I’m abstaining on this poll because I really don’t understand one thing: How much do we care about being 10 bps off peg over a sustained period? Several members (@rune @Nadia) have pointed out that even these small deviations are sufficiently large that it hurts them in lining up deals. These proponents would want 1 DAI = $1 and hence set the tin and tout to 0 for any PSM because by having a PSM, we implicitly trust that that stablecoin is pegged correctly all the time. I think without this, we’re going in circles by first having a fee, then setting it to zero and then going back to having a fee again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.438775510204081
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "1",
                    "time": "01/11/2021-11:05:13",
                    "content": "I addressed this a bit more in detail over at the other SR. There’s not really a right/wrong answer, just trade offs. I personally think there are good reasons to keep a tiny amount of friction (that’s equal between PSMs) because it’s less jarring to raise existing ones with a non-zero tin when we want to encourage a new PSM to be used. And especially before we have some way to take excess PSM reserves and put them to some off-chain use. But it’s not going to be bad for Maker to go with the “all approved stablecoins are fungible” policy. It just removes some modest tools from our monetary policy toolkit in exchange for deepening the liquidity of all other stables. We will need to keep an eye on stable-stable LPs, though, if we find they are unprofitable for users under that policy. They make up a growing (and fee generating) source of collateral, and also help diversify our blacklist/regulatory risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.084498834498834
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#9",
                    "likes": "0",
                    "time": "01/11/2021-14:01:56",
                    "content": "    PaperImperium:  Good question! I’ll defer to @LongForWisdom and @prose11, but my assumption would be that it would be whatever passes last.   Seems like the thread already arrived at the correct interpretation, but just to confirm you are correct Paper. Any onchain changes will update the state of the protocol, so if the current poll passes and is approved in an executive, this Signal process would be seeking to change it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "08/11/2021-14:07:34",
                    "content": "This signal was not successful at the off-chain polling stage. Thanks for all who voted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "09/12/2021-00:07:49",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}