{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip97-the-dao-level-objective-framework/19390",
            "title": "MIP97: The DAO-level Objective Framework ",
            "index": 19390,
            "category": [
                "Maker Improvement Proposals",
                "RFC"
            ],
            "tags": [
                "rfc",
                "mips",
                "impact-:-high",
                "dlo",
                "work-based-budgeting-mip-set"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "7",
                    "time": "11/01/2023-23:59:41",
                    "content": " MIP97: The DAO-Level Objective Framework  Preamble MIP#: 97 Title: The DAO-Level Objective Framework Author(s): @retro, @juan Contributors:  Tags: process Type: General Status: RFC Date Proposed: 2022-01-11 Date Ratified:  Forum URL: https://forum.makerdao.com/t/mip97-the-dao-level-objective-framework/19390 Ratification Poll URL:    Sentence Summary The DAO-Level Objective Framework enables a process for Governance to define contribution opportunities to Maker through projects with specific deliverables.  Paragraph Summary The DAO-Level Objective Framework is a tool for Maker Governance to increase the alignment and coordination of a decentralized workforce to desired projects. This is accomplished by the utilization of a DLO — a Request for Proposal document — that defines the opportunity or project, the available budget for the delivery of the objective, desired milestones, and the required timeline for delivery.  Component Summary MIP97c1: The DAO-Level Objective Framework Provides an overview of the overall framework. MIP97c2: Adding a DAO-Level Objective Proposal (DLO) Describes the proposal template and requirements to submit an eligible DLO. MIP97c3: Standard DAO-Level Objective Proposal (DLO) parameters Provides defined best practices increasing the usability of DLOs by Governance and the opportunities for continuous improvement. MIP97c4: Governance Cycle Defines how the DLO framework integrates with Maker’s Governance Cycles. MIP97c5: DLO Tracking Defines how Governance must track and archive DLO data.  Motivation The DAO-Level Objective (DLO) Framework furnishes governance with a set of processes and procedures to efficiently pair MakerDAO’s work/project requests with a willing, undertaking workforce. We consider the introduction of this framework timely at this conjuncture where Maker requires its workforce to reorganize into Endgame-ready entities. We believe it is a much-needed Governance catalyst to enable the ground-breaking work demanded by the Endgame. This MIP does not impact any currently approved budgets at MakerDAO. The utilization of this framework for current or future budgets is optional. This framework is being introduced as a further tool for the DAO to use as deemed fit.  Specification / Proposal Details  MIP97c1: The DAO-Level Objective Framework The DAO-Level Objective (DLO) Framework furnishes governance with powerful coordination tools to (1) consistently define and broadcast what works/projects the DAO needs done and (2) pair these with agreeing, undertaking workforce (internal or external to MakerDAO) through MIP98: The Work Proposal Framework. DLOs (see MIP97c2) can be drafted and submitted for Maker Governance consideration by any individual. DLOs are subject to Maker Governance approval; they enter the weekly governance cycle and follow specific governance cycle parameters (see MIP97c4). Note that the introduction of this framework does not proscribe other ratified funding mechanisms (e.g., MIP40, MIP55). Although we anticipate objections and wariness that the introduction of a further framework will increase Governance overhead, we believe that proper utilization (distilled in best practices in MIP97c3) of the framework will outweigh any possible drawbacks by streamlining funding requests and creating enriching engagement with the workforce. Best Practices may not apply to all cases all the time — deviating from them can indeed be the smart thing to do sometimes. The DLO Framework recognizes this and is therefore flexible, allowing for bespoke DLO configurations. Finally, component MIP97c5 is used for both tracking and retrospective archival purposes.  MIP97c2: The DAO-Level Objective Proposal (DLO) A DLO is a defined opportunity or project that serves as a request from MakerDAO to workforces (either internal or external to MakerDAO) to deliver well-defined work. The objective and deliverables are defined using a top-down approach. DLOs allow Governance to provide clear expectations of available funding, desired reporting details, timelines, and other specific DLO parameters detailed below. DLOs must follow the DLO template, which includes the following sections: 1. Sentence Description of the Objective: A one-sentence, short description of the Objective. 2. Paragraph Description of the Objective: A long-form description of the Objective. This section should describe (1) the origins of the objective, (2) the future state of the DAO once this objective is achieved, and (3) any known challenges the DAO has faced previously related to this objective, if available. 3. List of Deliverables: A well-defined and obtainable list of deliverables. Deliverables are quantifiable byproducts of work. Deliverables may or may not be subject to Maker Governance approval upon delivery. Deliverable parameters are defined in the next (4th) point. 4. Desired Timeline and Milestones for Delivery   Timeline: An Objective may require a specific timeline for delivery. This section defines the desired timeline for a DLO’s Deliverables. This is defined as a number of months and is set for the overall DLO.  Milestones: Milestones dictate operational parameters for Deliverables. Milestones must be defined for all Deliverables listed in the previous (4th) point. Milestones can be used to build budget distributions and reporting requirements, to define the order for completing Deliverables, etc.  5. DLO Parameters: These are specific parameters that DLO authors can utilize to tailor the DLO to diverse circumstances and opportunities.   Maximum Number of Workforce Teams: A DLO is designed to enable one or more teams to deliver work. The number of workforce teams can be set to unlimited, with the Budget Cap utilization by approved Work Proposals being the practical limit in that case.  Workforce Team Requirements or Restrictions - This parameter defines any desired requirements or restrictions for a Workforce Team to be considered eligible for the DLO. Any requirements should be easily verifiable, ideally using a methodology that protects the workforce’s anonymity.  DLO Expiry - Once a DLO is approved by Governance, the DLO becomes active and workforce teams can request assignment of the work through a Work Proposal (MIP98). It is expected that larger, more complex projects may require some period of time for a Work Proposal to be submitted and accepted. It is also expected that some DLOs may require immediate action. To manage the overhead of the lifecycle of DLOs, they are required to have a defined Expiry, also defined in months. The expiry of a DLO does not impact accepted Work Proposals, it simply prevents new Work Proposal submissions and/or assignments of DLOs to workforce teams.  6. Budget Cap - A DLO must define the overall budget that Maker Governance commits to accomplishing the DLO. Both Dai and MKR are in-scope as appropriate types of capital for funding. A template for DLOs is provided here: MIP97c2-SPxx DAO-level Objective Template - HackMD  MIP97c3: Standard DAO-Level Objective Proposal (DLO) Parameters !!! WIP !!!  MIP97c4: Governance Cycle DLO subproposals may enter the Weekly Governance Cycle, provided the Feedback and Frozen Periods have been fulfilled.  Minimum Feedback Period: 2 Weeks  Minimum Frozen Period: 1 Week  On-chain vote: 1 Week    MIP97c5: DLO Tracking This component is used for tracking the status of Approved DLOs through their defined life cycle. A MIP editor must update this MIP following a successful on-chain vote.  The DLO # is an index number that increments by 1 for every approved DLO. This is done to increase the ability for discussion on the proposal by assigning an easier-to-communicate index to it instead of the standard subproposal nomenclature.  Open status defines a DLO as approved and (1) unallocated budget from the defined CAP or (2) approved Work Proposals assigned to the DLO are below the maximum number approved.  Closed status defines a DLO that has reached expiry and cannot be assigned to any new teams. Approved Work Proposals that assigned the DLO to a Workforce Team must also be listed with a hyperlink to the approved Work Proposals.  A sample entry is provided below: DLO # - Short Description Status: Open/Closed Expiry Date: YYYY-MM-DD Approved Work Proposals: MIP98c2-SPxx   DLO Tracking Entries: ",
                    "links": [
                        "https://hackmd.io/@0xRetro/S165wKfPj",
                        "https://forum.makerdao.com/t/mip97-the-work-proposal-framework/19391",
                        "https://hackmd.io/gdrU2YpnSFetobcud6c83g",
                        "https://forum.makerdao.com/t/mip98-the-work-proposal-framework/19391",
                        "https://forum.makerdao.com/t/weekly-mips-update-121/19437",
                        "https://forum.makerdao.com/t/governance-and-risk-call-223-thursday-january-26-2023-17-00-utc/19532",
                        "https://forum.makerdao.com/t/weekly-mips-update-123/19600",
                        "https://forum.makerdao.com/t/weekly-mips-update-122/19536",
                        "https://forum.makerdao.com/t/governance-and-risk-call-222-thursday-january-19-2023-17-00-utc/19412",
                        "https://forum.makerdao.com/t/mip98-the-work-proposal-framework/19391/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-124/19706",
                        "https://forum.makerdao.com/t/weekly-mips-update-125/19812",
                        "https://forum.makerdao.com/t/weekly-mips-update-126/19881",
                        "https://forum.makerdao.com/t/weekly-mips-update-128/20070",
                        "https://forum.makerdao.com/t/weekly-mips-update-127/20001",
                        "https://forum.makerdao.com/t/know-your-mip-18-mip97-mip-98-dao-level-objectives-and-work-proposals/19603"
                    ],
                    "GPT-summary": "The post presents MIP97, which is a proposal for a DAO-Level Objective Framework that aims to increase the alignment and coordination of a decentralized workforce to desired projects. The proposal includes a Request for Proposal document that defines the opportunity or project, the available budget for the delivery of the objective, desired milestones, and the required timeline for delivery. The post also provides an overview of the proposal's components and parameters. The post does not advertise the proposal, but rather explains it and invites feedback and questions.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.480272444946358
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/01/2023-16:55:38",
                    "content": "    Retro:   Desired Timeline and Milestones for Delivery    Basic question here (hopefully it makes sense) and commentary. With regards to the expectations and hashing out the objectives from an DLO proposal, are there expectations for the author of the DLO Work Proposal to provide long-term costing estimates for individual projects? Or is that covered/specified somewhere else (might have missed it). We can imagine the Work Proposal teams having to spend a great deal of energy on planning expectations of work with other peers/teams to be able to fulfill commitments it proposes on the DLO requests/project-proposals. We can also imagine that most Endgame projects will be unique. As you know, actual implementation is filled with new discoveries and assumptions made up front,  that perhaps later-on can and will be found to be incorrect. With regards to Timelines/Deliverables — we can imagine an engineering project will take longer and large amount of advance planning, bundling of various work, and perhaps re-prioritization from this fast-paced changing ecosystem, versus perhaps an RWA collateral onboarding(should have a shorter timeline). Most will quantify “success” as being on time. Anyhow—will keep digesting this along with the other MIPs.  thank you—nice work! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.122999768089054
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#3",
                    "likes": "3",
                    "time": "15/01/2023-18:58:50",
                    "content": "    flipflopflapdelegate:  Most will quantify “success” as being on time.   I’ve had this thought as well and I have some concern’s with measuring, even while performing work on repeatable tasks, such as onboarding a Centrifuge vault, or a new iteration of a RWAJar-like onboarding or a vanilla ERC20-like crypto native collateral. When working with RWAs, real world business partners have internal business goals, commitments to partners, deadlines which impact directly teams working on deals. Suddenly, engineering work is not about protocol security and resilience, but about business growth and time-to-market. Onboarding collateral implies understanding the deal, designing money flows in smart contracts,  coding a spell, deploying contracts (first-party, or done by third-parties), integrating with other protocols, etc.  All these are potential sources for bugs or attack vectors for the protocol, mainly spells which have “root” access to the protocol (with some safe guards ofc). Traditional software development can take shortcuts to comply with business requirements, time-to-market, and other constraints. Companies tend to complicate themselves  as they age with new use cases, edge cases, and all this is coped by hiring new teams managing these cases until they can’t and revamping a legacy system or business unit is the only way. Blockchain engineering cannot easily do that. Even on the cases that it can, it will generate technical debt that is way more complicated to reduce in an on-chain protocol compared to a normal web2 software platform. DLO authors need to thoroughly think about measurements and goals. Is time-to-market critical?, then what’s the debt (technical, organizational or otherwise) that the author is willing to put the protocol through?. This is very difficult to quantify, but the delegates and DAO members need to push DLO authors to be conscious of this. I would even argue that DLO’s should have a “categorization” or “analysis” of DAO impact: organization costs, technical debt, etc which help teams assess the “work proposals” in terms of budget requested and solution proposed. If the protocol can avoid onboarding 10 vaults in 3 months and taking 1 year to onboard only 2 with the same business outcome or a similar one for the same asset type with the same partners; then, let’s take 1 year to do it if such eagerness to onboard will generate organizational debt that we are not prepared to cope with or even worse, technical debt that we cannot reduce and that nobody is paying for. The hypothetical example I provide will bring 2 completely different work proposals from EAs. EAs will not be necessarily long term aligned with Maker, only to maintain a healthy long-term client relationship. Facilitator/Delegates/Tribunals need to be long term aligned with Maker and create a culture of good, long-term aligned DLOs which will ask for proposals with the right goals and measurements. Short sighted DLOs will bring bad work proposals that will increase tech and organizational debt. Is there something we can add to DLOs to avoid this, or surface/bring awareness of these impacts at DLO proposal phase? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.267676767676768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "15/01/2023-22:48:58",
                    "content": "    M_C:  Facilitator/Delegates/Tribunals need to be long term aligned with Maker and create a culture of good, long-term aligned DLOs which will ask for proposals with the right goals and measurements. Short sighted DLOs will bring bad work proposals that will increase tech and organizational debt.   Super interesting thoughts—much appreciated @M_C Totally agree with your assessment of the differences between an RWA DLO and a software related DLO—and I think we can all agree that committing to scope, costs, and timelines before project execution is going to be difficult for the Work Proposal authors. Like, creating a DLO/Work Proposal for MakerDAO will be a lot different than building houses because builders have been doing it for decades —  the home-building methods haven’t changed much(boomer tech), and the approach probably won’t change much in the near-future—so the cost and schedule estimates might be a easier identifiable on a Work Proposal. But in the blockchain & software world, where technology changes rapidly, platforms and networks get more integrated and complex, evolve over time, we have to agree that costs and timelines will be anything but guesses. So I guess my question is—what are some of the traits that delegates/facilitators/tribunals can look for in order identify a short-term DLO versus a long-term DLO? I guess it will come down to the scope frameworks among other factors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.274581128747795
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/01/2023-08:21:21",
                    "content": "    flipflopflapdelegate:  So I guess my question is—what are some of the traits that delegates/facilitators/tribunals can look for in order identify a short-term DLO versus a long-term DLO? I guess it will come down to the scope frameworks among other factors.   I would imagine, in RWAs, a deal with very custom covenants and on-chain structure never done before having a DLO with a short-term delivery deadline is a red flag and a lack of aligned incentives between parties. Scope framework could include guidelines on all these for sure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.419444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#6",
                    "likes": "1",
                    "time": "18/01/2023-13:26:17",
                    "content": "This is a summary of the contents of this subproposal and its impact, from GovAlpha’s perspective:  This is a valid general MIP in accordance to the General MIP template. It proposes a mechanism for Governance to define contribution opportunities to Maker through projects with specific deliverables. Any individual may submit a DAO-level Objective Proposal (DLO) and Maker Governance can vote to approve or reject it. The Governance Cycle for a DLO is defined in MIP97c4. DLOs may be funded in different ways such as MIP40 or MIP55 but the primary method to fund them is intended to be using MIP98: The Work Proposal Framework. Standardized configurations and best practices for DLOs are available for multiple instances of similar work. Bespoke configurations may also be used with specific intentions for the objective or piloted on a case-by-case basis with the intention to amend this MIP. A DLO must include an objective, deliverables, timeline and milestones, workforce details, an expiry date, and a budget cap. DLO proposals are tracked and archived by Maker Governance as described in MIP97c5. This MIP does not impact any currently approved budgets at MakerDAO and utilization for current or future budgets is optional. This proposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40",
                        "https://mips.makerdao.com/mips/details/MIP55",
                        "https://forum.makerdao.com/t/mip98-the-work-proposal-framework/19391",
                        "https://forum.makerdao.com/t/mip97-the-dao-level-objective-framework/19390#mip97c5-dlo-tracking-11",
                        "https://manual.makerdao.com/governance/off-chain/impact-estimations"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#7",
                    "likes": "3",
                    "time": "18/01/2023-18:32:29",
                    "content": "Nice discussion @M_C @flipflopflapdelegate. I’m here to add a plug for legal and compliance as integral to technology and development choices, and not just with respect to RWA or off-chain entities. You do cover it with reference to “understanding the deal” and “designing money flows,” but I wanted to call out that the legal part is key to informing some design choices.     M_C:  Onboarding collateral implies understanding the deal, designing money flows in smart contracts, coding a spell, deploying contracts (first-party, or done by third-parties), integrating with other protocols, etc.   How systems and products function at a technical level can make the difference in legal interpretations (evolving and TBD) on tax and regulatory issues. Design choices may support or hamper arguments we’d want to work in favor of MakerDAO regarding compliance exclusions and exemptions that may be available due to decentralization or other features (as defined by various regimes). Another dynamic to consider is how can Core governance most effectively evaluate various DLO proposals in the aggregate. Where is there an overlap in responsibilities proposed by different actors? Where might such overlap be helpful in terms of creating healthy redundancy, and where might it be problematic by adding waste, confusion and dissonance? And further to this point:     flipflopflapdelegate:  But in the blockchain & software world, where technology changes rapidly, platforms and networks get more integrated and complex, evolve over time, we have to agree that costs and timelines will be anything but guesses. So I guess my question is—what are some of the traits that delegates/facilitators/tribunals can look for in order identify a short-term DLO versus a long-term DLO?   Internal expertise has to match or approach the competencies being brought to the DAO via DLO Work proposals. That seems like a difficult problem today where on one hand Endgame seeks to outsource expertise, but expertise externally cannot be well evaluated, managed or monitored without the comparable expertise existing among the Facilitator/Delegates/Tribunals with long term Maker alignment. A meaningful global talent/HR recruitment effort is needed for the internal protector roles. The market and incentives should take care of attracting the ecosystem actors, but we should also provision resources for intentional human capital development and retention for the core contributors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.482142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#8",
                    "likes": "1",
                    "time": "20/01/2023-15:54:26",
                    "content": "Very timely proposal and great thinking. Thanks. I want to highlight one important aspect from the discussion of @M_C and @flipflopflapdelegate:     M_C:  DLO authors need to thoroughly think about measurements and goals. Is time-to-market critical?, then what’s the debt (technical, organizational or otherwise) that the author is willing to put the protocol through?.   Thinking about budgets not just in terms of money asked but in terms of externalities produced is something Maker should think about. It’s probably too much to demand a detailed analysis from DLO authors at the moment, but in the ideal future, this would be good to have. Overall, I think it will be up to governance to set expectations of how big these DLOs can become, or we risk having huge and hard-to-track asks here. Maybe one criterion is to make the asks as atomic as possible. What’s the simplest and most tightly scoped ask here? And then bundle these up into logical groups. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#9",
                    "likes": "1",
                    "time": "20/01/2023-22:57:26",
                    "content": " I would capitalize the L in level since the acronym DLO refers to level.     Retro:  Work Proposal Framework (MIP97)   typo, MIP98*     Retro:  Once a DLO is approved, a MIP editor must update MIP97c5 for both tracking and retrospective archival purposes.   I would remove retrospective because it’s redundant.     Retro:  (deliverable parameters are defined in section 4 of this subcomponent)   typo? i see it in section 3 as a WIP or is it the #3 list item under the c2 (where the DLO proposal structure is laid out)     Retro:  Deliverables may or may not be subject to Maker Governance approval upon delivery (deliverable parameters are defined in section 4 of this subcomponent).   upon delivery? Like after a DLO is approved? This bit is confusing It sounds like if my DLO is approved and I complete a deliverable, I need to get some sort of second approval before moving forward with it.     Retro:  This is however a valuable step to create a feedback loop of Governance providing their perspective on the work delivered.   would cut “however”     Retro:  Milestones - Milestones are a powerful alignment tool within this framework that dictate operational parameters for Deliverables. This can be leveraged to build Budget Distributions and Reporting Requirements. Milestones must be defined for all Deliverables listed in Section 4 of this subcomponent. Appropriate uses of Milestones are defining the order for completing deliverables if desired and requiring specific reporting cadences, based on work completion or time.   This paragraph is super confusing. I can barely understand what the relationship of a milestone is to the deliverables. Here’s a rewrite (feel free to use or not) Milestones - Milestones are an alignment tool for deliverables.  Milestones define the order for completing deliverables, specify reporting requirements, and can be used to structure Budget Distributions. Deliverables must be structed into a milestone or set of milestones that should be listed in Section 4 of the DLO proposal.     Retro:  DLO Expiry - Once a DLO is approved by Governance, the DLO is active and workforce teams can request assignment of the work through a Work Proposal (MIP97).   Typo, MIP98* Re: DLO Expiry It uses time exclusively as a measure. What do you think about using # of accepted proposals and/or adding a condition that a DLO can be canceled or “expired” by vote?     Retro:  Frozen Period: 2 weeks following Formal Submission   frozen periods are pre-formal submissions (traditionally) after a proposal is formally submitted, it should already be frozen. I recommend removing the frozen period requirement, as it’s stupid. Formal submissions should mean that the submitted proposal is FINAL. With a shorter RFC, let the proposal have as much editing as possible and let the formally submitted version be treated for exactly what it is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.81155303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#10",
                    "likes": "4",
                    "time": "27/01/2023-17:06:06",
                    "content": "@Retro Thank you for a great presentation at yesterday’s Governance & Risk call. I see the DLO as very different from a MIP or proposal primarily designed to serve the business objectives of the proposer. It is also not overly tactical and proscribed as to the HOW and the WHAT like we’d expect of a RFP/Request for proposal. A DAO-level Objective is meant to serve MakerDAO completely and purely. Solicitation of the WHO and HOW happens via MIP98: The Work Proposal Framework Accordingly, a DLO must be to a large extent conceived and constructed WITH the community and not delivered as a baked and finished vision. This thread on proposed MIP100 provides some good discussion that I think illustrates the distinctions:MIP100: Stable Asset Allocation Framework    MIP100: Stable Asset Allocation Framework   Sounds like a first DLO to me.   TRANSPARENCY & CREDIBILITY I’d like to see a requirement that every proposed DLO conduct an open and public process of soliciting comments and substantive input from the widest group possible, both regular MakerDAO participants and non-affiliated persons who may have specific expertise and insight.   The latter would operate as a kind of proof-of-references. A proposer should have at least one unaffiliated market participant that is willing to engage with and vouch for the credibility of the proposer and/or idea on the record AND be willing to interact with the MakerDAO community on our public channels.   Every proposed DLO should have the equivalent of a Know-Your-MIP AND a Discussion segment scheduled for a G&R call. I might go further to suggest that an unwillingness to present and introduce oneself and team on a live public and recorded call, and respond real-time to community questions is disqualifying - no exceptions. (MIP98 - Work Proposals would not have this requirement and could be fulfilled by anon teams depending on what’s appropriate for the specific work and applicable DLO).   SPEED BUMPS To address a concern raised on the G&R call yesterday that we do not want a continuation of the situation that became untenable in the lead-up to the Endgame vote. Delegates and MKR holders struggled under an over proliferation of proposals, many working at cross purposes and overwhelming our capacity for focused, informed and deliberate governance. The DLO process should include a bit of friction in terms of accessing a MKR vote opportunity. Post-Endgame Vote we have been missing something valuable due to the elimination of open community signals. It turns out that these were helpful speedbumps to bring awareness to a potential vote and surface discussion. Discussion is crucial. It is important that some aspects of pro & con discussion take place in written form on the Forum where the widest audience expects to find information about DAO operations. Someone who does not spend every day (or even every week) in the conversation needs to be able to find some presentation of various views that can assist them in understanding (a) what a vote is about and (b) its implications. Usually this perspective is very hard to obtain in a reasonable amount of time if one is NOT here daily, but it is what it is. We should also consider whether a minimum threshold of published public discussion and comments be required for a DLO to proceed in the governance process. This is difficult to administer and I have argued in the past on behalf of Recognized Delegate @ACREinvest that the volume of written discussion comments does not per se reflect the amount of consideration and reflection that actually occurs. Perhaps fine-tuning the right process, duration and scheduled opportunities for feedback is the best we can do on this point. INTERNAL SPONSORSHIP I suggest we require some form of internal “sponsorship” for a DLO before MKR holders and Delegates are asked to consider a DLO for a vote. This sponsorship should be a requirement to enter the Frozen Period. Perhaps either of (1) any 4 Recognized Delegates or (2) one or more Recognized Delegates holding 2% of the Hat. This will serve as a check that enough MKR representation is aware of the proposal and already supports it. I have raised this idea in the past in a conversation last June: Off-Chain Proposal Bounties    Off-Chain Proposal Bounties   The status quo is a governance attack vector, frankly. Overwhelming the forum with proposals or extremely lengthy comments can be an effective tactic for weakening the focus and capability of CUs to produce results. It can also be useful for obscuring important information, or lack thereof, that might be critical to inform voting. Delegates thereby may be less able to follow or hone in on such details within a reasonable investment of time as a result of the deluge. I’m in favor of some level or method of sponsorship being required for certain items to come before delegates and MKR holders for consideration. Openness and permissionlessness are values I hold dearly and staunchly to heart, but these do not mean formlessness with a zero filtering process can work at scale.   Lastly, I wanted to resurface this conversation started by @Juanbug and the perspectives shared on factors we should consider addressing in this MIP97: Increasing MIP Efficiency Community Poll Some comments to highlight: Continuing the discussion from Increasing MIP Efficiency Community Poll:    Increasing MIP Efficiency Community Poll   Sometimes the glacial pace of governance is a feature not a flaw. When decisions have high impact and high risk, it is better to have them move more slowly where possible. Part of disinformation or governance exploits is to get high impact decisions to move quickly (reducing the chance they are caught or getting foot in door) or by slowing decisions that need to be done quickly (e.g. rate adjustments via SR).      Increasing MIP Efficiency Community Poll   I would also like to chime in on the why having the longer polls is an advantage. The big one for me is research time. To be able to meaningfully contribute in a discussion and to make an informed decision you need to independently research a fair bit. This is especially true for budget and greenlight proposals. Also not all questions are created equal. The first discussion might very well be to get the gist of the major issues before researching and then coming back for a discussion on the finer points once we are closer to the voting date.   ",
                    "links": [
                        "https://forum.makerdao.com/t/mip98-the-work-proposal-framework/19391",
                        "https://forum.makerdao.com/t/mip100-stable-asset-allocation-framework/19556",
                        "https://forum.makerdao.com/t/mip100-stable-asset-allocation-framework/19556/31",
                        "https://forum.makerdao.com/t/increasing-mip-efficiency-community-poll/15773/6",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties/15363",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties/15363/12",
                        "https://forum.makerdao.com/t/increasing-mip-efficiency-community-poll/15773",
                        "https://forum.makerdao.com/t/increasing-mip-efficiency-community-poll/15773/9",
                        "https://forum.makerdao.com/t/increasing-mip-efficiency-community-poll/15773/9",
                        "https://forum.makerdao.com/t/increasing-mip-efficiency-community-poll/15773/16"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.783593011394736
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#11",
                    "likes": "4",
                    "time": "02/02/2023-00:16:35",
                    "content": " Delaying Work-based Budgeting MIPs until the March Cycle We have received a ton of feedback on these proposals (Thank you!) and over time discussions have evolved from simply explaining the overall frameworks into conversations exploring concrete ways for introducing improvements. Additionally, the Pregame Constitution has also been published and it is intended to enter the March Cycle. With the overall intention of introducing these MIPs focused on Endgame implementation, we feel it is best to delay the rattification vote on MIPs 96, 97 & 98 to allow for further iterations. With an extra 4 weeks of RFC, the Ecosystem Cluster would also like to promote a period of subproposal development to aid making improvements to the overall frameworks, and help teams prepare to use this new funding mechanism.  Developing Subproposal in Tandem with the Framework With teams already reaching out for help on how to position their budgets under these new frameworks, we’d like to facilitate the process of drafting DLOs & WPs that will enter the March Cycle along side the frameworks themselves. @GovAlpha-Core-Unit  has confirmed this is an acceptable introduction of the frameworks, and uses the precedence set by the introduction of the Core Unit MIP set, which saw Core Unit Subproposals voted on along side their top-level MIPs. Our expectations are:  By drafting DLOs/WPs and still having their top-level MIPs in RFC, we’re able to achieve the best framework architecture possible in the shortest amount of time, allowing for iterations in a sandbox environment vs. the slower amendment process. DLOs and WPs will have utility from day one, and give governance a better idea on how these frameworks enable a more mature DAO & workforce. The workforce receives the needed direction and clarity to move forward with their desired actions and alignment with Endgame, with a tangible implementation plan. The Pregame Constitution feedback period will also help guide and shape the introductory version of these MIPs for better alignment.   Supporting Subproposal Development Delegates, Core Units, Clusters, and others are encouraged to reach out directly for support drafting Subproposals. As we move into next week, we’ll formalize an office hours type call to further support the development of both the frameworks and subproposals. If anyone wants to cut in line, my availability is here: Calendly - Retro MakerDAO  Timelines To help navigate our evolving governance landscape, a summary of important dates are provided below for both top level MIPs and subproposals in order to coordinate this launch. Team should consider this when reviewing available funding options and needed timelines for their operations and projects. Top-level MIPs Frozen Period Deadline: March 1 Top-level MIPs Formal Submission Deadline: March 8 Top-level MIPs Voting Period: March 13 - 27 Top-level MIPs Rattification: March 27 DLO/WP RFC Publication Deadline: Feb 27 DLO/WP Frozen Period Deadline: March 13 DLO/WP Weekly Voting Period: March 20 - 23 WP Funding via executive: Spell following March 27 Vote ",
                    "links": [
                        "https://forum.makerdao.com/t/mip96-the-ecosystem-auditor-framework/19389",
                        "https://forum.makerdao.com/t/mip98-the-work-proposal-framework/19391",
                        "https://calendly.com/makerdao-ses-retro/meeting",
                        "https://forum.makerdao.com/t/mip96-the-ecosystem-auditor-framework/19389/4",
                        "https://forum.makerdao.com/t/mip98-the-work-proposal-framework/19391/6"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.254208754208754
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#12",
                    "likes": "1",
                    "time": "02/02/2023-02:06:24",
                    "content": "    Retro:  Top-level MIPs Voting Period: March 13 - 27 Top-level MIPs Rattification: March 27       Retro:  DLO/WP Frozen Period Deadline: March 13 DLO/WP Weekly Voting Period: March 20 - 23   What governance process should be cited to bring a subproposal of an unapproved MIP to a vote that closes prior to the actual MIP’s approval? This doesn’t seem like best practice. @GovAlpha-Core-Unit     Retro:  A DLO is a defined opportunity or project that serves as a request from MakerDAO to workforces (either internal or external to MakerDAO) to deliver well-defined work   We strongly recommend restricting this funding process only to groups that have already been approved and recognized by governance. External entities should ideally be answering a RFP directly or Declaration of Intent. To the extent an external entity or group desires funding that is not in response to some kind of request for services by governance, they already have SPFs available to them. If the authors are absolutely sure that external groups that have no prior approval from governance should be included, they should have a much longer RFC period that is not less than that already required by SPFs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.171296296296296
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#13",
                    "likes": "2",
                    "time": "02/02/2023-09:13:27",
                    "content": "    Retro:   By drafting DLOs/WPs and still having their top-level MIPs in RFC, we’re able to achieve the best framework architecture possible in the shortest amount of time, allowing for iterations in a sandbox environment vs. the slower amendment process.    This should really be considered as the standard way of working, even a requirement. No new MIP that defines subproposals should be approved with at least one real example of how it will be used. With the next iteration of the MIPs process, it may be good to consider a more general rule where a framework MIP is more easily modifiable until it has seen at least 3 or more subproposals. Thanks for going down this path. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.099887766554433
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#14",
                    "likes": "1",
                    "time": "02/02/2023-10:20:39",
                    "content": "    GFXlabs:  What governance process should be cited to bring a subproposal of an unapproved MIP to a vote that closes prior to the actual MIP’s approval? This doesn’t seem like best practice.   I’m not entirely convinced that this is the best approach. It’s an awkward interaction between the weekly and monthly cycles. If DLOs were going in the Monthly Cycle, then we would allow the first ones to be voted on at the same time as the top-level MIP, as we’ve done before. I think I’d prefer it if the first subproposals went live on the day the MIP vote ended i.e. they would be voted on March 27-March 30 @Retro, as it does get messy if the DLOs have been “approved” and the top-level MIP fails 4 days later. This leads to a cleaner resolution but 3 days later. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4772727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#15",
                    "likes": "1",
                    "time": "02/02/2023-12:17:42",
                    "content": "    wouter:      Retro:   By drafting DLOs/WPs and still having their top-level MIPs in RFC, we’re able to achieve the best framework architecture possible in the shortest amount of time, allowing for iterations in a sandbox environment vs. the slower amendment process.    This should really be considered as the standard way of working, even a requirement.   Very strong disagree, and is likely to result in MIPs being opposed on procedural grounds. It was only two years ago that the Core Unit framework went into effect. The result was a mad dash for funding while enthusiasm for the concept of Core Units was still high. This led to quick funding for many quality groups for important tasks, but it also led to a tradition of funding that resulted in low-quality groups performing tasks that are unneeded. Maker should not repeat the same mistake here. Allowing subproposals to complete an entire voting cycle and eat up governance bandwidth before the authorizing MIP is even voted upon is setting Maker up for more cash grabs by groups that will naturally try to “get while the getting is good.” This MIP has a lot of merit, but it cannot be a method groups to try to rush funding through governance with minimal oversight and exploiting enthusiasm to move forward with End Game initiatives – particularly when existing funding mechanisms are already sufficient such as MIP55, MIP40, or standalone MIPs. In an ideal world, any required task would be debated first and only then would a competitive process be used to award funds. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.909666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#16",
                    "likes": "1",
                    "time": "02/02/2023-15:52:23",
                    "content": "Then please suggest an alternative to iterate on operational procedures to get them right. Because it is critical that we can do that. Without this ability, MakerDAO will never become an effective organization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#17",
                    "likes": "0",
                    "time": "02/02/2023-16:38:01",
                    "content": "I tend to agree with the thrust of arguments above by @GFXlabs. Preparing specific DLOs for polling prior to the DLO framework being approved seems out of order and especially problematic if the approval for both is expected to occur in tandem. This way of doing things puts pressure on the generic framework to be approved to the extent that work proposed in a specific DLO instance needs to get done, or is otherwise favored by the community. We have many active methods for work to proceed under the status quo. The DLO framework should be evaluated and polished on its own merits as a governance mechanism. It is capable of being amended as needed once adopted and used by the community. It makes sense to extend RFC for the DLO Framework MIPs so they can better align with the clarity that may emerge during the pregame Constitution MIP discussion. But the DLO Framework should not at all be used until it is in fact first finalized and approved. This does not preclude people from working on examples of DLO proposals. But those proposals should not be eligible to be voted on until after the framework itself is approved and activated by governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.934523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#18",
                    "likes": "2",
                    "time": "20/02/2023-09:04:18",
                    "content": "A couple of remarks from writing a DLO: 1.) DLOs are top-level objectives. Sometimes these objectives are too large to be bid upon in their entirety. The DLO framework should allow breaking down an objective into verticals, or work buckets that MIP98 proposers can then bid on. 2.) The MIP cycle is very slow. If proposers have to propose and get MIP98s to pass, it could mean months before any actual work is done. We propose a faster solution where a generic MIP98 per work bucket is proposed with the DLO, and applicants can bid on that after ratification. The MIP98s should be linked in the DLO. 3.) If multiple parties have to work together to fulfill the DLO, the DLO should either specify the interfaces between parties as much as possible, and / or the DLO framework should include a commitment to composability and interoperability. Two of the most powerful concepts in Web3. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.071013708513709
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#19",
                    "likes": "1",
                    "time": "21/02/2023-09:19:50",
                    "content": "The provided template should include a header called Dependencies. The MIP97 should include a way to think about and display Dependencies within a single DLO and between DLOs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sarah_Smith",
                    "index": "#20",
                    "likes": "0",
                    "time": "25/02/2023-14:51:51",
                    "content": "Regarding point one, when you describe verticals, you mean breaking Milestones 1-3, Milestones 4 & 5, etc. into groups. And by “bidding” you mean people submit work proposals based on those groups. Is that right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.434523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#21",
                    "likes": "0",
                    "time": "27/02/2023-12:35:31",
                    "content": "I suggest applicants create one work proposal per vertical they’re qualified to bid on. This serves two purposes: 1.) It helps governance compare apples to apples, per vertical 2.) It increases the chances of success because applicants don’t have to put all their eggs in one basket. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5
                }
            ]
        }
    ]
}