{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/daif-cu-update-q1-2022/14486",
            "title": "DAIF CU Update - Q1 2022 ",
            "index": 14486,
            "category": [
                "Core Units",
                "Dai Foundation"
            ],
            "tags": [
                "cu-update",
                "daif-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#1",
                    "likes": "8",
                    "time": "06/04/2022-19:43:52",
                    "content": "Hello all Note: There is a Spot On: Dai Foundation Core Unit Update on April 13th, 2022 at 15:00 UTC. Please join for having a dialogue with questions and comments to what you can read in this one-way communication  Here is the DAIFCU update for the past quarter: Getting assets into use for the DAO The formal process for requesting content manager access to an asset owned by Dai Foundation is now in order with the approved MIP60: Intangible Asset Assignment. Huge Thanks to GovAlpha and in particular to @LongForWisdom for driving this!!! Having the canonical Asset Registry published to Github is still pending but should be in order soon. In the meantime all assets, that you can request access to, can be seen at https://assets.daifoundation.org/ We are working with @techops-core-unit to setup a single point of entry for change requests against assets that already have been allocated (like adding more users, utility-apps, changing IP target and so on) to ensure more effective operations, that the asset registry always is up to date, and that we have an audit trail for the changes happening. We have still to see the first use of MIP60. In the interim process that GovAlpha devised prior to formal approval of MIP60 content management rights to the following assets have been assigned   https://github.com/makerdao/governance-manual to GovAlpha CU  https://github.com/makerdao/mcd-collateral to CES CU  https://twitter.com/MakerDAO to Growth CU  https://unified-auctions.makerdao.com/ to Sidestream Auction Services CU  In this connection, it is really great seeing how MakerDAO Twitter has been brought to life again! There are still a number of SoMe accounts and notably the makerdao.com website and its blog that are without content managers - I’m hoping the initiatives to create a Marketing CU bears fruit as having an effective presence in a broad number of communication channels also helps to protect and maintain the MAKER and DAI trademarks. Board member requirements We have been preparing for addition of new members to the board including the two Maker Governance appointed members of the Dai Foundation board. This includes documenting what in general is expected from a board member to align expectations with potential candidates. We will present the state of this work on the Dai Foundation update call on April 13th, 2022. Copyright and Software Patents We have responded to various questions regarding how to allocate software copyright to Dai Foundation, and we acknowledge that more guidance is needed here going forward. The question of whether and how patented software can integrate with MakerDAO also came in connection with MIP66: Pairwyse Licensure. There was outreach to DAIF CU regarding this to understand what role Dai Foundation might play in relation to software patents. As part of this discussion and the fact that a pledge was being put forward in the MIP, the board agreed to have a Software Patent subject matter expert to perform a basic and general pledge review. To ensure the considerations have general applicability; it is Google’s Open Patent Non-Assertion Pledge that has been reviewed. Note: Reporting the analysis result should neither be seen as an endorsement from DAIF CU of the full MIP nor the opposite. Many probably knew this already, but the work with the pledge review has emphasized that software patents is a sensitive and multi-faceted topic. Analysis of a legal pledge doesn’t answer whether it in general is to be recommended for MakerDAO to work with/integrate to/support solutions that include software patents. Whether a general MakerDAO stance on software patents in relation to the Maker Protocol can and should be defined is still to be explored. Dai Foundation is ready to take a stab at facilitating further community dialogue and analysis on this topic in the coming quarter. Trademarks Some of the trademarks received from MakerDAO are still in process for final approval. One such mark was MAKER VAULT where we had to provide “proof of usage” by Jan 21, 2022. There is per se no distinct product usage of MAKER VAULT and the documentation we provided was not accepted so the mark was not granted. Since we firmly own the MAKER trademark it is my assessment that we are well positioned to protect against any use of MAKER VAULT that infringes on MakerDAO so no further action is planned here. We also have the MAKERCON and STABLECON marks requiring proof of usage with a deadline in June 2022 and I will engage relevant CU’s to see whether we can provide acceptable proof of usage for these marks before then. Further, there has been an outreach to DAIF CU regarding a potential infringement on MakerDAO from another party. What we are doing as a result of this is:  Checking trademark status for the other party with our trademark lawyers Research to assess the impact of the other party on MakerDAO Are they trying to utilize MakerDAO trademarks to scam users? Are they utilizing the trust of our trademarks to promote their products and services? To what degree does actual confusion happen? Consult with stakeholders to  Get input for the above research Understand to what degree this is something that we need to act on, and whether we might solve this w/o legal action   Potential informal outreach to the party that is investigated for infringement  Once we have gone through the above points we will share our findings. Conferences In the last quarter I did attend ETHDenver as DAIF CU facilitator where I had good discussions with many community members about the topics above and many other MakerDAO/Dai Foundation related things. I will also attend DevConnect in Amsterdam April 18-21, 2022. Please ping me if you are attending and have any Dai Foundation topics that you want to discuss. Facilitator workload When the DAIF CU was proposed it was estimated that the facilitator workload only involved spending time participating in various Community/Governance coordination meetings and activities and reporting to the community about deliverables. However, time also needs to be spent on stakeholder inquiries and their background plus operational matters researching, planning and working with TechOps, Trademark Lawyers and other service providers on execution and implementation. To be able to move satisfactory forward with the DAIF CU tasks more time is allocated to the facilitator task for a limited period. In Q3 it will be evaluated on how to handle the operational tasks going forward, including identifying any nice-to-do tasks that can be discarded going forward. Budget reporting DAIF CU is providing manual monthly reporting on actual spend to the Strategic Finance CU, and we have also provided input to/supports the SF template that aims to roll up and present everything to the DAO at the ‘expense type’ level. We are all for transparency so we will also evaluate whether DAIF CU meaningfully can participate in all or parts of the monthly budget reporting and auditing as proposed by SES CU. As for the budget status, we are currently below our budget. Having agreements with most of our core service providers now and some requiring more than budgeted I expect us to come more in line with the budget going forward. You are welcome to join our update call for more details and any questions… Many of the above themes will continue to require work in Q2. Some additional themes for future work items are: Makerdao Github Dai Foundation agreed to temporary caretaking of the makerdao github project when Maker Foundation was dissolving. The mandate of Dai Foundation is not to provide software development operational services, but rather to ensure IP ownership. Before looking to hand over the operational aspects to another party Dai Foundation will perform cleanup and classification activities for the current content in the github project as well as introduce tools and processes to facilitate handing copyright over to Dai Foundation for new protocol software and related software/content. More details will be posted separately in the forum when we are ready. Ensuring DAO access to assets funded by the DAO While smooth access to the assets handed over from Maker Foundation it is as important to ensure that new assets created and maintained by MakerDAO funding generally become public goods for the DAO. Providing tools and guidance for how CU’s can assign IP rights of public good assets to the Dai Foundation will be a priority going forward. DAO operations should not be endangered due to IP rights disappearing when a CU/facilitator is off-boarded as we saw indications of with the involuntary Content Production CU offboarding. Dai Foundation grants Due to the legal basis of a Danish non-profit foundation we are obliged to offer grants. The board has agreed to set up a request for grants for a scientific paper that analyzes different ways DAOs handle their IP and discusses different ways the DAO/IP relationship can evolve. That was what I had for now. As always feel free to reach out with questions here or 1-1 All the best Your DAIF CU Facilitator ",
                    "links": [
                        "https://forum.makerdao.com/t/mip60-intangible-asset-assignment/10319",
                        "https://assets.daifoundation.org/",
                        "https://github.com/makerdao/governance-manual",
                        "https://github.com/makerdao/mcd-collateral",
                        "https://twitter.com/MakerDAO",
                        "https://unified-auctions.makerdao.com/",
                        "https://twitter.com/MakerDAO",
                        "http://makerdao.com",
                        "https://forum.makerdao.com/t/focus-on-9-dai-foundation-core-unit-update/14349",
                        "https://forum.makerdao.com/t/mip66-pairwyse-licensure/13554",
                        "https://forum.makerdao.com/t/mip66-pairwyse-licensure/13554/29",
                        "https://youtu.be/3j9Fc-QEsHE?t=1168",
                        "https://forum.makerdao.com/t/content-production-core-unit-offboarding-post-mortem/13756",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712",
                        "https://forum.makerdao.com/t/notice-about-hand-over-of-management-of-the-makerdao-github-organization-to-the-techops-core-unit/19868"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8768793966450215
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/07/2022-19:44:31",
                    "content": "This topic was automatically closed after 90 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        }
    ]
}