{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/core-unit-tools-09-zodiac/10679",
            "title": "\\xf0\\x9f\\xa7\\xb0 Core Unit Tools #09: Zodiac ",
            "index": 10679,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "core-unit-tools",
                "public-call",
                "pubcall-:-cu-tools"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "7",
                    "time": "04/10/2021-14:34:10",
                    "content": " 960×540 473 KB    Core Unit Tools #09: Zodiac  For the 9th episode of Core Unit Tools, we will host Kei from Gnosis Guild to learn about the Zodiac app and its collection of tools.  What is this? Zodiac is described as the expansion pack for DAOs, enabling DAOs to act more like constellations instead of monolithic designs. Zodiac has launched with four tools currently available: Exit, Bridge, Delay, and Reality. The full collection of tools soon to be available include:  Avatars   Gnosis Safe: The most trusted platform for managing digital assets on Ethereum. Zodiac embraces Gnosis Safe as a powerful, extensible and programmable account standard.  Modules   Reality (formerly SafeSnap): This module allows on-chain execution based on the outcome of events reported by the Reality.eth oracle. While built initially to execute Gnosis Safe transactions according to Snapshot proposals, this module is framework agnostic. It can enable proposal execution from just about anywhere.  Bridge: This module allows an address on one chain to control an avatar on another chain using an Arbitrary Message Bridge (AMB). This enables a DAO on one chain to control assets and interact with systems like a Gnosis Safe on a different chain.  Exit: This module allows participants to redeem a designated token for a proportional share of an avatar’s digital assets, similar to Moloch DAO’s rageQuit() function.  Safe Minion (developed by DAOHaus): This module allows Moloch DAOs to manage a Gnosis Safe’s digital assets based on the outcome of v2 Moloch DAO proposals. Safe Minion enables Moloch DAOs to control collections of NFTs, manage LP positions with AMMs, and initiate any other arbitrary interactions. Even more, it supports DAOs that begin as a Gnosis Safe to later delegate governance to a Moloch DAO.  Seele (developed by TokenWalk): This module allows avatars to operate with trustless tokenized DeGov, similar to Compound or Gitcoin, with a time-boxed proposal core that can register swappable voting contracts. This enables DAOs to choose from various on-chain voting methods that best suit their needs.  Modifiers   Delay: This modifier allows avatars to enforce a time delay between when a module initiates a transaction and when it can be executed by an avatar.  Guards   Scope: This guard allows an avatar or module to limit the scope of the functions with which it can interact. This enables a DAO to define granular permissions for different control mechanisms.    Why is it useful for Core Units? Zodiac supports DAOs on the road to progressive decentralization, allowing customizations for governance, membership, and treasury management. Here are a few examples of how active Core Units can leverage Zodiac:  Reality: Allows both off-chain snapshot proposals and Discord Polls to trigger on-chain Gnosis Safe transactions. Scope: Restrict addresses a Gnosis Safe can call. Bridge: Enables operating as multichain by connecting apps deployed on sidechains to mainnet treasury. Exit: Enable trustless pathways for contributors to exit the organization (possible MKR vesting application). Delay: Queue transactions, enable transaction cool downs and expiration periods, and skip transactions.  As usual, @juan will be on the mic doing the hosting   When Time in your local-timezone format: 2021-10-06T15:00:00Z Mark it on your Google Calendar!  Where Zoom call Passcode: COREUNIT Alternatively, use this:  Find your local number: Zoom International Dial-in Numbers - Zoom Meeting ID: 829 4277 3725 Passcode: COREUNIT  Attn:  @SES-Core-Unit, @gov-comms-core-unit, @GovAlpha-Core-Unit, @Growth-Core-Unit, @Content-Production, @MakerMikeP, @Coulter, @daif-core-unit, @Protocol-Engineering, @Oracles-Core-Unit, @Risk-Core-Unit, @Real-World-Finance, @twblack88, @flipflopflapdelegate, @planet_x, @PaperImperium, @monet-supply ",
                    "links": [
                        "https://gnosis.github.io/zodiac/",
                        "https://gnosis-safe.io/",
                        "https://gnosis.github.io/zodiac/docs/tutorial-module-reality/get-started",
                        "https://reality.eth.link/",
                        "https://gnosis.github.io/zodiac/docs/tutorial-module-bridge/get-started",
                        "https://gnosis.github.io/zodiac/docs/tutorial-module-exit/get-started",
                        "https://twitter.com/molochdao/status/1115451404242436098",
                        "https://daohaus.substack.com/p/6991f40b-3931-47ff-bea3-fa6f9c365135",
                        "https://daohaus.club/",
                        "https://github.com/TokenWalk/Seele",
                        "https://www.tokenwalk.org/",
                        "https://gnosis.github.io/zodiac/docs/tutorial-modifier-delay/get-started",
                        "https://github.com/gnosis/zodiac-guard-scope",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=MDNyN2pobDlvZXVmbWRxNmV1aWphcWlqMTkgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/maker-relay-ep-65-en-espanol/10784",
                        "https://forum.makerdao.com/t/ses-updates-7-10-2021/10832",
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.026647286821705
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "4",
                    "time": "04/10/2021-15:19:31",
                    "content": "Is there any way these tools agendas could include a slightly more detailed summary of what the products are and why they’re useful? Specifically as a Facilitator with limited time, I want to know:  What is this? Why is it important or useful to us? Does this solve an issue that our core unit is currently having?  The description and web-page here don’t give me a good immediate understanding of what this is. Spending some more time on it. I would have appreciated if this agenda could have listed the ‘modules’ available that are part of zodiac and which are applicable to core units at Maker. To save others the trouble, this seems to be the gist of what Zodiac offers (though I’m not sure all of these are relevant for us):    Reality (formerly SafeSnap): This module allows on-chain execution based on the outcome of events reported by the Reality.eth oracle. While built initially to execute Gnosis Safe transactions according to Snapshot proposals, this module is framework agnostic. It can enable proposal execution from just about anywhere. For example, it can bring Discord polls on-chain.  Bridge: This module allows an address on one chain to control an avatar on another chain using an Arbitrary Message Bridge (AMB). This enables a DAO on one chain to control assets and interact with systems like a Gnosis Safe on a different chain.  Exit: This module allows participants to redeem a designated token for a proportional share of an avatar’s digital assets, similar to Moloch DAO’s rageQuit() function.  Safe Minion (developed by DAOHaus): This module allows Moloch DAOs to manage a Gnosis Safe’s digital assets based on the outcome of v2 Moloch DAO proposals. Safe Minion enables Moloch DAOs to control collections of NFTs, manage LP positions with AMMs, and initiate any other arbitrary interactions. Even more, it supports DAOs that begin as a Gnosis Safe to later delegate governance to a Moloch DAO.  Seele (developed by TokenWalk): This module allows avatars to operate with trustless tokenized DeGov, similar to Compound or Gitcoin, with a time-boxed proposal core that can register swappable voting contracts. This enables DAOs to choose from various on-chain voting methods that best suit their needs.   ",
                    "links": [
                        "https://reality.eth.link/",
                        "https://gnosis.github.io/zodiac/docs/tutorial-module-bridge/get-started",
                        "https://gnosis.github.io/zodiac/docs/tutorial-module-exit/get-started",
                        "https://twitter.com/molochdao/status/1115451404242436098",
                        "https://daohaus.substack.com/p/6991f40b-3931-47ff-bea3-fa6f9c365135",
                        "https://daohaus.club/",
                        "https://github.com/TokenWalk/Seele",
                        "https://www.tokenwalk.org/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.088320463320463
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#3",
                    "likes": "4",
                    "time": "04/10/2021-17:02:59",
                    "content": "Appreciate the feedback, LongForWisdom. I’ve edited the post to be more helpful and we’ll update the template moving forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#4",
                    "likes": "1",
                    "time": "04/10/2021-19:31:08",
                    "content": " Core Unit Tools - Episode #09  October 6th, 2021  Agenda   00:00: Intro with Juan Guillén  00:35: Discussion about Zodiac with Kei Kreutler and Auryn McMillan  51:56: Outro   Video https://youtu.be/fag90EtjI-U  Introduction  Juan Guillén  Agenda and Preamble 00:00  Hi to everyone. Welcome to Core Unit Tools session #09. Today we have the team from Zodiac.  I am happy to introduce Kei and Auryn. They will be explaining different tools that they have been working on for DAOs to take the game to the next level. For other episodes of CUT, please check the forum.   Kei Kreutler and Auryn McMillan 00:35  Zodiac1920×1126 103 KB   20211920×1139 161 KB   Philosophie1920×1114 124 KB   Zodiac Collection of Tools1920×1098 144 KB   Zodiac Exit Module1920×1122 130 KB   Zodiac Bridge Module1920×1129 156 KB   Zodiac Delay Module1920×1165 137 KB   Overview of the App1920×1139 194 KB   Bundle Transactions1920×1133 113 KB   Story about Zodiac1920×1123 157 KB   Phases1920×1126 96.1 KB   The Zodiac open Standard1920×1115 99.5 KB   More information1920×1121 147 KB   Questions 13:55 - Juan Guillén: I was going to ask you for an example or a demo. 14:37 - Juan Guillén: Did you do this out of need for Gnosis, and then you said you would be cool to open it to everyone? Or is it a stand-alone project that you believed would have an impact, and you wanted to make it happen? What is the story behind it? 16:58 - Juan Guillén: In Maker, we have what we call Core Units. They are guilds or groups that get their Dai to cover any type of expenses. Not long ago, we implemented vesting. It is like flowing; the budget flows instead of being a lump sum every time. There would be nice to have different types of payments or implementations. The most basic one was a top-up every month to a certain number. If someone asks for fewer expenditures than they were forecasting, you will give them less money. Then we started thinking a bit out loud. We have not planned anything concrete yet. One of the things to improve governance is: what if the MKR token holders or the delegates could, for example, change how this Dai flows across the system? Then we could prepare, for example, the things that we need to be working on for sure, or this is more like a nice to have, or this team is doing great so they might want to expand we should send them more Dai, etc. You know better than us: when you start looking at tools out there, you find that there is not a lot to work with. 29:47 - Juan Guillén: Do you have a place with nice documentation or videos, etc.? 31:26 - Juan Guillén: Let’s say a CU wants to implement one of these mechanisms, how do you suggest that they go about it? I am pretty sure that almost all the CUs have a multi-sig diagnosis. Should they start looking into what they want to do and then potentially contact you? 33:35 - Juan Guillén: For anyone watching the recording later. Kia just sent three links that we will include in the notes. It is their documentation, GitHub and their Discord. 34:06 - Frank Cruz: When we migrate to Discord, there might be some snapshot votes that come up. When checking in on Discord using my iPhone, I have noticed that you cannot connect your wallet to it. Many protocols that use this will announce that there is a live vote going on, so you hit on the snapshot link. You cannot do anything about it. You have to get back to a browser that allows you to connect to your MetaMask. Is this what this module intends to solve? 38:00 - Frank Cruz: How long has the reality module been battle-tested for? 40:10 - Someone: One possible use case would be implementing more sophisticated governance methods like Futarki. When explaining this escalation game, a possible use case would be to implement prediction markets in the collective decision-making. Is that correct? 42:53 - Global Lager (from chat): Could the reality part be staked by anyone or only the members of the specific community? 44:22 - Torch Horse (from chat): Is it possible to perform conditional voting on Discord votes that has tiered gateways for value distributions? Can you add NFTs as a transaction for vote proposals? 51:37 - Juan Guillén: Do you have anything else that you would like to say? What is the best way to reach you?  Closing Comment  Juan Guillén  Outro 51:56  It was great having you. Thank you!   Credits  Kunfu-po produced this summary  @gala produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/fag90EtjI-U?t=35",
                        "https://youtu.be/fag90EtjI-U?t=3116",
                        "https://youtu.be/fag90EtjI-U",
                        "https://youtu.be/fag90EtjI-U",
                        "https://forum.makerdao.com/tag/core-unit-tools",
                        "https://youtu.be/fag90EtjI-U?t=35",
                        "https://youtu.be/fag90EtjI-U?t=835",
                        "https://youtu.be/fag90EtjI-U?t=877",
                        "https://youtu.be/fag90EtjI-U?t=1018",
                        "https://youtu.be/fag90EtjI-U?t=1787",
                        "https://youtu.be/fag90EtjI-U?t=1886",
                        "https://youtu.be/fag90EtjI-U?t=2015",
                        "https://youtu.be/fag90EtjI-U?t=2046",
                        "https://youtu.be/fag90EtjI-U?t=2280",
                        "https://youtu.be/fag90EtjI-U?t=2410",
                        "https://youtu.be/fag90EtjI-U?t=2573",
                        "https://youtu.be/fag90EtjI-U?t=2662",
                        "https://youtu.be/fag90EtjI-U?t=3097",
                        "https://youtu.be/fag90EtjI-U?t=3116"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.179147094040712
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/10/2021-15:26:39",
                    "content": "This full call is now available for review on the MakerDAO Youtube channel:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                }
            ]
        }
    ]
}