{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/how-core-units-can-work-through-the-endgame-pivot-w-tadeo-of-data-insights-cu-on-drinks-w-makerdao-delegates/19191",
            "title": "How Core Units can work through the Endgame Pivot w/Tadeo of Data Insights CU on Drinks w/MakerDAO Delegates ",
            "index": 19191,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "community-delegate-vlog",
                "drinks-maker-delegates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "8",
                    "time": "16/12/2022-11:50:01",
                    "content": " Tadeo is Back in Black In this episode we sit down with @tadeo of Data Insights after his successful performance at the EthGathering conference. We discuss the barrier-to-entry for Core Units and how they don’t collaborate enough, how the Data Insights team is thinking about the Endgame pivot, and the need to have clarity in order to move forward as possibly and Ecosystem Actor. We also discuss how Tadeo is thinking about on-chain data for the Endgame Plan, the DSR, RWAs, and future subDAO D3Ms. Also, making  a special appearance on the show is @JustinCase and how he’s thinking about the future of DeFi in this tumultuous environment. @rspa @ultraschuppi and I have really enjoyed having Tadeo on Drinks with MakerDAO Delegates and hope that you do as well. And if you do, please don’t forget to hit that “like” button and please subscribe.  Not Financial Advice This Content is for entertainment and informational purposes only, you should not construe any such information or other material as legal, tax, investment, financial, or other advice. Nothing contained on the Drinks With MakerDAO Delegates YouTube Channel constitutes a solicitation, recommendation, endorsement, or offer by @tadeo @ultraschuppi a.k.a, Tim Schuppner @ElProgreso a.k.a, Frank Cruz @rspa a.k.a, Raphael Spannocchi, @JustinCase, Flip Flop Flap Delegate LLC, Flipside Crypto, Data Insights Core Unit, or any third party service provider to buy or sell any cryptocurrencies, securities, or other financial instruments. Nothing in this YouTube Video constitutes professional and/or financial advice.  The Tastings Tadeo Vichy Catalan, Mineral Water from Barcelona, Catalonia, Spain   5 Stars      El Pro: Mad Elf Ale by Tröegs Independent Brewing  : 4 Stars     Schuppi: Krombacher Pils  Germany  3.5 Stars     Raphael: Wunderbraeu Helles  Germany  2.8 Stars         ",
                    "links": [
                        "https://troegs.com/beer/mad-elf/",
                        "https://www.krombacher.de/unsere-produkte/krombacher-pils",
                        "https://wunderbraeu.de/#biere",
                        "https://www.youtube.com/watch?v=aDNhzGsMA1k",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/38"
                    ],
                    "GPT-summary": "In this episode of \"Drinks with MakerDAO Delegates,\" the host and guests discuss the barrier-to-entry for Core Units and how they don’t collaborate enough, how the Data Insights team is thinking about the Endgame pivot, and the need to have clarity in order to move forward as possibly and Ecosystem Actor. They also discuss how Tadeo is thinking about on-chain data for the Endgame Plan, the DSR, RWAs, and future subDAO D3Ms. The post does not fit perfectly into any of the listed topics, but it does extend to the proposal and give constructive criticism while also expressing a desire to collaborate.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.121858465608465
                }
            ]
        }
    ]
}