{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/curvelp-steth-eth-parameters-adjustment/13767",
            "title": "[CurveLP-stETH-ETH] Parameters Adjustment ",
            "index": 13767,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "debt-ceiling",
                "curve",
                "dust",
                "curvelp-steth-eth"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sean",
                    "index": "#1",
                    "likes": "14",
                    "time": "09/03/2022-10:29:29",
                    "content": "The Collateral Onboarding Risk Assessment for CurveLP-stETH-ETH was published more than 4 months ago, in October 2021. The CurveLP-stETH-ETH collateral is now approaching mainnet launch. In the interim period, there have been several MakerDAO collateral parameter changes, as well as significant developments in the cryptoasset ecosystem and the financial markets. The objective of this post is to review the original CurveLP-stETH-ETH risk parameters in light of these changes and provide updated parameter recommendations where relevant. Changes to WSTETH-A CurveLP-stETH-ETH is a more risky collateral type than WSTETH-A. The main reason for this is the additional smart contract risk of the Curve Protocol. Hence, a slight financial premium of 4.5% for CurveLP-stETH-ETH was recommended. At the time, the stability fee recommendation for WSTETH-A was 4%. The onboarding of WSTETH-A passed in October 2021. Since then, the stability fee of WSTETH-A has been reduced twice. Once in January, 2022, from 4% to 3%. And then again from 3% to 2.5% in early February, 2022. These changes were mainly motivated by a decrease in DAI-from-ETH-A compared to DAI from PSMs. The MOMC believed that rates on ETH across all competitors would decrease in the near future. Hence, to stimulate DAI minting from high-quality collateral, it makes sense to lower the cost of other ETH collateral types as well. CurveLP-stETH-ETH Yield Factors The LDO reward rate depends on the LDO token value and the quantity of LDO tokens distributed to liquidity providers of the ETH/stETH pool. The value of the LDO token is dependent on the health and sentiment of Lido and the general DeFi market, as well as the potential value dilution that may happen due to the continued distribution of LDO tokens. Lido has publicly stated that they are committed to incentivising the pool at least until the merge and staking withdrawals are enabled. The reward rate from trading fees on Curve is dependent on the pool trading volume. It appears that Lido is trying to diversify the stETH liquidity to several DeFi platforms. For example, more LDO rewards are being distributed to projects such as Balancer, 1Inch, and Sushi. In addition, Aave recently onboarded stETH as collateral. Diversifying liquidity will likely increase the general health of stETH. However, if this diversified liquidity comes at the expense of lower trading volumes in the ETH/stETH Curve pool, the APY from trading fees may decrease. Finally, the reward rate from stETH may continue to decrease as more stakers deposit ETH into the Beacon Chain. In contrast, ETH staking yields may increase after the Beacon Chain-Mainnet merge, as rewards will incorporate net transaction fees that are currently paid to miners. For instance, Coinbase expects yields to be around 9-12%. Although there is no definitive date for the merge, several Ethereum core developers and community members expect it to happen around June 2022. Nevertheless, it is still possible that the merge will be further delayed. Staking withdrawals will not be available directly after the merge. These will only be enabled in a “post-merge hardfork”. The date for the post-merge hardfork has not yet been set. According to Vitalik Buterin a realistic timeline is 6 months after the merge. For many users, unstaking stETH is the main use case for the ETH/stETH Curve pool. Hence, until ETH staking withdrawals are enabled, the use case for the ETH/stETH pool will remain relevant. Furthermore, the expected increased yield from ETH staking may result in a higher demand for ETH staking derivatives, including CurveLP-stETH-ETH, as Maker collateral. After the post-merge hardfork, things may change. However, this is probably at least 10 months away. In summary, the yield for the CurveLP-stETH-ETH collateral will vary in relation to the following factors: (i) LDO incentives, (ii) ETH/stETH Curve pool trading volume, and (iii) ETH staking yield. At present, it is not possible to predict with any precision how these will change over time. Hence, it is important that the Risk Core Unit and the MOMC continue to monitor developments closely. Adjusted Dust Parameter for Maker Vaults The debt floor (dust) limit has changed for multiple vaults since the publication of the CurveLP-stETH-ETH Risk Assessment. In December 2021, the dust for several vaults was increased to 15,000 DAI (from 10,000 DAI), and for ETH-B it was increased to 40,000 DAI (from 30,000 DAI). In January 2022, the dust limit for stablecoin-volatile pair LP vaults was increased to 60,000 DAI (from 15,000 DAI) and the dust limit for volatile LP vaults was increased to 25,000 DAI (from 15,000 DAI). Updated Recommendations We believe that it is a good idea to lower the initial stability fee from 4.5% to 3.5%. This takes into account the decreased reward rate of the CurveLP-stETH-ETH collateral and is in sync with the decision to lower the WSTETH-A stability fee. To a certain extent, WSTETH-A and CurveLP-stETH-ETH are “competing collaterals”. At this point, it is difficult to determine the type of collateral that borrowers will prefer. Nevertheless, the stability fee spread should probably be low enough to stimulate DAI minting from both collateral types. The Risk Core Unit and the MOMC will be able to assess this relationship at a later stage when both collateral types are available on mainnet. We will then be able to set the stability fees accordingly. The initial dust recommendation for CurveLP-stETH-ETH was 10,000 DAI. Since then, the dust limit has increased for almost all vaults in the Maker Protocol. More on the reasoning behind these changes can be found here and here. We believe that it makes sense to match the current dust limit of volatile LP vaults by setting the dust to 25,000 DAI for CurveLP-stETH-ETH. In terms of debt ceiling, the initial recommendation was 5 million. This collateral type is novel with added risk factors. After further discussion with the PECU team, a debt ceiling of 3 million is believed to be a more reasonable starting point. The debt ceiling may be increased at a later stage if increased demand for CurveLP-stETH-ETH collateral becomes evident. In conclusion, the following parameter changes to CurveLP-stETH-ETH are recommended:  Decrease Stability Fee by 1% from 4.5% to 3.5% Decrease Debt Ceiling by 2 million from 5 million to 3 million Increase Dust by 15,000 from 10,000 to 25,000  ",
                    "links": [
                        "https://vote.makerdao.com/executive/template-executive-vote-parameter-changes-wsteth-a-onboarding-october-22-2021?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-momc-parameter-changes-decrease-the-guniv3daiusdc2-a-liquidation-ratio-january-21-2022?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-recognized-delegate-compensation-raise-the-emergency-shutdown-threshold-momc-parameter-changes-core-unit-dai-budget-stream-corrections-february-04-2022?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/tag/ppg-omc-001",
                        "https://blog.lido.fi/concerning-steth-liquidity/",
                        "https://dune.xyz/LidoAnalytical/LDO-incentives",
                        "https://blog.lido.fi/aave-integrates-lidos-steth-as-collateral/",
                        "https://twitter.com/panekkkk/status/1496586698179989504/photo/1",
                        "https://twitter.com/panekkkk/status/1496586698179989504/photo/1",
                        "https://twitter.com/TimBeiko/status/1493737422877642763",
                        "https://www.youtube.com/watch?v=b1m_PTVxD-s&t=1307s&ab_channel=Bankless",
                        "https://vote.makerdao.com/executive/template-executive-vote-parameter-changes-delegate-compensation-vault-onboarding-december-3-2021?network=mainnet#proposal-detail",
                        "https://docs.google.com/spreadsheets/d/1kpXE7_wNJBljLnRbdxLPTrx2xF86W83xvYX4LYnar0c/edit#gid=0",
                        "https://vote.makerdao.com/executive/template-executive-vote-recover-dai-from-optimism-escrow-changes-to-uniswap-lp-vault-debt-floor-parameters-delegate-compensation-january-14-2022?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-recognized-delegate-compensation-raise-the-emergency-shutdown-threshold-momc-parameter-changes-core-unit-dai-budget-stream-corrections-february-04-2022?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/signal-request-adjusting-dust-parameter-2021-4/11598",
                        "https://forum.makerdao.com/t/signal-request-adjusting-dust-parameter-lp-token-vaults-2021-5/12313",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-march-2022/14424",
                        "https://forum.makerdao.com/t/immediate-short-term-parameter-changes-proposal-for-crvv1ethsteth-a-dc-and-gap-increase/14476",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-2-9-2022/13804",
                        "https://forum.makerdao.com/t/propuesta-de-cambios-de-parametros-inmediatos-y-de-corto-plazo-para-crvv1ethsteth-a-incremento-de-dc-y-gap/14618",
                        "https://forum.makerdao.com/t/the-risk-core-unit-2022-year-in-review/19372"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.479128014842301
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dairyman",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/03/2022-12:09:04",
                    "content": "Can you share a little more why the drop to 3 million for the ceiling vs 5 million? I’m just curious if something specific prompted that or if it is just because the fees to compensate us for risk are lower than before ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.265625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sean",
                    "index": "#3",
                    "likes": "2",
                    "time": "22/03/2022-13:45:52",
                    "content": "We usually recommend setting a lower debt ceiling for more foreign collateral types at first, in order to limit the risk exposure and potential technical issues that can occur. In this case, when we wrote the risk assessment for CRVV1ETHSTETH-A back in October 2021, we believed that 5 million was an appropriate debt ceiling level. The PE team, however, after their own assessment and work, recommended starting off with 3 million. Going forward, Risk and the MOMC will continue to assess vault activity to see if any parameter changes, including changes to the debt ceiling, need to be made. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-march-2022/14424"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/06/2022-19:46:43",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}