{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-messari-governor-coverage-announcement/19787",
            "title": "MakerDAO Messari Governor Coverage Announcement ",
            "index": 19787,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ajs",
                    "index": "#1",
                    "likes": "10",
                    "time": "10/02/2023-19:45:40",
                    "content": "Hello MakerDAO, My name is AJ, and I work as a governance analyst at Messari. We’re glad to announce that we recently added coverage for MakerDAO on our Governor product which tracks and summarizes discussions and proposals across forums, Polls, and Executive Votes.  makerdao_govdash1920×1104 125 KB  You can find our MakerDAO proposal coverage here. We also added a governance profile detailing MakerDAO for our Pro/Enterprise subscribers. Any feedback is welcomed, and we would love to know how you use Messari Governor. Also, we would be happy to demo the product to the DAO’s team or broader community to highlight how it can be valuable and chat about other governance services we can provide (ex: State of Optimism Governance). Enjoy, and feel free to share it with your community! ",
                    "links": [
                        "https://messari.io/governor/overview",
                        "https://messari.io/dao/maker-dao/proposals",
                        "https://messari.io/dao/maker-dao",
                        "https://messari.io/report/state-of-optimism-governance?referrer=all-research"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.839285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/02/2023-21:50:15",
                    "content": "What I can see without the Pro version looks good. If possible, I would suggest identifying delegates/voters by name on proposals. Compare Messari  image892×430 20.5 KB  to the voting portal  image936×763 69.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#3",
                    "likes": "7",
                    "time": "11/02/2023-10:26:12",
                    "content": "Can I humbly request that if Messari does do this, and uses information from the voting portal to improve their subscription product, voluntarily share this revenue with the Maker Pause Proxy address: https://etherscan.io/address/0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB This could apply to any subscription or commercial product deriving value from any open source contributions to the Maker protocol (GitHub repos, dune queries, forum shitposts, etc). Yes this is the freeloading problem of open source contributions all over again but I wanted to plant a flag here and ask companies to start contributing for use of open source code and data.    MakerDAO: 2022 Financial Results and Retrospective   To the extent such firms end up recycling our crypto-GAAP query too, or portions thereof, we would kindly request voluntary ongoing donations of part of their subscription revenue attributable to MakerDAO reports to the Maker Pause Proxy address (0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB ).   We’ve made the same request explicit elsewhere ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-2022-financial-results-and-retrospective/19636/1",
                        "https://etherscan.io/address/0xbe8e3e3618f7474f8cb1d074a26affef007e98fb"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.222222222222222
                }
            ]
        }
    ]
}