{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-to-audit-or-not-to-audit-governance-delay/5278",
            "title": "[INFORMAL POLL] To Audit, or Not to Audit--Governance Delay ",
            "index": 5278,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "3",
                    "time": "22/11/2020-13:14:17",
                    "content": "This in an informal poll (not a signal request). With the abundance of DeFi exploits that have occur just about every weekend via Flash Loans, or complex attacks–I have been thinking about how careful we as a community need to be, and at what speed we should travel. Full Disclosure: I personally believe and trust the Foundation Teams–1000%. But with the recent Pickle hack, and their statement that it took more 10 white hat hackers to look into the exploit, and we combine that with the wishy-washy auditing firms that are letting the Ethereum/DeFi community down–how fast should we move? What is the correct timeline for the Governance Delay? Should the community use the Surplus Buffer to hire more Devs for Weekend work shifts since it seems hackers love to exploit on Saturdays and Sundays?  With all of this in mind–Please take time out and have your say on the following questions: Should ALL Smart Contracts and Smart Contract changes, even as simple as 18 new lines of code  **DSChief 1.2** be AUDITED by a Blockchain Security and Smart Contract Audit Company?     Yes No Abstain     0 voters     What is the correct number of Governance Delay Hours needed in your opinion?     24 Hours 48 Hours 72 Hours 120 Hours 168 Hours Abstain     0 voters     Are you willing to wait 3 to 6 months for the top 2 Blockchain Security and Smart Contract Audit Companies to audit ALL Maker Smart Contracts?     Yes No Abstain     0 voters     Should the community use the Surplus Buffer to hire more Devs for extra eyes & ears on the weekend?     Totally, SB, or Strategic Reserves–let’s provide more help to the Foundation Teams We good bruh, no need for more eyes Abstain     0 voters     Since Liq. 1.2 will go to an Executive Vote on November 27, 2020 and this is an Informal Poll–I will let it run for approximately 4 days. I will close it on Wednesday November 25 at 17:00 UTC. Thank you in advance for providing your views and votes! ",
                    "links": [],
                    "GPT-summary": "The author of the post is conducting an informal poll to gather opinions on the need for auditing Maker Smart Contracts and the appropriate governance delay hours. The author expresses concern about recent DeFi exploits and the need for caution. The post includes several questions for participants to answer and will be open for approximately four days. The post also mentions the possibility of using surplus buffer to hire more developers for extra eyes and ears on the weekend.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.81389146567718
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "3",
                    "time": "22/11/2020-13:43:31",
                    "content": "These questions are all very context sensitive and I don’t think the answers do them justice. Smart contract changes include weekly executives and rate changes which I don’t think we need audits for. Most of MakerDAO changes aren’t super complex. Obviously when we add entire new modules I think we need further audits. Governance delay is also dependent on complexity of the system. At this point once 1.2 comes in I think 24-48 would suffice. Once the system gets more and more complex I could see this changing to many more days. Not sure I understand the last question. Hire more devs just to guard against attacks on the weekend? I think Maker has stood the test of time at this point and this would just be a waste of money. We aren’t a new startup with unproven code right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.79906204906205
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/11/2020-14:18:36",
                    "content": "    Aaron_Bartsch:  These questions are all very context sensitive and I don’t think the answers do them justice. Smart contract changes include weekly executives and rate changes which I don’t think we need audits for.   Yes, I agree. It’s meant more for new Smart Contracts and Smart Contract Changes. However–playing Devil’s Advocate–the The Black Thursday attacked by the 0 bid Keeper/s/mempool/s – back before that happened-- I always thought liquidations were 100% reliable by me and I’m sure by many others. We were so wrong.     Aaron_Bartsch:  Hire more devs just to guard against attacks on the weekend? I think Maker has stood the test of time at this point and this would just be a waste of money. We aren’t a new startup with unproven code right now.   Yes, have a different set of Devs also working diligently from Friday night to Monday afternoon–like the current Teams–who work  Monday thru Friday. Again, I hate to bring back crappy memories–but it has not even been a year since the March Black Swan events. Not sure if we can say, Maker has stood the test of time…  but hopefully you’re right. Time will tell. BTW–another Rug Pull happened this Sunday morning–a farm called KoalaSwap got exploited for $180K–the devs of Koala claim they needed 24H to put a timelock ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.370365142104272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#4",
                    "likes": "1",
                    "time": "22/11/2020-14:33:12",
                    "content": "    Aaron_Bartsch:  These questions are all very context sensitive and I don’t think the answers do them justice.   This. We need to hire more developers, but not necessarily for smart contracts (not that it would hurt), but to increase transparency of the the system (historical charts, monitoring, alerts, protocol introspection etc.). Operating system is not only kernel, but whole stack of software above. Just remember how much work it took for MakerMan (and others) to do the BT liquidated vaults analysis. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.707142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#5",
                    "likes": "1",
                    "time": "22/11/2020-16:04:20",
                    "content": "Just making a small clarification: I think @flipflopflapdelegate  meant “DSChief 1.2” rather than “Liquidations 1.2” (two references–one in the bold paragraph, one after the last poll). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.138888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "2",
                    "time": "22/11/2020-16:07:49",
                    "content": "Yes, thank you Kurt!   I was half-asleep when I wrote this Poll. Sunday morning blues ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#7",
                    "likes": "10",
                    "time": "22/11/2020-18:57:07",
                    "content": "FWIW, the current SC team is always here, always watching. We’re ready to activate in response to a real emergency if something materializes over the weekend. We all worked non-stop for weeks after Black Thursday. This is a full-time job so we do actively and consciously back off from the protocol on weekends to avoid the burnout that that can accompany work like this and stay fresh in case of a real emergency. I will say that I am skeptical of of the ability of governance to hire developers who work “just” on weekends. The system is complex and has many interconnected parts where one part of the system can be negatively impacted by changes in another. It really is full-time work for a developer to keep the system context and status in their head, so by only working weekends, a developer is not going to have any link to the rest of the smart contract developers for training or context. As Smart Contract developers, I don’t think that we ever stop thinking about the risks that new code can pose to the system, and we should probably be better about communicating them. I am not going to discourage the protocol from hiring more developers into the ecosystem, but hiring part-time developers who aren’t 100% committed to protocol work is likely to increase, rather than decrease, the system risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.441233766233767
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/11/2020-20:33:26",
                    "content": "Generally agree with some general sentiments. I said yes to hire more Devs (ignored the weekend part) simply because I think another dev group dedicated to eyes operationally on the system 24/7/365 is important.   This isn’t about weekends it is about having enough expert hands on deck at all times to catch something that fell through.   Ultimately I am going to end up trusting someone like @brianmcmichael or @cmooney etc. and just give them the budget to get the job done.  Should we have a fall back team.   With decentralization I like to have secondary catch systems, how much to pay for that to be a fully functional primary that acts as a secondary backup.   Debatable.     Aaron_Bartsch:  These questions are all very context sensitive and I don’t think the answers do them justice. Smart contract changes include weekly executives and rate changes which I don’t think we need audits for. Most of MakerDAO changes aren’t super complex. Obviously when we add entire new modules I think we need further audits.   Agree here.   I abstained from the GSM delay just because of this and.     Aaron_Bartsch:  Governance delay is also dependent on complexity of the system. At this point once 1.2 comes in I think 24-48 would suffice. Once the system gets more and more complex I could see this changing to many more days.   Agree here as well.  I have seen a few hundred production environments the best production switchovers are ones where operations can just flip back to the old production system if the new is living up to expectations or worse is faulty.  There are some cases this is not possible and one simply has to hold breath while a new upgrade is brought up live.     jernejml:  Operating system is not only kernel, but whole stack of software above. Just remember how much work it took for MakerMan (and others) to do the BT liquidated vaults analysis   I want to point out something here I have still not discussed publicly.   I caught things in my liquidation analysis that to this day so far no-one has noticed.   Expect to hear more on this in the future at some point.   To be sure there was nothing I found that revealed critical exploits.  It was more about the details of what happened after the fact, rather than the mechanics.   So yes I am keenly aware of how these things interplay not just from a maker perspective but as a freelance consultant hired and paid to come into complex production environments to ‘fix’ something to return a company operations to the ‘up’ status vs. ‘uof’ (unscheduled off). Finally I come back to goal with all of this.   Do we have data that the GSM delay against the current updates needs revisiting?   While Maker does have its share of bugs (or bacteria as my friend likes to call them - issues that don’t cause the system to fail but just cause annoyances) so far (knock on wood) most things have worked as intended even if there were unintended consequences.   The 0-bid Black Thursday as we have subsequently learned was not entirely a Maker liquidation protocol failure but really an Ethereum protocol mempool attack that affected keepers adversely.   What we are finding is that more and more of these attacks require a high level of sophistication and planning component and are not entirely Maker software releated but NETWORK related.   Put simply we could spend a ton of money on  trying to nail these attack or bug vectors and not get the majority of them.   One might better spend the money and effort into figuring out and implementing better system monitoring and data/analysis protocols and have operators tasked with monitoring the system 24/7/365 with ability to do halts or to signal a halt or throttle activity somewhere.   Have it so a decentralized group basically uses a kind of multisig backed by a slashable stake to signal these halts, throttles, etc. As well as a secure communication model so they can talk to each other without the rest of the world knowing what they are talking about or flagging abnormal events. We are trying to throw money at heading off something we can’t imagine by doing up front work.  Alternatively what we want to do is create a Maker monitoring and operations group that then via operations dashboards, flag operators that the system is not operating normally and perhaps signal to shutdown, halt or throttle, part of the system until a formal review of operational data is conducted, system is found secure and a restart of the halted system(s) or increase in throttle is initiated. I already know as one now with 20+years of operational experience that only so much work can be done on the front of machine/system changes.  One can blow a ton of money auditing something, doing insitu tests, but only when the change goes live do you find out there is something you missed and are DOA.  Then you can either drop kick operations to an old working machine state, or halt and fix what you broke and try to bring up operations in the upgraded state yet again.   In EITHER case having operational metrics and an operations group is the prime way these things are caught in the end.  Someone via dashboard mechanics watches the system and determines via operational experience what is normal vs. abnormal.  These groups use their experience and expertise to decide what to do to manage the problem.   Maker has no such provision for operators and operations adjusting the system at all except governance which by nature and design is slowed to act (the GSM was one of the prime reasons we could not act during BT I believe).   I suspect there are people in the Foundation that do this monitoring but I don’t have any knowledge of details of such a group, nor access to their data metrics, flag events, etc.  Not even in an after the fact event analysis capacity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.654335603420969
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#10",
                    "likes": "1",
                    "time": "22/11/2020-20:50:27",
                    "content": "    brianmcmichael:  the current SC team is always here, always watching.   You guys rock. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#11",
                    "likes": "0",
                    "time": "23/11/2020-02:31:22",
                    "content": "The wording for the question and answers for “Should the community use the Surplus Buffer to hire more Devs for extra eyes & ears on the weekend?” probably can be done better  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisGryphen",
                    "index": "#12",
                    "likes": "0",
                    "time": "23/11/2020-04:20:56",
                    "content": "Im new: If you dont have time to read/reply to a newby, thats perfectly fine. Someone eventually will. I also abstained from the first. Same generic reasons as above. My answer is non-bianary. Different tasks necessitate different measures–I would hate to limit our decisions this early. I am sincerely asking, What defines “complex”? I get a notion that 18 new lines of code isn’t “complex”. Is 19? Is 20 lines complex? What defines complex if governance delay is dependent on “complexity of the system”? Has the community any benchmarks? Is there a list of what is/isnt complex? Is complexity scalable; can we chart various tasks to determine governance delay? Is this something a formula can create or are we relying on intuition? BrianMcMakerDao mentioned being open about communicating issues; have we openly acknowledged what our biggest security issues are? I checked through the forums but I might have missed it. Hire more, How many more? One more? I could be easily convinced about hiring one more person, no questions asked… …But to drop two dozen people on a team, Id have these questions:  Is this a situation where more people = more better?  2a) Is there a limit where there become too many people on a team? 2b) What would that be? (Jeff Bezos uses the “two pizza” rule) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.852272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "0",
                    "time": "23/11/2020-16:06:43",
                    "content": "    brianmcmichael:  It really is full-time work for a developer to keep the system context and status in their head, so by only working weekends, a developer is not going to have any link to the rest of the smart contract developers for training or context.   Hey Brian! TY for the input. I probably should have worded things better–what I meant was having Devs on duty  full-time from say Thursday to Tuesday–kind of like how the best nights for bartenders/waiters/dancers, etc. to make money are pre-weekend till the end of Monday night (pre-covid). But I totally get your drift. The Chat.Makerdao post by Mooney also makes sense–although I rather catch an exploit before it happens–then to have such talented people tell us why it happen. Hopefully that  makes sense. image1041×129 12.9 KB ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.548469387755103
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#14",
                    "likes": "2",
                    "time": "23/11/2020-16:34:53",
                    "content": "    flipflopflapdelegate:  The Chat.Makerdao post by Mooney also makes sense–although I rather catch an exploit before it happens–then to have such talented people tell us why it happen. Hopefully that  makes sense.   I’m 100% on board with Mooney’s suggestion. Unfortunately if something does go wrong it will be an exploit of an existing contract or workflow. No new code would be submitted over the weekend without coordination and input from a wide range of stakeholders, including the rest of the weekly SC devs and the community anyways. Having banteg, samszun, rain, lev, etc. on retainer to help pick apart and explain the exploit to the community would take a lot of pressure off of the rest of us and give us the slack to prepare actionable solutions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.609848484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/banteg",
                    "index": "#15",
                    "likes": "8",
                    "time": "24/11/2020-07:49:33",
                    "content": "I’d prefer a peer review from contributors who have figured out how MakerDAO works to an auditing company any day. Don’t underestimate the mindshare and the brilliant engineering talent this project has captured. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "24/12/2020-17:49:35",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}