{
    "poll_list": [
        {
            "title": "Inclusion Poll for Strategic Marcomms Core Unit MIP Set - May 10, 2021",
            "index": "7189",
            "option": "No",
            "supporting_mkr": "24,200",
            "highest_fraction": 0.83
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c2-sp9-strategic-marcomms-core-unit/7189",
            "title": "MIP39c2-SP9: Strategic Marcomms Core Unit ",
            "index": 7189,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "cpm-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#1",
                    "likes": "15",
                    "time": "25/03/2021-09:39:03",
                    "content": " Preamble MIP39c2-SP: 9 Author: Kathleen Chu  Contributors: Sahabia Yakubu, Kaori Sato, Francesco Alberti  Status: Rejected Date Applied: 2021-03-25 Date Ratified: <yyyy-mm-dd>   Specification  Motivation The MakerDAO community is energetic and highly engaged, thanks to the core community’s concerted efforts and initiatives. The unit recognizes that reaching new audiences and users is vital for Dai’s mass adoption. Based on that conclusion, the unit is formed to be dedicated to outreach. We are proposing this unit to the DAO because it delivers the following:  A clear, consistent, and coordinated communication across key channels A cohesive global branding with a strong focus on marketing strategy tailored for targeted key markets that match the needs suitable for each stage of growth in Dai awareness and adoption  The core unit identifies targeted audiences and helps them learn about MakerDAO as it enters the next growth phase. The team builds on the recognition MakerDAO has gained in the cryptocurrency space and expands into the mainstream.   The unit will increase general awareness of MakerDAO and focus on Dai adoption by creating specific marketing initiatives for each targeted market.   The marketing activities will also be designed based on the needs of other units at MakerDAO to achieve our organizational objectives.   The strategic communications portion protects the credibility of MakerDAO by providing an accurate understanding of MakerDAO and clear and consistent messaging.   The unit highlights milestones and provides information in a language that anyone can understand.   As the Maker Foundation dissolves, more information and clarity will be required during this period of change.  The DAO needs a team with ample experience and a proven track record to ensure a smooth transition through coherent communication to the general public and regional communities. The unit will also jumpstart the marketing efforts without delays to further expand the MakerDAO ecosystem. The team consists of individuals that have persistently demonstrated their ability to achieve results.   Core Unit Name Strategic Marcomms Core Unit CPM-001  Mandate Consistent and strategic branding strengthens the name of MakerDAO and creates value. The team filters out the complexity of MakerDAO and makes information easy to digest for our targeted audience. The unit’s expertise in branding and communication is vital for a decentralized organization such as MakerDAO. It increases the visibility of Dai and promotes Dai adoption through the following mandate:  Represent the interests of the MakerDAO community Help target audience understand the benefits of Dai by providing educational content and events Plan, initiate and execute marketing and community activities on behalf of the project Collaborate with other units to achieve objectives identified for MakerDAO Be the point of contact for major media across the globe Facilitate interviews with MakerDAO facilitators and relevant contributors to create value through PR strategies Inherit and manage key social media platforms, MakerDAO’s homepage, and blog Adapt and modify strategy as needed (localization, hypothesis validation discovery, legal climate change, etc.)   Objectives The unit will help MakerDAO grow by  Increasing the awareness of Dai and the Maker Protocol Boosting Dai adoption through promotions and partnerships Addressing marketing and PR-related needs from other core units such as priming potential partners for business development and RWA adoption-related discussions Having an evolving and collaborative mindset to grow with other units and the community   Strategy Based on a SWOT analysis, one can see that even though Dai captures all the advantages of blockchain, its growth has lagged behind centralized stablecoin. Without a more aggressive approach, it could potentially put MakerDAO further behind others. This can be tackled in many fronts, including collaboration of CUs such as RWA, Growth, and this Strategic Marcomms MIP put forward. With Strategic Marcomms, our focus will be on boosting our visibility in jurisdictions where Dai has gained legal status, while seeking ways to expand our PR activities in countries where legality remains in question. Boosting our visibility means a) an increase in marketing and ads spending for channels we identify as key for our targeted audience b) boosting visibility through earned, as well as paid media, utilizing PR agencies Key strategies for our unit include the following:  Lowering the entry barriers for new potential users through hosting events, community building, PR, and educational content Finding narratives that connect with our targeted users and align with their values through storytelling Highlighting benefits that our targeted users deem most valuable through messaging Developing and activating programs that can bolster our marketing initiatives  Target audience groups and key markets:   Target audience  Digital native-generation and crypto users and who haven’t used Dai Individuals in the financial sector and the technology sector who tend to have a basic understanding of the critical components of open finance or DeFi Sectors identified by other facilitators as key to their success such as examples of verticals listed by the Growth Core Unit.    Market and use-case specific  Countries experiencing hyperinflation in regions such as Latin America Region of a large population with mobile, but relatively low number of bank accounts such as Africa Those living in countries with near-zero interest rates such as the EU, Japan Regions with a substantial remittance need such as Southeast Asia and LatAm We can achieve our objectives more quickly through economies of scale in the world’s three biggest economies: the U.S., China, and Japan    The unit is open to evolve with the MakerDAO community and partnership.  Projects and Programs The team plans to tackle the targeted audience by introducing several global-wide programs that are most likely to achieve results. The unit will implement the following initiatives and focus on the marketing channels listed below with several new ideas to be introduced in stage throughout the year: Word-of-Mouth - Dai’s benefits and the story of MakerDAO can be explained more effectively with more credibility when it is from a third-party such as Dai users and partners, and advocates. The unit will pursue and provide opportunities for others to share their experiences. Storytelling - Deliver actual stories on how our global community members use Dai in their life to motivate current and prospective users’ interaction with Dai and Maker. Stories will be conveyed in our blog and/or on podcasts. Scalability - The team plans to introduce programs that enable us to extend our reach effectively.   Ambassador program - Develop and activate a program that can bring scalability to the unit to increase the visibility of Maker and Dai   Translation program - Create and launch a translation program that expands our reach by providing information in more languages identified as key.   Marketing campaigns and advertising - The unit will conduct marketing and advertising campaigns for our target user segments. They include joint marketing campaigns with partners and buying ads on platforms where our target user segments are. The unit takes all marketing or advertising opportunities into consideration. PR - Utilizing earned media, shared media, and owned media adequately   News outlets (earned media) - Identify audiences and key news outlets for the audiences, reach out to those targeted news outlets, and pitch stories when major milestones reached   Social Media (shared media) - Specific content planned and scheduled to share regularly with a targeted audience in each major social media platforms   Blog and other contents (owned media) - Create blog content and utilize platforms such as Podcast, or Clubhouse to gather audience and followers.    Region-Specific Strategy One size doesn’t fit all. In addition to the global strategy, the unit adopts a bottom-up approach to extend our reach in regional markets by adopting the best practices for each market under a shared vision. Targeted regions are in different stages, with unique challenges and opportunities: NORTH AMERICA North America is the most prominent crypto market. Our approach in the region is to increase our visibility through PR activities, collaborating with partners while running advertisement and marketing campaigns. Marketing activities will be planned and executed following the guidelines of U.S. regulation.  Collaborate with blockchain news outlets on finance and technology, utilizing earned and paid media to increase visibility. Run social media ads for educational and informative content to reach more target audiences. Partner with institutions such as universities and blockchain technology labs and sponsoring hackathons to position Maker as a thought leader and educator. Enable meetup pods in the major North American cities in all tech and incubation houses. Sponsor large technology conferences such as SXSW, partnering with various festivals for DAI payments.  SOUTH AMERICA South America has experienced a surge in cryptocurrency usage in the last couple of years. Issues like hyperinflation, low wages, and government policy make stablecoins a necessity and expose market fit as default for the whole region. Marketing campaigns and educational initiatives are needed to help people understand the value proposition of Maker and DAI, and how it could have a positive impact on their ability to store, manage, and spend their savings.  Boost public recognition of DAI in the Region by increasing the audience and reach of our social media channels. Expand our activities by finding ambassadors in other countries where our reach is limited. Boost the use of DAI in the region as a method of exchange and savings by promoting the P2P marketplaces already established (Venezuela, Colombia) and creating new ones (Perú, Chile, Ecuador, Bolivia, Paraguay). Hold Meetups focused on using the tools available for DAI and MakerDAO. Placement of advertising material in specific areas, such as posters and billboards.  EUROPE A very active region with several internationally renowned blockchain hubs with slightly different focuses such as favorable regulations, favorable taxation, high quality financial system, high standards for privacy, rich startup ecosystem, or special concerns on democracy/governance. Europe also boasts many grassroot blockchain-related organizations and highly regarded crypto-native organizations; it also features a growing number of mainstream and government-related entities getting involved in blockchain (universities, startup centers and more).  Our top priority in Europe will be to leverage the local communities for growth in Dai awareness, onboarding and usage. This will be achieved via presentations, classes, courses and workshops. Collaborations, partnerships and an ambassador program will be put in place to supercharge this effort. With relevant organizations and communities from within and outside of the crypto industry. Identify and reach out to audiences and communities that are ripe for crypto adoption. This may include digital natives studying blockchain at university, communities who have a local currency in web2 or paper format, meetup groups focused on fintech, meetup groups focused on tech within minorities (i.e. women who code), meetup groups focused on open source and/or privacy. Targeted marketing and PR campaigns will help reinforce awareness within the communities and audiences identified. Collaboration with language-specific highly regarded crypto public figures. Localizing content, this can include the official website and some other key content. We will prioritize language according to identified hubs and most spoken languages. For instance German is very high on the list as Berlin and Zug are both German speaking. Other languages include Spanish, French and Russian which are some of the world’s most spoken languages.  AFRICA Faced with currency devaluation and high inflation rate, Africa has high demand for financial services like loans, savings/investment and international payments. Our priority and initial marketing focus will be research, exploration and education. The targeted markets initially include Ghana, Nigeria and Kenya as they have been identified preliminary as where the crypto users are.  We can effectively motivate potential users after research identifies where crypto can be used (internet access, mobile) and where partnership makes sense. There’s a need for education regarding money via introductory campaigns and similar initiatives to improve financial literacy and overcome barriers regarding financial services. Our marketing approach will consider the region’s unique infrastructure and leapfrogging development to employ locally relevant and meaningful communication channels and platforms.  NORTH ASIA The North Asian region is a diverse market that consists of some of the biggest markets for MakerDAO: China, Korea, and Japan. For our strategy to be effective, each key market’s approach needs to be specific and tailored to that market. The regulatory landscape regarding crypto also varies widely. While each country has a different culture and languages, the unit’s contributors can create synergies by sharing successful initiatives and resources.  Localize content, including Maker websites, to effectively reach the  audience Manage local social media channels and chatrooms to help potential users understand Boost social media followers such as Twitter and Facebook Combine marketing campaigns with easy-step challenges to make learning easy and interesting Provide local content via mainstream/social media, blogs, on/off-line events, etc.  SOUTHEAST ASIA Southeast Asia has a very diverse cultural and regulatory landscape. Singapore is a significant crypto hub in Japan, with one of the more lax SEA markets for crypto-specific regulations. The focus on the region will be on Vietnam and the Philippines because they are ranked top 10 in global remittance in fiat remittances.  Localize content and increase awareness of MakerDAO and Dai Utilize ambassador program to build and build and strengthen local communities   Approach The list below contains a list of approaches the unit utilizes depending on the needs for each region. Communications/Content  Provide clear messaging and communicate effectively with mainstream media Create value through PR strategies, including earned media from reputable online news outlets, YouTube channels, and podcasts Be the point of contact for the mainstream media  Marketing and Social Media  Conduct marketing campaigns to raise the awareness of Dai Manage the official social media platforms for MakerDAO such as LinkedIn, Twitter, and Facebook Promote latest partnerships with Growth Unit and other teams Coordinate with other core units and the community in promoting Dai  Events  Strategize our event involvement (virtual & in-person) Assess event sponsorship opportunities and commit resources to those aligned with our strategy Personal participation at the most relevant events to represent MakerDAO and strengthen our network Expand offline presence through local events (directly, via partners, or ambassadors) Provide lead generation for Growth or other CUs  Localization  Calibrate our strategy to match the needs, culture, and the stage of Dai awareness in specific regions Use the most popular social media and communication channels to establish and grow local communities and run local campaigns Translate content (video, text, etc.) about MakerDAO in key markets Collaborate with those who share the same vision with MakerDAO, including local institutions, associations, and advocates Identify local passionate and talented MakerDAO supporters and onboard them as ambassadors  Market Research and Analysis  Research and analyze data gathered to gauge the effectiveness of the unit and adjust as needed Gather sentiment around Maker and Dai and convey it to the DAO   Deliverables This unit plans to adopt the Objective-Key-Results (OKRs) approach to achieve its goals. The objectives set for the units will come with a couple of key results that are to be determined as we gain more visibility with the existing data. In order to ensure our unit’s strategy is aligned with other units, the discussions with other core units on identifying their needs will be important in creating our deliverables. Another factor in determining deliverables is team members. As new members of our units are being added, strategies and deliverables will be an ongoing discussion for the first couple of months. Based on our discussion so far, deliverables include, but not limited to the following:  Identify and create value proposition for each key market segments Research and explore opportunities in developing markets in Africa and LatAM where financial services may be lagging Activation of an ambassador program: planning, proof of concept, adjust, implementation Quarterly marketing campaigns and ads   People Individuals on this team come with extensive experience in marketing, PR, communications, and community building. Some of the team members are part of MakerDAO community who have been advocates and contributors in the past years.  Their area of expertise includes outreach through events and marketing campaigns. They have built communities and localized educational content in key markets. Communicating with potential users in the language they speak underscores the spirit of MakerDAO as an inclusive organization. They have effectively shared their knowledge about Maker through various speaking engagements and social media.  Kathleen Chu  Former Bloomberg journalist with years of experience in PR, content, and marketing in the blockchain space Co-Founder of a popular DeFi community called Yasashi DeFi in Japan, and a founding member of Japan DeFi Alliance, an advocacy group Built several communities, including women’s community and the working family community at Bloomberg Tokyo, as well as Japan’s DeFi community Ran a series of marketing campaigns that boosted the traffic to Maker’s homepage and blog in H2 2020 by more than 80 percent Established connections needed to foster collaboration with entities such as BGIN, a blockchain group supported by some regulators, and invited to speak at major government-hosted events such as Finsum  Sahabia Yabuku  Regional ambassador for Maker since August 2019 Top organizer over the life of the MakerDAO community development meetup grant Founder of DeFi Africa - a “for-Impact Organization” that promotes the awareness of DeFi-related technologies in Africa Gave talks about DeFi and MakerDAO in key blockchain and youth empowerment events in Africa. They include Ghana Blockchain Conference 2019, Ghana Youth Ablaze Conference 2019 & 2020, Cryptofest 2020, BEN Africa Kick-off 2020. Organized MakerDAO meetups in more than half a dozen Ghanaian universities, engaged in radio discussions about DAI, published a number of DeFi articles  Kaori Sato  Published more than a dozen of DeFi and blockchain articles as a writer at CoinPost, a Japanese media company with the third-largest number of readers worldwide. Past work has attracted hundreds of retweets and likes on Twitter. Translated Maker’s blog posts since its early rollout in Japan as a freelancer Localized content for Maker, including its homepage, whitepaper, and technical documents  Francesco Alberti  Former reporter, business editor at the Mainichi Daily News, the English language paper published by the Mainichi Shinbun, one of Japan’s leading newspapers Contributing editor to major Asian newspapers such as Chosun Ilbo (S. Korea), Mainichi Shinbun (Japan) , Hindu Business Line (India), The ASEAN Post (Malaysia) Managed Japan’s syndication business for Bloomberg and then managed the Bloomberg Media Distribution group in APAC Produced a supplement in Time Magazine’s Japan edition titled “Spot Japan” Works as an advisor for media-related startups  Strategic Marcomms Budget Facilitator Onboarding ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp4-growth-core-unit-gro-001/6715",
                        "https://www.womenwhocode.com/",
                        "https://www.statista.com/statistics/266808/the-most-spoken-languages-worldwide/",
                        "https://forum.makerdao.com/t/mip40c2-spx-strategic-marcomms-core-unit-budget-framework/7190",
                        "https://forum.makerdao.com/t/mip41c4-facilitator-onboarding/7191",
                        "https://forum.makerdao.com/t/core-unit-mandate-overlap/7210",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-march-28th-2021/7280",
                        "https://forum.makerdao.com/t/maker-relay-ep-38/7249",
                        "https://forum.makerdao.com/t/business-strategy-and-evaluation-framework-for-business-like-core-units/7218",
                        "https://forum.makerdao.com/t/reporting-and-transparency/7233/18",
                        "https://forum.makerdao.com/t/weekly-mips-update-32/7464",
                        "https://forum.makerdao.com/t/mip41c4-sp9-facilitator-onboarding-cpm-001/7191",
                        "https://forum.makerdao.com/t/discussion-press-releases-at-makerdao/8323",
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763",
                        "https://forum.makerdao.com/t/maker-relay-ep-49-en-espanol/8795",
                        "https://forum.makerdao.com/t/makerdao-hiring-proposal/9151/22",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-141-thursday-may-13-17-00-utc/7930/3",
                        "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7951/36",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972/3",
                        "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7951/33",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972",
                        "https://forum.makerdao.com/t/maker-relay-ep-44/7974",
                        "https://forum.makerdao.com/t/maker-governance-review-april-2021/7853",
                        "https://forum.makerdao.com/t/mip40c3-sp9-modify-core-unit-budget-cpm-001/7190",
                        "https://forum.makerdao.com/t/weekly-mips-update-33/7573"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6825807343508075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "5",
                    "time": "25/03/2021-11:21:25",
                    "content": "@Kathleen This is a very necessary initiative, thank you for stepping up. I have only some comments in general to add to your proposal which otherwise looks fine. What I have observed from Maker’s efforts to reach a wider audience is that it so far appears to be more education than marketing. It is rational to the extreme. There is imho already more than sufficient quality Youtube vids explaining Dai and Maker. Also the noise level is so low that you could almost expect Maker to be a sort of secret nightclub where you can only get in if you know where it is. So what I have yet to see is playing to the emotional aspects of crypto and an increase in the volume. Hodled like BTC Petted like Doge Pumped like Nano Stampede evaluation like Uniswap Also I so far miss the megaphone aspect of marketing The influencers The namedropping Covert rumor production General FOMO spraying You might choose to stop right before enlisting ‘Too hot to handle’ celebs but Russian propaganda mills should seriously be considered. Marketing has few rules of engagement and crypto marketing is a total jungle. I hope you make the most of it. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp9-modify-core-unit-budget-cpm-001/7190",
                        "https://forum.makerdao.com/t/call-for-makerdao-facilitators-to-share-a-multisig/7977"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.36228354978355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/03/2021-11:26:36",
                    "content": "Thank you for the proposal, @Kathleen. One point that stands out from a first read-through is the apparent concentration of marketing efforts on Asia. While European, African, and North American countries get lumped into one bag (South America is also missing), we see explicit mentions of China, Japan, and South Korea in the proposal. The current team’s background seems to be supportive of this interpretation as well. Is this something you’re looking to solve with new hires?     Kathleen:  NORTH AMERICA  Marketing activities will be planned and executed following the guidelines of U.S. regulation    Lastly, does this quote mean there’s currently no strategy in place on how to approach one of the major crypto markets? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.173701298701299
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#4",
                    "likes": "2",
                    "time": "25/03/2021-11:39:04",
                    "content": "Thanks for your comment!     Planet_X:  What I have observed from Maker’s efforts to reach a wider audience is that it so far appears to be more education than marketing. It is rational to the extreme. There is imho already more than sufficient quality Youtube vids explaining Dai and Maker. Also the noise level is so low that you could almost expect Maker to be a sort of secret nightclub where you can only get in if you know where it is.   That is a valid point. We will certainly have to consider that when the unit discusses our strategy more thoroughly. And thanks for the suggestions on a number of ways to approach marketing. I haven’t thought of those possibilities. I certainly want to evaluate and assess what can be done to achieve the best results, at the same time, being mindful of MakerDAO’s brand and reputation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.05484693877551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#5",
                    "likes": "3",
                    "time": "25/03/2021-11:45:50",
                    "content": "Elihu, thanks for the great question. Yes, we are looking to hire people in Europe and North America. We are currently in the process of onboarding two people from North America. Having a solid strategy for one of the biggest crypto markets is our priority and it will be updated at a later date. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#6",
                    "likes": "1",
                    "time": "25/03/2021-11:49:06",
                    "content": "Ah I totally forgot - the memes Org a meme competition at 4chan to create an epic burst sewer pipe of irrational content. Beats “explaining” every time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#7",
                    "likes": "1",
                    "time": "25/03/2021-11:55:18",
                    "content": "    Kathleen:  And thanks for the suggestions on a number of ways to approach marketing. I haven’t thought of those possibilities.   Mmm, this seems a bit weird. Have you really never thought about:     Planet_X:  The influencers The namedropping Covert rumor production General FOMO spraying   which is literally what any other crypto (and not just crypto) project is doing? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#8",
                    "likes": "1",
                    "time": "25/03/2021-12:00:35",
                    "content": "I don’t see MakerDAO like any other crypto projects. In fact, we are beyond that. Just because some other people are doing those things, it doesn’t mean we should do the same. We will need to differentiate and that’s how we can tap into new users and markets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.573863636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#9",
                    "likes": "3",
                    "time": "25/03/2021-12:05:42",
                    "content": "    Kathleen:  I don’t see MakerDAO like any other crypto projects. In fact, we are beyond that. Just because some other people are doing those things, it doesn’t mean we should do the same. We will need to differentiate and that’s how we can tap into new users and markets   Thanks. That’s an interesting approach (not sure if everybody agrees with it, but it’s definitely interesting). Following this approach, what are short term (1year) measurable and verifiable objectives that you plan to achieve (in marketing) if the Core Unit is approved and funded? This might help us to appreciate more the value/potential of your approach. Thanks @Kathleen ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.470716783216783
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#10",
                    "likes": "3",
                    "time": "25/03/2021-13:14:52",
                    "content": "    Kathleen:  I don’t see MakerDAO like any other crypto projects. In fact, we are beyond that. Just because some other people are doing those things, it doesn’t mean we should do the same. We will need to differentiate and that’s how we can tap into new users and markets.   Okeeey. I can see more clearly now. I will go as far as to say that if that is your approach I would state that in bold text under the “Core Unit Mandate”. If your strategy is not doing what the bulkmass of crypto is considering normal I would very much have that stated in plain text up front.     iammeeoh:  Following this approach, what are short term (1year) measurable and verifiable objectives that you plan to achieve (in marketing) if the Core Unit is approved and funded?   This. Double. Additionally there is the topic of Core Unit Mandate.     Kathleen:  It increases the visibility of Dai and promotes Dai adoption   You might want to consider renaming your Core Unit to “Dai Education Core Unit”. Because that is what you are planning to do. To me it looks very much the same as the GRO team. Please correct me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.312620957473899
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#11",
                    "likes": "7",
                    "time": "25/03/2021-14:16:06",
                    "content": "I think we have to ask ourselves – do we want Maker to grow into an integral part (if not a backbone) of a global financial system or a project that spews “sewer pipe[s] of irrational content” for the “degen apes”? Remember, everything we do here is not in a vacuum; pumping Maker financial services will draw the eyes of those looking to crack down on the space. Rune and the OGs notably avoided that approach which contributed (in part at least) to the diverse, welcoming, methodical and non-hyperbolic community culture we have today. It’s that deliberate culture that informs everything we do, and if we move away from it, inch-by-degenerate inch, we jeopardize more than “gainz”. #Resistthepump ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.335069444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tomohiro_tagami",
                    "index": "#12",
                    "likes": "3",
                    "time": "25/03/2021-14:17:03",
                    "content": "This initiative is definitely important. Thanks for the suggestion. DeFi remains opaque in many countries around the world. Localization and community outreach is one of the key roles that the Maker Foundation plays, and after the Foundation is dissolved, the position for this role will have to be determined in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#13",
                    "likes": "2",
                    "time": "25/03/2021-14:30:17",
                    "content": "Thanks for your response. My advice would be to update the proposal to reflect this thinking better.     Kathleen:  Elihu, thanks for the great question. Yes, we are looking to hire people in Europe and North America. We are currently in the process of onboarding two people from North America. Having a solid strategy for one of the biggest crypto markets is our priority and it will be updated at a later date.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#14",
                    "likes": "10",
                    "time": "25/03/2021-15:02:35",
                    "content": "Thank you for this detailed description. A more level-headed approach to marketing and communications fits Maker. Someone correct me if I’m wrong, but hyperaggressive strategies favor short-term growth at the cost of our identity 5 years from now. That being said. There are at least 3 areas of communication with audiences that don’t fully overlap:  MKR promotion. Not part of your proposal and, I think, not something Maker wants to do. MakerDAO reputation, especially with institutions. Part of your proposal and matches the way you present yourself. Dai adoption. Part of your proposal. The level-headed approach works, but it is true that > 0 marketing-ish communication would improve things.  Also I’m very much on board with @iammeeoh and @Planet_X re: well-defined objectives with deadlines. Not as success/failure conditions but as helpful concretizations of what you are planning to achieve through the means you’ve detailed in your initial post. edit: What would be incredibly helpful is a down-to-earth summary of your overall understanding of where Maker is in terms of marketing&communication, and of what it needs. Knowing your model of how things are will not only help understanding the reasons behind your plans, but it will also help relate the different growth&communication initiatives to one another so everything can fit together in the end. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#15",
                    "likes": "5",
                    "time": "25/03/2021-15:49:33",
                    "content": "Hello @Kathleen – can you please name some of the successful marketing campaigns that your Team has launched? You know I see folks like FTX buying into the Miami Heat Basketball Arena were I imagine their marketing will be geared towards Americans, and the Team at Solana is making headlines like: OKEx and MXC are pouring $40 million into strategic investment funds to bootstrap development on the Solana network And I often wonder what we as a Community can do to get more traction. So, I guess what I am saying–I really don’t know what accomplishments you and your Team have brought to the DAO–perhaps because the Foundation had to slow down marketing growth, or Regulations are hampering such. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.828703703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#16",
                    "likes": "3",
                    "time": "25/03/2021-23:00:58",
                    "content": "Hey @Planet_X The growth unit mandate is to grow the available distribution channels for the Maker protocol, which means integrating the Maker protocol (Dai, vaults, PSM, DSR, Dai on Optimism L2…) into other’s solutions. It could be by talking with every CEX or DEX to have Dai in different markets (some of these exchanges could decide to list Dai by themselves. With others -most of them- we have to create a joint strategy to generate a Dai market), or by developing use cases where Dai is the right solution for a challenge (like NGOs receiving donations in countries with a regime). In any case, our job is to understand the market, proactively reach out to potential partners, pitch them why Maker is what they need, and in a consultative way, help them to create solutions based on the Maker Protocol. Part of our job is to educate, not because we want everyone to be an expert about how the protocol works, but because we need to show our potential partners why they should choose Maker over other protocols/stablecoins. Growth unit’s focus is on the B2B relationship (with companies, protocols, projects, governments, etc.) and how they can use the Maker protocol to reach more users. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-134-thursday-march-25-17-00-utc/7095/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-31/7232"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7976190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#17",
                    "likes": "1",
                    "time": "26/03/2021-07:59:50",
                    "content": "Thank you for the suggestion. These discussions on the forum enable my team to see things we may overlook as we continue to delve more in-depth into our strategic planning. When it comes to marketing strategy,  there are many possibilities, and each delivers a different level of ROI. That ROI would also vary in one market vs. another. That’s why we listed region-specific strategy as one of the focuses. Several global-wide programs and joint promotions that are most likely to achieve the best results will also be closely examined and considered. Regarding the unit’s performance measurement and deliverables, we have started that discussion last week and hope to finalize that in the next couple of weeks. We may use OKR to set a clear direction for the team and utilize KPI to gauge our performance. I also plan to share quarterly updates on our progress. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#18",
                    "likes": "2",
                    "time": "26/03/2021-08:20:21",
                    "content": "Thanks for the suggestions. As for eduction, it is only part of marketing and promotion. For us, in the crypto space, education can seem redundant and dull, but there’s still a significant knowledge gap between those in the space and the rest. Education is a way to lower that entry barrier so others feel comfortable joining.     Nadia:  Growth unit’s focus is on the B2B relationship (with companies, protocols, projects, governments, etc.) and how they can use the Maker protocol to reach more users.   Adding to what Nadia had explained about her unit, my unit will focus on B2C and convey the benefits of Dai and the Maker Protocol to potential users. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.614583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#19",
                    "likes": "5",
                    "time": "26/03/2021-08:32:49",
                    "content": "    Kathleen:  Thanks for the suggestions.   Thanks for the answers. I am a bit confused on a pretty important point, though. Question: Have you already worked (under the Foundation or not? please specify) on Marketing+Communications for MakerDAO in the last months/years (please specify).  What have you done exactly? → As many people have no idea of what you have done, your action might have been not so visible. If, for instance, some of your candidate Core Unit contributors have appeared in TV talking about MakerDAO in S-Korea, not many people have here have watched the show. Have this TV-appearance brought millions of S-Koreans to MakerDAO? Please inform us on this type of results. What ‘strategy’ have you been following in the past, which can be extended to the future? Sentences like:      Kathleen:  I don’t see MakerDAO like any other crypto projects       Kathleen:  Education is a way to lower that entry barrier so others feel comfortable joining.   suggest that you have a vision/strategy. At the same time, sentences like:     Kathleen:  Several global-wide programs and joint promotions that are most likely to achieve the best results will also be closely examined and considered.       Kathleen:  we have started that discussion last week and hope to finalize that in the next couple of weeks.       Kathleen:  I haven’t thought of those possibilities. I certainly want to evaluate and assess what can be done to achieve the best results   Make me feel like the strategy is not yet determined, or at least is very shaky. So, really, it’s hard to vote on approving (or not) your proposal if we don’t know what great things you have done for MakerDAO in the past and what you plan (precisely) to do in the future. To to contrary, Core Units that have been proposed so far, have a clear record of results that we are more familiar with, and a clearly stated mission for the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.672123015873016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#20",
                    "likes": "3",
                    "time": "26/03/2021-09:55:25",
                    "content": "Hi @flipflopflapdelegate Collaborating with the community will make a big difference, which I have been thinking of as well. One idea is in storytelling. I mentioned briefly as a word-of-mouth type of approach under Projects and Programs. Here are some examples of marketing campaigns that boosted the traffic to Maker’s homepage and blog In Japan. Note that the success has limited to Japan, and it can be easily tweaked for and adopted by the global market. Please also check these hashtags because then you can see how they resonate with people. July 2020 One’s favorite food campaign - one’s favorite food in Japanese is Daikoubutsu. We ran this campaign after the restaurants started to reopen after the first wave of the pandemic. We asked people to show their support for their favorite restaurants by posting pictures of their favorite food on social media and the name of the restaurant and tag to #dai好物 (DAIkoubutsu). The participants got Dai in return. Then we shared how Dai can be used. Results: *1,400% surge of visits to our blog page for the campaign period. *The campaign generated 62.8K impressions on the campaign’s tweets and replies, while #dai好物 had 251K impressions. September 2020 Where’s Dai? (or dokoDAI) This campaign invites people to find or create things that consist of Dai or something that includes dai sound. We ask them to tweet it and tag it to #dokoDAI. After that, as a token of appreciation, we put all the submissions into a mosaic DAI. Results: The hashtag #どこDAI reached at least 160K of Impressions. November 2020 Haikudaikai: We collaborated with the biggest crypto news outlet in Japan and ran a haiku competition. *Number of new sessions/visits to our blog more than doubled\t *The hashtag #俳句DAI会 reached at least 67K of Impressions.     flipflopflapdelegate:  And I often wonder what we as a Community can do to get more traction. So, I guess what I am saying–I really don’t know what accomplishments you and your Team have brought to the DAO–perhaps because the Foundation had to slow down marketing growth, or Regulations are hampering such.   And you are right. We have been very careful in the marketing activities we conduct. A lot of thoughts need to be put into it. While we want to promote, we also have to keep in mind what can be done while guarding the brand and the image of MakerDAO. ",
                    "links": [
                        "https://twitter.com/inquisitivekath/status/1314551514245951496?s=20",
                        "https://twitter.com/search?q=%23%E3%81%A9%E3%81%93Dai&src=typeahead_click&f=live",
                        "https://twitter.com/search?q=%23%E4%BF%B3%E5%8F%A5DAI%E4%BC%9A&src=typed_query&f=live",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972/7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.756352092352093
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#21",
                    "likes": "2",
                    "time": "26/03/2021-10:37:57",
                    "content": "I am currently with the foundation and have been since 2019. In my opinion, when one is overly confident and has answers to everything, that is when you need to worry. Specific strategic approaches for each major regions, and some global programs and projects are listed as clearly as possible in the proposal for this stage. This is just the beginning, and a lot of work needs to be done for sure. As we put a team together, we will need to have more of these critical discussions. I believe that’s how a group can be effective and fulfill its mandate. We hope to share more later when we formally submit the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.109375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#22",
                    "likes": "2",
                    "time": "26/03/2021-10:49:08",
                    "content": "    Kathleen:  I am currently with the foundation and have been since 2019. In my opinion, when one is overly confident and has answers to everything, that is when you need to worry.   Thanks @Kathleen for the direct answers and for clarifying explicitly that:     Kathleen:  Specific strategic approaches for each major regions, and some global programs and projects are listed as clearly as possible in the proposal   Fair enough. As a constructive feedback, and on a very personal note (and possibly very blind and shortsighted) I will personally vote against this Core Unit proposal as I find it not up to (and in fact far from) the standards required. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.361607142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#23",
                    "likes": "6",
                    "time": "26/03/2021-14:22:30",
                    "content": "On the other hand, Kathleen, I found your proposal to be measured and consistent and refreshing in light of the usual hyperbolic and “Instagram/Tik Tok/4 Chan” fleeting social media approach that others so often adopt. Looking forward to seeing what your team can do in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5773809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctrlaltf",
                    "index": "#24",
                    "likes": "1",
                    "time": "31/03/2021-16:10:22",
                    "content": "For clarity purposes and community response. The questions:   Why is North America not detailed more?   Why isn’t Central and South America mentioned?   North America plan is being detailed due to the extent of the continent and how will the strategy be partly be put in place: 2 countries, west coast and east coast approach.  Additionally connected to Central and South America activities. The team will be greater than for other countries, but all teams remain funneled and pipelined together as well.   Central and South American haven’t been mentioned here because these regions are well taken care of already. They will be integrated in the North America plan as part of the bigger picture of The Americas.   Additionally, I’d like to add a point that for solid growth within the space, activities have to be well thought out and structured, the community very well want to “receive” NFTs for their participation or create memes. You’ll be more than welcome to have fun with us, but for a company to grow and remain Tier 1, these “fun” actions aren’t enough and don’t build a whole global wide foundations for longterm. That is why it wasn’t mentioned specifically in the Marcomm proposal. These will be subparts of the higher-level activities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctrlaltf",
                    "index": "#25",
                    "likes": "1",
                    "time": "31/03/2021-16:16:36",
                    "content": "Yes, yes and yes! A proposal that is sound and concise and professional. It is refreshing around the meme-hype in the space, which is fun, but really isn’t all! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#26",
                    "likes": "5",
                    "time": "03/04/2021-09:42:29",
                    "content": "I have to say, I’m pretty stunned at the “We need more memes and Russian propaganda farms” approach to marketing advice. Yes, this is crypto and yes, “everyone else” is doing it. But quite aside from Maker being positioned (so far) as a best-practice leader in the space in every respect, do we think shady marketing is going to be sustainable? Last cycle saw some major casualties as regulators caught up with DeFi projects that had taken a lowest common denominator approach to marketing. This time it will be 10x as DeFi goes mainstream. When the dust settles, I’d prefer it if MakerDAO was on the right side of history for this one. So I think this proposal gets that exactly right. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.379058441558442
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#27",
                    "likes": "0",
                    "time": "03/04/2021-10:47:50",
                    "content": "I frankly think that with     Cassius:  I’m pretty stunned at the “We need more memes and Russian propaganda farms” approach to marketing advice.   you are misquoting a portion of a much more involved post of @Planet_X     Planet_X:  but Russian propaganda mills should seriously be considered.   to the extent that I wonder if you are doing it with intellectual honesty. (Edit: @Cassius, incidentally this is your first post in the forum). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.633333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#28",
                    "likes": "2",
                    "time": "03/04/2021-11:51:02",
                    "content": "One of my posts has to be the first. This was something I felt it worth discussing. I dare say you’ll draw your own conclusions about my intellectual honesty as I post more over time. For now, let’s short circuit the specifics and look at the broad point. I see the regulatory and business landscape for DeFi is changing, and am concerned that marketing should strike the right tone to put MakerDAO in the best possible position for the future. That’s the headline. As Rabbi Hillel said, “The rest is commentary”. Ed: it was, of course, Hillel, not Gamaliel. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.499188311688312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#29",
                    "likes": "2",
                    "time": "03/04/2021-12:33:47",
                    "content": "    iammeeoh:  to the extent that I wonder if you are doing it with intellectual honesty. (Edit: @Cassius, incidentally this is your first post in the forum).   Let us not use this kind of tone. It is completely fine to agree to disagree, and I am OK with the fact that you won’t be voting for this proposal. However, when the language of mistrust is used, it doesn’t get us, the community, anywhere. I see that you feel the need to protect and guard MakerDAO which shows that you care MakerDAO enough to do what you do. Still, I am concerned the mistrustful and cynical tone you have been using isn’t appreciated, nor adding any value. Let us stay focus on the common goal we are trying to achieve. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7592592592592595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#30",
                    "likes": "0",
                    "time": "03/04/2021-12:46:13",
                    "content": "    Kathleen:  Still, I am concerned the mistrustful and cynical tone you have been using isn’t appreciated, nor adding any value.   I agree to disagree with your assessments about value and tone. If somebody (@Cassius in this case) with 0-posts and “5 min reading time on the forum” (at the time of my answer) misquotes and significantly alters the spirit of a more involved earlier post, I feel free to express my doubts.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#31",
                    "likes": "2",
                    "time": "03/04/2021-13:04:14",
                    "content": "    iammeeoh:  I agree to disagree with your assessments about value and tone.   I am glad we agree on one thing. I could see why you felt the need to make things clear. As for me, I didn’t think the comment was anything personal, and it’s fine that you saw it differently. Regarding the tone, I believe that the MakerDAO community will continue to grow, and as more people join the community, they will observe the language used in these discussions. If the tone is hostile (Not saying you are using that tone), it could turn people away and discourage them from voicing their opinions. Maybe I am naive, but I believe everyone’s voice matters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8690476190476195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#32",
                    "likes": "1",
                    "time": "03/04/2021-13:12:49",
                    "content": "    Kathleen:  I am glad we agree on one thing.   I feel you have taken me as an adversary, or somebody who is against you or your CU  To the contrary. I am happy you have put forward a CU proposal like this: it took time, energies, etc. Also, I am grateful for the work you have done so far under the foundation. My criticism were always constructive and, I believe, polite. I have asked you questions, you gave some answers, and I made up my opinion. If I will not vote for your proposal, It doesn’t mean I disagree with you on everything. Or that I am cynical.     Kathleen:  If the tone is hostile (Not saying you are using that tone)   Thanks. I agree that my tone was/is not hostile. Keep up the good work! And good luck with your proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4140625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#33",
                    "likes": "2",
                    "time": "03/04/2021-13:36:43",
                    "content": "In terms of what I quoted/paraphrased for the sake of a summary, I think it was actually fairly restrained and representative. My point stands: “Rumor… FOMO… pumping… namedropping” are a recipe for disaster. Witness the SEC’s interest in Musk just for tweeting about Bitcoin/Dogecoin. Or the case against Ripple. I would consider that a short-term and dangerous strategy, while I consider this proposal measured and professional.     iammeeoh:  with 0-posts and “5 min reading time on the forum”   New forum account but, to quote Jagger this time: I’ve been around for a long, long year. Not that it should matter. The point is either worth addressing on its own merits, or it’s not. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.575757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#34",
                    "likes": "7",
                    "time": "03/04/2021-13:42:10",
                    "content": "My only constructive feedback would be to focus on the demographics of DAI users that will get you the most “bang for your buck”. Your strategy at the moment seems to be targeting every venue under the sun and at this nascent stage of global development this might not be the right approach. Focusing on the potential clients that will bring you 80% of DAI demand versus a “spray and pray” approach might be wise. As one of the main DeFi target audience for now (white male in his 30s), I would maybe suggest you focus your attention on continuing to grow this market %. North America, Europe, and Asia are where most of the demand is coming from right now, and while long term and noble a goal it is to focus on future potential markets I’m not sure that is worth the investment at this time. I guess what I’m trying to say here is, try to narrow your scope in order to make the largest impact. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.788359788359788
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#35",
                    "likes": "5",
                    "time": "03/04/2021-16:27:34",
                    "content": "Hi @Cassius and welcome to the forum, You have somehow concluded that I am proposing practices that are illegal in certain jurisdictions. This is not the case. (OK maybe     Planet_X:  Covert rumor production   was a bit of a stretch. Consider it brainstorming. What I am saying is that using emotional means to reach and hold the attention of people can be highly effective. There is no denying that good crypto is hodled long and lovingly, petted and codled,  shielded against critics and rooted for like a sports team. Should we achieve the same for DAI and MKR it would be incredible. Making emotional arguments is not     Cassius:  shady marketing   it is a vital part of the human experience.  And therefore popular. And what is wrong with memes? Memes are a highly effective method of communicating, combining art and humor to get the message across.     Cassius:  Russian propaganda farms   RT (for example) has a ton of viewers, they are probably dirt cheap and you do not have to do anything illegal. If it is aired in a jurisdiction where it is legal, it is reasonably to assume Youtube and the financial-independent-retire-early squad will handle the rest of the distribution for you. So aired somewhere, distributed everywhere.     Cassius:  Last cycle saw some major casualties as regulators caught up with DeFi projects that had taken a lowest common denominator approach to marketing.   Yes. However, I would be inclined to think selling tokens to US non-accredited investors while being a US based company, a blatant breach of the Howey test, was more important. Other countries have other rules.     Cassius:  “Rumor… FOMO… pumping… namedropping” are a recipe for disaster.   Nah. Only if you do something illegal. And we are not going to do that. I am not a marketing guy myself. I could not sell icecream in Sahara. Marcomms strategy of not playing to emotions could possibly be the right choice for Maker, I don’t know. But I am observing that groups sometimes use emotional marketing to great effect, and I am asking why Maker is not considering this. Back in 2014 what was the first thing I ever heard about Litecoin? “Bitcoin is gold, Litecoin is silver”. Still memorable. What changes did they make to the hashing algoritm?  I bet very few people either knows or cares. NB. @Cassius please stick around - I love a good discussion. And @iammeeoh is a total darling after a few posts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.698177083333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sahabia",
                    "index": "#36",
                    "likes": "7",
                    "time": "03/04/2021-18:18:45",
                    "content": "@Aaron_Bartsch you made a valid point, limiting scope is important but, I don’t think it’s a good idea to omit Africa when you’re talking about “potential clients” for Dai usage. Also, just hearing this for the first time from you, “DeFi main target audience for now is white male in his 30s”? . If you’re right on this, then I beg to differ, that is a wrong target! Infact, MakerDAO is on a global growth-path to solve the fundamental problems of every place that deem necessary. Especially with the existing monetary system, which the African region is not fit for purpose. I believe that, with the right promotion, no other place can achieve higher demand for Dai than Africa. This is a continent that still has a lot of broken financial systems that can potentially be solved by Dai. While crypto looks like a luxury for other places, it’s a lifeline for Africans. Africans using traditional currencies are often faced with high transaction costs, inflation and currency devaluations, exorbitant interest rates and high levels of fraud. Coupled with all this - accessing the existing system (despite the fact that many have a mobile phone and conduct other elements of their lives online) is still incredibly restrictive. This has in turn led to a lack of financial inclusion and huge unbanked deposits in the region, which does not help Africans and severely hampers economic growth and financial freedom in this region. For Africans, DAI will be life changing for many millions here. The main barrier has been the lack of effective education, which this unit intends to provide. For the huge unbanked population and those that lose out every time they deal with the existing financial services sector, Dai can provide them a better way of moving, storing and exchanging value. MakerDAO is at the forefront of bringing this inevitable change to Africa in a responsible way with a unit like the Strategic Marcom Unit. We can’t therefore be looking to make the largest impact, when we neglect other regions such as Africa. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.669178281068525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#37",
                    "likes": "2",
                    "time": "03/04/2021-18:26:07",
                    "content": "Thanks for the response @Sahabia. Perhaps I live in my own bubble on crypto twitter but most of the DeFi founders and whales that aren’t pepe frogs or mooncats that I see are predominantly of the demographic I described. That is not to say that Africa will not play an enormous role in the future, I was merely trying to illustrate the objective reality that I see to focus on those with the most capital/access to the current paradigm. I am happy to be wrong in my assessment of the current landscape and do truly look forward to MakerDAO having a more prominent global outreach to every demographic and empowering the lives of every individual. My only point (perhaps naively) was to ensure a strong North American strategy (because you don’t have one right now, which is kind of shocking to be honest) as I believe in the short term will bear the most fruit. P.S. Your mandate is ambitious (perhaps a bit too, hence my posts) and I wish you all the best. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.880243319898493
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#38",
                    "likes": "5",
                    "time": "03/04/2021-18:59:03",
                    "content": "    Aaron_Bartsch:  As one of the main DeFi target audience for now (white male in his 30s)   On my end, I would be bullish on Asia businesses. No more data to back that but a gut feeling and some anecdotal evidence. Quite sure we can settle on the side that we don’t know much  @Sahabia can you give us what is the unique value proposition for DAI in Africa? What is the market size you want to achieve in one year and how? I fully agree that Africa is the future. But I follow Jumia and see how they have difficulties growing there. After many years, a big brand presence, and a strong investment, Jumia Pay is around $200M transaction annually. Not sure how that would compare to DAI inventory but it’s hard to get excited. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.58611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Guy",
                    "index": "#40",
                    "likes": "4",
                    "time": "03/04/2021-19:38:26",
                    "content": "Thanks @Planet_X I absolutely agree that marketing should resonate on the emotional level as well as being informative/educational. Memes, humour, pithy slogans (like “digital silver”) etc are an important part of that. The issue I have is that so much crypto marketing is hype with no substance. In the worst cases, of which there are many, it is downright misleading. Having been involved in crypto (and crypto marketing) for several years like you, I’ve seen too much of that, from Paycoin/Onecoin kind of stuff down to less overtly dishonest but still frankly lacking in integrity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.242063492063492
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Guy",
                    "index": "#41",
                    "likes": "2",
                    "time": "03/04/2021-19:44:20",
                    "content": "    SebVentures:  Jumia Pay is around $200M transaction annually   I’m not familiar with Jumia but M-Pesa has about $20 billion per month transaction volumes. Isn’t that a more obvious competitor/precedent? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sahabia",
                    "index": "#42",
                    "likes": "5",
                    "time": "03/04/2021-21:22:58",
                    "content": "    SebVentures:  @Sahabia can you give us what is the unique value proposition for DAI in Africa? What is the market size you want to achieve in one year and how? I fully agree that Africa is the future. But I follow Jumia and see how they have difficulties growing there. After many years, a big brand presence, and a strong investment, Jumia Pay is around $200M transaction annually. Not sure how that would compare to DAI inventory but it’s hard to get excited.   Sure. I think my earlier comment mentioned some primary value propositions for Dai in Africa. I expect that the following will further answer your question. The unique value proposition of Dai in Africa is that it enables the storage and transfer of economic value devoid of extreme volatility, geopolitical restrictions within African nations, and censorship. Though other stablecoins exist, not all can offer these benefits. Specific instances of this broad value proposition include, among many other use cases, highly secure storage of value, financial inclusion, cross-border remittances, and a better investment opportunity. The entire market size for crypto is still nascent, especially in Africa, this presents a chance for us to penetrate well. In line with the core unit mandate, I hope to cover at least 20% of the market size with the word of Dai in a year, imbibing their attention with Dai and increasing adoption. This is possible with the unit’s broad strategy of adopting the best approaches most likely to achieve results. They include, events, PR programs - news outlets, social media, blog etc. word of mouth and intensive local activism. With the issue of Jumia pay, that’s a different service platform with different value propositions to Dai imo. This platform works under the legacy financial system and competes with big telecom companies like MTN, Vodafone and Tigocash which all provide similar services like mobile money, paying for bills, airtime etc. Of course, their transaction magnitude is tied to how well they compete with these companies. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.597560975609756
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#43",
                    "likes": "1",
                    "time": "05/04/2021-01:34:45",
                    "content": "FWIW, Cassius touches on a wise point — marketing is and continues to be a focal point of SEC enforcement actions across the space (you can read about how they analyze marketing in the digital asset framework). I agree with Cassius that the we likely won’t see action against well-known DeFi protocols in the near-term though that will come with time in some form or fashion. I’m not a marketing person but I think for those interested in this or a similar CU, they should heed caution and avoid the sugar rush highs of the latest gimmick (be it cute Japanese ghosts or borderline Hentai). Ensuring long-term survival of Maker is paramount. If you choose to sail upon the seas of DeFi, build your protocol as you would your boat, with the strength to sail safely through any storm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.113636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#44",
                    "likes": "4",
                    "time": "05/04/2021-06:14:17",
                    "content": "Yes, Asian market is quite big for DeFi including Dai. I can’t share the details  but articles like this where Rune mentioned China is the largest user of CDP (now vault) based on IP indeed shows that it’s big. 메이커다오 CEO “메이커다오 CDP 최대 이용자는 중국인” - 토큰포스트 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#45",
                    "likes": "3",
                    "time": "05/04/2021-06:31:43",
                    "content": "Thanks @Doo Rune has also shared his views on Asia’s potentials in an interview with Bloomberg in Tokyo a while back. It was one of the first interviews with a major news outlet.     ",
                    "links": [
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972/7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.640625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#46",
                    "likes": "2",
                    "time": "09/04/2021-12:10:35",
                    "content": "    swakya:  edit: What would be incredibly helpful is a down-to-earth summary of your overall understanding of where Maker is in terms of marketing&communication, and of what it needs. Knowing your model of how things are will not only help understanding the reasons behind your plans, but it will also help relate the different growth&communication initiatives to one another so everything can fit together in the end.   Yes. Let me share it here. Maker is well known in the crypto space. That has brought our focus to reaching out to new users  in the past couple of years. The visits to our homepage gained 34 percent and new users accounted for a third in 2020. (That’s as much as I can share regarding data.) It is achieved through community building, educational events, and various marketing channels including content, social media, marketing campaigns, and partnerships. Our well established track record and reputation, in addition to PR activities, were vital when it comes to media coverage by crypto media and traditional media. However, due to regulatory uncertainties in some jurisdictions, the global marketing plan faced some challenges in implementation. All the marketing activities were pursued with awareness of the regulatory environment and in a legally conservative way. I expect those challenges to remain even after the foundation is dissolved. That is why about 10 percent of our budget has been allocated to legal consultation. We need to have a team that understands both the opportunities and challenges we face. Based on a SWOT analysis we have put together, one can see that even though Dai captures all the advantages of blockchain, its growth has lagged behind centralized stablecoin. Without a more aggressive approach, it could potentially put us further behind others. This can be tackled in many fronts, including collaboration of CUs such as RWA, Growth, and this Strategic Marcomms MIP put forward. With Strategic Marcomms CU, our focus will be on becoming more active in jurisdictions where Dai has gained legal status, while seeking ways to expand our PR activities in countries where legality remains in question. Boosting our visibility while navigating the complexity will be our main focus. Being more active means  An increase in marketing and ads spending for channels we identify as key for our targeted audience Boosting visibility through earned, as well as paid media, utilizing PR agencies  Putting regional specifics aside, key strategy for our unit will include the following:  Finding narratives that connect with our targeted users and align with their values through branding, content, PR, and messaging (social media, ads) Highlighting benefits that our targeted users deem most important and valuable through events, content, and messaging Lowering the entry barriers for new potential users by hosting events, community building, PR, and educational content  ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-35/7962",
                        "https://forum.makerdao.com/t/mips-update-36/8125"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.564041578576462
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#47",
                    "likes": "1",
                    "time": "09/04/2021-12:32:36",
                    "content": "    iammeeoh:  What ‘strategy’ have you been following in the past, which can be extended to the future?   The strategy I have chosen for the market I cover includes:  Increasing the awareness of MakerDAO, Dai and DeFi through educational content and meetups. Engaging conversations with regulators. Conducting marketing campaigns on social media that connect with people.  In the case of Japan, social media such as Twitter is the place to be for Japanese crypto users, and running campaigns on such a platform means that anyone can easily participate and connect on an emotional level. Another example is community building. Others on the team, including Sahabia, are long-term community members passionate about MakerDAO. That shows in the way they build their communities from the ground up by running workshops and educational events, in addition to managing chatrooms on different platforms. (A couple of team members prefer to be anonymous till the unit is voted in.) Those are just a couple of examples. The strategy has to be adjusted depending on the legal climate and how well Maker is known for regions where we expect higher growth and ROI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4558823529411775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#48",
                    "likes": "2",
                    "time": "09/04/2021-12:33:14",
                    "content": "So if there’s anything I can help with in the N American market, either in just raising the profile of Maker or even specific use cases, let me know. I feel the tax advantages of borrowing against appreciated crypto holdings via DAI vaults should not be ignored, as it doesn’t trigger a taxable event for those holding those assets — at least in the US. It seems like a good way to compete with exchanges that are heavily pushing the ability to borrow in USD against BTC. Skipping some transaction fees by borrowing in DAI may or may not present an advantage for high net worth holders of crypto ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.430000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#49",
                    "likes": "1",
                    "time": "09/04/2021-13:11:51",
                    "content": "Tax plays such a big part in the decision-making process. How do you think we can increase the awareness of the tax benefit? And yes, I will reach out to run some ideas with you for the North American market. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#50",
                    "likes": "1",
                    "time": "09/04/2021-13:24:44",
                    "content": "So I would double check with an accountant or tax attorney to ensure there’s no crypto-specific land mine out there. But generally speaking, someone selling a portion of BTC or other crypto asset would be subject to capital gains, even if they wanted to sell it for DAI and not USD. It’s a paperwork nightmare, quite frankly, as you have to figure out your cost basis on the specific portion of BTC/whatever you are selling. Alternatively, you can access that liquidity by taking a loan against it. If that loan is for more investment within crypto, why not borrow DAI instead of USD that will then need to be converted again to crypto? The ability to possibly cut out a transaction fee by staying on the chain (asset—>DAI—->investment vs asset—->USD—->investment) coupled with a way to more privately monitor the collateralization of your loan may present a way to grab a piece of this market where exchanges are pushing people to pawn their BTC and ETH for loans. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.379166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#51",
                    "likes": "1",
                    "time": "09/04/2021-14:38:51",
                    "content": "This is and a very powerful message and real-world use case. Drawing down on your crypto reserves to buy new assets has the potential to simplify and reduce your tax. Just like giving appreciated crypto can be tax efficient. (This is not tax advice, etc) I feel that some simple written/video resources (with all the necessary disclaimers and legal advice) would be hugely valuable. How many people don’t know what @PaperImperium describes above? How many people would act differently if they did? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.834926184926185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#52",
                    "likes": "0",
                    "time": "09/04/2021-15:43:18",
                    "content": "I mean, April is Financial Literacy Month. Seems like a good time to get the message out ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.645833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#53",
                    "likes": "2",
                    "time": "10/04/2021-09:05:00",
                    "content": "    Kathleen:  The visits to our homepage gained 34 percent and new users accounted for a third in 2020. (That’s as much as I can share regarding data.)   Is it possible to have a Google Analytics report? visits trends, most read pages, geography, acquisition channels, … (another one for Oasis would be awesome but not sure it’s enabled). That would help a lot to shape the discussion on the forum (not even thinking about marketing here). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.133116883116884
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#54",
                    "likes": "1",
                    "time": "10/04/2021-15:35:13",
                    "content": "    Kathleen:  The strategy I have chosen for the market I cover includes:   Does this mean that Marcomms as a unit does not have a strategy document? The world has 7.6 billion people. You obviously can’t talk to all of them. Who does Marcomms prioritize? Who are not prioritized? And why? And what was the framework given to you by the foundation? How about the framework from Legal? Can you talk about that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#55",
                    "likes": "3",
                    "time": "10/04/2021-20:23:17",
                    "content": "Out of curiosity, what share of the remittance market does DAI have? I’d think we’d be perfect for that, with the only fees being gas and local currency conversion. It would tie a lot of markets together, too — with N Am and Europe adopting so they can send to Lat Am, Africa, Philippines, India, etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#56",
                    "likes": "0",
                    "time": "12/04/2021-13:03:15",
                    "content": "    SebVentures:  Is it possible to have a Google Analytics report? visits trends, most read pages, geography, acquisition channels, … (another one for Oasis would be awesome but not sure it’s enabled). That would help a lot to shape the discussion on the forum (not even thinking about marketing here).   That’d make sense for the facilitators after some units are voted in and the foundation hands over the responsibilities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#57",
                    "likes": "2",
                    "time": "12/04/2021-13:10:29",
                    "content": "    Planet_X:  Does this mean that Marcomms as a unit does not have a strategy document? The world has 7.6 billion people. You obviously can’t talk to all of them. Who does Marcomms prioritize? Who are not prioritized? And why?   The unit has several working documents, and strategic planning is one of them. I would be more than happy to go over the strategy more in detail when I present them during a community call. A majority of key markets that we should focus on have already been included in the proposal. We plan to modify the proposal to address and clarify some great points raised by you and some others in the community. Here are more detailed answers for your questions: Target audience groups:   Crypto users who haven’t used Dai   Those in the financial sector and the technology sector with a basic understanding of the critical components of open finance or DeFi   Target market:   Region experiencing hyperinflation in their countries such as LATAM   Region of a large population with mobile, but no bank account such as Africa   Those living in countries with near-zero interest rates such as the euro-zone and Japan   Regions with a substantial remittance need such as Southeast Asia and LATAM   The world’s three-biggest economies where we can gain the advantage of economies of scale can be achieved more effectively: the U.S., China, and Japan       Planet_X:  And what was the framework given to you by the foundation?   Regarding the framework given by the foundation, I don’t have the authority to talk about that. If you like to hear what I have done, then I would be more than happy to share. I believe I have also provided some highlights of my work already. Keep in mind that I am submitting this proposal as part of a community member who is keen to contribute, not as someone representing the foundation.     Planet_X:  How about the framework from Legal? Can you talk about that?   I am afraid I can’t speak on behalf of Legal. There are many things I have learned as a former financial journalist and as a marketer. I understand that we must set aside a budget for legal to ensure that what we do is legally sound.     PaperImperium:  Out of curiosity, what share of the remittance market does DAI have? I’d think we’d be perfect for that, with the only fees being gas and local currency conversion. It would tie a lot of markets together, too — with N Am and Europe adopting so they can send to Lat Am, Africa, Philippines, India, etc.   There is no such data available, but utilizing major use cases would be the way to go indeed.     Cassius:  I feel that some simple written/video resources (with all the necessary disclaimers and legal advice) would be hugely valuable. How many people don’t know what @PaperImperium describes above? How many people would act differently if they did?   Indeed. I agree. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.061335403726709
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#58",
                    "likes": "3",
                    "time": "20/04/2021-05:10:13",
                    "content": "Hi all. I have updated our proposal to address some of the suggestions and concerns by the community. We have added the following:  Objectives Global strategy Strategy for North and South America Target audiences and markets Deliverables  We have also consolidated North Asia coverage and taken out the Middle East due to a lack of visibility on the market. We aim to formerly submit the proposal on May 5th. Thank you for all your valuable input and your feedback and questions will be appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#59",
                    "likes": "3",
                    "time": "20/04/2021-17:28:35",
                    "content": "With a clear end goal you have a much better chance of success and likely to win over those skeptical of your intentions. I look forward to see what you come up with. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#60",
                    "likes": "4",
                    "time": "24/04/2021-18:44:37",
                    "content": "So I’m a little late to the conversation, but could you elaborate more on:   What easily measured deliverables is this CU designed to provide? Awareness, social media engagement, and availability for media contact are all things that aren’t easy to measure in terms of output and actual impact. Will there be a reported number of deals with some entities that will also have a measured impact in terms of DAI transactions or volume?   Who is the target audience? My understanding is that Growth is targeting integrations (not to say you couldn’t as well). Marcomms is targeting… people we want to open vaults? Integrations to accept DAI? Mid-stream “distributors” like Instadapp or DeFiSaver that push our product for us? Who exactly is the focus?   For PR and media contact, where is the “vision” going to come from so that we stay on message. There’s a certain tension between Maker-to-democratize-finance message and the Maker-as-central-bank/DAI-as-a-building-block message. How do those get resolved when someone from the media presses us for an “official” statement?   Thanks in advance! Maybe I missed the answers to these, since I know there’s been lots of discussion already and I’m kind of coming in at the end. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.048763736263735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#61",
                    "likes": "1",
                    "time": "26/04/2021-08:59:50",
                    "content": "Thanks for your questions @PaperImperium. I appreciate your interest in finding out more about our unit. About easily measured deliverables, you have raised a good point. Let me explain how we plan to tackle that issue. Our unit utilizes a set of OKRs, which is an objective-focused method accompanying key results to help us to focus on what really matters. As listed in the proposal, two top objectives for the Strategic Marcomms unit are to 1) increase the awareness of Dai and the Maker Protocol and 2) boost Dai adoption through promotions and partnerships. To achieve the above objectives, we focus on the customer journey from Awareness, Interest, Desire to Action. We track key results in each stage of the journey, such as page views from earned or paid media, growth of visits to websites and blogs, social media, and marketing campaign engagement. The timing of an increase in traffic is one way to see the effect of our activities. For example, we can measure the outcome by looking at the correlation between the timing of a marketing campaign and an increase in website visits. There are other ways to measure the impact such as URL tracking. In addition to the deliverables we have listed in the proposal, a number of key results will be considered and set once the team gets a chance to access and evaluate the historical data of MakerDAO’s homepage and blog. Regarding the unit’s target audience, we have identified them, as well as key markets in our updated proposal. Please have a look and let us know what you think. Basically, our target audience is mainly potential users who are likely to use DAI and the Maker Protocol to protect their assets or earn interest rates. As a marketing unit, we will also work with other units such as the Growth unit or the RWA unit in helping them to achieve their goals by increasing the visibility of Dai and the Maker protocol among potential partners, so that when the teams approach these prospects for partnership or collaboration discussions, they already know who we are. As to your question on PR and media, like you have mentioned, the topic of vision is still in discussion. Our unit, consisting of members with PR or journalism background who understand the organization’s current status, is best to communicate that clearly to the media when being pressed for comment. Regarding media inquiries, our unit will ensure they speak to the right facilitator or community member involved depending on the topics. The PR component of the unit also focuses on messaging, value proposition, trend research, and media training. ",
                    "links": [
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.731227106227106
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#62",
                    "likes": "7",
                    "time": "04/05/2021-03:41:40",
                    "content": "Formally submitting this MIP for the May Governance Cycle ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#63",
                    "likes": "1",
                    "time": "04/05/2021-12:19:59",
                    "content": "Many successes to all! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daniel_Ballesteros",
                    "index": "#64",
                    "likes": "0",
                    "time": "07/05/2021-12:21:03",
                    "content": "I think celebrity marketing is really good, in every continent,  and sure it would be on de Marketing CU plans! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#65",
                    "likes": "3",
                    "time": "10/05/2021-17:42:07",
                    "content": "Linking an important discussion about this MIP that’s currently ongoing here: [Campaigning] Vote NO on \"Inclusion Poll for Strategic Marcomms Core Unit MIP Set - May 10, 2021\" MKR holders voting on the upcoming executive - please do give this a look before making your decision. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#66",
                    "likes": "9",
                    "time": "10/05/2021-20:36:54",
                    "content": "For the sake of balance, let’s put this here too: [CAMPAIGN: MIP39c2-SP9] Vote YES on “Inclusion Poll for Strategic Marcomms Core Unit MIP Set – May 10, 2021.” - #3 by Alefcripto ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AdrienDLT",
                    "index": "#67",
                    "likes": "0",
                    "time": "11/05/2021-16:00:04",
                    "content": "Related to the “B2C vs B2B strategy” and “regional strategy”:  Screenshot 2021-05-12 at 00.13.531826×1616 485 KB  source: Business strategy and evaluation framework for Business-like Core Units - #6 by g_dip ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "3398"
}