{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dicu-dai-mkr-datasets-web-app-showcase/15497",
            "title": "DICU: DAI & MKR datasets web-app showcase ",
            "index": 15497,
            "category": [
                "Core Units",
                "Data Insights"
            ],
            "tags": [
                "data",
                "din-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#1",
                    "likes": "10",
                    "time": "31/05/2022-21:21:43",
                    "content": "Hi everyone  We have built (and tested ) 4 distinct datasets focused on the Maker tokens, DAI and MKR. We have both the historical transfers and historical balances. We are taking a slightly different approach this time around and instead of first publishing it via the Data API, we have built a rather simple web-app for people to explore. Our main objective with this web-app is to showcase what it means when we say “dataset”, to have something more concrete than an API endpoint for people to engage with, to hopefully spark ideas of what can be built with them. We will soon be publishing the datasets via the Data API, Snowflake Marketplace and can make it available through Google Sheets upon request. If you find the web app useful we’ll be happy to improve it. Note: we are currently working to solve issues with certain MKR Uniswap pools  DICU Maker Token Explorer (Heroku version)  Screenshot 2022-05-31 at 8.58.01 PM923×666 58.7 KB  ",
                    "links": [
                        "https://token-transfer-explorer.herokuapp.com/",
                        "https://forum.makerdao.com/t/dicu-monthly-updates-thread/14960/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.026984126984127
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "08/06/2022-00:22:02",
                    "content": "    tadeo:  4 distinct datasets focused on the Maker tokens, DAI and MKR.   Having trouble opening the Streamlit link, but with regards to datasets, would it be possible to create one based on the DAI/USDC PSM to get a better understanding of the behavioral output users are incurring when minting DAI? TOL here, but is it possible to label eth addresses of large whales with Anon names like “Institutional One”, “Whale Six”, etc., or their ENS (assuming they have opted for one). This way it’s a bit easier to follow. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#3",
                    "likes": "2",
                    "time": "08/06/2022-10:28:25",
                    "content": "    flipflopflapdelegate:  Having trouble opening the Streamlit link   We noticed the Streamlit Cloud version is a bit unstable, we’ve added a Heroku version that seems to be working better. Let me know if you encounter problems with it.     flipflopflapdelegate:  would it be possible to create one based on the DAI/USDC PSM to get a better understanding of the behavioral output users are incurring when minting DAI?   This is a good point, we can add an address filter to select the PSM-USDC transfers. This would only show the DAI transfers, ignoring the USDC transfers and any other actions with other protocols (e.g. arbitrage trade where they deposit in Aave in addition to swapping through the PSM). Would this still give you all the necessary information?     flipflopflapdelegate:  TOL here, but is it possible to label eth addresses of large whales with Anon names like “Institutional One”, “Whale Six”, etc., or their ENS (assuming they have opted for one). This way it’s a bit easier to follow.   Absolutely, we are looking to build a module for wallet tagging. We are trying to find a way to keep it private, in a similar fashion to etherscan, users can upload their own list of tags while we provide a publicly maintained tag list to include all the Maker contracts. Something else that might be interesting is the correct allocation of staked MKR. Right now when you look at either our dataset or etherscan you see 160k MKR in the Governance Contract. We have had to do this ourselves to work on the ESM Threshold analysis, so toggling between the two views might be beneficial to others. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.847222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/06/2022-12:51:24",
                    "content": "    tadeo:  Would this still give you all the necessary information?   Cool, thank you — and yes that works.     tadeo:  Absolutely, we are looking to build a module for wallet tagging. We are trying to find a way to keep it private, in a similar fashion to etherscan, users can upload their own list of tags while we provide a publicly maintained tag list to include all the Maker contracts.   Very nice. Looking forward to this and keeping it private IMO is the right approach. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.107857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "06/09/2022-12:51:28",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}