{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-proposed-reform-of-makers-rwa-program-decentralize-and-de-risk-the-process/10002",
            "title": "[Discussion] Proposed Reform of Maker's RWA Program: Decentralize and De-Risk the Process ",
            "index": 10002,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "real-world-finance",
                "core-unit"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "12",
                    "time": "24/08/2021-14:35:20",
                    "content": "TL;DR Split RWF into two CUs – one focused on negotiation of terms and one focused on risk assessment. MakerDAO has the distinction of being a first-mover in the financing of real-world assets (RWA). As the protocol attempts to scale exposure to RWA, it is time to implement a process that is as rigorous and responsible as the one we utilize for onboarding new crypto assets. To date, Maker’s process of onboarding and monitoring RWA is entirely centralized within the RWF CU. This was convenient when staff was limited and resources available were small. But just as regulated financial institutions are required to institute better internal controls as they become large enough to afford them, so should Maker. At present, MIP6 applications are presented on the forum. This allows the community to ask initial questions and become familiar with applicants. This is a good beginning to the process and should be retained. From here, however, the process needs an upgrade. Ironically, TradFi practices are much more decentralized – for a reason – than our own. As a starting point, we should look at something similar and then iterate to suit Maker’s specific needs. The RWF CU should be split into two – one that is a “business” RWF CU and one that is a “risk” RWF CU. The roles of negotiating the best possible terms for Maker and that of risk assessment should not be housed within the same unit. This lowers potential conflicts of interest, and also encourages multiple sets of eyes on the details of a deal, which needs not only a legal evaluation but also an economic one. This also prevents the siloing of information within a single CU or person. These two separate CUs would then make the case for or against an MIP6 application before MKR holders. The “business” RWF CU would have responsibilities for getting Maker the best deal possible in economic terms. Currently no one fulfills this role today, as deals have largely been of the “take it or leave it” sort. This makes sense in the case of securities, but Maker has clearly suffered by being absent from the bargaining table. The “risk” RWF CU would have responsibilities for ensuring Maker was not taking on large amounts of risk without proper disclosure or emphasis. Examples of risks that a “risk” RWF CU would raise a warning about:  No legal review of documentation to make sure it operates as assumed Incomplete restrictions on use of funds by borrower Incomplete bankruptcy remoteness The extent to which collateral is under Maker’s control either legally or in a smart contract Incomplete or inaccurate descriptions of what the end collateral is or is not Maturity/credit risk Presence/absence of independent documentation/verification beyond borrower-reported information Extent of buyback agreements or other forms of liquidity upon exit Ability for borrowers to alter terms without the affirmative assent of senior creditors  Both CUs would be jointly responsible for monitoring active credit lines. This keeps multiple sets of eyes on a project, each with a specialty. It also provides some level of redundancy to ensure credit lines are actually being monitored on a regular schedule. Given that Maker wishes to offer financing across multiple, very different asset classes, a serious effort should be made to staff these RWF CUs with professionals that have experience in both the process of structured credit and the underlying assets. Those need not be the same people, and they need not be actual employees of a CU. There is no shortage of places to outsource some of this work to complement our own internal staff. Maker is moving into a very lucrative, but very, very dangerous area of revenue-based finance. And our track record to date has been, quite frankly, subpar. Our great victory is that we have successfully bootstrapped a RWA program into existence, but we are already encountering significant problems. Those problems are directly linked to our own lack of well-developed process for non-crypto assets. Just as we would never onboard a new crypto asset without independent reviews by such diverse stakeholders as Protocol Engineering, Oracles, and Risk, we should not be onboarding real-world assets without independent review by more than a single CU attempting to wear every hat at once. To execute on this more professional process, we will also need to make sure there is high-caliber leadership and staff inside both the “business” and “risk” RWF CUs. I have no doubt that the current RWF full- and part-time employees would find a good fit in one or both core units. The above proposal to split RWF into two CUs and reintroduce some level of adversarial thinking will both decentralize and de-risk our program as a whole. This is obviously not a very granular proposal, and suggestions for finer details are welcome as we get the conversation going. ",
                    "links": [
                        "https://forum.makerdao.com/t/on-chain-securitization-roadmap-new-silver-audit/9937",
                        "https://forum.makerdao.com/t/maker-relay-ep-60/10082",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-20-26/10032",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-27th-september-2nd/10125",
                        "https://forum.makerdao.com/t/maker-relay-ep-60-en-espanol/10375",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-29th-2021/10098",
                        "https://forum.makerdao.com/t/informal-poll-should-real-world-asset-originators-ao-stake-mkr/10092"
                    ],
                    "GPT-summary": "The author proposes to split the RWF CU into two separate CUs, one focused on negotiating the best possible terms for Maker and the other focused on risk assessment. The author argues that this will prevent conflicts of interest, encourage multiple sets of eyes on the details of a deal, and prevent the siloing of information within a single CU or person. The proposal is open for discussion and suggestions for finer details are welcome.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.81836985930736
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#2",
                    "likes": "2",
                    "time": "24/08/2021-14:51:03",
                    "content": "I believe that an adversarial approach to credit risk underwriting and monitoring would benefit the community, and signal prudence and care to outside stakeholders willing to get financed by Maker, i informally support this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "6",
                    "time": "24/08/2021-15:18:14",
                    "content": "@PaperImperium  thanks for initiating this discussion. This is a good idea. Splitting RWF into RWF-Risk and RWF-Business (or whatever they will be called) will likely be an improvement. I am not sure the work they will be doing can be called adverserial, more cooperation, but I guess that is a bit up to interpretation. One thing I am sure of: these new CUs will need a common list of prioritized work,  otherwise this will quickly turn disappointing. There is no point in RWF-Risk analyzing deal A while RWF-Business is spending all their time on deal Z. Opening this up to some degree will also allow the community to have some oversight into the ongoings, which would not be a bad thing. In this way, the community could both prioritize deals and to some degree make sure potential deals followed community guidelines which at some point will be a thing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.392191142191142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "6",
                    "time": "24/08/2021-17:12:55",
                    "content": "    Planet_X:  @PaperImperium thanks for initiating this discussion. This is a good idea. Splitting RWF into RWF-Risk and RWF-Business (or whatever they will be called) will likely be an improvement. I am not sure the work they will be doing can be called adverserial, more cooperation, but I guess that is a bit up to interpretation.   First I support this proposal. Secondly,  I want to echo some sentiments here.   I expect RWA to become the largest asset class so we need to grow this part of the business.  A split into two distinct units with different priorities doesn’t just make sense it is urgently needed.   Two units can have some duplication of effort and cross checking.  Provides some Quality Assurance vs. having 1 CU handle this and reduces any issue of non-disclosed conflict of interest.   Different units will have different management and skill sets needed.   Selling or buying something is far different than figuring out if we can and should buy/sell it.   As to adversarial or cooperative.  Both should basically be good as long as the adversarial doesn’t get acrid, and the cooperative just rubber stamping.   The real issue will be CU communication because we don’t really want business RWF CU trying to buy/sell something that risk RWF flat out won’t allow or was working on something else.  I see this as a general thing overall is that there is no kind of higher level CU that tries to direct Maker Vision, list priorities, and cause general CU discussion so the CUs instead of working like pistons firing at different times are sequenced together so they fire to drive the car forward vs. lurching it around…     Planet_X:  One thing I am sure of: these new CUs will need a common list of prioritized work   A big issue I have been thinking about is CU definitions of authority and responsibilities.   This will need to be clearly laid out between these units, especially where there may or may not be overlap for quality assurance purposes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5017217630854
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "4",
                    "time": "24/08/2021-18:34:40",
                    "content": "Interesting—for sure—Decentralizing All Core Units is something that should eventually happen. While some of your post focuses on what already has occurred—one way to de-risk is to focus on what can be improved—maybe implement a RWA portfolio risk strategy—one that is approved by MKR Token holders—and develop policies and procedures for identifying, measuring, monitoring, and controlling credit risk/RWA portfolio risk management. I also believe there should be an external Board/Supervisors that is responsible for approving and periodically (at least annually) reviewing the credit risk strategy and significant credit risk policies of the RWF CU. The strategy should reflect MakerDAO’s tolerance for risk and the level of profitability MKR token holders expects to achieve. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "4",
                    "time": "24/08/2021-18:44:23",
                    "content": "Everyone is making some great points about how to execute and build on this. Keep them coming! Lots of delegate engagement here, too, with @flipflopflapdelegate, @MakerMan, and @Planet_X. MKR holders: this is your delegates working on how to steer Maker into the next phase of RWA growth  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#7",
                    "likes": "6",
                    "time": "24/08/2021-23:07:52",
                    "content": "    PaperImperium:  The “risk” RWF CU would have responsibilities for ensuring Maker was not taking on large amounts of risk without proper disclosure or emphasis. Examples of risks that a “risk” RWF CU would raise a warning about:  No legal review of documentation to make sure it operates as assumed Incomplete restrictions on use of funds by borrower Incomplete bankruptcy remoteness The extent to which collateral is under Maker’s control either legally or in a smart contract Incomplete or inaccurate descriptions of what the end collateral is or is not Maturity/credit risk Presence/absence of independent documentation/verification beyond borrower-reported information Extent of buyback agreements or other forms of liquidity upon exit Ability for borrowers to alter terms without the affirmative assent of senior creditors    @PaperImperium - these are very good points. One further point for consideration that is equally important – potential RWA borrowers ought to understand Maker’s expectations and submit proposals that “check the boxes” (so to speak). Obviously every deal is “different”, but potential borrowers should aim to submit well-defined and structured transactions. A framework of basic expectations will probably facilitate the overall CU review. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.816741071428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#8",
                    "likes": "7",
                    "time": "24/08/2021-23:15:04",
                    "content": "@christiancdpetersen I agree. Based on my experience with originators, it is extremely valuable to draft a standardised agreement (and identify preferential structuring partners like Centrifuge) to be used with all originators. In the same way ISDA constructs allowed derivative contracts to scale, a standardised RWF agreement would speed up onboarding, and also self select potentially interested originators that would know what kind of expectations to have when dealing with MakerDAO. Together with a standardised agreement, a list of underwriting criteria could be published, in this way pushing self selection further. I believe this should be a priority piece of work to avoid continuously reinventing the wheel. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#9",
                    "likes": "0",
                    "time": "25/08/2021-02:11:45",
                    "content": "Would love to hear some input from @Philinje @williamr @jameskmccall @Aes et al on how to execute well on this since they’d be picking which offspring CU to join. Any thoughts on how to divide/overlap mandates is welcome. Feedback is good so far. Barring any obvious problems, I’ll start moving this towards on-chain consideration next week. RWF — so successful, we could have it reproduce. Probably have a lot of “help wanted” signs as a result, but it’ll be well worth the expense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#10",
                    "likes": "7",
                    "time": "25/08/2021-06:09:29",
                    "content": "@PaperImperium I have similar inputs here to @christiancdpetersen. In fact, we’ve both been discussing very recently about this structuring framework and giving clear expectations to issuers from the start. This setup of expectations would be a way to (1) pre-qualify better prepared issuers, and filter out unprepared ones, but also (2) assist other counterparties with clear requirements (e.g. arrangers) should the structure be significant enough for their involvement, for example in the case of RWACo, 6s and others. As for my direct input to the proposal, I tend to agree with the overall reasons given for further decentralisation and creation of small dedicated CUs. In my view there are valid points outlined in this post and in other people’s comments. Where I may see things differently is on the solution proposed, meaning the specific CUs suggested and their respective mandates. If anything, I actually think there is room for more than two units that can be formed in this process. Not all of them would necessarily be from a “risk” category by the way. I’ll cover my thinking on an alternative option as soon as I have a bit more time in my hands for a proper write up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.398809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#11",
                    "likes": "13",
                    "time": "25/08/2021-09:50:43",
                    "content": "I would be particulary interested to hear what @SebVentures thinks about this. He has been doing a tremendous job creating and leading the RWA team so far and I think the most important thing at this point is that he has the necessary resources and support from the DAO to keep developing the team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.319444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "0",
                    "time": "25/08/2021-10:26:58",
                    "content": "    williamr:  If anything, I actually think there is room for more than two units that can be formed in this process. Not all of them would necessarily be from a “risk” category by the way. I’ll cover my thinking on an alternative option as soon as I have a bit more time in my hands for a proper write up.   Really looking forward to it! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#13",
                    "likes": "4",
                    "time": "25/08/2021-10:52:12",
                    "content": "Dear all, my suggestion - if of any value for the community, would be to study how banks have structured themselves across various “lines of defence” to underwrite and manage credit risk. Those are all quite basic questions and reinventing the wheel can be avoided, by adapting for a DAO construct what banks have developed thru a millennium. Would be happy to provide some extra colour at the appropriate time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#14",
                    "likes": "2",
                    "time": "25/08/2021-13:11:43",
                    "content": "    luca_pro:  would be to study how banks have structured themselves across various “lines of defence” to underwrite and manage credit risk.   Coming from a credit risk background myself, I second this. This is behind some of the thinking in an alternative suggestion for teams composition. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#15",
                    "likes": "16",
                    "time": "25/08/2021-13:15:24",
                    "content": "On the philosophical level, I kind of agree broadly. We need more decentralization and we need more RWA CU. But the problem is not even there, it’s that MakerDAO doesn’t have a clear RWA strategy (and that’s not easy to define neither). On the operational level, @PaperImperium is mostly asking for a new RWA Business CU. I agree as well. Where I don’t agree is that it is splitting RWF. And he says correctly “no one fulfills this role today”, I did propose RWA Co to do that. The only time we negotiate is to reduce risk (reducing the LTV in Peoples Company application, getting the land as collateral from the start with SolarX, adding some covenants, …). I would add that I’m the first one saying we need a RWA Legal CU. I’m also pro-decentralization by launching the RWA Committee to get community members helping the decision process. What worries me is the governance level. I’m quite exhausted from being RWF being harassed for months now. Seems like a lot of people have strong opinions about RWF. So much that they don’t need to speak with me to have a better understanding of what should be done. MakerDAO is decentralized. Everyone can contribute, please do, please make. But let people work. If you are not happy with something, please raise the point once, let’s have a clean discussion. If you feel no action is taken, take an action and take ownership of the action. No need to repeat the same thing over and over and play political games. @PaperImperium did make some serious accusations against my loyalty to MakerDAO so there is no way this discussion is in good faith (clear also from this message). @PaperImperium wants to reform and clean the mess I did. Please do. Create a better RWA CU (well you did an ephemeral one), maybe it was leadership and not chaos that you could have brought to the PPG RWA Committee. You can even take leadership of the RWF CU if you think you know better. Let’s swap places. I worked on RWA because no one else did and I think that’s important for MakerDAO (and my MKR bag). Plenty of other stuff to do. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-rwa-committee/7893",
                        "https://forum.makerdao.com/t/discussion-proposed-reform-of-makers-rwa-program-decentralize-and-de-risk-the-process/10002/9",
                        "https://forum.makerdao.com/t/mip39c2-sp16-adding-maker-portfolio-core-unit-mpcu-001/8996",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-29th-2021/10098"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.850837924701561
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#16",
                    "likes": "9",
                    "time": "25/08/2021-14:59:09",
                    "content": "Yeah, I get that these are issues.  I am concerned about a few things as well.  But this is a new frontier, many of these things are unknowable and the risks are basically impossible to quantify.  Like what is bankruptcy remoteness for a DAO? I would provide some history, maybe in farm real estate loans.  When we first started making loans in the 1990’s, the insurance company model was having a field agent on the ground and put all accountability in that one person.  They would need to know the five C’s—capacity, capital, collateral, conditions and character and if the loan goes bad, it is their butt.  The new model is one with plausible deniability at every layer, and everyone pointing to a different place.  They have centralized all decision making at the regional level and look to 3rd parties to tell them it is OK.  Similar to bonds. “Well S&P says it is good, then we do it”.  “What does legal think?”  Successful bureaucrats in this model, never really put their name on the line.  They always have reservations and milk plausible deniability at every turn.   I am not really here to debate the two models, but the philosophy is important.  Which is the ideal?  Overall, the governance is an ever growing fractal of bureaucratic overlay.  Simply to partially keep up with MKR, I bet I spend a number of hours a week, and I still have no idea what is really going on. Legal opinions are 1 part opinion, but also a “cover” of sorts.  I am relying on this legal opinion about bankruptcy remoteness.  OK, I guess that accomplishes two things.  The banker signalling. See I am a prudent middleman, as I listened to the attorney.  See this shiny document with an opinion on it. A potential claim on the E&O insurance.  Why are attorneys so dang expensive?  Well you are renting their firm’s reputation and E&O. All of this requires “trust” assumptions.  Is a Cayman’s model trustworthy, was Bernie Madoff a good steward of the Nasdaq, did Wilmington Trust commit fraud?  God only knows, and we often find these things when the tide goes out. If the “responsibility” for assuring the laundry list of Defi grievances was to be put on any decentralized party, they would be insane to even remotely accept this.  There is no amount of money that I would be willing to accept to take on this role. The description is literally a bank.  Or maybe “credit oversight” as a service.  At some point, MKR needs to ask itself if it wants to be a defi protocol or a bank.  If it is a bank, come to terms with it and model around that. The MKR token holders basically want someone to make all these credit decisions, watch their hind flank, and make them a ton of money without having to do the work themselves.  The current model a “DAO model” is for the DAO to figure out what is or is not an acceptable risk.  In other words if you want a centralized credit team to make you money, just go buy BOFA stock, it is much simpler for everyone that way. I could literally tear a hole in each token, in each RWA asset class, in each model.  That is easy.  What is really hard is to find what is an acceptable return for taking on the risk.  How does that remotely work in this model? /fin rant.  ",
                    "links": [
                        "https://forum.makerdao.com/t/rwf-ask-me-anything-september-2021/10234"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.557649667405765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#17",
                    "likes": "9",
                    "time": "25/08/2021-15:34:09",
                    "content": "    PaperImperium:  To date, Maker’s process of onboarding and monitoring RWA is entirely centralized within the RWF CU. This was convenient when staff was limited and resources available were small. But just as regulated financial institutions are required to institute better internal controls as they become large enough to afford them, so should Maker.   As it stands today RWF has 2.8 FTEs (3.8 when I convert next month and risk/RWA business assessments are not within my scope), so it’s hard for me to conceptualize a need to ‘split’ the CU at this stage. I think the desire and reasoning for doing so makes sense, but before the last governance vote RWF was the lowest funded and one of if not the smallest teams in terms of FTEs. I believe this is in stark contrast to how the DAO ‘thinks’ we prioritize the RWA initiative and I’ve stated and commented as much on the forums. We are battling for market share and losing in our primary market, one that’s rapidly becoming commoditized and not investing enough in what is in my opinion, the most important strategic initiative we have to scale MakerDAO sustainably long term. The community’s desire to rapidly scale RWA was not without risks and as a first mover, that should be expected. Let’s not forget we’re going from 0 to 1 here. I think we need to focus more on collaboration and actively resolving issues/building. To me, the most important first step as you mention is to get more FTEs and @SebVentures stated as much in his latest budget request. Perhaps we should be more aggressive in recruiting. Attracting and retaining the right talent, across the DAO should be priority #1 at this stage. Despite crypto’s growth this year, recruiting talent from TradFi is still a challenge due to the risks I outlined in the pre-MIP discussion of MIP56. There is no shortage of teams the DAO needs but topping my list are legal and talent CUs, both that would benefit RWF and largely address the issues discussed in this post. When it comes to decentralization, there is a trade-off between centralization and decentralization of these processes, which I believe @christiancdpetersen will be sharing with the community shortly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.853174603174604
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NH98",
                    "index": "#18",
                    "likes": "4",
                    "time": "25/08/2021-18:07:25",
                    "content": "Thanks for the write-up @PaperImperium! It is my opinion that this initiative, rather than taking the form of a “splitting” or a “reform”, should be one of adding to the resources of Maker’s RWF branch. I know profitability and financial soundness is important, but while we may represent a “blue chip” for the crypto ecosystem, we are still an early venture versus financially oriented legacy organizations. We must be comfortable in investing heavily for the future. The reason why there is so much debate surrounding RWA is because we can all see the enormous potential they have for Maker in the long term. Many (including myself) have been drawn to the DAO for this reason and we are continually seeing new interested parties coming to the table. RWF can and will (1) distinguish Maker from its competitors (2) scale in a sustainable manner (3) provide financial resources, but only if we are investing our time, money and passion in it. Hence, I strongly support that RWF should have a business negotiation team and a risk analysis team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.672138047138047
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#19",
                    "likes": "1",
                    "time": "25/08/2021-18:14:17",
                    "content": "    NH98:  It is my opinion that this initiative, rather than taking the form of a “splitting” or a “reform”, should be one of adding to the resources of Maker’s RWF branch   That’s probably a better framing! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#20",
                    "likes": "2",
                    "time": "27/08/2021-19:41:29",
                    "content": "I wanted to chime in here as an originator (I dont pretend to speak for all AOs here), so please take my feedback for what it is, but I believe it should be important for the DAO to hear all sides. Let me start by saying/reminding that I strongly believe in MakerDAO and DeFi in general, and we have worked with Centrifuge for over 2 years to become the first RWA approved on-chain. I also totally understand that risk needs to be assessed and balanced with reward. However, I wanted to stress that while intentions here are good, becoming more like a bank or a credit fund will have its’ consequences - namely, opening the DAO up to potential regulation, and, more importantly, making the process potentially more burdensome than what already exists in the centralized world. With so much money printed lately by central banks all over, coupled with low interest rates, many funds are aggressively deploying their capital, and good originators are in demand. I believe blockchain brings a great deal of innovation and transparency, and is the future of finance. I would urge the community to think about ways to make the onboarding and risk assessment as easy as possible, as well as transparent and rooted in technology and innovation, and not to turn back the clock towards what already exists elsewhere. This is purely my point of view, and I hope it will add value to the discussions.     jameskmccall:   The description is literally a bank. Or maybe “credit oversight” as a service. At some point, MKR needs to ask itself if it wants to be a defi protocol or a bank. If it is a bank, come to terms with it and model around that.    ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.506448412698413
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#21",
                    "likes": "6",
                    "time": "27/08/2021-21:09:13",
                    "content": "    prankstr25:  becoming more like a bank or a credit fund   I believe a large majority of the MakerDAO community has no interest in being labeled a Bank/credit fund. In fact most “ETH heads” dislike banks (see the Bankless podcast) and hope that this wonderful technology can make the world a better place. However, I do think that if Maker is ever going to provide a $225 Million dollar loan like this one  below–IMO it will need to have significant experience negotiating across a broad range of transaction structures, including things I am focusing on learning about, like unitranche facilities, split collateral arrangements, first lien/second lien structures, split collateral deals and many other tricks of the trade that I cannot remember/fully-understand. And indeed–IMO I do not want to Duplicate the same old structure, but how does MakerDAO protect itself when there are so many “tricks-of-the-trade” (for lack of a better word)?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.775595238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#22",
                    "likes": "7",
                    "time": "27/08/2021-21:55:03",
                    "content": "I understand your point, but I frankly I don’t think we should assign ethical value to knowledge, but to the use of knowledge. Learning how to price and manage risk, how to structure it, is of high value for everybody, including us. And it requires skills learned through years of practice, to merge with skills learned in other fields like governance, programming, token engineering, marketing, etc. Sometimes knowledge has been abused by creating barriers and rent seeking - more by funds than banks, that have been struggling to make reasonable returns over the years. And that’s the behaviour we should avoid. If Maker wants to invest significant money and negotiate with financially savvy players, we must equip ourselves with high level finance skills. Our project is ambitious, and with huge positive potential. That’s why I decided to dedicate the next phase of my career to DeFi and not traditional banks, and I hope that many of my colleagues from Wall Street will realise that we can all make money by building a more equitable future in finance for everyone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.985353535353535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#23",
                    "likes": "0",
                    "time": "27/08/2021-22:15:12",
                    "content": "    christiancdpetersen:  Obviously every deal is “different”, but potential borrowers should aim to submit well-defined and structured transactions. A framework of basic expectations will probably facilitate the overall CU review.   I think this is important.  That CU’s working to bring on-board deals have a DAO pre-approve a set of frameworks so CUs don’t end up wasting not just their valuable time but also potential partners making a deal that the DAO won’t approve. I also really want to see where this “Mandated Actors” discussion goes, since authority and responsibility overlap, communication as it pertains to planning, coordination and execution by CUs is going to be pretty important going forward.     williamr:  Coming from a credit risk background myself, I second this. This is behind some of the thinking in an alternative suggestion for teams composition.   Agree with this.  Always look to existing frameworks for examples and only deviate with sufficient cause, ideally backed with good experienced suggestion.   I have seen too many examples of ‘we can do this better than anyone else mentality by people who have never done anything - completely wasting time and money making something that will have to be replaced’.     SebVentures:  it’s that MakerDAO doesn’t have a clear RWA strategy   I agree with this.  I disagree with:     SebVentures:  (and that’s not easy to define neither).   As I believe it can be defined, but probably will take some time and effort.     SebVentures:  I would add that I’m the first one saying we need a RWA Legal CU   Debatable as I believe this was discussed generally in the past and understood almost from the beginning.  The issue was that Maker was undergoing numerous transitions so I believe a number of things dropped through cracks while Foundation was dissolving, Maker CUs were forming.   I am pretty sure when I talked about RWA my sentiments were that I wouldn’t want anyone to even try to take on the job without not 1 but at least 2 fully independent legal consults.    Risk while there was in the back of my mind because it was unclear if this would be a Risk CU job (having a RWA unit) or whether the RWA CU itself would have a risk team. Given it appears risk is not taking on building a RWA team, and from what I can see the RWA CU has not really pushed for this as a pre-req for moving forward, basically the DAO is playing catch up. I also think a real discussion of whether Maker RWA risk assessments should come from a RWA group in the risk team, or under the RWA CU IS appropriate at this time. @PaperImperium is completely correct in asking for a RWA risk unit and for it to be a separate unit mostly to provide some quality assurance and independence as well as limit conflicts of interest etc.     SebVentures:  I would add that I’m the first one saying we need a RWA Legal CU. I’m also pro-decentralization by launching the RWA Committee  to get community members helping the decision process.   But that didn’t seem to go anywhere and wasn’t moved forward either away from a committee model or formally requesting CUs and others give feedback.   I have a concern here @SebVentures that you can say you were out front on these issues, but there is a lack of follow through.   Which leads to an understandable statement:     SebVentures:  What worries me is the governance level. I’m quite exhausted from being RWF being harassed for months now. Seems like a lot of people have strong opinions about RWF. So much that they don’t need to speak with me to have a better understanding of what should be done.   I felt that RWF/RWA was going to be a very large job.  The amount of assets we want to onboard, the level of detail, skillsets and time required were such that no single person was going to be able to deal with it.   Kind of amazed you have lasted as long as you have @SebVentures and want to thank you for the most difficult service.    I think it would make sense to look to onboard some new talent, if not just for you to take a break.   I also think a lot of stuff has been falling through the cracks, but lets be fair here governance pushed extremely hard, and you @SebVentures pretty much did the best you could.  It makes sense to step back and relook at how to deal with what will probably be one of the most important CUs for Maker going forward. As to:     SebVentures:  MakerDAO is decentralized. Everyone can contribute, please do, please make. But let people work. If you are not happy with something, please raise the point once, let’s have a clean discussion. If you feel no action is taken, take an action and take ownership of the action. No need to repeat the same thing over and over and play political games. @PaperImperium did make some serious accusations against my loyalty to MakerDAO so there is no way this discussion is in good faith (clear also from this message). @PaperImperium wants to reform and clean the mess I did. Please do. Create a better RWA CU (well you did  an ephemeral one), maybe it was leadership and not chaos that you could have brought to the PPG RWA Committee. You can even take leadership of the RWF CU if you think you know better. Let’s swap places.   Maybe it is time for something like that…   Would have to see if @PaperImperium wants the job honestly. I think my honest question here to you @SebVentures would be whether you want to formally step down - or at a minimum aside so MakerDAO can solicit for someone else to ‘step up’.   This is nothing against you.   I have stepped aside from some ‘impossible’ jobs before, mostly because I was just burned out and probably not the ideal person for the job (honestly a lot of things I was asked to do, pretty much were things I did because others I cared about asked me to, but they were not what I truely wanted to do.) Best thing in life is to have an opportunity and to learn by trying it that this wasn’t what we really wanted…  Or better it was what we wanted but it just needed to change to work better for us. I honestly don’t know but I appreciate some honestly and openness here.   You took on what I think was one of the hardest, if not the hardest job at the time RWA/RWF @SebVentures I want to thank you as another MKR holder for your service and will endeavor to be as supportive as I can. I want to add.  I consider one of my jobs as a MKR holder (not a delegate but this too now) to basically look hard at things and while I may be wrong in assements, at least try to ask the hard questions and take a stand for better or worse.  It is my hope this creates positive change that goes far into the future.   Maker is still moving through a difficult transition period from Foundation, to CUs and trying to get wired up to basically drive forward as a unified, well coordinated, respectful group, with full transparency, reasonable efficiency and productivity.   There are bound to be issues.   So lets just try to work through them. I think for you @SebVentures I want to know whether you have decided whether to step down, aside, or to step up and ask for more resources?   I feel like this is the one CU that the DAO needs to focus on and I want to know how, whether we can help? ",
                    "links": [
                        "https://forum.makerdao.com/t/discussion-proposed-reform-of-makers-rwa-program-decentralize-and-de-risk-the-process/10002/9",
                        "https://forum.makerdao.com/t/mip39c2-sp16-adding-maker-portfolio-core-unit-mpcu-001/8996"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.975863440816712
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#24",
                    "likes": "2",
                    "time": "27/08/2021-23:29:56",
                    "content": "I think I should clarify this is a suggestion about process, and onboarding new personnel with extra expertise and to lighten loads. This is a proposal and brainstorming about adding to our processes and personnel. Not removing them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#25",
                    "likes": "3",
                    "time": "27/08/2021-23:49:22",
                    "content": "I stand by my last statement as a general sentiment:     MakerMan:  I feel like this is the one CU that the DAO needs to focus on and I want to know how, whether we can help?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#26",
                    "likes": "1",
                    "time": "28/08/2021-15:41:48",
                    "content": "    MakerMan:  step up and ask for more resources   This seems like the best course of action. You can’t run a real business with 4 full time employees. And you certainly can’t onboard billions of dollars of assets under management with that. We just have to be careful about how quickly to expand and prioritize the needs of the DAO such as a Legal CU. Also people to underwrite and securitize debt. I certainly throw my hat with MakerMan in that I will do whatever I can to help RWAs grow in MakerDAO/DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.369047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#27",
                    "likes": "3",
                    "time": "28/08/2021-19:06:16",
                    "content": "    flipflopflapdelegate:  And indeed–IMO I do not want to Duplicate the same old structure, but how does MakerDAO protect itself when there are so many “tricks-of-the-trade” (for lack of a better word)?   There won’t be an easy answer, not a 100% perfect one. But I do believe there is a chance at this moment in time to rethink the risk assessment process from the ground up, start with a clean slate, learn from what has worked from the legacy systems, and what hasn’t. Developers (not bankers nor risk mitigators) created the software that we now call blockchain, they created cryptocurrencies and DeFi, and it has worked well thus far. I believe we should look to technology to continue to move forward. At a high level,  I believe the structure should encompass the following tenants:  Driven by decentralization Using technologies Creating alignment between AO and DAO  In my view, the 3rd point is extremely important. Since the DAO is decentralized and includes a wide range of stakeholders, AOs should be one of those many. One idea is a requirement to hold some MKR by each AO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.414285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#28",
                    "likes": "2",
                    "time": "28/08/2021-19:25:36",
                    "content": "    prankstr25:  One idea is a requirement to hold some MKR by each AO.   “skin in the game”— I like that. And totally—I was listening to a DLA Piper podcast on how the Construction Industry is fighting technology—the tech tools are being built and most construction companies want to continue to operate the same ole’ way instead of embracing tools that will benefit All. For sure—I love this tech—the imaginative capacity of it—its beautiful. And I hope we can come together and make it work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brettlyons",
                    "index": "#29",
                    "likes": "3",
                    "time": "29/08/2021-15:46:07",
                    "content": "Is it possible for AO to stake MKR, and any losses trigger a slashing of MKR stake?  Wouldn’t take much size for this to be meaningful.   Even if its just 10bp of deal size.   Also MKR could roll out a program that it gives more favorable terms to AO who stake, e.g.  debt ceiling above 20m requires 10bp MKR stake ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#30",
                    "likes": "4",
                    "time": "31/08/2021-19:55:12",
                    "content": "While I generally agree with the goals of @PaperImperium (thanks for this thread) I don’t like where this is going and I fully agree with what @SebVentures says. His CU was created after he made a proposal that was voted, and funded for a determined period of time. Q) Do we feel the need to have a RWF structure divided in two CU? A) Then let’s create a new one! Or rather, two new ones. Why do we want to explode/split a working CU when it’s actually desirable to duplicate CU for decentralisation’s sake? Furthermore I feel the (re-)sentiment of @SebVentures when he reads that people want to interfere with the CU the way he proposed it, got it approved by means of voting, run it, etc. This is not imho an healthy way to proceed: LESS destroy, MORE make. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.661195286195286
                }
            ]
        }
    ]
}