{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/matt-levine-bloomberg-newsletter-on-celsius/16236",
            "title": "Matt Levine Bloomberg Newsletter on Celsius ",
            "index": 16236,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#1",
                    "likes": "6",
                    "time": "30/06/2022-08:02:48",
                    "content": "This is from Matt Levine’s free newsletter on Bloomberg “Money Stuff” (which I encourage subscribing to) from today. It is such a nice layout of the situation that I think it is worth reading.  MONEY STUFF NEWSLETTER QUOTE: \"…Here is a financial literacy test for you:  You can borrow $18 billion at 8% interest. You can take that money and invest it in loans that pay 20% interest. You don’t have to put up any of your own money. So you get $3.6 billion a year in interest (20% of $18 billion), and you pay out $1.4 billion in interest (8% of $18 billion), so you keep about $2.2 billion for yourself. Is this good?  This is not a yes-or-no question, and the right answer is probably something like “well, good for who?” If you are a person who invents a business like this, and you are able to do it for a year or two and squirrel away the $2.4 billion, it is very very good for you and you can buy yachts and stuff. But in the long run, if you are borrowing at 8% and lending at 20%, you are taking some huge risk somewhere. Those 20% loans are risky and correlated and illiquid and possibly Ponzi schemes; that 8% money is flighty and unstable; you are lending out all the money you are borrowing and there is no cushion anywhere. At some point the people lending you the money at 8% are all going to ask for it back, and the people borrowing the money at 20% aren’t going to give it back, and you’re not going to have the money to pay back the 8% people, and they’re going to be really mad, and that’s when it will be useful for you to have a yacht to sail away on. Anyway here’s a Wall Street Journal article about Celsius:  Celsius Network LLC CEO Alex Mashinsky built his cryptocurrency lender into a giant on a pitch that it was less risky than a bank with better returns for customers. But investor documents show the lender carried far more risk than a traditional bank. The lender issued numerous large loans backed by little collateral, according to Celsius investor documents from 2021 reviewed by The Wall Street Journal. The documents show that Celsius had little cushion in the event of a downturn, and made investments that would be difficult to quickly unwind if customers raced to withdraw their money. Celsius didn’t respond to requests for comment from the Journal. Celsius had $19 billion of assets and roughly $1 billion of equity as of last summer, before it raised new funds, according to Celsius investor documents from 2021 reviewed by the Journal. The median assets-to-equity ratio for all the North American banks in the S&P 1500 Composite index was about 9:1, or about half that of Celsius, according to data from FactSet.  We have talked a lot about crypto banks recently, and Celsius’s roughly 5.3% capital ratio is, if anything, high. Tether’s capital ratio is about 0.2% (!); Voyager Digital Ltd.’s is about 4.3%. This banking business, this business of borrowing at lower rates and lending at higher rates and having a thin sliver of equity, this is a pretty well-known business, and in traditional banking there are lots of safeguards around it. That sliver of equity can’t be too slim, you need to keep some cash on hand to give back to your depositors, you need to make prudent loans that are not too risky or too concentrated or too much to your own affiliates, etc. In traditional finance there are “shadow banks” that try to do this sort of business with less regulation, but there are regulatory and market constraints on how much of that is allowed, particularly after shadow banking blew up in 2008. Meanwhile in crypto absolutely anything apparently goes. We talked about Celsius a few weeks ago, and nothing here really comes as a surprise. “Somebody is lying,” Mashinsky once told Bloomberg Businessweek: “Either the bank is lying or Celsius is lying.” That too was a kind of financial literacy test. Celsius has frozen customer withdrawals for weeks; regular banks, conspicuously, have not. The Journal article also points to sort of a subtle fact about crypto banking and interconnection:  Adding to Celsius’s leverage was money borrowed from others including Tether International Ltd., which issues a cryptocurrency pegged to the U.S. dollar. As of last summer, Celsius had a credit facility for up to $1.1 billion from Tether, which itself was an early investor in Celsius with a 7.8% stake in the lender as of last spring, Celsius told investors. … Like a bank, Celsius was able to pay yields to customers largely by making money through lending at even higher yields to others. One of its biggest units was lending to other crypto financial businesses, including digital-asset manager Galaxy Digital and institutional crypto-lending firm Genesis, Celsius told investors. Celsius projected in May 2021 that institutional lending would bring in about $290 million of revenue for the year, more than one-quarter of total revenue, the documents reviewed by the Journal show. While banks like loans to be overcollateralized—homeowners taking out a mortgage post their house as collateral, which is valued at more than the loan—Celsius required its business borrowers to post only an average of about 50% collateral on its $2.7 billion of loans as of last spring, the documents show. Undercollateralized lending is considered a risky practice, one that was more generous than that of many of Celsius’s competitors. Celsius used some of that collateral to borrow more money itself, a process known as rehypothecation, adding additional risk.  Think about how that business might work. At a high level of generality, you have two crypto financial businesses, perhaps they are Celsius and Genesis, or Celsius and Tether, or whatever, but let’s just call them Borrower and Lender. Borrower has some Bitcoins (or Ether or whatever) and wants dollars (or USDC stablecoins or Tether or whatever); Lender has plenty of dollars (USDC, Tether, etc.) that it is willing to lend. Borrower and Lender get together and agree that Borrower will post its Bitcoins to Lender as collateral, and Lender will hand over some dollars to Borrower collateralized by those Bitcoins. Fine. A normal, collateralized margin loan. How many Bitcoins should Borrower give Lender for the dollars? Well, if you are Lender, you will want your loan to be well secured. If Borrower gives you $200 worth of Bitcoin and you lend it $100 of cash, then you will be pretty well secured. If Borrower doesn’t pay you back the $100, you can seize its collateral and sell it for $200, giving you plenty of room to repay your loan. Even if the price of Bitcoin falls by 10% or 20% or 40%, you can still sell the collateral for enough to cover your loan. (If it falls by more than 50%, as it has this year, then you are in trouble, but you have margin calls to protect you along the way; you don’t have to wait for it to fall that far.) This is the way that margin lending generally works in retail stock brokerage accounts. Of course everything is competitive and perhaps Lender will be willing to accept less than $200 worth of Bitcoin for a $100 loan. Perhaps it will feel safe with $150 of collateral, or $120. At some level of collateral, though, you stop feeling safe about the collateral: If you lend $100 of cash against $110 of Bitcoin, Bitcoin is pretty volatile, and if it goes down by 10% your loan will be undercollateralized. If you lend $100 against $110 of Bitcoin, you are making a credit decision: You’re lending the $100 not only because you think Bitcoin is good collateral but also because you think Borrower is good for the money. Certainly if you lend $100 of cash against $50 of Bitcoin, you are making mostly a credit decision; if Borrower vanishes then the best you’re going to do is get $50 back.[1] You are counting on Borrower to repay you, and you have done some underwriting to make you confident that Borrower is a good credit. Or you haven’t, I mean; Celsius has not exactly covered itself in glory in recent weeks. But let’s assume that you do, and you sensibly believe that you are making these (under-)collateralized loans to good strong businesses that should be able to pay you back even in a market downturn. But now let’s flip it around. Let’s say that you are Borrower, not Lender. You are handing over some Bitcoins and getting back dollars. You will have the use of Lender’s $100, and if you disappear Lender won’t get its money back and will have to seize your collateral. But notice that Lender has the use of your Bitcoins, and if Lender disappears you won’t get your Bitcoins back. Of course if that happens you can keep the $100.[2] But if Lender disappears with $200 of your Bitcoins then that’s not too much consolation. In other words, these transactions are completely symmetrical, and if you are posting crypto collateral with a crypto lender then you are taking their credit risk. (Notice, here, that Celsius was not in the business of keeping collateral in separate vaults with the borrowers’ names taped on them, or of taking contingent claims on assets that sat in the borrowers’ wallets: It was rehypothecating the collateral for its own use.) And so if you are a big reputable well-managed crypto firm, and you want to borrow $100 from Celsius, you might want to only post $50 of Bitcoin as collateral, not only because that is more efficient for you (you get more money for less collateral) but also because it is safer for you. If Celsius goes bust or pauses withdrawals and hangs on to your $50 of Bitcoin, well, you still have their $100, it’s fine.[3] I should say that in traditional finance there is a lot of this symmetrical risk: If I post Treasury bonds to borrow cash from you, then I have your cash and you have my Treasuries and we both want to get our stuff back and worry that we won’t. Traditional finance deals with this in various ways:  Legal regimes that give us some sort of priority claim to getting our stuff back if the other one goes bust. Third-party custody, where some super-safe entity holds the Treasuries so you can’t run off with them. The lenders (who tend to be overcollateralized — that is, I tend to post Treasuries worth more than the cash you give me back) are often big regulated banks or money-market funds, so I am relying on the regulatory system to make sure that you don’t actually go bust or run off with my Treasuries. Long-standing cultures and best practices of credit risk management where, for instance, you will do some due diligence on my credit, and I will send you my audited financial statements, and you will have concentration limits where you can’t invest all your money with me, etc.  Meanwhile … I guess you could imagine ways to deal with this in crypto? I used to joke, about everything, that “smart contracts via crypto make this super doable.” You could imagine a smart contract where I put up Bitcoins and you put up USDC and if either of us runs into some sort of problem trigger then the thing automatically unwinds. And there are things like this in the world of decentralized finance. But actual big-dollar crypto leverage seems to be built mainly on bilateral over-the-counter arrangements rather than smart contracts.[4] And some crypto lenders probably import credit-risk-management best practices from traditional finance and adapt them in smart ways to the realities of crypto! And some of them absolutely don’t. I have been writing a lot around here about how crypto is having its version of the 2008 financial crisis. One schematic way to tell the story of 2008 would be to focus on “shadow banking.” The basic business of banking is borrowing short-term from people who think their money is very safe, and invest it in longer-term loans that have some risk. That is a dangerous business, and so it is heavily regulated. And in the lead-up to 2008, people in the financial industry found ways to re-create that dangerous sort of business in ways that were less heavily regulated, so they could be more aggressive about leverage and liquidity and concentration and credit risk. And nobody realized how much of this there was, and how dangerous it was, and how interconnected it was with the rest of the financial system, until it popped. And then they did realize, and there was a broad after-the-fact crackdown on shadow banking, and now through some combination of regulation and temperament and bad memories there is just less of this sort of thing in traditional finance. Still lots! But less of it, more constrained, less leveraged. Everyone in traditional finance has seen this movie before and knows how it ends. And yet there is some … natural … human … longing … to borrow short and lend long with no equity? I dunno. Since 2008, the traditional financial industry has tried to suppress that desire. But it found a home in crypto…\" [1] Well, Bitcoin is volatile, so maybe it has gone up and you’ll get $60 back. But realistically there is probably something wrong-way about your credit risk here, and in a world in which Borrower has vanished your Bitcoin is more likely to be worth $40 than $60. [2] This is a very high-level generic statement, not a claim about the actual operations of bankruptcy law or secured financing. Depends on how Lender disappears, etc. But if it truly vanishes — sort of a plausible outcome in crypto — then I guess you keep the money. [3] Again, maybe it is not fine in some technical legal regime in which you might end up, but as a practical first cut, you’d rather have possession of the $100. [4] There are good reasons for that. For one thing, if I’m borrowing from you, it’s to do something with the stuff I’m borrowing, not to just leave it accessible to the smart contract that might recall it. For another thing, my point in the text is that somebody has to be undersecured: As long as Bitcoin is volatile, we can’t ever really have a loan where I put up $100 of Bitcoin and you put up $100 of Tether and we are both equally secured at all times. So if I put up $110 of Bitcoin and you put up $100 of cash and you vanish, the smart contract can only seize your $100 and I am left with a $10 deficit. Unsecured lending is a tough nut to crack in a purely decentralized-finance sort of way, and if I’m lending you one currency and you’re lending me another then one of us sort of has to be undersecured. ",
                    "links": [
                        "https://link.mail.bloombergbusiness.com/click/28218867.329581/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9vcGluaW9uL2FydGljbGVzLzIwMjItMDYtMjgvZG9uLXQtY2hlYXQtb24tdGhlLWV0aGljcy1leGFtP2NtcGlkPUJCRDA2MjkyMl9NT05FWVNUVUZGJnV0bV9tZWRpdW09ZW1haWwmdXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV90ZXJtPTIyMDYyOSZ1dG1fY2FtcGFpZ249bW9uZXlzdHVmZg/620f3d1b1d26b923a7d72fe9Bff35df08",
                        "https://link.mail.bloombergbusiness.com/click/28218867.329581/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9vcGluaW9uL2FydGljbGVzLzIwMjItMDYtMTMvbWVyZ2VyLWJ1eWVyLXMtcmVtb3JzZS1zb21ldGltZXMtd29ya3M_Y21waWQ9QkJEMDYyOTIyX01PTkVZU1RVRkYmdXRtX21lZGl1bT1lbWFpbCZ1dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX3Rlcm09MjIwNjI5JnV0bV9jYW1wYWlnbj1tb25leXN0dWZm/620f3d1b1d26b923a7d72fe9B358452d7",
                        "https://link.mail.bloombergbusiness.com/click/28218867.329581/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9vcGluaW9uL2FydGljbGVzLzIwMjItMDYtMjMvcmV2bG9uLWlzLWdldHRpbmctbWVtZWQ_Y21waWQ9QkJEMDYyOTIyX01PTkVZU1RVRkYmdXRtX21lZGl1bT1lbWFpbCZ1dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX3Rlcm09MjIwNjI5JnV0bV9jYW1wYWlnbj1tb25leXN0dWZm/620f3d1b1d26b923a7d72fe9B9da17822",
                        "https://link.mail.bloombergbusiness.com/click/28218867.329581/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9vcGluaW9uL2FydGljbGVzLzIwMjItMDYtMTMvbWVyZ2VyLWJ1eWVyLXMtcmVtb3JzZS1zb21ldGltZXMtd29ya3M_Y21waWQ9QkJEMDYyOTIyX01PTkVZU1RVRkYmdXRtX21lZGl1bT1lbWFpbCZ1dG1fc291cmNlPW5ld3NsZXR0ZXImdXRtX3Rlcm09MjIwNjI5JnV0bV9jYW1wYWlnbj1tb25leXN0dWZm/620f3d1b1d26b923a7d72fe9C358452d7",
                        "https://link.mail.bloombergbusiness.com/click/28218867.329581/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9uZXdzL2FydGljbGVzLzIwMjItMDEtMjcvY2Vsc2l1cy1zLTE4LXlpZWxkcy1vbi1jcnlwdG8tYXJlLXRlbXB0aW5nLWFuZC1kcmF3aW5nLXNjcnV0aW55P2NtcGlkPUJCRDA2MjkyMl9NT05FWVNUVUZGJnV0bV9tZWRpdW09ZW1haWwmdXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV90ZXJtPTIyMDYyOSZ1dG1fY2FtcGFpZ249bW9uZXlzdHVmZiN4ajR5N3Z6a2c_c3JlZj0xa0pWTnFuVQ/620f3d1b1d26b923a7d72fe9B7f159df9",
                        "https://link.mail.bloombergbusiness.com/click/28218867.329581/aHR0cHM6Ly9ibG9nLmNlbHNpdXMubmV0d29yay9hLW1lbW8tdG8tdGhlLWNlbHNpdXMtY29tbXVuaXR5LTU5NTMyYTA2ZWNjNg/620f3d1b1d26b923a7d72fe9Befad2c4d",
                        "https://link.mail.bloombergbusiness.com/click/28218867.329581/aHR0cHM6Ly93d3cuYmxvb21iZXJnLmNvbS9vcGluaW9uL2FydGljbGVzLzIwMTctMTEtMTkvdXAtbmV4dC1jcnlwdG9jdXJyZW5jeS1nb2VzLXRvLXRoZS1tb29uP2NtcGlkPUJCRDA2MjkyMl9NT05FWVNUVUZGJnV0bV9tZWRpdW09ZW1haWwmdXRtX3NvdXJjZT1uZXdzbGV0dGVyJnV0bV90ZXJtPTIyMDYyOSZ1dG1fY2FtcGFpZ249bW9uZXlzdHVmZg/620f3d1b1d26b923a7d72fe9B9e657252"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.674937688574052
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/06/2022-08:20:15",
                    "content": "Thank you very much for your contribution, very interesting. My parents always told me that the loan causes problems and I grew up with that thought, the only positive thing that I can observe from all this chaos that the centralized lending platforms are causing is that we can observe it, without the need to be an important public, as it happened in the dark movement of the bags, everything there is very murky, but here it is murky but we find out, with the chaos of Do Kwon, the future chaos of Justin Sun, the stumble of 3AC and Celsius doing drowning kicks, it’s what The only good thing I see is that in the future we will be able to observe any shady movement of any lending platform without the need to be privileged spectators. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.829090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/06/2022-21:30:15",
                    "content": "    Allan_Pedersen:  Of course everything is competitive and perhaps Lender will be willing to accept less than $200 worth of Bitcoin for a $100 loan. Perhaps it will feel safe with $150 of collateral, or $120   In secured lending and more specifically in overcollateralization secured lending, above say 105% which should be sufficient to cover for liquidity drying up in the market, what is really the difference between 150% through 300% if collateral is not rehypothecable? Just looking at the different ETH vaults today, there are three options collateral level options, 130%, 145% and 170%. Obviously the more collateral held the better but does having 130% collateral ratio really make a loan more risky than 170% in the case of defaulting? In both cases MKR would be able to trade ETH in the market and recover 100% of the loan. The only reason I bring this up is as ETH prices might continue to go down and trigger liquidation, thus impacting client retention (i.e. maybe never coming back), is there anything that can be done to the collateral levels, obviously remianing overcollateralized, without impacting PEG safety and providing a longer runway for ETH price decline?Model scenarios to understand if for example a temporary collateral ratio reduction from 170% to 160% would allow MKR to retain 20% more in outsdanding DAI balances. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.086257309941521
                }
            ]
        }
    ]
}