{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/using-oasis-app-dai-repayment-failed/7224",
            "title": "Using [oasis.app] DAI Repayment Failed ",
            "index": 7224,
            "category": [
                "Miscellaneous",
                "Developers"
            ],
            "tags": [
                "tech-support"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ShiQingGuo",
                    "index": "#1",
                    "likes": "0",
                    "time": "28/03/2021-05:18:52",
                    "content": "Using oasis.app DAi repayment failed Using oasis.app and Metamask. I repaid dai to the vault on https://oasis.app/, tried several times, but the transaction failed. This is one of the repayment transactions https://etherscan.io/tx/0x7b4eecea75914f9d7f6a56b7939823e10fffe814c269b3e30d4a2659cf8a49a2 “Warning! Error encountered during contract execution [Reverted]” is displayed, but the gas limit for this transaction is obviously sufficient. In addition, I found that if the repayment amount is relatively small, it will succeed. Like this transaction of more than 1,000 DAI, https://etherscan.io/tx/0x003f68e5b24b8142bc4fb682c1d38599912dd1cf0c02479dbae940b00855306d will fail. What is the issue and how do I solve this? Please help, thanks！ ",
                    "links": [
                        "http://oasis.app/",
                        "https://oasis.app/",
                        "https://etherscan.io/tx/0x7b4eecea75914f9d7f6a56b7939823e10fffe814c269b3e30d4a2659cf8a49a2",
                        "https://etherscan.io/tx/0x003f68e5b24b8142bc4fb682c1d38599912dd1cf0c02479dbae940b00855306d"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.017857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/03/2021-23:15:08",
                    "content": "How much debt does the vault have? I think when you repay Dai you must keep the remaining debt above the dust limit (currently 5000 Dai on ETH-A vault), or repay in full. It may be reverting because you are trying to repay some Dai and result would be debt more than 0 and less than 5000 Dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.736111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ShiQingGuo",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/03/2021-01:36:02",
                    "content": "    Spidomo:  5000 Dai   thank you for your reply. My DAI debt is 178,750.51 DAI, the DAI I am trying to repay is more than 110,000 DAI, and the remaining debt is much higher than 5000 Dai. This problem has bothered me for several days, can I only pay off all my debts at once? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisB",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/03/2021-08:27:38",
                    "content": "Hey @ShiQingGuo I think it is to do with your allowance. If you check here: TAC I can see that you only have ~8,000 Dai allowance on DSProxy. We have a bit of a poor design on the current Oasis Borrow (will be fixed in the next few weeks on the new version) where it only checks if your allowance is >0 - it should really check if you have enough allowance for the input. So I would use this tool I have linked above though and increase the Dai allowance on the DSProxy to allow you to set a much higher value to let you pay back more, up to what you decide to set your allowance too. But please note that when you payback, it will then reduce your allowance by this amount (if that makes sense). Again, apologies for the experience on Oasis today, is getting much better very soon  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.401988636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ShiQingGuo",
                    "index": "#6",
                    "likes": "1",
                    "time": "29/03/2021-14:07:14",
                    "content": "I totally understand, thanks for your help ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "28/06/2021-20:07:51",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}