{
    "poll_list": [
        {
            "title": "Ratification Poll for Modify Core Unit Budget - Real-World Finance (RWF-001) (MIP40c3-SP61) - March 14, 2022",
            "index": "13152",
            "option": "Yes",
            "supporting_mkr": "66,172",
            "highest_fraction": 0.79
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152",
            "title": "MIP40c3-SP61: Modify Core Unit Budget - Real-World Finance (RWF-001) ",
            "index": 13152,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "core-unit-budget",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#1",
                    "likes": "4",
                    "time": "09/02/2022-23:59:55",
                    "content": " MIP40c3-SP61: Modify Core Unit Budget - Real-World Finance (RWF-001)  Preamble MIP40c3-SP#: 61 Author(s): @williamr Contributors: @juan, @wouter Tags: core-unit, cu-rwf-001, budget, dai-budget, active Status: Accepted Date Applied: 2022-02-09 Date Ratified: 2022-03-28 Ratification Poll URL: https://vote.makerdao.com/polling/QmXDh7RR?network=mainnet#poll-detail Forum URL: https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152   Sentence Summary MIP40c3-SP61 modifies the Dai budget for the Real-World Finance Core Unit as the Core Unit changes Facilitator, replacing MIP40c3-SP31.  Paragraph Summary MIP40c3-SP61 modifies the Dai budget for the Real-World Finance Core Unit. Based on the new vision for structured finance applications, which includes a more thorough legal review process, and the currently available funds, a higher budget cap is proposed to ensure the proper operations of the Core Unit.  Specification  Motivation As the Core Unit is going through a transition from Seb to Will as facilitator, there are three reasons that require a budget change:  A new multi-sig wallet setup has been put in place, following best practices and applying an auditor flow. Part of the new vision requires a more thorough legal review process for RWA applications with third-party reputable firms. This brings additional recurring costs with it. The runway that was originally available for the RWF CU was not fully transferred to the new multisig due to the MKR that was recently returned to the protocol. This means that the Core Unit is currently operating without the usual contingency buffer of a 3-month runway.   Core Unit ID  RWF-001   List of Budget Implementations The implementation follows best practices and is described below for transparency reasons. Thank you to all those that have contributed with your assistance for this setup.  Budget Implementation  budget diagram1117×629 68.6 KB  The budget implementation will follow standard best practices as recommended by the SES Core Unit and will involve a setup with an Auditor wallet and an Operational Wallet which will be topped up on a monthly basis with a 3-month runway. The budget cap will be streamed from the protocol to the Auditor Wallet to reduce as much as possible the overhead for Maker governance. The RWF-001 budget is designed with the following in mind:  Paying for the operational costs to run the core unit. Provide the protocol control over funds held in the Auditor Wallet. Reduce governance overhead to a minimum. Provide full transparency and be kept in check by a group of trusted auditors.   Multi-sig Wallets The following multi-sigs are involved:   The Auditor Wallet – A nested, 2-out-of-2 Auditor multi-sig, composed of 1-out-of-2 role based multi-sigs as signers. The Auditor Wallet will have 2 roles defined for its signers: Auditors and Accountants. The Accountant Role Multi-sig will have 2 signers—both SES permanent team contributors. The Auditor Role Multi-sig will also have 2 signers, also both SES permanent team contributors. SES will conduct the monthly auditing process as described in the Monthly Top-up Cycle, increasing transparency of the auditing process for the community. The Maker Protocol (MCD_PAUSE_PROXY, 0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB) will be listed as a beneficiary on the Auditor Wallet. This allows the protocol to withdraw up to 1B DAI from the Auditor Multi-sig wallet, ensuring control over these funds and acting as a backup. This multi-sig will hold funds up to the Quarterly Budget Cap in DAI and receive the DssVest stream. All funds pass through this wallet before any are sent to the Operational Wallet.   The Operational Wallet – One wallet for RWF-001 operational expenses. This is a 2-out-of-3 multi-sig controlled by RWF-001. Signers include the facilitator and trusted members of other Core Units to provide business continuity.    Monthly Budget Statement Within the first 5 days of each month, RWF-001 will submit a Monthly Budget Statement to the signers of the Auditor Wallet with the following sections:   Previous Month Actuals – The actual expenses (DAI and MKR) of the month that just ended.  Budget Forecast - A forecast of the Dai amount required to maintain a 3-month operational runway for the team based on the latest available information.  MKR Vesting Overview - A schedule of the expected MKR vesting amounts for the current team configuration, grouped by the pay-out month.  Transactions  The required DAI amount sent from the Auditor Wallet to the Operational Wallet to replenish the 3-month runway as indicated in the Budget Forecast section. Any excess DAI amount above the 3-month forecast in the Operational Wallet that will be returned to the Auditor Wallet    The Monthly Budget Statements can be found in this GitHub repository - WIP.  Monthly Top-up Cycle   Monthly Budget Statement Submission – Within the first 5 days of the month, RWF-001 submits the Monthly Budget Statement to the Auditor Wallet signers. This report is also available for the rest of the community to review.   Transaction Requests Submission – In parallel, RWF-001 submits the necessary transaction requests for the Auditor Wallet signers to sign:  DAI Top-up Transaction – One DAI transaction for the Operational Wallet that adds enough funds to the Operational Wallet to replenish the forecast 3-month runway. Only applies if the Operational Wallet balance is below this forecast.    Returning Excess Funds – RWF-001 creates and signs any transactions for excess funds that should be returned to the Auditor Wallet:  Excess DAI Transactions – DAI transactions for Operational Wallets that have a balance above the 3-Month Budget Forecast will be returned to the Auditor Wallet.    DssVest Pull - The Auditor Wallet signers will pull available funds from the RWF-001 DssVest contract, replenishing the available funds in the Auditor Wallet.   Auditors’ Review – The Auditor Wallet signers review the Monthly Budget Statement. First, Accountant Role signers will review the initial report submitted by RWF-001 to ensure data accuracy and report completeness. A consistent audit checklist will be followed. The Auditor Role will then receive the Accountant’s report generated from the checklist, and verify the Accountant’s findings. A summary of each audit cycle’s report will be made available to the Maker Community at the conclusion of the audit cycle on the RWF-001’s transparency reporting repository on Github.   Transaction Approvals – Upon acceptance of the Monthy Budget Statement audit, an Accountant Role signer and an Auditor Role signer will sign the requested transactions, sending the DAI top-up amounts to the Operational Wallet.   Auditor Wallet Returns – The Auditor Wallet signers will return any amount of DAI above 2x the Monthly Budget Cap. The Auditor Wallet, using the DssBlow contract described here, will return the excess DAI directly to the surplus buffer. As such, the Auditor Wallet will then hold up to 2x the Monthly Budget Cap at the start of the month, allowing DssVest to stream DAI up to the Quarterly Budget Cap over the course of the month.    Auditor Wallet Signers RWF-001 Auditor Wallet: 0x96d7b01Cc25B141520C717fa369844d34FF116ec  Accountant Role Wallet (0xA2A855Ac8D2a92e8A5a437690875261535c8320C) as a signer Auditor Role Wallet (0xB2da57e224949acDDe173a5b8A8160c023ea86e6) as a signer Add MCD_PAUSE_PROXY as a beneficiary, with an allowance of 1B DAI withdrawal. Configure required confirmations as 2-out-of-2.   Operational Wallet Signers RWF-001 Operational Wallet: 0xD1505ee500791490DE8642353BA6A5b92e3550F7   @williamr (RWF-001 Facilitator)- 0x44d2509074993b858c54B6d276ebD3816FC93A68   @Nadia  (Growth Core Unit) - 0xc8E6c287F6c127AFE5e4CB30bC440607b44c35f8   @monkey.irish (Collateral Engineering Services Core Unit) - 0xDE0FF661Fb2d06d4F787dd23A579D64c6989BdA1    Transactions   Seed Transfer 2,055,000 DAI will be transfered to 0x96d7b01Cc25B141520C717fa369844d34FF116ec on 2022-4-1. This seed transfer repairs the 3-month runway contingency buffer. It equals the quarterly budget cap of 2,055,000 DAI.   DssVest Stream A total of 6,165,000 DAI will be streamed to 0x96d7b01Cc25B141520C717fa369844d34FF116ec starting 2022-04-01 and ending 2022-12-31.   Decommission the previous DssVest Stream with ID 27    Budget Breakdown     Budget Category Monthly Quarterly Annually % Budget     Compensation $155,000 $465,000 $1,860,000 22.6%   Profesional Services $500,000 $1,500,000 $6,000,000 73.0%   Real-world structures $4,000 $12,000 $48,000 0.6%   Payment fees $8,500 $25,500 $102,000 1.2%   Gas Fees $500 $1,500 $6,000 0.1%   Software Costs $5,000 $15,000 $60,000 0.7%   Travel Costs $2,000 $6,000 $24,000 0.3%   Contingency Buffer $10,000 $30,000 $120,000 1.5%   Total Budget Cap $685,000 $2,055,000 $8,220,000 100.0%     Contributors Given the increase in dealflow as well as sophistication of counterparties, the pool of contributors will be biased towards senior risk professionals primarily (e.g., structured finance, credit risk management). This group will be tasked with professionalising the function and assisting building best practices that can be leveraged or improved upon by a wider group of specialised core units. We will deliberately and intentionally prepare and assist senior professionals to gain the required know-how to set up and run specialised core units. Thus enabling decentralisation and scaling of activities with the original vision for Risk in mind. Contributors will work closely and collaboratively with other CUs involved in the end-to-end dealflow: Growth, CES, PECU, Oracles, Compliance (in incubation), SES. The team will be composed of the following roles: Facilitator: Ability to guide, manage and take over the work of any risk management member of the team. Structured finance consultants (x3): Dealing with Asset Originators/Manager from the negotiation phase, due diligence phase, up to the monitoring phase. Competencies in structured finance, risk assessment, modeling, statistics, analytics. They also have a transactional legal understanding to collaborate with legal consultants. Consultant lawyer (x1): Dealing with Asset Originators/Managers from the negotiation phase, legal due diligence phase, up to the monitoring phase. Competencies in areas of the law related to structured finance transactions such as bankruptcy, commmercial law, debt restructuring etc. Given this is a specialised area, this role is the primary intermediary with external reputable law firms as well as borrower legal counterparts. It is expected that the legal consultant will eventually be part of a dedicated group or panel of legal consultants, supporting structured finance transactions, but as part of a separate specialised Core Unit. Expert grantees (x4 part-time): The grants are used for senior contributors/experts to assist in specialised structured finance transactions e.g. asset specific know-how, regulatory or jurisdiction specific experience. Eventually, grantees might either rejoin other consultants or be deliberately assisted in incubating Core Units to scale transactions. Advisory grantees: Advisory grants are dedicated to assisting the Core Unit in scaling and improving its internal processes in both risk management and end-to-end dealflow.  Professional Services Solicitor members of the team have onboarded law firms (Shearman & Sterling, Lathan & Watkins, MinterEllison) to help us audit RWA structures and guide us through legal solutions/issues. Given the increasing number of counterparties and complexity of structures, costs have increased significantly.  Real-world structures Following the trust model for RWA, an RWA Foundation was set up in the previous facilitation. Currently, this remains unutilised. However there is an yearly cost of ~50k DAI. If no legal research points to the utilisation of such structure in the coming year, funds allocated to its maintenance will be reallocated elsewhere or returned to the protocol.  Software costs Risk teams will require access to a set of software packages to assist the analytical work during due diligence and post due diligence monitoring of onboarded structured finance transactions. While a robust data infrastructure is not a short term priority (i.e. 2022Q1), building data capability for team members to monitor transactions and gather insights faster will be a focus later in the year. We expect to collaborate with other teams such as CES in the architecture.  Buffer Extra safety in case of unexpected costs such as unaccounted SaaS subscriptions, over charges in legal fees etc.  MKR compensation For reference, MKR compensation was proposed here. This will be reviewed in the near future. ",
                    "links": [
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/rwf-001-auditor-flow/12900",
                        "https://forum.makerdao.com/t/returning-excess-budget-from-rwf-in-dai-or-in-mkr/12643",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/2X/a/ad48ce03e062b6c16179c6047f7a355dbdf853c7.jpeg",
                        "https://github.com/Lollike/dss-blow",
                        "https://forum.makerdao.com/t/mandate-risk-teams/282",
                        "https://forum.makerdao.com/t/mip40c3-sp38-real-world-finance-core-unit-mkr-compensation-rwf-001/10447",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2",
                        "https://forum.makerdao.com/t/monthly-governance-review-march-2022/14428",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968/14",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/46",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-marzo-de-2022/14181",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-14-de-marzo-de-2022/13917",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906",
                        "https://forum.makerdao.com/t/weekly-mips-update-77/13706",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968/2",
                        "https://forum.makerdao.com/t/mip41c4-sp39-rwf-0x-core-unit-facilitator-onboarding/16969/2",
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967/2",
                        "https://forum.makerdao.com/t/short-take-exciting-news-and-opportunity-for-rwa-teams/16849",
                        "https://forum.makerdao.com/t/kredika-mip6-application-pilot-vault-for-a-portfolio-of-bridging-loans-secured-with-uk-based-properties/15051/27",
                        "https://forum.makerdao.com/t/short-take-return-of-excess-funds-2m-dai/16846/7",
                        "https://forum.makerdao.com/t/rwf-001-monthly-update-april-2022/15024"
                    ],
                    "GPT-summary": "The post presents a proposal to modify the Dai budget for the Real-World Finance Core Unit. The proposal is motivated by the transition of the Core Unit's facilitator and the need for a more thorough legal review process for RWA applications. The post provides a detailed specification of the budget implementation, including multi-sig wallets, monthly budget statements, and transaction approvals. The post also includes a breakdown of the budget categories and the contributors' roles. The proposal has been accepted and ratified.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.653780451574569
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/02/2022-00:01:20",
                    "content": "@prose11 @blimpa I am locking a placeholder here to update the MIP during the RFC phase. It requires minor completions. This proposal is to be taken into account this current cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "4",
                    "time": "10/02/2022-14:28:30",
                    "content": "Just publicly confirming  I think your work here elevates what we have referred to as a “placeholder” in the past, so no need to worry. The point of RFC is that you are still generating comments and planning edits to improve the proposal. Just keep in mind that final changes need to be made before March 2nd if you would like this to be voted on in the March cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#4",
                    "likes": "1",
                    "time": "17/02/2022-20:52:06",
                    "content": "How many FTEs are you envisioning for this budget? I’m assuming the Facilitator, 3x structured finance consultants, and 1x consultant lawyer are all full-time, but could you please confirm that as well as the expert grantees? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#5",
                    "likes": "1",
                    "time": "18/02/2022-04:51:59",
                    "content": "The short term estimate (April 2022) are 5.7 FTE. Not all consultants (Structured credit, legal) are a full FTE at the moment (range 70-100% capacity). Grantees are expected to be at 50% FTE each. Advisory are capped to ~25h/month. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#6",
                    "likes": "3",
                    "time": "24/02/2022-15:41:27",
                    "content": "Could you expand a bit on why the requested monthly budget is increasing from 155k/month to 285k/month? What is causing the increased spend? Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#7",
                    "likes": "4",
                    "time": "24/02/2022-21:48:22",
                    "content": "Yes, absolutely. Two main contribution factors. First, and most important, are the professional services (external) fees. These are fees to cover lender side reviews by external reputable lawfirms. These are crucial to safeguard Maker by assessing key issues in borrower proposed legal structures and to do contractual reviews on documentation. These external firms do the heavy-lifting of the legal review, which enhances credibility and professionalism of Maker’s due-diligence process as is customary to have these in “standard market” transactions. The previous 20K/month was largely under-covered for world-class lawfirms review. It’s also the class of the budget with the highest variability/uncertainty as is demand driven (i.e. number and complexity of deals in legal DD at anytime). The intention as we evolve is to pass on that lender transactional cost to borrowers as is customary market practice. The advantage of the current setup of the RWF-001 Auditor Flow is that it brings full transparency/auditability and option for the protocol to clawback excess funds if unutilised for any specific budget class. e.g. professional services. Second, the compensation bucket has increased to account for (1) increased capacity from senior consultants, previously involved in a part-time basis, as well as (2) to bring more experts/specialists to work on DD deals that require specific industry or jurisdiction knowledge e.g. ESG project finance, European private credit transactions etc. ",
                    "links": [
                        "https://forum.makerdao.com/t/rwf-001-auditor-flow/12900",
                        "https://github.com/makerdao-rwf001/transparency-reporting"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.6569664902998245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#8",
                    "likes": "2",
                    "time": "03/03/2022-08:39:58",
                    "content": "Important update to the budget: @Gala The professional services line of the budget has been updated to reflect a truer and more realistic view of external legal firms costs to the DAO, after consultation with @christiancdpetersen on the per transaction cost of external lawfirm legal review at 250K/transaction. This excludes transaction documents drafting. The table below provides an estimate, assuming # of transactions per quarter:     # Tx per Q Cost M (no draft) Cost Q (no draft) Cost Y (no draft)     4 $333,333 $1,000,000 $4,000,000   6 $500,000 $1,500,000 $6,000,000   8 $666,667 $2,000,000 $8,000,000    The budget submitted has been provided with the following assumptions:  6 transactions per quarter are reviewed transaction costs on lender side review are paid by the lender transaction costs do not include agreement drafting. this adds extra cost each individual transaction (excl. draft) costs 250K in external legal review 250K/transaction assumes new transactions rather than transaction upgrades or repeats  It goes without saying that in case lender side reviews are paid in full by the borrower (assumption # 2), the required budget reduces substantially. A fully detailed transparency report will be provided with evidence to each lawfirm budget on a monthly basis to the auditor. Should for any reason the transaction documents be drafted by the lender side legal counsel this adds 350K on top of the 250K per transaction. Unused funds destined to cover legal costs will be returned to the Auditor wallet. Once the upcoming RWA Legal CU is incubated such budget will move away from the RWF CU. FYI: @wouter @juan @retro ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.893578643578644
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#9",
                    "likes": "1",
                    "time": "03/03/2022-08:48:59",
                    "content": "@prose11 @blimpa I am submitting this MIP for formal submission. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "2",
                    "time": "03/03/2022-11:44:40",
                    "content": "    williamr:  each individual transaction (excl. draft) costs 250K in external legal review   Wowzers! This is breaking my heart. For MakerDAO to make its money back, it would have to onboard Billions of Quality RWA collaterals that pay a lot more than 200-300 basis points. Or Billions of AAA paper. $250,000 per legal review, eh? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#11",
                    "likes": "1",
                    "time": "03/03/2022-11:53:09",
                    "content": "    williamr:  These are fees to cover lender side reviews by external reputable lawfirms. These are crucial to safeguard Maker by assessing key issues in borrower proposed legal structures and to do contractual reviews on documentation. These external firms do the heavy-lifting of the legal review, which enhances credibility and professionalism of Maker’s due-diligence process as is customary to have these in “standard market” transactions.   This is such an important need. While the cost may increase, it is better practice, generally, to be proactive as opposed to reactive. It typically saves money in the long run. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.628205128205128
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#12",
                    "likes": "3",
                    "time": "03/03/2022-11:53:48",
                    "content": "Welcome to the real world. If the DAO wants to do things properly and by the best in class, that is the cost. Not unusual at all for top experienced structured finance law firms to charge upwards of 1K/hour. Of course, it is customary borrowers pay for that, but there is resistance to do that in the community. I’d definitely say not doing at all is not advisable in any circumstance. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#13",
                    "likes": "11",
                    "time": "03/03/2022-15:10:29",
                    "content": "    williamr:  Important update to the budget: @Gala   Wanted to call out this change to the community and make sure voters and @Recognized-Delegates saw the edit. This post confirms that GovAlpha is allowing the edit to be included when the proposal is formally submitted. While the submission of this update did take place a few hours past the deadline for the frozen period, we felt that it wouldn’t make sense to make the team wait another month to have this considered based on that small delay. In the past we have rejected late proposals because they have come in during or after the Governance and Risk Call, where we formally announce submissions. Since this edit was only slightly delayed, @LongForWisdom and myself have had time to discuss its inclusion and come to an agreement before today’s call takes place. This should not be seen as an encouragement to bend rules or submit proposals past deadlines, but rather a reflection that decentralized governance requires some amount of flexibility, and we should use discretion when the spirit of our procedures is followed and there is enough time for consideration to be given. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.651515151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#14",
                    "likes": "2",
                    "time": "03/03/2022-18:06:02",
                    "content": "    prose11:  This should not be seen as an encouragement to bend rules or submit proposals past deadlines, but rather a reflection that decentralized governance requires some amount of flexibility, and we should use discretion when the spirit of our procedures is followed and there is enough time for consideration to be given.   Glad to see this flexibility exercised. It should also be recognized that @williamr is located in an eccentric time zone.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#15",
                    "likes": "5",
                    "time": "03/03/2022-18:43:10",
                    "content": "It is market in the US for borrowers legal costs, except for our own Maker blockchain headaches. But it does encourage bigger deals.  And repeat deals are typically much cheaper as they are fairly cookie cutter. But if Maker does have to pay $250k for a $200mm deal, that would be about 13 basis points. And the costs of screwing up a deal, legal structure wise, can be far far more ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.65
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#16",
                    "likes": "1",
                    "time": "03/03/2022-18:55:53",
                    "content": "@Eumenes good call-out. I’ve amended that assumption in the budget comments. Assumption of 250k/transaction for brand new deals rather than repeats. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.090909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#17",
                    "likes": "1",
                    "time": "03/03/2022-22:57:05",
                    "content": "    prose11:  In the past we have rejected late proposals because they have come in during or after the Governance and Risk Call, where we formally announce submissions. Since this edit was only slightly delayed, @LongForWisdom and myself have had time to discuss its inclusion and come to an agreement before today’s call takes place.   @prose11 I appreciate the review on the budget at short notice. It required obtaining further information on realistic legal costs given the existing work in progress and forecast assumptions. I’ll make efforts on a best endevour to prevent this from happening in the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.324999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#18",
                    "likes": "14",
                    "time": "04/03/2022-12:43:58",
                    "content": "Thank you to all for the comments. As I am supporting RWF on the legal side with the intention to incubate a Legal Core Unit to support RWF and Strategic, please allow me to give some background. (1) High quality law firms are expensive. To date, I have sought to ensure that we have the support of top tier firms with broad geographic and sector practices (real estate, securitization, project finance, etc.). (2) As @luca_pro has noted in other threads, the integration of DeFi and real world finance is challenging. We benefit from the breadth and resources of high quality firms. (3) To date, Maker does not have a financing “sweet spot” that will allow us to focus on one type of financing or asset class. Thus, many of the initial deals will be cases of first impression for Maker. We need the support of firms to understand whether the proposed deal is “commercial” for that particular market. (4) Maker does not have geographical limitation. This is an important consideration as it requires us to access firms across the world (e.g. SocGen requires us to have support from a firm with French law experience) and, more importantly, reconsider and/or re-invent the DeFi/Real World integration piece for each deal. A deal originating in Europe or India has very different considerations. A firm with global reach and experience in various jurisdictions allows us to leverage that reach and experience. As I note in the introduction, I am in the preliminary stages of going through the SES incubation process for a legal core unit to support real world finance and strategic finance. In due course, to leverage our successes in real world finance, my plan will be to create a “panel” of law firms. In return for deal flow, we can negotiate better pricing. To date, as we are on the cutting edge of financing, I have sought the support of law firms where I personally have worked with partner-level lawyers (whether on the same side of a deal or on opposite sides). That personal connection helps to introduce our objectives and Maker. Also, to help a potential MIP6 applicant, I have recommended one of the existing firms assisting on a Maker transaction to a potential applicant for another deal. At the end of the day, my commitment to the Maker community will be the same, ensure high-quality legal support in the most cost effective manner. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.646239837398373
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#19",
                    "likes": "3",
                    "time": "04/03/2022-14:52:38",
                    "content": "    christiancdpetersen:  At the end of the day, my commitment to the Maker community will be the same, ensure high-quality legal support in the most cost effective manner.   This is a goal of mine as well. This is very important. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 6.819999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#20",
                    "likes": "3",
                    "time": "06/03/2022-18:20:53",
                    "content": "As much as I have respect for RWA team, I afraid that without proper accountability, this might become too big to fail. So now we realized the cost is much higher than expected mainly in legal fees. Realistically, is it possible to narrow down certain focus to increase the success rate while reducing the cost? For example, if one of the biggest challenges is that the protocol needs global lawyers from all around the world as collateral applications are global, maybe it’s feasible to start with applications from few jurisdictions before moving into other parts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.789332399626518
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#21",
                    "likes": "5",
                    "time": "06/03/2022-21:14:48",
                    "content": "@Doo_StableLab Thanks for your questions. You raise very relevant elements. Let me try to point out some considerations that derive from it:   The jurisdiction focus does not affect the cost so much. Whether you focus on transactions where you need NYC, London, Singaporean, Cayman Is. law firms the base cost for review will be largely the same for top-tier firms (250K/tx on average).   The use of top tier law-firms vs less reputable firms (regional, smaller) may have an effect on cost. The question for the DAO then could be about excellence, experience and credibility of review.  Is the DAO ok to have a 3rd tier or lower lawfirm advising on 1/2 Billion transactions? Is there a risk of having to engage more than one lawfirm for a transaction, therefore increasing the cost, if a firm supporting a transaction does not have the same excellence or standards of a reputable lawfirm? Could we assign lower tier lawfirms (supposedly less expensive) for lower ticket transactions (e.g. < SB value) and higher tier firms to big tickets? That’s a very relevant consideration.    The use of a lawfirm for new transactions vs repeat transactions may affect cost. The first transaction done with a counterparty will naturally be more expensive, repeat transactions there onwards with the same counterparty & lawfirm reduces the cost.  At what point is it reasonable to focus on repeatable transactions vs new ones? Repeatable transactions don’t they increase counterparty risk (centralisation of structures with few borrowers)? If the focus is on repeatable transactions, should we focus on counterparty risk with established players with credit track record or start-up asset managers? This is a key question. What is the success rate of repeatable vs new transactions? Success rate is defined as the rate of a deal being concluded (vault created), after legal review, which is not guaranteed as there are also credit considerations. A deal might have a great legal structure but poor credit, or vice-versa. Currently we do not have enough data to answer this.    The creation of a panel of lawfirms that are frequently used for DAO transactions does affect cost. If the DAO has a relatively small number of lawfirm players that are assigned the bulk of the review work and the expected volume is significant enough, there is naturally more bargain power to negotiate better base cost or retainers. The questions are then:  Shall we focus on the creation of a panel on top tier lawfirms or low-tier less reputable ones? How will that affect credibility of review again?    In a nutshell, the considerations above are of two natures. (1) DAO RWA focus in its construction of lending portfolios and which firms are assigned to which transaction. e.g. Emerging vs established counterparties, success rate of new vs repeat transactions etc (2) Procurement nature. Do we have enough bargain power to negotiate better/more reasonable terms. Is the strategy to focus on top tier vs regional firms. I hope these cost considerations shed some light on your questions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.629215276249174
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#22",
                    "likes": "1",
                    "time": "06/03/2022-21:35:06",
                    "content": "All this lawyer expense. Is there a legal structure invented to lend safely to borrower that is credit worthy? If no… when will that be invented? Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.722222222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#23",
                    "likes": "6",
                    "time": "06/03/2022-21:47:53",
                    "content": "    williamr:  The jurisdiction focus does not affect the cost so much. Whether you focus on transactions where you need NYC, London, Singaporean, Cayman Is. law firms the base cost for review will be largely the same for top-tier firms (250K/tx on average).   As a practicing attorney (admitted in NY) I can agree with this. Generally, these larger firms are international, especially involving this subject matter. I think it’s important to keep in mind every situation is different. One of the benefits of these larger firms is they do mostly everything in house. Possibly, depending on the facts of the transaction, it may make sense to retain a less expensive firm but I think that is really fact specific. There are ways to try and cut costs and I think the proposed Legal Network Coordination Core Unit - LNW-001 could handle the vetting of the firms and more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.063852813852813
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#24",
                    "likes": "6",
                    "time": "06/03/2022-23:43:12",
                    "content": "    Doo_StableLab:  As much as I have respect for RWA team, I afraid that without proper accountability, this might become too big to fail.   I can understand and appreciate the concern. However, if Maker intends to expand its real world financing activities to the billions and at an international scale, then legal costs are a necessary (but manageable) evil. The easiest way for us to reduce or eliminate our costs is to make the potential borrower pay (as noted by @williamr above). We can also seek to reduce costs on a project by project basis. For instance, using lower cost firms in non-traditional finance jurisdictions. But this to carries risks as these lower cost firms may not be familiar with specific market practice (I regularly see evidence of that). And non-traditional finance law firms will be unlikely have the experience and resources to manage cross-border transactions (nearly all of our transactions will be cross border because of the DeFi integration piece). At present, we do not have any regularity in terms of potential borrower-types, asset classes, and/or jurisdictions to do this effectively. We can also look to standardize the basic financing agreements (for instance, adopting the Loan Market Association documentation https://www.lma.eu.com). When I was in Hong Kong, LMA agreements were the standard for many financings. Of course, the lenders did not accept much in the way of changes! Finally, we need to remember that external legal support indirectly provides an independent, third party check on a particular real world transaction. This is critical for a protocol based on “trustlessness”. For sure, if we expand Maker’s real world financing activities without legal support, we will be too big and the risk of failure will be heightened. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.128289473684211
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#25",
                    "likes": "0",
                    "time": "06/03/2022-23:56:06",
                    "content": "    christiancdpetersen:  Finally, we need to remember that external legal support indirectly provides an independent, third party check on a particular real world transaction. This is critical for a protocol based on “trustlessness”. For sure, if we expand Maker’s real world financing activities without legal support, we will be too big and the risk of failure will be heightened.   Agreed. And I think there might be ways to attempt to try and cut costs. However, legal support is key and should be prioritized. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#26",
                    "likes": "1",
                    "time": "07/03/2022-03:04:12",
                    "content": "Thank you for the detailed response. Unfortunate to hear that different jurisdictions don’t affect the cost much but interesting to hear ways to reduce the cost and reasonings behind them  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#27",
                    "likes": "3",
                    "time": "07/03/2022-16:36:05",
                    "content": "One typical way to mitigate these costs is for Maker to focus on large transactions and also require the borrowers to pay the lender’s legal costs which is the usual real world legal standard ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.284013605442177
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#28",
                    "likes": "7",
                    "time": "07/03/2022-21:35:17",
                    "content": "Given the scale of the proposed budget increase (7x Q4 RWF cash burn), eight figures annually including the 3-month upfront contingency payment, we believe the DAO should receive more detail and substantiation. Additionally, the milestones the proposal implies are very ambitious and Governance should be confident the team can execute should the proposal pass.  An Ambitious Budget Requires a Structured and Coherent Plan The attached budget suggests, at ~$250K per transaction, that 24 deals in the next twelve months will be achieved. However, the proposal focuses on locking in the commitment from the DAO without showing the corresponding plan and pipeline that would deliver these transactions. Taking only professional service expenses for simplicity, let’s assume 100% of deals where lawyers are engaged turn into vaults. Let’s also assume the net interest margin on these vaults is in the 2% range. In order to breakeven in year one on the service expenses alone, these activities will need to deliver $300M in new borrowings for a year.     Net Interest Spread Total Implied Net New Borrowings Per Txn Avg Implied Net New Borrowings     3% $200m $8.3m   2% $300m $12.5m   1% $600m $25.0m    Individually, the breakeven for each vault doesn’t seem crazy or unachievable. However, the total volume projected by this budget is very large in historical terms. Is there a concrete plan and pipeline behind this substantial increase in deal volume? If the projected cost per transaction is more or less the same regardless of the size of the deals, this would suggest onboarding larger vaults is the best strategy. However, for fewer, larger vaults, this would imply needing much less budget for legal fees. Net, there is a lack of clarity on what the pipeline and plan will be. Furthermore, linked to this budget, some questions remain:  Pipeline  Could you please share a detailed plan with the community regarding deal completion, by month? Is there a pipeline to support this level of onboarding? How many are already at the MIP6 published stage? How will the RWF team track progress towards reaching this goal? How does the RWF team plan to communicate progress to the community? What risks are there to completing two transactions per month? Could you please share how you plan to scale with the community? (i.e. 3 TXs in Q2, 6 in Q3, etc.)      Deal Est. Closing Date Probability of Completion DC Potential Est. Professional Service Expense     Partner A 30-Apr-2022 50% $100m $250k   Partner B 30-Apr-2022 75% $50m $100k   etc         Execution  Do we have the right resources in place from other teams to support achieving this scale? CES, PE, etc. How many RWF FTEs per month will be dedicated to this effort? When will your envisioned full-time team be hired by? What is the highest DC RWF believes we can onboard given various SB levels (current, higher, lower)? Same question for duration and stability fees. Regarding your target of 24 transactions a year and the need of significant size to absorb the setup costs, have you thought about a capital at risk metric? Is it in line with the current Surplus Buffer? Do you expect to immediately spend $685K if this budget passes in April? If not, could you please provide a monthly breakdown for how the actual expenses will scale to the envisioned future state? (see snapshot below for format)  We’ve provided a template with the information we believe will help provide Governance what it needs to make an informed decision on this proposal.  image970×401 53.4 KB   Recommendation & Proposed Next Steps A lot of the discussion thus far has focused on how expensive lawyers are. With legal advice, most of the time you get what you pay for, and it’s rarely a good idea to skimp on important legal expertise. We believe this is missing the point somewhat. For the right plan with the right return perspective, any conceivable amount is a worthwhile investment in professional services. However, we believe Governance should have full confidence in the plan that the budget requires first, rather than focus on the hourly rate of the lawyers in a budget with no outlined plan. Could we kindly propose the actual plan and aforementioned details are first shared with the community, before finalizing the associated budget required to execute? Doing so will ensure MKR holders are on the same page and can confidently spend >10% of recurring income to fund this initiative. Sensitivity Analysis - Required Dai Lent for Year 1 Breakeven, based on TXs & NI Spread % Signed: @Aes @SebVentures @adcv CC: @Recognized-Delegates given the advanced stage of the proposal ",
                    "links": [
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246/17"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.763319418676561
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#29",
                    "likes": "8",
                    "time": "08/03/2022-01:44:27",
                    "content": "    Aes:  If the projected cost per transaction is more or less the same regardless of the size of the deals, this would suggest onboarding larger vaults is the best strategy. However, for fewer, larger vaults, this would imply needing much less budget for legal fees.   From the expense side of the ledger, $250K is a good-faith, ball-park estimate based on the deals before the RWF CU as of January 1, 2022. We cannot assume that the project cost per transaction is more or less the same. Each transaction is very different. These differences include: (1) jurisdiction of the loan (each jurisdiction has its own financing issues (creation and/or perfection of security interests, withholding tax on interest payments, regulatory approvals, etc.)), (2) the need to evaluate the jurisdiction of the DeFi integration piece (to date, we have evaluated Cayman Islands, Jersey, BVI, and UAE free trade zones), (3) the asset class (real estate vs. trade receivables vs. “buy now/pay later” vs. “clean energy” etc.), and (4) the peculiarities of the deal proposed by the borrower. Again, from the expense side of the ledger, I would have thought that we are better having the budget approved and funds not spent, than being in a situation where we cannot on-board an attractive transaction in Q3 2022 because (1) we did not envision that Q3 transaction in March 2022, and (2) we are unable to engage a law firm because we do not have adequate funds.     Aes:  A lot of the discussion thus far has focused on how expensive lawyers are. With legal advice, most of the time you get what you pay for, and it’s rarely a good idea to skimp on important legal expertise. We believe this is missing the point somewhat.   Thank you. I wholeheartedly agree.     Aes:  For the right plan with the right return perspective, any conceivable amount is a worthwhile investment in professional services. However, we believe Governance should have full confidence in the plan that the budget requires first, rather than focus on the hourly rate of the lawyers in a budget with no outlined plan.   @williamr will address the “plan” for 2022. My only personal observation on this point being that, at present, Maker has not found its “sweet spot” and, if I am honest, the “real world finance” hypothesis is still untested (given that DeFi lending to the real world has not been done at scale). It may take us some time to find that “sweet spot” - it will depend on the macro climate, deal pipeline, and our successes. I think your questions are excellent and justify a cogent response. I will simply add that, as a lawyer, I fully recognize that legal services are an expense for the protocol and not a revenue. In my support of Maker, I will do my best to manage those expenses. I note, however, we will not succeed if we do not plan for success. Maker should not be in a position where it turns away a deal because it cannot engage legal counsel due to lack of budget, all as a result of not having imagined success. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.007976190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#30",
                    "likes": "7",
                    "time": "17/03/2022-04:39:31",
                    "content": " Modify Core Unit Budget Clarifications @aes Thank you for your questions. I hope the below will provide answers and information for MKR tokenholders to make an informed decision on the budget. First, before I cover the deal economics and workflow to address delivery, a few considerations on budget:  A budget in the setup of this CU multisig is not a “blank check” without checks. The operational multisig has no direct access to funds from the DssVest (see implementation diagram). It reports its budget forecast and actuals to the Auditor and only receives funds from the Auditor wallet once the auditing passes. There is a fixed and variable cost to legal fees in each transaction. Professional services (external legal fees) is mostly a variable cost and credit demand driven. If borrowers approach Maker for financing, there is transaction cost. If they do not, there is no transactions and therefore no incurred cost. Also, no revenue. A budget for professional services is there to support an operational function, if and when there is a need. In reality it could stay in the DssVest forever and never be used.  If the budget is available at the DssVest level, and there is credit demand, it can support a legal review need.  If the budget is not available, and there is credit demand (i.e. a legal functional need), the transaction may never occur/be closed.   External legal fees are a part of transaction negotiation. Market practice says the borrower pays lender fees. There is a caveat though. Maker is not a normal lender. Borrowers that see the “defi risk” as a risk of higher legal review costs can and are more likely to ask Maker to pay its own lender-side legal bills. The assessor team (this CU) will make every effort possible so the borrower pays the lender external legal fees. There is no guarantee of success 100% of the time (see point 6). Non-successful transactions (failed deals) often incur a lender legal review cost. Would you spend 50K DAI to protect the loss of 100M DAI due to unbalanced legal agreements?   Pre-mip transactions A few considerations on this topic. I think there is misunderstanding of the actual role of this team or how the role of the team is perceived, whichever is true.  The RWF-001 team is primarily an assessor team, before anything else. It undertakes assessments on counterparties, their collateral and, with the legal support, on legal agreements associated to transactions. Then provides that output so the DAO can make decisions. The role of assessment is different from the role of sourcing. When you source, you control the so-called pipeline. When you assess you diligence the pipeline that comes from borrower demand. This distinction is really important. As an assessor, you may have a view of the borrower demand (not control over it), not because you source but because borrowers approach your team for clarification during MIPs and pre-MIPs phases. Categorisation of an assessor view of borrower demand as “a pipeline” (or worst, our pipeline) is misleading. Pipeline infers (1) control of sourcing and therefore (2) predictability of demand over a long period of time. This team has neither (1) nor (2). An assessor does not make decisions. MKR tokenholders make decisions according to their collective risk appetite for the protocol. An assessor provides a credit and legal opinion on the transactions. MKR tokenholders, as the only decision makers, then decide whether to make a decision in line with the assessor recommendation or not. An assessor or a group of assessors may provide guidance on risk, methodologies or processes it recommends for borrowers. These guidances are more like opt-in/opt-out framework options for each assessor team. Both borrowers, MKR tokenholders or other assessor teams can decide not to follow them or even create alternative guidances or MIPs. Given the assessor has a view, not control, of borrower demand based on the present, any forecast is only an assumption that the present demand will continue or even increase into the future. A view of future demand is by no means a guarantee, because the assessor does not control deal sourcing.   A view of current demand: Beyond what is already available through MIP6 greenlight the following gives a view of applications in pre-mip and post-mip stages.     Transaction Category Phase     SocGen Reg. Institution Risk/Legal   Asia-Pacific banking group Reg. Institution Scoping   Top 5 US Credit Fund Institution Scoping   Atlantic Regional Bank (US) Reg. Institution MIP6 Imminent   2018 Vintage US Credit Fund Institution Initiation   Regulated secondary market platform (US) Platform Scoping   Regulated structured credit platform (EU) Platform Initiation   Monetalis v2 Arranger Risk   Centrifuge Platform Legal   MapleFinance Platform Scoping    This view of current demand gives an insight into the count and sophistication of counterparties in pre-mip. Given this is only a view of credit demand in 2022Q1, if you extrapolate this demand to the following quarters (2022Q2, 2022Q3, 2022Q4) you will have an insight into the expected volumes. Therefore it is not unreasonable to forecast 20+ sophisticated counterparties or platforms bringing greater volume in a rolling 12M period.  Execution To support the assessor role with this volume:  1 FTE (senior) can lead ~2 deals a quarter 2 FTE (senior) specialists contractors will be added to do the heavy-lifting on specialised transactions, assisted by a fulltime team member. Specialised contractors will be onboarded in the coming quarter, pending budget approval. All FTEs are supported by legal contractors working as intermediaries to external lawfirms, such as @christian. Engineering teams (CES, PE) are engaged early in the requirements gathering phase to conduct feasibility and architecture overview of MIPs. This is also an opportunity to size efforts, capacity and timelines. Growth team members are involved throughout the process, from pre to post mip stages.   Economics To provide a view into the economics (P&L) of the associated legal costs, find here a scenario with a few assumptions that are closer to the reality. Details here. Assuming an avg 100M deal size for a 2 yr tenor with a 1.5% interest rate. The scenario assumes both successful and failed transactions. Failed transactions also cost lender side review. In this assumption the borrower covers 50% of variable expenses.     Key ASSUMPTIONS:      Number of Deals Closed 2   Deals using legal but fail 2       AVG Deal Size 100,000,000   AVG Deal Tenor 2   AVG Deal Rate 1.5%       VARIABLE Legal Expense:    AVG closed deal legal 250,000   AVG failed deal legal 62,500   Legal expense % to Borrower 50%       FIXED legal expense 50,000    With the assumptions above in mind, for an ambitious transaction volume (I agree it is a bold figure), the results on the total P&L across these deals would be:      TOTAL     Number of Deals Closed 24       REVENUES:    Amounf Financed 2,400,000,000   Amount Financed Life 4,800,000,000       Total Lifetime Deal Revenues 72,000,000       EXPENSES:    Closed deals legal 6,000,000   Failed deals legal 1,500,000   Legal paid by Borrower (3,750,000)   TOTAL Variable Legal 3,750,000       Fixed Legal Expenses 600,000   TOTAL Legal Expenses 4,350,000       Variable Legal/Revenues 5.2%   Fixed Legal/Revenues 0.8%   TOTAL Legal/Revenues 6.0%    If running the same assumptions with an unit deal in mind against legal expenses, the results are like so:     UNIT ECONOMICS:      REVENUES:    Amounf Financed 100,000,000   Amount Financed Life 200,000,000       Total Lifetime Deal Revenues 3,000,000       EXPENSES:    Closed deals legal 250,000   Failed deals legal 62,500   Legal paid by Borrower (156,250)   TOTAL Variable Legal 156,250       Variable Profit 2,843,750    Clearly the above:  Assumes bias towards bigger transactions, given the expected costs Does not count all internal Opex costs required to deliver a transaction: personnel, soft dev time, infrastructure etc from various CUs involved (RWF, CES, Growth etc) Assumes the lender side costs to be covered (partially) by Maker. If this turns out to be unnecessary i.e. borrower pays 100% of legal fees, then funds stay in the DssVest.   Intention: The intention of this budget goes beyond RWF-001 CU. As mentioned several times now here and here, my role here as “interim” is to facilitate the transition from a single CU body into more decentralised and functional CUs for real-world financing. It is my key mission in this DAO. This budget plays two parts in that mission. (1) Allows to boostrap the legal activity via a spin-off. Once the RWA Legal CU is incubated by @christiancdpetersen, the majority of the legal budget will be “moved” from RWF-001 to be available to the new CU (2) Allows to boostrap the contributor base. With newly onboarded contributors, existing contributors can be facilitated to spin-off a new CU with its own strategy and facilitation. I cannot stress this enough. This intention drives every single action I have in this DAO. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://docs.google.com/spreadsheets/d/1ug73b_5WxwSspFaebrh56TunhTq3-A5f/edit?usp=sharing&ouid=114529981085695499641&rtpof=true&sd=true",
                        "https://forum.makerdao.com/t/the-lending-oversight-core-unit-love-001-cu-overview-incubation-update/13858#more-than-a-core-unit-will-be-involved-4",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152#contributors-17",
                        "https://forum.makerdao.com/t/mip41c4-sp27-facilitator-onboarding-rwf-001/11308#motivation-6"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.342414334491799
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#31",
                    "likes": "5",
                    "time": "17/03/2022-12:19:08",
                    "content": "I concur with @williamr regarding the expenditure (or not) of budgeted amounts for legal. It is first and foremost driven by the business need. I can only add that I will continue to aggressively manage legal expenditure. The advantage of engaging external counsel on transactions while keeping internal headcount very low is that I can turn-on and turn-off as needed. Also, in respect of transparency, lawyers bill by incremental time blocks with a detailed description of work undertaken during the billed time block (when I was at a firm, my time was billed in 6 minute increments). If the lawyer is not working on a deal, we are not getting billed. And, in terms of having the borrowers pay legal fees, the real world marketplace has borrowers paying the lenders’ external counsel fees. We will continue to push for borrowers to pay these. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.634615384615385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#32",
                    "likes": "7",
                    "time": "17/03/2022-13:06:55",
                    "content": "On the road to RWA glory, we pass through Top-Tier Legal or perish. Not sure if folks realize that the leading Partners at firms in New York and Washington behind the most sophisticated, complex transactions in the world easily can bill $2,000-$3,000 per hour! LFG WAGMI ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.5800189393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#33",
                    "likes": "3",
                    "time": "18/03/2022-12:06:07",
                    "content": "I know of many firms that have rates this high. Unfortunate but necessary. I do think there are ways to save by working with counsel so they bill judiciously. I have some ideas how we can keep the legal bills in check. I’m not sure if outside counsel is presently provided with billing guidelines that they must follow, but that is a way to do it. I think the (proposed) Legal Network Coordination Core Unit - LNW-001 could help with this. I’m ready to jump on in ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.28
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#34",
                    "likes": "1",
                    "time": "18/03/2022-17:09:10",
                    "content": "@MFeinberg Appreciate your suggestion. I think this part of the cost management of external legal firm is a mix between the (1) commercial negotiation with the borrower on who pays the bills very early on (customarily the borrower) and (2) in case negotiation is unsuccessful, but there is appetite to still move forward with a transaction, how to manage the cost from a procurement point of view with the external firms. I believe the conversation here is mostly about (2). Currently, @christiancdpetersen is primarily the touch point. I think your inputs in contributing to the best process might be valuable there, if anything to at least test out that the current process is sound. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.81923076923077
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#35",
                    "likes": "1",
                    "time": "20/03/2022-13:43:14",
                    "content": "I think, generally, and not limited to RWF, we can do things to keep legal costs down for Maker (or at least try). And even if the borrower is paying the attorney fees in a RWF situation, there might be ways to help borrowers save as well (which might entice people to do business with Maker). Some outside firms might be willing to be more flexible if they know they will get a steady stream of business from Maker deals.  I’m just spitballing thoughts. I believe things like setting up billing guidelines will be needed for the (proposed) insurance defense fund and the intent behind the guidelines (to limit costs and also get quality legal services) can be utilized in other areas as well. I know very well the subject matter varies and impacts the viability of saving costs but we should try to save wherever we can. Sometimes situations likely won’t allow for much savings, but we should do our due diligence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.15592903828198
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#36",
                    "likes": "1",
                    "time": "20/03/2022-14:51:47",
                    "content": "Ahoy! Why be we bothering’ with so many doubloons for the barristers? Be we as addled as a drunken parrot? If these here law talkers are so necessary, then launch a separate fund that can be used as needed. Then hard won booty is available, and not risk bein’ leakier than a bilge made from Swiss cheese! Hoist the Jolly Roger!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.366666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#37",
                    "likes": "8",
                    "time": "20/03/2022-15:49:03",
                    "content": "I will need to rewatch Pirates of the Carribbean to fully understand your points ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#38",
                    "likes": "3",
                    "time": "20/03/2022-16:03:59",
                    "content": "They suggest using a dedicated rwa legal fund  where requests are made on an as needed basis to aid in transparency and accountability. At the same time, it increases overhead and barriers to use, which will increase cost and headache for RWF. There is probably a better middle way solution but the suggestion is solid. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#39",
                    "likes": "5",
                    "time": "20/03/2022-22:19:10",
                    "content": "    MadShills:  They suggest using a dedicated rwa legal fund where requests are made on an as needed basis to aid in transparency and accountability.   Totally in support for this. I believe @wouter has some similar thoughts on how to make such a fund a “shared operational fund” that can be used where/if there is a need, rather than associated with a specific CU budget. At the end of the day, it’s about having availability if legal costs are incurred or necessary for operations to continue. Whether it comes from CU X or CU Y budget, I am really not religious on it at all, so long as those costs can be paid if/when. The only reason the RWF-001 budget contemplates external legal costs here is because such a fund does not exist at the moment. And operations involving external legal firms haven’t stopped (I dare to say yet). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#40",
                    "likes": "8",
                    "time": "21/03/2022-01:20:55",
                    "content": "@Piratical - https://www.amazon.com/Legal-History-Pirates-Privateers/dp/B08RQSLQ8V - to quote from the book description: “The story of pirates and privateers was actually a tale of legalities and illegalities, separated by a thin statutory line marking those on one side as criminals and the other side as heroes worthy of reward.”  Doubloons for the barristers (technically lawyers as barristers mostly practice before the courts) is necessary for real world financing. It is not clear to me why the Maker community should adopt a practice (i.e., no lawyers) that (1) is off-market, and (2) contrary to the interests of the Maker community. As a law talker, I would argue that the “separate fund” you mention above is basically the same as an “annual budget” for legal spend. There are multiple mechanisms to address legal expenditure. I would suggest a reasonable approach to be: (1) Borrower pay for external legal costs (if not, Borrower should explain in its MIP6 application why it is not necessary for Maker to have external legal support). (2) As part of the MIP6 approval process, the incubating Legal & Transactional Services core unit align with the borrower on the external legal costs for any transaction. (3) If the Maker community agrees that borrower does not have to pay Maker’s legal costs then, as part of any MIP6 application, the MIP6 application include an estimate of potential legal fees to be incurred by Maker. The Maker community can then vote as to whether it wishes (or not) to incur external legal fees for any particular transaction. (4) If Maker community agrees that the Borrower should pay external legal costs, then it is possible that the Borrower may re-finance those expenditures from the approved loan facility. In this case, the Borrower bears the financial risk associated with the transaction not being completed. This approach (or some variation) is both transparent, approved by the Maker community, and responsive to each particular transaction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.320238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#41",
                    "likes": "5",
                    "time": "21/03/2022-01:47:03",
                    "content": "    williamr:  And operations involving external legal firms haven’t stopped (I dare to say yet).   I have drastically reduced Maker’s on-going external legal expenditure because of the absence of a better than minimal budget (including reducing external legal support on the SocGen transaction (French law governed) where the majority of the external legal expenditure has been incurred to date). If, in my support for the RWF core unit, I was required to   review a new MIP6 application in a jurisdiction outside of the US   obtain non-US legal review of an existing proposal (Monetalis - MIP68: Monetalis Vault V2)   seek external legal support to review the updated Centrifuge agreements or   obtain external legal support to implement an ALM strategy (e.g. purchase of ETFs)   and the potential borrower did not want to reimburse Maker for external legal support or it was a Maker-only project, there is not currently adequate budget to engage law firms with relevant subject matter expertise to support the Maker community in its decision-making. Of course, it is the Maker community’s right to choose to proceed without such professional advisory support or determine how such legal support will be budgeted on a case-by-case basis. Hopefully, our discussions can focus on the question of how to plan for legal expenditure and not whether such legal expenditure is meritorious. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.481249180112816
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#42",
                    "likes": "1",
                    "time": "21/03/2022-03:02:52",
                    "content": "    christiancdpetersen:  necessary for real world financing   I ‘twasn’t suggestion’ we go in blind! Nay, simply that if’n this share o’ booty be passed aboard yer ship, thar be no way to ensure it be spent (or even spent wisely). Talk o’ “auditor wallets” be cheap when it be not up to the DAO who be on it, nor who watches them! It not be like we can give ye a taste o’ the cat if the booty sits idle and does not return. Mayhaps once CUs begin to actually return their excess plunder, trust might be higher! Who be these scallywags we be needing to pay lawyers to review? I see nary a MIP6 in sight! I say the DAO should be disinclined to acquiesce to law monies until the application is filed!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5316406250000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#43",
                    "likes": "8",
                    "time": "21/03/2022-11:43:35",
                    "content": "    Piratical:  Talk o’ “auditor wallets” be cheap when it be not up to the DAO who be on it, nor who watches them!   A fair point and, in respect of the incubating Legal and Transactional Services core unit, I am open to ideas on how to manage. I do note that I have suggested that a community member (elected by the community) sit on the board of the proposed legal entity to “house” the Legal and Transactional Services core unit. SES Weekly Status Update: Legal & Transaction Services Core Unit Incubation Announcement - #3 by MFeinberg. Happy to consider alternatives. This is simply one approach.     Piratical:  I say the DAO should be disinclined to acquiesce to law monies until the application is filed!   Another fair point and one which I sought to address above.     Piratical:  I ‘twasn’t suggestion’ we go in blind!   Excellent. We can then focus on the management component. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.490384615384616
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#44",
                    "likes": "3",
                    "time": "21/03/2022-16:42:40",
                    "content": "    Aes:   Do we have the right resources in place from other teams to support achieving this scale? CES, PE, etc. How many RWF FTEs per month will be dedicated to this effort? When will your envisioned full-time team be hired by? What is the highest DC RWF believes we can onboard given various SB levels (current, higher, lower)? Same question for duration and stability fees. Regarding your target of 24 transactions a year and the need of significant size to absorb the setup costs, have you thought about a capital at risk metric? Is it in line with the current Surplus Buffer? Do you expect to immediately spend $685K if this budget passes in April? If not, could you please provide a monthly breakdown for how the actual expenses will scale to the envisioned future state? (see prior snapshot for format) How will the RWF team track progress towards reaching this goal? How does the RWF team plan to communicate progress to the community?    To re-iterate, our prerogative is with transparency regarding the plan to execute, ramping of spend, and reporting to the community. We are confident that @christiancdpetersen will manage the legal budget prudently and, as mentioned previously, believe it’s a worthwhile and necessary investment. We believe further information on some points will help empower MKR holders with the best possible information ahead of a vote given the magnitude of the requested budget (~7x increase to become the biggest CU by spend in the protocol, ahead of PE, and still one of the largest excluding $6M in budgeted legal fees). RWA is a key strategic focus for Maker and we believe it’s important that its corresponding budget, particularly of this scale, is associated to a tangible plan with accountable results for the protocol. As per this detailed overview and your responses above, RWF-001 is primarily in an assessor role. In this framework, who is accountable for the number of deals onboarded (and DAI produced)? Will we get any RWA at scale before end of Q2-2022? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.904761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#45",
                    "likes": "3",
                    "time": "21/03/2022-22:56:48",
                    "content": "    Aes:  Do we have the right resources in place from other teams to support achieving this scale? CES, PE, etc.   We have weekly status workshops with technology teams where we communicate about work in progress initiatives and upcoming applications in pre-mip. That allows technology teams to plan resources and bandwidth accordingly.     Aes:  How many RWF FTEs per month will be dedicated to this effort? When will your envisioned full-time team be hired by?   Eventually, 5.7 FTEs. There will be core and rolling FTEs (see grantees section). Everything going according to plan, by June all FTEs should have been onboarded.     Aes:   What is the highest DC RWF believes we can onboard given various SB levels (current, higher, lower)? Same question for duration and stability fees.    As per scenario estimates (see previous post), avg DC estimate at 100M, avg SF at 1.5%, avg duration at 2 yrs. For the right structuring and pool subordination, we believe maker could have a PD < 1%.     Aes:  Regarding your target of 24 transactions a year and the need of significant size to absorb the setup costs, have you thought about a capital at risk metric? Is it in line with the current Surplus Buffer?   24 transactions are based on future credit demand. We have no control over it, only a view of present demand based on MIPs and pre-MIPs, which we extrapolate. On SB, given low targeted PD and initiatives to increase the SB, there is reasonable ground to think this will be within limits of avg pool size.     Aes:  Do you expect to immediately spend $685K if this budget passes in April? If not, could you please provide a monthly breakdown for how the actual expenses will scale to the envisioned future state? (see prior snapshot for format)   No. The variable costs on legal review will depend on progress of transactions. If transactions are (1) at a stage that warrants external engagement AND (2) Maker needs to cover its own legal review, then and only then funds will be needed. @christiancdpetersen might be able to add flavour here.     Aes:  How will the RWF team track progress towards reaching this goal? How does the RWF team plan to communicate progress to the community?   Through different communication channels: office hours, G&R calls with transaction updates, team updates to community/forums, weekly coordination calls with CUs, focus on sessions.     Aes:  RWF-001 is primarily in an assessor role. In this framework, who is accountable for the number of deals onboarded (and DAI produced)?   Correct. It’s based on credit demand. At the moment, the closest team to a “sourcing” / BD function is Growth (@Nadia). We discuss frequently to Growth so that the team can have a dedicated set of professionals with understanding in this area. I understand there will be an ongoing professionalisation and focus in this area. This setup is intentional (i.e. growth !== assessor) so there is no question on the objectivity of the assessor during diligence. Like the distinction between an investment team and a risk team, which is common in senior lender setups. They talk to each other but risk has a different mandate to investment teams. The assessor here is more like a risk team. If the assessor was also the main responsible for “sourcing” that impartiality could be put to question, and reasonably so. You could create all sorts of mis-incentives if growth == assessor such as (1) the all too common “falling in love” with own deals and (2) reducing underwriting standards. History has shown time and time again that both can lead to catastrophic outcomes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.601503759398496
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#46",
                    "likes": "0",
                    "time": "21/03/2022-23:15:58",
                    "content": "    williamr:  The variable costs on legal review will depend on progress of transactions. If transactions are (1) at a stage that warrants external engagement AND (2) Maker needs to cover its own legal review, then only then funds will be needed.   Correct. Generally, legal expenditure is likely to be lumpy in terms of timing. Each transaction will proceed at its own pace - as dictated by various commercial, technical and non-commercial considerations that arise in the documentation process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.818181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#47",
                    "likes": "4",
                    "time": "22/03/2022-00:05:05",
                    "content": " To be clear on intentions. Regardless of the results of the budget poll (Y or N), I think there is value in pursuing an initiative to create a framework for a “shared operational fund” for expenses e.g. external legal costs. It has some clear advantages over a single CU budget such as reducing de-duplication of budget contingencies and co-ownership of cost management, which both lead to transparency for all CU budget users. We need to work on details so operationally it is more efficient than the SPF or any MIP with a 6-8 week governance cycle, which are not very business-friendly. Scope will also be an important consideration. I am inviting here some proactive minds in the DAO to help boostrapping such framework together. cc: @SES-Core-Unit @christiancdpetersen @luca_pro @collateral-core-unit @GovAlpha-Core-Unit @Derek @Nadia ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.564285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/layerzero",
                    "index": "#48",
                    "likes": "5",
                    "time": "22/03/2022-10:41:19",
                    "content": "Will, one of the flagship projects of @SES-Core-Unit  in the legal front is the Self Insurance Fund. Primarily thought as a “reactive” tool for covering legal costs of defense or eventually third party claims, it can also be used as a legal reserve for funding external legal advice. We are in advanced conversations with potential service providers who can assess us structuring this fund, news coming soon. Happy to sync with you and involve all interested stakeholders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.204545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#49",
                    "likes": "0",
                    "time": "22/03/2022-12:03:20",
                    "content": "Yes ! This is the way! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#50",
                    "likes": "5",
                    "time": "22/03/2022-14:58:13",
                    "content": "Apologies for the length here but I have spent a lot of time not just talking to people and considering my position and am just going to get this out in one fell swoop.     williamr:  A few considerations on this topic. I think there is misunderstanding of the actual role of this team or how the role of the team is perceived, whichever is true.  The RWF-001 team is primarily an assessor team, before anything else. It undertakes assessments on counterparties, their collateral and, with the legal support, on legal agreements associated to transactions. Then provides that output so the DAOI can make decisions. The role of assessment is different from the role of sourcing. When you source, you control the so-called pipeline. When you assess you diligence the pipeline that comes from borrower demand. This distinction is really important.    I won’t quote the rest but I comment on this because delegates have had discussions on this specific topic.   There is a claim made multiple times by RWF YET in this same post we have the following:     williamr:  A view of current demand: Beyond what is already available through MIP6 greenlight  the following gives a view of applications in pre-mip and post-mip stages.     Transaction Category Phase     SocGen Reg. Institution Risk/Legal   Asia-Pacific banking group Reg. Institution Scoping   Top 5 US Credit Fund Institution Scoping   Atlantic Regional Bank (US) Reg. Institution MIP6 Imminent   2018 Vintage US Credit Fund Institution Initiation   Regulated secondary market platform (US) Platform Scoping   Regulated structured credit platform (EU) Platform Initiation   Monetalis v2 Arranger Risk   Centrifuge Platform Legal   MapleFinance Platform Scoping       I quote “Beyond what is already available through MIP6 greenlight”. So please explain what seems to be a serious inconsistency between the statement RWF is supposed to be an ‘assessor’ and not a ‘sourcer’ in light of the additional work being done that has no MIP6 greenlight from governance and how governance is supposed to view this non-approved work by RWF? So we have the above list in various stages of RWF activity and the following posted publicly by @flipflopflapdelegate regarding the ‘pipeline’ as he captured.    Flip Flop Flap Delegate LLC Platform   It is also our believe that if MKR token owners and Delegates do not support this proposal, it will hamper the ability of both the RWF CU and the incoming RWA Legal & Transaction Services (LTS) facilitator to complete the Professional Services required for deals such as the SocGen on-boarding application, and the current pipeline:    My problems here are multifold:  What appears to be a general and unresolved inconsistency in what the role of RWF is with respect to who is sourcing deals and then. Who is deciding the prioritization of the assessing and the assessing itself.  The above along with other comments illustrates that RWF is actually sourcing deals (at their discretion) without any governance oversight on prioritization of deal sources, or any independent unit acting as the sole contact for deal sourcing.   I have asked for clarification on this particular subject many times and have been ‘assured’ that RWF isn’t sourcing deals.   So who is? The point here is that to avoid serious conflicts of interest those sourcing and trying to drive through deals, have to be distinctly different than the ones doing the assessing.   IMO Governance needs to know that those doing the diligence for Maker governance have to be firewalled from those who are sourcing the deals.   Loosest sense here sourcers do everything to get a deal done (they are the ones sourcing possible clients and managing their expectations, they are the ones who believe every deal can be looked at or done).   Assessors are the ones that are providing the DAO/governance with the checks and balances, STOPPING deals that they feel don’t pass muster and referring them back to the sourcers and clients for recommended changes or with rejection statement. This is the sole reason that trying to MIP bypass the assessor to get a go-ahead via governance is so ‘unappealing’ to everyone.   YET we still have RWF apparently acting as the sourcer for all of these new deals and not taking any particular action to offload this work to a CU like growth etc. Back to the question.  Who is sourcing RWF deals if it isn’t RWF? Additionally there is no concern from the entire group of RWF players regarding this single issue. and it is continually broadbrushed over as if governance is just expected it ignore this while increasing RWF budget dramatically giving tacit greenlight to these teams to keep doing what they are doing, how they are doing it, trusting that any conflicts of interest here will be disclosed and managed appropriately. The above are two key points I want to make clear.  RWF has not addressed or solved the sourcing and assessing firewalling issue. RWF appears to be working on new deals completely outside of any governance oversight or even basic greenlighting.  Hence RWF gets to not just control the deal flow, deal order, but also as the assessor effectively (from a governance perspective) determines who gets the pass/fail.   Since if governance passes something RWF fails - this is a problem.  And if governance fails something that RWF passed then we are wasting effort/money.  I want to bring up my third issue here. Lets look at the ‘pipeline’ even though RWF doesn’t want to use that term, while @flipflopflapdelegate pro does (I do too btw because this is how I think of business clients). RWF has what 5-6 deals ‘in the pipeline’ here (I honestly can’t tell because I can’t make heads of tails of what ‘END’ means in the graphic nor what the phases even remotely look like to get a client into a production vault. Lets look at the state of one player here ‘SocGen’ in Risk/Legal currently in both the graphic and the posts.   END means what that SocGen moves on to governance approval or that it fails risk/legal and never makes it into a production vault?   Same with 6s.   6s ENDed with a DC recommendation of 0.  Yet we still have a vault with a DC of 15M.   So this isn’t even in the pipeline so to speak when it is already in production? The above is my biggest issue 3/17 we have a list of things in the ‘pipeline’ above then no clue when (expectation is this was only a few days later)  a graphic from @flipflopflapdelegate shows a different pipeline.  (communication inconsistency) Various posts talked about ‘improving communication’.  This is one of my biggest issues with the players here.  Not just communication but communication done with some civility, respect and continuity/clarity.  I have had a number of individuals not just comment on how one day something would be said and the next day an entirely different thing would be said, but how the whole tone of the conversation would change from one thing to outright hostility.   I have personally experienced issues from hostility in communications, to complete inconsistency with the few actual interactions I have had with the people here.  As a former business owner, freelance team IT lead these experiences (corroborated by others) raise significant red flags for me regarding the abilities of the people to consistently interact professionally, treating all the players fairly, with respect, and above all to be ‘consistent’ with their communications. I see that governance voting here will probably pass this budget.   Frankly I am against this particular budget raise not for the reasons of inconsistent or lack of professional conduct (I believe this can be repaired and people do deserve second chances) but because given what I am seeing in the ‘pipeline’ I don’t believe a ~400% increase in budget is warranted, and is probably hazardous for many reasons:  No sign of RWF isolating/firewall deal sourcers/promoters from assessors. If I believe the pipelines here RWF should be able to close on at least 1 deal in 3 months with current budget.  (1)  DEAL.  I’d like to see 2 personally but 1 deal that we can get to vault stage would at least give me some confidence this isn’t just someones experimental project that has details yet unsolved.  (legal?) I want to see a real expense run - of any kind - even a 3 month cost assessment which isolates the costs for the successful (1 DEAL) against the rest in process (how many).   Point here is that while a lot of effort went into why to expand the budget, no effort has really gone into explaining what has been done, and can be done with the current budget. (on-going vs. expansion) Lets say that with this 4x in budget that we can do 2 deals a month (I think 1 is aggressive but that is me - we are talking about a 4x in current budget - the original budget which I felt was good enough for 1 deal every 3 months and we still haven’t gotten any).   Who here thinks that the surplus buffer is sufficient to back the potential losses we could take should any one of these deals go south for some reason.   The whole point of having a modest initial budget (in my mind) was so that we could get 1-3 deals done, that would give us some revenue legs, 3-6months (or 12months) of expense run so governance would have a better handle on the return for investment here with some real DATA via audit.  With this particular delegates reasoning:    Flip Flop Flap Delegate LLC Platform   There is a Need for the RWF Core Unit Team To Speak Up and Communicate w/the Community The community cannot expect miracles to occur without providing the necessary Runway for Core Units to scale. There has been a miscommunication between RWF and the community, which we believe has led to a misunderstanding on how this Core Unit plans to push RWAs forward.   and    Flip Flop Flap Delegate LLC Platform   You’ll Never Get a Breakthrough if You Play it Safe There’s an open question if 2022 will be the year that RWA collateral types will scale. As proponents of Risk taking, we do believe that it is important for the RWF team to allow the likes of Monetalis, 6s Capital, Centrifuge, and other Arranger types to scale via the superpowers of MakerDAO, know as Vaults. We request that both the RWA Project Sandbox incubating core units and the RWF team to work diligently with these MIP applicants and find a middle-ground that will allow the next batch of innovators, to innovate via DAI.   I am going to stand by my delegate mission statement here.    MakerMan delegate platform   Delegation Statement My service to Maker involves the following commitments:  In good and bad economic times, look out for the all the important Maker work-economic stakeholders (MKR holders, vault owners, DAI holder and users, MakerDAO, DeFI in general etc.). To looking at the system of Maker from both the internal microcosms of contracts, people, operations to the greater macrocosms of DeFI and the real world in terms of governance, law, and finance. To creating Safe, Scalable and Sustainable Systems as Simply and Efficiently as possible. To growing Maker in a way that is Sustainable for the long term. To use Data driven analytics to drive decision-making to achieve goals. Look towards the future by analyzing the past and present.    What this means to me is that YES Maker needs to take risks to achieve goals.   But as we grow rather than taking massive steps that we can’t effectively manage, that we take A STEP, get some DATA, then using the DATA we take ANOTHER STEP.   Maker isn’t a newfound startup that doesn’t have a product, or users.   We are a 10B DAI operation with 20B TVL with maybe 1000-10000 or more users of our products and need to act in ways consistent with the interests of all parties. Speaking for myself I understand the need to onboard RWA, the need to grow revenue, and the need to get centralization risk (of USDC in particular) under control.   But I am going to urge MakerDAO that we onboarded Centrifuge, and 6s using RWF1.0.  Now with RWF2.0 they have put the effective brakes on what RWF1.0 did and are trying to go full steam with their vision.  Who is to say that should we find ourselves at RWF3.0 that they don’t do the same thing here?  That perhaps RWF2.0 should find a way to work with the players that RWF1.0 brought in to create ‘continuity’ and ‘consistency’ for them.  Perhaps the bigger more important players will see for themselves that they won’t be drop kicked should a RWF3.0 team be brought in, that there is consistency with Maker and MakerDAO and that work (which isn’t cheap btw) will be rewarded with mutually beneficial business opportunities that are long term sustainable. Lastly, @williamr  I agree that not many delegates including myself really understand the nature of the Auditor Wallet with respect to RWF here.    I want to know why a single team is in charge of the auditor wallet and auditor role.    Wouldn’t it make more sense to have Strategic Finance, and SES, and possibly Growth or PE have representation here?    My point is that if we are going to have an accountant/auditor SF is ideally suited and could be distinctly tasked to undertake the auditing role. Because of the above concerns and position I will be voting no to the budget increase as proposed and encourage the RWF team to work within the current budget to get 1 possibly 2 deals done by 6/1.   It looks like we have already paid for two deals and if these can be inked and put into production by 7/1 (give or take) with some sort of expense breakdown of where budget went then perhaps after this FIRST STEP, governance can take a more significant SECOND STEP with a greater RWF budget allocation and a 12 month run provided a number of the issues noted above are addressed. I for one understand there has been a transition here RWF1.0 to RWF2.0 but I want and need RWF 2.0 to understand that they should at least try to do something tangible with existing budget before asking for a 4x increase. Being one typically on the ‘losing’ side of issues and governance votes I know I this battle is probably lost and I can only have some solace perhaps some of the above will be addressed. One last point.  @williamr and @christiancdpetersen I know the whole transition here is difficult and understand that elements of frustration as well as outright errors/mistakes have come in many ways.   I would like to think there is a path forward that addresses many of these issues and we can finally straighten out the significant wrinkles here to get into a better CU situation (both from funding, expectation and continuity perspective).   I hope you will understand my view is that I want to see 1 successful move forward from RWF2.0 not 2 steps backward (which is what I see with NewSilver/Centrifuge and 6s).    I personally believe that there are significant opportunities with both these existing players and RWF needs to find ways to work with these to vault users.    I also hope a better process for the RWF sourcing and prioritization can be created that leave RWF as the ‘assessor’. ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/89",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/89",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/89",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.618182381854257
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#51",
                    "likes": "11",
                    "time": "22/03/2022-23:20:04",
                    "content": "@MakerMan - Thank you for your thoughtful comments and observations. I will make an effort to respond to your legal-focused comments and selected others. @williamr can respond to the other RWF-related comments and observations. First, as nearly every deal involves structuring issues (pre-MIP6 and/or post-MIP6), applicants often seek some level of interaction with me on structuring issues and solutions (trust, no trust, what type of trust, what jurisdiction, consideration of withholding taxes, creation of security interests, etc.). To facilitate the preparation of a more complete and refined MIP6 application, I have engaged with pre-MIP6 applicants on these issues. In fact, even today, I received an unsolicited communication on Discord from a group requesting a structuring discussion for a potential MIP6 application. To be constructive and helpful, I accept these opportunities for communication. Subject to my NDA commitments (which NDAs are usually the applicant’s pre-condition to disclosure of information to me), I would be pleased to update the community on the nature of these discussions. Generally, I do not consider these interactions to be “sourcing” discussions as the pre-MIP6 applicant has reached out to me. Also, these type of pre-MIP6 discussions are foreshadowed in MIP67: Methodology and Review Process for Structured Finance Transactions where it is noted:    MIP67: Methodology and Review Process for Structured Finance Transactions   Initial engagement with the relevant structured finance CU (e.g. RWF-001), providing the CU with a reasonably detailed Proposal (not necessarily formalised yet as a MIP or Signal Request) that conforms with the Methodology  and with the appropriate time to review its high-level pillars   Second, in terms of post-MIP6 applicants, I will work with post-MIP6 applicants as expected by the community and as the MIP6 applicant engages with me and the incubating LTS.     MakerMan:  Lets look at the state of one player here ‘SocGen’ in Risk/Legal currently in both the graphic and the posts. END means what that SocGen moves on to governance approval or that it fails risk/legal and never makes it into a production vault?   I agree that “END” could be clearer. For SocGen, “END” was intended to convey the projected date for SocGen opening a vault. We are still working on the SocGen transaction and the end of March date will not be achieved. Happy to provide an update on the legal side of the transaction in a separate posting. As with the Monetalis V1 transaction, RWF and LTS will submit an analysis/risk assessment for every formal MIP6 greenlit application (unless the MIP6 withdraws or delays the application). I do note, however, that given the commercial considerations in Monetalis V1, from a Legal perspective, we stopped reviewing the legal agreements at the end of January (with @Allan_Pedersen’s concurrence) to eliminate unnecessary external legal expenses (see below).     MakerMan:  6s ENDed with a DC recommendation of 0. Yet we still have a vault with a DC of 15M. So this isn’t even in the pipeline so to speak when it is already in production?   The 6S reference relates to the $50M proposed up-sizing. I did undertake an external legal review of the existing 6S transaction documents in light of the $50M proposed up-sizing. “END” is merely indicating that the review is complete. I am sympathetic to the varied concerns expressed here and in other postings on the proposed legal budget. In preparing the budget, I encountered a series of conflicting considerations: (1) the time required to request and procure any needed budget increase as a result of success in scaling vs (2) the need for legal budget when the MIP6 application is approved and external counsel is required. Also, from a cost perspective, I assumed that each deal incurs the same amount of legal fees. This assumption is probably unrealistic based on the variety of assets, jurisdictions and issues that we will encounter. However, without any real historical datapoints, it was a good faith best estimate. In hindsight and after having received the constructive input of the Maker community, I think the our approach raises more questions than answers. I think we can find a solution that is acceptable to all stakeholders and flexible to the needs of the business. A few additional considerations:   Borrowers should pay for Maker’s external legal fees and, if they are unwilling to do so, they should explain why in the MIP6 application. Borrower assumption of external legal fees will reduce the expenditure materially. We are beginning to have these discussions with potential MIP6 applicants.   The MIP6 application should set forth the estimate of legal fees if Maker is going to pay.   I do not think that point 2 addresses the budgetary issue, but it provides more transparency in terms of potential costs when a MIP6 is greenlit. Again, I am fully supportive of developing a proposal that all stakeholders can endorse and welcome further suggestions. For 2022 (to date), legal expenditure by transaction/month amounts to the following: Monetalis V1: Jan. $30,536.10 // Feb. $0 // Mar. $0 SocGen: Jan. $69,798 // Feb. $78,064 // Mar. $17,000 (up through 3/21/2022) 6S update ($50M): Feb. (pending receipt of bill from external counsel) Centrifuge: None. Note that I have reviewed and provided written comments to their draft Indenture Agreement. Today, Centrifuge and I had a call on the draft Indenture Agreement. I am happy to coordinate a joint presentation with Centrifuge to explain the basics of the Indenture Agreement and issues (if any). Please let me know if that would be useful. I have not yet incurred any external legal fees in respect of the other transactions. I do note, however, that I have engaged counsel for the “Aus. Regional Bank” transaction, but I have not instructed any work to be undertaken. I have reviewed a draft term sheet and provided written comments to the term sheet (mostly clarifications). Any MIP6 application, if and when filed, will, hopefully, include my comments and clarifications. In terms of legal spend, please note that the legal bills from law firms include for each timekeeper, a daily description of the work performed, the time spent on that particular day, and the amount for such day (hourly rate times hours spent (or fractions thereof)). For purpose of expenditure, this level of detail gives me a reasonably good view of the law firm’s/lawyers’ efficiency (or not). Finally, in terms of legal support, I am working to expand the network of law firms to support our efforts to on-board assets at scale. Unfortunately, DeFi is still a new space for most firms and they are still going through their internal intake processes. I have also sought to support potential MIP6 applicants by identifying potential firms to assist them. I hope that the above is responsive to your questions and comments that touch upon legal and transaction management. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737/1",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.648641588296761
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#52",
                    "likes": "2",
                    "time": "23/03/2022-02:14:16",
                    "content": "Thank you, @christiancdpetersen for thoughtful answers. I assume @MakerMan has frustrations like mine. The core units have mandates. It appears some are beyond that mandate. I think it needs to be clear to everyone what a core unit mandate includes and what it does not. There appears to be confusion here. Not only for this core unit but also many many others. That is likely a discussion to make elsewhere. But it should be done. Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#53",
                    "likes": "8",
                    "time": "23/03/2022-04:39:49",
                    "content": "@makerman Thank you for your questions. Let me address your concerns in the best possible way to make them clearer.  Differences between sourcing and assessing In my view, borrower demand in real-world financing comes from two categories:   Organic demand: these are borrowers/applicants/arrangers etc that know the maker protocol through various means (internet, twitter, forums…). They either apply directly or engage teams within maker to obtain more information on how to go about the application process. They may or not have a clear use case or MIP ready to hit the forums.   Sourced demand (“push” or “BD driven”): these are prospects that do not know anything or very little about Maker. Here it is really where direct “sourcing” through BD applies. This is where teams specialised in that “sourcing” may have “BD targets” to transform prospects into applicants. Once these parties have gone through the “Maker 101” phase then they may start thinking about their use cases and from there may want to clarify their doubts on process.   I am sure you understand organic demand can come from a variety of sources. No internal team within the DAO has any control where this comes from. It is really borrower-led. Sourced demand it is different. There might be an influencing factor in bringing a counterparty to Maker. It may be more lender-led. Where the assessor role comes in: (1) Often times, the assessor does not know where the organic demand comes from. (2) For sourced demand, the assessor is not the BD team sourcing a counterparty. I am sure you understand be it for (1) or (2), applicants often have doubts on how to go about the RWA process of application for a MIP6. Either because they do not have clarity about their own application (e.g. collateral, structure etc) or because they’re not certain on how to provide the most “complete pack” of information required for MKR tokenholders to make an informed greenlight decision. For the borrower, this means providing all information considering commercial/risk, legal and technology matters. Challenges in pre-MIP MIP67 and the associated Methodology aim to provide a more granular level of requirements for applicants in commercial and legal areas. Therefore helping to solve the problem of lack of information of MKR tokenholders to make an informed “greenlight” decision. But even in those cases, applicants may still have doubts on the completeness of their applications. They interact then with the assessor for guidance on process and completeness of application. This is THE KEY. That’s our key role during pre-MIP stage. No other team in the DAO currently does that guidance on process during pre-MIP. We use insights gained during this phase to improve documentation and processes so each new application can move faster from having a high-level proposal/idea to a MIP6 point. A parallel with governance: A parallel here would be the governance process for MIPs. Often times, community members have an idea about a MIP to improve or standardise something in the DAO. They then transform that idea into writing via a MIP. But it is very common contributors engage GovAlpha to refine their understanding on process or ask for input on the MIP itself (clarity, completeness etc) before it’s even published. GovAlpha often then gives input for the MIP against some set of “internal standards”. Then there is somewhat a back-and-forth between GovAlpha and the writer until the MIP submitter is comfortable publishing the MIP. It is not uncommon that this process happens before the MIP even comes into RFC in the forums.  I am over-simplyfing for the analogy between GovAlpha and RWF-001. But the example above for GovAlpha is a very close parallel to what happens in pre-MIP stage from a process point of view. The interaction between the applicant and RWF-001 is similar (i.e. provide process guidance) although the level of complexity might be higher and wider: legal, commercial/risk and technical.   Firewalling sourcing and assessment The commentary mentions a number of times the lack of risk controls around the separation between sourcing and assessment. I’ll address those with respect to you while not “broadbrushing” your perception of which controls exist or which do not. First, I will point out that controls in the separation between sourcing and assessment never existed previously in RWF 1.0. A “greenlight” gives a sign of prioritisation for CUs to work on a transaction, but it does not prevent CUs from sourcing before the “greenlight” happens. So it is not a true risk control. I’ve worked in a few high-profile regulatory & compliance projects. I know what I am talking about here. Second, this team is the first team to take risk controls seriously. RWF 2.0. and myself as a facilitator was the only CU member of RWF 1.0 to have actively and collaboratively engaged in the RWF sandbox and contributed to its principles. Why? Because among other things the sandbox contemplated “oversight” over team processes, and the definition of risk controls. I did this proactively because I saw that as the only way for a level of checks & balances in process and long term sustainability of assessor teams. Now the LOVE CU (by @luca_pro) is incubating with among other goals to work on “risk controls” with operating teams such as RWF-001, RWF-002 etc. Third, risk controls can be defined by one team, proactively. But they really need at least two teams to be fully effective: one that puts the controls in place and another that checks and asserts that the controls are followed consistently. I believe the incubating LOVE CU will have the experience and skills to assert and guide CUs in setting up controls. I cannot comment on this for Strategic Finance. Forth, given the Community expects guarantees (i.e. assertion) that risk controls are in place to separate sourcing from assessment, I’ve deliberately engaged teams such as LOVE to do checks on process and assert that separation exists in a more formal way. I am open for RWF-001 to have other checks by QUALIFIED teams, that have experience doing this professionally.  Budget auditing On auditability of use of funds, I believe I’ve covered at length previously in this thread. Also, I advice you to read the RWF Auditor flow which covers the multisig setup, the budget implementation and ongoing audit requirements. The operational multisig, besides the CU facilitator, has only members from external CUs. That is intentional. It was designed with resilience in mind in case of facilitator off-boarding (we have some experience in this area now). Collusion-prevention was also in mind when designing it, where two members of the same team could not simply collude to move funds from the Ops Wallet. This design prevents that. Here I learnt greatly from RWF 1.0. shortcomings. Behind the operational multisig, the Auditor wallet is really the intermediary between the Ops wallet and the DssVest. So, no direct access to DssVest from the Ops Wallet. Intention is to prevent this kind of situation from happening ever again, without checks or consequences. I believe the SES team (@wouter et al.) has the longest experience in auditing CUs and use of funds, with responsibility. In the name of resilience and transparency, I am open for other auditors and also to comply with GovAlpha qualification standards for CU multisig setups. However, I’ll repeat what I said elsewhere with regards to auditing compliance. The auditor also needs to be a credible counterparty. 2-of-3 Ops Multisig where 2 are in-house CU co-signers with no auditor behind, in my view does not pass the “credible” criteria for auditing authority. “You need to lead by example”.  Closing remarks I trust this sheds light on your core concerns. We are not perfect, but we are certainly getting better. I respect your point of view and please do not hesitate to engage. ",
                    "links": [
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://forum.makerdao.com/t/real-world-sandbox-final-deliverable-for-consultation-round/11915",
                        "https://forum.makerdao.com/t/rwf-001-auditor-flow/12900",
                        "https://forum.makerdao.com/t/returning-excess-budget-from-rwf-in-dai-or-in-mkr/12643",
                        "https://forum.makerdao.com/t/mip40c3-sp46-adding-strategic-finance-core-unit-budget-sf-001/11940/17"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.480945144971308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#54",
                    "likes": "8",
                    "time": "23/03/2022-11:36:48",
                    "content": "Dear @MakerMan, I have nothing to add to what has been already expressed by @christiancdpetersen and @williamr. As prospective facilitator of LOVE-001 core unit (you can find a detailed description of the interaction of all CUs dealing with RWF applications here) I confirm that no RWF team has been involved in the activity you call “sourcing”. The activities that predate a MIP are performed fully on a consultation basis to help counterparties prepare the best possible MIP given the complexity of Maker and the sensitivities of some regulated parties. Consistent with the proposed MIP67, the RWF CU is available to support any counterparty that seeks its help, and is available to have an introductory call with anyone. In case any member of the RWF galaxy will have entanglements with a counterparty (being financial, professional, or of any other nature) LOVE-001 expects them to phrase them out. In addition, we discourage for transparency’s sake to engage in processes where those engagements exists. None have happened so far. I hope we can continue to have those conversations in an open manner, and I encourage anyone to contact the teams through forum, discord, and the open office hours we have weekly. Looking forward to a bright future, together. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.151785714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#55",
                    "likes": "10",
                    "time": "23/03/2022-23:39:11",
                    "content": "    williamr:  Correct. It’s based on credit demand. At the moment, the closest team to a “sourcing” / BD function is Growth (@Nadia). We discuss frequently to Growth so that the team can have a dedicated set of professionals with understanding in this area. I understand there will be an ongoing professionalisation and focus in this area.   we are in charge of sourcing new deals, and our metrics follow closed integrations (or active partners) that help the protocol on the supply and demand side. We need a more mature onboarding process of RWA before having a group of dedicated professionals sourcing this type of deal.     Aes:  RWF-001 is primarily in an assessor role. In this framework, who is accountable for the number of deals onboarded (and DAI produced)?   I suppose we all are, as this is the protocol’s objective in general (generating Dai and distributing it). Still, each team is responsible for different parts of the onboarding process (GrowthCU sourcing new leads, RWF doing assessments and agreements, CES working in the integration, GovAlpha organizing the gov process…)     MakerMan:  Who is deciding the prioritization of the assessing and the assessing itself.   good question, and we all need to understand who prioritizes CUs’ workload. Not just for RWA but also for crypto collaterals and all other initiatives we currently have.     MakerMan:  Who is sourcing RWF deals if it isn’t RWF?   When we find a new RWF lead, due to its complexity, we work with the asset originator to help them to understand Maker as an organization, we also work with other CUs to have a clear idea of the onboarding process and all its implications. That’s what RWF calls the pre-mip. Before SocGen posted their MIP, there were months of internal work with them to have the proposal ready. With all the lessons we have learned from the onboarding of SocGen, we are improving the pre-mip stage to assure a faster and smoothing onboarding. Still, anyone can post a MIP and propose to onboard an asset, our current processes allow anyone from the community to do it, but I MKR holders need an expert reviewal on these deals (the elected CUs could do it or they could hire someone else to do it). The pre-mip phase allows these asset originators to provide the needed information MKR holders will need when deciding on greenlighting or not a collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.488808539944904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#56",
                    "likes": "0",
                    "time": "21/06/2022-23:40:00",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "668"
}