{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip4-en-espanol/4606",
            "title": "MIP4 - en espa\\xc3\\xb1ol ",
            "index": 4606,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "4",
                    "time": "06/10/2020-22:51:10",
                    "content": "MIP4 MIP4: Proceso de Enmienda y Remoción de MIPs Preámbulo MIP#: 4 Title: MIP Amendment and Removal Process Author(s): Rune Christensen (@Rune23), Charles St.Louis (@CPSTL) Contributors: @LongForWisdom Type: Process Status: Accepted Date Proposed: 2020-04-06 Date Ratified: 2020-05-02 Dependencies: n/a Replaces: n/a   Referencias MIP4c2-Subproposal-Template.mdMIP4c3-Subproposal-Template.md Sumario resumido La MIP4 define procesos para la enmienda y la remoción de MIPs aceptadas. Sumario extendido La MIP de Proceso de Enmienda y Remoción delinea el proceso para efectuar cambios de MIPs muy pequeños y relativamente superficiales. Esta MIP contiene dos Componentes de Proceso: el primero se encarga de la remoción de MIPs ratificadas; el segundo, de la enmienda de MIPs actualmente activas. Sumario de Componentes MIP4c1: Descripción de Propósito: Sugiere el propósito de los procesos de enmienda y de remoción y las posibles razones para el uso de cada proceso. MIP4c2: Proceso de Enmienda de MIPs: Un componente de proceso que define un método y un modelo para la enmienda de una MIP aceptada. MIP4c3: Proceso de Remoción de MIPs: Un componente de proceso que define un método y un modelo para la remoción de una MIP aceptada. Motivación La motivación de esta propuesta es que cambiar pequeños detalles de una MIP no debería hacer de esta una MIP obsoleta o reemplazarla. Esta MIP de Proceso es necesaria para definir y delinear el proceso para hacer estas modificaciones de MIPs una vez estas han sido ratificadas e implementadas. Adicionalmente, esta MIP define el proceso para la remoción de MIPs que perdieron su utilidad. Especificación / Detalles de la Propuesta  MIP4c1: Descripción del Propósito Enmiendas Pueden realizarse enmiendas de MIPs que preserven el número de MIP siempre que no se modifique la lógica de la MIP o las dependencia de la salida externa de la MIP.  Debe usárselas solo en casos de cambios mínimos. Validez Aunque la validez de las enmiendas de MIPs depende en última instancia de la Comunidad,  las siguientes son algunas razones (entre otras posibles) para las enmiendas:  Un cambio de formato Errores ortográficos Reformulación/clarificación  Las enmiendas de MIPs son inválidas cuando, según la evaluación de la Comunidad, los cambios son lo suficientemente grandes como para requerir no una enmienda sino un reemplazo de MIP. Remociones La MIP4 también habilita la remoción de MIPs que han perdido su utilidad. Si existen otras MIPs dependientes de la MIP a remover, también deben ser removidas en el mismo Ciclo de Gobernanza; si no, la propuesta será inválida.  MIP4c2: Proceso de Enmienda de MIPs La MIP4c2 es un componente de MIP de Proceso que permite la enmienda de una MIP aceptada mediante una subpropuesta. Las subpropuestas de  MIP4c2 tienen los siguientes parámetros:   Período de Feedback por Defecto: 3 meses  Período de Congelamiento: 1 mes  Las subpropuestas MIP4c2 deben usar el modelo ubicado en MIP4c2-Subproposal-Template.md. Este modelo se considerará ratificado una vez que esta MIP obtenga el estado de Aceptada.  MIP4c3: Proceso de Remoción de MIPs La MIP4c3 es un componente de MIP de Proceso que permite la remoción de una MIP aceptada mediante una subpropuesta. Las subpropuestas de MIP4c3 tienen los siguientes parámetros:   Período de Feedback por Defecto: 3 meses  Período de Congelamiento: 1 mes  Las subpropuestas de MIP4c3 deben usar el modelo ubicado en MIP4c3-Subproposal-Template.md. Este modelo se considerará ratificado una vez que esta MIP obtenga el estado de Aceptada. Esto es una traducción libre del artículo original en inglés. ¡Gracias a @Gala y a @blimpa por la traducción! ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/5cabd4810ffca120355ae242161f99ba1dc8e7fc/MIP4/MIP4c3-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/5cabd4810ffca120355ae242161f99ba1dc8e7fc/MIP4/MIP4c2-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/5cabd4810ffca120355ae242161f99ba1dc8e7fc/MIP4/MIP4c3-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/5cabd4810ffca120355ae242161f99ba1dc8e7fc/MIP4/mip4.md"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.447916666666666
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip1-en-espanol/4532",
            "title": "MIP1 - en espa\\xc3\\xb1ol ",
            "index": 4532,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "6",
                    "time": "04/10/2020-14:16:00",
                    "content": "MIP1: Paradigmas de Gobernanza de Maker Sumario abreviado MIP1 define y describe Paradigmas de Gobernanza y espacios problemáticos. Sumario extendido Un Paradigma de Gobernanza es un grupo específico y completo de conjuntos de MIPs que resuelven cabalmente un espacio problemático. Un espacio problemático se define como una lista de problemas que deben solucionarse para que el Protocolo Maker sea capaz de sostenerse a futuro y de convertirse en la futura Gobernanza de Maker. Sumario de Componentes MIP1c1: Definiciones Establece los significados de espacio problemático y Paradigma de Gobernanza. MIP1c2: El Espacio Problemático Inicial Define una lista inicial de problemas que deben resolverse para que un Paradigma de Gobernanza completo sea posible. MIP1c3: Cambiando el Paradigma de Gobernanza Define MIPs y Conjuntos de MIPs como el método a utilizar para enmendar o reemplazar el Paradigma de Gobernanza. MIP1c4: Modificando el Espacio Problemático Un componente de proceso que provee un método y un modelo para ajustar el espacio problemático. Motivación Tener un Paradigma de Gobernanza definido persigue el objetivo de darle a la Comunidad una visión de conjunto completa sobre cuáles MIPs específicas son usadas para abordar problemas específicos. El establecimiento de un Paradigma de Gobernanza le permite a la Comunidad reformar y mejorar partes específicas del proceso de gobernanza sin que la complejidad y los problemas de dependencias se salgan de control. A la vez hace más claro de qué manera la Comunidad puede reemplazar y remodelar el proceso de gobernanza y crear algo nuevo sin dejar de garantizar que todos los problemas que fueron resueltos por el proceso viejo también lo serán por el nuevo. Es importante tener siempre el mejor estimado posible de cuál es el panorama a largo plazo para el espacio problemático. La lista actual definida en esta MIP representa los problemas que la Fundación Maker cree que actualmente deben ser solucionados para que MakerDAO se vuelva autosustentable. La previsión es que esta lista irá cambiando con el tiempo conforme vaya ganándose experiencia práctica comunitaria. Después de la ratificación de esta MIP, la Comunidad Maker puede usar este proceso de subpropuesta para cambiar la lista en cualquier momento. Por lo tanto, la lista de espacios problemáticos no es permanente. La lista de espacios problemáticos sirve como la mejor estimación de cuáles son los problemas que la Comunidad Maker deberá resolver en estos próximos años y puede esperarse que cambie conforme vaya habiendo más información disponible. Especificación / Detalles de la Propuesta  MIP1c1: Definiciones Espacio Problemático Un espacio problemático es la representación de un problema particular o de un campo de problemas que deben solucionarse para que el Protocolo Maker sea capaz de sostenerse. El proceso de incorporación de nuevos tipos de colateral o el proceso de decisión de Gobernanza  de Maker son ejemplos de espacios problemáticos. Estos problemas complejos requieren sus propios lineamientos y  deben producir su propio conjunto de experiencias de aprendizaje. Nótese que los espacios problemáticos no definen a ninguna persona ni grupo trabajando en ellos, son entidades teóricas y en gran medida estáticas. Los espacios problemáticos existen aunque nadie trabaje en ellos. El Espacio Problemático del Paradigma de Gobernanza Una lista completa de los problemas, desafíos y oportunidades conocidos más críticos que la Comunidad Maker cree que la Gobernanza Maker debe ser capaz de tratar y gestionar con pericia para que la primera pueda continuar funcionando y creciendo. El Paradigma de Gobernanza Un conjunto de procesos completo e implementado mediante MIPs que le permite a la Gobernanza Maker tratar todo los puntos en el Espacio Problemático del Paradigma de Gobernanza. Conjuntos de MIPs Un conjunto de MIPs es un grupo de varias MIPs interdependientes de tal manera que, sin la totalidad de las MIPs consideradas, una o más MIPs del conjunto se vuelven inconsistentes, inválidas o absurdas. La intención es que los conjuntos de MIPs describan un único comportamiento complejo de modo tal que cada MIP pueda ser escrita siguiendo el principio de Especificidad sin que el conjunto deje de funcionar como un todo cohesivo y coherente.  MIP1c2: El Espacio Problemático Inicial Lista de Espacios Problemáticos El Espacio Problemático del Paradigma de Gobernanza actual se define como sigue y está dispuesto en un orden de prioridad laxo considerando riesgo y complejidad:   Marco de Trabajo de Gobernanza Central: Las estructuras de gobernanza clave que representan la columna vertebral de la gobernanza de largo plazo, tales como procesos que detallan cómo organizar los votos ejecutivos y otros procesos críticos. Este es un aspecto importante de una gobernanza con proyección a futuro y debemos instaurar una estructura formal que habilite un camino por el cual todos los problemas futuros puedan abordarse eficientemente.  Incorporación de Colateral: Un proceso estandarizado para añadir tipos de colateral al Protocolo Maker y también un proceso definido para la gestión continua. Añadir colateral al Protocolo es importante para la diversificación de la cartera de colaterales, lo que es fundamental para la estabilidad de Dai. Puesto que la incorporación de colateral es un componente central del Protocolo, la Comunidad Maker necesita un proceso estructurado para que se efectúe eficientemente y sin sobresaltos.  Módulo de Congelamiento de Oráculo Descentralizado:  Permitir a los poseedores de MKR congelar sin dificultad los oráculos en la contingencia de un ataque de oráculo.  Proceso de apelaciones: Posibilitar tanto el castigo a los poseedores de MKR que abusan el Módulo de Congelamiento de Oráculo Descentralizado como las eventuales apelaciones por parte de estos ante la Gobernanza MKR.  Un proceso de apelación es importante tanto para los módulos de seguridad descentralizada como para la incentivación de los votantes.  Ciclo de Estabilización de Dai: Gestionar la estabilidad de Dai y otros ajustes semanales. El ciclo de estabilización es necesario para la formalización a largo plazo de los procesos en existencia para mejorar la transparencia y la accesibilidad.  Delegación del voto: Permite la delegación del voto y gestiona los procesos sociales circundantes. La delegación del voto es crucial para la gobernanza a largo plazo ya que les da a todos los poseedores de MKR la posibilidad de expresar su opinión al usar MKR para votar. En resumidas cuentas, la delegación del voto ayuda a promover resultados que representen más fielmente la amplitud de la discusión pública de la Comunidad.  Activos Sintéticos: Incorporar nuevos activos sintéticos y ocuparse de su gestión de manera continua. Puesto que la incorporación de activos es un componente central del Protocolo, la Comunidad Maker necesitará un proceso estructurado para que esta se efectúe sin sobresaltos. Añadir nuevos tipos de activos sintéticos a Maker también incrementa la disponibilidad de activos crypto para todas las personas a lo largo y ancho del mundo.  Oráculos: Conforme se incorporan más activos colaterales al Procolo Maker aumenta la necesidad de enfocarse en cómo escalar los oráculos sin comprometer su seguridad. En relación a esto, formalizar los requisitos de los oráculos y estructurar un proceso formal para su incorporación y para su remoción es crucial.  Oráculos de Emergencia: Garantizar que los cierres de emergencia y el congelamiento de los oráculos ocurra a tiempo. Los oráculos de emergencia son cruciales para mantener los precios estables durante el evento de un cierre de emergencia del Protocolo Maker. Crear un proceso formal para los oráculos de emergencia también aumenta la protección de Dai y de los dueños de Vaults.  Módulo de Ajuste de la Estabilidad de Dai: Automatizar la gestión de la estabilidad de Dai. A largo plazo, la Gobernanza de Maker no puede sostener el proceso manual actual de votación ejecutiva que constantemente computa la gestión de la estabilidad, sobre todo con la incorporación creciente de activos al Protocolo. El Módulo de Ajuste de la Estabilidad de Dai permitirá que la gestión de estabilidad se efectúe sin necesidad de llevar a cabo votos ejecutivos.  Sitio Web y Redes Sociales: Operar makerdao.com y todas las cuentas oficiales de redes sociales. El marketing y las comunicaciones son cruciales para la marca Maker y es importante que los poseedores de MKR expresen su parecer acerca de la manera en que la DAO es representada públicamente. Las cuentas sociales de Maker actualmente son mantenidas y dirigidas por la Fundación Maker. Conforme nos acercamos a la disolución de la Fundación, estas cuentas y los canales de comunicación deberán pasar a manos de la Comunidad; para esto será necesario un proceso formalizado.  Entidades Guardianas y Reservas: Obtener y gestionar una infraestructura de reservas diversificadas. Tener reservas off-chain (fuera de la blockchain) mejora la resiliencia de Dai ante caídas del mercado. Los Guardianes y las reservas disminuyen el riesgo de dilución de MKR.  Incentivos de Votación: Incentivar la participación de votantes y crear un ecosistema delegado impulsado por el valor. Habilitar estructuras de incentivos que aumenten la participación de votantes es beneficioso para el sistema Maker en general porque cuanto más grande y activa es la base de votantes, menos probable se vuelve el riesgo de un ataque a la Gobernanza. Añadir una estructura de incentivación de votación formal también permitirá que el mecanismo de delegación de votos se vuelva autosuficiente a largo plazo.  Reconsideración del Diseño de Subastas: Un rediseño de los mecanismos de subasta en el Protocolo Maker. El sistema de subastas actual nació como una solución a corto plazo. Un rediseño de las subastas puede incrementar la eficiencia del sistema y reducir la probabilidad de resultados inesperados.  Fundación Dai: Gestionar y financiar la entidad que controla los activos legales y centralizados, tales como las marcas comerciales y los copyrights, que son vitales para MakerDAO. Esto es importante para la protección de los activos y para evitar cualquier posible uso inapropiado. Es muy importante que la Comunidad tenga un proceso formalizado para la financiación de la Fundación Dai y para su interacción con dicha Fundación.  Nota Importante Esta lista de espacios problemáticos no es definitiva sino más bien una estimación de los problemas que la Fundación Maker cree que necesitan resolverse durante estos próximos años en su camino a la autosustentabilidad. Redondeando, esto es un punto de partida y no representa un compromiso a largo plazo. Es esperable que vaya modificándose en base a las necesidades y a la experiencia de la Comunidad Maker.  MIP1c3: Cambiando el Paradigma de Gobernanza Enmendando el Paradigma de Gobernanza Un Paradigma de Gobernanza puede enmendarse mediante el reemplazo de MIPs específicas, o de un conjunto de MIPs, en el Paradigma de Gobernanza sin vulnerar la correcta interacción del resto de las MIPs dentro del conjunto de MIPs y del Paradigma de Gobernanza en general. Reemplazar un Paradigma de Gobernanza Un Paradigma de Gobernanza puede ser reemplazado en su integridad mediante el reemplazo de todas las MIPs en el Paradigma de Gobernanza por un grupo de MIPs nuevas contenidas en Conjuntos de MIPs que aborden todos los puntos en el Espacio Problemático del Paradigma de Gobernanza. Una MIP individual o un Conjunto de MIPs en el Paradigma de Gobernanza activo no pueden ser reemplazados si el reemplazo no interactúa apropiadamente con las otras MIPs en el Paradigma de Gobernanza del que depende la MIP reemplazada o que dependen de la MIP reemplazada. Si esto no es observado, el conjunto del Paradigma de Gobernanza podría romperse y las MIPs podrían dejar de funcionar correctamente debido a problemas de interdependencia. De modo que uno debe reemplazar una MIP individual o un Conjunto de MIPs en el Paradigma de Gobernanza o reemplazar el Paradigma de Gobernanza entero por un nuevo grupo de Conjuntos de MIPs que aborden todos los puntos en el Espacio Problemático del Paradigma de Gobernanza.  MIP1c4: Cambiando el Espacio Problemático Si la Gobernanza de Maker desea cambiar el Paradigma de Gobernanza y los procesos más drásticamente, deberán modificar el Espacio Problemático del Paradigma de Gobernanza. En la mayoría de los casos esto se logra mediante la expansión del Espacio Problemático una vez la experiencia práctica demuestra que hay problemas adicionales no previstos, desafíos u oportunidades que la Gobernanza de Maker debe abordar siguiendo un proceso predeterminado y claro. Sin embargo, también puede ser necesario reducir el alcance del Espacio Problemático o cambiar su lenguaje o el agrupamiento lógico de algunos de sus aspectos. MIP1c4 es un componente de MIP de Proceso que permite la creación de subpropuestas que pueden añadir o borrar items en el Espacio Problemático del Paradigma de Gobernanza. Las subpropuestas de MIP1c4 tienen los siguientes parámetros:   Período de Feedback: 3 meses  Período de Congelamiento: 1 mes  Las subpropuestas de MIP1c4 deben hacer uso del modelo localizado en MIP1c4-Subproposal-Template.md. Este modelo se considerará ratificado una vez que esta MIP adquiera el estado Aceptada. Esta MIP es una traducción libre de la MIP original en inglés . Gracias a @blimpa y @Gala por la traducción. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP1/MIP1c4-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/master/MIP1/mip1.md"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.872685185185185
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip2-en-espanol/4577",
            "title": "MIP2 - en espa\\xc3\\xb1ol ",
            "index": 4577,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#1",
                    "likes": "1",
                    "time": "06/10/2020-03:28:05",
                    "content": "MIP2: Período de lanzamiento Sumario abreviado MIP2 detalla dos fases durante las cuales la lógica definida por la MIP0 queda anulada. Sumario extendido Esta propuesta detalla el proceso de cómo la Gobernanza Maker puede iniciar la configuración e implementación del primer Paradigma de Gobernanza. De forma más específica, define dos fases:   Fase 1: cuando se establece un marco de trabajo central de Gobernanza y se ratifica un proceso de incorporación de colateral funcional.  Fase 2: cuando el Espacio Problemático está en proceso de ser abordado con MIPs y conjuntos de MIPs.  Por último, la propuesta establece que la propia MIP2 quedará obsoleta cuando se aborde oficialmente el Espacio Problemático. Sumario de Componentes MIP2c1: Fase Interina 1 Define la primera fase intermedia, en la que el período de retroalimentación y el período de congelación para las MIPs se ignoran hasta 3 meses después de que se implementen un framework de gobernanza central y un proceso de incorporación de colaterales funcionales a través de las MIPs. MIP2c2: Fase Interina 2 Define la segunda fase intermedia, en la que el período de feedback y el período de congelamiento de las MIPs se reducen hasta que se ha abordado el Espacio Problemático inicial. MIP2c3: Obsolescencia de la MIP2 Define la obsolescencia de esta MIP una vez superadas las fases intermedias. Motivación Una de las motivaciones críticas del marco de trabajo MIP es que hay un número finito de cuestiones críticas que deben cubrirse con procesos de gobernanza adecuados para que el sistema Maker sea seguro (consulte Paradigmas de Gobernanza MIP1). Al mismo tiempo, el objetivo también es garantizar que el proceso de implementación y modificación de la lógica crítica del proceso de gobernanza se realice a un ritmo que dé a la Comunidad el tiempo suficiente para analizar y comprender ideas específicas. Sin embargo, estos dos objetivos se contradicen en el período de lanzamiento inicial, donde aún no existe un marco de trabajo de gobernanza formal. Como resultado, la necesidad de cubrir todas las bases al tener una solución robusta y simple para los procesos de gobernanza implementada para todos los riesgos críticos tiene prioridad sobre el objetivo de ralentizar y analizar en profundidad todas las propuestas. Sin soluciones proactivas, la Comunidad podría verse obligada a tomar decisiones reactivas no deseadas en caso de que se presente un problema crítico o una oportunidad que aún no tenga un proceso definido. La toma de decisiones reactiva tiene el potencial de tener malos precedentes que no fueron entendido completamente en ese momento. Como resultado, la Comunidad debe priorizar la implementación de los procesos iniciales que cubrirán todos los riesgos y oportunidades críticos que se construyen como una formalización de los procesos o conocimientos existentes en la Comunidad y en la Fundación Maker. Una vez que el Paradigma de Gobernanza inicial esté en su lugar, la Comunidad puede modificarlo o reemplazarlo según sea necesario para construir un Paradigma más permanente y sólido, aprovechando el conocimiento práctico adquirido en el período intermedio. Especificación / Detalles de la Propuesta MIP2c1: Fase Interina 1 La Fase Interina 1 comienza cuando el vote sobre el tiempo de gobernanza elige que las MIPs iniciales deben proceder con el voto de ratificación. Durante la Fase Interina 1, la siguiente lógica anula la definida en MIP0:  El período de feedback y el período de congelamiento definidos en la MIP0 se ignoran tanto para las MIPs como para las subpropuestas. Múltiples MIPs y Subpropuestas pueden ser votadas con un solo voto.   Antes de la votación, se pueden proponer alternativas a las MIPs dentro del Conjunto MIP si interactúan correctamente con todas las demás MIP dentro del Conjunto.  Durante la Fase Interina 1, la siguiente lógica adicional es aplicada a los procesos MIPs definidos en la MIP0:  Un solo voto aprueba o rechaza todas las MIPs y subpropuestas durante la fase 1. Si se rechazan, las MIPs pueden volver a presentarse a la Comunidad para otra votación una vez que se hayan abordado los problemas que dieron lugar a su rechazo inicial.  La Fase Interina 1 finaliza 3 meses después de que se haya implementado un marco de trabajo de gobernanza central formal y un proceso funcional de incorporación de colaterales. MIP2c1: Fase Interina 2 La Fase Interina 2 comienza cuando la Fase Interina 1 termina. Durante la Fase Interina 2 la siguiente lógica anula la definida en la MIP0:  El período de feedback y el período de congelamiento definidos en la MIP0 se ignoran tanto para las MIPs como para las subpropuestas.  Durante la fase interina 2, se aplica la siguiente lógica adicional al proceso de MIPs definido en MIP0:  El período de feedback para las MIPs y las subpropuestas que pasan por el proceso de MIPs es de 1 mes, a menos que se defina como más corto. El período de congelamiento para las MIPs y las subpropuestas que pasan por el proceso de MIPs es de 1 semana, a menos que se defina como más corto. Si se rechazan, las MIPs y las subpropuestas pueden volver a presentarse a la Comunidad para otra votación una vez que se hayan abordado los problemas que dieron lugar a su rechazo inicial.  La Fase Interina 2 finaliza cuando se ha abordado el Espacio Problemático. Más específicamente, aquí es cuando se han ratificado los conjuntos de MIPs que han abordado cada problema enunciado dentro del Espacio Problemático. MIP2c3: Obsolescencia de la MIP2 Una vez que se ha abordado el Espacio Problemático, la MIP2 deja de tener efecto y el período de feedback y el período de congelamiento definidos en la MIP0 entran en vigencia inmediatamente. Además, a la MIP2 se le otorga inmediatamente el estado Obsoleto , lo que significa que cualquier cosa definida dentro de la MIP2 ya no deberá considerarse como el estándar activo. Esta MIP es una traducción libre de la MIP original en inglés. Gracias a @Lozadaluis12  y @Gala por la traducción. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip0-en-espanol/4463",
            "title": "MIP0 - en espa\\xc3\\xb1ol ",
            "index": 4463,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#1",
                    "likes": "5",
                    "time": "29/09/2020-17:16:29",
                    "content": "El Marco de Trabajo de las Propuestas de Mejoras Maker (MIP) - en Español Sumario abreviado La MIP0 define y describe el marco de trabajo de las MIPs. Sumario extendido La MIP0 es la propuesta primigenia que describe el marco de trabajo de las MIPs. Esto incluye los componentes centrales y los estados así como los diversos tipos de MIP y el ciclo de vida general de las mismas. La MIP0 provee también las herramientas necesarias, tales como los modelos de MIP, los procesos de reemplazo y las dependencias. Por último, la propuesta detalla los roles clave del marco de trabajo, el Editor de MIP y el Facilitador de Gobernanza, así como el proceso para añadirlos y removerlos. Sumario de componentes MIP0c1: Definición del marco de trabajo de la Propuesta de Mejoras Maker Define varios conceptos importantes para entender el proceso de las MIPs. MIP0c2: Principios centrales Elabora algunos principios centrales que toda MIP debería tener como norte. MIP0c3: El ciclo de vida de las MIPs Describe cómo se crea una MIP y su derrotero hasta su Aceptación o Rechazo. MIO0c4: Componentes de las MIPs y tipos de componentes de las MIPs Elabora el uso de componentes para compartimentalizar y organizar las MIP. MIO0c5: Proceso de reemplazo de las MIPs Elabora cómo pueden reemplazarse las MIPs y cuáles son los pasos a seguir para mantener las dependencias. MIO0c6: Materiales de apoyo Un componente que define cómo incluir materiales externos en las MIPs. MIP0c7: Modelos de las MIPs Define los modelos para las MIPs generales y técnicas. MIP0c8: Dependencias de roles de dominio de MIP0 Define los roles centrales necesarios para la operación exitosa de las MIPs. MIP0c9: Lista de roles del personal central Lista del personal que actualmente ocupa roles centrales. MIP0c10: Rol del Editor de MIP Un componente que define las responsabilidades, los criterios y los causales de remoción del rol de Editor de MIP. MIP0c11: Rol de Facilitador de Gobernanza Un componente que define las responsabilidades, los criterios y los causales de remoción del rol de Facilitador de Gobernanza. MIP0c12: Incorporación de personal central Un componente de proceso que define el proceso de adición de personal a los roles de Editor de MIP o Facilitador de Gobernanza. MIP0c13: Remoción de personal central Un componente de proceso que define el proceso de remoción de personal de los roles de Editor de MIP o Facilitador de Gobernanza. Motivación MakerDAO está evolucionando en una organización sin intermediarios, totalmente descentralizada, de código abierto y autosustentable. Con el fin de mantener y promover esta evolución gradual sin dejar de sostener la funcionalidad de la gobernanza tanto durante la disolución de la Fundación Maker como después de ella, Maker será legislado por medio de Propuestas de Mejoras Maker (MIPs). El propósito del marco de trabajo de MIP es posibilitar que cualquier miembro de la comunidad pueda hacer su aporte para la mejora de la Gobernanza y del Protocolo Maker. El empoderamiento de la comunidad y de otras partes interesadas mediante la estandarización de la propuesta de mejoras, especificaciones o cambios de procesos o de estados, persigue el objetivo de hacer posible el crecimiento orgánico que llevará a MakerDAO más y más cerca de la autosustentabilidad. Para que las MIPs sean funcionales es necesario que cumplan con un estándar básico que describa su estructura interna y sus dependencias externas. Este estándar es el descripto en MIP0, el marco de trabajo de las Propuestas de Mejoras Maker. Especificación / Detalles de las propuestas **MIP0c1: Definiciones del marco de trabajo de la Propuesta de Mejoras Maker ****  **Propuestas de Mejoras Maker (MIPs): son el mecanismo preferente para la mejora de la Gobernanza y del Protocolo Maker. Por medio de un proceso abierto y documentado, el objetivo es hacer acopio de tanto feedback comunitario como sea posible y alcanzar el consenso más amplio posible en relación a cómo debería evolucionar el Protocolo Maker. Una propuesta define claramente cómo y por qué la Gobernanza o el Protocolo Maker deberían ser modificados y garantiza que esta mejora sea incorporada de una manera responsable y respetando los estándares de calidad, de seguridad y comunitarios más altos.  MIP0: El MIP primigenio que define el marco de trabajo MIP. Este MIP define todos los procesos necesarios para la implementación de futuras MIPs.  Conjunto de MIP: Un conjunto de MIPs es un grupo de varios MIPs interdependientes de tal manera que, sin la totalidad de los MIPs considerados, uno o más MIPs del conjunto se vuelven inconsistentes, inválidos o absurdos. La intención es que los conjuntos de MIPs describan un único comportamiento complejo de modo tal que cada MIP pueda ser escrito siguiendo el principio de Especificidad sin que el conjunto deje de funcionar como un todo cohesivo y coherente.  Tipos de MIP: Las MIPs están separadas según tipo y cada tipo tiene su propia lista de MIP y de procesos.  MIP de Proceso: Las MIPs de Proceso se usan para crear y definir un proceso recurrente específico que será empleado por el Protocolo Maker o por la Gobernanza.  Subpropuestas (SP): Una subpropuesta es una instancia de un subproceso que ha sido definido por una MIP específica. Las subpropuestas son nombradas según el siguiente formato: MIP0-SP1 (donde MIP0 es una MIP de Proceso y MIP0-SP1 es una subpropuesta bajo esa MIP de Proceso)  Período Mínimo de Feedback: La cantidad mínima de tiempo dentro del cual la comunidad puede dar feedback en respuesta a una MIP.  Período mínimo de Congelamiento: La cantidad mínima de tiempo que una MIP debe permanecer sin cambios (congelada) antes de poder ser presentada para su ratificación/implementación.  Facilitador(es) de Gobernanza: Los Facilitadores de Gobernanza tienen la tarea de garantizar la operación correcta del proceso de Gobernanza. Esto involucra un abanico de actividades amplio: desde la administración general hasta el acopio de opinión y la planificación de la Gobernanza.  Editor(es) de MIP: Los Editores de MIP controlan los aspectos administrativos y editoriales del programa de MIP y de sus procesos. Se espera que el programa comience con un(a) editor(a) provisional de la Fundación Maker y que otras personas se unan más tarde.  Equipos de Dominio: Los Equipos de Dominio trabajan para el DAO, son incorporados a través de la Gobernanza y costeados por el Protocolo. Los Equipos de Dominio llevan a cabo tareas definidas por el DAO, tales como la supervisión de procesos críticos y la mitigación de riesgos. Estos equipos consisten en Riesgos, Oráculos, Contratos Inteligentes o Legal, aunque sin limitarse a ellos.  MIP0c2: Principios Centrales   Especificidad: Una MIP debe definir y tratar un comportamiento específico o una responsabilidad particular. No se permitirán MIPs con muchos comportamientos o responsabilidades diferentes; las propuestas con esa característica deberán ser seccionadas en múltiples MIPs.  Esto minimiza los peligros de la “letra chica” o de ataques potenciales ocultos en MIPs grandes y complejas.    Completitud: Una MIP o un Conjunto de MIPs están completos si tienen todas las partes necesarias o apropiadas para definir un comportamiento completo en lugar de ser sólo una parte específica de un todo mayor.  Esto es importante para la inteligibilidad, la legibilidad y la accesibilidad de las MIPs.    Evitar la superposición: El mismo comportamiento no debería ser implementado independientemente por múltiples MIPs. Por ejemplo, no debería haber dos maneras distintas e intercambiables de hacer incorporación de colaterales.  De este modo el proceso primario y mejor comprendido para cada comportamiento particular estará imparcialmente disponible para todo el mundo; esto evitará el surgimiento de lagunas en el conocimiento que permitan a algunos actores mejor informados usar procesos potencialmente superiores.    Claridad: Una MIP no debe ser susceptible de interpretaciones igualmente válidas y contradictorias. Los autores de MIP y los Editores de MIP deben esforzarse por minimizar la ambigüedad. Una MIP debe ser tan clara y sencilla de entender como sea posible.  Una MIP ambigua es una potencial causa de discordia o confusión a futuro. Hacer todo tan claro como sea posible también mejora la legibilidad y ayuda a mitigar el riesgo de ataques ocultos.    Brevedad: Una MIP debe ser tan corta como sea posible e incluir solo lo esencial, dados los otros principios centrales.  Las MIPs más breves tienen más chances de ser leídas de principio a fin por los participantes del gobierno. A su vez esto sirve para reducir el terreno susceptible de ataques ocultos.    MIP0c3: El Ciclo de Vida de las MIP El Ciclo de Vida de las MIPs y los Estados de las MIPs https://user-images.githubusercontent.com/32653033/79086728-19d93900-7d0b-11ea-8086-c255d919096c.png1014×314 38.3 KB Criterios para los Estados de las MIP 1. Concepción: El ciclo de vida de una MIP comienza con su posteo en el foro de Maker. Sin embargo, para que la MIP pase a la siguiente etapa es necesario que satisfaga los criterios de transición (1) aquí definidos:  Debe ser publicada en el foro MIPs Discourse. Debe ser subida al repositorio de MIP de Github (con un Pull Request creado por el autor de la MIP o por el Editor de MIP). El formato debe seguir el modelo MIP apropiado para su tipo. Las MIPs deben ser originales o reemplazos de MIPs anteriores. (Las repeticiones no están permitidas).  2. Aprobación por parte de los Editores de MIP: En esta fase de su ciclo de vida los Editores de MIP verifican que la MIP siga la estructura y los criterios editoriales correctos según los define el modelo de MIP. Si la MIP no satisface los criterios arriba expuestos, los Editores de MIP comunicarán las razones del rechazo al autor de la MIP y le darán la oportunidad de hacer las modificaciones pertinentes antes de reconsiderar la propuesta. Si en cambio la MIP satisface los criterios antedichos, los Editores de MIP llevarán a cabo estas acciones:  La MIP será aprobada por un Editor de MIP y se le asignará un número de MIP formal. El PR será incorporado por un Editor de MIP.  3. Request for Comments (RFC) (Petición de comentarios): En esta fase la MIP atraviesa un periodo de revisión formal que incluye: feedback comunitario, refinamiento del documento y adiciones. El eje cronológico para la fase RFC se define por su Periodo de Feedback y por su Periodo de Congelamiento. Antes de avanzar a la próxima fase, la MIP debe satisfacer los criterios de transición aquí definidos:  Basándose en el feedback comunitario, el autor de la MIP modifica la MIP y ultima detalles. Las MIP tienen un Periodo de Feedback de 3 meses. La fase RFC tiene una duración mínima de 3 meses; la MIP no puede avanzar de fase antes de que sea cumplida esta duración mínima. Las MIP tienen un Periodo de Congelamiento de 1 mes. Antes de avanzar a la próxima fase, las MIP tienen que permanecer sin cambios durante el último mes inmediatamente previo al momento de su promoción.  4. Requerimientos del Periodo de Feedback Cumplidos: Este estado le es otorgado a la MIP una vez atravesados el Periodo de Feedback y el Periodo de Congelamiento. Solo entonces la MIP está lista para su Presentación Formal. Nótese que el Periodo de Feeback y el Periodo de Congelamiento pueden superponerse. 5. Presentación Formal: En esta fase, los autores de una MIP presentan su MIP completa al ciclo de Gobernanza, postéandolo en la categoría de presentación formal del foro dentro del lapso de presentación formal de un ciclo de Gobernanza.  Una MIP puede ser presentada nuevamente al proceso de presentación formal hasta un máximo de dos veces más (tres en total), sin tener que pasar por las fases 1-4 otra vez, si no logró pasar debido a razones externas legítimas (ej. no fue considerada aisladamente sino como parte de una encuesta de Gobernanza o en un voto ejecutivo con una propuesta pólemica - sujeto al juicio de los Facilitadores de Gobernanza)  6. Aprobado por los Facilitadores de Gobernanza: En esta fase, la MIP debe ser formalmente aprobada por un Facilitador de Gobernanza.  Una vez aprobada por el Facilitador de Gobernanza, la MIP estará incluida en la encuesta de inclusión del ciclo de Gobernanza. Si la MIP no es aprobada por el Facilitador de Gobernanza, podrá ser reconsiderada en una fecha ulterior para entrar en el ciclo de Gobernanza.  7. Ciclo de Gobernanza: En esta fase, los accionistas MKR votan para decidir si la MIP será incluida en la encuesta de Gobernanza o no, determinando si la MIP puede entrar en el ciclo de Gobernanza formalmente o no.  Una vez aprobada para la encuesta de Gobernanza, los accionistas MKR determinan si se aceptará o se rechazará el conjunto de propuestas en la encuesta de Gobernanza y ratifican finalmente el resultado en el voto ejecutivo.  8. Voto Ejecutivo: En esta fase, la MIP se vuelve oficialmente ratificada o no. Siendo determinado por los accionistas MKR, el voto ejecutivo acepta o rechaza la MIP definitivamente. 9. Aceptado/Rechazado: El voto ejecutivo resulta en la aceptación o en el rechazo de la MIP. Si pasa, la MIP es oficialmente aceptada y se le da el estado de aceptada. Si el voto ejecutivo no logra pasar antes de su expiración, la MIP es rechazada.  Como se describió en la fase 5, una MIP rechazada puede ser presentada nuevamente y, en algunos casos (por ejemplo, si puede constatarse que fue rechazada en base a argumentos irrelevantes), puede ser autorizada para entrar al ciclo de Gobernanza siguiente inmediatamente.  Otros Estados de MIP: Retirado: Cuando un autor de una MIP retira su propuesta, como cuando:  Una MIP puede ser retirada en cualquier momento antes de entrar al ciclo de Gobernanza. Nótese que una propuesta retirada puede ser tomada de su autor original con una simple transición facilitada por el/los Editor/es de MIP y las partes respectivas. Si el autor original de la MIP no está más disponible, el Editor de MIP puede proceder con la transferencia de autoría.  Diferido: Cuando una propuesta ha sido considerada como no lista o no prioritaria pero puede ser presentada nuevamente en una fecha ulterior.  Request for Comments (RFC) - Petición de Comentarios: La encuesta del foro o la solicitud de señal rechaza una propuesta de MIP.  Obsoleto: Cuando una propuesta no se usa más o está desactualizada, por ejemplo:  Una MIP es remplazada con una nueva propuesta. Una MIP ha sido diferida por más de seis meses. Un autor de una MIP abandonó la propuesta y ninguna otra persona ha comunicado la voluntad de responsabilizarse de la autoría de la MIP. Una MIP ha sido remplazada por una propuesta de MIP más reciente y más actualizada. No tiene sentido seguir considerando una cierta MIP.  Proceso de Cambio de Estado de una MIP: Un cambio de estado para una MIP es solicitado por el autor de una MIP y será revisado por el/los Editores de MIPs para evaluar si cumple con los criterios del cambio de estado requerido. Si así es, el/los Editor/es cambiarán el estado de la MIP y el autor puede proceder con la siguiente etapa del proceso. Si no es así, el/los editor/es de MIP deberán hacer un retorno destacando los problemas y el autor deberá arreglar esos problemas antes de solicitar otro cambio de estado. MIP0c4: Los Componentes de MIP y los Tipos de Componentes de MIP Componentes de MIP  Cuando necesario, las MIPs pueden tener múltiples componentes si necesita contener múltiples unidades de lógica para satisfacer la completitud. Una MIP puede tener un componente único. Los componentes de MIP están categorizados por tipos, dependiendo del tipo de lógica que contienen. Los componentes MIP están nombrados en relación a su MIP madre. La convención de abreviación MIPXcY es utilizada para hacer referencia a estos componentes (como se explica en este documento). Un componente MIP tiene un tipo o ningún tipo.  Tipos de componentes   Componente MIP de proceso Sumario: El propósito de un componente MIP de proceso es definir un flujo de proceso específico que la Comunidad Maker adopte y estandarice con respecto a la operación de Gobernanza. Este tipo de componente MIP ayuda a homologar procesos específicos de manera transparente, abierta y trazable. Una MIP de Proceso proveerá un ámbito públicamente documentado del marco del proceso propuesto así como una descripción detallada de la estructura de la subpropuesta. Modelo especial: N/A Notas importantes:  Un componente MIP de proceso debe definir el Periodo de Feedback y el Periodo de Congelamiento para sus subpropuestas. Las subpropuestas de componentes MIP de proceso con tipos de componentes MIP adicionales heredan los mismos tipos.    Subpropuestas Sumario: Una supropuesta de un proceso expeditado que se define dentro de una MIP y que da las pautas de ejecución de un proceso dado dentro del marco de trabajo de las MIP.   Las subpropuestas requieren un modelo, un Periodo de Feedback y un Periodo de Congelamiento y deben ser presentadas usando ese modelo. Las subpropuestas atraviesan el proceso MIP del mismo modo que las MIP completas. El modelo, el Periodo de Feedback y el Periodo de Congelamiento para un conjunto de subpropuestas se definen mediante un componente MIP llamado Componente de Proceso. A toda MIP que contenga un Componente de Proceso se le asigna el tipo Proceso.   La convención para el nombramiento de subpropuestas es MIPXcY-SPZ, donde Y es el Componente de Proceso que contiene el modelo de la subpropuesta y X es la MIP que contiene ese componente. Esto es importante para poder delimitar diferentes tipos de subpropuestas definidas en la misma MIP bajo distintos Componentes de Proceso.   Modelo especial: N/A  MIP0c5: Proceso de Reemplazo de MIP Una MIP puede definir en su preámbulo uno o más objetivos a reemplazar. Si la MIP obtiene el estado Aceptada, la MIP a reemplazar recibe el estado Obsoleta y es efectivamente desactivada. La MIP reemplazada indicará en su documento MIP el número de la MIP que la reemplazó. Las MIPs que dependían de la MIP ahora obsoleta interactuarán con la nueva MIP. Debido a que las dependencias se trasladan, una MIP que define objetivos a reemplazar debe —para ser válida— adherirse estrictamente a los requisitos de dependencia e interactuar correctamente con las MIP que dependen de la MIP reemplazada.  MIP0c6: Materiales de apoyo Opcionalmente, las MIP pueden hacer referencia a materiales externos. Los materiales externos deben ser añadidos al github de MIP en la misma carpeta que la MIP que los referencia. Los materiales referidos externamente no son contenido MIP y no son ratificados cuando una MIP es aceptada — a menos que expresamente se indique lo contrario en una especificación de componente de MIP.  MIP0c7: Modelos de MIP Modelo de MIP General  El Modelo de MIP General debería ser usado cada vez que un modelo rafiticado más específico resulte no ser del todo apropiado. El Modelo de MIP General se encuentra en General-MIP-Template.md. Este modelo se considerará ratificado una vez que el estado de esta MIP es Aceptado.  Modelo de MIP Técnica  El Modelo de MIP Técnica debería ser usado cada vez que una MIP proponga cambios del código de contratos inteligentes dentro del Protocolo Maker. El Modelo de MIP Técnica se encuentra en Technical-MIP-Template.md. Este modelo se considerará ratificado una vez que el estado de esta MIP sea Aceptado.   MIP0c8: MIP0 Dependencias de Roles de Dominio El marco de trabajo de MIP depende de estos tipos de Roles de Dominio:   Editor(es) de MIP: Los Editores de MIP controlan los aspectos administrativos y editoriales del programa de MIP y de sus procesos. Se espera que el programa comience con un editor provisional de la Maker Foundation y que otras personas se unan más tarde.  Autoridad específica del Editor de MIP en los procesos MIP0:  El Editor de MIP controla la fase 2 del ciclo de vida de las MIPs y tiene la potestad de asignar números MIP El Editor de MIP es admin en el repositorio de MIP de Github El Editor de MIP es moderador en el foro MIPs Discourse El Editor de MIP es responsable de la actualización del estado de las MIPs, según se describe en MIP0c4 “El Ciclo de Vida de las MIPs”.    Facilitador de Gobernanza: Gestiona frontends de votación, lleva a efecto reuniones de Gobernanza y acepta MIPs que están listas para ser incluidas en el Ciclo de Gobernanza y, en consecuencia, para que se las vote.  Autoridad específica del Facilitador de Gobernanza en los procesos MIP0:  El consenso de todos los Facilitadores de Gobernanza controla la fase 6 del ciclo de vida de las MIP; esto les permite, de forma consensuada, añadir MIPs válidas a la encuesta de inclusión del próximo Ciclo de Gobernanza, avanzándolas desde la fase 5 (presentación formal) a la fase 7 (Ciclo de Gobernanza).    La adición de personal a estos roles puede hacerse usando una subpropuesta MIP0c10.La remoción de personal de estos roles puede hacerse usando una subpropuesta MIP0c11.  MIP0c9: Lista de Roles del Personal Central Esta lista puede enmendarse a través de los componentes de MIP0 de incorporación (MIP0c12) y de remoción (MIP0c13) de personal central. Las entradas en esta lista deberían seguir este modelo: - Nombre de la persona: El nombre de la persona en el rol central. \t- Número de subpropuesta (MIP0c12-SP): # \t- Rol central: El rol central en que esta persona opera \t- Fecha de adición: <fecha en formato (aaaa-mm-dd)>   Lista de Personal Central Activo:  Facilitadores de Gobernanza:    Nombre de la persona: Richard Brown   Número de Subpropuesta (MIP0c12-SP): N/A (El Facilitador de Gobernanza fue ratificado con anterioridad al proceso de MIP. Referencia: Mandate: Interim Governance Facilitators)  Rol Central: Facilitador de Gobernanza  Fecha de Adición: 2019-09-09 (Poll: Ratify the Interim Governance Facilitator Mandate)    Nombre de la persona: LongForWisdom   Número de Subpropuesta (MIP0c12-SP): 2  Rol Central: Facilitador de Gobernanza  Fecha de Adición: 2020-05-28 Ratification Vote: Officially Ratify the MIP0c12-SP2 Subproposal for Onboarding a Second Governance Facilitator      Editores de MIP:    Nombre de la persona: Charles St.Louis   Número de Subpropuesta (MIP0c12-SP): 1  Rol Central: MIP Editor  Fecha de Adición: 2020-05-02 (Ratification Vote)     MIP0c10: Rol de Editor de MIP Responsabilidades El Editor de MIP controla los aspectos administrativos y editoriales generales del proceso MIP y de su marco de trabajo. Esto incluye:  Mantenimiento y gestión de mips.makerdao.com. Provisión de feedback y sostenimiento de discusiones en la sección de MIP de forum.makerdao.com (por ejemplo: colaborar con el veto de ideas de propuestas). Procesamiento de MIP. Gestión y organización de MIP y de Preámbulos de Subpropuestas. Incorporación y veto de nuevos Editores de MIP. Afianzamiento de los procesos de MIP apropiados con responsabilidades tales como:  Verificar que el título describa adecuadamente el contenido de la propuesta. Verificar la existencia real de autores, coordinadores, financiadores y/o patrocinadores, etcétera, de las MIPs. Asignar a las MIPs propuestas sus números de identificación formales. Cambiar los estados de las MIPs. Corregir el posicionamiento categórico de las MIPs. Mantener comunicación con coordinadores o autores de MIPs. Revisar las MIPs e identificar problemas en su redacción (formato, completitud, ortografía, gramática, estructura oracional) y comprobar que no se aparten de la guía de estilo (del modelo). Los Editores de MIP tienen la potestad de hacer correcciones ellos mismos; no obstante, no están obligados a hacerlo y en cambio pueden enviarles comentarios a los autores para que ellos mismos hagan las enmiendas pertinentes. Trabajar con los Facilitadores de Gobernanza y mantener comunicación con ellos con respecto a la coordinación de Votos Ejecutivos y de Gobernanza en relación a las MIPs y el Ciclo de Gobernanza.    Criterios de selección Al seleccionar un Editor de MIP deberían considerarse estos criterios:  Una comprensión cabal del marco de trabajo de MIP Aunque habrá un transvase de conocimiento al momento de la incorporación, el candidato debe estar muy familiarizado con el marco de trabajo y con la operación general de otros marcos de trabajo de propuestas de mejoras. Es necesario haber sido miembro de la Comunidad durante algún tiempo. Esto puede demostrarse por medio de diversas pruebas de participación, como por ejemplo:  El historial de posteos en el foro Asistencia en las llamadas comunitarias y de Gobernanza Autoría de artículos sobre Maker o Dao   Familiaridad con los aspectos técnicos internos del Protocolo Maker (extra) Experiencia con Github  Haciendo merges, editar, y cerrar los Pull Requests  Hacerse cargo de problemas Añadir tags/labels   Experiencia con el lenguaje Markdown  Las MIPs serán escritas en Markdown, de modo que los editores deberán estar familiarizados con el lenguaje    Adición Una vez incorporada una persona al rol de Editor de MIP, se la añadirá también a Github y se la subscribirá para monitorear el repositorio de MIP. Asimismo se la designará como moderador en el canal de MIP de Rocket.Chat y en el foro de MIP. Muchos de los intercambios y comunicaciones en relación con MIP se canalizarán mediante GitHub y/o los foros de MakerDAO. Remoción Se considerará la remoción de un Editor de MIP si resulta que este:  No está llevando a cabo las tareas que le corresponden de manera adecuada Se ausenta de sus tareas por un periodo prolongado Da muestras de comportamiento poco ecuánime o malicioso Expresa su renuencia a continuar desempeñándose en el rol  El proceso de remoción comienza una vez que la Comunidad ha examinado y encontrado válidas las causales de remoción. Este proceso debe ser comunicado públicamente vía los foros para asegurar una completa transparencia. El Editor de MIP será entonces removido de los siguientes canales:  Github RocketChat Forums   MIP0c11: Rol del Facilitador de Gobernanza Responsabilidades Las responsabilidades del Facilitador de Gobernanza se definen de este modo: Responsabilidades Centrales  Es responsable de garantizar la salud y la integridad de los canales de comunicación usados para la comunicación interna de MakerDAO. Esto incluye actividades tales como tareas de moderación, el establecimiento de procesos y normas sociales y la defensa de los canales contra trolleo y ataques Sybil. Es necesario que permanezca neutral y objetivo acerca de asuntos externos al dominio de la Gobernanza y que se enfoque en las medidas, los procedimientos y la facilitación. Es necesario que programe, lleve a cabo y modere reuniones de Gobernanza y Riesgo semanales desde una posición neutral. Es necesario que organice y lleve a cabo procesos de Gobernanza según lo indicado por las MIPs o conjuntos de MIP relevantes cuyo estado sea Aceptado. Es necesario que cree encuestas on-chain en el frontend de votación “oficial” según lo indicado por procesos de gobernanza definidos de las MIPs o conjuntos de MIP relevantes cuyo estado sea Aceptado. Debería promover una cultura de apertura, receptividad y discusiones razonadas dentro de la Comunidad. Debería trabajar con la Comunidad para operar un proceso de votación de emergencia para proteger el sistema ante la irrupción de una emergencia. Debería incorporar y luego mantener cómo mínimo tres Facilitadores de Gobernanza en todo momento; debería priorizar candidados de regiones geográficas subrepresentadas.  Animar la Participación  Debería trabajar en pos de mantener y animar el debate sano de acuerdo a las pautas delineadas en el Marco Científico de Gobernanza y Riesgo y los Principios Centrales de la Fundación Debería garantizar que la agenda de eventos de la Gobernanza por suceder se comunique adecuadamente a todas las partes interesadas con un mínimo de antelación de una semana. Debería apuntar a promover e incrementar la participación de las partes interesadas en el proceso de Gobernanza. Debería garantizar que los nuevos miembros de la comunidad entiendan cuál es el nivel de decoro y civismo generalmente esperado dentro del grupo; también debería garantizar que tengan los recursos que necesitan para incorporarse rápidamente.  Aumentar la eficiencia  Debería garantizar que se apliquen “consensus gathering methods” una vez la discusión alcance su fin natural. Debería apoyar y facilitar las comunicaciones entre otros actores autorizados en el Protocolo Maker. Debería estar atento a oportunidades de homologar el proceso de Gobernanza sin sacrificar la integridad de este.  Cohesión y moral  Es responsable de elevar los problemas de Gobernanza que encuentre a la Fundación Maker o al ecosistema tercerizado y de garantizarle a la comunidad un seguimiento apropiado. Debería ayudar a generar y a mantener la moral y la participación entre los miembros de la Comunidad de Gobernanza. Debería animar a la comunidad a alcanzar consensos sobre las opciones menos objetables y no tomar el proceso de toma de decisiones como una competencia en que una parte de la Comunidad debe resentir el resultado. Debería trabajar para acercar las posturas de los miembros de la Comunidad de Gobernanza cuando se traten temas controvertidos con el fin de evitar la polarización política y la demagogia.  Criterios de selección Al evaluar a una persona para el rol de Facilitador de Gobernanza deberían usarse los siguientes criterios:  Debería tener una comprensión cabal del marco de trabajo de MIPs y de su contenido, sobre todo en relación a las MIPs de Gobernanza centrales Es necesario haber sido miembro de la Comunidad durante algún tiempo. Esto puede demostrarse por medio de diversas pruebas de participación, como por ejemplo:  El historial de posteos en el foro Asistencia en las llamadas comunitarias y de Gobernanza La existencia de contribuciones en relación a problemas de Gobernanza con independencia del medio por que se hayan canalizado.   Aunque se impartirá conocimiento al momento de la incorporación, al candidato deben serle familiares los roles y las responsabilidades de los Facilitadores de Gobernanza. Debería estar familiarizado con el funcionamiento técnico interno del Procolo Maker (extra). Debe tener experiencia interactuando con diferentes partes interesadas de la Comunidad en todos los medios que esta usa para comunicarse, incluyendo salas de chat, foros y llamadas de videoconferencia. Debería ser capaz de expresarse con confianza en cada uno de los medios que la Comunidad usa para comunicarse, incluyendo salas de chat, foros y llamadas de videoconferencia. Debería interesarse por los mecanismos de Gobernanza usados actualmente en el mundo y por aquellos que han sido usados históricamente.  Remoción Se considerará la remoción de un Editor de MIP si resulta que este:  No está llevando a cabo las tareas que le corresponden de manera adecuada Se ausenta de sus tareas por un periodo prolongado Da muestras de comportamiento poco ecuánime o malicioso Expresa su renuencia a continuar desempeñándose en el rol  El proceso de remoción comienza una vez que la comunidad ha examinado y encontrado válidas las causales de remoción. Este proceso debe ser comunicado públicamente vía los foros para asegurar una completa transparencia. El Facilitador de Gobernanza será entonces removido de los siguientes canales:  Github RocketChat Forums   MIP0c12: Incorporación de Personal Central MIP0c12 es un componente MIP de Proceso que permite la incorporación de personal central a través de una subpropuesta. Las subpropuestas de MIP0c12 tienen los siguientes parámetros:   Periodo de Feedback: 3 meses  Periodo de Congelamiento: 1 mes  Las subpropuestas de MIP0c12 deben usar el modelo ubicado en MIP0c12-Subproposal-Template.md. Este modelo se considerará ratificado una vez el estado de esta MIP pase a Aceptado.  MIP0c13: Remoción de Personal Central MIP0c13 es un componente MIP de Proceso que permite la remoción de personal a través de una subpropuesta. Las subpropuestas MIP0c13 tienen los siguientes parámetros:   Periodo de Feedback: 0 días  Periodo de Congelamiento: 0 días  Las subpropuestas MIP0c13 deben usar el modelo ubicado en MIP0c13-Subproposal-Template.md. Este modelo se considerará ratificado una vez el estado de esta MIP pase a Aceptado.  Este documento es una traducción libre del artículo original. Gracias a @blimpa y @Gala por la traducción. ",
                    "links": [
                        "https://hackmd.io/IHzIXBAKS6mrOogk4G2lkg",
                        "https://forum.makerdao.com/t/mandate-interim-governance-facilitators/264",
                        "https://vote.makerdao.com/polling-proposal/qmvh4z3l5ymqgtfs6tifq3jpjx5mxgdfnjy6alewnwwvba",
                        "https://mkrgov.science/executive/0x9713187b6d7c8d54ac041efdbac13d52c2120fb9",
                        "https://vote.makerdao.com/executive-proposal/lower-usdc-sf-add-wbtc-ratify-the-initial-mips-and-subproposals",
                        "http://mips.makerdao.com/",
                        "http://forum.makerdao.com/",
                        "https://hackmd.io/IHzIXBAKS6mrOogk4G2lkg",
                        "https://hackmd.io/IHzIXBAKS6mrOogk4G2lkg",
                        "https://github.com/makerdao/mips/blob/master/MIP0/mip0.md"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.184748427672956
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip5-en-espanol/4770",
            "title": "MIP5 en Espa\\xc3\\xb1ol ",
            "index": 4770,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#1",
                    "likes": "3",
                    "time": "16/10/2020-16:49:57",
                    "content": "MIP5: Sistema de Votación de Emergencia Preámbulo MIP#: 5 Title: Emergency Voting System Author(s): Rune Christensen (@Rune23) and Charles St.Louis (@CPSTL) Contributors: @LongForWisdom Type: Process Status: <Assigned by MIP Editor> Date Proposed: 2020-04-06 Dependencies: n/a Replaces: n/a   Sumario Abreviado La MIP5 define cambios de emergencia al protocolo y al rol de Facilitador de Gobernanza y cómo deben manejarse en la práctica. Sumario Extendido Esta propuesta define un sistema de votación de emergencia. Los votos de emergencia son votos ejecutivos que pueden ser iniciados por cualquier miembro de la comunidad. Sumario de Componentes MIP5c1: Votos de Emergencia respecto a los Facilitadores de Gobernanza Este componente aborda la remoción de emergencia de un particular del rol de Facilitador de Gobernanza. MIP5c2: Un Cambio de Estado de Emergencia Este componente aborda los cambios de estado de emergencia al protocolo y cómo deben ser manejados por los Facilitadores de Gobernanza. Motivación La propuesta de este estándar tiene como fin permitirle a la comunidad superar las restricciones del Ciclo de Gobernanza (MIP3) en situaciones en que el tiempo apremia y urge hacer cambios o remover una parte del sistema operativo. Especificación / Detalles de la Propuesta MIP5c1: Votos de Emergencia respecto a Facilitadores de Gobernanza Un voto de emergencia con respecto a los Facilitadores de Gobernanza codifica una o más URL en un contrato de votación on-chain (spell), así como una lógica de contención que detiene cualquier flujo de pago a los Facilitadores de Gobernanza existentes.  Si el voto ejecutivo obtiene la mayoría de votos MKR y se convierte en una propuesta activa, los Facilitadores de Gobernanza existentes son removidos. La lista de URL a sitios web corresponde a una lista de uno o más Facilitadores de Gobernanza Interinos, con sus plataformas de Gobernanza, que reemplazarán a los Facilitadores de Gobernanza actuales. El Ciclo de Gobernanza actual es cancelado y los nuevos Facilitadores de Gobernanza Interinos dan inicio a un nuevo Ciclo de Gobernanza el siguiente primer lunes del mes.  MIP5c2: Un Cambio de Estado de Emergencia Un voto ejecutivo de emergencia que contiene lógica de cambio de estado. Por ejemplo, cambiar el DSR o remover un tipo de colateral. Este tipo de votos en algunos casos puede ser usado para reducir el riesgo en el sistema, para estabilizar la paridad  o para arreglar problemas técnicos críticos. Sin embargo, también son muy peligrosos y deben usarse con cuidado, ya que potencialmente pueden ser, por ejemplo, ataques que drenen todos los colaterales del sistema. Los Facilitadores de Gobernanza pueden ignorar un cambio de estado de emergencia; o declarar su apoyo a un cambio de estado de emergencia mediante su adición a sus Portales de Gobernanza como un voto ejecutivo programado irregularmente; o declararlo un ataque a la Gobernanza y así promover la potencial activación un apagado de emergencia por parte de los usuarios como respuesta. Traducción libre del artículo original en inglés. Gracias a @blimpa, @Lozadaluis12 y @Gala    por la traducción. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip24-respuesta-de-emergencia/4945"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.902777777777778
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip6-en-espanol/4771",
            "title": "MIP6 en espa\\xc3\\xb1ol ",
            "index": 4771,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#1",
                    "likes": "3",
                    "time": "16/10/2020-16:50:54",
                    "content": "MIP6: Formulario de Incoporación de Colateral / Modelo para el Foro Preámbulo MIP#: 6 Title: Collateral onboarding form/forum template Author(s): Charles St.Louis (@CPSTL), Rune Christensen (@Rune23) Contributors: @LongForWisdom, Leo Jsaraceno (Mitote), Helge Andreas Qvam (@planet_X) Type: Process Status: <Assigned by MIP Editor> Date Proposed: 2020-04-06 Dependencies: n/a Replaces: n/a   Sumario Abreviado La MIP6 define el formulario de aplicación estandarizado usado para darle inicio al proceso de incorporación de un nuevo activo colateral al Protocolo Maker y provee una visión general del mismo. Sumario Extendido El propósito de esta propuesta es estandarizar el formulario de incorporación de colateral/modelo para el foro que los miembros de la comunidad y proyectos de terceros pueden usar para darle iniciar al proceso para lograr la incorporación de su colateral al Protocolo Maker. Sumario de Componentes MIP6c1: Visión General del Proceso Provee una visión general del proceso de presentación del formulario de solicitud de colateral que incluye locación, partes interesadas involucradas y la siguiente fase. MIP6c2: Modelo de Formulario de Solicitud Provee el modelo de formulario de solicitud de colateral a usarse en el proceso de presentación definido en MIP6c1. MIP6c3: Marco de Trabajo de Subpropuestas Un componente de proceso que define un método y un modelo para enmendar el modelo de formulario de solicitud de colateral definido en MIP6c2. Motivación Esta propuesta busca trazar y establecer una parte del proceso generalizado para la adición de tipos de colateral al Protocolo Maker. Esto le permitirá a la comunidad tener una idea de cuál es el colateral solicitante y le dará una visión general de los riesgos y de cuáles son los potenciales beneficios para Maker. Un formulario de solicitud consistente permite que tipos de colateral prospectivos sean comparados por la comunidad. Los materiales promocionales le permiten a la parte interesada promover el interés de la comunidad Maker. Si bien este es solo un componente del más amplio proceso de incorporación de colateral, este estándar propuesto debería reducir la confusión en torno a cómo darle inicio al proceso para lograr que un colateral sea añadido al Protocolo Maker y, por último, incrementar la velocidad a la que pueden incorporarse nuevos tipos de colateral. Especificación / Detalles de la Propuesta MIP6c1: Visión General del Proceso Formulario de Incorporación de Colateral / Plantilla del Formulario  Rellena la solicitud/preguntas tan detalladamente como estés dispuesto a hacerlo.  Una vez rellenada, la solicitud debe ser publicada en el foro oficial de MakerDAO dentro de la subcategoría Collateral Onboarding App, que se encuentra dentro de la categoría Maker Improvement Proposals . Esta publicación debe llevar la etiqueta collateral-app. Nótese que “parte interesada”  se refiere a cualquiera dispuesto a actuar como “stakeholder” en este proceso de incorporación.   Después de la presentación en el foro es probable que la comunidad tenga preguntas ulteriores. Si bien no es un requisito hacerlo, responder preguntas acerca de tu proyecto puede ayudar a generar apoyo o entusiasmo por el tipo de colateral propuesto. Adicionalmente, la parte interesada puede organizar una llamada opcional para promocionar su propuesta y para abrir la discusión a la comunidad. Una vez presentada en el foro, la solicitud pasa a ser elegible para obtener un Visto Bueno de Dominio según se define en MIP8. Pasadas dos semanas de discusión y una vez completado el Visto Bueno de Dominio (MIP8), la solicitud es elegible para avanzar a la instancia de Encuesta de Visto Bueno Comunitario definida en MIP9.  Diagrama General del Proceso Global mip61298×924 75.4 KB   MIP6c2: Modelo del Formulario de Solicitud Las respuestas a estas preguntas sirven como una presentación ante la comunidad. Este mínimo de información ayuda a que los miembros de la comunidad intrigados por el colateral propuesto investiguen el proyecto por su cuenta. Alentamos el uso de otros materiales promocionales de todo tipo si el solicitante cree que esto lo ayudará a obtener apoyo y a azuzar el entusiasmo por el colateral. Las preguntas de solicitud sugeridas son las siguientes:  ¿Quiénes representan la parte interesada para la solicitud de colateral? Provee una breve visión de conjunto de alto nivel del proyecto que haga hincapié en el token del colateral solicitante. Provee una breve historia del proyecto. Proporciona links al whitepaper, a portales de documentación y al código fuente para el/los sistema/s que interactúa/n con el colateral propuesto, y todas las direcciones de Ethereum relevantes. Si el sistema es complejo, se agradece encarecidamente el uso de gráficos esquemáticos. Proporciona links a todas las auditorías del proyecto disponibles, tanto las procedimentales como las enfocadas en smart contracts. Proporciona links a todas las comunidades activadas vinculadas a tu proyecto. ¿Cómo se usa actualmente el tipo de colateral solicitante? ¿Alguna organización carga con la responsabilidad legal por el colateral? ¿En qué jurisdicción reside esa organización? ¿Dónde ocurren cambios en que participa el activo? (Opcional) ¿Hubo en relación a tu proyecto opiniones legales o memorandas con respecto a la posición reglamentaria del token o una explicación de lo mismo desde la perspectiva de cualquier jurisdicción? Si así es, esos materiales deberían ser provistos para revisión comunitaria. (Opcional) Describe si existen registros reglamentarios para el token y provee documentación relevante (incluyendo una explicación de cualesquiera interacciones pasadas o actuales con cualquier autoridad de regulación, independientemente de la jurisdicción). (Opcional) Presenta una lista de cualesquiera fuentes de datos de oráculos posibles para el tipo de colateral propuesto. (Opcional) Proporciona una lista de las partes interesadas en participar de liquidaciones para el tipo de colateral propuesto.   MIP6c3: Marco de Trabajo de las Subpropuestas Además de introducir el modelo estandarizado para la presentación de tipos de colateral a ser revisados, esta MIP también introduce la subpropuesta MIP6-Subproposal (MIP6-SPs). Requerimientos MIP6-SPs será usada para definir cambios a los campos requeridos de este formulario de solicitud de colateral/publicación en el foro. Sin embargo, existe mucha flexibilidad en lo que refiere a omitir algunos datos — pero sobre todo en lo que refiere a añadir datos extra. Es esperable que la comunidad tenga con frecuencia una acumulación de campos de datos requeridos estándar de facto adicionales en las propuestas que no hayan sido todavía añadidos a los campos requeridos oficiales vía MIP6-SPs. Para presentar una subpropuesta MIP6 debe crearse una MIP a partir del modelo provisto. Modelo de MIP6-SP:   Período de Feedback: 1 mes  Período de Congelamiento: 1 semana  Modelo de Subpropuesta:  Introduction     - MIP6c3-SP: #    - Title: <Title>  - Author(s): <Name>, <Github handle>  - Date Proposed: year-month-day  Specification     - Motivation     - Explain the motivation behind the changes to the application questions.        - List of changes to Application questions.   Esto es una traducción libre del artículo original en inglés. Gracias a @blimpa y @Gala   por la traducción. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-form-forum-template/1908"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2872023809523805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/02/2021-09:42:11",
                    "content": "@Gala Is there anyone maintaining this template from a deal origination point of view for RWA-types of projects? I am assuming this is supposed to target the sort of originations as currently done by platforms like Cumplo in Latam? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#3",
                    "likes": "1",
                    "time": "11/02/2021-12:52:22",
                    "content": "Hi william, in LATAM we have the Dai Action Groups (i’m a member of the Vzla team) who are working on bring this models to some companies, right now we are working in a way to explain them how RWA works and figuring out how to do with brokers or OTCs in order to have the liquidity needed. Soon we’ll be posting a sort of educational content about this and see if some companies would like to join into this tokenized asset world. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.059523809523809
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip7-en-espanol/4772",
            "title": "MIP7 en espa\\xc3\\xb1ol ",
            "index": 4772,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#1",
                    "likes": "3",
                    "time": "16/10/2020-16:52:20",
                    "content": "MIP7: Incorporación y Remoción de Equipos de Dominio (Incorporación de Colateral) Preámbulo MIP#: 7 Title: Onboarding and Offboarding Domain Teams (Collateral Onboarding) Author(s): Charles St.Louis (@CPSTL), Rune Christensen (@Rune23) Contributors: @LongForWisdom, Leo Jsaraceno (@Mitote), Helge Andreas Qvam (@planet_X) Type: Process Status: Request for Comments (RFC) Date Proposed: 2020-04-06 Dependencies: n/a Replaces: n/a   Sumario Abreviado La MIP7 define los procesos para la incorporación y para la remoción de equipos de dominio. Sumario Extendido La propuesta de incorporación y de remoción de equipos de dominio provee un marco de trabajo previsible para tanto la incorporación como la remoción de equipos de dominio requeridos para el proceso de incorporación de colateral. Sumario de Componentes MIP7c1: Descripciones de Equipos de Dominio Describe los diversos equipos de dominio y su responsabilidad en cuanto se relacionan al proceso de incorporación de colateral. MIP7c2: La Lista de Roles de Dominio Actuales Un componente de lista que es mantenido al día  con los equipos de dominio actualmente ratificados. MIP7c3: Incorporación de Equipos de Dominio Un componente de proceso que define un método y un modelo que permite la incorporación de equipos de dominio. MIP7c4: Remoción de Equipos de Dominio Un componente de proceso que define un método y un modelo que permite la remoción de equipos de dominio. Motivación El Protocolo Maker requiere una fuerza de trabajo descentralizada para poder incorporar nuevos tipos de colateral. Esta MIP describe los equipos de dominio necesarios en el proceso de incorporación de colateral y resalta su autoridad especial en el sistema de gobernanza en relación a la supervisión de procesos críticos y a la mitigación de riesgos. Especificación / Detalles de la Propuesta MIP7c1: Descripciones de Equipos de Dominio   Los Equipos de Oráculo son los responsables de diseñar los mecanismos de indicadores de oráculo para nuevos tipos de colateral, obligando a los oráculos a actualizar sus nodos con los nuevos indicadores de precio para los nuevos tipos de colateral vía MIP10, y creando producto de trabajo de oráculo para la incorporación de colateral.  Los Equipos de Contratos Inteligente (Smart Contracts) son los responsable del desarrollo y de la implementación del adaptador de colateral para la incorporación de nuevo colateral y de crear además el producto de trabajo técnico para las propuestas de incorporación de colateral.  Los Equipos de Riesgo son los responsables de crear la construcción de riesgo para las propuestas de incorporación de colateral. Como parte del proceso de incorporación de colateral, también deben lograr la ratificación de un modelo general sobre el que puedan basar su construcción de riesgo.  Los Equipos Legales pueden ser necesarios durante la incorporación de colateral cuando se trata con activos en los que pesa algún derecho legal.  Estos equipos crean el producto de trabajo legal para la incorporación de colateral.   MIP7c2: La Lista de Roles de Dominio Actuales Esta lista puede enmendarse mediante la incorporación (MIP7c3) y la remoción de componentes (MIP7c4) de MIP7. Las entradas en esta lista deberían seguir el siguiente modelo: - Nombre del Equipo: El nombre del equipo de dominio incorporado. - Número de Subpropuesta (MIP7c3-SP): # - Dominio: El dominio en que el equipo opera. - Fecha de Adición: <fecha en formato (aaaa-mm-dd)>   Lista de Equipos de Dominio Activos 1. Equipos de Dominio de Oráculo:   Nombre del Equipo: Equipo Verde   Número de Subpropuesta (MIP7c3-SP): n/a (El Equipo de Oráculo fue ratificado antes del proceso de MIPs. Referencia: Mandate: Oracle Teams 1)  Dominio: Oráculo  Fecha de Adición: 2019-10-7 Poll: Ratify the Interim Oracle Team Mandate     2. Equipos de Dominio de Contratos Inteligentes: 3. Equipos de Dominio de Riesgo: 4. Equipos de Dominio Legal:  MIP7c3: Incorporación de Equipos de Dominio   Resultado: El equipo de dominio está incorporándose exitosamente o es rechazado. Si es incorporado, el equipo de dominio es añadido a la lista de Roles de Equipos de Dominio definida en MIP7c2 por un Editor de MIP.  Período de Feedback: 3 meses  Período de Congelamiento: 1 mes Modelo de Incorporación:  Introducción   - Dominio: <Ej.: Riesgo> - Nombre del Equipo de Dominio: <Ej.: Equipo de Riesgo A> - Autor: <Persona que crea esta propuesta> - Fecha de Solicitud: <fecha en que se creó, en formato (aaaa-mm-dd)>  Solicitud  -   Introducción del Equipo de Dominio  \t-   Breve introducción / promoción del equipo, por qué quieren trabajar.       -   Motivación  \t-   Por qué el equipo quiere unirse a determinado dominio.       -   Credenciales de Trabajo  \t-   Nombres completos de los miembros \t-   Experiencia laboral previa de los miembros      -   Información relevante      \t- Cuentas de Github \t- Cuentas del foro \t- Otras    MIP7c4: Remoción de Equipos de Dominio   Resultado: El equipo de dominio es removido y se lo elimina de la lista de Roles de Equipo de Dominio definida en MIP7c2 por el Editor de MIP.  Período de Feedback: 0 días  Período de Congelamiento: 0 días Modelo de remoción:  Introducción          - Nombre del Dominio de Equipo     - Fecha de la Remoción Propuesta: <fecha en que se creó, en formato (aaaa-mm-dd)>      Especificación              - Motivo de la Remoción:         - Una explicación de los motivos de la remoción del equipo de dominio.           - Información relevante:     \t-  Links a evidencia que revalide los motivos para la remoción del equipo de dominio.  Esto es una traducción libre del artículo original del inglés. Gracias a @blimpa y @Gala  por la traducción. ",
                    "links": [
                        "https://vote.makerdao.com/polling-proposal/qmas1bqrquo2h41qv4fa8hpek9ukb7dlwtpkpn62r5hhmq",
                        "https://forum.makerdao.com/t/mip7-onboarding-and-offboarding-domain-teams-for-collateral-onboarding/1909"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.399553571428571
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip9-en-espanol/4773",
            "title": "MIP9 en espa\\xc3\\xb1ol ",
            "index": 4773,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#1",
                    "likes": "3",
                    "time": "16/10/2020-16:53:31",
                    "content": "MIP9: Visto Bueno Comunitario Preámbulo MIP#: 9 Title: Community Greenlight Author(s): Rune Christensen (@Rune23), Charles St.Louis (@CPSTL) Contributors: @LongForWisdom, Leo Jsaraceno (@Mitote), Helge Andreas Qvam (@planet_X) Type: Process Status: Request for Comments (RFC) Date Proposed: 2020-04-06 Dependencies: MIP6, MIP8 Replaces: n/a   Sumario Abreviado La MIP9 define el proceso mediante el cual los Poseedores de Tokens MKR pueden dar a conocer su opinión con respecto al valor de un tipo de colateral potencial antes de que los equipos de dominio inviertan tiempo en investigar su inclusión en el Protocolo Maker. Sumario Extendido Esta propuesta busca estandarizar el proceso que permite a los Poseedores de Tokens MKR informarles a los equipos de dominio sus preferencias en relación a tipos de colateral que han sido propuestos a través de la MIP6. Las preferencias de los Poseedores de Tokens MKR se expresan en forma de una encuesta de Gobernanza on-chain. La encuesta de Gobernanza (encuesta de visto bueno) se lleva a cabo al final del ciclo de Gobernanza y durante un período de dos semanas. Sumario de Componentes MIP9c1: El Proceso del Visto Bueno Comunitario y sus Requerimientos Define el proceso, los requerimientos y posibles resultados del proceso de Visto Bueno Comunitario y las responsabilidades de los Facilitadores de Gobernanza en su operación. MIP9c2: Modelo de Encuesta de Gobernanza Define un modelo de encuesta de Gobernanza a usarse en la encuesta de Visto Bueno Comunitaria on-chain. Motivación Aunque los equipos de dominio tienen la libertad de elegir su propia carga de trabajo, una encuesta de Gobernanza on-chain les revela a los equipos de dominio perspectivas clave sobre cómo se siente la comunidad con respecto a cada tipo de colateral propuesto. Además, es importante hacer acopio de las opiniones de los Tenedores de Tokens MKR en relación al activo de colateral propuesto antes de que el trabajo de dominio comience plenamente. Esto evita que se trabaje inútilmente en tipos de colateral indeseables. Especificación / Detalles de la Propuesta En esta etapa, el Facilitador de Gobernanza creará una encuesta de Gobernanza on-chain en el modelo de formato definido en MIP9c2 y la comunidad votará con sus preferencias. MIP9c1: El Proceso del Visto Bueno Comunitario y sus Requerimientos  El proceso comienza cuando una parte interesada (quien propone el tipo de colateral) informa a uno o más Facilitadores de Gobernanza que el proceso de solicitud de colateral ha alcanzado la fase de Visto Bueno Comunitario.  El formulario de colateral (MIP6) ha sido presentado en el foro y/o ha recibido una aprobación de Visto Bueno de Dominio (MIP8) de cada uno de los equipos de dominio (contratos inteligentes, riesgo y oráculos).   A partir de ese momento, los Facilitadores de Gobernanza tienen la responsabilidad de crear una Encuesta de Visto Bueno Comunitario para el tipo de colateral en cuestión.  Ten en cuenta que se crea una encuesta de aprobación individual para cada activo colateral. Esta encuesta hará uso del formato definido en MIP9c2 (Modelo de Encuesta de Gobernanza) usando ETH como un ejemplo de tipo de colateral. Las encuestas de visto bueno transitan un período fijo dentro de cada ciclo de Gobernanza, desde el 4º lunes del mes al 4º viernes del mes.   Los Facilitadores de Gobernanza tienen la responsabilidad de mantener una lista de colaterales basada en el resultado de las Encuestas de Visto Bueno Comunitarias individuales. Esta lista debería incluir tanto tipos de colateral que han superado sus Encuestas de Visto Bueno Comunitario como tipos de colateral que no lo han logrado. Los activos colaterales en las escuestas serán agregados a una lista y ordenados según su puntaje. Como se indicó más arriba (3), esta lista incluye tanto los tipos de colaterales que han superado sus Encuestas de Visto Bueno Comunitario como aquellos que no han logrado superarla. Es importante incluir activos que no lo han logrado (puntaje negativo) para que aún puedan tenerse en cuenta, según la decisión de los equipos de dominio, porque son posibles situaciones donde los competidores traten de usar MKR para suprimir los activos de los demás para así obtener una ventaja competitiva y en consecuencia poner a los demás en desventaja injustamente al negarles la financiación de Maker. Todo activo colateral que haya superado MIP8 y cuyas aprobaciones de visto bueno de MIP8 no hayan sido —ninguna de ellas— revocadas nuevamente, incluyendo los activos que ya han tenido anteriormente una encuesta de visto bueno, será incluido en la encuesta de visto bueno comunitaria de MIP9, salvo cuando por razones técnicas no haya capacidad suficiente para contener todos los votos, en cuyo caso los Facilitadores de Gobernanza deciden cuáles son los activos a incluir más importantes, priorizando aquellos que no hayan tenido un voto anteriormente.  Nota Importante: MIP9 puede ocurrir en paralelo con MIP8 (Visto Bueno de Dominio). Resultados Clave de la Encuesta de Gobernanza  Una vez la Encuesta de Visto Bueno Comunitaria está completa, los equipos de dominio proceden a realizar sus trabajos respectivos según los definen sus mandatos.   Ejemplo: El equipo de contratos intelige ntes construirá el adaptador de colateral y el equipo de riesgo preparará su construcción de riesgo para el tipo de colateral especificado.   Si la Encuesta de Visto Bueno Comunitario resulta en aprobación y el Visto Bueno de Dominio (MIP8) no es aprobado en uno o más dominios, la comunidad debe encontrar un sustituto para los equipos de dominio rechazantes antes de que este proceso pueda tener lugar. Si la Encuesta de Visto Bueno Comunitario no es superada, los equipos de dominio tienen la potestad de trabajar igualmente en el colateral si confían en que la Gobernanza lo aprobará más adelante.  Diagrama General del Proceso Global mip91372×876 53.5 KB   MIP9c2: Modelo de Encuesta de Gobernanza Modelo de Encuesta de Gobernanza: Título de la Encuesta: ¿Deberíamos añadir ETH (Ether) al Protocolo Maker? Descripción: Si el resultado es positivo, esta encuesta debe ser tomada por los equipos de dominio como una indicación de que los Poseedores de Tokens MKR han aprobado que se realice más trabajo de dominio con el objetivo de añadir ETH (Ether) como un activo colateral al Protocolo Maker. Pueden encontrarse antecedentes y discusiones en el hilo del foro que sigue: Opciones de la Encuesta:  [ ]  Sí [ ]  No  Duración de la Encuesta: Esta encuesta permanecerá activa durante dos semanas. Esto es una traducción libre del artículo original del inglés. Gracias a @blimpa y @Gala  por la traducción. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip9-community-greenlight/1911"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.767857142857143
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip3-en-espanol/4605",
            "title": "MIP3 - en espa\\xc3\\xb1ol ",
            "index": 4605,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "4",
                    "time": "06/10/2020-22:49:58",
                    "content": "MIP3 https://github.com/makerdao/mips/blob/master/MIP3/mip3.md MIP3: Ciclo de Gobernanza Preámbulo MIP#: 3 Title: Governance Cycle Author(s): Rune Christensen (@Rune23), Charles St.Louis (@CPSTL) Contributors: @LongForWisdom Type: Process Status: Accepted Date Proposed: 2020-04-06 Date Ratified: 2020-05-02 Dependencies: n/a Replaces: n/a   Referencias MIP3c2-Subproposal-Template.md Sumario abreviado La MIP3 define un Ciclo de Gobernanza mensual con el ojetivo de proveer un marco de trabajo previsible para las decisiones de Gobernanza de Maker. Sumario extendido Esta propuesta presenta formalmente el Ciclo de Gobernanza. El Ciclo de Gobernanza provee un marco de trabajo previsible para las decisiones de Gobernanza de Maker. También les proporciona a los participantes (poseedores de MKR) una visión de conjunto global sobre las decisiones que están tomándose y facilita así la participación incluso en los casos en que se cuenta con poco tiempo. Sumario de Componentes MIP3c1: Definiciones del Ciclo de Gobernanza Define términos clave en relación al Ciclo de Gobernanza. MIP3c2: Análisis del Ciclo de Gobernanza Descompone el Ciclo de Gobernanza en las acciones tomadas cada semana del ciclo mensual. MIP3c3: Subpropuestas de Modificación del Umbral de Inclusión por Defecto: Un componente de proceso que define un método y un modelo para la modificación del umbral de inclusión por defecto. Motivación El objetivo del Ciclo de Gobernanza estandarizado mensualmente es proveer notificacions por adelantado y alta previsibilidad en relación a las actividades de Gobernanza con el fin de mantener a los poseedores de MKR informados acerca de los temas relevantes y de permitirles la participación en las votaciones incluso si cuentan con poco tiempo. La estructura del Ciclo de Gobernanza habilita a los participantes activos de la Gobernanza a unirse a las discusiones que se dan al nivel de presentación de propuestas desde el comienzo del mes, mientras que los participantes menos activos pueden dedicarse simplemente a revisar los resultados finales a fin de mes y a decidir si votar o no a favor del Voto Ejecutivo final. Especificación / Detalles de la Propuesta MIP3c1: Definiciones del Ciclo de Gobernanza  El Umbral de Inclusión por Defecto es un monto variable que puede modificarse a través de subpropuestas de la MIP3c3. El valor del umbral de inclusión por defecto le es automáticamente computado al conteo sin votos de cada ítem en la encuesta de inclusión. El umbral de inclusión por defecto está establecido en 3000 MKR, pero puede ser modificado mediante subpropuestas de la MIP3c2.  Encuesta de Inclusión: Cuando los usuarios de Gobernanza deciden qué quieren incluir dentro del paquete presentado en la Encuesta de Gobernanza. La encuesta de inclusión también sirve como el umbral a partir del cual se requiere la atención de una encuesta de Gobernanza. Un aspecto importante de la Encuesta de Gobernanza es que les permite a los poseedores MKR tener un impacto temprano e importante en el Ciclo de Gobernanza  Encuesta de Gobernanza: Una Encuesta de Gobernanza es una encuesta de MKR binaria de sí/no que refrenda o rechaza la combinación de todas las MIPs que superaron la fase de la encuesta de inclusión, incluyendo la aceptación de cualquier código de Voto Ejecutivo de componentes de MIPs Técnicas o subpropuestas.  Voto Ejecutivo: El voto final es la instancia última que determina si las propuestas son aceptadas o rechazadas.   MIP3c2: Análisis del Ciclo de Gobernanza Cada Ciclo de Gobernanza mensual comienza el primer lunes del mes con la presentación de MIPs por parte de miembros de la comunidad (según se define en el Marco de Trabajo de MIP0). La inclusión de estas propuestas será considerada al final del Voto Ejecutivo del mes. El Ciclo de Gobernanza finaliza con un Voto Ejecutivo que comienza el cuarto lunes de cada mes. Las propuestas presentadas deben seguir los lineamientos definidos en MIP0. Descomposición Semanal del Ciclo de Gobernanza Mensual Las fechas son inclusivas y están basadas en UTC (Tiempo Universal Coordinado) y en el calendario gregoriano Semana 1, lunes  La Presentación Formal (Fase 5 descripta en MIP0c3) por parte de autores de MIPs de propuestas a incluir en el nuevo ciclo de Gobernanza. Esta fase dura tres días. La presentación formal de MIPs se hace en la categoría de presentación formal del foro de MakerDAO bajo la subcategoría Maker Improvement Proposal (según se define en la Fase 5 en MIP0c3).  Semana 1, jueves  Los Facilitadores de Gobernanza llevan a cabo la Revisión de Presentaciones como parte de la Reunión de Gobernanza y determinan cuáles de las MIPs propuestas siguen adecuadamente los lineamientos (definidos en el Marco de Trabajo de MIP0) y deberían ser incluidos en la encuesta de inclusión.  Semana 2, lunes  Los Facilitadores de Gobernanza publican el conjunto de Encuestas de Inclusión, una por propuesta. Cada encuesta ofrece dos opciones:   Sí o No. Donde los votos por no simplemente hacen crecer la barrera que la propuesta debe sortear antes de ser aprobada.   Si los votos por Sí de una opción dada en la encuesta de inclusión suman más que la combinación de los votos por No y el umbral de inclusión por defecto al finalizar la encuesta de inclusión, la propuesta será incluida en la Encuesta de Gobernanza.  El umbral de inclusión por defecto está establecido en 3000 MKR. Si los votos: sí > (no + umbral de inclusión por defecto) = inclusión en la Encuesta de Gobernanza.    Semana 2, jueves  Los Facilitadores de Gobernanza llevan a cabo la Revisión de Inclusiones como parte de la Reunión de Gobernanza en que confirman las inclusiones en la Encuesta de Gobernanza.  Semana 3, lunes  La Encuesta de Gobernanza es presentada por los Facilitadores de Gobernanza. Esta encuesta estará activa tres días…  Semana 3, jueves  Los Facilitadores de Gobernanza llevan a cabo la Reseña de la Encuesta de Gobernanza como parte de la Reunión de Gobernanza en que confirman el resultado de la Encuesta de Gobernanza. Los Facilitadores de Gobernanza deben alcanzar un consenso sobre si los resultados arrojados por la Encuesta de Gobernanza justifican avanzar a la instancia del Voto Ejecutivo.  La idea de esta responsabilidad es que se aplique en los casos en que los Facilitadores de Gobernanza crean que avanzar a la instancia del Voto Ejecutivo afectaría negativamente la cohesión comunitaria. Si los Facilitadores de Gobernanza se oponen al resultado de la Encuesta de Gobernanza, deben comunicar claramente cuáles son sus razones para desestimar el resultado de la encuesta. Si los Facilitadores de Gobernanza abusan de su poder, debe removérselos mediante una subpropuesta MIP0c13.    Semana 4, lunes  Se presenta el Voto Ejecutivo si los Facilitadores de Gobernanza confirman el resultado de Sí de la Encuesta de Gobernanza. El Voto Ejecutivo debe tener una caducidad de cuatro días pasados los cuales no tendrá efecto. Las MIPs y las subpropuestas solo avanzan al estado de Aceptadas si el Voto Ejecutivo en que están incluidas es aprobado dentro del límite de cuatro días. Si el Voto Ejecutivo no logra ser aprobado dentro del límite de cuatro días, a las MIPs y las subpropuestas se les asigna el estado de Rechazadas.  Semana 4, jueves  Los Facilitadores de Gobernanza llevan a cabo la Revisión del Ciclo de Gobernanza como parte de la Reunión de Gobernanza en que discuten y resumen lo acaecido en el Ciclo de Gobernanza con la comunidad. Los Facilitadores de Gobernanza también discuten con la comunidad el Ciclo de Gobernanza entrante y potenciales presentaciones.  Visión de Conjunto del Ciclo de Gobernanza https://user-images.githubusercontent.com/32653033/80249627-2f6e2d00-8640-11ea-8b56-6163276ded4c.png826×208 16.8 KB Visión de Conjunto del Ciclo de Vida de una MIP  https://user-images.githubusercontent.com/32653033/79087211-8e60a780-7d0c-11ea-833a-70d12cad56aa.png1014×314 38.3 KB  MIP3c3: Subpropuestas de Modificación del Umbral de Inclusión por Defecto La MIP3c2 es un componente de MIP de Proceso que permite la modificación del Umbral de Inclusión por Defecto para las encuestas de inclusión. Esto se logra a través de una subpropuesta. Las subpropuestas son presentadas al Ciclo de Gobernanza como cualquier otra propuesta y, si se las ratifica, su umbral de inclusión por defecto modificado entra en vigencia a partir del Ciclo de Gobernanza que sigue a la aprobación del Voto Ejecutivo de su Ciclo de Gobernanza. Las subpropuestas MIP3c2 tienen los siguientes parámetros:   Período de Feedback por Defecto: 3 meses  Período de Congelamiento: 1 mes  Las subpropuestas MIP3c2 deben usar el modelo localizado en MIP3c2-Subproposal-Template.md. Este modelo se considerará ratificado una vez esta MIP obtenga el estado de Aceptada. Esto es una traducción libre del artículo original en inglés. ¡Gracias a @Gala y @blimpa por la traducción! ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP3/MIP3c2-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/master/MIP3/MIP3c2-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/master/MIP0/mip0.md#mip0c3-the-mip-lifecycle",
                        "https://github.com/makerdao/mips/blob/master/MIP0/mip0.md#mip0c3-the-mip-lifecycle",
                        "https://github.com/makerdao/mips/blob/templates/MIP0/MIP0c13-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/master/MIP3/MIP3c2-Subproposal-Template.md",
                        "https://github.com/makerdao/mips/blob/master/MIP3/mip3.md",
                        "https://forum.makerdao.com/t/mip16-el-ciclo-de-gobernanza-semanal/4939"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.91796875
                }
            ]
        }
    ],
    "group_index": "2781"
}