{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-expenses-dashboard-is-live/17591",
            "title": "MakerDAO Expenses Dashboard is live! ",
            "index": 17591,
            "category": [
                "Core Units",
                "Sustainable Ecosystem Scaling"
            ],
            "tags": [
                "summary",
                "budget",
                "ses-001",
                "cu-update",
                "dashboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Lenkla",
                    "index": "#1",
                    "likes": "33",
                    "time": "01/09/2022-16:39:39",
                    "content": " Leveling up transparency and reducing information costs across the DAO    TL;DR  The SES Core Unit is excited to share with you the first release of the MakerDAO Ecosystem Performance Dashboard. This soft release, nicknamed Maker Expenses, is now available at https://expenses.makerdao.network/. This first release…   Provides a clear overview of all the MakerDAO Core Units, their mandate, related MIPs, and practical info such as their social media profiles.   Enables all Core Unit Administrators to easily submit their monthly budget reports in a standardized format; these reports include Core Unit expenses and a rolling forecast for the next 3 months.   Allows Core Units and their auditors to easily access and review all monthly budget reports in one place.   SES will now work to onboard more Core Units until all are familiar with the process and make their budget data available on a monthly basis. > Read more about how to submit expenses for your Core Unit.  Future releases will build on this first version to present high-level financial summaries to key stakeholders such as MKR holders and delegates. We believe that easy access to this data is critical to better inform decision-making in the DAO. > Explore an early prototype of the data views enabled by the Core Units’ budget reports. (Note that the data is still incomplete.) Read on to learn more about:  The key problems this release addresses; Onboarding more Core Units; A closer look at the Dashboard’s features; Next steps.    Introduction The Sustainable Ecosystem Scaling (SES) Core Unit’s mission is to sustainably grow the Maker Protocol’s moats by removing barriers between decentralized workforce, capital, and work. The Ecosystem Performance Dashboard & API objective follows this mission.  Screenshot 2022-06-09 at 17.00.471062×546 106 KB  The release we are announcing today is made possible by 3 core components: the Dashboard UI, the Budget Reporting Tool for Core Units, and the Ecosystem Performance API that provides access to the data.  The Dashboard UI  The first version of the Dashboard enables Core Units and their auditors to consult all submitted budget reports in one place and verify the correctness of the data. It is the primary focus of this update. The new release lays the foundation for more advanced analytics and summaries in the future. These will provide all stakeholders with easy access to the information they need to make informed decisions.  First version of the Dashboard1920×1080 85 KB   The Budget Reporting Tool for Core Units  This reporting tool allows Core Units to push their data securely and conveniently to the API. The Budget Reporting Tool for Core Units launched in June, with the first early testers being DUX, GovComms, TechOps, Dai Foundation, Immunefi, and Events Core Units. We expect to onboard the remaining CUs in the coming weeks.  Budget tool reporting for Core Units1920×1080 87.8 KB   The Ecosystem Performance API  This is the underlying component that makes all data available for consumption by the Dashboard and potential other ecosystem participants. We first introduced The Ecosystem Performance API in March. The API helps facilitate better automation of data collection and permissionless accessibility. As such, it broadens the impact by enabling additional 3rd party UIs, independent data analysis, and wider community adoption. > Explore the API here.    Why is the dashboard needed? With this first release of the dashboard, we lay the foundation for solving some of MakerDAO’s most pressing problems.  Solving user problems1920×1080 88.2 KB  Top problems that the Dashboard will mitigate Providing structured insights into Core Units’ progress and financial wellbeing, reducing search costs & reporting efforts are just some of the core user problems we identified through our research.  Meme transparency reporting DAO1600×900 162 KB  Financial transparency reporting has recently been among the key discussion topics in the DAO  How MakerDAO Expenses expedite DAO transparency From the DAO stakeholder perspective, one of the top needs is to understand and review Core Unit finances easily. The Dashboard solves the challenge of information search costs by offering digestible insights about every Core Unit’s finances. This is the first step towards enabling better decision-making and advancing the DAO’s transparency. From the Core Units’ perspective, the Budget Tool enables systematic and effortless communications of their Core Unit’s financial information and presents it concisely in the Ecosystem Performance Dashboard. This allows them to become an early promoter of DAO transparency best practices. The Expenses Dashboard allows Core Units to show their financial health and set the record straight with easily digestible data - also putting an end to any inadequately founded budget conversations. We believe that enabling them to convey the information about their own CUs’ finances and capital flows, instead of spending resources on communicating this across the DAO through various platforms, frees more time for important mandate-related work. We believe that bootstrapping the dashboard with the data from a handful of early users delivers value to the DAO in the shortest possible time–it ensures basic CU information availability and supports financial reporting of CUs.   What’s in the first release? MakerDAO Expenses Dashboard consists of information at 3 levels:   Homepage aka Core Unit index table: Easily find and compare all Core Units  The first dashboard view lets you browse the high-level overview of all active Core Units at MakerDAO. In this overview, you can glimpse some quick insights into MakerDAO’s Core Units:  Core Unit names, shortcodes, and icons; Date the CU was voted in by governance; Actual expenditure with a budget cap overview for the latest 3 months of data provided; Team information like full-time equivalent and facilitator(s); Links to platforms where this Core Unit is active.      Preview of the Core Unit Table search function   Core Unit Landing page: Discover the most important aspects of individual Core Units  When clicking on a specific Core Unit, you will arrive at their landing page. This page’s purpose is to give you a good picture of what the Core Unit is about and how it delivers value to the DAO. It also helps Core Units to convey the most important info in a standardized format.     Preview of DUX’s Core Unit Landing page While the page header gives you an instant overview, the “What we do” section goes further into the CU’s vision, mission and strategy. Understanding the size of the workforce and who the main contact is was frequently requested by the community. We’ve included this team size and contact information as well. We have also provided information on how the Core Unit was established through the decentralized governance process by linking all active and related CU MIPs.   Core Unit Expenses page: Understand CU costs and how these costs change over time  You can navigate here from the Core Unit’s landing page via the “Expenses” card featured on the right side. You will be greeted by the latest reported Actual Expenditure for the Core Unit. Supported views are monthly totals and breakdowns per CU wallet. In the Forecast tab, you will find the forecasted expenses for the upcoming periods side by side with the monthly budget and quarterly budget cap. When applicable, the MKR Vesting tab will give you insights into the team’s vesting situation.     Preview of DAIF’s Core Unit Expenses page  Other noteworthy dashboard aspects:    Responsiveness: We’ve built the dashboard with flexibility in mind and optimized the frontend designs for the majority of desktop and mobile screens.    Mobile UX: The ability to access the website with a single click, directly from mobile is appreciated by many on the go.    Mobile UX1920×1080 113 KB  Just add our Dashboard to the home screen of your mobile device, and you don’t have to remember the URL, ever again.    Dark mode: We know that this feature is highly popular and especially desired by those spending a lot of their time on screen. We feel you.    Can you think of other data insights you would like to see? No problem. The advantage of the API first approach is that the insights do not have to be limited to the views the dashboard frontend offers. Alternatively, you can create your own views based on the API data that suits your needs. The API is intended as an open tool for the creation of other insights and UIs.  Tableau additional insights from API1920×1080 104 KB  Here is an inspiration of the possible use cases for the June’22 data that our API has to offer. Explore the full Tableau workbook created by Jack here.   Next steps The analytics and reporting service for Core Units is just an entry point to the fully-fledged dashboard we will be rolling out over future iterations. In the immediate future, we will focus on:  Onboarding the rest of the Core Units; Ensuring that the data is complete, correct, and up to date; Incremental UX and other improvements based on user feedback.  Further down the road, we will be targeting a broader user base, adding more features, and advancing the Dashboard as the primary collaboration tool for DAO stakeholders.   About the team While working on this objective since the beginning of the year, our team has been specializing in specific roles around this product. Depending on your need, feel free to contact us:  General questions - @Lenkla  Budget statement help - @Dracaena27  Technical issues - @liberuum  Data issues - @teep  User feedback - @Haiku   We engaged DSpot, front-end development specialists with extensive knowledge of MakerDAO through working on other projects such as the MIPs portal,  PSM UI, and currently the Status UI (WIP). We want to thank them for the fruitful collaboration.   Call to Action for Core Units Currently, we are still collecting all the relevant information. We expect more Core Units to adopt the tools we have created:   Is your Core Unit not using the Budget tool yet? Here is how to get started.   See anything on the Dashboard that is incomplete or missing? Don’t hesitate to contact us: Join SES discord #dashboard-reporting channel or let us know here.    We invite you all to explore the Dashboard and look forward to hearing your feedback. Also, don’t miss the upcoming SES status update call this Friday, Sep 2nd at 2:30pm UTC, where we will demo the Dashboard and discuss it with the MakerDAO community! Best, your SES Dashboard team @Haiku @teep @liberuum @wouter @Dracaena27 and @Lenkla ",
                    "links": [
                        "https://www.notion.so/makerdao-ses/Budget-Reporting-Guidelines-for-Core-Unit-Administrators-a8d59cc9a5aa4d73a4f677ddcef7d4a7",
                        "https://public.tableau.com/app/profile/jack.evans2917/viz/DAOBudgetAnalysis/June22Story?publish=yes",
                        "http://ses.makerdao.network/",
                        "https://forum.makerdao.com/t/introducing-a-budget-reporting-tool-for-core-units/15710",
                        "https://forum.makerdao.com/t/introducing-the-ecosystem-performance-api-and-dashboard-objective/13899",
                        "https://studio.apollographql.com/public/ecosystem-dashboard/home?variant=current",
                        "https://expenses.makerdao.network/",
                        "https://i.imgur.com/Y3DYF08.gif",
                        "https://i.imgur.com/BMKYpmM.gif",
                        "https://i.imgur.com/0gSRIiq.gif",
                        "https://public.tableau.com/app/profile/jack.evans2917/viz/DAOBudgetAnalysis/June22Story?publish=yes",
                        "https://dspot.com.pl/",
                        "https://mips.makerdao.com/mips/list",
                        "https://ipfs.io/ipfs/QmdFEcowhVbEabe68LMH8UuXweU8jnmQ7J28uUhFeeaY9X/",
                        "https://www.notion.so/makerdao-ses/Budget-Reporting-Guidelines-for-Core-Unit-Administrators-a8d59cc9a5aa4d73a4f677ddcef7d4a7",
                        "https://discord.com/channels/815917281728659516/992417719028830349",
                        "https://makerdao.typeform.com/dashboardissues",
                        "https://expenses.makerdao.network/",
                        "https://www.crowdcast.io/c/ses-biweekly-status-update-11",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-13/17677",
                        "https://forum.makerdao.com/t/expenses-dashboard-monthly-update-september-2022/18210",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-august-2022/16955",
                        "https://forum.makerdao.com/t/daif-cu-update-q3-2022/18211",
                        "https://forum.makerdao.com/t/actualizacion-mensual-de-gastos-del-panel-de-control-octubre-2022-traduccion/18680",
                        "https://forum.makerdao.com/t/mip40c3-sp87-modify-the-sustainable-ecosystem-scaling-core-unit-budget-ses-001/18339",
                        "https://forum.makerdao.com/t/expenses-dashboard-monthly-update-october-2022/18674",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-13-traduccion/17681",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/15"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.900705968414302
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/09/2022-16:56:04",
                    "content": "This is great! Well done. I can see the effort and time put in here. PS, this post congratulating the team was flagged as spam. I think things are absolutely out of control and someone needs to take care of this. People are either trying to play games and/or censor feedback. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#3",
                    "likes": "4",
                    "time": "01/09/2022-17:56:05",
                    "content": "Thanks, @Lenkla , in the name of the DSpot team, I would like to thank the SES Dashboard team for all the support, essential to bringing this Dashboard to life. We are looking forward to all the new things we’ll be working on together to continue bringing value to MakerDAO and its community! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.617424242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SelenaPotterIsASybil",
                    "index": "#4",
                    "likes": "2",
                    "time": "01/09/2022-19:02:42",
                    "content": "Looks great (except for the missing data) but how much did developing this dashboard cost (hours, DAI, w/e) and what’s the ongoing maintenance cost? It seems like Maker could just use a spreadsheet or some DAO tooling software instead of custom dev work which is way more expensive in the long run… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lenkla",
                    "index": "#6",
                    "likes": "1",
                    "time": "01/09/2022-20:34:10",
                    "content": "Thanks, Paper. FTEs are actual and numbers are sourced directly from the facilitators. Right now they are added manually but the future outlook is that this will be possible to push by the CU Admins. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.488095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#8",
                    "likes": "1",
                    "time": "01/09/2022-20:38:50",
                    "content": "Congrats on an awesome build! The functionality and transparency is key. Am I right in my understanding that it requires full-reporting of expenses to be reach its best functionality? What happens if CUs fail to report and the tool is missing data? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#9",
                    "likes": "4",
                    "time": "01/09/2022-23:41:02",
                    "content": "It is better to be safe to regret, I say this because using 2.0 tools such as excel or some software where the created documents are stored in a centralized for Microsoft or Amazon server is extremely vulnerable to exploits, despite the cost it takes to make the api, it is much better to create it from scratch, the idea is that Maker is entirely made by the community and this is a living example of it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#10",
                    "likes": "1",
                    "time": "02/09/2022-00:13:49",
                    "content": "This is an amazing resource! Great job. The CU profiles and descriptions are really useful to help understand what each of the team are doing.  The added tranparency of viewing the full expenses and performance against their budgets is phenomenal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.7
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lenkla",
                    "index": "#11",
                    "likes": "3",
                    "time": "02/09/2022-10:28:38",
                    "content": "Thank you for this feedback. We are excited to share with you the first results of our work, albeit limited and far from the fully-fledged product we are working towards  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.816964285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lenkla",
                    "index": "#12",
                    "likes": "2",
                    "time": "02/09/2022-10:36:23",
                    "content": "Thank you  Our intention was to provide a standardized way to explain what CUs are about. We know that this information exists elsewhere in further detail, the purpose of the CU page is to give the visitor a quick insight with an option to read further in referenced channels that the given CU uses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yano",
                    "index": "#13",
                    "likes": "3",
                    "time": "02/09/2022-12:22:28",
                    "content": "This is really nicely done, great work. Excited to see more core units onboard onto the tool. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#14",
                    "likes": "4",
                    "time": "02/09/2022-13:01:49",
                    "content": "This is amazing! Maker now has by far the most transparency of any protocol in DeFi, this epitomises to me about why Maker will survive. The complaints by some who said the CU expenses were opaque have now been answered in the best possible way  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.35
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#15",
                    "likes": "6",
                    "time": "02/09/2022-14:11:14",
                    "content": "For anyone interested in our presentation of the dashboard:  Starting in 20 minutes  SES Status Update First Release of the MakerDAO Expenses Dashboard Topics  Why is the MakerDAO Expenses Dashboard needed? What is in the first release? – with demo! High-level data insights prototype Future roadmap Onboarding core units     crowdcast    SES Biweekly Status Update Register now for SES Biweekly Status Update on crowdcast, scheduled to go live on September 2, 2022, 04:30 PM GMT+2.      ",
                    "links": [
                        "https://www.crowdcast.io/c/ses-biweekly-status-update-11"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.790719696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#16",
                    "likes": "2",
                    "time": "02/09/2022-14:43:50",
                    "content": "It is indeed quite nice. How often do you plan to update it? I see RWF with several FTE @Lenkla ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Haiku",
                    "index": "#17",
                    "likes": "2",
                    "time": "02/09/2022-15:20:50",
                    "content": "Hey @fig thanks for the kind feedback. As for your question about full reporting being a requirement for best functionality, this is certainly true. The dashboard and API become more and more useful to the community as Core Units push budget data consistently to the API. With that said, the process of pushing budget data to the API is fully opt in for Core Units. So, how are we making this more seamless for Core Units? As a first step, we offer personalized onboarding sessions for Core Units to get set up with pushing their budget information, after initial set up, pushing budget info can be done with a few clicks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.678571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#18",
                    "likes": "8",
                    "time": "02/09/2022-18:43:13",
                    "content": "ICYMI: First Release of the MakerDAO Expenses Dashboard | SES Status Update - YouTube     Slides from today’s presentation can be found here. ",
                    "links": [
                        "https://www.youtube.com/watch?v=4GSk18arAPo",
                        "https://drive.google.com/file/d/1X8sc-kzVYoC_C_znBT8N13X_cnPtiftt/view?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GWintery",
                    "index": "#19",
                    "likes": "2",
                    "time": "03/09/2022-02:08:41",
                    "content": "Looks great! As with all reports and dashboards, getting and preparing the data would probably the most time consuming part after for the contributors. Definitely should focus on standardizing the reporting methods and automating most of the work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lenkla",
                    "index": "#20",
                    "likes": "0",
                    "time": "05/09/2022-08:38:52",
                    "content": "Thanks for your feedback, Doo! Indeed this question is quite popular among the community and it’s a really good input to guide our future releases. As mentioned, the data in the dashboard is not fully complete with and might require corrections. For the FTEs, which we felt was an important number to include, we went with the latest available data (and if missing, we sourced them directly from the facilitators). Plus we are focusing on onboarding remaining CUs so that they have the opportunity to provide the latest data. That being said, we understand the utility of tracking changes in the reported data and are looking into including this in the near future  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.326923076923077
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blockchainnerd",
                    "index": "#21",
                    "likes": "2",
                    "time": "05/09/2022-08:47:25",
                    "content": "This is gonna be super helpful for the ecosystem. I agree with @Doo_StableLab about how often it’s going to be updated & do you have plans to automate this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teep",
                    "index": "#23",
                    "likes": "5",
                    "time": "05/09/2022-11:17:18",
                    "content": "The data for each CU will be available as soon as the budget information has been pushed to the API using the budget tool by the CU administrator. Our hope is that this will become a streamlined month-end process similar to how Core Units currently upload their budget information to GitHub / send to SF for review with fewer steps involved (e.g. a few clicks through the budget tool). To specifically address the question of period updates - the budgetary information should therefore be updated monthly per Core Unit. Additional updates and features will be added on a rolling basis alongside our release schedule of the last day of each month ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SelenaPotterIsASybil",
                    "index": "#24",
                    "likes": "0",
                    "time": "05/09/2022-17:57:49",
                    "content": "If the CUs are already reporting via GitHub and the SF team, why don’t you source the data from GitHub instead of requiring the CU facilitator to report again each month with a custom node.js app? Or at least fill in missing data given the majority of core units don’t have data in the current dashboard. Again, this feels like a lot of money and effort was spent for little to no marginal improvement (especially given the incorrect / incomplete data referenced above). @Lenkla—what’s your estimate for total cost (development and ongoing)? It’s telling that the core unit that is promoting project based budgeting also refuses to estimate cost for a recent project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Porter_Smith",
                    "index": "#25",
                    "likes": "5",
                    "time": "06/09/2022-19:16:56",
                    "content": "This looks terrific, great work putting it together! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#26",
                    "likes": "8",
                    "time": "06/09/2022-22:06:17",
                    "content": " What is the development and maintenance cost?     SelenaPotterIsASybil:  Looks great (except for the missing data) but how much did developing this dashboard cost (hours, DAI, w/e) and what’s the ongoing maintenance cost?       SelenaPotterIsASybil:  @Lenkla—what’s your estimate for total cost (development and ongoing)?   It’s definitely true that software development is always a significant investment. Depending on how it’s calculated, the total cost of this project so far would range around $200k. This is from the initial needs analysis of the 3 components (budget tool, API and dashboard), until this release. It also contains a bit of work that is still in design phase and the initial setup of the development processes which always comes with some inefficiencies in the beginning. Running infrastructure costs so far are negligible (around $100/month). This may change if we want better availability guarantees, or if on-chain data were to enter the picture.  Why isn’t all the data available yet?     SelenaPotterIsASybil:  this feels like a lot of money and effort was spent for little to no marginal improvement (especially given the incorrect / incomplete data referenced above).   As the opening post mentions, this first release is a soft release that will allow us to start on-boarding the remaining core units. We have anticipated that the dashboard will only be as valuable as the quality of its data. That’s why we have focused on improving the monthly reporting cycle, making it easier for core units to report their expenses. We also offer support to help with the initial setup for those that aren’t familiar with the process yet. However, we also understand that it’s much more difficult to convince people to use a tool if there is no tangible output, which is why we have made the dashboard available first, and are now driving towards a complete data set that is checked for correctness.  Why don’t we “source the data from Github”?     SelenaPotterIsASybil:  If the CUs are already reporting via GitHub and the SF team, why don’t you source the data from GitHub instead of requiring the CU facilitator to report again each month with a custom node.js app? Or at least fill in missing data given the majority of core units don’t have data in the current dashboard.   This has been explained in our status update about the budget tool. The core units that report on Github, basically submit a summary of their detailed financing spreadsheet in MarkDown format, as SES has originally recommended to set the expectation about budget transparency from the very beginning. So far, this has been a manual and quite tedious process. The Strategic Finance CU too, is doing a lot of manual work on a monthly basis to collect all the monthly budget information.  Screenshot 2022-06-09 at 14.4 2.031312×741 126 KB  No double work is required with the tool. Existing and new budget information can now easily be submitted by the core units themselves, with the budget tool that reads it directly from their detailed financing spreadsheet, automatically summarizes the info, and makes it available in the API. For Strategic Finance to include in their reports, to be made available on the dashboard, and for anyone else who want to analyze it. This is without messing around with MarkDown tables, copy/paste mistakes, or SFCU having to beg for their reports every month. The existing Github reports are an excellent reference to verify the correctness of the back-filled data.  Can’t we just use a spreadsheet?     SelenaPotterIsASybil:  It seems like Maker could just use a spreadsheet or some DAO tooling software instead of custom dev work which is way more expensive in the long run…   We started out with spreadsheets, are still using them where it makes sense, and we have evaluated a number of DAO tools as part of the prelimenary research. The question whether it’s worth the cost to develop custom software is always a difficult one and it depends greatly on the ambition and strategy that we want to pursue. Our assumption is that MakerDAO still has the ambition to create an open, decentralized organization that actually works, whether it is with MetaDAOs or other mechanics. After witnessing months of painful governance drama, it has been our conclusion that “transparency with spreadsheets” has failed miserably at MakerDAO. Our research has shown that stakeholders are at a total loss where to find even the simplest relevant information, even though everything seems to be available “on the forum” somewhere. External observers find it impossible to understand what’s happening at MakerDAO and core units are experiencing a complete deadlock due to uncertainty, a total lack of direction, and enough governance noise to make it nearly impossible to focus on delivering actual work. It clearly showed that the organization has an urgent need for better reporting, better coordination mechanisms, and above all, better tooling to support all this. We have verified this extensively with various stakeholders. With the first release of this dashboard we’re making a potential start of what can be a decentralized operations platform for MakerDAO that actually works. So, yes, we have reason to believe that this is worth the effort.  Double standards?     SelenaPotterIsASybil:  It’s telling that the core unit that is promoting project based budgeting also refuses to estimate cost for a recent project.   How exactly is this “telling”? We are pushing for greater budget transparency, we are developing the software to make it happen. And indeed we are experiencing ourselves that it’s not easy to determine the costs of projects given the structure of our current MIP40 budgets. This is in no way inconsistent. It just proves our point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.440904581529582
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#27",
                    "likes": "3",
                    "time": "06/09/2022-22:38:09",
                    "content": "This is brilliant. Good job! It looks great, and i’m fully on board with this project. I think Maker needed something like this in order for stakeholders to be 100% aware of what’s going on behind the curtains. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.425000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#28",
                    "likes": "3",
                    "time": "06/09/2022-22:48:39",
                    "content": "Agree. Maker should look into improving, not play it “safe” (or cheap). Building this dashboard must surely have been costly, but making financial reports and budgets on vulnerable spreadsheets and third-party systems could turn out to be risky and even more expensive in case of malfunction or loss of information. Maker has to create its own systems. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#29",
                    "likes": "3",
                    "time": "06/09/2022-23:19:50",
                    "content": "Great retort. This project is well worth the effort and expenses. A majority of community seems to agree. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#30",
                    "likes": "0",
                    "time": "05/12/2022-23:20:37",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}