{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-170-thursday-december-02-17-00-utc/11899",
            "title": "Governance and Risk #170 - Thursday, December 02 17:00 UTC ",
            "index": 11899,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "4",
                    "time": "30/11/2021-19:33:22",
                    "content": " gr-meeting-red1920×442 27.9 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved, and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, financial or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment, financial or other advisory services.  Call Information The zoom waiting room will be on, and a password is set to: 748478, please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-12-02T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit : Hosting, Introduction, Agenda.  @gov-comms-core-unit : Slides   Governance Round-Up   @prose11 Poll + Executive Status  @blimpa - MIPs Update  @Artem_Gordon Forum at a Glance   Selected Discussions  Delegates Compensation program pilot, performance modifier for compensation signal request, role-of, and other related topics.   Collateral Offboarding How should we set up our communication/notification standards? Is lack of profitability enough of a reason to offboard–should we consider subsidizing for growth? How do we develop clear criteria for offboarding + onboarding?   Other Discussions and General Q&A  General Q&A Ask us stuff.   Open Discussion List of interests: D3M spread management Wintermute market making deal MAI & Maker Surplus Buffer management Altering Community Greenlight Polls process. Matic offboarding Call attendees to decide. Help us by using the anon question box below   Leave your questions in our anonymous question box and we’ll do our best to bring them up during the call. ",
                    "links": [
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1UH1aeHmdzg-KSIA1srh9kT0lrLcbOhZ7WUxOTDkrmZw/edit?usp=sharing",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.453947368421053
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "1",
                    "time": "30/11/2021-20:38:05",
                    "content": " G&R #170 Snippet This snippet includes Governance, MIPs, forum updates, and Core Unit team discussions from the MakerDAO Governance and Risk Call #170.  General Updates  Votes Executive:  Last Week’s executive - PASSED & EXECUTED  WBTC-C and GUSD PSM Onboarding Surplus Buffer and D3M Parameter Changes Core Unit Budget Distributions and Streams   Executive proposal is up for vote tomorrow. Will include:  Delegate Compensation Payments OMC and dust Parameter Changes GUNIUSDCDAI-2 Onboarding COM-001 Budget Transfer    Polls:  7 Weekly Polls - PASSED  Increase the Dust Parameter for Most Vault Types Increase the Dust Parameter for ETH-B Vault Type Use the MakerDAO Treasury to Fund MKR Expenses Add GUNIV3DAIUSDC2-A as a new Vault Type One Time Payment to the GovComms CU Parameter Changes Proposal - MakerDAO Open Market Committee Add CurveLP-stETH-ETH as a new Vault Type   2 Greenlight Polls - PASSED  MONETALIS (Monetalis Wholesale SME Green Growth Lending) SB-frOGI (SolidBlock Red Frog Digital Coin)     MIPs Weekly MIPs Update #64  3118×723 162 KB   As per MIP51c4: Calendar Exceptions, there will be no Monthly Governance Cycle in December, i.e., no Formal Submission Window and no Ratification Polls. Check out the Governance schedule for December and January.    Forum at a Glance Forum at a Glance: November 25 - December 2  Team-led Discussions  Delegates  We currently have 8 Recognized Delegates, plus one more coming in right now. The current participation metrics for Delegates didn’t work (created a 90% participation threshold), which led to this signal request.  Engagement from current delegates has been very helpful for the DAO. We need to focus on questions that hold us accountable for our work, transparency, promote discussion, etc. Wouter is happy with current the current state of delegation. However, it heeds attention to transparency and a positive environment. Once we get more clear information on delegate power roles, we should be ready to discuss and be ready for solutions. Self-interest, compensation, power is a potential concern for delegates, especially in the future if delegation scales.  Potential solutions: compensation caps based on home state/country.   Most delegates are not very active on forums, which leads to a social gap between the community and their delegates. Update: expect to see some news coming out within the next few months involving institutional delegation.   Roles of Delegates  There’s a hovering aspect of responsibility for delegates such as:  Proactivity on new initiatives Governance participation Involvement in governance issues and solutions etc   It’s time to solidify the roles and responsibilities for delegates:  What roles should/shouldn’t they do? It’s difficult to still understand this because it’s only been a few months of delegation. Should wait until we have more delegates and increased competition for delegation. The current state of delegates does not represent the future state of delegates.     Collateral Offboarding  Comms when Affecting Stakeholders An assessment, first-hand experience, and recommendations from the Aave Offboarding  Paper will be actively seeking out suggestions and feedback from users. What if we did softer penalties when offboarding and liquidating people through the SF instead? Tuning the CR doesn’t cost extra for the user. Is there a way to take a lighter approach on Oracles?  We should update them when prices fall but not when increasing. Technically, we can lower Oracle costs during the offboarding process - but it must be treated on a case by case basis.   We should also discuss other parameters when offboarding vaults and tokens. Once a collateral is onboarding, it’s important to perform collateral management and objective metrics, which will not require signal requests for collateral offboarding. Offboarding through liquidation promotes poor tax implementations depending on the jurisdiction. This is something to consider, especially since it may impact users.  ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmZXnn16?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmYdDTsn?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmSkHE8T?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/Qmc7Necw?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmNqCZGa?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/Qmek9vzo?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmS52AtS?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmYGUEFy?network=mainnet#vote-breakdown",
                        "https://forum.makerdao.com/t/weekly-mips-update-64/11878",
                        "https://mips.makerdao.com/mips/details/MIP51#MIP51c4",
                        "https://forum.makerdao.com/t/governance-over-the-holiday-break-2021-2022/11694",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-25-december-2/11967/2",
                        "https://forum.makerdao.com/t/signal-request-should-we-introduce-a-performance-modifier-to-the-delegate-compensation-trial/11850",
                        "https://forum.makerdao.com/t/an-assessment-first-hand-experience-and-recommendations-from-the-aave-offboarding/11836",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.385245830558331
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/11/2021-20:38:16",
                    "content": " Semi-transcription Summary   Episode 170: December 2nd, 2021  Agenda   00:03: Introduction  01:39: Votes and Polls  04:52: MIPs Update  08:28: Forum at a Glance  12:22: Discussion - Delegates  38:25: Discussion - Collateral Offboarding  1:01:40: Open Discussion  1:17:11: Conclusion   Video       Introduction  Agenda and Preamble  Payton Rose 00:04  Hello, welcome everybody to the scientific Governance and Risk Meeting #170 here at MakerDAO. My name is Payton, and I go by Prose11 online, one of the governance facilitators. Please note that this meeting is being recorded; please be mindful and not speak over each other. However, we encourage all open participation, and everyone is welcome to drop the question in the chat. We have quite the agenda today, so I will get us to get it. We will end with an open discussion.   General Updates  Votes  Payton Rose Polls:  7 Weekly Polls - PASSED  Increase the Dust Parameter for Most Vault Types 1 Increase the Dust Parameter for ETH-B Vault Type Use the MakerDAO Treasury to Fund MKR Expenses Add GUNIV3DAIUSDC2-A as a new Vault Type One Time Payment to the GovComms CU Parameter Changes Proposal - MakerDAO Open Market Committee Add CurveLP-stETH-ETH as a new Vault Type   2 Greenlight Polls - PASSED  MONETALIS (Monetalis Wholesale SME Green Growth Lending) 1 SB-frOGI (SolidBlock Red Frog Digital Coin)    Executive:  Last Week’s executive - PASSED & EXECUTED  WBTC-C and GUSD PSM Onboarding Surplus Buffer and D3M Parameter Changes Core Unit Budget Distributions and Streams   Executive proposal is up for vote tomorrow. Will include:  Delegate Compensation Payments OMC and dust Parameter Changes GUNIUSDCDAI-2 Onboarding COM-001 Budget Transfer     MIPs  Pablo 4:57 Weekly MIPs Update #64  3840×2160 295 KB   3840×2160 181 KB   3840×2160 199 KB   3840×2160 186 KB   Forum at a Glance  Artem Gordon 8:36 Post: Forum at a Glance: November 25th - December 2nd Video: Forum at a Glance  Team-led Discussions  Delegates  814×392 97.4 KB  12:50  LongForWisdom: To give everyone a chance to comment on how delegates are going and how the conversation is going. I am going to provide a brief overview. We have 8-9 delegates right now. One of our concerns was not being able to attract recognized delegates. It is fantastic that we have people in this new community and take this role in Maker. While debatable if this was attributed to the trial compensations, we still want to see these positive outcomes. As Payton mentioned, the first batch of delegate compensations will be part of the executive proposal tomorrow. There are only four delegates that we are distributing to this week. Based on the current metric cutoff at 90%, we are leaving some out. Some are eligible, but they are new, not focused, and have not accrued much MKR to delegate to. We will skip some payments, about 50 Dai, for gas reasons. We will roll that over into next month, assuming this accumulates more. We have a couple of delegates receiving the full amount and a couple receiving close to the full amount. We have a spreadsheet that we will post to the forum to make public before the exec. It will be linked. However, this has not been smooth sailing. In retrospect, the initial plan to set the compensation based on a hard cutoff of 90% on the metrics was a mistake. I believe Makerman has ended with a figure close to 89% for participation. This is a bit unfortunate in terms of the rule. We are proposing to sort of soften that out a bit. There is a request in the forum now about this. We should gradually cut this towards 75% delegate participation and communication, which is we are around now. Feel free for anyone to comment.  16:43  David Utrobin: One thing that I find interesting about this development is that delegates themselves have a natural floor for participation. But then, some delegates also have a grander view of a single recognized delegate. I will use GFX labs as an example. They have multiple people on their singular delegate platform. When you are delegating to them, you are not delegating to one person but rather to a team of people. This is an interesting and higher level of participation than an individual trying to be a sole delegate. Introducing a sliding compensation scale regarding your behavior and participation makes sense. I like where things are going and the current delegates’ engagement. This has been helpful for the DAO.   Roles of Delegates  837×387 75.2 KB   840×398 85.9 KB  18:31  David Utrobin: Is there any issue apart from the 90% participation threshold? Are there any other things popping into people’s minds that they have a problem regarding delegate compensation?  LongForWisedom: What do delegates generally do?    18:55  David Utrobin: I briefly mentioned the recognition of delegates as teams versus individuals. There is an emerging meta that delegates are the role of overseers, even though they do not want to micromanage core units. Their responsibility is to ensure a high level of integrity with what is said versus the actions taken. That is an aspect of a delegate. There is also the aspect of delegates being proactive starters on new initiatives. A great example is in our following discussion is the offboarding and communication standards for vault offboarding. A user came and told their story on Governance call last week. They posted once again on the forum for reference. This produced a MIP that paper Imperium with GFX labs spearheaded by inviting several DAO members to come in and contribute to these requirements. How do we codify our communication standards around offboarding? Thus, we see delegates also as these proactive starters. For example, Schuppi has been proactive on so many of the signal requests pretty much since Maker started. At the very least since the MCB started. I am noticing that aspect. Then I am curious, what other roles do delegates fit into aside from overseers and proactive starters? What roles should they not work? Should there be an overseer?  LongForWisdom: Those questions are difficult to answer at this stage regarding what delegates should be doing versus what they are doing. We only had the delegates for a few months; it is still early. Once we get more delegates and the landscape starts getting more competitive, we will see the changes you are talking about. So, what are the delegates doing? I am worried about looking at the current situation and extrapolating beyond it or assuming it will carry on in that vein. David Utrobin: Are you worried about more disagreements between delegates in the future? LongForWisdom: I am not worried about disagreements necessarily, just that the current state does not necessarily represent the larger future state of delegates. David Utrobin: Two newly recognized delegates evidence your statement came and applied these past two months. We have JustinCase and another that applied yesterday.    22:35  Dereck: As a facilitator, I see that we are moving in a good direction. To David’s point around proactive starters, several delegates reached out to me with questions. I have only been able to respond to some, but it has forced me to reach to the team and come back with responses. It is a positive move to have someone ask us questions on the various protocols. I am happy to have that dialogue but would like it to be more transparent—transparency ties back to our mandated actor discussions and evolution. Delegate involvement is also an important piece to move towards as well. I am happy to see higher delegate participation. Thank you, guys.  David Utrobin: Do you have any cautions or mindful notes to share for existing delegates? Are you noticing anything not being addressed or not being paid attention to? Dereck: That is difficult to say. Our current questions that hold us accountable for our work and actions are good. I find transparency, openness, discussion, and positive questions as a facilitator. Although it may take time away from other topics, I find asking questions and participating 100% important.    24:56  Wouter: I want to second one there. I am happy with the current state of how delegation happens at Maker. Transparency is and will remain important. Due to its power centers, we have not gotten to the stage of delegates attempting to abuse their power. The current setup begins with the expectation set around transparency. This high standard set by the delegates we see today properly motivates voting behavior. This process has created a good environment. There is quite a bit of transparency right now. However, I am worried that this may not continue later because no guardrails exist. Transparency is encouraged but not supported. When it becomes clear how the delegate power can be used and abused, we might see more exciting situations where conflicts of interest play a role. Individual delegates might choose not to be transparent. Then, we will begin to see the limitations of the current framework. But in all, I am happy about the current state of delegation at Maker; it has improved things tremendously.  27:07  Prose11: One question coming is up is delegates voting on their compensation. This has happened previously and will occur in the future, assuming our present signal request does go through on an upcoming poll. GOV Alpha view and the response to our setup around that may be interesting to some on the call. There are special rules set aside for how and when representatives can vote on their compensation, like in many governments. We do not have them in the protocol partly to maintain this permissionless structure that allows anyone to set up a delegate contract. Anyone can propose any change to Maker protocol through our governance systems. In terms of concerns, several actions can occur when people feel that delegates are abusing their ability to vote on their compensation. You can instantly redelegate or unassign your delegation. This is a check on that type of behavior. Please keep in mind these people were being delegated to make big decisions with billions of dollars of capital in the protocol. Self-interest and compensation can be an area of corruption if you are unwilling to trust a delegate voting honestly, transparently, and responsibly. It would help if you thought about your willingness to delegate to them for other issues.  David Utrobin: How do governments and other organizations deal with voting on compensation? Is there a special committee that is created? Is there a sub-voting structure? Prose11: Sure, I did work on different ones across the world. Here in the US, several rules vary depending on government structure. A standard amount is one can vote on a raise, but it will not occur until the next election cycle. Caps are common. The cap increases are capped to cost of living, inflation adjustments, or something similar.    30:39  LongForWisdom: We can do a couple of things to make the protocol less of a problem; it has not been the highest priority. During the trial period, I am less worried about the long term. The long term is important, but we will not lock ourselves out of fixing that later.  30:43  Wouter: Compensation is so open and obvious that it is a lesser risk. Delegates have an incentive to be reasonable to attract MKR votes. Delegates are also impacted by their own decisions, for example, how the delegation system works and delegate limits on being executives in the DAO. One of the longer-term, creeping, and problematic risks are maintaining the power balance between core units, the delegates, other power centers. Why would delegates ever vote to restrict their power? We started with high standards and exemplary behavior, but it may soon be clear that there are certain things that delegates can vote for that would significantly increase their influence. In general, we need to determine how much power they have. That is the key question.  33:26  Joshua: Someone raised the question of how other political systems work with delegation? There are not many good comparisons out there. With the MakerDAO system, Maker holders can undelegate at a moment’s notice. That is a unique feature of the way delegation works at MakerDAO.  Once you delegate in most other political systems, it must go through Congress. Congress members hold that position for two years, six years in the Senate. You are stuck with them. But in MakerDAO, you can undelegated at a moment’s notice.  34:22  David Utrobin: The challenge is that most delegators are not actively paying attention unless there is a big campaign or controversy on the forums. I also wanted to comment on Wouter’s point about delegates as power centers and the general governance representation. There are other parties at Maker. There are various stakeholders in addition to core units and delegates. There is also a level of representation for Vault users, Dai holders, and other stakeholder types at Maker. Should we consider different ways to represent them in the sister system or given power? I had this idea of Phantom voting MKR. It is not actual MKR, and you cannot redeem it for MKR. In addition, to if you are a mandated actor, you will have a certain base voting weight on the vault. This is a far-out idea that I did not see talked about anywhere. I am curious about people’s general thoughts on governance, power, and representation for other stakeholders beyond delegates and regular MKR voters.  LongForWisedom: Let’s save that for another time as we could talk about that for an hour and a half. David Utrobin: I am happy to put it out there as a seed to an idea. The meta of the governance that Maker is the plutocracy. You need skin in the game to have some say in governance. If you own MKR or are a delegate, you have skin in the game the same as a vault or Dai user. That was my thinking behind the idea. LongForWisdom: I want to talk briefly about institutional delegation; its anchorages are awkward for institutional users to delegate. Several larger holders are in the process of setting that up now. Hopefully, more MKR will be coming into the delegates in the next few months, hopefully on the outside.     Collateral Offbaording 38:21  Prose11: We have covered this topic well; we will move on to collateral offboarding. We recently started offboarding unprofitable collaterals or ones that are not seeing much use. We need to find different ways to improve. David mentioned the testimonial we got last week regarding how our procedure and practice have affected people. We are thinking about how to avoid that in the future and systems for collateral offboarding to follow more properly. This is not delegated to the mandated actors, which was the single request and poll for a little while in Maker history. Months ago, we had this point to investigate vault offboarding. It was left to the mandate actors to sort out the how and when of this offboarding. This was not great for transparency, so hopefully, we can talk about clutter offboarding more generally. I got a response. If you do not want to speak, I will just take your silence, Paper. I know you are putting together MIPs for collateral offboarding.   832×473 112 KB  39:59  Paper: I am working on a MIP to have a communication process for users. I am happy to seek input from anybody that wants it. We are in the second round. I will put something up on the forum either tomorrow or next week so people can continue to offer suggestions. It will not be anything controversial. It is shaping up for CES to get a checklist and own the process of running down various media assets and communication channels. We want to give a period to communicate before people get liquidated.  41:08  David Utrobin: I am curious about one aspect of collateral offboarding that Richard has discussed in his post and recommendations list. One recommendation spoke of alternatives for softer offboarding instead of our current method of setting the debt ceilings to zero, setting the liquidations penalty to zero, and then increasing the collateralization ratio requirement to push all the votes into liquidation. He recommended the opposite of a zero debt ceiling, zero liquidation penalty, but increased stability fee. You could liquidate people out later, but why not just do an instability fee? Does anybody else have thoughts on what might be a more ideal and softer offboarding tactic? Soft offboarding or taking longer to offboard does incur an Oracle cost. What can we do on the Oracle side for collaterals being offboarded during that time? Is there a way to down tune the Oracle costs in a non-disruptive way, given that liquidation penalties and the debt ceiling are zero?  UnknownSpeaker: There are two questions at hand. The first question concerned the same scenario where the debt ceiling was zero and the liquidation penalty was zero. The question is whether to approach the liquidation point by either tuning the stability fee to go up over time or tuning the collateralization ratio. We chose the collateralization ratio because it does not cost the user anything additional. Without communicating to the user, the stability fee would blind them by this massive fee collection on their vaults. This ends in a bad user experience that looks like predatory lending from the Maker perspective. That is the answer to the first question. I leave it to Nik or someone else to discuss the second question. The way to take a lighter approach on Oracles would be not to update them every hour or so? The answer would be updating them in case prices fell, but not when prices were increasing. That may be the answer, but I pass it to Nik. Nik Kunkel: For recent collateral types that were offboarding, we changed the parameters we updated them now. There are risks that the system takes on for a particular collateral type. We give those collateral types of risk parameters based on the liquidity in the markets, the volatility profile, and so forth. When you update the Oracle less, you effectively have the protocol take on more risk. You do not want to do it for the more volatile collateral types when outstanding Dai is still relatively high. That sounds counterintuitive because there is not enough Dai if we are offboarding. We are not earning enough fees. But you can, for example, look at something like uni, which I believe is about 10 million Dai. Due to an estimated 1% stability fee, we only make about 100k on it. The protocol does not want to take a $10 million loss; that is significant. Changing the uni Oracle parameters is more suspicious than the LoopRing token with only 50k or 100k Dai outstanding. We can lower the Oracle costs during the offboarding process, but it has to be treated on a case-by-case basis. Some factors would make us hesitate to do that.    47:16  Nikolaj: My point is on a slightly different topic as it is a more general problem that does not relate to collateral offboarding. Instead, I see it as an example of Maker covenant shutting off a service or feature of the Maker Protocol or changing it dramatically. One of my inputs on Paper’s MIP was to make an even more generic process and increase dust limits. I remember this vox MIP came in in the integration team and the foundation. We immediately knew from our integrators that changing the par value in the Maker protocol is not something we should do. This would prorate a lot of integrations. We need to consider end-users and integrators when we either shut off services or substantially change them. This is a general problem we will see with collateral on offboarding.  48:48  David Utrobin: In the first prompt I designed for this segment, I asked what other government actions require more proactive comms? That is what you are hitting on. It is offboarding and dust limits and changes to auction parameters. At some level, our team at Gov Coms is mapping the entire stakeholder ecosystem at Maker. The next progression of that project is to take each stakeholder and drill down into their profile to identify the changes that affect this user type or stakeholder type the most. It is not necessarily users but could also be large holders, institutional partners, and people indirectly affected by MakerDAO changes. Getting a good view of that is undoubtedly something the DAO shall be working on.   840×478 146 KB  50:09  Nadia Alvarez: I do not know if Robert is here, but he said something interesting about the MIP on Discord. If we manage the collateral lifecycle as a product, this will be part of the process. We onboard the collateral when we afford it as a clear onboarding criterion. When collateral is at risk to be ordered, what are the next steps for the stakeholder in charge? What are we going to do with users? If we raise the dust limit, for example, that is part of the lifecycle for that product. That was an exciting point of view. I am happy about having a collateral core unit because this treats the issue seriously, views new collaterals as a product, and creates that life cycle. Although this would take a couple of months, this will help us by addressing the communication problems we have now.  Robert: There was a discussion going on earlier in the chat. I appreciate Paper for spearheading this. Now that my team is getting up and running, Nikola is doing a fantastic job onboarding the new engineers from a technical perspective. I now get to turn my activities toward these types of issues. One discussion topic I mentioned earlier was the need for offboard signaling to the community as we onboard collateral. Is there something else we should be doing? Once a piece of collateral is onboarded, we must follow a specific process to manage collateral and communication. This is especially the case if we need to offboard it. Until now, we have not seen or experienced collateral management as a product and following a lifecycle. We can hopefully set up objective metrics upfront when we onboard a piece of collateral. This is how I view all our collateral that is currently onboarded and those yet to be onboarded. If done correctly, there is no need for a signal request as we will already be on top of this. It is not a matter of trying to cut the community out but instead establishing consistency in managing our collateral communicating to our stakeholders once we get something in the pinball machine. Then, if we decide to offboard a piece of collateral, this will follow a well-published process to do so. That was the net of the conversation.    54:01  David Utrobin: I just wanted also to tack on the culture of the cultural implications of this issue. As a group that manages the protocol, we are all mindful of the numbers, the risk management, and the operational efficiency. One thing that makes companies stand out and succeed is the emphasis placed in our culture about looking after the end-user. At Maker, it is not super straightforward because there are many end-users. There are Oracle users, Dai users, and Vault users. Outside of our technical and quantitative view on managing the protocol, we should try to be mindful about what our actions implicate for the end-user, whoever that might be.  LongForWisdom: We should get in the habit of thinking about the possible outcomes of our actions before acting upon them. It was predictable that this was going to happen. A genius is not needed to predict that one of the outcomes of offboarding collaterals such that most users get liquidated within a few days, which causes those users to be upset.    57:10  Robert: I want to add one more thought about collateral offboarding that just occurred to me. It is related to the jurisdiction in which you find yourself. You have a house, and you have a loan against your house and a type of HELOC. You do not pay your bills, so your house gets repossessed and liquidated. You now owe taxes and jurisdictions on that liquidating portion. Offboarding through liquidation has bad tax implications, depending on the liquidating jurisdiction. We may want to consider or figure out the collateral offboarding process’s user impact.  David Utrobin: How do we get other people with skin in the game or different stakeholder types a type of governance representation? Even having less than 1% of Dai users aware offers a virtual feedback channel. As Long said, we could have caught the offboarding issues. The mindlessness and lack of review reflect a few people’s failures, including my own. Opening lines of feedback and communications to these stakeholder types is important. That is why we have always kept the Governance and Risks calls public. We are moving towards a model for our coordination calls to be more transparent and allow people to request invites for specific initiatives.     Open Discussion  Questions 01:01:41  Juan: I wanted to share a couple of the calls we are having. First, we want to start a conversation about anything related to green or clean money. We invited Adam from Greenbit to talk with us. He will be in our call for Maker Explorer on December 8th. Interestingly, Layer Zero will be leading these calls called Lex Maker. We are working to bring different DAOs, start legal research, and talk about Lex Maker. We technically had the pilot when we had the Dai foundation years ago. We will have the DAO cooperative research from Miles Jennings from a16z and David Kerr from Corey LLC. They have been researching DAOs, and they will be very general. I am looking forward to those, and check for our other calls on the forum.  1:04:29  Nikolaj: I posted today in the Oracles budget MIP. I have not thought this through, but we have almost $3 million worth of ENS tokens, and that is how much we owe the Mega Foundation. We should use the ENS airdrops to get that out the way. We can discuss that.  Nik Kunkel: There are externalities there. This is the first time that Maker got some significant allocation of tokens from a major project. Do we want to give the image that we will dump your coins if you airdrop them to us? This tells them not to bother trying to get us to participate in their governance because we will not do it. On the other hand, I cannot imagine that ENS is reasonably valued considering little money. We could also be dumping the top, which is something to consider. Nikola: Is it dumping if we give it to a nonprofit foundation? Nik Kunkel: When Nikola suggested this, we would dump Dai to the foundation because our debt is denominated in DAI. If you were to give ENS tokens slippage, it might be challenging to settle on the amount of ENS tokens with the foundation that would make them agree to settle the debt. Brian McMichael: The number works right now. However, as soon as a signal request, a poll, and an executive stated that we are selling ENS, there will be a couple of weeks where people front-run it. You will then not be able to pay off the foundation anyways. The price will bounce right back after the exec is passed.    1:07:11  Unknownspeaker: Are we going to get an invoice from the foundation or some type of documentation?  Nik Kunkel: That is the due analytics of the documentation that shows ETH in, gas out, and analysis from the blockchain. There is not anything more concrete than that. Nik Kunkel: We can talk to them to send us something. The number is highly dependent on the date we pay them. We are increasing our tab by constantly pushing Oracle updates until that date. Maybe we can get an update after we send it.    1:08:41  Unknownspeaker: Nick said this is the first time a major protocol has dumped tokens on another protocol. Maker is credibly decentralized. Even if we do not have a huge stake or an interest in ENS, we could set a precedent that would inform a protocol that we have an interest in. We want to arrange with compound, Aave, or some other L2. It would be beneficial if we had some of their tokens. If we dump the ENS tokens on the market, we may risk telling future projects we will do the same. A good compromise to monetize it is what LongForWisedom brought up in the sidebar. We could create a vault type and form a price for users. We get the vault ourselves, take some Dai debt, do whatever we need to pay the foundation with the Dai debt. We would have the ability to take those tokens and use them and vote with them.  David Utrobin: If we create an ENS Vault, other token projects who want to get around the whole collateral onboarding process could give them a sizable allocation. We would probably be at the front of the list. Nik Kunkel: As LongForWisdedom predicted, the Oracle cost would be prohibited in doing that. We would not save anything and would bleed money.    1:11:09  Nik Kunkel: We just said that there is insufficient liquidity to dump three million into the market at a competitive price. Now, is our solution is to lever up on that? Do we approach the ENS team to onboard many tokens in our protocol when we cannot liquidate at all? At some point, it does not make sense anymore. Some of these tokens are premature and must build up a good liquidity profile before you can do anything with them, regardless of their treasury’s participation. To clarify what I mean on levering up on the risk, we can mitigate the Oracle costs by having ENS put 20 million worth of treasury in here and mint 10 million Dai. Then, we can make you a vault. The problem now is that the protocol would have trouble liquidating on that kind of scale.  Unknownspeaker: I do not favor dumping the tokens for the record because of the precedent. We may get dropped tokens that the DAO would find a major strategic advantage in the future. Nadia Alvarez: I agree with Mooney that receiving an airdrop of a governance token and dumping it will be a terrible message for the community. We currently see many projects proposing token exchanges in close partnerships to have them in the treasury and skin in the game. I will be more interested in having a treasury of the important partners with their tokens rather than dumping them to pay for costs.    1:15:29  Juan: We should separate topics instead of mixing everything in one bag. This makes the decision-making way harder. One topic should be paying the foundation and what to do with the tokens. Our participation in governance should be another topic. We need to avoid mixing issues because this will make it impossible to arrive at a decision.   Conclusion  Payton Rose  Noting the time here, we had a full round with many discussions. This is your last chance to bring anything up. Thank you, everyone, for coming. I look forward to seeing everybody in the future. Let us keep the conversations going in the forum and on the MakerDAO Discord.  Suggestion Box  Common Abbreviated Terms CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal OSM: Oracle Security Module LR: Liquidation Ratio RWA: Real-World Asset RWF: Real-World Finance SC: Smart Contracts Liq: Liquidations CU: Core Unit  Credits  Artem Gordon produced this summary. Larry Wu produced this summary. Everyone who spoke and presented on the call, listed in the headers.​  ",
                    "links": [
                        "https://youtu.be/Oc51JgPekLA?t=99",
                        "https://youtu.be/Oc51JgPekLA?t=99",
                        "https://youtu.be/Oc51JgPekLA?t=508",
                        "https://youtu.be/Oc51JgPekLA?t=742",
                        "https://youtu.be/Oc51JgPekLA?t=742",
                        "https://youtu.be/Oc51JgPekLA?t=3700",
                        "https://youtu.be/Oc51JgPekLA?t=3700",
                        "https://www.youtube.com/watch?v=Oc51JgPekLA",
                        "https://youtu.be/Oc51JgPekLA?t=4",
                        "https://youtu.be/Oc51JgPekLA?t=297",
                        "https://forum.makerdao.com/t/governance-and-risk-170-thursday-december-02-17-00-utc/11899",
                        "https://youtu.be/Oc51JgPekLA?t=516",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-10th-16th/10344",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-25-december-2/11967",
                        "https://youtu.be/Oc51JgPekLA?t=770",
                        "https://youtu.be/Oc51JgPekLA?t=1003",
                        "https://youtu.be/Oc51JgPekLA?t=1111",
                        "https://youtu.be/Oc51JgPekLA?t=1135",
                        "https://youtu.be/Oc51JgPekLA?t=1355",
                        "https://youtu.be/Oc51JgPekLA?t=1496",
                        "https://youtu.be/Oc51JgPekLA?t=1627",
                        "https://youtu.be/Oc51JgPekLA?t=1819",
                        "https://youtu.be/Oc51JgPekLA?t=1843",
                        "https://youtu.be/Oc51JgPekLA?t=2026",
                        "https://youtu.be/Oc51JgPekLA?t=2072",
                        "https://youtu.be/Oc51JgPekLA?t=2301",
                        "https://youtu.be/Oc51JgPekLA?t=2399",
                        "https://youtu.be/Oc51JgPekLA?t=2468",
                        "https://youtu.be/Oc51JgPekLA?t=2836",
                        "https://youtu.be/Oc51JgPekLA?t=2928",
                        "https://youtu.be/Oc51JgPekLA?t=3009",
                        "https://youtu.be/Oc51JgPekLA?t=3241",
                        "https://youtu.be/Oc51JgPekLA?t=3430",
                        "https://youtu.be/Oc51JgPekLA?t=3701",
                        "https://youtu.be/Oc51JgPekLA?t=3869",
                        "https://youtu.be/Oc51JgPekLA?t=4031",
                        "https://youtu.be/Oc51JgPekLA?t=4121",
                        "https://youtu.be/Oc51JgPekLA?t=4269",
                        "https://youtu.be/Oc51JgPekLA?t=4529",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.621433104417397
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/12/2021-00:10:20",
                    "content": "This full call is now available for review on the MakerDAO Youtube channel:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "04/03/2022-06:11:13",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-171-thursday-december-09-17-00-utc/12083",
            "title": "Governance and Risk #171 - Thursday, December 09 17:00 UTC ",
            "index": 12083,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "0",
                    "time": "08/12/2021-15:25:17",
                    "content": " gr-meeting (3)1920×442 26.9 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved, and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, financial or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment, financial or other advisory services.  Call Information The zoom waiting room will be on, and a password is set to: 748478, please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-12-09T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit : Hosting, Introduction, Agenda.  @gov-comms-core-unit : Slides   Governance Round-Up   @prose11 Poll + Executive Status  @blimpa - MIPs Update  @Artem_Gordon Forum at a Glance   Selected Discussions  Mandated Actors A form of delegated authority, who has authority and over what? partner relations, deal negotiation, role-of, and other related topics.   Handling 3rd party crisis situations What is our policy for these situations? How can we document and systematize our response to various 3rd party crises? How do we handle Dai recovery generally?   Other Discussions and General Q&A  General Q&A Ask us stuff.   Open Discussion List of interests: D3M spread management Wintermute market making deal MAI & Maker Altering Community Greenlight Polls process. Matic Vault, Institutional Vault Deals, Call attendees to decide. Help us by using the anon question box below   Leave your questions in our anonymous question box and we’ll do our best to bring them up during the call. ",
                    "links": [
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1pGQ4VgM7WFdmDTcdpcuMuJayiXUMnP8CZZUc94NqDgk/edit?usp=sharing",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/12/2021-16:00:53",
                    "content": " G&R #171 Snippet This snippet includes Governance, MIPs, forum updates, and Core Unit team discussions from the MakerDAO Governance and Risk Call #171.  General Updates  Votes Executive:  Last Week’s executive - PASSED & EXECUTED  Delegate Compensation Payments OMC and dust Parameter Changes GUNIUSDCDAI-2 Onboarding COM-001 Budget Transfer   Executive proposal up for vote tomorrow. Will include:  Adjusting wstETH-A and MATIC-A Parameters Changing MKR Vesting Source (Unconfirmed) MegaPoker Updates    Polls:  2 Weekly Polls - PASSED  Adjust wstETH-A System Parameters Adjust MATIC-A System Parameters   2 Active Greenlight Polls  aUST (Anchor TerraUSD) G-UNIv3-DAIUSDP (Gelato UniswapV3 DAI-USDP LP Token)     MIPs Weekly MIPs Update #65  3115×675 151 KB   Last date for proposals that intend to enter January’s Governance Cycle was Wednesday 8th. The reason for this is: Those proposals that have not fulfilled their Feedback Period cannot be formally submitted And the Feedback Period spans a minimum of 28 days And the Formal Submission Window for January closing on Wednesday 3rd Once posted, proposals will be open to overt community feedback, and authors will have 21 days to act on that feedback (they must honor the one-week Frozen Period!).   Forum at a Glance Forum at a Glance: December 2 - 9  Team-led Discussions  Mandated Actors   960×540 53 KB   Types of Delegate Authority  How do we distribute a healthy balance of power of delegation that will naturally promote good and healthy decisions?  Authority and privileges are not completely defined - some Mandated Actors now can put themselves at risk. There needs to be a place where members can find an individual’s authority and privileges. Future MIP authors/editors should be more explicit and detailed regarding any authority involved.     Deal Negotiations and Partner Relations  We need to improve our timeliness on deal negotiations, which is currently our weakness.  Creating a working group could be one approach to help improve Core Unit decision-making. However, we do not need it to be black and white; we can have CUs pick their method to balance our pros and cons.   It is becoming difficult to scale our methods used as the numbers of polls and opportunities increase.  We cannot sustain by continuing to go through Governance for all onboarding. We should place more authority in individuals that have been designated Mandated Actors.     Handling Dai Recovery   960×540 48 KB   Comms when Affecting Stakeholders  Governance has a large amount of power when creating new Dai, which gives us the ability to return lost Dai to stakeholders. PECU did not disable the ability to send Dai to another Dai contract due to gas fees.  Best method to return Dai to lost accounts is through a permissionless method with creating a dummy Dai token, dead Dai, to mint against. PECU has some ideas but involves many dependable actions and bandwidth.   How do we even verify the correct person? We may need a Core Unit for that. Dai recovery may be good for the protocol by having that Dai to help maintain the peg.  ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmdzwZyS?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmPBRpCW?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmVTiToU?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/weekly-mips-update-65/12033",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-2-9-2021/12119",
                        "https://forum.makerdao.com/t/maker-relay-ep-75/12187",
                        "https://forum.makerdao.com/t/maker-relay-ep-75-en-espanol/12214",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/65"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.906365955473099
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/12/2021-16:01:01",
                    "content": " Semi-transcription Summary  My apologies for the lateness of this post.   Episode 171: December 9th, 2021  Agenda   00:00: Introduction  02:28: Votes and Polls  05:54: MIPs Update  10:14: Forum at a Glance  14:24: Discussion - Mandated Actors  1:06:06: Cpen Discussion   Video https://youtu.be/PjfAEZHdLEw  Introduction  Agenda and Preamble  Payton Rose 00:00  Hello to everyone. Welcome to Scientific Governance and Risk episode #171 at MakerDAO. My name is Payton, and I am one of the governance facilitators. I will be guiding our way through the meeting. I appreciate everyone who joined. We are with a bunch of awesome Maker people, both those who work and contribute to the protocol and those who are just interested generally in Maker governance. Thank you all for being here. Also, those who might be watching this later on YouTube, we appreciate you. I will go over a couple of ground rules before getting things kicked off. As you probably notice, this is being recorded. Be mindful of that. Try not to speak over one another. If you have questions, we encourage them, and if there is a lull in the conversation, please feel free to hop on the mic. If you are not comfortable, or for whatever reason, you would prefer not to do so, feel free to drop your comments or questions in the sidebar. We will try to work them in when conversationally appropriate. We have got a bit of an agenda to get through. I am happy to present that today. We will start with our governance roundup, going over the votes and what is happening in the forums, and our Maker improvement proposals. We have got a couple of neat discussion topics today from our community discussion concerning the authority and powers of mandated actors and defining that and talking about what it is now, what it could be in the future, and what we think it should be. Then, handling Dai recovery situations. This topic that anyone who spent a long time on our Discord might know is a common issue; people accidentally send Dai to the contract address when they need to be sending it to a friend. It can also happen on an institutional scale, which we might get into later. Finally, we will go into the discussion section if there is any time left over. If you drop any questions or comments that may not relate to what we are talking about now, if we have time, we will circle back and get to them later.   General Updates  Votes  Payton Rose 02:28 Executive:  Last Week’s executive - PASSED & EXECUTED  Delegate Compensation Payments OMC and dust Parameter Changes GUNIUSDCDAI-2 Onboarding COM-001 Budget Transfer   Executive proposal up for vote tomorrow. Will include:  Adjusting wstETH-A and MATIC-A Parameters Changing MKR Vesting Source (Unconfirmed) MegaPoker Updates    Polls:  2 Weekly Polls - PASSED  Adjust wstETH-A System Parameters Adjust MATIC-A System Parameters   2 Active Greenlight Polls  aUST (Anchor TerraUSD) G-UNIv3-DAIUSDP (Gelato UniswapV3 DAI-USDP LP Token)     MIPs  Pablo 05:54 Weekly MIPs Update #65  MIPs Updates1920×1084 168 KB   Proposals galore1920×1079 187 KB   CORE UNIT PROPOSAL SETS1920×1074 259 KB   MIPs1920×1083 184 KB   BUDGETS1920×1073 121 KB   OTHERS1920×1036 202 KB   That&#39;s all for MIPs1920×1038 59.1 KB   Forum at a Glance  Artem Gordon 10:14 Post: Forum at a Glance: December 2 - 9 Video: Forum at a Glance  Team-led Discussions  Mandated Actors  14:24  MANDATED ACTORS960×540 53 KB   David Utrobin: Generally speaking, to decide which topics we will cover during this G&R call, we have an extensive list of current events and current topics, and between the mandated actors, we choose what we think makes sense. We are open to hearing suggestions from anybody on what topics they would like to discuss or hear on these calls. Please feel free to talk to us on our public chat channels and give us good suggestions. This week, we settled on talking about mandated actors, specifically, sharing this idea that mandated actors have also delegated authority: special vested powers depending on the type of mandated actor they are, whether they are the facilitator of one core unit or another. Because different core units have different functions, their facilitators have different particular types of authority in some cases. I created a few prompt slides. We will talk about the mandated actor role in deal negotiation, the importance of authority in partner relations, and what can help various mandated actors be more effective at producing impact and driving business growth at Maker.  16:24 - Payton Rose  One area this came up with and talking about the mandate actors was our institutional vaults and the ability to make deals as it is hard to with the DAO. The DAO has to approve the deal. When you are in negotiations, you lose much leverage from not saying; this is what I am offering, and having to say; this is what I hope to offer if the community supports it. That is some context on the origin of how this topic came to be.  17:05 - David Utrobin  Prompt 11917×1027 209 KB   Prompt 21920×1038 216 KB   Prompt 1 was digging into the types of delegated authority, examining this whole topic of what direct authority should be given to mandated actors and what needs to follow our traditional governance process. For example, how much authority within a deal should a mandated actor have, compared to what has to be signed-off on it at the end, by governance. Also, what sort of checks are in place to prevent abuse of special power privileges, and how do we support transparency around these permissions. Because when you give people permission within a business, it gives them extraordinary power and a leverage point. We, as a DAO, are very mindful about who holds power and how we distribute it in a way where there is a healthy amount of balance throughout. That ultimately leads us to make wise and good decisions and not blunder and have people abusing their powers. I am happy to stop ranting and ask Nadia to come and speak to us. Since you are the facilitator of the Growth CU and you are on the frontlines with many partners.   Types of Delegate Authority 18:37 - Nadia Alvarez  At Maker, we need to redefine how we will manage the onboarding and all the process of Institutional Vaults and regarding the relationship with the partners who agree on having a Vault with us. Institutional Vaults is a nifty tool and product for Maker because, thanks to that concept, we have attracted a lot of crypto collateral into the protocol. As Séb stated in his latest post, Nexo passed from minting 200 million to 1.5 billion thanks to that idea. We talked about this with Celsius, and they got excited about that and started using Maker Vaults again. As a product, as a concept is amazing. However, things are messy when you start creating something permissionless, like a product or a service that you offer to individuals. It is not easy because, in Growth, we are the face of Maker. We represent Maker at a point with our partners. We talk to them, tell them about the Institutional Vaults, and explain what it is all about. Right now, we have many institutions interested in using this product. It is a long process. We have to explain many things to these institutions. The concept of being a DAO is challenging to explain to a legal and compliance team. Still, they are very interested in trying out this institutional product because Maker works. Then we have to negotiate the terms of the proposal with the institutions, and we are at a disadvantage because we are a DAO. We have many people who want to participate in deciding about the terms of the agreement against one entity who can decide fast, and they are expecting answers as soon as possible. I took one approach because I did not have all the knowledge to decide the best parameters for this, to create a working group with Risk, Protocol Engineering, and Ace from Real World Finance. We work on these agreements, and we propose risk parameters. Until we posted in the forum, the institution had many discussions to agree on the terms.  Sometimes it would be great if the working groups could decide and not wait until what the community thinks or what the Maker holders want. I do not want to have all the power of decision. Working in a group is the right approach to do that. We need to understand how the protocol is affected from different perspectives. That is why people are from different CUs. That is an example on the Institutional Vaults side. We did not want to discuss this particular case in the mandated actors’ call because we see this in different cases. We are having a liquid problem with Dai on other networks, and we need a market Maker and a lot of Dai to deploy on those networks. What should we do? Going through the MIP path will take a long time, and we need a quick solution. It is an open question. I brought these two cases because those are the ones that are on the top of my head. Every CU faces a lot of these situations where they have to act fast, make decisions, but at the same time, we want to talk with the community and ask for their feedback. If we do that and go through a MIP, that takes time. The first approach or solution will be to have these working groups. That is something that we have been organizing in the last month. We want to know what the community thinks about this. It will be great if other CU wants to jump in and talk about their particular experience.  Juan - 25:06  I wanted to add that Joey Santoro from Fei Protocol published today, a good article about, I forgot the exact words, I think it is optimistic governance. Something where DAO gives more power to some actors, and then you have all the checks and balances in place. That is also something that I believe that Rune was bringing up in the governance channel. It is something worth checking out if anyone is interested in this topic. It is very hard to agree as a whole. Again, I believe Rune promised a good document in weeks. Looking forward to that and seeing what he brings.  David Utrobin: What are the main takeaways that you had from that article? What were the most significant points?   I do not want to focus on the article per se. What Nadia is saying is true. Sometimes you need the speed and the authority to have judgment calls in different situations. At the same time, because it is a DAO and the MKR holders need to keep the power, you need to add the check and balances to ensure that this power is not abused and that there are different mechanisms for different situations. It is something that Maker needs to work on. We are still very green in that sense. In the immature sense, not in the clean sense, unfortunately.   Deal Negotiations and Partner Relations 27:03 - Payton Rose  For those that are unfamiliar, I am thinking of the way our governance processes now. The protocol stays the same unless we pass a proposal through our governance that indicates that we want to change. On the other side, Optimistic assumes that a proposal will pass and go through unless a veto occurs. In theory, you could get more done with less governance overhead while still having checks and balances in place. There are benefits and drawbacks to doing both ways. We do not have to have all or nothing either. We could set up certain opportunistic ways of approaching specific situations and keeping the standard model for others. Kind of a rich governance topic that gets me excited. I hope it is not too boring for others.  27:57 - Nikolai  With these sorts of private negotiations and how companies do it, it is private for a reason. It gives a huge advantage in negotiating power if you work out what you are willing to offer, what you are willing to take, and all that kind of stuff behind the scenes. The problem with the DAO is that we have to present this in public. It is required to get the authority to proceed with things, but it is a disadvantage because people we are negotiating with can read this. They can understand what we are offering, what we are willing to take, and all these kinds of things. It is something that is not well suited to being out in public. We need to think about this. It will come up again and again with these Counterparty negotiations.  28:51 - David Utrobin  My question is specifically for Counterparty negotiations, Institutional Vaults, and deals with partners that need to be negotiated behind closed doors. If a mandated actor were given some special authoritative permission to make deals and engage in those talks, what kind of checks would be designed around that to prevent a bad deal or bad terms from going through? Is there any real-world example of something like this?  Nikolai: At the very least, we can evaluate what the end proposal is. Ultimately, something needs to go to governance. But maybe the in-between is something that needs to have a little bit more autonomy.   Ultimately, the solution sign-off still has to happen through governance. That way, governance always has a final veto on any deal whereas the whole bulk of the deal. Is that what we have now?  Nikolai: Not quite. I do not know exactly what it looks like. I am still working this out. What the correct balance is in my head. Juan: Governance needs to approve each deal compared to Nadia, or any given actor could bring this deal to the table, and it is a done deal. We could reject it or even revoke this power from them. Until something happens, they have the power to negotiate that. Right now, that is not at all what we have. Governance is even approving every single MIP6 for RWA that is popping up. There is no way a delegate can have the bandwidth to analyze those, let alone a voter properly. It is something that we definitely should be looking into. Unfortunately, I do not have the solution, but we will think about something.    31:22 - Nadia Alvarez  Yes. It is exactly what Juan said. For example, the problem we had with the Nexo deal was when we agreed with Nexo after discussing it internally with other CUs. Then with Nexo, we had to pass through the forum, ask for everyone’s opinion, and create a signal request and follow all the steps. It was good. We got much excellent feedback on things that we did not think of in the first place, and now we are incorporating them in the next Institutional Vaults. However, it took time. It was great that the community was super receptive. You all understood that we should give it a try. If the community rejected that agreement, it was going to be complicated. Still, the possibility of being rejected and voting no for the signal request existed. That is the first problem. The second problem is the time we spend on that validation from the community. We spend many days trying to get an agreement with Nexo. Then, we have to, at least, have two weeks with the community to get feedback from them and wait until it is approved. Those are the problems, and we are trying to figure out how to solve those challenges.  33:29 - Robert  My perspective on this and for consideration to the community. We have an extensive vetting process to approve any CU facilitator as a mandated actor. When we say yes to a CU or yes to a facilitator, I hear the community say that we want you to do your job based upon the mandate you have outlined for your CU. Inside that, there is this: help me get my job done. You have set me up to do something very specific inside the DAO, and for me to do my job, I need a little bit of leeway. I am not asking for carte blanche. I am simply saying that there are some parameters that I know that I can work within. If it exceeds those parameters and goes outside, we go back to governance to ensure that we agree. For example, to build on what Nikolai was saying, one of the ways in the Collateral Engineering Services CU is that we have an enablement strategy. Very shortly, we want to reduce the friction for onboarding collateral. Suppose we have to run through the governance process every single time for a piece of collateral. In that case, that could be quite laborious, and it might impede getting collateral onboarding into the system. If we have some parameters that we can agree to say: hey, up to this debt ceiling, or up to whatever might look like from a risk perspective as well, that we can work within and then go check back in with governance when we need to exceed those parameters. I am asking the community, and maybe we need to be more precise as mandated actors. I am asking the community to place more authority on those individuals that have been designated mandate or actors and allow them to do their jobs. If we are not, we already have a process as we are seeing now to remove facilitators. I just wanted to share some perspective there. As it relates, and again for your consideration.  35:48 - Ultra Schuppi  I envision that we stop doing this on repeatable stuff. Institutional Vaults are something that we envision that will happen many times in the future. What we need to do, and this is something where we need to be a bit slower probably than what we would like to have in the actual deal-making process, is that we clarify and we need to be flexible on that, what the dimensions are that we need to cover debt ceiling spread to the average stability fee. Those working groups need to find that out. Then those working groups can propose boundaries, and within those boundaries, they can have total carte blanche. If we agree on some boundary for debt ceiling and stability fee spread, and Growth wants to close a deal, this can go directly into an on-chain executive. Assuming we follow the procedure before going through the forum, going through an on-chain poll. If we have this, we can even have a carte blanche. We do not need to be super slow on the whole process. It needs to be super clear what the dimensions and variables are and the boundaries you want to set for, essentially, the autonomy of the mandated actors. It is probably best to start with something happening many times, like Institutional Vaults. We will learn along with this and how to proceed with other things where we need more autonomy for the mandated actors.  37:49 - Payton Rose  There are several mechanisms and different ways of implementation. Through executives, we can delegate certain on-chain authorities to multisigs. That is a tool we have in our pocket, and others should be alluded to with going direct to an executive. That is a power we already give our mandated actors to do in certain situations, to a certain extent, depending on the urgency or emergency of the situation. It is a conversation about how the authority and the privileges are not clearly defined. Mandated actors have, in some cases, broad authority to recommend or reject proposals that they deem unsafe, and they put their job on the line when they do so. They could be outvoted for doing it earnestly or with bias. The system as a whole, we have yet to define clear guard rails as Tim and Robert have said that would make it easier and much more apparent to the mandated actors what they are allowed to do and what authority the governance has seated. That is probably enough talking for me. I want to be mindful of our time. We have another topic to get to, but this one is juicy.  40:00 - David Utrobin  There needs to be a single place where people can look for special authority to audit, like who has what authority across various situations. To deal with negotiation and who has authority over Oracle feed relationships or whitelisting privileges. It could be anything. As @monkey.irish alluded to earlier, our current expectations are set by the MIP41 and 39, and it is the actual mandate. However, the mandate and the facilitator proposals are the two things that inform us of what those authorities are. I am getting from this conversation that future MIP authors or revisions should aim to be a lot more explicit when explaining the authority they are requesting. I did not mean that the MIP set itself, but within specific CUs and MIP sets. I know that certain CUs and their mandates outline specific authority.  41:44 - Payton Rose  It is interesting because, with a lot of the MIPs and our bylaws, they are essentially soft authority. There are no on-chain powers unless explicitly asked for. That is a part of where the confusion and gray areas come in. We have talked about this quite a bit. Feel free to keep the conversation going in the forums and on the chat. Very exciting to engage there.   Handling Dai Recovery  42:17  HANDLING DAI RECOVERY960×540 48 KB  42:29 - David Utrobin  I want PE to come in and weigh in. I want two fronts here. In handling Dai recovery situations, and in general handling user crises or third party crises, I am curious about how we as a DAO approach this topic. There is a huge benefit to helping our users in this way, but there is also a trade-off of bandwidth—number one. If you can help the user, whether they are big or small, so far, the culture has been helpful. If we can, we do. I am curious about the volume of help requests we, PE or TechOps, or whoever has gotten over the last year. How do we handle these requests? Are there cases where we should not handle requests? That is the basis for the discussion.  43:44 - Christopher Mooney  I will kick it off by describing. The Dai token is decentralized and censorship-resistant. Governance has no powers on that token. Governance has an interesting amount of power over creating new Dai. For now, the most common cause is that people are taking Dai. Due to several UI or UX problems, they tend to get used to looking at a normal Ethereum transaction seeing the to and from, and then they usually pick the from address to send something to, but the from address, in this case, is the Dai token. Then they think they are sending Dai to their friend when they have sent Dai directly to the Dai token itself. We debated whether or not we would have that kind of protection on Dai when we were originally launching it. Because of that socialized gas costs, we decided not to prevent people from sending Dai to the contract. Since then, we have come up with other schemes that would work. But it is too late because Dai is already deployed. That is the general problem. Now there is all of this Dai accumulating in the Dai contract. In theory, this Dai can be sent to other contracts, but these are completely incapable of sending it back. I think people have sent Dai to other tokens sometimes. We can probably show that there are many Dai locked in several contracts. We can use a trick to remit this style, though it would take greater protocol changes. The trick is similar to upgrading from single collateral Dai to Dai or MCD. We would instantiate some dummy token type that probably was like dead Dai or something like that. So it is signified that it was a representative of this dead Dai. Let us wave hands and say that we would figure out how we would determine whether or not someone has a claim on dead Dai. Maybe there are on-chain mechanisms that we do permissionless. In other cases, governance may need to intervene and periodically anoint this. Once we have that dead Dai, we can mint Dai against it and give it to the original person that had lost their Dai. The downside of this is that this is the term I constantly have to say; things get a little tricky. With this collateral type, you would not want to hand out dead Dai components to everybody because there would be no way to redeem that dead Dai. You would need to scrape this special collateral type out of the accounting not to get rolled up like total Dai in an ES. We reach the end contract, then ES would work with dead Dai, and in theory, we could have a way to give Dai back to all the people that end up losing their Dai. Then we can discuss if we periodically do it around the holidays, and, once a year, as a sort of holiday gift to everybody. We end up giving them their locked Dai back. It would be too intractable for the DAO to be dealing with on a case-by-case basis. There probably needs to be some greater aggregator of a bunch of this. Unless we can do it permissionless, we may do it with the Dai token itself. That is the general case. There is an institutional case that is driving us right now. I do not think it is subject to the same problems. Maybe Sam or someone else would want to talk about that. Maybe we should discuss the general recovery of Dai that gets sent to locked contracts first, and then we can take the second more specific case after.  48:56 - Brian McMichael  There is also the issue of how do we determine who sent these. We would need a customer service CU or something like that to process and verify that the people are the people who sent them. Following back, the original sender that had sent to the contract may mean that we would end up sending these tokens to a different contract that had sent these, and it would be locked there because it could not process tokens itself. There are a lot of tricky things about it. It sounds like we can send this back to people we do not always know, and it is going to be a bear to verify who these people were.  49:49 - Payton Rose  Good points. Maybe because I am an admin, I imagine a number of the PE and other people get it too, but I am constantly in flux with DMS about: I sent my Dai here, what can you do, and that sort of thing. Even though we are not addressing it, it still requires much cognitive load. Do we want to talk about the institutional case, Sam?  David Utrobin: It has not been processed in the forum yet.    50:25 - Christopher Mooney  This almost happened. I got pulled into one of these war rooms on a hacked protocol a while back. I cannot remember which protocol. Millions and millions of Dai were potentially locked in this thing. It looked like we may end up having to have dealt with this back then. They found an owner key or something that had access to it and could move the funds.  Payton Rose: From the governance end, it is much easier for us to negotiate with protocols and big amounts of Dai and see the problem there. But we have to think about the precedent that sets if we are only returning Dai for some people and not others. There is an interesting governance question there.    51:22 - David Utrobin  For a 10 or 20 million Dai block, it makes sense to devote some special resources to help them get it back. What about the 380,000 Dai sent to the contract by 50 or 150 people who did it? 380k is a slight drop in the bucket compared to the amount of time, resources, and investment that has to happen to create a permanent solution. If sending to contract is a temporary problem, we expect wallets to block it off and things to be designed so you cannot do that. Does it make sense to handle it case by case? Perhaps do a yearly assessment and reimbursement of the smaller locks, even out of the surplus buffer. Would that be a cheaper way of solving the problem?  Christopher Mooney: One time a year, the small locks, we get a miracle distributor and allow this whole process to happen. It would be a good gift back to the community. Someone: It would be good. They can spend $300 in gas to get their 200 bucks back.   In an ideal world, we do it through a push mechanism, where it just shows up, and we pay the gas.  53:15 - David Utrobin  What other user blunders and issues besides sending to contract addresses and accidentally sending to the wrong place have we experienced? Are there other cases where PE has stepped in to help a user?  Christopher Mooney: The Arbitrarum Oasis thing. It was not Dai. It was collateral. It was a very happy accident that we were able to fix. We controlled the address that deployed the original ds proxy factory. We could reproduce that same chain of hashes that led to the same contract where the funds ended. We were able to recover that user’s funds. That is one other big example. We put the working on that. It is a lot of work. We want to do this as efficiently as possible. Sam: For L2 DAI, we can manually pull that out. L1 DAI is sitting in an escrow contract in governance’s full control. If somebody burns their L2 DAI, we can potentially recover that without any special mechanism. Christopher Mooney: Right, if it is the burn mechanism. Sam is talking about a hypothetical case worth paying attention to. What happens, and this is for anybody on PE if you want to conjecture, if it is not the burn function called but rather Dai that gets sent in locked in a contract on L2? Do we have a recovery path for Dai like that? Sam: On L2 DAI, we blocked sending to the contract itself and addressed zero. It depends if they are accidentally sending it to some other contract. It has to be provably lost. Brian McMichael: He meant that if L2 freezes up and Dai is irrecoverable because everything on the chain is lost, can we recover that to settle the balance on the mainnet? Someone: That should be super easy, right? We could recover it in theory because we have got all the Dai in the bridge. Someone: It cannot get locked because the whole point of L2s is that you can operate even when the L2 goes down. People could exit themselves. Brian McMichael: What about certain sidechains like Matic or xDai? L2 is not sidechains.    56:27 - Christopher Mooney  If there is an incorrect state transition and no fraud-proof is submitted within the seven-day window, you cannot make any assessments about the state if that does not happen. The roll-up is dead in that case. Everything is lost.  Brian McMichael: We have to assume that for any secondary solution, any wormhole solution that can be completely nuked?    57:04 - Christopher Mooney  I was talking about the case of somebody aping into a buggy protocol on an L2 and getting their Dai stuck in that protocol, where we can probably say it is stuck in that protocol on L2. The downside is that the Dai token on L2 would have a total token balance. It should match the bridge balance. If we move Dai out of the bridge to give it back to users on L1, that is no longer an invariant that would end upholding. There is some interesting accounting there.  58:06 - Paper  Does that mean that law enforcement agencies can force us to act upon Dai on Layer2s?  Christopher Mooney: Paper’s question is: Can law enforcement force governance to act in any way possible? Can they compel governance to do anything? Sam: That is what the ESM is for. If an action went through where the law enforcement is just going to start stealing people’s stuff, that would be hard to do. They would have to get a majority vote and then get it through, and then ESM would not be triggered. It seems unlikely. There are lots of worse things you can do.    58:56 - Christopher Mooney  Someone could attempt to drag Maker holders into that dispute. A government could try and get Maker holders to act. Since Maker holders are a swarm of anonymous token holders, anybody trying to force compulsory action would probably want to start with honey rather than vinegar. In the end, there are lots of protections against censorship and compulsion of MKR holders or in the protocol. That is why it is a DAO. It goes back to the first sort of discussion topic. It is way more efficient to run an organization and have business relationships as a major company. There is a reason corporations have evolved to have this sort of hierarchy structure. DAOs are our response in a way against centralization. They respond to certain regulatory climates and prevent actions in certain areas. That is why you have doubts.  1:00:24 - Payton Rose  That loops back to the first conversation about optimistic governance actions. In an optimistic situation, you could compel an actor. Then it would go through unless Maker holders took action.  Christopher Mooney: This is why in the optimistic case, you still need the DAO to have veto power over actions to prevent the optimistic case. It is maybe a talking point we did not discuss. Think of it like the DAO is a school of fish. Except that the school of fish can take the shape of whatever wants to be. When a predator attacks one of its appendages or even its core, the school of fish has some invasive predator evasion technique. As long as we always revert to this amorphous blob, a school of fish, we will be resistant to predators. Predators, in this case, maybe centralization. It may be censorship. I am not trying to make it sound like the DAO is a criminal organization. Just so everyone knows, the DAO is a criminal organization in North Korea, and the DAO is a criminal organization in China. There are regulatory regimes where the DAO would not be allowed, or let us say, a single company acting the way the DAO does would not be allowed to act.    1:01:53 - Someone  We also do not have the overwhelming majority of our customer base in those countries. It was hypothetical because it was new information to me. That is all. We do not have to take up all day going in circles about it.  Brian McMichael: We do not choose where our customers are either. Christopher Mooney: That is the permissionless aspect. That is why it is important to be permissionless.    1:02:47 - David Utrobin  What would the veto power look like if Maker were to move towards a more optimistic governance model? Who would have it? Is it something like you need like 1000 MKR to veto? Because now you need to block the vote via your actual voting weight. It is not an efficient way to veto. What are the downsides of Maker were to do optimistic governance?  Christopher Mooney: Any decisions or actions that require an executive vote mean that we are not framed to do optimistic governance. MKR holders will always have to instantiate some change in the protocol in that particular case. If it is an arrangement outside of that or a parameter that we do not need governance for, maybe a pole with a low bar threshold or something for people to veto, that would probably be sufficient.    1:04:14 - Brian McMichael  We have to consider that Dai recovery can be good for the protocol. Not just the users. Having liquid Dai on the market is good for the peg. If somebody loses 10 million, 100 million, it might be in the DAO’s interest to recover that just so that we do not get back into a situation where we are pushing the peg up because there is not enough Dai.  1:05:04 - Christopher Mooney Nikolai said an unintended consequence of having this recovery flow for Dai. In the traditional financial system, people can usually claim their credit card and get their money back if they go and spend their credit card on some shady website or something. We do not want to create this weird second-order effect where people are more likely to ape or not scrutinize where they are sending their Dai. As Marianna used to say, we do not want to incentivize sticking your Dai in crazy.  Comms when Affecting Stakeholders  Open Discussion 1:06:18 - David Utrobin  When we talk about gas funding, do we mean specifically for Oracles, or are we also talking about the gas rebate program for voters?  Payton Rose: It could also just be for CUs in general. Many of us have to use Eth for things, and we buy them. Long and I, for instance, when we submit polls, we have to use gas, and we refund ourselves in Dai, which we then have to swap. We spend a decent percentage of that chunk just for the transaction fee to swap it. It feels like there would be a more efficient way to do that. I do not know what aspect of the chat was called for. If someone wants to redirect your flow here, please.    1:07:05 - Someone  Some of us had been interested, maybe trying to separate the Oracle gas proposal into two. One for the actual Oracle gas that is looking forward and one for figuring out this whole amount that would be repaid to the foundation, considering that it covers a period that has not even completely elapsed yet. So anyway, I just wanted to make maybe that I can get the ball rolling. I do not know if MakerMan is listening.  Payton Rose: From the governance perspective, the person proposing would have to divide it up and do two separate ones.    1:07:57 - Someone  Since MakerMan does not have a mic. Some of the concerns I had, were number one: getting some documentation, not just about costs, because that is a pain in the butt, and that does need to be done probably for 3 million. However, who is the Counterparty? What were the terms? We probably should have been thinking a little earlier about where the gas money is coming from. I would like to see a little more detail about all the specifics.  1:08:39 - David Utrobin  I want to note that Nik Kunkel is on vacation and is not on the call. Mark Andre from the Oracle Team is here. Maybe somebody else from the team.  1:09:09 - Payton Rose  I see a comment on the sidebar. He is going to ask, like Paper, to break the costs up from retroactive and forward. Also, he is trying to see who is being paid when this refund goes through. Nik is not here. He is the proposal author, and the way our system works is that who is proposing has the right to, if it follows the rules, for the proposal to go on-chain. People can make competing proposals, which would be a fun governance situation to find themselves in before moving on multiple sets of the same object.  1:09:50 - Someone  The question of who the DAO would be paying is probably a good one. We should know to whom we will send 3 million. You wonder why is a nonprofit foundation exists to bootstrap Maker DAO, asking MakerDAO to pay $3 million. It is not to say that it is inappropriate, but I would like to know a little more, especially since, presumably, it is dissolving. And whatever surplus assets are, they are likely being moved into the old Maker ecosystem growth Holdings Company, a Cayman company, not like a foundation known as UDHC today to everybody. We would like to have a little more clarity about why the DAO needs to pay them $3 million.  1:10:58 - Someone  Was it a loan? What does it matter to whom it goes back? You get money, and you pay it back.  1:11:05 - Christopher Mooney  I have some more details about this, Paper. During the handoff stage, from the foundation to the community, it was unclear that Oracles would have the operating budget to continue to operate the Oracles. The foundation had made a gentlemen’s arrangement with the Oracles’ team and gave them enough funding for gas to pay for running the Oracles during that transitionary period. The gas calculations for Oracles were very difficult at that time. They did not have the actual amount that they were spending offhand. PE was easier to look at our deployer addresses and see how much gas it would cost. It was non-deterministic, and there are more addresses to look at for Oracles. They do have that calculation now. It is just a loan from the foundation and probably harkens back to the original topic, which is how much autonomy mandated actors or teams have here. Regardless of what the foundation does, the DAO should honor its debts. If the DAO was given a loan to run the Oracles, we should pay the loan back just so that people know that they can do business with us. However, I do think Paper brings up some interesting points. It goes back to that original discussion about exactly how much autonomy teams should have; taking on loan agreements that the DAO is responsible for might be a limit of that, or maybe there is a monetary limit. It may be a one-off anomaly because it was part of the transition.  1:13:05 - Someone  If gas was spent, then something probably should be owed. If a for-profit venture fund owns parts of lots of affiliated entities that the DAO pays money to, if they are part of this ecosystem, maybe there should be some kind of cost split. I would like to see a wider discussion. I am not saying we absolutely should not pay them 3 million. Still, it strikes me as a little weird that you take a foundation that existed to get Maker DAO up and running and then say, Maker DAO, pay us some money to help fund this private for-profit entity.  1:14:06 - Brian McMichael  I would suspect that that loan helped Oracles’ CU leave the foundation sooner than they might have otherwise been able to without it. I am not defending it; it is probably an executive decision on the facilitator’s part. With Mooney and others, it is a debt that we would have had to have paid either way.  1:14:35 - Someone  Oracles has a lot of excess budgets right now. Are we still using borrowed gas?  Someone: Gas prices are expensive, really expensive.    1:14:55 - Andrew Burban  Oracles need a huge buffer for the guests. The other night, I wanted to do one transaction that was $10,000 to do a single click, and I was like: I am going to pass on this right now. The safety factor of three makes sense to me. Any unused funds roll over.  1:15:19 - Someone  I would like to clarify one specific element. The Oracle gas costs are still being paid by the Maker Foundation today, and it will remain the case until the gas funding MIP gets passed. That is separate from the Oracle CU funding.  1:15:54 - Someone  I see 1.2 million in undrawn streamed Dai, and there is whatever the emergency fund was.  The CU cannot hire as many people as we would hope. There is a budget surplus. Eventually, we will be drawing some funds from the DssVest contract, but until we have spendings to do. The idea is that, at the end of the year, any surplus is returned or accredited, or I am not sure what the exact formula will be. The difference between our actual spent and what sits into the DssVest is that we did not hire as many contributors as we hoped.   Could that be used to pay for gas until our January vote and disbursement instead of continuing to borrow?  1:17:14 - Payton Rose  The other issue is requesting funds for specific purposes. You generally do not want to turn around and use it for different ones.  1:17:24 - Someone  The loan is interest-free, so it does not matter.  Paper: It seems that it is to be held over here. It is being bundled into a must-pass budget item that is coming up.    1:17:45 - Andrew Burban  I feel the real issue is that there was no transparency around the original establishment of this loan. It is not even clear who the counterparty was. We are saying it is the Maker foundation. But there is no agreement on the form of the DAO and the Maker Foundation, as specified by some legal entity agreeing, and there was no executive vote to approve the taking of this loan. It can be a one-off thing, but it would be good to have some documentation produced as to what the terms and agreements were in the first place.  Someone: Maybe it better to chat about this when Nik is here.    1:18:38 - Tim  If we take this discussion to break things out, it would be good to have the person bringing the proposal on that discussion. The second thing is a call for transparency that is valid and probably easily resolved. If we can get those terms established, it seems like it was an essential decision to make, and they just made it, and it was for the good of the protocol. It is best to assume that there is nothing malicious. Some things need to be more clear. Daylight clearing all hills and such.  1:19:31 - Christopher Mooney  I have one quick one on a different topic: there is a hard fork for Ethereum in the next couple of hours.  1:20:03 - Prose11  Prose11: Thank you to everyone for joining us today. We appreciate the discussion and all the participation. Let us keep it going in the forums and our Discord. There will be one more GNR call next week for 2021. I look forward to seeing you there, and we can wrap up the year in style. Thanks, everyone.  Suggestion Box  Common Abbreviated Terms CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal OSM: Oracle Security Module LR: Liquidation Ratio RWA: Real-World Asset RWF: Real-World Finance SC: Smart Contracts Liq: Liquidations CU: Core Unit  Credits  Artem Gordon produced this summary. Kunfu-po produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/PjfAEZHdLEw?t=148",
                        "https://youtu.be/PjfAEZHdLEw?t=354",
                        "https://youtu.be/PjfAEZHdLEw?t=614",
                        "https://youtu.be/PjfAEZHdLEw?t=864",
                        "https://youtu.be/PjfAEZHdLEw?t=3966",
                        "https://youtu.be/PjfAEZHdLEw",
                        "https://youtu.be/PjfAEZHdLEw",
                        "https://youtu.be/PjfAEZHdLEw?t=148",
                        "https://vote.makerdao.com/polling/QmYuK441?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmdzwZyS?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmPBRpCW?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmVTiToU?network=mainnet#poll-detail",
                        "https://youtu.be/PjfAEZHdLEw?t=354",
                        "https://forum.makerdao.com/t/weekly-mips-update-65/12033",
                        "https://youtu.be/PjfAEZHdLEw?t=614",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-2-9-2021/12119",
                        "https://www.youtube.com/watch?v=e9E7NDumWQE",
                        "https://youtu.be/PjfAEZHdLEw?t=864",
                        "https://youtu.be/PjfAEZHdLEw?t=984",
                        "https://youtu.be/PjfAEZHdLEw?t=1025",
                        "https://youtu.be/PjfAEZHdLEw?t=1117",
                        "https://youtu.be/PjfAEZHdLEw?t=1506",
                        "https://youtu.be/PjfAEZHdLEw?t=1623",
                        "https://youtu.be/PjfAEZHdLEw?t=1677",
                        "https://youtu.be/PjfAEZHdLEw?t=1731",
                        "https://youtu.be/PjfAEZHdLEw?t=1882",
                        "https://youtu.be/PjfAEZHdLEw?t=2009",
                        "https://youtu.be/PjfAEZHdLEw?t=2148",
                        "https://youtu.be/PjfAEZHdLEw?t=2269",
                        "https://youtu.be/PjfAEZHdLEw?t=2400",
                        "https://youtu.be/PjfAEZHdLEw?t=2504",
                        "https://youtu.be/PjfAEZHdLEw?t=2537",
                        "https://youtu.be/PjfAEZHdLEw?t=2549",
                        "https://youtu.be/PjfAEZHdLEw?t=2624",
                        "https://youtu.be/PjfAEZHdLEw?t=2936",
                        "https://youtu.be/PjfAEZHdLEw?t=2989",
                        "https://youtu.be/PjfAEZHdLEw?t=3025",
                        "https://youtu.be/PjfAEZHdLEw?t=3082",
                        "https://youtu.be/PjfAEZHdLEw?t=3195",
                        "https://youtu.be/PjfAEZHdLEw?t=3387",
                        "https://youtu.be/PjfAEZHdLEw?t=3424",
                        "https://youtu.be/PjfAEZHdLEw?t=3486",
                        "https://youtu.be/PjfAEZHdLEw?t=3536",
                        "https://youtu.be/PjfAEZHdLEw?t=3624",
                        "https://youtu.be/PjfAEZHdLEw?t=3713",
                        "https://youtu.be/PjfAEZHdLEw?t=3767",
                        "https://youtu.be/PjfAEZHdLEw?t=3854",
                        "https://youtu.be/PjfAEZHdLEw?t=3904",
                        "https://youtu.be/PjfAEZHdLEw?t=3978",
                        "https://youtu.be/PjfAEZHdLEw?t=4025",
                        "https://youtu.be/PjfAEZHdLEw?t=4077",
                        "https://youtu.be/PjfAEZHdLEw?t=4119",
                        "https://youtu.be/PjfAEZHdLEw?t=4149",
                        "https://youtu.be/PjfAEZHdLEw?t=4190",
                        "https://youtu.be/PjfAEZHdLEw?t=4258",
                        "https://youtu.be/PjfAEZHdLEw?t=4265",
                        "https://youtu.be/PjfAEZHdLEw?t=4385",
                        "https://youtu.be/PjfAEZHdLEw?t=4446",
                        "https://youtu.be/PjfAEZHdLEw?t=4475",
                        "https://youtu.be/PjfAEZHdLEw?t=4495",
                        "https://youtu.be/PjfAEZHdLEw?t=4519",
                        "https://youtu.be/PjfAEZHdLEw?t=4554",
                        "https://youtu.be/PjfAEZHdLEw?t=4634",
                        "https://youtu.be/PjfAEZHdLEw?t=4644",
                        "https://youtu.be/PjfAEZHdLEw?t=4665",
                        "https://youtu.be/PjfAEZHdLEw?t=4718",
                        "https://youtu.be/PjfAEZHdLEw?t=4771",
                        "https://youtu.be/PjfAEZHdLEw?t=4803",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.704586808418655
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#5",
                    "likes": "1",
                    "time": "09/12/2021-23:15:05",
                    "content": "This full call is now available on the MakerDAO Youtube channel:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "11/03/2022-05:15:49",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-172-thursday-december-16-17-00-utc/12217",
            "title": "Governance and Risk #172 - Thursday, December 16 17:00 UTC ",
            "index": 12217,
            "category": [
                "Discontinued Categories",
                "Governance and Risk Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "1",
                    "time": "15/12/2021-03:04:54",
                    "content": " gr-meeting-purp1920×442 23.8 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved, and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, financial or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment, financial or other advisory services.  Call Information The zoom waiting room will be on, and a password is set to: 748478, please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-12-16T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit : Hosting, Introduction, Agenda.  @gov-comms-core-unit : Slides   Governance Round-Up   @prose11 Poll + Executive Status  @blimpa - MIPs Update  @Artem_Gordon Forum at a Glance   Selected Discussions  Newcomers, Anons, and Sock Puppets How does the Maker community handle engagement from questionable sources? Differentiating malice or trolling from controversial but legitimate proposals. Is a proposal ever considered illegitimate, assuming it fulfills all the requirements of the proposal type? Is being hands-off and relying on MKR voters and delegates to judge for themselves enough? Do authors of proposals matter?   Core Unit Proposals & Dispute Methods What are the methods for stakeholders to engage in disputes or publish complaints regarding Core Units? Is there a sliding scale of possible actions we could outline as a DAO? Is it reasonable to restrict third parties from submitting MIP 39, 40, & 41 subproposals on behalf of Core Units? Is offboarding a Core Unit or its facilitator unavoidable public drama? How would you design a Core Unit offboarding proposal process that is less publicly exposed?   Other Discussions and General Q&A  General Q&A Ask us stuff.   Open Discussion List of interests: D3M spread management Market making Altering Community Greenlight Polls process. Institutional Vault Deals, Delegate Compensation Ways we can improve governance Call attendees to decide. Help us by using the anon question box below   Leave your questions in our anonymous question box and we’ll do our best to bring them up during the call. ",
                    "links": [
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1QV_grgGYpwTQZjLI7UJG5aOQ8olUFmRWJhTT81UmFqs/edit?usp=sharing",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.381944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "2",
                    "time": "15/12/2021-03:43:03",
                    "content": " G&R #172 Snippet This snippet includes Governance, MIPs, forum updates, and Core Unit team discussions from the MakerDAO Governance and Risk Call #172.  General Updates  Votes Executive:  Last Week’s executive - PASSED & EXECUTED  Changes to wstETH-A Debt Ceiling Instant Access Module and Liquidation Parameters. Changes to MATIC-A Debt Ceiling Instant Access Module. Previously approved MKR Vesting Streams will be replaced with MKR sourced from the Protocol Treasury (Pause Proxy) instead of minting new MKR.   No Executive Proposal Anticipated until Jan. 7th at the earliest  Recognized Delegates should keep a batphone handy however    Polls: 3 Weekly Polls:  Recognised Delegate Compensation Trial Performance Modifier - PASSED  DAI Direct Deposit Module (D3M) Net Rates Spread  44,843.58 MKR YES 32,916.98 MKR NO    DAI Direct Deposit Module (D3M) Debt Ceiling Targeting  57,501.47 MKR for 30% Real DAI Supply 20,210.03 MKR for 20% Real DAI Supply 49.06 MKR Neither   2 Active Greenlight Polls - Vote Ends Monday, December 20th  aUST (Anchor TerraUSD) G-UNIv3-DAIUSDP (Gelato UniswapV3 DAI-USDP LP Token)     MIPs Weekly MIPs Update #66  3118×1023 202 KB   As per MIP51c4: Calendar Exceptions, there will be no Monthly Governance Cycle in December, i.e., no Formal Submission Window and no Ratification Polls.   Forum at a Glance Forum at a Glance: December 9 - 16, 2021  Team-led Discussions  Newcomers, Anons, and Sock Puppets  How it’s currently handled  Not all stakeholders have longstanding and active accounts that will be more seriously recognized or responded to. Signal Polls are not civil-resistant because people can create multiple accounts and abuse the community trust process. Forum allows newcomers to freely engage,  Has “Trust level” functionality that we don’t rely on too much. GovAlpha makes a note of it when there is suspicious activity on signal votes. Censorship or over-moderation has always been avoided. What are policies to consider for better controlling malicious or trolling behavior?   There’s a lot of factors at play; threads, signal requests, internal communications, etc., and the moderation of them. A high-quality proposal is objective and can be given by a person who has never posted before; we cannot close the door to outside help and ideas. In the non-crypto world, we accept and can fight the accuser.  In the DAO world, it’s difficult due to the natural environment of anonymity and unknown actors involved.     Is a proposal ever considered illegitimate?  Spamming proposals will be flagged as illegitimate.  Same response to proposals that stir the pot on sensitive issues in a negative direction.   Issues with the anonymous culture should be responded with the least negatively affecting action to keep the trust and activity of the remaining anonymous community.   Core Unit Proposals & Dispute Methods  Offboarding vs Correction, and Dispute Methods  2245×1267 191 KB   the DAO heavily decides PECU roadmap Core Units serve at the pleasure of MKR holders, which influence the drive of those CUs. Oracles appreciates defined steps and methods. Something significant like an offboarding proposal should be put under those defined steps and methods.  Proposals such as budgets and others at that level should be kept natural (as we have right now). Facilitator vs. community method for budget proposals is best. Core Unit MIP should be redefined with additional guarding processes.   Is there any good reason for someone outside of a CU to submit a budget proposal?  This helps prevent a Core Unit from gaining too much power; the community will dispute against it.   One idea is for GovAlpha to have a set of hard/soft rules for significant proposals, which can pass/block them from going onchain. We need to formalize permission granted to Core Units and propose anything within consent. Anything outside of these cant is left as is.   Submitting proposals on behalf of another CU  Lot of controversy on this subject from both sides. Community submitting proposals on behalf of CUs cause additional operational overhead and difficulty.  However, we don’t want to portray that we fight against criticism to the community.   How do we criticize Core Units more efficiently and operationally?  Commonly recurring proposals should be restricted to predetermined permissions. Eventually, engagement in budget proposal disputes will die out over time.    ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmSgCHbt",
                        "https://vote.makerdao.com/polling/QmNi4qtG",
                        "https://vote.makerdao.com/polling/QmPBRpCW?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmVTiToU?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/weekly-mips-update-66/12190",
                        "https://mips.makerdao.com/mips/details/MIP51#MIP51c4",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-9-16-2021/12240",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/66"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.418014175367116
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/12/2021-03:43:18",
                    "content": " Semi-transcription  Episode 172: December 16th, 2021  Agenda   00:00: Introduction  01:36: Votes and Polls  05:58: MIPs Update  11:38: Forum at a Glance  16:48: Discussion - Newcomers, Anons, and Sock Puppets  40:10: Discussion - Core Unit Proposals & Dispute Methods   Video https://youtu.be/qEcUDkCNQB8?t=2  Introduction  Agenda and Preamble  Payton Rose 00:00  Hello everyone and welcome. This is the 172nd Governance and Risk call here and MakerDAO. It also happens to be our last planned Governance & Risk call for 2021. My name is Peyton, I go by Prose11 online, and I am one of the governance facilitators here. Very happy to be moderating this call. I’m joined here by many awesome Maker folks, both those who work in the community, those interested in it, and kind of everyone in between. Thank you all for coming out. And thank you, if you’re watching this later on the record, that is a good spot to remind our participants that we are recording this call. So please try not to speak over one another. With that said, we do encourage participating. We want to get your questions and comments. Therefore if there is a pause in the conversation, feel free to hop on the mic. If you’re not comfortable asking your question yourself for whatever reason, you can drop it in the chat. And I’m happy to do so for you. I think that mostly covers the housekeeping rules. We do have a bit of an agenda to get through today. I’ll be guiding us through. As always, we’ll start with our governance Roundup until we move on to our community discussions. We will have an open discussion portion if there’s time left after those. That’s where if you have anything not related to what we’ve been talking about, you can save it to the end. Or if anyone mentions anything in chat, that might be a good topic to close out on. I won’t bring it back up then. Without further ado, we’ll get back to what’s happening in the world of governance and our votes in particular.   General Updates  Votes  Payton Rose 01:36 Executive:  Last Week’s executive - PASSED & EXECUTED  Changes to wstETH-A Debt Ceiling Instant Access Module and Liquidation Parameters. Changes to MATIC-A Debt Ceiling Instant Access Module. Previously approved MKR Vesting Streams will be replaced with MKR sourced from the Protocol Treasury (Pause Proxy) instead of minting new MKR.   No Executive Proposal Anticipated until January 7th at the earliest  Recognized Delegates should keep a batphone handy however    Polls: 3 Weekly Polls:  Recognised Delegate Compensation Trial Performance Modifier - PASSED  DAI Direct Deposit Module (D3M) Net Rates Spread  44,843.58 MKR YES 32,916.98 MKR NO    DAI Direct Deposit Module (D3M) Debt Ceiling Targeting  57,501.47 MKR for 30% Real DAI Supply 20,210.03 MKR for 20% Real DAI Supply 49.06 MKR Neither   2 Active Greenlight Polls - Vote Ends Monday, December 20th  aUST (Anchor TerraUSD) G-UNIv3-DAIUSDP (Gelato UniswapV3 DAI-USDP LP Token)     MIPs  Pablo Weekly MIPs Update #66  1660×940 116 KB   3118×1023 202 KB   As per MIP51c4: Calendar Exceptions, there will be no Monthly Governance Cycle in December, i.e., no Formal Submission Window and no Ratification Polls.   1680×928 99.2 KB   1660×918 168 KB   I did get a request bubble for our dates going into RFC. With the new month and the break coming off. I just dropped the link to your forum. I don’t know if you want to remind people when they need to get their edits in before we break for the rest of the month.  Pablo: Yes. For the upcoming Governance Cycle, the formal submission window will open on January 3rd and will remain open until Wednesday the fifth. The last day for modifications for the proposals that can make it into that cycle is December 29th. I don’t know if that’s exactly the question or not. Or are we talking about the upcoming February’s governance cycle? Payton: That was my question. But yeah, why don’t we let people know if they are looking to get a proposal in by February when they would need to post that as well? David: I wanted to mention that the votes and important dates calendar also has all this information. It has a final date for freezing, a final date for posting, pretty much all the info that Pablo makes available on that thread that Payton put in the chat. Pablo: As for February, yes, the latest submission date for proposals in RFC should be January 12th. Again, the link that Payton shared on the chat is very useful. It has all the important MIP-related dates for 2022. I suggest you guys check it. If you still have any doubts after checking it, please reach out to me, and I’ll try to make it clear for you.     Forum at a Glance  Artem Gordon Post: Forum at a Glance: December 9 - 16, 2021 Video: Forum at a Glance: December 9 - 16, 2021  Team-led Discussions  Newcomers, Anons, and Sock Puppets  How it’s currently handled 16:48  1698×922 187 KB   This is a conversation about newcomers and anons and sock puppets. This is coming up somewhat due to recent activity that we’ve seen on the forums. Both with newer accounts, proposing on behalf of other core units, participating in signal requests, etc. This discussion is about how the Maker community handles engagement from questionable sources? Do authors of proposals matter? How do we differentiate community malice or trolling from controversial but legitimate proposals that are perhaps posted by people who want to preserve their privacy? Also, how do we differentiate Sockpuppet accounts from newcomers who are potentially real stakeholders who just don’t participate very actively?   1692×952 177 KB   I prepared a few prompts. The first one talks about how we’ve historically handled it and basically how it’s currently being handled. The forum has been designed to allow newcomers to engage freely. Discourse at the forum platform that we use has a trust-level functionality. We don’t rely on it too much. But we use it for a couple of different sections in the forum, for example, media inquiries. You have to be a trust level three or higher to post the media inquiries. In order to post a thread, I believe you have to be in a specific group, being in the Media Group, which requires a level of verification from our team. But for the most part, the forum doesn’t have limits to newcomers. Usually, newcomers are pretty free to post whatever they want. And the reason for that is that we recognize that not all stakeholders have long-standing active forum accounts. There’s precedent for newcomers to come in the forum and post very detailed or serious concerns. How do we currently handle it? I know that GovAlpha makes a note of it whenever there is suspicious activity on signal polls, for example. One concern that was raised was how signal polls are not civil resistant. Anybody can create a million forum accounts if they want. They can cultivate them and make them seem legitimate over time, as we’ve seen on other platforms and other cases. But ultimately, signal requests are the first step of the governance consensus process here at Maker. But really, nothing happens until a Governance poll. And then, eventually, an executive vote happens. MKR holders still have an ultimate say on votes and decisions. However, we do want to have a higher integrity signal process. At the moment, all that we do, all that GovAlpha does is make a note of it when there is suspicious activity on signals. Though, by my understanding, that hasn’t happened very much. And Payton can confirm or deny that and bring me into reality here.  20:44  Payton Rose: Yes, it’s one of the checks we run before putting up a signal request. Right is, before we put up a single request to the polling stage rather, is just checking the votes and seeing if it’s close? If so, are potential suspicious votes causing the margin of error? And if so, we post to the community. We can extend the poll, ask for more participation, call out potentially questionable behavior. But generally speaking, there’s not a ton of participation in signal requests. It’s usually between 20 and 40 votes, and most of them are known entities. Your assessment is accurate that it is very rare, but you know, it rises to the level of needing to alert the community to it.  21:35  David Utrobin: Also, from the start, I believe the Maker community, its forum admins, and moderators have always valued freedom of speech and your ability to have freedom on this communications channel. I know we’ve always treated censorship or over moderation delicately. We don’t want to censor if we don’t need to. We don’t want to over moderate if we don’t need to. And ultimately, we want to rely on the natural mechanisms in place in the community for weeding out weird behavior and weird edge cases like this. But ultimately, does it matter who brings up proposals, for example? Because, the way I see it is, if it’s a low-effort proposal, it naturally gets treated that way. But if it’s a high-quality or well-reasoned proposal, even if a total sockpuppet account posts it, I assume that people treat the proposal for what’s in it rather than who posts it. And I’m curious what people’s thoughts are on that? Or in general on this topic? I’m sensing a lack of strong opinions here because it has been somewhat non-issue. It’s just that its head has been showing in a few small cases, for example, on the case Oracles Core Unit budget just now. As well as what’s another case? Nick, do you have any thoughts that you want to share about this whole topic?  23:50  Niklas Kunkel: Sure. As you said, David, It hasn’t been that big of an issue. And I don’t want to make it about the Oracle proposal because I think that’s very, very specific. Because it goes much broader than that. Right? It’s not just who makes proposals; It’s also the signal request; it’s who gets to vote in the signal requests. We’ve seen instances of other communities come and raid us. Where they all just make a bunch of accounts that day. And then they try and sway the community sentiment to be super bullish on whatever their collateral type is. We saw the chainlink organism trying to convince the community that chainlink Oracle’s were the way to go for MakerDAO. I think we’ve dealt with them on an ad hoc basis. And so, it was a very clear-cut situation. And so It wasn’t very controversial or anything when we heavily moderated them. But, I also think that many of these situations will not be as clear-cut. David, for example, you mentioned the quality of a proposal, and the quality of proposals is a very subjective type of thing. You could have a high-quality proposal coming from someone that has no reputation to post something. And so I don’t know if the answer is that a fresh account can’t post a proposal because you could have a super high-quality proposal just coming from someone who’s never posted before, like a lurker, right? There is some kind of balance that we need to strike here. But I think the important thing is that we just define these things ahead of time. When we do this kind of moderation in the future, then it’s not as if we’re just making up the rules as we go. There is a predefined set of guidelines that the communities come up with that we can then point to, and it doesn’t seem like there’s some internal committee that’s calling the shots; that’s the worst of both worlds. We definitely wouldn’t want that.  Payton Rose: There’s a lot of good chat on the side here. I will encourage people to raise their hands if they don’t want to hop on the mic. But one conversation, in particular, I wanted to highlight from GovAlpha’s perspective, is this conversation of not being sure if someone is a sockpuppet, right? And that’s one danger we see in forcing us to decide what accounts are legitimate or not.    29:24  David Utrobin: One reason why I was bringing up this question of “do we just rely on the proposals themselves and not care about who’s submitting them?” And I know that that’s a very specific part of the conversation. There is also the other part of the general influence that Nick brought up just by general participation and random discussion threads, etc. But for proposals specifically, I asked it in that way because we operate in a community where we respect pseudo-anonymity, anonymity, full identity exposed people; we accept people from all walks of privacy. And so, I see in the chat one thing that Seth is saying. In the real world, you have a right to face your accuser. But it’s made a little bit muddy in our world because we’re accepting of people who choose to cloak their identities or, you know, have an internet identity, right. I’m curious; I don’t see a reasonable way that we could require - I don’t even think we should - people’s identities, that’s why I’m trying to see what the culture is around, not caring whom the accuser is just caring about what it is that they’re accusing you about—just some of my thoughts there.  Kirk Hutchison: I think an important thing to emphasize is when there is some kind of anonymous, unknown actor, or you just want to be consistent at all times, emphasizing the strength of the arguments on an objective basis from publicly known facts and things that they say that are unsubstantiated, or can’t be corroborated, just kind of have to be thrown out. The big complaint or concern here is that people with conflicts of interest will use anonymous accounts to mask their conflicts of interest. But, at some point, you just have to fall back to the objective claims? And, you know, people who don’t seem to be making objective claims will simply have to be ignored. David Utrobin: Yeah, and I think that that’s where the action of the community and voters has been. It’s been like, “this vote is annoying. I have to think about it”. But, whatever the objective claim is, it’s vaporware. I’m going to ignore it like that. I’ve seen that sort of sentiment for sure.     Is a proposal ever considered illegitimate?  Prompt 21658×926 146 KB  32:35  David Utrobin: The second prompt that I have for this conversation is whether or not a proposal is ever considered illegitimate. Assuming it fulfills all the requirements of the specific proposal or sub-proposal type. I already kind of asked this in a way, does the author of the proposal matter? And how much energy should be given to lower quality or spam or unsubstantiated proposals? We talked a bit about all these things. So it’s pretty cool. But yeah. I’m curious what other cases a proposal would be considered illegitimate? And in the next topic, there’s kind of a cool connection. But yeah, I’ll leave that for them. Also, I want to be mindful of time. So Payton, if we’re like halfway through the hour, and we need to move on to the second discussion topic, just let us know  Payton Rose: We’ll give it a few more moments. I was prepared for the arguments to mostly be on the other side. So most of my notes support the more anonymous because I figured we do have a clear bias as people being comfortable here and talking on the call, for the most part, and identifying Core Unit people. But one risk that we haven’t talked about and is worth considering is the ability to spam proposals. The ability to sabotage, essentially, through this leniency. If you’re a competitor, or whoever doesn’t like Maker or DeFi, or whatever your particular grief is, it could become very easy to spin up an account and make proposals for the sole purpose of forcing the community to take time to respond to them. David Utrobin: Seth said it well in the chat: punish with the process.    34:28  Christopher Mooney: I think it’s like any spam problem. I don’t think we need to borrow trouble yet. But if that does end up happening, we can always gate things on MKR or something like that. The forums could validate that you hold some amount of MKR. I don’t think that we should be pre-optimized for that, by the way. I think we should do whatever we can to maintain an anonymous culture. Maybe that should be the general rule. Anytime we run into a major problem with the anonymous culture, we should seek the least inhibiting way to flourish that culture. But without outright banning anons.  35:27  Brian McMichael: We already have embraced anons. We’ve got Longforwisdom, who don’t think anyone here knows who he is. But he’s built a reputation. And there’s this bicameral type of governance that we have here with Maker plutocratic weight. And then, a social layer allows people without wealth to participate in governance meaningfully. But, in general, you’d want those people to have a social stake. We care about a stake in Ethereum. And at a social level, we should care about social stake. Ideas do not exist in a vacuum. Especially anything regarding financial considerations. There are conflicts of interest; there are competing Core Units and competing protocols. And, we want to understand what those are to have the full perspective around a proposal. And again, anything involving finance, you need to follow the money. And if you can’t follow the money. I don’t know how we can enforce that. But maybe just something for people to keep in mind when looking at a proposal; how much social credit does this person have? I don’t want social credit scores. But there is a very subjective approach that we can take to viewing these things. As I said, there’s nothing that says that Maker can’t be a community of anons. I would like to be an anon myself, but I’ve spent many years and, many of us have spent many years using our own identities and building that reputational stake in the DAO. When a new account gets spun up, and it just comes in to create a post that seems to be stirring the pot, I guess, for me, I’m going to take the side of the entity that has the greatest social stake, that has the reputation of the community, then just taking the ideas as they’re presented. Because we don’t know what those ideas are being backed up with. I’m going to get off my soapbox.  37:46  David Utrobin: Very good points. Those points also reinforce a culture where any external or semi external stakeholders work to establish a social reputation. But I’m still a bit concerned about big stakeholders who don’t participate and will eventually come in and share something. And maybe the community won’t take it seriously.  Brian McMichael: Well, you can build that up, right? If dragonfly comes in and decides they want to make a post after many years of not posting, they’ll identify themselves as someone with dragonfly, and we will take the credit that they’ve built elsewhere and apply that. I think Ashley came in and posted something after never having posted, but we know who she is, right? She’s got a history with Maker and with other protocols. If your goal is to create a new account to stir the pot and not provide any other context, I’m personally not going to give it that much credit. Katie: I feel like it’s a cop-out in a way. You can tell people making a controversial proposal and using an anon account just because they don’t want to use their real identity. But I mean, at the same time, I think you just have to look at the proposal’s content and not the person creating it. However, in my opinion, and probably many other people’s, it’s just the cop-out. It’s the easy way to do something controversial and not associate it with your reputation. I wanted to talk about; I’m curious about everyone’s thoughts about people making proposals outside of a Core Unit. It’s an interesting thing to me because, in some ways, that makes sense, but then in some ways, I don’t know if it does; it seems like an interesting topic of discussion. Related to budget, I don’t know if it makes sense. I am relating to offboarding. I get that. Someone within the core unit can’t make that proposal. But I was just wondering what people in Core Units think about that.     Core Unit Proposals & Dispute Methods  Offboarding vs Correction, and Dispute Methods  Submitting proposals on behalf of another CU  1692×928 149 KB  40:10  David Utrobin: Katie, that is so awesome that you brought that up because it perfectly segues into the next discussion topic. What you brought up is prompt number two. What do we think about submitting proposals on behalf of another core unit? But just to center the conversation, it’s about core unit proposals and dispute methods. When somebody does propose something on behalf of another core unit, it’s kind of a stronger signal of a dispute. But really, this is my attempt to map out what are other ways to dispute before you go nuclear. These are the available dispute methods that the public has or disagrees with core units. There’s complaining; you can complain directly to the facilitator. That’s probably the best first thing that you can do. Talk to the core unit with whom you have a problem. Then there’s complaining to surrounding actors. Delegates, for example, say, “Hey, why isn’t this core unit doing its thing?”. Then there’s the third sort of escalation of complaining, which is publicly on the forum. You go, and you make a case. It’s not a proposal; it’s just a discussion. Ask, why isn’t this core unit performing? But then, beyond that, I believe Greg proposed, and Maker governance passed MIP 52, which is a dispute resolution process that we’ve never actually used. Still, it is available as a tool for governance and people. But if you disagree with a Core Unit or a mandated actor’s actions, you could submit a dispute to Maker voters using that process. Finally, the third most aggressive way to dispute with a core unit is through the proposal process itself. First of all, you can campaign against active proposals. We’ve seen that most with budgets, for example. People push back on budgets. Or they’ll directly say no, or they’ll propose an alternative budget, as we’ve seen. And then, besides campaigning for active proposals, there’s proposing offboarding, a facilitator, or proposing something directly. That’s the question that you brought up, Katie. Is it reasonable for other people to propose MIP, 39, 40, and 41 sub-proposals on behalf of another core unit? And that’s kind of where the whole conversation is at—bringing it back to your question. I’m going to let people respond.  43:23  Chris: I was just going to say that this, in a way, happens to Protocol Engineering fairly frequently. And, even before Protocol Engineering, when part of us was in the Foundation. The DAO drives initiatives by throwing Maker weight around. And I think we tended to pay attention to requests on behalf of our CU from other actors when MKR voted for those requests to go through. I think I would find it pretty frustrating if we had to battle complaints and perceptions in the forums constantly. But I can see that sometimes that’s probably better than allowing someone else to convince the MKR holders of something incorrect. I was going to say the DAO pretty heavily decides our roadmap. I think Protocol Engineering suggests stuff too. And I feel like that’s probably true for a lot of core units, is that core units serve at the pleasure of MKR holders. So in a way, MKR holders drive us a little bit. But without taking that sort of MKR weight into account. Where do we draw the limit where we don’t get randomized by anons on things like signal requests, and we can still execute? I think it’s been paying attention to where MKR holders vote for our group.  45:21  Nick Kunkel: I would just like to have a little more of a defined process. I don’t like talking about incidents. For example, the recent incidents with collateral offboarding or the recent incidents with my budget getting forked. I just want to have guidelines for the future because I think those are more important than whatever, singularity, or whatever we want to call it. I think, on the one hand, we have this philosophical argument. Mooney mentioned this one thing of how we already base our direction, within the core units, on the sentiment that we see in the community. And how we see the voting going on on different proposals. But then you get to more minute things, for example, with facilitator offboarding. If you don’t give the community the power to offboard someone who doesn’t want to be offboarded, you’re severely handicapping them. In a sense, the community does need to have the power to just submit an offboarding proposal for a core unit facilitator. But is that the case for every aspect of a core unit? And so, in the case of budget, I would argue that it’s not the case, and here’s why. You start a core unit, and you have a mandate. You then promise that you’re going to do certain things on your roadmap, say, within the next year, within this budget cycle, whatever period your budget cycle is, and then you need to execute on that mandate. You need to execute on that roadmap. And only you, as the facilitator, are going to have the insight into what kind of resources you need to execute on that. And it seems to me that the natural way that this should go is that the facilitator submits the proposal. The community says no, that’s too much; we don’t like that. And then, the facilitator has to go back and retool their budget. It comes with, let me reduce my mandate, because, with less money, I can’t fulfill all those obligations anymore. And there’s this back and forth until you do manage to pass a budget, and then you’re good. That seems like a much more natural way to do things than dealing with external budgets coming in for the facilitators. It seems like a weird way to do it; here’s your pile of money, now figure out what to do with it. It’s similar to how they all get allocated a certain amount of cash in the US departments. And then if they have something left over at the end of the year since they don’t want their budgets to be lowered, they all go and buy ridiculous crap and just try to spend all the money by the end of the year, so next year, they can get a similar budget. I think that’s a little bit tangential here. But I think the flow of facilitators submitting budgets, and then the community giving feedback on those budgets and potentially voting them down if they disagree is a much more natural way to do this than for facilitators having to battle alternative budgeting proposals. It’s also a bit weird, for example, in my case, where the resulting budgeting proposals were just splitting mine up. I think that’s a little bit of a unique case. But let’s say, what if multiple people had submitted different budgets for the Oracle core unit. Let’s say David had submitted one and Katie had submitted one, and Mooney had submitted one for the Oracle core unit. Now you have a bunch of Oracle core unit budgets going either into the same governance cycle or different governance cycles. There’s a breakdown to process here. I’m not saying we have to do it the way I’m thinking, but I think we need to redefine the core unit MIP to put more guardrails in place. So we don’t end up with these breakdowns of process.  51:07  Justin Case: Is there any good reason for people outside of the CU to make a budget proposal? Because no one outside the CU has any real way of knowing what is supposed to go into it. There is a mechanism to handle a disagreement with the budget that says CUs have to reapply their budget. Whenever the CU has to reapply, people will get a chance to speak out against it. If we go in and micromanage the budgets throughout the year or the budget period, it will make a mess out of everything. And the core units are going to end up focused on the unit of their budgets, and if anything to do might be conceived as controversial, we will lose all progress. So I think once a budget proposal is accepted, we will have to live with that for a while until the next time it comes up, and then we have a chance to do something about it. And as was mentioned here, we do have the offboarding process if someone is doing something extremely controversial. And maybe in some cases, we need an offboarding for an entire core unit, if we for some reason, deem that the necessity of this core unit has run its course. But I think that those things are natural to do in conjunction with a budget proposal or the renewal of a budget proposal because things don’t happen that quickly that we can’t wait one quarter or six months, or how long it takes for the next budget proposal to come up again. And that makes for a more sensible approach to the subject matter, in my opinion, at least.  53:15  Payton Rose: I guess I could provide some backdrop there as to your question in terms of if it ever does make sense. From a political science perspective, the power of a person is pretty important checks and balances. We delegate a lot of authority to core units. We allow them to block proposals, to insert them directly to on-chain voting, basically a lot of permissions that could be abused if taken in the worst-case scenario. One advantage to allowing others to post this is that if a core unit is particularly powerful or influential, they’re doing something that the community maybe hasn’t liked, maybe suggested they change. They don’t want to change it. If the leverage is all on the core unit facilitator side, you have very little recourse. That doesn’t mean there aren’t other ways we can solve that. I guess we’re providing opposite perspectives as to one reason why we might want to keep that in place.  54:40  David Utrobin: Yeah, like I wrote in the chat, but permissionless proposals support the general decentralization of governance at Maker. But I think the key problem that Nick and so many others are pointing at is, it might not make sense with specific proposals. For example, for offboarding, Blimpa mentioned there is a component that sets a precedent for actual offboarding. In the budget MIP, you don’t have that; you don’t have to \"use this component to alter somebody else’s budget .\"And I think there are way more sensible ways of approaching that specific kind of dispute. I don’t think that, in general, we should be restricted proposals, but in very specific cases, it might make sense, especially with the budget proposals. I don’t know how it would look like. But if that happens, I guess, GovAlpha would be able to deem it illegitimate. Or what would it look like if it were restricted? Would it just be ignored? Would there need to be an explicit sort of statement for each time that happens?  55:56  Payton Rose: We would need to pass something through our MIP structure that says, you know, only X is allowed, or Y is not allowed. Then GovAlpha can point to that and say, the community passed this, which deemed this proposal illegitimate. And we would not sign up for anything that involves discretion. We would want it to be very clear about anything that could call our neutrality into question. If we have to make judgment calls, where it’s, in a situation where it’s likely for bias to come in there, that’s not a situation we’d be supportive of. However, the community can pass whatever they want. And we’ll do our best job to enforce what they pass, whether that is something I’d be mindful of when bringing the proposal forward.  David Utrobin: Yeah, that makes sense. There’s also this thing popping up in my head of hard rules versus soft rules. Soft rules are things that the entire active community sort of understands that there are no hard rules to codify or enforce; it’s just sort of naturally enforced. For example, somebody posts a budget proposal on behalf of another core unit the next time. We had this conversation, everybody knows; you just ignore it. You don’t have to give it much thought. But then, at what point do we want to put in a harder rule where it’s regardless of what anybody thinks? At some point in the past, we have made a rule, okay, it never makes sense. Is that the benchmark? When it never makes sense that you make a hard rule? Or should it be just kept as a soft rule? So we could save on the governance overhead of it all? Pablo: I was reading Nicolas’s comment in the chat. Are there any cases where the community might want to set the budget to zero instead of offboarding a core unit? MIP39-C3 is the process for removing core units. And the condition for such a sub-proposal to be submitted is that the core unit that needs to be offboarded should not have any active budget or active facilitators. It’s kind of a prerequisite to abort a core unit to remove the budget and the facilitator in a prior instance. Maybe that process should be revised.    58:49  Wouter: Yes, I just want to quickly build on what Prose was saying and what I was putting in the chat; I think it’s about the community permitting the core unit to do certain things. To call yourself an official facilitator is permission allowed by the community to that person and, as such, can be taken away. Putting the payment stream in place is permission granted by the community and, as such, can be taken away. To assign any official roles, to give any privileges, for example, as a manner of actors having access to certain information or joining calls that are off-limits for others, these are permissions that can be taken away. Anything that falls outside of that doesn’t make a lot of sense because it’s like the ownership of the core unit. You can’t force someone to do something in a certain way simply by voting a MIP about it. I can’t submit a MIP that says that Chris Mooney has to wear a Christmas hat every week, or I would have already done it because the community has no permission to that individual. And I think if we want to formalize it, it’s probably good to be formal about these kinds of permissions that we’re granting. And then you have a very good framework to say, well, if you grant them, you can take them away. Then there’s the edge case that I brought up, simply consented. You can just about propose anything if the party it involves consents or supports it. That’s the other case, right? You can take permissions away that you have previously given; you can propose anything if it’s with consent; anything that falls outside of that is not useful, I think.  1:01:10  Payton Rose: The only example I could think of the might counteract that, and again, it might be balanced out by the rest of the argument is initiative-specific funding. I will use my core unit as an example, which doesn’t apply to anyone else. For instance, the community knows I spent a lot of time working on our source cred, right? So what if we get to the point where the community feels weird? We’re spending too much money on sources. But because this is my pet project, I don’t want to get rid of it. This is hypothetical. But let’s say that was the mindset I was taking on. I’m not going to listen to the community. GovAlpha is important; you guys aren’t going to vote us down. I’m leaving the source cred funding in place. Because it’s a part of our budget, it is much harder to address that through other governance methods. That’s potentially one scenario where the lack of consent for that particular program might make sense.  1:02:15  Wouter: I would disagree because you propose the full package. It’s not like a menu, and we can pick and choose. It’s like, “this is what we’re proposing; it includes the full package, and we’re willing to do all the other things that are in the proposal if it also includes the substantial budget for sourcecred, or whatever.” Any other input from the community is based on your consent. You can say, \"I want to do all these other things, and then I also want to fund sourcecred, and I would like to go for the highest option, but I would consent to a lower budget .\"But the only thing that can be taken away is just the permission and the package deal. So I do think it fits within this frame of thinking.  1:03:09  David Utrobin: Then also, other dispute methods can happen before you go nuclear. If you disagree with the funding of one program that’s in a big-budget package, you could post about it; you could put up a signal request about it, you can try to influence the core unit itself to see your reasoning for why they think this program doesn’t make sense. If there’s a total disagreement, you could bring it to MKR voters through MIP 52. I think that with the tools that exist, there’s never a case where a direct disruptive budget proposal should be proposed from a third party without consent. That’s kind of the view that I’m gravitate gravitating towards. Ultimately, using your example Payton, if a program was approved in your budget in your mandate, but three months into the six months, people are realizing, \"Oh, this is not working .\"There should be a way for people to communicate that.  1:04:33  Juan: I’m wondering what we are trying to fix. Because It’s not like we have a very large amount of, you can call it spam if you want. But I can see a lot of use cases, and maybe I’m too naive, and they will never show up. But for example, when Mark  was proposing The moonshot fund and all that. What if someone had said, “Hey, this is your new forked budget? There’s no moonshot fund anymore”. And then everyone would’ve said, \"now it makes sense .\"Maybe the history would have been different. I think Prose’s example was maybe good too. Perhaps someone thinks you’re spending too much on that process, or whatever. So we’re splitting that, and then it’s up to you to accept it or not, and maybe we should fix governance or the process for that. But I can see where ideas should flow more naturally; again, we should not be judging the author unless it becomes problematic. But I think that there are different conversations. What if a Maker holder that could be a shadow delegate wants to propose something? What are they supposed to do? Start posting and build a reputation? Or are they supposed to dox themselves? Should we start KYC’ing every MKR holder? I think that the answer is no. I think that probably everyone in this call agrees with me.   1688×946 140 KB  1:06:20  David Utrobin: I was going to say that people are bringing up is motive matters. To some extent, yes, who cares about the author? It’s about the proposal. But on the other side, what about the motive? What about the conflicts of interest? And I think that’s the nexus point of where this issue is.  1:06:36  Katie: I don’t think it’s about the motive; I think it’s the operational overhead for the core units, at least from my perspective. Outsiders making proposals about core units about their internal operations, whether budget or anything, I don’t know what could be another example. But it seems like that just causes a lot of operational overhead for the core units. But then I also understand the argument of “everyone’s voting on these proposals so, everyone, should anyone should be allowed to create them” But then the other side of that is, it’s just operationally inefficient.  Juan: Yeah, it will be inefficient. In every DAO, I think we have facilitators to deal with this kind of stuff exactly for this. If someone posted, probably the least controversial core unit is GovAlpha right now. So if someone posted something against GovAlpha or defunded them, I don’t think anyone would take that seriously. I don’t know. I don’t know if we should start. It sounds like we are against criticism. And it’s very dangerous to portray this image to the broader community. We don’t want for people to argue, \"oh, the core units within Maker, they don’t accept criticism, now you need to do A, B, and C to criticize them .\"I think that the auld be to post solid work and make sure that we’re doing our best. And yeah, if the spam becomes too problematic, then maybe we should solve that differently. Maybe every proposal should have some staked MKR or, I don’t know, three facilitators, proposing that that’s potentially also dangerous. I don’t know. I don’t want to create groupthink within Maker and make us into this group of people that just became too strong, and we cannot improve because no one can take us or say anything against us. David: My thinking is that taking criticism is a core fundamental thing that all core units should preserve. You should be able to take criticism. I guess the thing that I’m trying to fix, going back to your original question Juan, is not necessarily to fix it, but more how do we go about criticizing core units in a less operationally disruptive way? You want to preserve the ability for people to call people out and stuff, right.    1:09:31  Justin Case: I just want to say in general, I think we should put as few restrictions on proposals as possible. But I think there’s something to be said about things that occur regularly. I don’t think there’s much value in discussing the same proposals over and over again; it can cause engagement fatigue. Every month, we discuss someone’s budget because someone has posted a new budget proposal. At some point, people will give up on conversation and not be engaged anymore. I think processes defined at regular intervals might be restricted to those predetermined intervals. Because they will be discussed, and we’re not skipping the discussion. We’re merely making sure we’re not spending bandwidth on something that will be discussed anyway.  1:10:23  Payton Rose: Thank you, Justin. I think we might do another call from people outside of core units. I know we’ve been talking a lot. And this is the issue where we’re more biased. That’s the reason I’m calling for other voices as well. I guess one thing that might be important to say is from a governance process, if you hear this discussion, you think that something should be changed, it would either probably need to be a new MIP or an amendment to the core unit budget MIPS that would address what we’re talking about. And as with any proposal, GovAlpga is here to provide feedback, help you with the governance process if that is something you want to undertake, and are unsure about how to go through it. Absent anything like that, we would just keep interpreting the rules as we have been, which is permissionless. So as long as those proposals satisfy any other requirements that we’ve already put in place, they would be treated as legitimate and brought to a vote when formally submitted.  1:12:12  David Utrobin: I just want to make a contextual note. However, this isn’t a huge problem in our community now. We do just see little blips of edge cases popping up. So I think as MakerDAO grows, it’s important to have these conversations with the wider community so that it’s not just a handful of people thinking about this. That’s the main motivation for bringing this up. We want reasonable and normal processes, and we want to do things the right way. And we want to do them in a way that preserves the values of our community.  1:13:04  Payton Rose: The fun part is that the people proposing in effect shape our values through how they’re accepted and engaged with. Thank you, everyone, for engaging with this. As mentioned, at least in the chat, I can’t remember if I’ve said it yet. This is our last call of 2021. So really appreciate all the attendance. This is probably one of our better-attended meetings, and it’s great to have so much participation.  David: Look out for the Maker annual governance review that our team will put out. I believe in the first week of January. And we’ll be back on January 6th for another Governance & Risk call.    Suggestion Box  Common Abbreviated Terms CR: Collateralization Ratio DC: Debt Ceiling ES: Emergency Shutdown SF: Stability Fee DSR: Dai Savings Rate MIP: Maker Improvement Proposal OSM: Oracle Security Module LR: Liquidation Ratio RWA: Real-World Asset RWF: Real-World Finance SC: Smart Contracts Liq: Liquidations CU: Core Unit  Credits  Artem Gordon produced this summary. José Ferrari produced this summary. Kunfu-Po produced this summary. Everyone who spoke and presented on the call, listed in the headers.​  ",
                    "links": [
                        "https://youtu.be/qEcUDkCNQB8?t=97",
                        "https://youtu.be/qEcUDkCNQB8?t=358",
                        "https://youtu.be/qEcUDkCNQB8?t=698",
                        "https://youtu.be/qEcUDkCNQB8?t=1008",
                        "https://youtu.be/qEcUDkCNQB8?t=2410",
                        "https://youtu.be/qEcUDkCNQB8?t=2",
                        "https://youtu.be/qEcUDkCNQB8",
                        "https://youtu.be/qEcUDkCNQB8?t=97",
                        "https://vote.makerdao.com/polling/QmbKaHAv",
                        "https://vote.makerdao.com/polling/QmSgCHbt",
                        "https://vote.makerdao.com/polling/QmNi4qtG",
                        "https://vote.makerdao.com/polling/QmPBRpCW?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/polling/QmVTiToU?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/weekly-mips-update-66/12190",
                        "https://mips.makerdao.com/mips/details/MIP51#MIP51c4",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-9-16-2021/12240",
                        "https://www.youtube.com/watch?v=FA-gpI6SnwA",
                        "https://youtu.be/qEcUDkCNQB8?t=1008",
                        "https://youtu.be/qEcUDkCNQB8?t=1244",
                        "https://youtu.be/qEcUDkCNQB8?t=1295",
                        "https://youtu.be/qEcUDkCNQB8?t=1430",
                        "https://youtu.be/qEcUDkCNQB8?t=1764",
                        "https://youtu.be/qEcUDkCNQB8?t=1954",
                        "https://youtu.be/qEcUDkCNQB8?t=2068",
                        "https://youtu.be/qEcUDkCNQB8?t=2127",
                        "https://youtu.be/qEcUDkCNQB8?t=2266",
                        "https://youtu.be/qEcUDkCNQB8?t=2410",
                        "https://youtu.be/qEcUDkCNQB8?t=2603",
                        "https://youtu.be/qEcUDkCNQB8?t=2721",
                        "https://youtu.be/qEcUDkCNQB8?t=3067",
                        "https://youtu.be/qEcUDkCNQB8?t=3195",
                        "https://youtu.be/qEcUDkCNQB8?t=3280",
                        "https://youtu.be/qEcUDkCNQB8?t=3356",
                        "https://youtu.be/qEcUDkCNQB8?t=3529",
                        "https://youtu.be/qEcUDkCNQB8?t=3670",
                        "https://youtu.be/qEcUDkCNQB8?t=3735",
                        "https://youtu.be/qEcUDkCNQB8?t=3789",
                        "https://youtu.be/qEcUDkCNQB8?t=3873",
                        "https://youtu.be/qEcUDkCNQB8?t=3974",
                        "https://youtu.be/qEcUDkCNQB8?t=3997",
                        "https://youtu.be/qEcUDkCNQB8?t=4167",
                        "https://youtu.be/qEcUDkCNQB8?t=4223",
                        "https://youtu.be/qEcUDkCNQB8?t=4332",
                        "https://youtu.be/qEcUDkCNQB8?t=4383",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/weekly-relay-dec-14-2021-jan-3-2022/12463",
                        "https://forum.makerdao.com/t/relay-semanal-14-de-diciembre-de-2021-3-de-enero-de-2022/12531"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.68680417477656
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#5",
                    "likes": "2",
                    "time": "16/12/2021-20:56:19",
                    "content": "This full call is now available for review on the MakerDAO Youtube channel:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "18/03/2022-02:57:18",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "384"
}