{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/2022-09-28-executive-inclusion-update/18076",
            "title": "2022-09-28 Executive - Inclusion Update ",
            "index": 18076,
            "category": [
                "Updates",
                "Notices"
            ],
            "tags": [
                "executive-bundling",
                "update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "8",
                    "time": "24/09/2022-13:49:38",
                    "content": " Executive Inclusion Update - 2022-09-28 This post is to update the community on a few changes that have occurred to the contents of next Wednesday’s Executive Proposal since they were announced on the September 22, 2022 G&R call.  Monetalis Delay After discussion between @Patrick_J, @prose11, and @Derek, the decision was made to remove the onboarding of Monetalis from the upcoming spell. This was due to concerns from both GovAlpha and PE, although the GovAlpha concerns were more problematic.  GovAlpha Rationale Following the release of the CFTC civil enforcement action against Ooki DAO there were concerns about the committee retaining a US citizen (in this case @prose11, acting as a Maker representative on the Monetalis committee). We explored the possibility of changing membership of the committee at the last minute, but this was felt to be suboptimal and would not allow for appropriate governance scrutiny.  Protocol Engineering Rationale Simultaneously, concerns were raised by PE that they had not had sufficient time for testing of the code delivered by CES for this deal. On it’s own it is unlikely that this would have been cause for removal of Monetalis from the upcoming spell but it compounded the issues above.  Decision and Follow-up A joint decision between all three facilitators present was reached that the best option would be to remove Monetalis from the upcoming spell. Consequently, Monetalis and CES were contacted. The CES team were in agreement with the decision. While obviously the Monetalis team were disappointed (as were we) that this was being removed, they were understanding and we have now reached a compromise solution where the trustees will observe the executive spell execution themselves, negating the need for the committee at all. For clarity, the committee is not a strict requirement under MIP65. It’s main role was to communicate the passage of the executive spell to the trustees acting for Monetalis. We would like to thank CES and Monetalis for their understanding and professionalism and we will aim to include this deal in the following executive spell.  Starknet Clarification Additionally, there is an update to the expected change for the Starknet bridge. On Thursday, I reported that the 1 million DAI debt ceiling and 1 Basis Point fees would be implemented. However, these parameters are for the deployment of Maker Teleport on Starknet which is not yet ready for implementation. Instead, this spell will only be increasing the Bridge Deposit Limit from 50 to 1,000 DAI. Additional debt ceiling and fee changes will take place when we implement fast withdrawals, at the request of the Starknet team. ",
                    "links": [
                        "https://www.cftc.gov/PressRoom/PressReleases/8590-22",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/22",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-28-de-septiembre-de-2022/18259",
                        "https://forum.makerdao.com/t/governance-and-risk-210-thursday-september-29-at-17-00-utc/18115/3",
                        "https://forum.makerdao.com/t/actualizacion-de-la-inclusion-ejecutiva-2022-09-28-traduccion/18084"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.346014492753623
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#3",
                    "likes": "4",
                    "time": "25/09/2022-15:24:32",
                    "content": "    prose11:  we have now reached a compromise solution where the trustees will observe the executive spell execution themselves, negating the need for the committee at all. For clarity, the committee is not a strict requirement under MIP65. It’s main role was to communicate the passage of the executive spell to the trustees acting for Monetalis.   Thank you for the update.  Could someone review/summarize here for the community what is the committee you are referring to and its role? Can you also link to the relevant section of MIP65 that cover this? I understand @christiancdpetersen has been working from the legal side on the MIP65 implementation. Was he involved in these conversations? On what basis specifically was @prose11 US citizenship viewed as relevant to the recent action by CFTC? Among other things, CFTC jurisdiction pertains to services offered to US residents, so I’m not immediately clear how the composition of a committee relates to the various regulatory risks. Did the group that assembled to review the issue obtain the advice of US counsel with expertise in CFTC jurisdiction, the CEA and crypto asset regulation? ~Kianga ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.620833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#4",
                    "likes": "3",
                    "time": "26/09/2022-11:26:05",
                    "content": "    ACREinvest:  Thank you for the update. Could someone review/summarize here for the community what is the committee you are referring to and its role? Can you also link to the relevant section of MIP65 that cover this? I understand @christiancdpetersen has been working from the legal side on the MIP65 implementation. Was he involved in these conversations?   The Deed Poll establishing the James Asset Trust contemplated a Maker Committee to “validate” to the Trustee decisions made by Maker token holders via an executive spell. In my view, the Maker Committee was there to facilitate the transmission of information to the Trustee. The Maker Committee, by itself, does not have any governance or decision-making rights. I agree with @prose11’s description of the role of the Maker Committee and I can confirm that I have discussed and reviewed the role of the Maker Committee (and its removal) with @Allan_Pedersen, @collateral-core-unit and @strat-fin-core-unit. I was not engaged in a discussion on the regulatory aspects of the composition of the Maker Committee. And I have not offered a view on this point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "0",
                    "time": "26/09/2022-12:51:03",
                    "content": "    ACREinvest:  On what basis specifically was @prose11 US citizenship viewed as relevant to the recent action by CFTC? Among other things, CFTC jurisdiction pertains to services offered to US residents, so I’m not immediately clear how the composition of a committee relates to the various regulatory risks.   Working on a timeline of events to add to this thread to make clear the decision was made in the face of time pressure and shifting regulatory understanding. The wording difference between citizen and resident is entirely my own and I apologize for any misconstruing. Although I was able to retain legal counsel and have a meeting on Friday it was after the decision to delay this executive and remove myself from the committee. I believe this was the correct choice for the DAO, personal liability aside, as having the attack vector on the table could effectively freeze the DAO out of making vault updates. The roll of the committee was only to verify executives had been passed with instructions for the vault arrangement meaning that it could not make any decision without the DAO but would be needed for solidifying the DAO’s vote. This could have allowed using the courts to tie up one of the committee members (in this case me) and effectively locked the status quo of the Monetalis vault until Governance was able to respond and update the committee. Since we already have a great method for verifying shared truth (the blockchain) we ultimately decided relying on that fundamental building block was a much more solid structure. The initial set up was described here if you’d like to read about it in more detail:    MIP65 Clydesdale / Governance Framework & Setup Miscellaneous       Dear Community,  We have settled on a general governance scheme for Clydesdale and want to explain this to the community.  Here’s a basic illustration of the process and participants   [image]  We get to a situation where:   Asset ownership and all actions hereupon sit entirely with a single Trust structure in the BVI The trust, with DAI holders as beneficiary, is governed by a professional Trustee The Trustee is instructed exclusively via Governance Poll outcomes The execution of the instructio…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.048763736263735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#6",
                    "likes": "1",
                    "time": "26/09/2022-13:04:16",
                    "content": "    prose11:  Working on a timeline of events to add to this thread to make clear the decision was made in the face of time pressure and shifting regulatory understanding.   I am interested in this latter point - I appreciate that the Ooki enforcement was a first-time enforcement action against a DAO, but a cursory read through suggests that there are meaningful differences in context between those facts and this particular committee for Maker. Is there something I am missing in terms of why there is a perception of a greater regulatory attack vector post-Ooki, or is it simply the nature of that enforcement action against DAO members? (That question aside, I agree it seems sensible in any case to negate the need for the committee altogether - a good solution.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.007575757575758
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#7",
                    "likes": "1",
                    "time": "27/09/2022-15:23:18",
                    "content": "    Matt_NZ:  I am interested in this latter point - I appreciate that the Ooki enforcement was a first-time enforcement action against a DAO, but a cursory read through suggests that there are meaningful differences in context between those facts and this particular committee for Maker   The situation is ever changing and IMO it’s better to be more cautious if possible. That was the input for this decision and shouldn’t be taken further than that. I was trying to give the community as much insight as possible to these decisions, but it is quite difficult to articulate in a way that accounts for the dynamic nature of the subject. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.553571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "27/10/2022-15:23:43",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}