{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/growth-core-unit-offsite/13364",
            "title": "Growth Core Unit Offsite ",
            "index": 13364,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Youss",
                    "index": "#1",
                    "likes": "11",
                    "time": "22/02/2022-16:51:32",
                    "content": " Growth Core Unit Offsite  Dates: Monday 7th to Friday 11th, 2022. Location: Mexico. Participants: Growth Core Unit team and members from various CUs (PECU, Oracles, DI, and one delegate).   Key Objectives:  Build relationships between CUs given the importance of collaboration in the DAO. Look back on all the work achieved by the team over the past year (2021). Present the strategic initiatives for the year (2022), the new organization and ways of working to be set-up for success when facing the up-coming challenges and addressing the strategic opportunities for Maker. Learn from each other’s opinions and understand the different perspectives of the CUs present (i.e. PECU, Oracles, DI, and delegate) on Maker challenges and priorities.   Agenda:  Monday - 2021 Review.  General review on growth achievements, opportunities and challenges (link). Regional focus: North America, Europe, APAC, LATAM  Region description per vertical: market dynamics & key trends, key players and challenges. Key achievements of 2021. Opportunities for Maker. Key challenges.    Marketing & Communication review.   Tuesday - 2022 Focus.  Share Growth CU strategy and key priorities for 2022. Share the new organization structure to be set-up for success. Share the new ways of working to be set-up for success. Open discussions and reflections on on-going opportunities and challenges for Maker.   Wednesday - Team Building activity. Thursday - Working sessions.  WS#1 - Multi Chain initiative: What is our ambition, where do we stand today and what should we do to achieve the ambition successfully? WS#2 - Institutional vaults: What is our ambition, where do we stand today and what should we do to achieve the ambition successfully?   Friday - Team Building activity and closing session.   Key outcomes of the offsite:   By the end of the offsite, a strong relationship was built between CUs. At the “closing session”, there was a shared conviction that this relationship will further enhance collaboration and communication between Core Units, a key success factor for the DAO.   We have identified the Maker priorities on which we need to collaborate in the coming weeks and months (not an exhaustive list):    The multichain strategy and how to go beyond L2s - a separate proposal will be developed and shared in the coming weeks. Increase the exposure of the protocol to the Real World - keep supporting Real World Finance CU to improve the onboarding process. Improve CUs coordination - we are supporting the Strategic Finance CU in setting up a “strategic review” meeting (quarterly) to align the DAO on Makers’ priorities. New processes will be investigated in the next weeks to further improve the CUs coordination and shared in the G&R meeting. Incubate marketing CU within the growth CU to start addressing priority opportunities (e.g., building brand awareness, working on strategic activations with partners) - a separate proposal will be developed and shared in the coming weeks.   We have identified the priorities that are of particular concern to the Growth CU (not an exhaustive list):   Develop a sense of prioritization in Business Development initiatives (e.g. 80/20) that will bring the highest positive impacts to Maker - a separate post will be shared in the coming days. Structure the teams in line with the new organization. Recruit the identified missing talents. Implement the new ways of working and KPIs (i.e. regular meetings, tools and processes).   NPS score (n=9): 90% ! (8 promoters and 1 neutral at 8/10).  Selected verbatims: “Cross CU offsites are the key.” “It was a great experience, and as I said in the reflections session on Friday, having clear cross-CU communication is key for the DAO’s success.”.  POAP:   Twitter post:   twitter.com    MakerDAO Growth @MakerGrowth  Proof-of-attendance@poapxyz 🎖️ https://t.co/KJoXvh5KXT   5:53 PM - 18 Feb 2022           3            ",
                    "links": [
                        "https://drive.google.com/file/d/1XNHAEg6C39s9v2tPHW556OGGo6hx6mxZ/view?usp=sharing",
                        "https://drive.google.com/file/d/14NeDCaKchyHKwWWaUv5eMz6gTVsFAQYa/view?usp=sharing",
                        "https://drive.google.com/file/d/1UbNntGSuUgHeIWgIGkHwQdvcyHOkT5Bo/view?usp=sharing",
                        "https://drive.google.com/file/d/1oE3bkTtOP1YAeyB0ilS46CX05BhZlfmU/view?usp=sharing",
                        "https://drive.google.com/file/d/1CCz039OKQkreu6IigZ8MZSJCtqY8fdsI/view?usp=sharing",
                        "https://drive.google.com/file/d/1uNiWvbcvc_OeVn97I3F7HitJwSeXSOFI/view?usp=sharing",
                        "https://drive.google.com/file/d/1ljLBagtx10fdghK2JHCgLvQIEuGzvgOr/view?usp=sharing",
                        "https://twitter.com/MakerGrowth/status/1494731705973886983",
                        "https://twitter.com/MakerGrowth/status/1494731705973886983",
                        "https://twitter.com/MakerGrowth/status/1494731705973886983",
                        "https://twitter.com/poapxyz",
                        "https://t.co/KJoXvh5KXT",
                        "https://twitter.com/MakerGrowth/status/1494731705973886983",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-17-24-2022/13425",
                        "https://forum.makerdao.com/t/growth-cu-weekly-update-feb-28-2022/13494",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-february-2022/13726"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.624536178107606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "22",
                    "time": "22/02/2022-19:34:35",
                    "content": " MakerDAO Off-sites Are Unifying It was truly amazing to spend valuable time with the attendees of this off-site, and we at 3F Delegate want to thank the entire @Growth-Core-Unit (including those that could not attend) and specifically @Nadia for visualizing this amazing unifying experience. Nadia you are a fearless leader, a visionary  We believe off-sites are 1000% necessary, valuable, and off-sites can produce results that will help scale, and more importantly further decentralize this DAO. The days and hours we spent together in the co-working space accelerated our understanding of the initiatives that both @Nadia and @MarianoDP are visualizing for the Growth CU team. We learned more about the leadership skills and crypto visions that @MarianoDP has, and we believe that vision could not be easily shared via a Forum Post. The ability to ask a human being a question in-person, is priceless. And the ability to debate visions + beliefs in-person is enormous. Learning more about the Layer 2s + the Maker Wormhole vision from @krzkaczor and @hexonaut in person, is beyond priceless! That cannot be easily accomplish via one Zoom call. We would not get the opportunity to discuss Layer 2 topics for hours and hours, via Zoom, a Forum Post, or even better–ask 100 questions   until we get a satisfying answer. Thank you to @krzkaczor and @hexonaut for putting up with our endless questions and curiosity. But beyond that, we finally got to know the Humans–the individuals that make this community that much more special. Meeting new team members like @Youss @Hajive @zxMori @tobalgarcia made me realized that this DAO is full of team members who truly believe and care about MakerDAO. It also allow them to showcase their  brain power, and allow us to recognized that this community is full of talent that can only blossom going forward. I was also able to connect more freely and openly with @joce_chang @Doo_StableLab and @Jenn people that we only get to interact with at conferences. Which are great for meeting people, but awful for having a deep discussion and getting to know each other’s views of what is the right path forward for this DAO. This off-site allow us to connect with both @joce_chang and @Jenn on their beliefs with regards to scaling this DAO in the Americas and Asia-- it allows to learn about the vision @Doo_StableLab has proposed in the past as a Foundation member and the visions he has for the future of crypto. How else can you learn about the crypto scene in Asia without having those memorable  moments with Jocelyn and Doo. This is why we believe off-sites allow you to unpack your crypto curiosities. (I believe it took Jocelyn 4-hours to get through her presentation because of the many questions we All had  ) This off-site could not have been made possible by the endless hard work of @Corina who made sure we were coordinated, prepared, and structured for the daily meetings and events. Thank you @Corina for your endless dedication to MakerDAO, for being apart of this growing decentralized community. You are living proof that DeFi/crypto is full of young leaders ready to takeover. We also want to thank our DAO lucky stars that we still have an OG like @NikKunkel in this community because we believe Nik could easily go on to become a Founder. Getting to know @NikKunkel was priceless. He is a true leader, a thinker, a MakerDAO community member for life that is committed to protecting the best interest of the DAO and MKR token owners. Thank you Nik for being you, and continuing to serve the DAO.  And thank you for allowing us to get to know you, as a person, as well as the Facilitator of the Oracles CU. We look forward to asking you another 100 questions in the future.  Deep conversations that we incurred with community member @tadeo are priceless. There is no way we could have recognized  the talent and brain power of community folks like @tadeo, and who have yet to display such. Meeting @tadeo made us realized how much hidden talent this DAO has, and is yet to be discovered. It gives us hope that the YOUNG MAKERDAO GUARD is ready, willing, and able to rise to the occasion. Thank you Tadeo for the deep conversations. Keep pushing forward. The Future is bright MakerDAO. When you spend priceless time with the likes of folks mentioned above   you start to understand the passion and commitment these Core Unit teammates share with the community and their willingness to align a MakerDAO vision. We at 3F Delegate hope to see more Core Units unite together and help make the community’s dreams and goals come into fruition. Let’s hope Nadia has set a new trend, and more and more community members, + Delegates, + CoreUnits teammates attend these off-sites and together we accomplish our endless dreams.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.300393268703129
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/02/2022-19:43:39",
                    "content": "Did maker pay for this? Why did only these people go? Thank you   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#5",
                    "likes": "0",
                    "time": "22/02/2022-21:40:20",
                    "content": "    MadShills:  Core units have budgets with which they have discretion.   I think it is not good to see people taken to the beach. Especially looking bad when biggest delegate is there but not others, when some staff is there but not others, when already paying for many of these people to go to a conference only a week later ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "8",
                    "time": "22/02/2022-22:50:11",
                    "content": "    Puzzler:  Especially looking bad when biggest delegate is there but not others, when some staff is there but not others, when already paying for many of these people to go to a conference only a week later   Sorry–you’re miss-informed–but dollars spent at EthCC (before 3F Delegate), LisCon, NearCon, CosmosCon, Solana Breakpoint, Offsite, and EthDenver come out of my own pocket. We are Self-funded Sir. But, By all means! Please advocate for Delegates to get budgets for travel purposes. After all, as a famous startup investor once said, “I don’t invest in Founders that have yet to quit their full-time jobs–they lack commitment”–as you can see, we are committed like peas and carrots.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#7",
                    "likes": "1",
                    "time": "22/02/2022-22:52:50",
                    "content": "Ok. Delegates should have travel budgets. That is a good idea. Is that why other delegates did not go? They did not have money to travel? They were asked to come? Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#8",
                    "likes": "7",
                    "time": "23/02/2022-14:20:59",
                    "content": "Hey @Puzzler , in November I posted an invitation to our offsite in our updates. The idea of extending the invitation comes from Lisbon, where I could experience the value of working in the same room with people from other CUs and the community. I decided to make it for no more than 16 people because of the budget and because it was the first time we organized something like this. For CUs wanting to organize an extended offsite, please let me know, we can share our experience and learnings with you.     Puzzler:  I think it is not good to see people taken to the beach. Especially looking bad when biggest delegate is there but not others, when some staff is there but not others, when already paying for many of these people to go to a conference only a week later   For us, ethDenver is an opportunity to meet with the ecosystem, and spend time with our partners. We thought about having our offsite there, but as our team is from everywhere, we have to find a place where they don’t have visa requirements to make it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Corina",
                    "index": "#9",
                    "likes": "3",
                    "time": "04/03/2022-13:53:08",
                    "content": "Thank you @flipflopflapdelegate for this beautiful message. It was a fantastic week and I indeed got to connect and get to know so many of you much better. I was once again convinced that MakerDAO has not only people with incredible talent and skills, but who are also humane and possess great qualities as people - not just as contributors & facilitators. It is very inspiring to be surrounded by such brilliant people and I am lucky to be a part of this team. Now full speed ahead - let’s keep buidling! Till next time  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4118589743589745
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "02/06/2022-13:53:10",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}