{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/regarding-mkrs-needed-to-pass-on-vote/1416",
            "title": "Regarding MKRs needed to pass on vote ",
            "index": 1416,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/the_ocs",
                    "index": "#1",
                    "likes": "0",
                    "time": "09/03/2020-18:12:40",
                    "content": "Hi all, Got a question regarding the “MKR needed to pass” value shown on vote.makerdao.com. If this is explained somewhere that I’ve missed (probably the case), feel free to just point me towards that. Looking at vote.makerdao.com right now I see the new “Set the Dai Savings Rate Spread”, currently showing “59242.81 MKR in support”. To the left of that it says “17577.64 MKR needed to pass”. The current proposal looks to have passed on Feb 21 with 88061.02 MKRs in support, so from my understanding the new proposal would need to surpass this to be enacted? But 59242.81 + 17577.64 would not add up to this, far from it. And it also way more than the “48592.17 MKR in support” currently at the governing proposal, if that would be what’s required… What am I missing here? ",
                    "links": [
                        "http://vote.makerdao.com"
                    ],
                    "GPT-summary": "The author of the post is asking a question about the \"MKR needed to pass\" value shown on vote.makerdao.com. They are confused about the numbers and are seeking clarification.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.617473435655254
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/03/2020-18:15:49",
                    "content": "You can see at https://chief.makerdao.com/ that the HAT has 76820.45 I and apparently others have voted for the HAT to avoid executing the proposal to increase the DAI savings rate spread. I’m still trying to figure out why anybody wants the spread to be greater than 0%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/the_ocs",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/03/2020-18:23:24",
                    "content": "Right, so in short: The UI at vote.makerdao.com not really giving us the full picture. And, just to confirm/correct some understanding: Whatever proposal currently holds a majority, can be cast, without regard for how many MKRs are needed to have such a majority? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.739795918367347
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "1",
                    "time": "09/03/2020-18:24:31",
                    "content": "    the_ocs:  Whatever proposal currently holds a majority, can be cast, without regard for how many MKRs are needed to have such a majority?   Yes, that is correct. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving answers to questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "1",
                    "time": "09/03/2020-18:27:21",
                    "content": "https://mkrgov.science/ Can also be used to see what the distribution of MKR is across executives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}