{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip79-recognized-delegate-mkr-compensation/16907",
            "title": "MIP79: Recognized Delegate MKR Compensation ",
            "index": 16907,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "delegation",
                "mkr-compensation",
                "impact-:-high",
                "delegate-compensation",
                "delegate-mip-set"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "6",
                    "time": "29/07/2022-15:04:29",
                    "content": " MIP79: Recognized Delegate MKR Compensation  Preamble MIP#: 79 Title: Recognized Delegate MKR Vesting Author(s): @Patrick_J Contributors: @psychonaut, @LongForWisdom, @prose11 Tags: delegates, mip-set, delegates-mip-set, process, delegate-compensation Type: Process Status: Rejected Date Proposed: 2022-07-29 Date Ratified: N/A Dependencies: MIP77, MIP78 Replaces: N/A Forum URL: https://forum.makerdao.com/t/mip79-recognized-delegate-mkr-compensation/16907 Ratification Poll URL: https://vote.makerdao.com/polling/QmUvMPe2   Note This MIP is intended to be voted on as a MIP Set along with:   MIP77: Delegates in the Maker Protocol.  MIP78: Recognized Delegate DAI Compensation.   References  MIP77: MakerDAO Delegates MIP78: Recognized Delegate DAI Compensation   Sentence Summary MIP79 is a proposal for MKR vesting streams for Recognized Delegates.  Paragraph Summary MIP79 defines how MKR vesting streams for Recognized Delegates will be calculated and executed.  Component Summary MIP79c1: Definitions MIP79c1 defines key terms. MIP79c2: MKR Vesting Calculation Defines how MKR Vesting for Recognized Delegates is calculated. MIP79c3: MKR Distribution Process Describe how MKR Vesting for Recognized Delegates is handled at the execution level. MIP79c4: Retrospective MKR Vesting Describes how MKR will be vested based on retrospective DAI compensation for Recognized Delegates active before this MIP was ratified.  Motivation While compensation for Recognized Delegates is primarily in DAI, which is beneficial due to its stability compared to the Dollar, MKR vesting is a valuable tool for allowing Recognized Delegates to establish intertwined incentives with the MKR holders delegating to them. These aligned incentives have not been present for Recognized Delegates; this MIP seeks to change that. By linking MKR vesting to DAI compensation received by Recognized Delegates (defined in MIPyy: Recognized Delegate DAI Compensation) we can indirectly tie the amount of MKR vested to both the amount of MKR received as well as the performance of Recognized Delegates. By using DssVest to stream MKR over twelve or twenty-four months, we can encourage long-term thinking from Recognized Delegates to maximize the value of the MKR they will receive when the stream completes. In addition, this will align them more fully with the MKR holders delegating to them.  Specification / Proposal Details  MIP79c1: Definitions   Recognized Delegate: Any delegate that meets the requirements defined in MIP77c2.  Recognized Delegate DAI Compensation: DAI compensation paid to Recognized Delegates as defined in MIP78: Recognized Delegate DAI Compensation.   MIP79c2: MKR Vesting Calculation Once a Recognized Delegate has been active for six months, in effect, six months since they completed the steps to become a Recognized Delegate defined in MIP77c2 and received their first delegated MKR tokens, the Governance Facilitators will calculate the total DAI compensation the Recognized Delegate has received in that time. This value will be divided by the 12-month rolling average price of the MKR token in DAI. This will calculate the amount of MKR vesting to which the Recognized Delegate is entitled. The Recognized Delegate will then be able to choose whether they want to receive their vesting stream over 12 months or 24 months. If they opt for a 12-month stream, the amount of MKR will be multiplied by 0.75; if they opt for a 24-month stream, it will be multiplied by 1. This process will repeat every six months that the Recognized Delegate is active. Recognized Delegates are not eligible for MKR Vesting if they step down before they reach six months as a Recognized Delegate. Once a Recognized Delegate has served for six months, they will be entitled to a pro-rata amount of MKR vesting if they step down.  Examples Delegate A has completed six months as a Recognized Delegate. During this time, they received 50,000 DAI compensation for their work. In addition, MKR’s 12-month rolling average price for this period is 1,000 DAI.  Delegate A elects to receive their MKR with a 12-month cliff. Consequently, Delegate A qualifies for 50*0.75 = 37.5 MKR to be streamed to them using DssVest. After another six months, Delegate A has received an additional 62,500 DAI as compensation, and the MKR token 12-month rolling average price in DAI is now 2,000 DAI. Delegate A opts to receive their MKR with a 24-month cliff. Therefore, delegate A qualifies for  31.25 MKR to be streamed to them using DssVest for this period. After three months, Delegate A decides they no longer wish to be a Recognized Delegate and follows the process described in MIP77c7. They will receive MKR streamed to them using DssVest based on the DAI they earned in these three months, with either a 12 or 24-month cliff at their discretion. Delegate B has completed four months as a Recognized Delegate before stepping down. As they did not complete the minimum six months as a Recognized Delegate, they do not qualify for any vested MKR.  MIP79c3: MKR Distribution Process MKR will be distributed to Recognized Delegates using DssVest to an address of their choice. Streams must have a twelve-month or twenty-four-month duration and a cliff date that matches the duration of the stream. Governance Facilitators will post the amount of MKR to be streamed, stream dates, and cliff dates to the Maker Governance Forum in advance of the relevant Executive Vote. Recognized Delegates are responsible for confirming the target address for the stream with the Governance Facilitators. If this is not done promptly, the stream will not be included in the next possible Executive Vote but will instead be delayed until it is possible for the Governance Facilitators to include it in a subsequent Executive Vote. Maker Governance will create the MKR streams through an Executive Vote. MKR vesting stream set-up does not have the same anti-bundling requirements as Recognized Delegate DAI compensation and may go into any Executive Vote. Unlike other MKR vesting streams, Recognized Delegate streams can be bundled with Recognized Delegate DAI payments.  MIP79c4: Retrospective MKR Vesting Recognized Delegates that were active before this MIP was ratified will be entitled to receive MKR vesting for the periods they were active and compensated under either MIP61, the Delegate Compensation Trial, or any one-off payments directly related to their role as a Recognized Delegate. This includes Recognized Delegates that have stood down from the role as long as they completed the minimum requirement of six months as a Recognized Delegate. Retrospective payments will be included in the first calculation of MKR vesting for Recognized Delegates six months after they started their work as Recognized Delegates in the Maker Protocol. Therefore, for Recognized Delegates that have been active for more than six months, their first stream will include the entire period since they started work as a Recognized Delegate. This will be calculated using the method described in MIP79c2. ",
                    "links": [
                        "https://forum.makerdao.com/t/mipyy-recognized-delegate-dai-compensation/16906",
                        "https://forum.makerdao.com/t/mipxx-delegates-in-the-maker-protocol/16905",
                        "https://forum.makerdao.com/t/mipyy-recognized-delegate-dai-compensation/16906",
                        "https://forum.makerdao.com/t/mipyy-recognized-delegate-dai-compensation/16906",
                        "https://forum.makerdao.com/t/mipxx-delegates-in-the-maker-protocol/16905#mipxxc2-becoming-a-recognized-delegate-15",
                        "https://forum.makerdao.com/t/mipyy-recognized-delegate-dai-compensation/16906",
                        "https://forum.makerdao.com/t/mipxx-delegates-in-the-maker-protocol/16905#mipxxc2-becoming-a-recognized-delegate-15",
                        "https://forum.makerdao.com/t/mipxx-delegates-in-the-maker-protocol/16905/3#mipxxc7-recognized-delegate-resignation-30",
                        "https://forum.makerdao.com/t/mip78-recognized-delegate-dai-compensation/16906",
                        "https://forum.makerdao.com/t/governance-and-risk-202-thursday-august-04-at-17-00-utc/16978",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-11-traduccion/16960",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-11/16959",
                        "https://forum.makerdao.com/t/governance-and-risk-202-thursday-august-04-at-17-00-utc/16978/2",
                        "https://forum.makerdao.com/t/mip77-delegates-in-the-maker-protocol/16905"
                    ],
                    "GPT-summary": "MIP79 proposes a method for calculating and executing MKR vesting streams for Recognized Delegates. The proposal seeks to establish aligned incentives between Recognized Delegates and MKR holders delegating to them by linking MKR vesting to DAI compensation received by Recognized Delegates. The proposal defines key terms, outlines the MKR vesting calculation process, describes the MKR distribution process, and includes a retrospective MKR vesting component. The post also includes examples to illustrate the proposed process. The proposal has been rejected.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Change to proposal pipeline",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.142746913580247
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/07/2022-15:04:30",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal Delegation MIP3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/07/2022-15:04:32",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/07/2022-16:56:14",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/07/2022-18:47:25",
                    "content": "I am writing as a community member; this is not an official ISCU communication.     Patrick_J:  By using DssVest to stream MKR over twelve months   I know this was a considered idea because I saw an earlier draft. However, this snippet seems inconsistent with the example given in MIPzzc2. Is DssVest still involved or is the entire amount of MKR immediately sent to the RD, as the example seems to suggest? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#6",
                    "likes": "1",
                    "time": "29/07/2022-18:52:06",
                    "content": "It should be a stream. I’m on mobile atm but when I’m back at my desk I’ll rewrite the example to make it more explicit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/squid",
                    "index": "#7",
                    "likes": "0",
                    "time": "30/07/2022-20:05:56",
                    "content": "Was there any evidence that delegates are underpaid? Sounds like the opposite to me. And now GovAlpha wants to effectively double their salaries just like that, including retrospective payments - why exactly? There’s literally no point holding MKR anymore. This is just the CUs and delegates helping themselves to the cookie jar while the protocol is no longer even profitable. What a shame… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#8",
                    "likes": "2",
                    "time": "31/07/2022-01:12:38",
                    "content": "Has someone calculated how much MKR will be owed under the retrospective vesting? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "4",
                    "time": "31/07/2022-20:56:28",
                    "content": "Good to see this being implemented.   It might bring compensation up to a more reasonable level when you add in the fact people would have to pay their own medical, and SSI (at least in the US) as well as income tax and taking into account various risk factors. Though I honestly I expect that if recognized delegates can self appoint and garner any reasonable amount of MKR they are going to take advantage.  My expectation is that ‘at some point’ the hurdle to become a delegate will change so that people can’t just self elect but some minimum amount of MKR has to nominate delegates to reduce governance compensation gaming. While It would be nice if MIP79 was retroactive I honestly don’t expect that will happen so congrats to the delegates moving forward because this will mean a doubling in pay.     squid:  Was there any evidence that delegates are underpai   For me the amount I was compensated for the time spent was approximately 1/2 of my full time job and I get pretty generous retirement benefits, medical covered and 1/2 my SSI as well.   So for me even at full pay as a Maker delegate it was a step down in pay and the sole reason I did not quit my full time job (which was the only reason I was able to participate at Maker as much - because my job is now mostly on-call status about 16/5/365 - minus vacation - sick).   As probably one of the oldest folks here at Maker the pay for the time requirement just couldn’t compensate for many others this pay will be significant and generous for their limited experience ability and time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.971166154633897
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "3",
                    "time": "01/08/2022-09:43:49",
                    "content": "    squid:  Was there any evidence that delegates are underpaid?   For 3F Delegate its about expanding and attracting Talent to help govern the protocol. Any incentives that can help 3F Delegate add one of the many talented people I meet at conferences, or folks who are curious about working in web 3 will be phenomenal. This is how I interpret the Recognized Delegate DAI & MKR comp. At the end of the day it’s not about any Delegate here, it’s about seeing this DAO flourish. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#11",
                    "likes": "1",
                    "time": "01/08/2022-10:04:27",
                    "content": "Changelog:  2022-08-01 - updated the examples to clarify the usage of DssVest streams as per @psychonaut suggestion. 2022-08-31 - updated multipliers. Delegates will now get their MKR entitlement multiplied by 0.75 if they opt for a 12-month stream but will qualify for the full amount if they opt for a 24-month stream to incentivise long-term thinking and aligned incentives.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#12",
                    "likes": "4",
                    "time": "01/08/2022-10:23:27",
                    "content": "Thanks for the comments so far.     squid:  Was there any evidence that delegates are underpaid? Sounds like the opposite to me.   In addition to what some of the Recognized Delegates have already commented, we often speak to people about becoming Recognized Delegates and hear that the maximum compensation is too low given their qualifications/experience and the uncertainty of delegate compensation - i.e. if you lose your delegated MKR then you lose your income. The Community has repeatedly requested that we attract people with expertise in financial and legal backgrounds, but the current compensation package is unattractive to people at the top of these fields. Further, aligning incentives between delegates and MKR holders through the use of MKR compensation is IMO crucial to further the interests of small MKR holders. By linking delegate compensation to MKR - they are increasingly incentivised to act in the interests of smaller MKR holders as this group now includes themselves, rather than in the interests of whales who have delegated the majority of their voting power. I’m open to a discussion about whether, instead of a 1 to 1 multiplier of DAI value to MKR value, we should use a 0.75:1 or 0.5:1 multiplier though.     CodeKnight:  Has someone calculated how much MKR will be owed under the retrospective vesting?   Yes, but remember that this MIP won’t be voted on until the September cycle, so the numbers will be different by then. If we were enacting this MIP today, numbers would be as follows, based on a 12-month SMA for the MKR token of 2138.96 DAI/MKR from 2021-07-31 to 2022-07-30:  3F Delegate - 44.66 MKR (8 months) Feedblack Loops - 44.68 MKR (8 months) schuppi - 42.75 MKR (8 months) MakerMan - 35.56 MKR (8 months) ACREinvest - 23.06 MKR (7 months) monetsupply - 15.14 MKR (8 months) JustinCase - 15.22 MKR (7 months) GFX Labs - 13.32 MKR (7 months)  No other Recognized Delegates have met the six-month cut-off for MKR compensation.     MakerMan:  While It would be nice if MIP79 was retroactive I honestly don’t expect that will happen so congrats to the delegates moving forward because this will mean a doubling in pay.   It is retroactive!     Patrick_J:  MIP79c4: Retrospective MKR Vesting Recognized Delegates that were active before this MIP was ratified will be entitled to receive MKR vesting for the periods they were active and compensated under either MIP61, the Delegate Compensation Trial, or any one-off payments directly related to their role as a Recognized Delegate. This includes Recognized Delegates that have stood down from the role as long as they completed the minimum requirement of six months as a Recognized Delegate.       flipflopflapdelegate:  its about expanding and attracting Talent to help govern the protocol   Agree. This is the intention behind MIP78 and 79 and is something that has been requested by the community, which is why we have taken the time to re-work the incentive structure. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None for the missing entries."
                    ],
                    "Sentiment": 5.259194958847737
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#13",
                    "likes": "0",
                    "time": "01/08/2022-16:50:12",
                    "content": "Should there be an initiative to burn at least the same amount of MKR that will be provided to RDs? From a MKR pov the increased RD compensation is financed by a decrease in MKRs value and while I understand the need to stay competitive to retain and attract talent it shouldnt come at the expense of MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#14",
                    "likes": "4",
                    "time": "01/08/2022-17:01:54",
                    "content": "“Recognized Delegate” should not be a career. It should be a call to duty and it should be, to some extent, a sacrifice. I am against this massive pay increase because I believe it will bring even more “career delegates” to the DAO who are primarily out for their own personal interests and only secondarily interested in helping the DAO. These “career delegates” won’t be genuine people with genuine interests. They will be whatever they think they need to be in order to gain delegated MKR. They will also not leave as long as they are able to make as much as $600k/yr under this new proposal. Turning Recognized Delegates into a “management” upper class of the DAO by increasing compensation to this extent is a huge mistake and I am firmly against it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.105113636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#15",
                    "likes": "1",
                    "time": "01/08/2022-17:16:23",
                    "content": "There needs to be a balance between compensation being too low that it deters participants and being too high that RDs act based on their self-interest first. A 600k potential annual salary will attract tons of smart people but also “gamers” and scammers. IMO its too high, especially with budget decrease exercise going on with the CUs. Getting the liquidity buffer to the 250M goal should be the priority and its sad to see some RDs with high MKR delegated putting their self-interests first ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.347142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#16",
                    "likes": "1",
                    "time": "01/08/2022-17:33:16",
                    "content": "I would consider spinning retroactive compensation off to it’s own proposal. It adds conflict of interest for some major delegates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#17",
                    "likes": "4",
                    "time": "01/08/2022-20:46:15",
                    "content": "Selflessly, I want the community to support this first before showing my opinions. Speaking to some points outlined by @flipflopflapdelegate and @Patrick_J - money is persuasive. This model has attracted full-time delegates, such as our team at Flipside, and raises the bar for delegates and their expertise across the board. Furthermore, Maker is competing for Governance resources. By rewarding participation, the decision is clear. As the processes and playing fields grow, increased upside potential and aligned incentives will create an environment of loyal and committed delegates. Why participate in XYZDAO when Maker can pay you? There’s no longer a conflict of resources. On a related note - delegation should not be a zero-sum game. Being a delegate / earning compensation is a privilege - and not a right. We must figure out how to return value to the delegators themselves. Wether a service, a community, or unique insights, this as an opportunity for delegates to distribute more value to the MKR holders themselves and push the bar. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.688852813852813
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#18",
                    "likes": "2",
                    "time": "01/08/2022-21:03:59",
                    "content": "I understand that the vast majority of MKR available for delegation is already delegated (controlled by a handful of known parties) and there are significant challenges with increasing participation in delegation. So, what would this change really accomplish if there’s not the available MKR to go around for the higher levels of comp that this proposal is advertising? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#19",
                    "likes": "1",
                    "time": "01/08/2022-21:17:15",
                    "content": "afaik, the Endgame tokenomics incentivises delegation. So this situation is supposed to change dramatically soon. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#21",
                    "likes": "4",
                    "time": "01/08/2022-22:11:01",
                    "content": "    ChrisBlec:  It should be a call to duty and it should be, to some extent, a sacrifice.   Chris you know you and I see a lot of things similarly but from now over 30+ years donating my time (as a volunteer) for many communities and now DAOs I can say that depending on ‘altruism’ is NOT SUSTAINABLE it also in effect is MKR holders taking advantage of work that any reasonable company would have to pay for - at market rates. To put this as simply as I can compensation is required to bring talent.   While I have stated the above I am going to completely agree with you on the following statement you made:     ChrisBlec:  These “career delegates” won’t be genuine people with genuine interests. They will be whatever they think they need to be in order to gain delegated MKR. They will also not leave as long as they are able to make as much as $600k/yr under this new proposal.   I don’t think I agree with the genuine interests part of the comment, but I agree these people will just be whatever they need to get the most MKR delegated to them.   I was running numbers btw and it looks like for 100MKR you can basically earn 20% return (20K/yr) just by being a delegate.  I can see Maker with like > 100 delegates in like a year if there is no cap on number of delegates and no real delegate election/competition.  Granted there is still this 3M total compensation mark (250K DAI/month) but I am going to stand by my basic comments where this delegate system will need to be changed. Delegates need to meet some minimum MKR nomination standard and not be allowed to self nominate. They should be elected for a term (have term limits btw) and have some minimum MKR delegated to them from the MKR being held by the protocol (so they have a minimum salary). The number of delegate slots should be fixed and like any election should have some competition to earn. Also there should not just be a code of conduct but a list of reasons a delegate can and should be removed from office just like in elected positions. To nominate I would use IOUs as the nomination token and require each delegate to have a minimum 10K IOU to be nominated (I also would like to see some locking so someone just can’t borrow 10K MKR from AAVE and nominate themselves).  Whether IOUs can nominate multiple people say via RCV nomination competition model (nomination model up for debate).   Delegate Elections voted with IOUs and using ranked choice voting to fill the available delegate slots. As to the compensation level as long as the total doesn’t exceed this 2-3M DAI/yr I would support it - WHY?  Because with say 10-12 delegate spots this would mean salaries between 200-300K/yr on average (even including the MKR vesting btw) and for people with significant skills and experience is not unreasonable.   Look the protocol Market cap is over 1B,  this is .2-.3% of the Market Cap in expenses/yr and no more than 5-10% of the total annual expense budget. If Maker can get truly qualified and dedicated delegates here I think it is well worth the expense as I consider governance as important (if not more so) than PECU and governance takes on the vast majority of the litigation, regulation risks. As the system stands right now (and even with MIP77, 78, 79 approved) I see Maker rapidly increasing the number of delegates because even people with 100MKR earn a decent return simply by pushing voting buttons every week as their work to get rewards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.583506192881193
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#22",
                    "likes": "3",
                    "time": "01/08/2022-22:20:23",
                    "content": "    Patrick_J:  It is retroactive!   btw I wanted to comment on this - yay!   Finally I will get some MKR for at least some of my work for Maker in the past 3.7 years and glad to see delegates finally getting on the right side of the reward page. Also interesting how the reward curve was just extended.  I will be surprised to see if anyone can get 30K MKR delegated to them.  If I was going to bet I’d have to say 3F most likely to get back to 30K but hell anyone saying ‘yes’ to endgame going to get some Rune MKR as we have already seen manifest… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.607142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#23",
                    "likes": "3",
                    "time": "02/08/2022-11:16:08",
                    "content": "    ChrisBlec:  Turning Recognized Delegates into a “management” upper class of the DAO by increasing compensation to this extent is a huge mistake and I am firmly against it.   Thank you for your candour, Chris. Is there a compromise amount you would consider supporting? From my perspective, the upper bound of the compensation curve is extremely difficult to reach, requiring 30k MKR to be delegated over the course of a year, and demonstrates a delegate is truly exceptional to have that trust from MKR holders, and they should be rewarded for that. However, as stated in our discussion in Discord last week, I am more than happy to tweak numbers.     TRUEMAKER:  A 600k potential annual salary will attract tons of smart people but also “gamers” and scammers.   MKR holders are always in control of who they are delegating to. If someone is a gamer or a scammer, delegators should un-delegate from them. The cap on total outlay also protects from wide-spread abuse of the system.     CodeKnight:  consider spinning retroactive compensation off to it’s own proposal. It adds conflict of interest for some major delegates.   I thought about that, but the standalone proposal for retroactive compensation would still have that conflict of interest attached to it, so I’m not convinced it’s a necessary step.     fig:  Why participate in XYZDAO when Maker can pay you? There’s no longer a conflict of resources.   This thinking has informed a lot of these proposals. We want the best of the best to want to become delegates in MakerDAO - but you need to pay for that.     ACREinvest:  I understand that the vast majority of MKR available for delegation is already delegated (controlled by a handful of known parties) and there are significant challenges with increasing participation in delegation.   I’m not convinced this is true. We are still seeing a steady increase on a month-by-month basis in the amount of MKR delegated and the weight of MKR from the two largest delegators is also slowly falling over time, suggesting more MKR is continuing to enter the system. If there is no extra MKR to enter the system, these changes will have a fairly minimal effect on the “bill” to the DAO of the RD program, except for the additional MKR vesting element. However, it also massively incentivises RDs to seek out new sources of delegation rather than being able to rely on a single delegator to achieve maximum compensation. This is decentralising as it will broaden the pool of delegated MKR if they are successful.     pvl:  incentivises delegation.   We have discussed proposing this internally. Holding off for now but this would be a way to incentivise more MKR into the voting system if we wanted to pursue it. @MakerMan, this entire comment was great, and you raised some interesting points. If we are inundated with new delegates in the system, we can tune down the rewards to smaller delegates through parameter adjustments (which MIP78 is already doing). Do you think we should tune it further away from smaller delegates?     MakerMan:  some minimum MKR delegated to them from the MKR being held by the protocol (so they have a minimum salary).   I’ve previously written here about why I’m opposed to this due to security risks.     MakerMan:  Delegates need to meet some minimum MKR nomination standard and not be allowed to self nominate.   Agree that this would be good to have, but in practice, it’s impossible to enforce. How can we be sure that someone isn’t funding themself from another account?     MakerMan:  Also there should not just be a code of conduct but a list of reasons a delegate can and should be removed from office just like in elected positions.   The initial draft of MIP77 had a component for censuring RDs, but we were concerned these could be used maliciously/frivolously. Essentially if there’s an on-chain component, then the biggest RDs can collude against a smaller RD they wish to punish, and if it’s off-chain, then whoever is in charge of this assessment has a lot of extra influence over RDs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9156277750027755
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#24",
                    "likes": "1",
                    "time": "02/08/2022-12:55:39",
                    "content": "    Patrick_J:  I thought about that, but the standalone proposal for retroactive compensation would still have that conflict of interest attached to it, so I’m not convinced it’s a necessary step.   The point is delegates would be pressured to abstain on as little as possible. We should try to isolate  conflicts of interests so they can still vote on the overall idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.765625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#25",
                    "likes": "4",
                    "time": "03/08/2022-04:00:40",
                    "content": "    Patrick_J:  @MakerMan, this entire comment was great, and you raised some interesting points. If we are inundated with new delegates in the system, we can tune down the rewards to smaller delegates through parameter adjustments (which MIP78 is already doing). Do you think we should tune it further away from smaller delegates?   I understand the reason to incentivize delegates who don’t have a lot of delegated MKR but I am somewhat convinced given the current methodology (previous and 77-79 being proposed) that the non-linear MKR rewards create some unintended consequences the first of which will be seen by many smaller MKR delegates coming forward and not doing much beyond what is required.  I would also hazard over time as long as abstaining counts as a full participation point more and more delegates will just start abstaining.   I try to refrain from this but have considered doing it to force the issue/point. I honestly don’t have a good answer to your question of whether it should be tuned because you have to look at the entire approach here and in total I just see the likely consequences of the choices which will force governance to re-think delegation in some of the ways I already have put forward above.     Patrick_J:  I’ve previously written here  about why I’m opposed to this due to security risks.   I disagree with the logic in your objection above because one can pick a reasonable minimum that doesn’t and can’t overrule the rest of the MKR (say 1K MKR per delegate as the protocol minimum allocated to each delegate btw for term).   One would expect that the nominating IOUs would or could guarantee the minimum 1K MKR for termand perhaps this might be a better way than using protocol MKR to support delegates.    The real problem here is delegates having their MKR yanked by MKR holders.    I’ll tell you what @Patrick_J you let me know how people feel when the budget cuts go about the idea of one day having a budget, and the next day having to lay off people or cut salaries by 20-30%.  Magnify this perhaps by a fact or 2 or 3 for delegates and you come to realize how precarious their positions are in terms of compensation.   Now if a delegate has a great relationship with a delegator - well then they may not have to worry and maybe this is good for the protocol governance wise.   But then lets get past this whole delegates are not centralized and can be independent because in the end what will be found is ‘they can’t and won’t’ delegates will have to effectively be appointed by MKR holders and so why not get on with a process of doing that then?   Like forcing MKR to gather together to basically sponsor by both nomination and a term committment to delegate at least a base minimum to delegates. Frankly at this point I wouldn’t touch a delegate position without some MKR holder (and I’d rather it be a single entity vs. like 3 btw so I don’t have to risk my delegators disagreeing on how I voted and one pulling their support from me) committing to at least 10-20K MKR for at least a 1yr term.   Even then this wouldn’t be sufficient for me to quit my full time job unless I was already going to retire.    My personal position here is probably unique.  I think there are a number of people who in effect ‘are retired’ and basically do this because they can (they don’t need the money) and others who probably haven’t even really had their first job thinking 100-200K/yr or even 50-75K/yr is a great first job (third world these salaries are very high imo) and are willing to take on the risk.  Hell the actual requirements for what a delegate does is so minimal that I can see tons of people doing this.   Frankly I refuse to just be a button pushing delegate, siphoning money from the protocol.  I know enough people I probably could easily command 1-3K MKR indefinitely but that isn’t my style and I just am not going to 1/2 ass being a delegate just for some DAI.   It was my hope to contribute positively but I don’t feel I can do that any more in this environment, I am not even sure how much I have contributed (by MIPs passed it seems not so much) but again that is my opinion.     Patrick_J:  Agree that this would be good to have, but in practice, it’s impossible to enforce. How can we be sure that someone isn’t funding themself from another account?   Which part is impossible to enforce.  Right now Rune could declare himself delegate and basically give himself 30K/yr.  I really don’t see an issue with that.   The issue isn’t someone funding themselves but making sure that each delegate is backed by some MKR via a competitive nomination standard and filling some limited amount of seats delegates have to compete for vs. being self appointed not competing for position or compensation.     Patrick_J:  The initial draft of MIP77 had a component for censuring RDs, but we were concerned these could be used maliciously/frivolously. Essentially if there’s an on-chain component, then the biggest RDs can collude against a smaller RD they wish to punish, and if it’s off-chain, then whoever is in charge of this assessment has a lot of extra influence over RDs.   I would treat this as follows:   RDs basically censure other RDs also just like off-boarding I would personally support some sort of MKR being put up before such actions can be posted.  This is something else I see in the future for these protocols.   Having to put up a slashable bond on important actions being put forward in the protocol.   Like how is it bad to have someone have to put up 1MKR to offboard a 1M CU?   I mean if these are important and successful you can make these bounties.  Put up 1MKR to put forward X, get say 2-5MKR back as a bounty if it is successful lose the 1MKR if it isn’t. Sure this makes a barrier to entry on important issues - but I am back again to why shouldn’t we have this barrier to entry on these?   And just wait until the DAO starts to get spammed by off-boarding, on-boarding, and general MIP updates…  idk.   I am already seeing how DAOs are beginning to get gamed and I don’t see these solutions standing up long term against such activities. I can’t count the things that started out not just free that ended up having to have some kinds of barriers put into place to stop spamming, but how they needed to be changed to eliminate gaming of rewards. BTW:  Don’t get me wrong I am an advocate for increase in delegate compensation, and adding MKR vesting (this puts delegates on equal footing to CUs in terms of work and rewards).   I just think this whole self nomination (no barriers to DAO entry), no real elected terms, unlimited delegate slots, high compensation, low performance expectations etc is going to lead to a lot of unintended consequences that in time will need to be addressed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.701924475636597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#26",
                    "likes": "0",
                    "time": "25/08/2022-18:08:55",
                    "content": "Reminder that this proposal will enter its Frozen Period in one week, on Thursday September 1st at 00:00UTC. Substantive modifications beyond that time will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/squid",
                    "index": "#27",
                    "likes": "0",
                    "time": "30/08/2022-19:58:02",
                    "content": "    ChrisBlec:  I am against this massive pay increase       Patrick_J:  maximum compensation is too low given their qualifications/experience and the uncertainty of delegate compensation - i.e. if you lose your delegated MKR then you lose your income   When current delegates see the increase as massive, why do so? Why not increase comp slowly, if it is the case that delegates are not adequately compensated (and that itself is quite far from true)? If job security is the issue then small but guaranteed payments is better than just doubling everyone’s salary and claiming the lack of job security is now not a problem anymore… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.116666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#28",
                    "likes": "0",
                    "time": "31/08/2022-13:34:57",
                    "content": "Hi squid, nothing will change unless delegates/MKR holders support the MIPs in an on-chain vote. Delegates are welcome to vote against these proposals if they do not support them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 9.0
                }
            ]
        }
    ]
}