{
    "poll_list": [
        {
            "title": "Inclusion Poll for Operational Support Domain Definition (MIP28)- November 9, 2020",
            "index": "4627",
            "option": "Yes",
            "supporting_mkr": "31,485",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip28-operational-support-domain-definition/4627",
            "title": "MIP28: Operational Support Domain Definition ",
            "index": 4627,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "domain-teams",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#1",
                    "likes": "7",
                    "time": "07/10/2020-18:47:42",
                    "content": "Preamble MIP#: 28 Title: Operational Support (OS) Domain Definition Author(s): @AmyJung Contributors: n/a Type: General Status: Formal Submission (FS)  Date Proposed: 2020-10-07 Date Ratified: n/a Dependencies: n/a Replaces: n/a  References MIP28c7-Subproposal-Template.md MIP28c8-Subproposal-Template.md Sentence Summary MIP28 defines the Operational Support domain according to the domain definition template provided in MIP23. Paragraph Summary The Operational Support (OS) domain’s key function is to ensure the development and management of distributed operations at MakerDAO. Additionally, the Operational Support domain is responsible for helping domain teams coordinate to complete objectives and manage shared resources. The domain’s main responsibilities fall into three categories:  General operations for domains Cross-domain team coordination Grants management and distribution  Component Summary MIP28c1: Operational Support Domain Overview Provides an overview of the Operational Support domain. MIP28c2: Operational Support Facilitator Role and Responsibilities A list of the responsibilities taken on by Operational Support Facilitators. MIP28c3: Operational Support Facilitator Candidate Criteria A list of the qualities and qualifications suggested for Operational Support Facilitators. MIP28c4: Operational Support Facilitator Removal Criteria A list of the criteria under which an Operational Support Facilitator should be considered for removal. MIP28c5: Operational Support Facilitator List A list of the current Operational Support Facilitators and their details. MIP28c6: Operational Support Contributor List A list of the current Operational Support Contributors and their details. MIP28c7: Operational Support Facilitator Onboarding Component A process component that allows for the onboarding of an Operational Support Facilitator. MIP28c8: Operational Support Facilitator Offboarding Component A process component that allows for the offboarding of an Operational Support Facilitator. Motivation As initial domain teams mature and more domain teams emerge, MakerDAO will need a group to support coordination of various teams and ensure resources are allocated effectively across teams. This domain team is focused on supporting other domain teams and serving the best interests of MakerDAO through an operational lens. Staying true to the nature of decentralized organizations, the Operational Support domain would seek to have domain teams remain independent, yet collaborative for the continued development of the Maker Protocol and MakerDAO members. Specification / Proposal Details MIP28c1: Operational Support Domain Overview The Operational Support (OS) domain’s key function is to ensure the development and management of distributed operations at MakerDAO. Additionally, the Operational Support domain is responsible for helping domain teams coordinate to complete objectives and manage shared resources. The domain’s main responsibilities fall into three categories:  General operations for domains Cross-domain team coordination Grants management and distribution  Naturally, the focus of the domain functions will change with the maturity of MakerDAO. Functions are divided into “Short Term”, which defines temporary responsibilities during early stages of the DAO structure, and “Long Term”, which defines responsibilities that will remain permanently and be refined as the DAO matures. Short Term Functions:  Bootstrap initial operations of domains that are not yet developed or difficult to scale quickly, such as Finance, HR, Legal, Partnerships, TechOps, etc. Bridge and manage resources from Maker Foundation. Propose growth focused minimum operational framework and guidance documents. Support domain teams transition into DAO structure; support domain teams in initial setups.  Long Term Functions:  Identify potential bottlenecks and opportunities for more effective coordination and resource distribution to domain teams. Incubate and provide grants funding for smaller working groups and proto-teams. Coordinate domain budget proposals and payments. Help new domain teams onboard. Manage account permissions to any shared MakerDAO resources (ie. Github, Forum, etc).   MIP28c2: Operational Support Facilitator Role and Responsibilities The Operational Support domain will focus on three sectors, ideally with a Operational Support Facilitator focusing in each area.  General Operations Cross-Domain Coordination Grants  A Operational Support Facilitator has the following responsibilities in addition to those detailed in MIP28c1: General Operations:  Ensure resources are distributed outlined by Governance. Produce reports for the community on resource funding and spending. Research tooling in the ecosystem, and coordinate with partners for potential pilots. Set up key metrics and feedback loops to be able to adapt processes as necessary.  Cross-Domain Coordination:  Plan and develop new domain onboarding processes. Work closely with Governance to organize and facilitate open communication and collaboration processes that ensure coherence across teams. Identify and support key initiatives, facilitate prioritization, and organize the execution of important roadmap initiatives, such as collateral onboarding. Support standardization of documentation used to scope, resource, track and archive project developments. Strive to improve transparent process and communication.  Grants:  Produce grant initiatives to incentivize the fulfillment of DAO objectives. Improve recruitment to ensure a healthy pipeline of potential grantees. Manage grantee payments.  Generally, Operational Support Facilitators must keep the lists in component MIP28c5 and MIP28c6 up to date.  MIP28c3: Operational Support Facilitator Candidate Criteria The following criteria should be used when evaluating an individual for the role of a Operational Support Facilitator:  Experience in one or more of General Operations (Finance, HR, Legal, TechOps, etc.). Experience in project management and managing cross-functional operations. Excellent team facilitation skills. Able to work collaboratively and communicate effectively in diverse environments with teammates, organizational stakeholders, and community members. Should have familiarity with MakerDAO and general understanding of Maker Protocol. Should show interest in participation in the MakerDAO community. Should have a general understanding of each domain and how they connect. Should be comfortable moving projects from ideation to implementation. Experience working with distributed teams. (Nice to have)   MIP28c4: Operational Support Facilitator Removal Criteria A Operational Support Facilitator should be considered for removal if they are:  Displaying biased or malicious behaviour which are not serving in the best interest of domain teams and MakerDAO. Majority domain teams feel they are not being supported by the current Operational Support Facilitator. Misusing resources or favoring one domain over another. Absent from their duties for a prolonged period. Expressing unwillingness to continue in their role.   MIP28c5: Operational Support Domain Facilitator List This list can be amended by the Operational Support Domain Facilitators at any time to reflect the current state of the Operational Support Domain. It is the responsibility of the Operational Support Domain Facilitators to keep this list accurate and up to date. Entries into this list should follow the following template: Name:  Sub-proposal Number: MIP28c7-SP# Date Added: YYYY-MM-DD Authorized Address:   There are currently no Operational Support Facilitators.  MIP28c6: Operational Support Contributor List This list can be amended by the Operational Support Facilitators at any time to reflect the current state of the Support domain. It is the responsibility of the Operational Support Facilitators to keep this list accurate and up to date. Entries into this list should follow the following template: Name:  Sub-proposal Number: MIP28c7-SP# Date Added: YYYY-MM-DD About me: (paragraph describing qualifications / experience / etc)  There are currently no Operational Support Contributors.  MIP28c7: Operational Support Facilitator Onboarding Component MIP28c7 is a Process MIP component that allows the onboarding of Operational Support Facilitators using a subproposal. MIP28c7 subproposals have the following parameters:   Feedback Period: 1 month  Frozen Period: 1 week  MIP28c7 subproposals must use the template located at  MIP28c7-Subproposal-Template.md. This template is considered ratified once this MIP moves to Accepted status.  MIP28c8: Operational Support Facilitator Offboarding Component MIP28c8 is a Process MIP component that allows the offboarding of Operational Support Facilitators using a subproposal. MIP28c7 subproposals have the following parameters:   Feedback Period: 0 months  Frozen Period: 0 month  MIP28c8 subproposals must use the template located at  MIP28c8-Subproposal-Template.md. This template is considered ratified once this MIP moves to Accepted status. Domain Facilitators may voluntarily offboard themselves by filling out the MIP28c8 subproposal template and posting it publicly in the official forum and making a brief public statement on the weekly governance and risk meeting. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/formal-submission/MIP23/MIP23c4-Domain-Offboarding-Template.md",
                        "https://github.com/makerdao/mips/blob/formal-submission/MIP23/MIP23c4-Domain-Onboarding-Template.md",
                        "https://github.com/makerdao/mips/blob/formal-submission/MIP23/MIP23c4-Domain-Offboarding-Template.md",
                        "https://forum.makerdao.com/t/maker-relay-ep-21-en-espanol/5199",
                        "https://forum.makerdao.com/t/working-group-autonomous-makerdao-update/5197",
                        "https://forum.makerdao.com/t/maker-relay-ep-21/5181",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-20-en-espanol/5084",
                        "https://forum.makerdao.com/t/maker-relay-ep-20/5078",
                        "https://forum.makerdao.com/t/maker-relay-ep-19-en-espanol/4981",
                        "https://forum.makerdao.com/t/maker-relay-ep-19/4975",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-114-thursday-october-15-16-00-utc/4657/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-pt-br-portugues/4810",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-en-espanol/4804",
                        "https://forum.makerdao.com/t/maker-relay-ep-17/4798",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-16-pt-br-portugues/4722",
                        "https://forum.makerdao.com/t/maker-relay-ep-16-en-espanol/4719",
                        "https://forum.makerdao.com/t/maker-relay-ep-16/4710",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/5",
                        "https://forum.makerdao.com/t/road-to-dao-the-core-unit-operating-model/6105/10",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-april-5-8-2021/7381",
                        "https://forum.makerdao.com/t/maker-governance-review-november-2020/5453"
                    ],
                    "GPT-summary": "MIP28 is a proposal that defines the Operational Support domain and its responsibilities in MakerDAO. The domain's main responsibilities are general operations for domains, cross-domain team coordination, and grants management and distribution. The proposal includes details on the role and responsibilities of Operational Support Facilitators, candidate criteria, removal criteria, and onboarding and offboarding components. The proposal is explained in detail, and there is potential for constructive criticism, questions, and collaboration.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Change to proposal pipeline",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.75770944741533
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "3",
                    "time": "12/10/2020-12:51:49",
                    "content": "So there are a number of things I want to say about this. First, I want to say that recently @amyjung and @juan have been working on the short and long term functions of this domain already. This has been incredible helpful to me personally, and I expect has also been invaluable to the other domain teams. In my eyes, the utility of having people working on the points details here has been proven over the last few months. Secondly, Amy herself has proven herself competent and reliable in these areas, and I fully support her becoming the first Operational Support Facilitator. The specific things this domain (and all domains) can cover is not set in stone, it can be modified by amending this MIP. In the future, I fully expect the requirements of this domain to change and for the roles and responsibilities to evolve, and that’s completely fine. Right now, this covers a lot of what we need to further decentralize the domain functions. And finally, some minor feedback points:     amyjung:  The Operational Support domain will focus on three sectors, ideally with a Operational Support Facilitator in each specialization.   I’ve commented on this before to Amy privately, but I want to make sure that we don’t lose resilience through specialization. I feel that it’s important that all the facilitators within a domain are able to cover all the responsibilities, even if in the day-to-day certain people tend to cover bases.     amyjung:  Majority domain teams (51%) feel they are not being supported by the current Operational Support Facilitator.   Not sure if this should be a majority. I think that if any domain is feeling unsupported then that is grounds for considering removal of facilitators (not necessarily going through with removal, but it should be discussed at least.)     amyjung:  Authorized Address:    I wanted to ask whether this would be provided when you are hopefully ratified, or whether you will not worry about it until it comes up as a requirement to do something. In my mind it should be provided up front for ease of integration later, but I also don’t think it’s a major issue.     amyjung:  MIP28c7 subproposals must use the template located at MIP28c7-Subproposal-Template.md . This template is considered ratified once this MIP moves to Accepted status. MIP28c8 subproposals must use the template located at  MIP28c8-Subproposal-Template.md . This template is considered ratified once this MIP moves to Accepted status.   These templates should be referenced in the References section at the top. I would also remove your onboarding subproposal from that same section. Technically it isn’t referenced in this document. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-19/4935",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-pt-br-portugues/4891",
                        "https://forum.makerdao.com/t/maker-relay-ep-18/4881",
                        "https://forum.makerdao.com/t/weekly-mips-update-18/4847",
                        "https://forum.makerdao.com/t/weekly-mips-update-17/4746"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.736309523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#3",
                    "likes": "3",
                    "time": "28/10/2020-21:01:20",
                    "content": "    LongForWisdom:  I’ve commented on this before to Amy privately, but I want to make sure that we don’t lose resilience through specialization. I feel that it’s important that all the facilitators within a domain are able to cover all the responsibilities, even if in the day-to-day certain people tend to cover bases.   I edited this to “focusing on each area” to cover the comment about specialization.     LongForWisdom:  Not sure if this should be a majority. I think that if any domain is feeling unsupported then that is grounds for considering removal of facilitators (not necessarily going through with removal, but it should be discussed at least.)   @LongforWisdom and I discussed this offline. “Majority” will cover this statement. The root of this is the grounds and process for facilitator removal. We will work on a formal escalation process for facilitator removal process.     LongForWisdom:  I wanted to ask whether this would be provided when you are hopefully ratified, or whether you will not worry about it until it comes up as a requirement to do something. In my mind it should be provided up front for ease of integration later, but I also don’t think it’s a major issue.   I think it make sense to wait until ratified or add the authorized address to the subproposal submission. Currently it only asks in this MIP.     LongForWisdom:  These templates should be referenced in the References section at the top. I would also remove your onboarding subproposal from that same section. Technically it isn’t referenced in this document.   Updated, I think this should be updated on the MIP template to clarify to something like “Document References”, as I took this as “Any references in this MIP” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.580994897959184
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#4",
                    "likes": "4",
                    "time": "28/10/2020-21:08:21",
                    "content": "Changes have been updated here and on Github, including a correction on the Frozen Period which should be 1 week. This is being put forth to Formal Submission. https://github.com/makerdao/mips/pull/124 ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-21/5222",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/4",
                        "https://forum.makerdao.com/t/weekly-mips-update-20/5009",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/4",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-116-thursday-october-29-16-00-utc/4835/4"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2811"
}