{
    "poll_list": [
        {
            "title": "Appoint DeFi Saver as Oracle Light Feed (MIP10c14-SP7) - April 5, 2021",
            "index": "7207",
            "option": "Yes",
            "supporting_mkr": "12,386",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c14-sp7-proposal-appoint-defi-saver-as-a-light-feed/7207",
            "title": "MIP10c14-SP7 Proposal: Appoint DeFi Saver as a Light Feed ",
            "index": 7207,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "defi-saver",
                "oracle-lightfeed-sp"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nikola_j",
                    "index": "#1",
                    "likes": "11",
                    "time": "26/03/2021-01:31:00",
                    "content": "MIP10c14: Subproposal to Appoint DeFi Saver as a Light Feed for the Maker Oracles Preamble MIP10c14-SP#7:  Author(s): Nikola Jankovic Contributors: Nenad Palinkasevic, Nikola Klipa Type: Process Component Status: Proposed Date Proposed: 2021-03-26 Date Ratified: <yyyy-mm-dd>  Specification Organization  Name: DeFi Saver Website: https://defisaver.com/  Github: DeFi Saver - Github  Number of Employees: 10 Email: [email protected]  Incorporated: 2021 Domiciled: Delaware When was the organization founded? 2017 (as team Decenter, while DeFi Saver was initially introduced in January 2019, and later incorporated as such in 2021) Who are the major investors in your organization?: N/A How much funding has the organization raised either privately or through a token sale?: DeFi Saver is self funded. Please provide public references for the above where possible: N/A  Introduction Motivation for running a Light Feed As long time participants in the MakerDAO ecosystem and passionate builders on the MakerDAO protocol, we recognize the importance of maintaining the protocol healthy and want to further help make it more robust. Community What has your organization contributed to the crypto community? DeFi Saver has most notably provided one of the most popular alternative management apps for MakerDAO, ever since early 2019. During our time building in the Maker ecosystem we believe we both helped the protocol grow, as well as maintain its health and stability, especially through major market drops. We have also provided additional tools such as DeFi Explore (an MCD explorer akin to mkr.tools for SCD), a liquidation auctions UI, and automated SCD to MCD migration options, aiding the move to MCD in late 2019. Successful products, services, tools, libraries, thought-leadership DeFi Saver as an alternative management app for MakerDAO. (https://app.defisaver.com/) DeFi Explore as an MCD version of the famous mkr.tools. (https://defiexplore.com/) Maker auctions UI as an alternative tool for participating in liquidation auctions. (Intro post) How will the Maker Community benefit from your inclusion as a Light Feed? Being one of the most well known teams in the MakerDAO ecosystem and among the longest building teams in the DeFi space, we believe our addition as a stakeholder will help further strengthen the MakerDAO ecosystem. ",
                    "links": [
                        "https://github.com/DecenterApps/defisaver-contracts",
                        "https://app.defisaver.com/",
                        "https://defiexplore.com/",
                        "https://medium.com/defi-saver/introducing-a-simple-makerdao-collateral-auctions-dashboard-53f8a1d8ce88",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-135-thursday-april-1-17-00-utc/7206/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-39-en-espanol/7360",
                        "https://forum.makerdao.com/t/maker-relay-ep-39/7330",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/24",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-135-thursday-april-1-17-00-utc/7206/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-42/7673",
                        "https://forum.makerdao.com/t/maker-relay-ep-41-en-espanol/7614",
                        "https://forum.makerdao.com/t/maker-relay-ep-41/7571",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-137-thursday-april-15-17-00-utc/7384/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Change to proposal pipeline",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.858870967741936
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "2",
                    "time": "28/03/2021-09:26:35",
                    "content": "    nikola_j:  we believe we both helped the protocol grow, as well as maintain its health and stability   Definitely true! In fact, let me ask: have you considered forming a “DeFi Saver” Core Unit to integrate even more your products with MakerDAO, and potentially be supported (to some extent) by MakerDAO? Of course you now have your own business, total freedom etc. But the “MakerDAO Core Unit” structure is very flexible, and it would easily accomodate for some kind of lax-integration  Keep up the great job! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0949074074074066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nikola_j",
                    "index": "#5",
                    "likes": "3",
                    "time": "24/04/2021-15:08:07",
                    "content": "{   \"address\": \"0xd72ba9402e9f3ff01959d6c841ddd13615ffff42\",   \"msg\": \"We are DeFi Saver and our public key is 0xd72ba9402e9f3ff01959d6c841ddd13615ffff42\",   \"sig\": \"0x33e68a1defc83003d816705c41fc4bdf2bbdb94739227e35e5e2e24d4962b7f505ddd1913896407df7dddedc17f32f8a7a52e517224e524c6ee5ad7e301b0f1a1c\",   \"version\": \"2\"   } ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nikola_j",
                    "index": "#6",
                    "likes": "1",
                    "time": "24/04/2021-15:10:54",
                    "content": "Please excuse the delay on our end, slight miscommunication on my part before heading out on a quick little vacation. Looking forward to the verification! (cc @NikKunkel I believe👀) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.852864583333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "1",
                    "time": "24/04/2021-15:41:07",
                    "content": "    iammeeoh:  In fact, let me ask: have you considered forming a “DeFi Saver” Core Unit to integrate even more your products with MakerDAO, and potentially be supported (to some extent) by MakerDAO?   I think this deserves its own thread. I in particular would like to see a push into new financial products by the end of the year, and partnering with some of the more consumer-facing organizations seems like it opens up some really powerful possibilities ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3768939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#8",
                    "likes": "4",
                    "time": "25/04/2021-21:44:21",
                    "content": "The Oracle Domain Team has verified your address and will include it in the next regular Executive Vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "26/07/2021-03:44:38",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3403"
}