{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/encuesta-informal-ideas-de-prestamo-de-incentivos-de-dai-que-la-dao-podria-probar-traduccion/16218",
            "title": "[Encuesta Informal] Ideas de pr\\xc3\\xa9stamo de incentivos de DAI que la DAO podr\\xc3\\xada probar [Traducci\\xc3\\xb3n] ",
            "index": 16218,
            "category": [
                "Latin America"
            ],
            "tags": [
                "informal-poll",
                "espa\\xc3\\xb1ol",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#1",
                    "likes": "9",
                    "time": "29/06/2022-19:58:13",
                    "content": "El bear market ha provocado la liquidación de una cantidad increíble de vaults de ETH/BTC, lo que ha llevado a que sólo el 5-10% del total de las vaults de ETH y el 10-15% del total de las vaults de BTC permanezcan activas (basado en MCD Vaults Tracker). Además, según los últimos datos financieros facilitados aquí, sólo hay 1 millón de ingresos anuales de intereses de préstamos recurrentes proyectados en base al uso actual de la vault. Para combatir esto, estoy elaborando una encuesta informal para generar ideas sobre cómo el protocolo puede recuperar algunos TLV e ingresos. Lo que se indica a continuación sería sólo para los nuevos wallets/usuarios, con la excepción de la opción de recompensas por recomendación, que es mi favorita dado que el boca a boca es, según la IMO, la mejor estrategia de adquisición de clientes. La votación es anónima y se agregará a los votos de otros miembros. La encuesta se cerrará el 1 de julio a las 11:59 pm ET, resumiré las respuestas en la sección de comentarios.  ¿Ideas que la DAO debería probar para incentivar el préstamo de DAI? (Sólo wallets nuevas)  0% de Stability Fee por 90 - 180 días (para ETH, BTC, etc) 0% de Liquidation Fee si la liquidación ocurre en 90 - 180 days (para ETH, BTC, etc) 5% de recompensas MKR durante 90 - 180 días (con un límite de X cantidad) 5% de DSR por 30 - 90 días (con un límite de X cantidad) Recompensas por referidos a través de 30 - 90 días de Stability fee del 0% por cada nueva wallet que abra una vault utilizando su código de referido Ninguna de las anteriores- Por favor inserte idea en los comentarios   Si te gustaría participar en esta encuesta puedes votar aquí  Esta es una traducción libre del topic [Informal Poll] DAI borrowing incentive ideas that the DAO could test? de @TRUEMAKER Créditos: Traducción @Brigith238 - Revisión @FuchoCrypto ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-bear-building-financial-resilience-dao-targets/16004/12",
                        "https://forum.makerdao.com/t/informal-poll-dai-borrowing-incentive-ideas-that-the-dao-could-test/16057",
                        "https://forum.makerdao.com/t/informal-poll-dai-borrowing-incentive-ideas-that-the-dao-could-test/16057"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#2",
                    "likes": "3",
                    "time": "29/06/2022-21:03:42",
                    "content": "Gracias Brigith! Poll termina el Viernes  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "2",
                    "time": "01/07/2022-13:39:38",
                    "content": "Excelente trabajo Brigith!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}