{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/a-series-of-questions-about-strategy/7487",
            "title": "A Series of Questions About Strategy ",
            "index": 7487,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#1",
                    "likes": "11",
                    "time": "13/04/2021-22:18:56",
                    "content": "I want to continue the conversations started here and elsewhere to talk around business strategy and build on @SebVentures Crypto Banking 101 article in the interest of providing some framework for the discussion. Seb’s article concludes with the question:  “How do you manage your balance sheet to meet the constraint of solvency and liquidity while optimizing the spread between founding and investment rate?”  The merits of promoting MakerDAO as a crypto bank may be debatable (and I’ll come back to that) but the mechanics at play in MakerDAO appear to be consistent with that of a bank, as Sebastien has defined it. If we accept this, then we can start thinking about what it means to optimize our spread.  How do we maximize the number of Dai in circulation? In other words, how do we increase the supply of, and demand for, Dai? Adding new collateral types and raising debt ceilings increases supply while demand grows through B2B integrations and the development of B2C markets.   What types of value have been realized through B2B integrations and which types of integrations currently hold the most potential value?   Similarly, what types of value have been realized by building B2C markets and which types of efforts currently hold the most potential value?   It’s worth remembering that it’s easier to see the value in existing markets than ones that have to be built, particularly with regard to B2C. We may generate more money in the short-term by tapping into existing markets but the network effects in building new ones could have long-term returns that dwarf the value of those potential short-term gains. In any case, I think it would be particularly interesting to hear from @Nadia and the Growth team as well as the rest of the community about where we’ve seen successes we can double down on.  To what degree should we publicly discuss business strategy?   Given its position and resources, what investments offer the best risk/return for MakerDAO? This question is ultimately about treasury management and I see two sides to that coin:   How do we effectively organize and manage a workforce?   What’s the best way to manage risk while maximizing the returns on our treasury?   We’re navigating #4 by addressing issues around this transition to the Core Unit model. Are there things besides MKR vesting we might want to standardize across Core Units or other issues worth addressing? I’ve heard @NikKunkel talk about leveraging our oracles and been curious myself about what sort of opportunities might lie in our networks of people and companies supplying digital and real-world assets. What’s the next step for the reserve asset of the Web3 economy? Barter? Insurance? VC? I don’t expect detailed answers but it might be helpful to think about how to tackle this question: do we need a Core Unit or Working Group to explore this topic?  Closing Thoughts Optimizing our spread is critical but it’s also worth considering what effects any strategies we pursue could have on things like the value of our brand. To return to that point about positioning MakerDAO as a crypto bank, I understand where @flipflopflapdelegate’s coming from with the point about people having mixed feelings about banks. In my experience, “Banks/corporations suck” is a popular narrative with certain audiences and especially those in crypto but it also comes off as immature to others. Fortunately, we have the freedom to be a bank in the ways we want to be a bank and be whatever else we want in the ways that we don’t. So, what do you think we should be? ",
                    "links": [
                        "https://medium.com/@sebastien.derivaux/crypto-banking-101-ece9f1c2b031",
                        "https://forum.makerdao.com/t/discussion-maker-and-the-de-central-bank-meme/7327/5",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-april-18th-2021/7602",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-137-thursday-april-15-17-00-utc/7384/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-41/7571",
                        "https://forum.makerdao.com/t/discussion-long-run-business-strategy-collateral/7547",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-9-15/7509",
                        "https://forum.makerdao.com/t/maker-relay-ep-45/8127",
                        "https://forum.makerdao.com/t/maker-relay-ep-45-en-espanol/8141",
                        "https://forum.makerdao.com/t/project-compass-conceptual-framework/8845",
                        "https://forum.makerdao.com/t/maker-relay-ep-41-en-espanol/7614"
                    ],
                    "GPT-summary": "The post is a series of questions about business strategy and treasury management for MakerDAO. The author builds on a previous article and asks for feedback from the community, particularly from the Growth team. The questions cover topics such as optimizing the spread, increasing the supply and demand for Dai, managing risk, and exploring opportunities for the reserve asset of the Web3 economy. The author also discusses the positioning of MakerDAO as a crypto bank and asks for opinions on what MakerDAO should be.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.986232986232986
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/04/2021-22:26:53",
                    "content": "Let’s not even utter the word “insurance” as it has a lot of legal implications. I’ll leave more detailed thoughts for a bit, but as a “not crypto” guy who’s here as a value investor on our enormous joint board of directors, let me just say I see some low hanging fruit in markets to develop and mostly worry about internal governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/04/2021-23:03:14",
                    "content": "Some excellent points Seth. And regardless if Maker will be known/label as a “Bank,” or not — we should think like an investment bank—and perhaps consider doing seed investments in anything that can aid this DAO and helps the ecosystem grow. Why shouldn’t we be putting DAI to work in everything that Binance, Coinbase Ventures, and Alameda is currently funding? We should be taking on the same Risk/Investment parameters IMO. Put some DAI to work. How about sponsoring/funding Hackathons  for other Layer 1s? This way the next big thing includes DAI in its protocol. Today the MINA offering crashed the CoinList website — what’s our edge? “To win in business you need to do more than to play the game well. You need the edge.” -Mike Maples, Jr. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.986111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#4",
                    "likes": "8",
                    "time": "14/04/2021-12:19:19",
                    "content": "Money is something horizontal that crosses everything, and it is kinda easy to think that we can reach whatever we want with DAI, but I tend to think that we need to concentrate on the things that we have some sort of advantage so we can develop our “Job to be done”. I don´t think that we can meaningfully compete with B2C at the level of USDC/T but I do think we have a rough diamond to polish regarding credit demand for RWA. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "8",
                    "time": "14/04/2021-13:42:10",
                    "content": "    seth:  What’s the next step for the reserve asset of the Web3 economy?   One thing that I keep on my mind currently is trade finance in Asia. This interview (not sure it’s free) is enlightening on the opportunities there. This is why I think we should develop RWA in trade finance. Because USDT might be convenient to use yet, but DAI will let them get loans and a savings account. There is also no on/off ramp for DAI, with the PSM you can get no slippage. 1 DAI = $1 (with up to 0.1% fees)  If well managed, the peg deviation could be an old story. Quite sure this is not known (and we never commit to manage it well). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "2",
                    "time": "14/04/2021-13:47:40",
                    "content": "    SebVentures:  This is why I think we should develop RWA in trade finance   100% agree. Particularly as commodities get tokenized. They’re great collateral and people already understand the risks and benefits of collateralizing them. I think the hold up is finding these assets already in a form we can use? Any thoughts on how to get more RWA into the vaults? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.444444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#7",
                    "likes": "9",
                    "time": "14/04/2021-15:51:48",
                    "content": "Agree with Seb and Marian, RWA for lenders and DSR for savings. Both are inherent aspects of Dai and make us different from other stablecoins. Adding more collaterals to the protocol and raising debt ceilings increases supply capacity, but we also have to reach out to people/companies who will use that credit line. And we also have to look for distribution channels that create Dai demand. Integrations that bring the most value to the protocol are the ones that give Dai exposure to more than 1M potential users, could bring $1B in deployable collateral, or could open a vault for a 10M Dai outstanding loan (Tier 1 partnerships). Regarding B2C, it’s not BD/Growth focus because we integrate with partners to reach users with a segmented and straightforward use case for them. @seth Who would you say are Maker’s consumers? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#8",
                    "likes": "3",
                    "time": "14/04/2021-17:53:01",
                    "content": "    Nadia:  Who would you say are Maker’s consumers?   I think that’s an excellent point (question?). I am naturally tempted to say: millenials from USA or maybe Europe, bla bla, because that’s my profile. But the reality is that NEXO is our n1 consumer, if I am not mistaken. So yeah, B2B is key. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving insights on target audience"
                    ],
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "2",
                    "time": "14/04/2021-18:20:16",
                    "content": "    Nadia:  Who would you say are Maker’s consumers?   Things, People, and Seasons Change:  Who knows what our motto will be in 5-years–personally I would love for the entire world to embrace and accept DAI–but I can see one day–perhaps somebody like Uruguay being one of many countries adopting DAI as their official CBDC (Uruguay is a crazy example–but you get my drift)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "1",
                    "time": "14/04/2021-18:28:29",
                    "content": "    flipflopflapdelegate:  (Uruguay is a crazy example–but you get my drift)   Several countries officially use the USD. Lots more peg their currency to the USD less well than we do. No reason why DAI couldn’t be adopted. We should definitely reach out if any more countries gain independence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.6309523809523805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#11",
                    "likes": "10",
                    "time": "14/04/2021-20:41:57",
                    "content": "I feel like there’s a lot to discuss and unpack regarding strategy and in this post. Maybe it’s because I’m newer to the community, but I would love to learn more about our largest customers and what they use DAI/vaults for, as well as why they use it over competitors. Knowing this, we can push our existing advantages over competitors and better understand our weaknesses and invest capital to mitigate them and potentially turn them into strengths. I want to emphasize @MarianoDP 's post from the other thread:  We pretty much talk with every single institution that now uses USDC. Some of them started using DAI, before USDC, and all of them always tell us the same thing.  We need powerful APIs We need 1 to 1 Peg We need liquidity Decentralization is not a value proposition for us Higher returns on DEFI is a “nice to have”   Solving our customers problems should be our #1 job and it seems clear to me we should be investing considerable resources here. The better we serve our customers, the more business they’ll do with us. The more business they do with us, the more likely they are to become advocates of our product.  Currently, the state of the institutional market (and also during the last two years) has been very clear on its response:  On ramp / off ramp operations 1 to 1 peg at any moment is the holy grail. If they convert some of those USDC/USDT to DAI is for farming and returns opportunities, that´s it. Once those opportunities are no longer in the market, they will go back to USDC/USDT…    … I would love the community to develop a product that can offer on/off-ramp 1 to 1 with a powerful API like USDC because I know that we can EASILY eat the market if we have that. Still, we have to be realistic and we don’t have that at the moment so we need to work very hard to keep DAI gaining market share.  We’ve been able to grow tremendously fast despite the disadvantages Mariano outlined in his posts vs USDC. Let’s invest whatever we need to and catch up. Lastly I’ll tag @g_dip since I know he was working on a response to my question in the last thread regarding how we can get this done  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.024903993855607
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#12",
                    "likes": "1",
                    "time": "14/04/2021-20:55:39",
                    "content": "    flipflopflapdelegate:  DAI as their official CBDC (Uruguay is a crazy example–but you get my drift)   @flipflopflapdelegate Is this for serious or just a side joke? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 2.6666666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#13",
                    "likes": "3",
                    "time": "14/04/2021-20:58:51",
                    "content": "    SebVentures:  One thing that I keep on my mind currently is trade finance in Asia.   Couldn’t agree more  . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#14",
                    "likes": "4",
                    "time": "14/04/2021-21:05:42",
                    "content": "Yessss, my personal hope and dream is that a young politician of a Country looking to get away from their current Fiat, will deposit $500B worth of collateral (ETH, or BTC) and mint $250B DAI and use it as it’s National Currency. Crazy dream but hey… it’s good to dream. FUN FACT: The GDP of Uruguay in 2019 was $56B USD. What to do… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#15",
                    "likes": "2",
                    "time": "15/04/2021-01:04:35",
                    "content": "I would actually like some community guidance (before next Wednesday the 21st, preferably) about how we feel about doing specialized vault deals for large borrowers who are currently not using our vaults. Is this a thing we do – volume discounts for new customers with collateral we already accept? Or is it strictly an education outreach when meeting with institutions and corporates with crypto float they aren’t parking in Maker vaults? Would we offer temporary SF discounts? Permanent ones? Dependent upon how much capital was held in the vault? Coinbase Assets is grabbing an empty market share and pushing all USDC in the US wealth management market. They’re still very small – <5% of Coinbase the parent company’s total float, though, and we can still challenge them. I want to go after their clients and work out from there with referrals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.062824675324675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#16",
                    "likes": "1",
                    "time": "15/04/2021-06:31:02",
                    "content": "    PaperImperium:  Is this a thing we do   To the best of my understanding, the community is generally open to these type of ideas:     PaperImperium:  specialized vault deals for large borrowers   but I think at the moment every situation has to be discussed separately, and deals will be ultimately voted on-chain. If you want to speed up the process (in case you need to talk with some potential Maker customers soon),     PaperImperium:  before next Wednesday the 21st, preferably   perhaps get in touch with RWF Core Unit facilitator, the Growth Core Unit facilitator, etc, and ask they ‘supervision’. In any case (I believe) any decision will have to go through governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.86734693877551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#17",
                    "likes": "3",
                    "time": "18/04/2021-16:47:03",
                    "content": "    MarianoDP:  I do think we have a rough diamond to polish regarding credit demand for RWA.       SebVentures:  One thing that I keep on my mind currently is trade finance in Asia. …If well managed, the peg deviation could be an old story.   These points make a lot of sense. I’m trying not to get ahead of the voting on Core Units so I don’t want to say too much but this gives me some good ideas about where content strategy can be helpful so thanks for the feedback. @Aes, I pretty much agree with everything you said.     Nadia:  Who would you say are Maker’s consumers?   I’m open to changing my mental model but I see Maker’s consumers as anyone with a Maker Vault and I’d distinguish that from stakeholders, who I consider synonymous with the community at this point. I’d say that group includes everybody from potential consumers and those engaging with our web properties and social channels to MKR holders and governance. Forgive me if that’s an underwhelming answer but like Aes said, the more we know about who our customers are and why they use vaults, the more we can double down on our advantages and mitigate our weaknesses. Do you have any more insight you can share about what these segmented cases are, what we’re seeing in different tiers, etc? or perhaps this is a longer conversation it would be better to have offline once we have more clarity on Core Units. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.006613756613756
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#18",
                    "likes": "17",
                    "time": "15/05/2021-15:52:25",
                    "content": "Just going to venture outside of my core domain for a bit. B2B vs. B2C, why not both? Lots of chat and some forums posts about abandoning B2C for B2B lately and I wanted to register strong objections to this way of thinking.  I’m not going to argue for the inverse of this, but more for the appropriate B2B strategy for a decentralized protocol, and to call out a massive blind spot everyone is missing with B2C. B2B can be an effective profit-seeking strategy, but it carries a number of risks.  I suggest we make a checklist for any potential B2B engagement.  This list is meant as a starting place, and not an exhaustive list of all considerations.  I’m just an engineer damnit.   Poor ROI.  The time invested on any such engagement should generate staggering amounts of new DAI supply with matched demand, while preserving peg stability.  For example, anything we spend 6 months on should come with an expectation that we generate somewhere upwards of a billion more DAI within the year of the end of that engagement.   Linear Scale.  While DAI supply is the ultimate measure for ROI, there are knock-on effects we get from choosing engagements where the end result impacts end-users. A big advantage to tech is that we can scale with network effects, it makes no sense to choose an engagement that could generate a billion DAI in a year, if we don’t think that is 2 billion in two or 4 billion in three.   Rugged.  Many… many… many times throughout my career I’ve seen an innovative or well executed idea by party A, sold to party B as a service, only so party B can learn more about that market, gain access to those users, and ultimately offer a competing product or bring the service in-house.  B2B relationships are not just fragile, they are almost always the vector by which party B rugs party A.  With too much reliance on a relationship like this to balance the peg by influencing DAI supply or demand, it could easily be an existential threat to the protocol.  I cannot stress enough the risk of this dynamic.  It’s not the exception to the rule, this is almost always the rule itself.  We built a moat, don’t be too eager to fill it in.   Lack of Vision.  Banking the world’s unbanked.  Unbanking the banked.  Enabling self-sovereign finance.  Permissionless.  Decentralized.  Censorship resistant. Voluntarism. Transparency for the powerful, privacy for the individual.  This is vision.  This is the cyberpunk fever dream.  The promise that the world’s system of value, its base economy, isn’t orchestrated by the elite and powerful any longer.  That they can’t steal your life savings through inflation, that they can’t fund their wars, that they can no longer death march (sorry LFW) the world’s population back to serfdom.  This promise is what attracted most of us to the space.  We found elegance in mathematical constructions and properties of the universe that could allow for a paradigm shift.  The old system is build on coercion and violence, but those tools are meaningless under this new paradigm.  Violence and coercion can’t stop gravity, and so it is true with crypto.  This is the narrative.  It appeals to the world’s population, not some business.  It’s hard to get excited about “making the world a better place through capital efficient B2B blockchain relationships …”.        This last bit is a good time to transition to the point I want to make.  Abandoning B2C relationships, that is, relationships between the Maker Protocol and its users, is a perilous idea.  Where do you think the DAI supply came from?  It came from appealing to users directly with the vision I mentioned above, that lead to a spark, which ignited a movement.  B2C isn’t just some old business model that we have to pivot away from because of ethereum gas fees, it’s the entire funnel.  For every 100 or 1000 users you engage, some small percent of them go on to build on the protocol, become part of governance, build a business on top of Maker, or suggest to their employer they use Maker as part of their critical infrastructure.  This is the capital battery.  It’s not even about where income comes from, it’s about where innovation comes from.  Can we point at where most of the DAI supply comes from, yes.  Is it directly end-users, no.  But ask yourself why those other projects are here, how they learned about us, what drew them to want to use the Maker Protocol and DAI in the first place, and you will see it’s end-users that lead them here. At meetups and conferences, people built on top of the maker protocol because it is innovative and permissionless.  These small projects have grown to be some of the largest in the space, and DAI itself is a cornerstone of DeFi.  This is the hard-to-bootstrap network effects most modern startups strive for, and from reading the forums and chat, it seems much of the community is resigned to let it wither on the Vine.  If this funnel dries up, the protocol dries up.  There is nothing left for other businesses to want to integrate with and the outcome would be well deserved for selling out our core vision. I’m not suggesting we put all our efforts into B2C and abandon B2B relationships.  I’m suggesting a balance.  Choose those B2B relationships very carefully, and put the rest of the effort into the B2C vision, feed the innovation battery, and reap the rewards.  I’m not suggesting this will be easy.  Having to up the dust limits because of L1 gas makes achieving this vision all but impossible on mainnet.  But rather than pivot to some risky B2B model, we should look to scale horizontally to L2s, start thinking about how the protocol takes advantage of ETH2, and build something that people want to use and build on top of.  This will pay dividends in the future. We’ve made an unbiased currency for the world, fueled by human values.  Let’s finish the mission and scale it for humans.  The world can’t afford to have us fail. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.521788305591122
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#19",
                    "likes": "0",
                    "time": "15/05/2021-16:44:14",
                    "content": "Great post. Totally agree. When Maker vaults on Polygon/xDAI/Optimism? In all seriousness, I think it just boils down to our current bottleneck which influences our decisions/opinions. If you had the time to deploy on Matic I think the community would approve that in a second. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.644444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#20",
                    "likes": "5",
                    "time": "15/05/2021-19:00:58",
                    "content": "    cmooney:  Abandoning B2C relationships, that is, relationships between the Maker Protocol and its users, is a perilous idea.   We are not abandoning users, it’s mainly that we don’t have any customer-facing app (assuming Oasis is outside of the DAO) nor any plan to have one. We don’t have any piece of customer development research. We are working with @Nadia to increase DAI position on a CeFi app. That could lead to thousands of new DAI users and some millions DAI. For almost nothing. Centrifuge is exposing hundreds (thousands?) of wealthy customers to DAI. On the other end, you can travel through Africa, speak to thousands of users, and onboard a hundred of them for a few DAI. You just spend more than what you earn. I spoke already about how an L2 DAI-oriented app would be nice. The SaaS business space uses the following chart to model the number of clients you need to scale (usually expressed to achieve $100M revenues). ARPA is the average revenue per account (annual). So with whales customers (10M ARPA), you need 10 of those. Let’s say we need both supply and demand and take a 2% interest rate on both, 10M ARPA is 500M DAI (either lend to MakerDAO by holding DAI or borrower from MakerDAO by using a vault). Those are Nexo-type customers. On the other end of the scale, it means we need 100M users holding 50 DAI to achieve the same result. Hunting for stuff above a deer is easy, you just look for them. You see how much time you spent and what it did provide. For those smaller, you need a more elaborate strategy. You can hook them with content marketing but then what is the call to action? They end up on Coinbase, you lose the customer relationship and they get exposed to USDC?  image706×633 43.2 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6396103896103895
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#21",
                    "likes": "1",
                    "time": "16/05/2021-02:15:49",
                    "content": "    cmooney:  we should look to scale horizontally to L2s, start thinking about how the protocol takes advantage of ETH2   I love everything you’re saying, you’re saying all the right things. But why is it that we are so enamored with L2’s and only L2’s? I like to think members of PE like @Kurt_Barry would prefer other L1’s as well. And to be honest–I look at MATIC/Polygon as a competitor to Ethereum. It just feels like a different world over there. I guess what I’m saying is–are we always going to talk our own book, or expand beyond our comfort zone? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.050595238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#22",
                    "likes": "1",
                    "time": "16/05/2021-12:38:55",
                    "content": "I don’t think this contradicts not adresses what I think are @cmooney 's two main points, namely 1) being vulnerable to B2B relationships that are too few and too crucial, with counterparties that may want to replace us with internal departements, and 2) losing the innovation and I’d add mindshare well that comes from a wide B2C surface area. My main objection to 1) is that nobody but Maker can make DAI and issuing and managing stable tokenized lending facilities is…not trivial. So that’s a pretty strong moat. I would love to see a list of other moats we have that we should be careful not to fill. Point 1) also means that we should have existing and upcoming alternative stablecoins in mind. What is Circle’s strategy? What will be Compound’s strategy? And Facebook’s? If they expend effort on B2C, why and what would we lose by not competing there? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.204861111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#23",
                    "likes": "0",
                    "time": "16/05/2021-15:03:40",
                    "content": "I agree 100%, what you say is very true, I feel the same way. Thank you so much for sharing this. Now, when we have few big B2B partners, generating many millions of DAI demand per day for us, it is easy to forget about those many small but dedicated B2C customers who might have brought in only a few thousands of Dai. As we can learned from the “vampire attacks”, the dedicated customers can be very important when the real battle starts for customers in the market.  B2B customers also important, but they will be the first movers when they get a slightly better offer elsewhere. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.033854166666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#24",
                    "likes": "2",
                    "time": "16/05/2021-17:21:29",
                    "content": "    Aaron_Bartsch:  Great post. Totally agree. When Maker vaults on Polygon/xDAI/Optimism?   Check out this convo Aaron–some folks are viewing Polygon as an L1 competitor to Ethereum:  image435×510 60.9 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gustav_Arentoft",
                    "index": "#25",
                    "likes": "11",
                    "time": "17/05/2021-11:11:44",
                    "content": "As much as I think we all love Ethereum, I personally think that Dai and Maker should try to be chain agnostic. We are missing out on tons of users by putting Ethereum over Maker. Ethereum is an awesome super secure settlement layer for the majority of the protocol, but for Dai and potentially some limited vaults other blockchains, layer 2’s or something like Polygon is awesome. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.380411255411255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#26",
                    "likes": "7",
                    "time": "17/05/2021-12:50:30",
                    "content": "    Gustav_Arentoft:  We are missing out on tons of users by putting Ethereum over Maker.   This is very true, is incredible how many times you read and hear users asking when MakerDAO is going to be somewhere else, Maker, along with Aave, Uniswap and Compound are the biggest Protocols by far in DeFi. Just with the fact of being in another blockchain people will use it ASAP, cuz people trust Maker and know how big and amazing it is. At this pace and with this discussion of being or not somewhere else ETH 2.0 will come before “we choose”, as Gustav said, right now we are misssing a lot of users, a L2 CU is needed ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.695089285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#27",
                    "likes": "10",
                    "time": "17/05/2021-13:50:45",
                    "content": "Echoing the above sentiment - the Protocol Engineering Team is looking beyond existing infrastructure - we’re actively working on the L2 Optimism Dai Bridge right now. Future plans are to extend this to zk rollups as well. We’ve also discussed other L1’s but require further liquidity analysis in the immediate term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving information about proposal"
                    ],
                    "Sentiment": 5.0228174603174605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#28",
                    "likes": "15",
                    "time": "17/05/2021-17:53:00",
                    "content": "I want to go back to my question, who are Maker users by now, and what Maker users do we want to reach? If we can find an answer to that question, we can create a B2C strategy.  Are Dai users the ones looking for an alternative from their local currency (emergent markets problem)?  If so, we can’t go out and talk with those users about Dai without having an on/off ramp that onboards them to Dai, a wallet with a super friendly UX with almost zero transaction fees so they can use that Dai and some DeFi services to help them to invest. I will take Argentina as an example of this (all of these examples are also what we understand as a B2B strategy):  Easy on/off ramps (TiendaDolar integrated Dai on BSC because of gas fees)   image2762×998 154 KB   Wallets with a layer 2/other networks vision (Bitera is a Dai exclusive wallet that allows you to choose between using a custodial (zero fees) or a non custodial wallet)   image2364×1338 280 KB   yields on your Dai balance. (Buenbit gives you an 8% over your Dai balance. Of course, people could get a higher yield on DeFi, but they have this great UX and local support that helps people who is not into crypto to trust in Dai)   image2396×1228 264 KB  If we are going to reach those users, we have first to prepare the field. Every marketing action should be tied with a call to action to measure the results. We can’t talk about Dai as an alternative currency if they don’t have the tools to access to it. That’s why our strategy here is B2B, working together with our partners to reach those users with a product.  Are Maker users devs who are looking to create new stuff using the protocol?  If so, we need to have Dai in every network (layer 2, side-chain, blockchain). We need to work with the other networks to create APIs or documentation to help these devs create new products. We need a team (what the integrations team used to do for the foundation) who can work with all those devs to help them integrate Dai or a PSM that connects our vaults with other networks… Then we can think about B2C campaigns.  Are Maker users people who can open a vault?  With the dust as it is, the gas fees, and the UX, it’s hard to think we can launch a B2C campaign and attract users to open a vault. I think it makes more sense to go after CeFi or other crypto projects (what @SebVentures mentioned)  Are Maker users our community? MKR holders?  Delegation, gas fees, how to incentivize participation? What is our strategy here? Do we want more funds participating in governance? More individuals? ",
                    "links": [
                        "https://biterawallet.com/",
                        "https://www.buenbit.com/",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-may-23rd-2021/8397"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.851756198347108
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#29",
                    "likes": "2",
                    "time": "18/05/2021-21:42:10",
                    "content": " 1024×768 22.2 KB  This gives an overview of how I’ve come to think about MakerDAO’s products and services and I’m curious to hear if this is similar to the mental models others are using or how it differs. Vaults, Dai, and the Protocol itself can be considered separate products and I’d consider Vaults that use RWA as a separate product from Vaults that use DA (digital assets). Some customers use Vaults, some go directly to Dai and I think it’s worth acknowledging these as different segments. To serve those looking to use Dai as an alternative to their local currency, would it be more effective to focus on making it easier for individuals to open Vaults or to create on/off ramps to fiat? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.590909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#30",
                    "likes": "2",
                    "time": "18/05/2021-21:58:08",
                    "content": "These quick factoids  about where DAI comes from today might be helpful. Granted, the future need not look like the present. But it builds a strong case for aggressively pushing further into B2B instead of leaving it to USDC. We are strong there now — let’s press forward with that until we have a wider choice of products. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#31",
                    "likes": "1",
                    "time": "18/05/2021-22:29:18",
                    "content": "IMO the focus of the Growth CU should be to make DAI as popular as possible. You should not focus on Maker–let the market decide the faith of MKR. @Nadia has your team done a case study on how Terra was able to sky rocket? I think it is quite interesting and hope something similar happens with DAI in Argentina/S. America. “Terraform’s payment rails running on top of a digital ledger, and a related wallet, have become a favorite of more than 2.2 million total users, executing nearly 90,000 daily transactions recently. Consumers often don’t even know that a digital ledger called blockchain, or so-called stablecoins, were involved during purchases at local convenience stores or online sites.” --Bloomberg Also, U.S.-based challenger bank Current, which has now grown to nearly 3 million users cut a deal after six (6) years of researching DeFi with ACALA (Polkadot). Two (2) questions?   Are there any deals in the pipeline similar to this Current/ACALA deal?   Are we focusing on North America as well, or only South America? If so, can you provide some colour? If not, can you please tell us why not?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#32",
                    "likes": "6",
                    "time": "19/05/2021-01:47:58",
                    "content": "It has been widely argued that commissions on the ethereum network have been the most obvious culprits of other chains having sudden success, while Terra is worth admiring, its model is quite different from what we can do from ethereum and what The Maker Foundation developed it as a model, we even investigated CHAI as soon as it came out, since it was the same name as the DAI with DSR incorporated. The role of the Growth Core Unit is not to “make Dai popular” but to create the right channels for Dai to grow through partners. Growth Core Unit does not focus on Consumers, it focuses on Business. From Growth CU we are working really hard to start spreading Dai to other chains and to get the right tech partners so Dai can be used again for payments. Expect News soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.403486394557823
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#33",
                    "likes": "0",
                    "time": "18/08/2021-07:48:04",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}