{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/drinks-w-makerdao-delegates-featuring-tadeo-of-data-insights-cu/18052",
            "title": "Drinks w/MakerDAO Delegates Featuring TADEO of Data Insights CU  ",
            "index": 18052,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "community-delegate-vlog",
                "drinks-maker-delegates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "8",
                    "time": "22/09/2022-13:28:52",
                    "content": " Rebranding: “Drinks w/MakeDAO Delegates” @ultraschuppi and I have realized that the help of @rspa  goes a long way, as he has been a great addition and helpful in co-hosting this show. We also recognize that this “vlog” (and perhaps one day podcast) should include All MakerDAO @Recognized-Delegates as either special guest co-hosts, features, or any combination that helps spread the Good Meta of their Recognized Delegate platform. Going forward we will rebrand the vlog to the Drinks w/MakerDAO Delegates and hope to improve the quality of content in the near future.  Not Financial Advice This Content is for entertainment and informational purposes only, you should not construe any such information or other material as legal, tax, investment, financial, or other advice. Nothing contained on the FlipFlopFlap YouTube Channel constitutes a solicitation, recommendation, endorsement, or offer by @tadeo @ultraschuppi @ElProgreso @rspa Flip Flop Flap Delegate LLC, Flipside Crypto or any third party service provider to buy or sell any cryptocurrencies, securities, or other financial instruments. Nothing in this YouTube Video constitutes professional and/or financial advice.  Meet The Makers: Tadeo of Data Insights Core Unit In this episode recorded during EthWarsaw I sat down with @tadeo of Data Insights as we discussed the vital role his Core Unit plays in the MakerDAO Ecosystem and their thinking behind the proposed Endgame Plan, the incoming data tooling for Real World Assets, and Tadeo’s role as a Facilitator. We hope you really enjoy this conversation as much as I did.      ",
                    "links": [
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-28-de-septiembre-de-2022/18259",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/22"
                    ],
                    "GPT-summary": "The post is about a rebranding of a vlog/podcast called \"Drinks w/MakeDAO Delegates\" to include all MakerDAO recognized delegates as special guest co-hosts or features. The post also includes an episode of the vlog where the author interviews Tadeo of Data Insights Core Unit about their proposed Endgame Plan and incoming data tooling for Real World Assets. The post is not asking for feedback or giving negative feedback, but rather advertising the vlog and extending an invitation to all MakerDAO recognized delegates to participate.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.453455687830688
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "2",
                    "time": "22/09/2022-13:55:57",
                    "content": "    flipflopflapdelegate:  Drinks w/MakerDAO Delegates   really proud about this name, and it didn’t took too long for the governance process around it to come to a conclusion  cya later! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#3",
                    "likes": "2",
                    "time": "22/09/2022-14:40:05",
                    "content": "Waiting for my invite.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#4",
                    "likes": "1",
                    "time": "22/09/2022-15:35:58",
                    "content": "Pouring one out for two Tims and the Frank. think of the hot dog and always sunny memes.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#5",
                    "likes": "0",
                    "time": "22/09/2022-20:00:54",
                    "content": "Will be drinks at DevCon?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leggevents",
                    "index": "#6",
                    "likes": "0",
                    "time": "22/09/2022-23:11:55",
                    "content": "…and a giant event. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}