{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poap-maker-contributor-q4-2020/6075",
            "title": "POAP: Maker Contributor Q4.2020 ",
            "index": 6075,
            "category": [
                "Governance"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "8",
                    "time": "16/01/2021-23:58:40",
                    "content": "POAP: Maker Contributor Q4.2020 Hello, everyone! We’re celebrating a new instance of the already-venerable institution * of shipping out POAPs at the end of every quarter to all who have contributed to MakerDAO’s growth. If you’ve made any contribution during Q4 2020 (i.e., October, Novemeber, December), feel free to claim your token of appreciation by filling out and submitting this form  Here’s the event at POAP.gallery and the NFT you’ll be claiming well-deserved ownership on  If you have any questions, either reply or send me a PM. Thank you! * Although still nameless  Special thanks to @juan, who’s teaching me the Ways of the MakerDAO and has supported me throughout the process of putting the event together  ",
                    "links": [
                        "https://www.poap.gallery/event/728",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118"
                    ],
                    "GPT-summary": "The author is explaining the POAP: Maker Contributor Q4.2020 proposal, which rewards contributors to MakerDAO's growth with POAPs. The post also provides a link to claim the token and an event page. A third party gives entirely positive feedback on the proposal and offers to answer any questions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.693506493506494
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "3",
                    "time": "17/01/2021-16:58:06",
                    "content": "Super cool stuff!! Great to have you working on stuff @blimpa, looking forward to utilizing more of your speed and awesome work ethic  For people less familiar with POAP, we hosted them at the end of last week’s Community Collateral Call about xDAI to talk about POAP’s utilization of the xDAI network and how you can still get your POAPs on main-net! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.117838541666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/04/2021-22:58:11",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}