{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/request-return-of-mkr-tokens-inadvertantly-sent-to-governance-address/15221",
            "title": "Request Return of MKR Tokens Inadvertantly Sent to Governance Address ",
            "index": 15221,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-rejected",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/wingstick_99942",
                    "index": "#1",
                    "likes": "2",
                    "time": "16/05/2022-19:39:20",
                    "content": " Summary 3.1994 MKR Tokens were inadvertently sent to MKR Governance Address. The purpose of this signal request is to notify the governance authority of the transaction and request the tokens be returned to the sender.  Main Text On 2022-05-15 at 7:15:05 UTC, 3.1994 MKR were sent to MKR Governance Address 0x9f8F72aA9304c8B593d555F12eF6589cC3A579A2 from Coinbase. Transaction Hash: 54dccce86adcb209fe6305473fafd01d9dabac9508803cab094a5b0db4a8c638 Links to etherscan showing governance address and transaction hash below: https://etherscan.io/token/0x9f8f72aa9304c8b593d555f12ef6589cc3a579a2?a=0x9f8F72aA9304c8B593d555F12eF6589cC3A579A2 https://etherscan.io/tx/0x54dccce86adcb209fe6305473fafd01d9dabac9508803cab094a5b0db4a8c638 This transaction was done in error and should not have occurred. I am requesting that the 3.1994 MKR tokens (minus fees) be returned to sender on Coinbase.  Polls    Should MKR Tokens be returned to sender?  Yes No Abstain     0 voters      Next Steps Signal will run from. 2022-05-16T05:00:00Z→2022-05-30T05:00:00Z If signal request poll passes, then the poll will go onchain, asking MKR holders if the wish to return these funds. If signal request poll fails then no further action will be taken. ",
                    "links": [
                        "https://etherscan.io/tx/0x54dccce86adcb209fe6305473fafd01d9dabac9508803cab094a5b0db4a8c638",
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
                        "https://forum.makerdao.com/t/relay-semanal-10-16-de-mayo-de-2022/15289",
                        "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346",
                        "https://forum.makerdao.com/t/signal-request-request-minting-of-new-mkr-tokens-to-replace-mkr-tokens-inadvertantly-sent-to-mkr-token-address-burned/15369",
                        "https://forum.makerdao.com/t/relay-semanal-17-23-de-mayo-del-2022/15392",
                        "https://forum.makerdao.com/t/informal-poll-request-creation-of-general-funds-recovery-policy-for-mkr-token-address/15689",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-12-18-2022/15280"
                    ],
                    "GPT-summary": "The author of the proposal is requesting feedback from the community regarding the return of 3.1994 MKR tokens that were inadvertently sent to the MKR Governance Address. The post includes a link to the transaction hash and the governance address. The author has also included a poll asking whether the tokens should be returned to the sender. The signal request poll will run from May 16th to May 30th, and if it passes, the poll will go on-chain.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/05/2022-20:06:00",
                    "content": "    wingstick_99942:  MKR Governance Address   To be clear for readers: it’s not the “Maker Governance Address” (DSPause in Maker-speak). It’s the MKR token address that the tokens were sent to. It will be a tough one to retrieve because tokens sent to the address aren’t technically owned by Maker Governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving additional information on proposal"
                    ],
                    "Sentiment": 4.518518518518518
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wingstick_99942",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/05/2022-20:10:42",
                    "content": "For clarification: I am not requesting the tokens be sent directly back to me or my wallet. I am requesting they are returned to the senders address which was from Coinbase. I will have to work with Coinbase to get them to return the tokens to me at that point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/05/2022-10:00:59",
                    "content": "Hi @wingstick_99942 What @wouter is saying is that it won’t be possible for anyone at MakerDAO to return MKR to any address since no-one and nothing controls that address—it’s the MKR token contract which cannot be tampered with by design. I’m incredibly sorry to say this but I’ll be honest: it seems like your MKR tokens are not retrievable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "1",
                    "time": "17/05/2022-10:08:37",
                    "content": "So, to add a bit on top of this.   The MKR sent to that address are going to stay there forever. As already pointed out, nobody has the keys to send them back to Coinbase   What could be done, in theory, is to give you some new MKR (which we will have to print out for you), since we know that those sent to the wrong address are gone forever and can be therefore considered as burnt.   So there is hope for you @wingstick_99942 . But this compensation mechanism, if voted and if implemented (two non-trivial if’s) will take quite a while. The best you can do is to start participating in MakerDAO’s governance (as you started doing by writing on this forum) and ask the DAO to vote/implement on the above compensation scheme. HINT: you are not the first user who sent tokens to the contract address by mistake  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.99025974025974
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#7",
                    "likes": "3",
                    "time": "17/05/2022-10:38:45",
                    "content": "There’s nearly 800 MKR that has inadvertently been sent to the contract address so this does set a precedent for all those users too. There are also several analogous threads for DAI such as the one here, here and here for DAI where no solution was found. Ideally, this should be prevented by good wallet design and/or Coinbase doing a check before sending a token to the contract addess. ",
                    "links": [
                        "https://forum.makerdao.com/t/help-sent-dai-to-dai-contract-instead-of-wallet/11953/1",
                        "https://forum.makerdao.com/t/lost-dai-in-contract/14695"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#8",
                    "likes": "0",
                    "time": "17/05/2022-13:59:03",
                    "content": "I agree here. I personally lost funds in the early days before I learned to do test transactions and triple-check addresses. I’m sympathetic for your loss, but I feel this is not Maker’s responsibility and also would employ resources much needed elsewhere. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wingstick_99942",
                    "index": "#9",
                    "likes": "0",
                    "time": "17/05/2022-16:11:42",
                    "content": "    iammeeoh:  What could be done, in theory, is to give you some new MKR (which we will have to print out for you), since we know that those sent to the wrong address are gone forever and can be therefore considered as burnt   I appreciate the comment, but (even though I would be the one that one benefit) I don’t think I would even support that in a vote since MakerDAO would just be eating the cost for me and potentially any others in the future or past with precedent etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.386363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wingstick_99942",
                    "index": "#10",
                    "likes": "0",
                    "time": "17/05/2022-16:27:37",
                    "content": "Risk of starting to veer off topic here: Is there theoretically any way for a feature to be created / implemented that would allow the MakerDAO governance to access the MKR token address (0x9f8F72aA9304c8B593d555F12eF6589cC3A579A2) solely to allow the transfer of received tokens after a review process etc? I don’t mind submitting more signal request (or whatever process needs to take place) in an attempt to make this sort of feature happen. As already stated there are almost 800 MKR at that address and there will continue to be more and more over time. If I can help do something now, I will for everyone’s sake. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#11",
                    "likes": "2",
                    "time": "17/05/2022-17:01:21",
                    "content": "Like @iammeeoh suggested, the easy fix here is to mint new MKR to replace the provably lost MKR. There is no cost to the DAO for minting except for the requisite engineering resources. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.424242424242425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#12",
                    "likes": "2",
                    "time": "17/05/2022-18:47:22",
                    "content": "    wingstick_99942:  If I can help do something now, I will for everyone’s sake.   Please proceed. The best way is to politely contact someone from the @GovAlpha-Core-Unit in the MakerDAO discord chat, and ask how to proceed. MakerDAO has fairly bureaucratised procedures, and you need to follow those properly. Keep in mind that this would likely take a long time. But, if this is your focus and you are patient, you should be able to do it without a huge investment of time  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "17/06/2022-04:47:25",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}