{
    "poll_list": [
        {
            "title": "USDC Peg Stability Module Parameters - December 14, 2020",
            "index": "5532",
            "option": "Yes",
            "supporting_mkr": "60,527",
            "highest_fraction": 0.98
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-psm-parameters/5532",
            "title": "[Signal Request] PSM Parameters ",
            "index": 5532,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "pegstab-module",
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "6",
                    "time": "07/12/2020-22:10:40",
                    "content": "Based on the PSM on-chain poll and PSM Risk Assessment provided by @Risk-Core-Unit governance needs to decide on two key parameters before having effective PSM module launched:  Stablecoins that will be included in PSM Debt Ceiling per stablecoin  Note that tin and tout parameters were already decided by MKR holders (0.1% tin and 0.1% tout) Based on PSM Risk Assessment, MakerDAO could well add another 200m or more stablecoins to its collateral portfolio if PSM were to be implemented with 0.1% tin and 0.1% tout parameters. Also we need to keep in mind that low LR stablecoin vaults should be replaced by PSM in short to mid term (either through refinancing or liquidation into PSM). This means PSM might in the upcoming weeks or months hold around 700m stablecoins which would represent up to 55% of the DAI backing. 1. Stablecoins supported by PSM Governance needs to decide how it wants to diversify among stablecoins in PSM, where stablecoins suggested by @Risk-Core-Unit would be USDC, TUSD, PAX and GUSD. Here I want to note there were some arguments that since stablecoins have binary risk (being worth 0 in very rare events or worth $1 most of the time) it might be that diversification doesn’t necessarily imply good protection. In other words, if you think any of stablecoin that totally fails might destroy Maker, why not just pick one that is the safest and most liquid, which may be USDC. Also it seems that implementation of PSM with many stablecoins included could potentially delay actual implementation of PSM, although this shouldn’t really affect risk based decision here. 2. Debt Ceiling per PSM Vault type First, if governance prefers PSM usage versus low LR stablecoin vaults, Debt Ceiling would need to be decreased to 0 for USDC-A, TUSD-A and PAX-A collateral types. On the other hand, Debt ceiling would need to be equally increased for PSM Vault Types, plus additional increase to reach $1.001. This unfortunately means that Maker would have very high available exposure for stablecoins backed debt until stablecoin vault to PSM refinancing or liquidation is performed. Again, it all depends on how quick governance wants to move, and what kind of efficiency of PSM and effect on the peg it expects in the short term. The first Poll below asks for starting total PSM DC that is planned to be implemented on 18th December. I am describing here what each Debt Ceiling value represents in practice: 250m - estimated amount needed to reach $1.001 500m - a bit of extra buffer if current stablecoin vaults refinance/liquidate to PSM 750m - current stablecoin debt exposure plus estimated amount needed to reach $1.001 Note that if selected PSM DC is higher than 250m, 0 DC would be proposed for USDC-A, TUSD-A and PAX-A vault types.    What level total PSM Debt Ceiling do you support when onboarded?  250m 500m 750m Abstain     0 voters        Which stablecoins do you want to include in the initial PSM deployment?  USDC TUSD PAX GUSD Abstain     0 voters        Which stablecoins do you want to include in the PSM in the next few months?  USDC TUSD PAX GUSD Abstain     0 voters        If multiple stablecoins are approved for the PSM which allocation do you prefer?  Equal Weight among selected stablecoins USDC having at least 50% weight Abstain     0 voters     This Poll will run until this Friday 11th December. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip29-peg-stability-module-psm-risk-assessment/5504",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-121-thursday-december-10-16-00-utc/5468/2",
                        "https://forum.makerdao.com/t/road-to-the-psm/5353",
                        "https://forum.makerdao.com/t/signal-request-should-we-add-new-psms/8337",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-122-thursday-december-17-16-00-utc/5608/2",
                        "https://forum.makerdao.com/t/weekly-sourcecred-distribution-work-reaches-ath/5670"
                    ],
                    "GPT-summary": "The author of the post is explaining the need for governance to decide on two key parameters before launching the PSM module. The post provides details on the stablecoins that will be included in the PSM, the debt ceiling per stablecoin, and the potential risks and benefits of implementing the PSM. A 3rd party is giving constructive criticism by suggesting that diversification among stablecoins may not necessarily provide good protection and questioning the efficiency of PSM with many stablecoins included. The 3rd party is also asking questions about the stablecoins to be included in the PSM and the allocation preference. The post can be considered as an explanation and review of the PSM proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.425138888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#2",
                    "likes": "10",
                    "time": "07/12/2020-22:39:27",
                    "content": "There are some things that I would like more information on in order to make an informed decision…   Will this feature not be launched with a “test” debt ceiling to ensure that there are no vulnerabilities? Is the first poll asking what the idea debt ceiling is once we’ve properly tested the functionality?   Do we know that adding other stablecoins will delay deployment?   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#3",
                    "likes": "8",
                    "time": "07/12/2020-22:52:03",
                    "content": " We will have a formal security review from Quantstamp in place by the time we launch. This coupled with the relative simplicity of the code should be sufficient. If people have strong feelings that this is insufficient we could do a test ceiling too, but I’m not clear on what the fee should be on the test as a continuous adjustment was requested to maximize fee collection. I can launch it with all the stablecoins if that is desired, but my personal preference is to just start with one to keep things simple. We can expand to the other stablecoins later.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.18452380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Chao.Pan",
                    "index": "#4",
                    "likes": "7",
                    "time": "08/12/2020-01:19:43",
                    "content": "Maker gov should do whatever it takes to implement it on time on Dec 18th, if starting with one stablecoin type is simpler, let’s go with USDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "0",
                    "time": "08/12/2020-09:41:35",
                    "content": "    hexonaut:  continuous adjustment was requested to maximize fee collection.   By which equivalent percent a year do you want to decrease the adjustment. From 100.5 to 100.1 at 4%  it is like 5 weeks From 100.5 to 100.1 at 6% it is like 3 weeks And how are the parameters set for the continuous adjustment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#6",
                    "likes": "1",
                    "time": "08/12/2020-12:39:44",
                    "content": "As per the governance vote, the tin fee will start at 1% and lower to 0.1% over the course of a week. This is slow enough that the PSM should fill right alongside the price of Dai coming down. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.787698412698412
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Teresa_xiao",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/12/2020-07:40:37",
                    "content": "I prefer to TUSD will be included in the initial PSM deployment! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Chao.Pan",
                    "index": "#8",
                    "likes": "9",
                    "time": "18/12/2020-07:47:39",
                    "content": "What’s your rationale, Justin? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#9",
                    "likes": "0",
                    "time": "18/12/2020-10:02:00",
                    "content": "You can use the MIP process, I believe. We need more people to help out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "2",
                    "time": "06/01/2021-22:58:26",
                    "content": "I’m marking this as complete, because while we’re still in progress in actually getting to the target debt ceiling, all polls and on-chain votes related to this have passed successfully. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "0",
                    "time": "13/01/2021-22:58:28",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3048"
}