{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/events-001-cu-update-may-july-2022/17474",
            "title": "EVENTS-001 CU Update - May-July 2022 ",
            "index": 17474,
            "category": [
                "Discontinued Categories",
                "Events"
            ],
            "tags": [
                "cu-update",
                "archive-events-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#1",
                    "likes": "18",
                    "time": "26/08/2022-22:45:02",
                    "content": " DAIvinity EthCC DAIvinity Paris was co-hosted along with 1inch, TrueFi, Perpetual Protocol and Oasis.App. Tickets were allocated to partners based on financial commitment. Maker taking 50% of ticket allocation with a venue capacity of 1100. This event was sold out and reached full capacity at approx 23:30. We had a total of 1266 persons through the door throughout that evening. The Events CU bought a total revenue of 64,000 DAI/USDC from DAIvinity EthCC.  Our target is to cost split 50% of the event expense. This aligns with our cost-splitting targets,  see below under “Financial” for more details.  500×850 13.5 KB   Attendees As usual for the DIAviniy event, we had a large presence of industry staples attend. Some notable attendees include: Binance, Coindesk, A16Z, Coinbase, Centrifuge, Bankless, Coin Telegraph, Aave, Ethereum.org and Ledger to name a few. Many of them personally reached out to the Events CU to secure tickets for this event.    Full list of protocols present at DAIvinity EthCC (Expand with Caution, It is long) @tatum.io @uplift.io 0x.org 0xproject.com    1inch Network    1inch Network | Leading high capital efficient DeFi protocols The 1inch Network unites decentralized protocols whose synergy enables the most lucrative, fastest and protected operations in the DeFi space.       6thman.ventures    7xvc.com   SevenX SevenX Ventures is a venture capital founded by crypto veterans with an average industry experience of 5 years. We insist on empowering Startups in Crypto & Web3.         Andreessen Horowitz    Andreessen Horowitz | Software Is Eating the World Andreessen Horowitz (a16z) is a venture capital firm in Silicon Valley, California, that backs bold entrepreneurs building the future through technology.      aalioit.com    aave.com    Aave - Open Source Liquidity Protocol Aave is an Open Source Protocol to create Non-Custodial Liquidity Markets to earn interest on supplying and borrowing assets with a variable or stable interest rate. The protocol is designed for easy integration into your products and services.      advancedblockchain.com aeindri.org    Aglae Ventures    Aglaé Ventures - Global tech VC firm (early stage & Growth) - Paris - SF Aglaé Ventures invests from €100k up to €100m in asset light activities at all stages: Marketplaces, SaaS, Platform, Consumer Apps, DNVB.         Akcela    Startup, Scaleup and High Growth Focused Incubator and Consultancy Call it what you like, Management Consultant, Business Consultant, Change Consultant. We deliver results for businesses committed to change.         alchemy.com    Alchemy - the web3 development platform Whether you're a beginner developer, startup, web3 market leader, or a large enterprise, Alchemy makes multichain web3 development easy with reliable and scalable node infrastructure, enhanced APIs, and developer tools. Get started for free!         alchemy.com    Alchemy - the web3 development platform Whether you're a beginner developer, startup, web3 market leader, or a large enterprise, Alchemy makes multichain web3 development easy with reliable and scalable node infrastructure, enhanced APIs, and developer tools. Get started for free!         AllianceBlock - Bridging the gap between DeFi, Crypto & TradFi    AllianceBlock || Defi & crypto blog – our latest updates & news Keep up to date with our latest product updates, news, events & AllianceBlocks thoughts about the crypto & Defi industry.      andromedia-research.io    Apeworks Digital    Crypto, NFT and Web 3.0 Digital Agency - Apeworks Digital Launching you into the limitless future. We help crypto and Web 3.0 projects stand out in the blockchain and beyond.  Est. reading time: 23 minutes          apollo.com    Investing in  tomorrow, today. Apollo Global Management is one of the largest asset managers serving many of the world’s most prominent investors. We have a value-oriented approach across private equity, credit, and real estate.         apollo.com    Investing in  tomorrow, today. Apollo Global Management is one of the largest asset managers serving many of the world’s most prominent investors. We have a value-oriented approach across private equity, credit, and real estate.         Apollo Capital    Home - Apollo Capital Apollo Capital invests in crypto assets on behalf of leading family office and institutional investors in Australia and further afield. Please join us investing in and learning about one of the most exciting technologies of the 21st century.         Artist Capital    Artist Capital: Investment Management and Capital Markets - New York, NY Artist Capital: One Vision. Two Competencies. Artist Capital Management is a global, growth-oriented investment management company Artist Capital Markets provides capital markets services, including primary fund placement, private capital raising and...         Ascensive Assets    Ascensive Assets Ascensive Assets is a seed-stage venture firm that invests in blockchain-enabled companies across the full spectrum of web3.  Est. reading time: 1 minute        astaria.xyz    Atka   ATKA.IO – End-To-End Advisory For Blockchain Projects We help pioneering teams bootstrapping crypto networks and protocols.         atlendislabs.io   atlendislabs.io This domain name has been registered with Gandi.net. It is currently parked by the owner.         atlendislabs.io   atlendislabs.io This domain name has been registered with Gandi.net. It is currently parked by the owner.         attarius.com    Attarius Network Attarius Network - the first and only all-in-one NFT ecosystem for game industry         avalabs.org    Ava Labs: Digitize All The World's Assets We make it simple to launch decentralized applications and tools on Avalanche.      avarta.io    azuro.org   Global Decentralized Betting Protocol - Azuro Azuro is building the base layer for decentralized betting where markets are priced, created and made liquid. Classic betting experience for multiple front-ends via vivid liquidity pools, odds imported via oracles & NFTs powering secondary...         backed.fi    Backed Finance - Tokenized Real-World Assets The infrastructure for capital markets on the blockchain. Powering non-stop, fractional trading of stock tokens - backed 1:1 by the original, underlying asset.      banklesshq.com    Binance    Buy/Sell Bitcoin, Ether and Altcoins | Cryptocurrency Exchange | Binance Binance cryptocurrency exchange - We operate the worlds biggest bitcoin exchange and altcoin crypto exchange in the world by volume         BitGo    BitGo - The leader in institutional staking, custody, and trading BitGo is the leader in institutional staking, custody, and trading. We enable our clients to navigate the complex landscape of digital assets with a connected, compliant, and secure suite of solutions.       bitkraft.vc blackwattle.ad blockarm.capital blockchaincapital.com   Blockdaemon   Blockdaemon: Institutional Grade Blockchain Infrastructure Stake, Stake, Scale, and Deploy Nodes: Institutional Grade Blockchain Infrastructure serving leading crypto platforms and investment funds       blocklabs.eu    blockscout.com   Ethereum (ETH) Explorer BlockScout provides analytics data, API, and Smart Contract tools for the Ethereum         BlockTower Capital    BlockTower Capital - Cryptoasset Investment Firm BlockTower is a leading cryptoasset investment firm, applying professional trading, investing and portfolio management to an emerging digital asset class.         Blox Staking    Powering decentralized ETH staking - Blox Staking Secure the Ethereum blockchain with a non-custodial Eth2 staking solution and SSV-based decentralized staking pools.  Est. reading time: 7 minutes        bluejay.finance bluewin.ch    B.Protocol   B.Protocol The Decentralized Backstop Liquidity Protocol  Est. reading time: 1 minute          brightunion.io    BrightUnion - Connecting decentralized insurance • Buy & manage covers against DeFi risks. Compare multiple platforms, policies & prices. Largest offer, lowest premiums (from 1,8% ANN).,       bzx.network    carbonbase.co    Carbonbase - Calculate, track, trade and offset carbon emissions.      [email protected] castleisland.vc   catalog.fi    Catalog - Buy and Sell Bitcoin, Ethereum, and more trustlessly Catalog is a secure, decentralized platform that makes it easy to buy, sell, and store cryptocurrencies like Bitcoin, Ethereum, and more.      celestia.org    celo.org    Celo: Mobile-First DeFi Platform for Fast, Secure, and Stable Digital Payments Celo is global payments infrastructure that makes financial tools accessible to anyone with a mobile phone         centrifuge.io    Centrifuge: Real World DeFi Decentralized asset finance: asset Originators can access bankless liquidity, and investors can earn attractive yields from an open marketplace of asset pools.         certik.com    CertiK Blockchain Security Leaderboard CertiK is the leading security-focused ranking platform to analyze and monitor blockchain protocols and DeFi projects.      chainflip.io    Chainwire    Chainwire - Blockchain & Crypto Press Release Distribution Chainwire is The Leading Blockchain and Crypto Newswire and Press Release Distribution Service That Maximize Crypto News Coverage  Est. reading time: 2 minutes        chaoslabs.xyz chapterone.com chroniclelabs.org coinbase.com coindesk.com coinstelegram.com collider.vc cometh.io coscientia.com courtyard.io creatoros.co criterionvc.com cronoslabs.org crtlabs.io cryptobriefing.com cryptocanal.org cryptonomadsclub cryptoplaza.es cryptotesters.com cvcapital.io dao5.com daoversal.com [email protected] debridge.finance decenter.com decentral.games deficapitalmarkets.io deficon.nyc deficustody.com defined.fi defiyield.app degenscore.com delphidigital.io deversifi.com dgfans.io dinngo.co eakdigital.com element.fi encode.club ethereum.org euler.xyz exactly.finance exchange.art farmerfund.io femboys.io figment.io findora.org fintech.io firstminute.capital flare.network flipsidecrypto.com flowcarbon.com follmer-greiff.de framework.ventures frontline.vc fundamenter.com gagra.vc galaxydigital.io gateway.fm gauntlet.network gbv.capital gelato.digital get-protocol.io gitcoin.co gitpoap.io gmrounded.com gofyeo.com goldentree.com gqtfinance.com gradient.com graftsocial.com greyswan.finance hack.vc hashingsystems.com hashscan.xyz heliax.dev hito.xyz hoprnet.org hvcapital.com hypernest.xyz hypotenuse.ca ideo.com idle.finance impossible.finance inboundjunction.com inflection.xyz iosg.vc jclearpool.finance jinarashi.vc jmo.vc jobprotocol.co keyko.io kosen.ai kyve.network l2beat.com labdao.com launchub.com lavanet.xyz layerzerolabs.org lemma.finance lframework.ventures li.finance libertuscapital.com lido.fi linumlabs.com list.ru lyra.finance mairey.net mango.markets maple.finance marketacross.com marscolony.io masterkey.vc maven11.com mellow.finance mercuryo.io mesh.finance messari.io metahood.xyz metareal.network metis.io minespider.com mintdropz.com mitonc.com mojito.xyz momentsofspace.com moonpay.com moricz.io morpho.xyz mycelium.ventures myetherwallet.com nalu.fund nansen.ai nascent.xyz nemo.ventures nervos.org newtribe.capital nexo.iio northzone.com oasis.app oazoapps.com obol.tech omniscia.io ondefy.com opolis.co orbitmarkets.io originprotocol.com owlventures.co.uk oxygenchain.earth pangeadao.org panony.com panteracapital.com paradigm.xyz parafi.capital partisiablockchain.com peanut.trade pentagon.xyz perp.com phaver.com philabs.xyz pif.vc pillarproject.io pitango.com polychain.capital pooldata.io privaterelay.appleid.com prometeus.io purestake.com quantdesign.xyz railgun.org ramp.network rari.capital raygroup.uk rbf.capital re7.capital redalpine.com redstone.finance renproject.io ribbitcap.com ribbon.finance risczero.com rokcapital.io rysk.finance sabregames.com safe.global serotonin.io shardlabs.io shefi.org sherlock.xyz shima.capital shirtum.com sinoglobalcapital.com skolkovotech.ru skyminelabs.com snzholding.com solace.fi solarbeam.io spearbit.com stablenode.xyz stake.capital stakedao.org stakewise.io stemsdao.com stupay.com sumsub.com superclub.xyz superfluid.finance superpat.io sushi.com swaap.finance sygnum.com synthetic.vc taikai.network targetglobal.vc tempus.finance tenderly.co tenzor.capital tfi.team thedac.info tokemak.xyz tokfi.com tomahawk.vc transak.com trgc.io tribecap.co txa.vc unicrypt.network upshot.io vega.xyz velvet.capital verilog.solutions vestiver.com vmo.vc voltprotocol.io voltz.xyz w3key.co wachsman.com webetnetwork.com wintermute.com woo.network workpi.com worldcoin.org x-trix.org yapglobal.com zebudigital.com zeeprime.capital zerion.io zklend.com  Some Code function logSomething(something) {   console.log('Something', something); }     We decided to allocate 40% of tickets to the public as our events create a lasting positive impression for the brand. Experiential marketing is a highly utilized method for brand promotion and is employed by many companies and co-operations across all industries. This is a technique that takes time to measure results but with persistence and planning grows exponentially. Results can already be seen with our Twitter engagement (below). Associating MakerDAO and DAI with a positive experience is invaluable for the brand, existing clients and newcomers to the space. This is a tried and tested strategy that yields incredible results over time.  DAIvinity EthCC Recap For those who missed the event, we have compiled this recap video of the night.  Twitter - @daivinity   As you can see our impressions are growing rapidly since the formation of the CU to the EthCC Paris event. These numbers clearly show the interest in our events along with MakerDAO in the space of only 3 months. This trend will only continue upon the successful execution of future planned events.  Likewise, this can also be seen in our engagement rate. We have strategically been tweeting during the build-up to events to give away tickets. This subsequently has resulted in an extremely high engagement rate, translating to high demand for tickets to our events. In July you can see we had a total of 17089 engagements. During this month we had a total following of 1526.  As stated in other CU updates a target engagement rate % per month for twitter is around 1-2%. Anything over 5% is considered exceptional. We have yet to dip below 5% since May with the run-up to EthCC in June soring above 8%. As our Twitter presence continues to grow and our events create a continued buzz in the community we expect this engagement rate to continue. Our rapid growth is also being noticed within the space:  1202×912 153 KB   Roadmap Update  ETH Warsaw - Sept 1st DAIvinity Warsaw is set to take place on September 1.  This event has been coordinated with Eth Warsaw to be the official opening event of the conference.  The team has arranged for the event to be hosted up in the sky at Level 27.  As usual, there has been a high demand for tickets and being in eastern Europe will allow Maker to be exposed to a different client base.  DEVCon (Bogota) - Oct 13th The team has been working on this event for some time.  There is plenty of logistical issues which have been very challenging.  Despite these challenges, we have secured a venue and a date for the event.  Oct 13 DAIvinity will debut in South America!!!  We will be focusing the next month on the logistical details and partnership arrangements for this event.  Financial  CU Expenses (YTD)  1756×1148 475 KB  *****The actuals for June are different than what was reported by SF,  This was my error.  This has been corrected here and I have notified SF of the mistake.  DAIvinity EthCC Revenue & Expenses From the DAIvinity EthCC event, the CU had total revenue of 64,000 DAI/USDC.  Our target is to cost split 50% of the event budget (110,000 DAI) with our partners so this revenue is exactly in line with our goals.  As stated before the revenue will be returned to the surplus buffer.  7,020 of this won’t be sent back as it was essentially a wash as it was used to directly fund an extension of the event budget.  The budget extension was due to a high number of partners for the event so we extended the event capacity to the maximum.  This was funded from partnership revenue.  Here is a summary of the revenue and expenses for the event.      Expense/Revenue Budget Expense/Revenue Actual Differance     DAIvinity EthCC Total Cost -110,000 -117,020 106.38%   Partnership Revenue 55,000 64,000 116.36%   Total Cost -55,000 -53,020 96.40%    So where is this revenue currently?  Technically it is sitting in the surplus buffer.  What we have been doing is directing the revenue into our CU operational wallet and pulling expenses directly from that revenue.  This has had the result of us not pulling a vest from our DAI stream.  Eventually, 55,000 DAI will be pulled from the stream and then transferred it back to the surplus, effectively burning it from our stream.  Target is the end of Aug.  This will be the approach with all future revenue.  Overages YTD Higher than forecast but generally not an issue.  This is a result of some liabilities planned for Aug but moved to July.  The additional expenses were because of the following reasons;  AccountAble The CU’s original goal was to avoid using Accountable.  We had discussions with a lawyer to cover ourselves legally.  Generally, the outcome/direction was very positive but due to the offboarding proposal put up for our CU, we needed to reevaluate our exposure.  The TLDR is we need to get approval from our Gov’t on how we are taking funds which takes time and wouldn’t have a definite answer until early next year.  This leaves us open to tax liabilities.  So given the current climate in the DAO regarding offboarding, we will be using AccountAble for the foreseeable future.  This is expected to have an impact of ~30k DAI of cost over the year, current expense of 6,220 YTD.  Tax Burden from Pre CU DAIvinity Related to how funds were channelled from the DAO to pay for expenses for the two events before the CU was formed.  This has resulted in a tax bill for one of my other companies.  The impact is 7,726 DAI and has been reimbursed by CU LLC.  Governance Voting Incentive Campaign The events team has decided to create a voting incentive campaign by means of using tickets to DAIvinity events as a reward mechanism. Demand for DAIvinity tickets has been extremely high for the last few events and this trend is expected to continue. By leveraging this demand, we believe we can attract small MKR holders to engage in governance voting by offering a ticket to a DAIvinity event as a reward for this participation. The team is currently a bit behind in our planned implementation.  We are sorting out some final details with the parameters for eligibility so people don’t game the system. We will update the community with the results of the campaign once we have had time to evaluate its impact.  The current contest will run until Oct. 1 so this focused on DAIvinity DevCON. Full details can be found here.  Offboarding Vote This vote has now closed and offboarding of this CU has been rejected.  We would like to thank all who voted and showed support for our CU.  There is some good feedback we are reviewing to optimize the CU effectiveness for the DAO. On another note, we ask the community to be mindful when posting such offboarding.  The time involved for the CU and also the DAO is quite extensive to deal with such MIPs and takes time away from working productively and efficiently.  If there are concerns with a CU it is best to directly talk with the facilitator first rather than put MIPs to vote.  Our Cu is always happy to chat with anyone regarding concerns or suggestions. Contributor:  @Leggevents ",
                    "links": [
                        "http://0x.org",
                        "http://0xproject.com",
                        "https://1inch.io/",
                        "https://1inch.io/",
                        "https://7xvc.com/",
                        "https://7xvc.com/",
                        "https://a16z.com/",
                        "https://a16z.com/",
                        "http://aalioit.com",
                        "https://aave.com/",
                        "https://aave.com/",
                        "http://advancedblockchain.com",
                        "http://aeindri.org",
                        "https://aglaeventures.com/",
                        "https://aglaeventures.com/",
                        "https://akcela.co.uk/",
                        "https://akcela.co.uk/",
                        "https://www.alchemy.com/",
                        "https://www.alchemy.com/",
                        "https://www.alchemy.com/",
                        "https://www.alchemy.com/",
                        "https://allianceblock.io/",
                        "https://allianceblock.io/",
                        "http://andromedia-research.io",
                        "https://apeworksdigital.io/",
                        "https://apeworksdigital.io/",
                        "https://www.apollo.com/",
                        "https://www.apollo.com/",
                        "https://www.apollo.com/",
                        "https://www.apollo.com/",
                        "https://www.apollocap.io/",
                        "https://www.apollocap.io/",
                        "https://artistcapital.com/",
                        "https://artistcapital.com/",
                        "https://ascensiveassets.com/",
                        "https://ascensiveassets.com/",
                        "https://atka.io/",
                        "https://atka.io/",
                        "http://atlendislabs.io",
                        "http://atlendislabs.io",
                        "http://atlendislabs.io",
                        "http://atlendislabs.io",
                        "https://attarius.com/",
                        "https://attarius.com/",
                        "https://www.avalabs.org/",
                        "https://www.avalabs.org/",
                        "http://avarta.io",
                        "https://azuro.org",
                        "https://azuro.org",
                        "https://backed.fi/",
                        "https://backed.fi/",
                        "http://banklesshq.com",
                        "https://www.binance.com/en",
                        "https://www.binance.com/en",
                        "https://www.bitgo.com/",
                        "https://www.bitgo.com/",
                        "http://blockchaincapital.com",
                        "https://blockdaemon.com/",
                        "https://blockdaemon.com/",
                        "https://blockscout.com/eth/mainnet/",
                        "https://blockscout.com/eth/mainnet/",
                        "https://www.blocktower.com/",
                        "https://www.blocktower.com/",
                        "https://www.bloxstaking.com/",
                        "https://www.bloxstaking.com/",
                        "https://bprotocol.org/",
                        "https://bprotocol.org/",
                        "https://brightunion.io/",
                        "https://brightunion.io/",
                        "https://www.carbonbase.co/",
                        "https://www.carbonbase.co/",
                        "https://catalog.fi/",
                        "https://catalog.fi/",
                        "http://celestia.org",
                        "https://celo.org/",
                        "https://celo.org/",
                        "https://centrifuge.io/",
                        "https://centrifuge.io/",
                        "https://www.certik.com/",
                        "https://www.certik.com/",
                        "http://chainflip.io",
                        "https://chainwire.org/",
                        "https://chainwire.org/",
                        "http://chapterone.com",
                        "http://chroniclelabs.org",
                        "http://coinbase.com",
                        "http://coindesk.com",
                        "http://coinstelegram.com",
                        "http://cometh.io",
                        "http://coscientia.com",
                        "http://courtyard.io",
                        "http://creatoros.co",
                        "http://criterionvc.com",
                        "http://cronoslabs.org",
                        "http://crtlabs.io",
                        "http://cryptobriefing.com",
                        "http://cryptocanal.org",
                        "http://cryptotesters.com",
                        "http://cvcapital.io",
                        "http://dao5.com",
                        "http://daoversal.com",
                        "http://decenter.com",
                        "http://deficapitalmarkets.io",
                        "http://deficustody.com",
                        "http://defined.fi",
                        "http://degenscore.com",
                        "http://delphidigital.io",
                        "http://deversifi.com",
                        "http://dgfans.io",
                        "http://dinngo.co",
                        "http://eakdigital.com",
                        "http://element.fi",
                        "http://ethereum.org",
                        "http://farmerfund.io",
                        "http://femboys.io",
                        "http://figment.io",
                        "http://findora.org",
                        "http://fintech.io",
                        "http://flipsidecrypto.com",
                        "http://flowcarbon.com",
                        "http://follmer-greiff.de",
                        "http://fundamenter.com",
                        "http://galaxydigital.io",
                        "http://get-protocol.io",
                        "http://gitcoin.co",
                        "http://gitpoap.io",
                        "http://gmrounded.com",
                        "http://gofyeo.com",
                        "http://goldentree.com",
                        "http://gqtfinance.com",
                        "http://gradient.com",
                        "http://graftsocial.com",
                        "http://hashingsystems.com",
                        "http://hoprnet.org",
                        "http://hvcapital.com",
                        "http://ideo.com",
                        "http://inboundjunction.com",
                        "http://jobprotocol.co",
                        "http://keyko.io",
                        "http://l2beat.com",
                        "http://labdao.com",
                        "http://launchub.com",
                        "http://layerzerolabs.org",
                        "http://libertuscapital.com",
                        "http://lido.fi",
                        "http://linumlabs.com",
                        "http://list.ru",
                        "http://mairey.net",
                        "http://marketacross.com",
                        "http://marscolony.io",
                        "http://maven11.com",
                        "http://mercuryo.io",
                        "http://messari.io",
                        "http://metis.io",
                        "http://minespider.com",
                        "http://mintdropz.com",
                        "http://mitonc.com",
                        "http://momentsofspace.com",
                        "http://moonpay.com",
                        "http://moricz.io",
                        "http://myetherwallet.com",
                        "http://nervos.org",
                        "http://northzone.com",
                        "http://oazoapps.com",
                        "http://omniscia.io",
                        "http://ondefy.com",
                        "http://opolis.co",
                        "http://orbitmarkets.io",
                        "http://originprotocol.com",
                        "http://owlventures.co.uk",
                        "http://pangeadao.org",
                        "http://panony.com",
                        "http://panteracapital.com",
                        "http://partisiablockchain.com",
                        "http://perp.com",
                        "http://phaver.com",
                        "http://pillarproject.io",
                        "http://pitango.com",
                        "http://pooldata.io",
                        "http://privaterelay.appleid.com",
                        "http://prometeus.io",
                        "http://purestake.com",
                        "http://railgun.org",
                        "http://raygroup.uk",
                        "http://redalpine.com",
                        "http://renproject.io",
                        "http://ribbitcap.com",
                        "http://risczero.com",
                        "http://rokcapital.io",
                        "http://sabregames.com",
                        "http://serotonin.io",
                        "http://shardlabs.io",
                        "http://shefi.org",
                        "http://shirtum.com",
                        "http://sinoglobalcapital.com",
                        "http://skolkovotech.ru",
                        "http://skyminelabs.com",
                        "http://snzholding.com",
                        "http://solace.fi",
                        "http://solarbeam.io",
                        "http://spearbit.com",
                        "http://stakedao.org",
                        "http://stakewise.io",
                        "http://stemsdao.com",
                        "http://stupay.com",
                        "http://sumsub.com",
                        "http://superpat.io",
                        "http://sushi.com",
                        "http://sygnum.com",
                        "http://tenderly.co",
                        "http://tokfi.com",
                        "http://transak.com",
                        "http://trgc.io",
                        "http://tribecap.co",
                        "http://upshot.io",
                        "http://vestiver.com",
                        "http://voltprotocol.io",
                        "http://w3key.co",
                        "http://wachsman.com",
                        "http://webetnetwork.com",
                        "http://wintermute.com",
                        "http://workpi.com",
                        "http://worldcoin.org",
                        "http://x-trix.org",
                        "http://yapglobal.com",
                        "http://zebudigital.com",
                        "http://zerion.io",
                        "http://zklend.com",
                        "https://youtu.be/NKWr326h0E8",
                        "https://forum.makerdao.com/t/governance-voting-incentive-campaign/17158",
                        "https://forum.makerdao.com/t/governance-voting-incentive-campaign/17158/14",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-august-2022/16955"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6373216069644645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leggevents",
                    "index": "#2",
                    "likes": "7",
                    "time": "26/08/2022-22:56:27",
                    "content": "In case you missed the video recap link above (as we couldn’t embed)       ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "2",
                    "time": "27/08/2022-19:04:00",
                    "content": "Excellent report! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xWildhare",
                    "index": "#4",
                    "likes": "2",
                    "time": "27/08/2022-21:08:01",
                    "content": "The party at EthCC was awesome. Can’t wait for Bogota! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/08/2022-13:12:42",
                    "content": "I think this is pretty helpfull for branding. Maker needs to go loud all over the media and people must know the number 1 DeFi Protocol, NICE!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mikea",
                    "index": "#6",
                    "likes": "2",
                    "time": "29/08/2022-16:17:55",
                    "content": "Nice! The transparency here is awesome. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MS1",
                    "index": "#7",
                    "likes": "3",
                    "time": "30/08/2022-11:51:37",
                    "content": "Party mode ON Next stop Warsaw ; ) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#8",
                    "likes": "1",
                    "time": "30/08/2022-13:47:20",
                    "content": "Great parties consistently  Waiting for DEVcon (Bogota) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "28/11/2022-13:47:58",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}