{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/kao-protocol-seed-investment-venture-debt/18720",
            "title": "Kao Protocol - Seed Investment / Venture Debt ",
            "index": 18720,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/KaoProtocol",
                    "index": "#1",
                    "likes": "0",
                    "time": "08/11/2022-20:38:00",
                    "content": "Kao Protocol aims to secure 60,000 $Dai investment from MakerDao. In exchange for 60,000 $Dai , Kao Protocol offers a 12% fixed interest rate and 1% of the total $Kao supply will be sent to MakerDAO Treasury without lock-up or vesting. Repayment of the debt will be made in equal payments of 5,600 $Dai per month starting 1 month after TGE. (Kao Protocol reserves the right to fully pay off the debt before deadlines upon paying the full principle & interest) Raised funds will be allocated as below: -50,000 $Dai will be added to the initial $Kao liquidity pool with 35% of the total $Kao supply -10,000 $Dai will be used to cover expenses such as audit and development Besides financials by using $Dai we will decrease the outstanding $Dai circulation since most of our liquidity pool will be idle & we will increase $Dai adoption. So What is Kao Protocol? Kao Protocol aims to incentivize its shareholders with $Dai, generated from multiple revenue streams within and outside of the blockchain. The protocol will be launched on Ethereum Mainnet. The native token of the protocol is $Kao and has multiple use cases. With $Kao users can : -Participate in governance proposals -Purchase products(NFTs) $Kao token has a decreasing swap fee when interacting with Uniswap V2 liquidity pool on top of base Uniswap 0.3% LP fees. 4%-4% until 3M volume 1%-4% until 5M volume 0.5%-4% until 8M volume 0.5%-2% until 10M volume 0.5%-0.5% after 10M volume Generated fees are swapped to $Dai and will be used for: -Building Protocol Treasury -Covering Expenses -Incentivizing Kao Protocol Shares NFT stakers -Funding new ideas What can users purchase with $Kao tokens? Kao Protocol Shares NFTs (mint price 150 $Kao) -These NFTs represent the shares of the protocol and are eligible to receive $Dai dividends as the protocol generates revenue. The total supply of this collection is 1000 therefore each NFT receives 0.1% of the allocated $Dai if stakers don’t bribe the protocol. Kao Generative PFP NFTs (mint price 10 $Kao) -These NFTs carry an artistic value & allow holders to receive whitelists for upcoming incubation & partner presales/airdrops. What Else $Kao token can be used for? Kao Real Estate NFTs We aim to fractionalize real estate in Africa by using NFTs & allow blockchain users to invest in it without leaving the blockchain. Here is how it works: -First users need to burn 1 $Kao to get whitelisted. -Whitelisted users can contribute by using $ETH or $Dai and mint NFTs that represent the particular Real Estate investment. -Nft holders can stake and collect rent revenue Example : A house costs 100K USD and generates let’s say 1K USD rent every month. We will offer 1,000 NFTs for 100 USD and with the raised funds we will purchase the mentioned asset. NFT holders will stake and receive 1$ per month per NFT staked. $Kao tokens used for mints will be burned in real-time, creating a deflationary effect. Revenue Streams of the Kao Protocol 1)Buy/Sell Taxes Buy/Sell taxes occurs when users trade $Kao at Uniswap. Taxes at launch will be 4% and we aim to decrease to 0.5% over time to attract more volume and users. Changes in transfer tax will be implemented based on the results of Governance Proposals. 2)NFT Royalties After the minting phase, NFTs will be listed on secondary marketplaces like Opensea. Trading NFTs on these platforms are subjected to ‘creator royalties’.Collected fees will be sent to our Treasury in ETH and will be used for further development and incentives. 3)Yield Multiplier Bribes While staking NFTs users can bribe the protocol to increase their rewards multiplier. This creates a gamified staking experience while allowing us to have continuous funding for the development. 4)Real Estate Rent (2023) Users will be able to buy NFTs that represents a share of a Real World Real Estate that generates rent revenue. This product allows us to have a revenue stream outside of Blockchain.NFT stakers will receive the majority of the rent revenue and the remainder will be allocated towards development and incentives for Kao Shares NFTs. Rent Kao Company Bank Account​:arrow_forward:Centralised Exchanges​:arrow_forward:Decentralised Wallet​:arrow_forward:Staking Pools kaoprotocol.eth / 0x643A6Af01eAEeb375d98787Bdf68a88cD6e2B09D    kao-protocol.gitbook.io    Welcome www.kaodefi.com      Feel free to connect with us twitter.com/Kaodefi   Discord    Join the Kao Protocol Discord Server! Check out the Kao Protocol community on Discord - hang out with 64 other members and enjoy free voice and text chat.         Telegram    Kao Token Real Yield NFT Staking Protocol on the Ethereum Chain.Powered by $Kao token.\twww.kaodefi.com      Thanks for reading! I would love to hear your thoughts even if we fail to secure a deal.We are young and still haven’t felt the slap of the World, we believe that we can have a positive impact for the space. -Kaodev ",
                    "links": [
                        "https://kao-protocol.gitbook.io/kao-whitepaper/",
                        "http://twitter.com/Kaodefi",
                        "https://discord.com/invite/CNKS2tYcyq",
                        "https://discord.com/invite/CNKS2tYcyq",
                        "https://t.me/kaotoken",
                        "https://t.me/kaotoken",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/31"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.852705627705628
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "7",
                    "time": "08/11/2022-21:34:21",
                    "content": "Thank you for the proposal but I don’t think it’s something the Maker protocol is interested in pursuing. Maybe once the real estate part is working well in the future, can revisit the topic of collaboration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KaoProtocol",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/11/2022-12:05:53",
                    "content": "Thanks for the reply.I respect the decision, will connect again when we build the Real Estate part. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "07/02/2023-12:06:01",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}