{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poll-rwa-risk-onboarding-sections-most-valuable-insights/6123",
            "title": "[Poll] RWA Risk Onboarding Sections - Most valuable insights? ",
            "index": 6123,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#1",
                    "likes": "4",
                    "time": "20/01/2021-10:13:08",
                    "content": "The RWA Risk team is finally approaching the launch of the first RWA assets on MCD. As a team, we are committed to keep improving how we interact with the community and provide valuable insights at both onboarding of new assets and monitoring of existing ones. With the vote of confidence from the community, the team is starting the work on the next “batch” of RWA assets (P1, HTC and Fortunafi). To improve your reading experience and tailor the content of our assessments to what is “essential” for RWA decision making, this poll is to capture your voice on our evaluation sections. The RWA team wants to hear your thoughts on what is useful or not in the publication of our assessments.  Refer to previous onboardings to get an idea of what the sections look like (SIXS, CF, NS). We are committed to incrementally include formatting improvements as well, such as infographics and summaries. Also feel free to drop us a few notes below on qualitative and/or quantitative improvements you think will contribute to community engagement. These polls will help the RWA team focus on the aspects that are most valuable in reviewing the MIP6 applications for the community. Signed the RWA team: @SebVentures @Philinje @williamr    Executive summary, including Risk Parameters  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Background/Context  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Industry analysis  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Peer/Competitor analysis  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Asset originator analysis  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Lending process  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Levels of risk  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Borrower analysis  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Token issuance platform analysis  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Implementation details  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Proposed covenants, including Collateralization Ratios  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters        Legal structure review  Useful, I want to see greater focus on this Not useful, this could be removed without loss of insight Neutral/Abstain     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/discussion-first-cycle-lessons-learnt-rwa-evaluations/5968",
                        "https://vote.makerdao.com/polling/QmQWRByv?network=mainnet#vote-breakdown",
                        "https://forum.makerdao.com/t/p1-drop-mip6-application-peoples-company-drop-us-agricultural-real-estate/5518",
                        "https://forum.makerdao.com/t/htc-drop-mip6-application-harbor-trade-credit-drop-short-term-trade-receivables/3502",
                        "https://forum.makerdao.com/t/fft1-drop-mip6-application-fortunafi-drop-revenue-based-financing-assets/6015",
                        "https://forum.makerdao.com/t/sixs-rwa-001-collateral-onboarding-risk-evaluation/5352",
                        "https://forum.makerdao.com/t/cf-drop-collateral-onboarding-risk-evaluation/5597",
                        "https://forum.makerdao.com/t/ns-drop-collateral-onboarding-risk-evaluation/5418",
                        "https://forum.makerdao.com/t/discussion-first-cycle-lessons-learnt-rwa-evaluations/5968",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-01/6310",
                        "https://forum.makerdao.com/t/rwa-assessment-sections-poll-results/6641",
                        "https://forum.makerdao.com/t/governance-at-a-glance-january-14-21-2021/6145"
                    ],
                    "GPT-summary": "The RWA Risk team is seeking feedback from the community on the evaluation sections of their assessments for onboarding new assets and monitoring existing ones. They have provided a poll for the community to vote on the usefulness of different sections and are also open to qualitative and quantitative improvements.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.881701631701631
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "1",
                    "time": "20/01/2021-12:22:22",
                    "content": "Thumbs up for the RWA team seeking feedback from the community! You ask for my most valuable insight? OK - my most valuable insight so far in the RWA process is that what we have been doing so far is not going to scale. Real World Assets (RWAs) as Vault collateral has been discussed for years, but the practicalities were always hazy. Now we have multiple RWA collateral applications but this has collided with the realities of Maker governance. Maker governance is in the present state not capable of onboarding more than about 2 types of collateral per month. That is a fact we have to live with until we move towards being a protocol. So now you are asking about feedback on risk parameters, background, industry analysis, competitor analysis, asset originator analysis, the lending process etc etc etc. The short answer is “Abstain” on all of them because I fear the RWA effort is heading into an entirely wrong direction. The Maker RWA team will never be able to analyse every applicant in every industry in every country to anything more than a utterly superficial level. This has nothing to do with you personally, even the smartest analyst money could buy would fall short, there is simply too much too learn and too much information. This approach will not scale. Then we just get more people in the RWA team? No, that will fail as Maker is still unable to onboard more than two collateral types per month. Well we built out the Domain Teams then? Well that has you limited by the decision making process at Maker and the brain-bandwidth of the MKR holders. Just last week I clicked “Yes” 20+ times in the governance portal, and that was just crypto assets and normal grinding. How many times do voters need to click to enable large scale onboarding of RWAs with the current process? Several hundred times per week? Needless to say that approach will not scale either. What we can do is to develop one RWA template that is realistic and simply see what will fit that mould. All applications go to a third party. That approach can both scale to a certain extent and can pass through governance. So in other words the RWA team does not deal with applications, there is one prefab deal: take it or leave it. Want to expand RWAs? Make another prefab deal with possibly another third party that suits another type of industry. Example: The various applications under the Centrifuge umbrella. We have a third party that does all the application handling, a company similar to 6s Capital. Let us call this 7s because of my limited imagination. There is a Maker Rep overseeing 7s and being able to take legal action on Maker’s behalf in case of broken terms. 7s has a Vault at Maker, and as long as 7s can sell let us say 20% TIN to outside investors, they can put up the remaining 80% DROP as collateral. 7s is free to finance whatever they like as long as those terms are met. When they need more Dai they just signal that in the forum together with a statement from the Maker Rep. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5012726471059805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#3",
                    "likes": "1",
                    "time": "20/01/2021-14:09:15",
                    "content": "What is the difference between “Borrower analysis” and “Asset originator analysis” ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "2",
                    "time": "20/01/2021-14:42:55",
                    "content": "    Planet_X:  OK - my most valuable insight so far in the RWA process is that what we have been doing so far is not going to scale.   This doesn’t just apply to RWA but pretty much everything Maker is doing.   imo there is a time one has to focus on the low hanging fruit.  If we can only do so many collateral on-boardings then why not focus on the ones that are projected to have the greatest impact?     Planet_X:  Real World Assets (RWAs) as Vault collateral has been discussed for years, but the practicalities were always hazy. Now we have multiple RWA collateral applications but this has collided with the realities of Maker governance   This is generally true.   IMO   Maker governance is sloth like.  There are strong arguments for why it ‘should’ be this way.  Which again is a reason to be judicious in approaches.   Our manpower is limited.  Especially in the smart contracts side for reasons already discussed.   We need to focus on who are the DAI whales now, and who might be in the future.  I don’t even like to post much anymore simply because there seems to be less concern about planning than just getting something, ‘anything’ done vs. talking about it.  Which imo is a bad approach. What gets me is that perhaps 5-10 people decide the fate of most MKR polls and executives and most of these people don’t really say much or do much imo.  I feel like one could throw anything at them and if no-one disagrees or there isn’t anything obviously horrible it will just pass. This means that Core/Domain (whatever you guys want to call your department heads) teams are going to need to do a lot of work, cross talking, etc.   They need to be the checks and balances because for the most part, I expect MKR governance is not going to be up to the task to check/audit executives/code/risk etc.   There is going to be a huge element of trust required from governance on these department heads/teams that they are doing their jobs properly. I was also mixed on what I wanted here.  I ofc want to see all kinds of stuff.    My personal focus is basically who ends up with what on a default.   The kinds of analysis a bank would go through to approve a financing arrangement is pretty stringent in these cases but well known.   RWA isn’t a simple oh deposit the RWA into a contract (collateral), put an oracle on it and DC, SF, CF allow the borrower to borrow, and find a keeper or three and let it fly.   RWA by defnition is significantly more complex than on-boarding other assets and so I expect bringing RWA on-line is going to take more due-diligence by the domain teams. I agree with you @Planet_X that the RWA team should just focus on what is required to make this work and fill in - in a priortized sense other things.    Honestly if we are smart we get our first RWA onboards to help us a bit with some of these things (industry analysis, competitor analysis, background) whatever in exchange for maybe lower SF or maybe even a refund on some of their SF fees since these people (I am thinking about 6s in particular) are ideally suited to provide this info that then only needs to be fact checked by the RWA team.    But even that is NOT a requirement. In short why not list what is NEEDED in the RWA teams view vs. what governance might want and focus on that.? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.889632936507937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#5",
                    "likes": "1",
                    "time": "20/01/2021-20:06:24",
                    "content": "    g_dip:  What is the difference between “Borrower analysis” and “Asset originator analysis” ?   @g_dip Borrower analysis looks at the underlying borrowers and their credit profiles behind the asset originators pool. It doesn’t cover all of them extensively, but mostly gets a view of the top loans by exposure and borrower size. Asset originator analysis is focused on the SPV and asset originator. Its intent is to look at things like aggregate default rates, pool concentration risks, overall credit quality and DD on the entity behind the asset originator. In a nutshell, they both look at two levels of granularity of the debt instrument: pool (asset originator), underlying groups of loans (end borrower). ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#6",
                    "likes": "2",
                    "time": "20/01/2021-20:11:14",
                    "content": "Thanks for clarifying. A suggestion I have, which may sound a bit ridiculous, is adding a “SHTF (shit hits the fan)” section to the risk analysis. Basically I’d love to see the hypothetical worst case scenario(s) and how it (they) play out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.638888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#7",
                    "likes": "1",
                    "time": "20/01/2021-20:20:45",
                    "content": "@g_dip It’s a good suggestion we’ve started exploring, but it’s a bit two fold. On the quantitative side, we plan to integrate some quant simulations to stress test the portfolio. On the qualitative side it’s a bit trickier. That’s where the legal & compliance DD takes place and precedence. We plan to include some “pointers” of risk severities in the structures of contracts for example, with some recommended actions to mitigate those risks. But for that to be fully deployed, we’ll most probably need collaboration with proper legal teams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.6
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "2",
                    "time": "20/01/2021-20:45:39",
                    "content": "    Planet_X:  Maker governance is in the present state not capable of onboarding more than about 2 types of collateral per month.   If they are all based on existing templates (the trust model or Centrifuge), they don’t take much Smart Contract or Oracle time. We can multiply the throughput here (by 2). But even 2 per month is more than enough. I think the idea is to focus on what matters for each level of Maker RWA maturity. We are already in touch with a team that can provide asset management for a pool of diversified structured finance assets. We might end up with 10-20 big and diversified asset managers, each specialized on a dedicated asset class. If governance prefers to onboard a multitude of small asset originators, that’s fine as well but obviously, this is more complex and work-intensive. This is a bit like your example. For governance workload, I sadly can’t have a solution here. It’s governance that decides the process. Regarding RWA we try to design our interaction with the community in an “entertaining” way like this poll on maturity. We provide some information but then you decide or don’t reply if you don’t want to take the time. And really, one should not underestimate the power of the Maker community. We have expert on most field in this forum that can help anytime to move Maker forward. You always discover a new thing on Maker Forum. Trade Finance? We got you covered. The Farm business? We have that as well. You don’t get all those perks by being a shareholder of Tesla.     MakerMan:  In short why not list what is NEEDED in the RWA teams view vs. what governance might want and focus on that.?   The current structure is more or less what we need. The more important part is the covenant section. There is also an ongoing back and forth with asset originators that we don’t publish every piece. And it doesn’t stop with the risk assessment. But governance needs to make a decision at some point. At the end of the day, governance decides and we apply. A domain facilitator might will an alarm if there is too much risk but you are in charge. ",
                    "links": [
                        "https://forum.makerdao.com/t/cf-drop-collateral-onboarding-risk-evaluation/5597",
                        "https://forum.makerdao.com/t/p1-drop-mip6-application-peoples-company-drop-us-agricultural-real-estate/5518"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.65012987012987
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#9",
                    "likes": "1",
                    "time": "21/01/2021-02:05:50",
                    "content": "    Planet_X:  So now you are asking about feedback on risk parameters, background, industry analysis, competitor analysis, asset originator analysis, the lending process etc etc etc. The short answer is “Abstain” on all   Really appreciate the feedback. The intention of the survey here is really to keep the communication open and constructive. We want to get to the “sweet spot” where the community has enough insight to make a decision on these assets. We’ve got a template on which the first assets were based. Now, we want to improve it, make it more appealing, more meaningful to you. Will that stop us from digging further on each asset or asset class? Of course not, but not every detail will be meaningful to every one. There is always a level of inquisitiveness and curiosity in any analysis. On the other hand, we think communication is better kept to essentials.     Planet_X:  The Maker RWA team will never be able to analyse every applicant in every industry in every country to anything more than a utterly superficial level.   As @SebVentures said above there are certainly areas where we can “source” expertise and technology (e.g. Centrifuge) to support us with a view to scaling. On top of that, it’s a natural (and I hope a positive) thing that teams embed some intelligence, at least in some critical asset classes that can truly diversify the protocol portfolio. Native crypto risk team has done that with team contributors focused on LP related assets, whose frameworks are much newer and not even set. Traditional assets have more established frameworks we can understand and be confident about. Of course, we won’t know it all and on every industry on earth, so working collaborations are absolutely welcome. And I dare to say are already happening in farmland for example.     Planet_X:  What we can do is to develop one RWA template that is realistic and simply see what will fit that mould.   Absolutely. That is the purpose here: Input and simplification.     MakerMan:  In short why not list what is NEEDED in the RWA teams view vs. what governance might want and focus on that.   Actually, that is precisely the subject of what we’re working through. We’ve started by defining some of the requirements from a Risk perspective. Then over time, simplifying and/or adding adjustments to those steps that are critical to get to a reasonable state. And now, as some steps (such as assessment templates) start getting a little more “normal” we are refining them with your input. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.020820749018423
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "22/04/2021-08:05:54",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}