{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/bidding-costs-for-liquidation-auctions/3577",
            "title": "Bidding costs for liquidation auctions ",
            "index": 3577,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "liquidation-system"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/kaciloy",
                    "index": "#1",
                    "likes": "7",
                    "time": "07/08/2020-00:52:27",
                    "content": "I’ve been researching the costs of participating as a keeper in the auction process. I have two primary takeaways: 1. Liquidity providers Keepers act as liquidity providers, so that Maker doesn’t have to sell off ETH to a DEX itself. Keepers constantly need to “recycle” - convert the ETH they win back into DAI, so they have enough capital to bid in future auctions. The recycling concept applies even if Maker were to add single-block composability to their auction process. Keepers would still need to recycle, but would do so in the context of a flash loan, rather than a manual DEX trade. 2. Bidding costs As I see it, keepers incur three primary costs:  Gas fees (for tend, dent, deal, etc.) Slippage (for converting ETH back to DAI) Cost of capital (the “required rate of return,” or the risk-adjusted opportunity cost for holding DAI instead of another investment)  Whoever minimizes these three costs above, most efficiently, will be able to make the best bids (the lowest discount compared to market value). Questions I’m planning to document those two ideas, and others, in a more formal report. One question I have: am I missing any other bidding costs that keepers might be incurring? Also, happy to hear any opinions on the statements above. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.345588235294118
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "1",
                    "time": "07/08/2020-03:47:22",
                    "content": "I really like someone thinking about this. First point is that the liquidation system is undergoing a major upgrade/change so the data you collect now only apply to the current system that hopefully very soon will be changing for the better. A Liquidation System Redesign: A Pre-MIP Discussion and MIP19: Liquidations System 1.1 Upgrade I know a few issues are being looked at in the upgrade one is capital efficiency (how much DAI sits in the bidding contract to achieve good bids with multiple bidders in the old system - the new has an entirely different approach to this I think) but I am not sure how much keeper costs in keeping are really considered much less analyzed when the liquidation system is in operation (with whatever version) I had a crazy idea of doing both a weekly liquidation report for Maker as well as a Vault report but others have more resources in place to do these things so I may just make some suggestions to SamM or others for additional reports on these things. Regarding bidding costs above. Add in the costs related to failure to win an auction.   When Twicky gave me the data for the Liquidation Report Maker MCD Ethereum System Liquidation report and Black Thursday Compensation Analysis one of the last things I had him add was the winning bidders tx costs and current network gwei for the completed txs so I could graph this over time.  In the next iteration (I never got) I was going to ask for the losing bidders tx costs to be summed so I could do a general keeper report for all keepers in the liquidation report.  Not every keeper wins an auction so the overall optimization includes not just what you list above, but also the gas due to losing bids, as well as the capital cycling for all keepers generally whether they win or lose.  There are also other interesting things that show up if one takes a look at number of bidders for an auction against the collateral returned and the size of the lots. Not included because everything is in DAI is whether any of these keepers are also using vaults with the collateral which means different collateral/capital cycling costs and pricing risks.  There is somewhat of a DAI price risk or reward if any keepers are going through the USDC vaults to mint DAI. I have grown my DAI (now I think in USDC) fund from the 4000DAI the foundation paid me for the liquidation report and am still looking for someone who can code up and run on-chain analytics to produce reports and the Liquidation report, including vault collateral return stats, keeper gains/losses/activities, how much Maker made (i.e. fees), total collateral liquidated etc. is still a prime target.  It was my hope in time if I could get some analytics going I could get some donation funding to further various types of Maker analytics and perhaps merge all the available analytic data obtainable into a general analytics product everyone can access to then do further analysis/reports etc.   Feel free to pm me here or in rocketchat if you are interested in doing other liquidation analytics, perhaps focusing on just providing a weekly liquidation report that shows what happened in the system from 3 points of view.  What vault holders got back, profit/loss/activites for the keeper including all fees and an analysis of what they are doing with their capital, and then to Maker system proper - how much DAI was made in fees, pricing of collateral relative to OSM and UniswapV2 collateral-DAI pairs etc. If you are just focused on the above.  I wish you well and will be eager to see any version of the above for the current system as well as when it changes.   One of the key issues will be auction efficiency for the entire system relative to costs/fees for all players to be there.  I have a list of the on-chain information Twicky provided to me that produced much of what is seen in the Liquidation Report above.  There was a lot more that was/is there that for practical expediency issues I left out that it looks like you will be researching. Best of luck in completing your project and welcome aboard in the forums! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip19-liquidations-system-1-1-upgrade/3098",
                        "http://forum.makerdao.com/t/maker-mcd-ethereum-system-liquidation-report-and-black-thursday-compensation-analysis/2243"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.644143356643356
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#3",
                    "likes": "5",
                    "time": "07/08/2020-13:37:29",
                    "content": "    kaciloy:  The recycling concept applies even if Maker were to add single-block composability to their auction process. Keepers would still need to recycle, but would do so in the context of a flash loan, rather than a manual DEX trade.   I’m not sure it’s very useful to look at this the way you describe it. The key thing to keep in mind here is that the Maker protocol can mint unlimited Dai. And as long as this is repaid within the same transaction, this carries no risk for the protocol. So it wouldn’t be a flashloan as much as a “flashmint” of (unbacked) Dai without limitation. As long as a profitable arbitrage transaction can be constructed, there will be 0 capital requirement for the keeper, and in principle no more Dai liquidity in the market will be required than the interest that is paid on the flashmint amount (if any.)     kaciloy:  2. Bidding costs As I see it, keepers incur three primary costs:  Gas fees (for tend , dent , deal , etc.) Slippage (for converting ETH back to DAI) Cost of capital (the “required rate of return,” or the risk-adjusted opportunity cost for holding DAI instead of another investment)    With the above in mind, (3) is eliminated entirely. Success will be determined by an arms race to compile the most profitable arbitrage transactions without capital requirement. PS: credit to someone on Rocket.chat who thought about the term “flashminting” instead of flashloan. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.457692307692308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#4",
                    "likes": "4",
                    "time": "07/08/2020-13:48:44",
                    "content": "    kaciloy:  One question I have: am I missing any other bidding costs that keepers might be incurring?   Integration, operational, and maintenance cost. Today it’s quite expensive to integrate with the auctions and keep your service online all the time (development, hosting, security, etc.) This cost will be drastically reduced too, with the Liquidations 2.0 system. Bottom line is that a single-block composable model is much simpler to integrate with. Part of the reason is that the entire auction can then be abstracted away as a simple offer in the market: X collateral units for Y Dai. This can even be included in DEX aggregators and other exchanges. The auctions today are stateful, there are strategic bidding and timing complexities that will be eliminated or reduced, etc. Efficiency will further be improved due to partial bidding support. Your arbitrage transaction does not have to buy the entire lot on offer. If a smaller market opportunity presents itself, you can grab just a part of it. The keeper ecosystem will fundamentally change, with this update. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "0",
                    "time": "07/08/2020-13:51:25",
                    "content": "    wouter:  PS: credit to someone on Rocket.chat who thought about the term “flashminting” instead of flashloan.   I think it was @swakya on chat. I’m fairly certain he didn’t come up with the term though. Only shared it with us.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/08/2020-14:43:06",
                    "content": "@LongForWisdom Yes! It comes from https://github.com/Austin-Williams/flash-mintable-tokens. @wouter Do you see any disadvantages with the liquidation 2.0 you are working on? Is it OK to summarize it as “dutch+flashmint”? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#7",
                    "likes": "1",
                    "time": "07/08/2020-15:01:06",
                    "content": "There aren’t that many downsides compared to the current system afaik. One caveat is that it’s important to find the right price curve that drops fast enough to catch up with the market price (downward) but not so fast that it becomes vulnerable to spamming and network congestion. Another would be front-running which now becomes an issue precisely because of the zero capital requirement. But there are ways to mitigate that. Last one is that the system will probably not be suitable for real world assets. For those, the current system seems closer to what we need. Summary would be Dutch auction + flash mint + partial liquidation. I think the importance of that one shouldn’t be underestimated, especially in the face of volatile gas prices. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.711904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#8",
                    "likes": "0",
                    "time": "07/08/2020-15:38:14",
                    "content": "Thanks for the the response. How do you mitigate front-running (and is it that much of a problem from Maker’s pov))? Why is the new system not good for real world assets? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.386363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "0",
                    "time": "07/08/2020-16:25:37",
                    "content": "    wouter:  Efficiency will further be improved due to partial bidding support. Your arbitrage transaction does not have to buy the entire lot on offer. If a smaller market opportunity presents itself, you can grab just a part of it. The keeper ecosystem will fundamentally change, with this update.   It is going to be interesting to see all this come on line and then look at the operational results. All the new access points into the old liquidation system will need to be upgraded or we will be back to basic keeper system unless we can get some sort of Oasis or other public interfaces for manual access.  I consider this part key as there is no reason not to have an interface so smaller players can nab pieces of the total lot as the price drops. More bidding access means better bids and since the way the new system will work tx and capital efficiency should be dramatically improved.   Arb trades should be much easier to finance and execute and these are what we really want in such a system.     wouter:  As long as a profitable arbitrage transaction can be constructed, there will be 0 capital requirement for the keeper, and in principle no more Dai liquidity in the market will be required than the interest that is paid on the flashmint amount (if any.)   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.352766798418972
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#10",
                    "likes": "0",
                    "time": "07/08/2020-17:19:09",
                    "content": "It can get competitive for arb bots. No cost of capital but they need to make efficient bots. And gas fees. Not sure what % of the volume they’ll be. There’ll also be retail flow who just want to buy ETH. And keepers that manually recycle to get a better price. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kaciloy",
                    "index": "#11",
                    "likes": "0",
                    "time": "07/08/2020-21:09:36",
                    "content": "I’ve found there’s actually less efficiency at lower bid prices, because gas costs are fixed, and therefore make up a much higher % of the bid value. In fact, some of the historical auction results don’t make sense to me, from a purely financial standpoint. Some winning bids, particularly at values of 100 DAI or less, didn’t even have enough profit to cover the keeper’s gas costs. These results suggest the presence of either naive actors (who aren’t taking all the aforementioned costs into account) or altruistic actors (who bid at a loss in order to sustain the overall Maker system). Also, flash minting would likely require higher gas costs than simply paying DAI from an existing portfolio balance. There is a potential that having zero cost of capital (from flashminting) would be offset by having higher gas costs on every transaction. I say all that not to imply that the new system won’t be more efficient than the old one - I think it sounds like it will be. However, I wanted to bring those up as hypotheticals that will need to play out in practice. The nice thing about the current system is it’s already operating, and we have data that can be analyzed. The new system isn’t running yet, so I’ve found it valuable to analyze what has happened so far with the current system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.491212121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#12",
                    "likes": "0",
                    "time": "07/08/2020-21:22:00",
                    "content": "Well the good thing is that the performance of the new system doesn’t depend on how profitable flashminting is. If flash minting doesn’t end up being profitable because of other people bidding on auctions, that’s seems good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.764204545454545
                }
            ]
        }
    ]
}