{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c5-sp13-facilitator-offboarding-ces-001/18862",
            "title": "MIP41c5-SP13: Facilitator Offboarding (CES-001) ",
            "index": 18862,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "ces-001",
                "cu-facilitator",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "2",
                    "time": "21/11/2022-05:28:38",
                    "content": " MIP41c5-SP13: Facilitator Offboarding (CES-001)  Preamble MIP41c5-SP#: 13 Author(s): @monkey.irish Contributors: @dbkcan @zmtong Tags: ces-001 Status: Accepted Date Proposed: 2022-11-20 Date Ratified: N/A Forum URL: https://forum.makerdao.com/t/mip41c5-spxx-facilitator-offboarding-ces-001/18862 Extra: This was a voluntary offboarding; as such, it was not subject to vote.   Sentence Summary  Paragraph Summary  Specification  Motivation After much deliberation and based upon current events within MakerDAO and CES, I immediately terminate my role as the Collateral Engineering Services (CES-001) Core Unit Facilitator.  Powers for Unwinding Plan With my departure and per MIP41c6, I am nominating co-Interim Facilitators to assist with the offboarding of CES-001. They are:  Mabel Tong - @zmtong  David Krett - @dbkcan   Please direct all Core Unit inquiries to the interim facilitators. Both facilitators are seasoned, highly-experienced professionals with the background and knowledge to continue to deliver on the CES-001 mandate and support an orderly wind down of the Core Unit. The co-Interim Facilitators will retain the necessary minimum powers as listed in MIP39c2-SP37. The relavant Core Unit unwinding plan is located within MIP39c3.  Core Unit ID CES-001 ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp37-modifying-collateral-engineering-services-core-unit-mandate-ces-001/17751",
                        "https://forum.makerdao.com/t/mip39c3-spxx-core-unit-offboarding-ces-001/18863",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/33",
                        "https://forum.makerdao.com/t/interim-facilitator-assessment-for-ces-001/19196",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-november-2022/19023",
                        "https://forum.makerdao.com/t/mip39c3-sp6-core-unit-offboarding-ces-001/18863/4",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/26"
                    ],
                    "GPT-summary": "The post is an explanation of the MIP41c5-SP13 proposal for Facilitator Offboarding (CES-001). The author explains their decision to terminate their role as the Collateral Engineering Services (CES-001) Core Unit Facilitator and nominates co-Interim Facilitators to assist with the offboarding of CES-001. The post also provides information on the Core Unit ID CES-001 and the relevant Core Unit unwinding plan located within MIP39c3. There is no feedback or collaboration mentioned in the post.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.265432098765432
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "2",
                    "time": "21/11/2022-11:19:02",
                    "content": "    monkey.irish:  With my departure and per MIP41c6, I am nominating co-Interim Facilitators to assist with the offboarding of CES-001. They are:  Mabel Tong - @zmtong  David Krett - @dbkcan     Confirming the nominations per MIP41c6. Can @zmtong and @dbkcan confirm their willingness to serve as interim facilitators here? We would also like an intended time commitment (how long are you intending to serve in this role) if possible. Ideally we could conduct the facilitator vote for you both tomorrow so please respond as soon as you see this post  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c3-sp6-core-unit-offboarding-ces-001/18863/13",
                        "https://forum.makerdao.com/t/weekly-mips-update-114/18875"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/11/2022-23:03:36",
                    "content": "@prose11 I confirm that I am willing to serve as a co-interim facilitator for CES, with an intention to continue delivering outstanding deliverables until such time when MIP39c3-SP6 is ratified, and to wind down the CU. I personally commit to perform my role in a professional manner and am knowledgable enough both on the technical and business perspectives with respect to CESs operations and MakerDao governance to perform the necessary tasks as a co-interim facilitator effectively. All of the foregoing based on the assumption this will require a 2 month minimum commitment with the option to renew. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal"
                    ],
                    "Sentiment": 5.647222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zmtong",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/11/2022-23:19:42",
                    "content": "I confirm that I am willing to serve as a co-interim facilitator for CES for two months at minimum, with the option to renew, and intend to continue delivering outstanding deliverables until such time when MIP39c3-SP6 is ratified and to wind down the CU in anticipation of the ratification. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party offering collaboration on proposal"
                    ],
                    "Sentiment": 5.743055555555555
                }
            ]
        }
    ]
}