{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-the-maker-community-reimburse-mkr-voters-for-the-eth-transaction-fees-incurred-when-polling-and-executive-voting/3651",
            "title": "Should the Maker Community Reimburse MKR Voters for the ETH Transaction Fees Incurred when Polling and Executive voting? ",
            "index": 3651,
            "category": [
                "Governance"
            ],
            "tags": [
                "voting",
                "alignment",
                "vote-participation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "11",
                    "time": "13/08/2020-13:06:33",
                    "content": "As one of the top 20 Active Voters in Maker Governance ( per mkrgov.science)  voting has become an unenjoyable duty. As soon as I get excited about polling about a certain MIP, Collateral, helping get an Executive Vote executed, or even using my small number of Tokens to help protect the overall protocol—I get this painful feeling in my  when I am told by MM it will cost 0.01 ETH to vote. And YES—I know, and thank God the Maker Foundation is looking into ZK-rollups as an option for a less expensive voting experience, as well as possibly Delegating in the near future. But I am thinking about today and tomorrow, when our MKR votes are needed. This week it will cost anywhere from $20 to $50 to Poll on the current nine (9) open polls. And perhaps this is the reason why we have had such a low, low, turnout. More than likely—it is. Now look—when it comes to MKR voting weight—it’s no secret that I’m a Goldfish, not a WHALE—I highly doubt I have ever swung the outcome of an Executive Vote, or Poll—but most of us here—are day in, day out—daily participants of shaping the future of Maker. We are highly connected with Governance. We know who grinds—who votes, and voices his/her opinion of the future of the MakerDAO. So, how do we keep the Maker Community members encouraged to vote? Well IMO we should reimburse the weekly voting gas fee. Now I don’t know how this could work—but my first thought is to reimburse MKR voters from the System Surplus. But before you get all tawdry on me—think of how important it is to keep community members active in the weekly grind of not only voting—but also keeping up with what is what. Most people in Crypto, or even in VC land cannot even tell you how the MIPs process works. But the average Goldfish can. Here’s something I drew up very quickly: Total number of times voted per week (WeVote) x Average Cost of Gas Fees Per Day (ACGas) = Reimbursement of Tx Fees (RTx) WeVote x ACGas = RTx Many of my fellow community members are way smarter than I am—therefore I hope one of you can come up with a much better equation on how to calculate the average gas fees spent on Maker Governance. At the end of the day—keeping the Maker Community engaged in Governance is the number one priority. “The best argument against democracy is a five-minute conversation with the average voter.” ― Winston S. Churchill ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-8/3712"
                    ],
                    "GPT-summary": "The author of the post proposes that the Maker Community should reimburse MKR voters for the ETH transaction fees incurred when polling and executive voting. The author explains that the high cost of voting is discouraging community members from participating in the weekly grind of voting and keeping up with what is happening. The author suggests a formula to calculate the reimbursement of transaction fees and invites the community to come up with a better equation. The post also invites constructive criticism and questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.431046365914787
                }
            ]
        }
    ]
}