{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-july-2021-update/9750",
            "title": "New Silver July 2021 Update ",
            "index": 9750,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "new-silver",
                "rwa",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "9",
                    "time": "09/08/2021-14:45:04",
                    "content": "Dear Community, July was a very busy month on all fronts. We are busy building new tech, improving the process and working through challenges that permeate the general real estate market. Please see our July update below: Loan Originations New Loans: 17 New Loan USD Volume: $7.84mm Average Interest Rate: 9% Average Loan Amount: $461,386 Average Loan to Value: 65% Average FICO score: 697 Current MakerDAO Debt Ceiling: $20mm with about $5.8mm used Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology We have released a major update that includes the Servicing module, this enables tracking our loans from originations to maturity, and provides borrowers enhanced online features for tracking their loans and construction. We are currently working on integrating with Tinlake, this will enable much faster and error-free NFT minting. We will also be looking into improving loan status reporting so that the community can see updates in real-time. People We made new hires in July, Katrina will start this month as a Senior Paralegal and Carmel as our Content and PR Manager. ",
                    "links": [
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/48",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-154-thursday-august-12-17-00-utc/9793/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.114104278074866
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/08/2021-15:43:34",
                    "content": "Any idea why the numbers on the Tinlake dashboard for this pool are so different? Both the average loan and interest are very different there. Is this a UI bug or an artifact of the reporting delay or something? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#3",
                    "likes": "1",
                    "time": "10/08/2021-17:55:05",
                    "content": "Hey @PaperImperium, this reporting has the total originated volume, a few loans didn’t fit the covenants due to size so they were sold off to another partner. Going forward, we will make the distinction on the reporting to be more clearer on what went into Tinlake and what didn’t. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/08/2021-18:43:31",
                    "content": "    prankstr25:  Hey @PaperImperium, this reporting has the total originated volume, a few loans didn’t fit the covenants due to size so they were sold off to another partner.   Any chance we can get the numbers that went into the Tinlake pool instead of total originations? Maybe @SebVentures or someone from RWF has it readily available to share? Just trying to reconcile what’s in the pool with what’s reported. Thank you, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.395833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "0",
                    "time": "22/08/2021-19:27:17",
                    "content": "You can find all the originated loans in the Tinlake Pool here with the date. There is also a cool Dune Analytics dashboard here (but maybe less useful to get numbers). ",
                    "links": [
                        "https://dune.xyz/wnuelle/Centrifuge"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.805555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "0",
                    "time": "22/08/2021-19:39:13",
                    "content": "    SebVentures:  You can find all the originated loans in the Tinlake Pool here    Yes. They do not match the numbers given here. I was wondering why the discrepancy. Do you have a breakdown, @SebVentures? You monitor NS monthly ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "0",
                    "time": "22/08/2021-19:44:33",
                    "content": "I don’t know what is your point of comparison, so it’s difficult to explain. If the difference is small, it can be $/DAI conversion issue ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "0",
                    "time": "22/08/2021-19:58:19",
                    "content": "    SebVentures:  If the difference is small, it can be $/DAI conversion issue   Total loans, average loan size, and interest rates are very different. Which is why I was asking for a breakdown of what was placed in Tinlake. The Tinlake pool shows 9 loans. The average size is $238k. The interest rates range from 5.8% to 7.2%. Since the statistics reported here are not for the Tinlake pool, I was asking what those stats might be. You are monitoring this account on a monthly basis, correct? Perhaps you have the numbers for what was deposited into Tinlake (rather than total originations across New Silver)? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.704545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/08/2021-20:11:00",
                    "content": "As Kirill said, those numbers are for New Silver Lending and not only the Tinlake Pool. This explain why the average on New Silver Lending is higher than those for the pools, as those were too big to be allowed in the pool under the convenants we defined. For the difference in interest rate, it’s origination fees. Again New Silver Lending vs the pool. All granular data for Tinlake is on-chain. I agree it would be nice to have a dashboard. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.693181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "0",
                    "time": "22/08/2021-20:12:38",
                    "content": "So you don’t have any of this information beyond what is on the Tinlake pool? How do you verify Tinlake is displaying correct information? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#11",
                    "likes": "0",
                    "time": "22/08/2021-20:19:14",
                    "content": "Here are the numbers for Tinlake for July. As I mentioned, we will break out the numbers going forward. There were 3 loans that did not fit the pool according to the covenants, and 1 loan that was paid off (it’s counted in this summary). New Loans: 14 New Loan USD Volume: $2.5mm Average Interest Rate: 8.9% Average Loan Amount: $179,040 Average Loan to Value: 63% Average FICO score: 694 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.623376623376624
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "0",
                    "time": "22/08/2021-20:23:17",
                    "content": "    prankstr25:  Here are the numbers for Tinlake for July   Why are the numbers displayed on Tinlake so different? Is there a discrepancy or is there some formula that gets the numbers there to match those here? If there is a discrepancy, is it in the Tinlake dashboard or somewhere else? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "1",
                    "time": "22/08/2021-20:38:02",
                    "content": "    PaperImperium:  Why are the numbers displayed on Tinlake so different?   Dates are different. If you take loan #45 it’s in July in Tinlake (Tinlake operation) but the date of the loan itself is end of June. And some loan issued in second part of July could be financed on Tinlake only in August after the DC increase. @Philinje, @williamr, and myself have access to the underlying loan tape and we run random inspections each month to check the numbers with the underlying documents. A good part of that info should be brought on-chain at some point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#14",
                    "likes": "1",
                    "time": "22/08/2021-20:41:49",
                    "content": "Yes, the Origination dates is how we report, however, loans might be added to Tinlake some days later. We are close to completing an integration with Tinlake which should make this process a bit faster. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#15",
                    "likes": "0",
                    "time": "30/08/2021-23:35:45",
                    "content": "    SebVentures:  @Philinje, @williamr, and myself have access to the underlying loan tape and we run random inspections each month to check the numbers with the underlying documents.   There is always a delta in terms of dates between the actual loan origination date and the financing date as shown in the tinlake UI. The same happens with regards to maturity date, the SPV maturity date is usually a few days earlier than the Centrifuge one. The differences are in days to cater for weekends, holidays and such events where real-world businesses (banks, custodians etc) operate on a Mon-Fri 9 to 5. Having that delta, particularly on the maturity date, is to prevent tinlake from flagging an arrears event where it can be simply be due to a bank-wire delay or a weekend/public holiday on the part of the issuer and their counterparties. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.588541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "28/11/2021-23:36:02",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-may-2021-update/8682",
            "title": "New Silver May 2021 Update ",
            "index": 8682,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "new-silver",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "3",
                    "time": "10/06/2021-16:02:38",
                    "content": "We wanted to give you an update on our activities in the month of May. Though housing supply is short, we continue to outperform and posted a record number of loan applications, over 150 in May. This led to substantial growth in the pipeline and originations. We were also able to decrease our pricing, and we believe we are now one of the more competitively priced lenders in the marketplace. We are not looking for a “race to the bottom”, however, price competitiveness should bring in more highly qualified borrowers. On top of that, we continue to innovate on the technology front and introduce features to make borrowing faster and easier, and give prospective borrowers the tools they need to be successful (more on this topic soon). One challenge we are working through is collateral valuation - we rely on a third-party network of independent appraisers, who are extremely busy and very slow. This affects the whole US real estate industry, and there is little we can do to improve it. If we can speed up valuation with a process that is as good or better than what we have today, we would be able to further improve origination speed and continue to gain market share. We are in the market for a technological solution, if one exists, to help us speed up this process. Loan Originations New Loans: 12 New Loan USD Volume: $3.56mm Average Interest Rate: 9.5% Average Loan Amount: $297,400 Average Loan to Value: 77% Average FICO score: 705 Current MakerDAO Debt Ceiling: $5m with about $2.1mm used Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology We are on track for a major release this week that will include a brand new Servicing module which will allow us to track loans after closing, report, manage construction draws, and integrate with the servicer of record for real-time updates. This will also open the door to help us build more transparency into each outstanding loan. People There were no new hires in May. We have been focused on bringing on a full-time recruiter to help us fill open positions. One of the newly hired loan consultants did not work out, and we will be replacing that role, and hiring others, in the coming months. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.834157754010695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/06/2021-16:29:29",
                    "content": "Were there any changes to the terms and conditions of the DROP agreement and associated documents since initially entering into the agreement? If so – and New Silver is entitled to do so under section 4.F. – what were they, when did they go into effect, when was notice given in writing (via email as described in the agreement), and to whom? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6439393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/06/2021-19:05:49",
                    "content": "Yes, any material term changes are sent via email 2 weeks in advance to all of the DROP token holders. If this process needs to improve, we are happy to try to accommodate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mardo",
                    "index": "#4",
                    "likes": "0",
                    "time": "10/06/2021-20:43:05",
                    "content": "    prankstr25:  There were no new hires in May. We have been focused on bringing on a full-time recruiter to help us fill open positions. One of the newly hired loan consultants did not work out, and we will be replacing that role, and hiring others, in the coming months.   @prankstr25 what positions do you have open that need to be filled? Sorry if I missed a post on it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.973484848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#5",
                    "likes": "0",
                    "time": "10/06/2021-21:33:01",
                    "content": "At the moment we are focused on the recruiter role, but then additional loan consultants, marketing and software development. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mardo",
                    "index": "#6",
                    "likes": "0",
                    "time": "10/06/2021-23:39:34",
                    "content": "Thanks. Are there job descriptions available? Sorry, I’d check the website career section (assuming there is one) but not able to view the MakerDao site at all today (is it down?). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.694444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#7",
                    "likes": "0",
                    "time": "11/06/2021-00:35:30",
                    "content": "We are hoping to be making an offer to the recruiter tomorrow so the posting has been closed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mardo",
                    "index": "#8",
                    "likes": "0",
                    "time": "11/06/2021-00:40:23",
                    "content": "How about the description for the consulting, marketing and loan consultant jobs? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#9",
                    "likes": "1",
                    "time": "11/06/2021-00:42:52",
                    "content": "Not live yet, once the recruiter gets going, we can share. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.659090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mardo",
                    "index": "#10",
                    "likes": "1",
                    "time": "11/06/2021-00:46:12",
                    "content": "Got, thank you for your responses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "09/09/2021-00:46:58",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-august-2021-update/10112",
            "title": "New Silver August 2021 Update ",
            "index": 10112,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "new-silver",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "7",
                    "time": "01/09/2021-17:37:21",
                    "content": "Dear Community, August was a bit slower mainly due to continued slowness on the collateral valuation front. We are working various angles to try to speed up this process, while still getting quality valuation as the result. This process is extremely archaic (please see an informative article here if interested in more info), the appraiser population is getting older and dwindling in numbers. With the current real estate boom, it’s become often impossible to get timely reports, which is essential for our business model. We are looking at various alternative options, and will keep everyone informed when we have some good data points to share. Loan Originations in Tinlake New Loans: 14 New Loan USD Volume: $3.04mm Average Originated Interest Rate: 8.8% Average Tinlake Finance Fee: 6.14% Average Loan Amount: $217,418 Average Loan to Value: 52.36% Average FICO score: 710 Average Term: 12 months Current MakerDAO Debt Ceiling: $20mm with about $7.8mm used **data provided is based on loan origination date, not finance date Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology We are still working on integrating with Tinlake, this will enable much faster and error-free NFT minting.  Improving a large number of internal web features. People Hired a new Load Advisor, James, who will start this month. We are currently recruiting a front-end developer. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-27th-september-2nd/10125"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.096921596921597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/11/2021-17:37:53",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-november-2021-update/12128",
            "title": "New Silver November 2021 Update ",
            "index": 12128,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "newsilver-update",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "7",
                    "time": "09/12/2021-21:26:50",
                    "content": "Dear Community, Another very busy month. I wanted to provide a bit of my view on the state of the real estate market in the US. It has not changed significantly from the last month, it remains a sellers market, prices are climbing and homes are getting less affordable. This cycle can not continue forever, and we believe there will be a tapering in 2022. This could be accelerated by a rate hike, however, in our view, central bankers are being very careful here, and we will likely see a small increase, which should cool off the market some, but there is a lot of pent up demand from first-time homeowners, who are a perfect “exit” from a flip. We are continuing to focus on suburban markets and markets where there are job opportunities, though with the remote-first model, this is all changing quickly. America remains a place where people want to move, live and work, and housing will continue to be in demand. Here is a report from Realtor.com on 2022 projections. We are working to improve our systems and processes, and are going to share a new report hopefully next month, the report should provide more color and transparency on the loan book. I also know that Centrifuge is busy reworking the legal setup and we hope to continue to grow with MakerDAO. In the near future, we will pilot a “note purchase” program, essentially adding a wholesale business on to our existing origination business. We will aim to pilot purchasing a closed loan from another loan originator, we will of course fully underwrite it to make sure it conforms to our credit box. This could be a potential way to expand the portfolio sustainably. Will provide more on this in a separate post once we have a bit more info. We have also completed another month of testing a new way to value some of the collateral (described in more detail in September update), and the results met our expectation. You can review the results for properties that fit the profile for this, with both of the appraised values, conditions based on TruePic images and HouseCanary values based on the condition, both the median and the average are well under normal ranges. We are satisfied with the results and will begin applying this method to selective properties (as described in the previous post) going forward. Loan Originations in Tinlake We originated a total of $7.8mm total, however, due to capital constraints in the pool, a smaller number was added. New Loans:12 New Loan USD Volume: $2.8mm Average Originated Interest Rate: 8.8% Average Tinlake Finance Fee: 6.17% Average Loan Amount: DAI 234,632 Average Loan to Value: 67% Average FICO score: 720 Average Term: 12 months Loans Paid Back: 6 Current MakerDAO Debt Ceiling: $20mm with about $10.6mm used **data provided is based on loan origination date, not finance date Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology Working on a real-time report to provide more transparency into the loan portfolio. Also redesigned our web-app, this will be live soon. People Please welcome our brand new Head of Capital Markets, John Coury (@John_NewSilver ), he comes to us with tons of real estate and private equity experience, though he is new to DeFi, he already learned a lot and is looking forward to participating in the community. ",
                    "links": [
                        "https://www.realtor.com/research/2022-national-housing-forecast/",
                        "https://forum.makerdao.com/t/new-silver-september-2021-update/10915",
                        "https://docs.google.com/spreadsheets/d/1WWGwqjg1nRoRwWImbf2WGlQOimCAN8Un/edit?usp=sharing&ouid=111322895658995303890&rtpof=true&sd=true"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.592938311688311
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "10/12/2021-00:15:40",
                    "content": "Welcome onboard @John_NewSilver  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/John_NewSilver",
                    "index": "#3",
                    "likes": "4",
                    "time": "10/12/2021-13:50:33",
                    "content": "Thank you! Excited to be here and look forward to connecting with everyone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#4",
                    "likes": "0",
                    "time": "10/12/2021-16:05:05",
                    "content": "Thanks for the update @prankstr25. Good to see that the book and squad are expanding tactically. @John_NewSilver, look forward to meeting. It seems HouseCanary can simultaneously A) Generate a speedier valuation, helping buoy NS’ competitive advantage. and B) Remain conservative relative to traditional appraisals. A question: How are you and Alex thinking about the affect of inflation on construction inputs and thus complications in borrower budgets? It seems like the price increase of materials (statistically) and contractor labor (anecdotally) are outpacing price increases on homes. I agree with your take regarding a modest unwinding of the fed balance sheet and potential for small hikes—CPI printed 6.8% this AM. In such a case, you’d see a contraction in available credit to buyers pushing down demand for acquisitions and exit prices for sales. This might adversely affect the take-out for NS loans.  But the affect of hawkish policy on construction input prices (materials mainly supply chain driven) would not budge commensurately. Do you envision a possible simulation where a series of bridge loans, whether originated in house or acquired as a portfolio, A) experience budget overruns due to input inflation or B) need to be extended because contractionary policy doesn’t support the appraised/House Canary as-renovated values C) both? Given how volatile construction inputs have been in the last year, is a solution to require larger contingencies in borrower budgets? Require borrowers to pre-pay for a larger portion of materials? (Not the labor, contractor will run for the hills) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.323784722222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#5",
                    "likes": "0",
                    "time": "11/12/2021-23:41:48",
                    "content": "Great question @teej. Here are our detailed thoughts on this. In summary, we do think about this on a case by case basis, depending on the size of the project. The increasing prices and delivery times for construction materials obviously affect the bottom line for the borrowers and need to be seriously considered by lenders.  A lot of lighter/cosmetic rehab projects are not greatly affected by this, as they are completed within 2-3 months. For medium to heavy construction projects, most quotes and job estimates are performed by the builders and general contractors who are very aware of the increasing prices and usually account for if in the estimates, which provide an additional price cushion.  Furthermore, we are also requiring larger contingencies for bigger and lengthier projects.  All borrowers are already essentially pre-paying for some portion of the material costs, as construction draws are disbursed on strictly reimbursable basis,  for materials which are already installed. For some of the larger projects where we feel that the wait for materials could be longer than normal, we require sufficient liquidity to ensure they are able to continue work and pay monthly debt service while they wait. Please let us know any other questions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/12/2021-16:35:18",
                    "content": "Thank you. Please keep the community apprised of your adjustments re rising input costs via the monthly report should this issue continue to be relevant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#7",
                    "likes": "0",
                    "time": "13/12/2021-16:58:18",
                    "content": "Sure thing, we will add this going forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "13/03/2022-16:58:57",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-september-2021-update/10915",
            "title": "New Silver September 2021 Update ",
            "index": 10915,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "new-silver",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "6",
                    "time": "11/10/2021-18:30:44",
                    "content": "Dear Community, I wanted to spend a bit of time in this update to highlight something we have been working on for a few months now - a way to improve and speed up the collateral valuation process. As I have highlighted in our previous updates, the collateral valuation process is extremely archaic (please see an informative article here  if interested in more info), takes a long time, at times, has quality issues. The appraiser population is getting older and dwindling in numbers. We believe technology is the only solution for a long term (albeit partial for now) fix to this problem, which is only getting worse with time. We put together a presentation on how we are looking to improve this process. TL;DR: We have partnered with 2 vendors, outlined below, that we intend to utilize to mimic what the appraisal process does today, but do it with more efficiency and accuracy - TruePic for pictures and HouseCanary for valuation. TruePic is a industry leader in obtaining and processing photos with advanced fraud detection. HouseCanary is an industry standard real estate valuation software that will enable us to adjust values based on property condition. We have begun using these solutions in addition to obtaining the appraisal report, and will continue this for about a month, after which time, we will provide data and hope to switch to using this new process for valuing certain collateral (under $500k, single family only, light to medium rehab). Loan Originations in Tinlake The numbers for September are lower because we have used up all of the available TIN. We are working on a plan to raise additional amounts to continue to utilize Tinlake/MakerDAO. New Loans: 4 New Loan USD Volume: $1.59mm Average Originated Interest Rate: 8.75% Average Tinlake Finance Fee: 6% Average Loan Amount: DAI 379,875 Average Loan to Value: 81% Average FICO score: 718 Average Term: 13.5 months Current MakerDAO Debt Ceiling: $20mm with about $8.7mm used **data provided is based on loan origination date, not finance date Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology We have added numerous improvements such as the ability to add a co-borrower to the loan app. We are still working on a tighter Tinlake integration and a number of other innovations. People Recruiting a full-stack developer and a capital markets analyst. If anyone has any friends who may be interested, please DM me. ",
                    "links": [
                        "https://docs.google.com/presentation/d/16oaGItvWJ3jQ-bx0Kcn5qSBaJkGgtREqbwxOQXfrS48/edit?usp=sharing",
                        "https://truepic.com/technology/",
                        "https://www.housecanary.com/solutions/private-money-lenders/",
                        "https://forum.makerdao.com/t/new-silver-october-2021-update/11472",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-7th-october-14th/11003",
                        "https://forum.makerdao.com/t/new-silver-november-2021-update/12128",
                        "https://forum.makerdao.com/t/under-construction/12274/11"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166937229437229
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/10/2021-18:08:36",
                    "content": "Wow interesting approach here on the onboarding of loans under $500k. Personally I’m seeing more RE companies trying to use tech to resolve the slow process of closing deals. I think the presentation you provided is self-explanatory, but if you have a video presentation (maybe you recorded something for another third-party) please post here. And TY for the update! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#3",
                    "likes": "1",
                    "time": "12/10/2021-18:24:12",
                    "content": "Thanks @flipflopflapdelegate, we don’t have a video presentation, but would be happy to post some sample reports, I was thinking about doing that next month once we’ve gathered some data. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "10/01/2022-18:24:19",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-april-2021-update/7890",
            "title": "New Silver April 2021 Update ",
            "index": 7890,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "new-silver",
                "newsilver-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "16",
                    "time": "06/05/2021-19:56:11",
                    "content": "This is the first update which we plan to publish monthly, and provide a high level update on New Silver’s activity in the previous month. We are going to cover technology, loan originations, personnel, loan performance and future plans, with some variance depending on the month. April 2021 was a landmark month - we went live with MakerDAO! Thank you to the community for voting us in as the first real world asset! Loan Originations In April, we saw lower origination volume, though we saw a record number of new loan applications. The biggest challenges are continuing to be low inventory and competitive pressures. We are working on some updates to our products and introducing creative incentives in order to continue to attract the best borrowers. Total New Loans: 10 New Loan Dollar Volume: $2.2mm Average Interest Rate: 10.6% Average Loan Amount: $222,000 Average Loan to Value: 70% Average FICO score: 732 Current MakerDAO Debt Ceiling: $5m Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology In the month of April, we had minor releases and updates. We expect a major release in May which will vastly improve our ability to track and service loans we keep on our balance sheet. We are also planning closer integration with Centrifuge, which will allow us to add loans to Tinlake much faster and leave less room for human error. People In April we brought on board Marwan, Jay and Kidesha. Marwan is an experienced loan processor and will be instrumental in helping us move the loans from application to the closing table. Jay is veteran loan originator and will be working with the loan consulting team to grow the origination volumes. Kidesha will be managing our inbound calls and providing admin assistant services. We are looking to bring on additional loan consultants and developers in May/June. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.50087513061651
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "06/05/2021-20:39:03",
                    "content": "Whoaaaa! Super cool. TY for providing the community with an update. Totally appreciated. You Rock New Silver!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3705018939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#3",
                    "likes": "0",
                    "time": "07/05/2021-14:51:10",
                    "content": "Can’t wait to see how this business relationship grows over time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/08/2021-14:52:03",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/new-silver-october-2021-update/11472",
            "title": "New Silver October 2021 Update ",
            "index": 11472,
            "category": [
                "Updates"
            ],
            "tags": [
                "ns-drop",
                "newsilver-update",
                "rwa-002"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#1",
                    "likes": "2",
                    "time": "05/11/2021-15:26:53",
                    "content": "Dear Community, Lots of updates this month. First, on the state of the real estate markets at a macro level. US single-family housing markets remain very strong across the board, with October seeing housing inventories drop to January levels according to multiple reports, including this one from HouseCanary. Median sales price has hit a new record of over $310,000 according to this report from Attom Data, and sellers are taking in larger profits. What does this all mean for New Silver’s business? Demand continues to be very robust, we have fielded over 230 applications for new loans with over $150mm of of volume. Real estate supply is constrained, so our borrowers are often losing deals, and thus, we are losing deals. In general, this is not a bad environment for a lender to operate in overall. We are always looking ahead and thinking about various market scenarios. Good news - we are now a California licensed lender. We have entered the CA market and are actively testing our strategies there. We have also completed a month of testing with a new way to value some of the collateral (described in more detail in the previous month’s update), and the results met our expectation. You can review the results with both of the appraised values, conditions based on TruePic images and HouseCanary values based on the condition, both the median and the average are well under normal ranges. We are satisfied with the results and will begin applying this method to selective properties (as described in the previous post) going forward. Loan Originations in Tinlake We originated a total of $4.4mm on 18 loans of last month, but a smaller number was placed in the pool because we were short on TIN (since resolved for the immediate future) and were bumping up against the 75% DROP maximum (not yet resolved). New Loans: 8 New Loan USD Volume: $2.34mm Average Originated Interest Rate: 8.875% Average Tinlake Finance Fee: 6.2% Average Loan Amount: DAI 293,086 Average Loan to Value: 57% Average FICO score: 698 Average Term: 12 months Loans Paid Back: 2 Current MakerDAO Debt Ceiling: $20mm with about $10.6mm used **data provided is based on loan origination date, not finance date Loan Performance 90+ day late: 0 Forbearance: 0 Foreclosure: 0 Technology Various internal improvements. We have signed a contract with ListHub (a realtor.com company) to provide us MLS listings and will be working on integrating this into FlipScout. Our vision is to be able to provide borrowers ability to find and buy the most profitable projects, buy them, finance them, and sell them, all with out help. People Still recruiting a full-stack developer and a capital markets analyst. If anyone has any friends who may be interested, please DM me. ",
                    "links": [
                        "https://www.attomdata.com/news/market-trends/home-sales-prices/attom-q3-2021-u-s-home-sales-report/",
                        "https://nmlsconsumeraccess.org/EntityDetails.aspx/COMPANY/2154545",
                        "https://forum.makerdao.com/t/new-silver-september-2021-update/10915",
                        "https://docs.google.com/spreadsheets/d/1WWGwqjg1nRoRwWImbf2WGlQOimCAN8Un/edit?usp=sharing&ouid=111322895658995303890&rtpof=true&sd=true",
                        "http://realtor.com"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4002609427609425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "03/02/2022-15:27:25",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "45"
}