{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/vault-discussion-nonsc-crypto-backed-loan-optionality/16312",
            "title": "[Vault-Discussion] NonSC Crypto-Backed Loan Optionality ",
            "index": 16312,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "informal-poll",
                "vaults"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#1",
                    "likes": "2",
                    "time": "04/07/2022-13:05:10",
                    "content": "What is the right balance between on-chain and off-chain collateral? Due to the bear market and the flight to safer assets, there has been tons of discussion around the PSM and its collateral. Stablecoins now generate over 70% of DAI (primarily because ETH-backed vault usage is down, increasing the percentage of USDC-backed DAI). Instead of reducing the size of DAI, as has been discussed in other posts, I propose shifting focus to core lending products (i.e., ETH-based vaults), to increase the volume of non-USDC backed assets, and therefore lower the percentage of USDC-backed assets. Prioritization Sentiment polling results agree on focus. Below, I ideate some strategies that would support core lending growth and create appropriate incentives for existing and new users. Existing ETH Backed Vaults There are currently three ETH crypto-backed vaults to select from based on user’s risk, leverage and return appetite. Below is the summary from MakerBurn. ETH A -  Coll Ratio: 145% SF: 2.25% ETH B - Coll Ratio: 130% SF: 4.00% ETH C - Coll Ratio: 170% SF: 0.50% BTC crypto-backed vaults have similar options. Proposal -  Non-stablecoin vault-holder optionality Rapid crypto asset price fluctuations change market conditions in short periods of time, so vault-parameters that were favorable a few weeks/months ago may no longer be so favorable. In an attempt to retain vault-holders and/or make vaults more attractive to new users, there should be vault-holder optionality, defined as a one-time annual option to transition between same-currency vaults. In a bear market with prices declining, a client in ETH-C might be willing to move to ETH-A or ETH-B where they pay a higher fee, but avoid liquidation (and MakerDAO would benefit from retaining and increasing SF). In a bull market with prices rising, ETH-A or ETH-B clients might be willing to move to ETH-C, increasing their collateral and paying a lower fee, to reduce their SF. While MakerDAO would receive a lower fee, it would benefit from having retained these clients as they may continue to borrow at the same volume or higher in the future. Alternatively, this vault-holder optionality could be defined as a formula, whereby a one-time annual collateral ratio adjustment of 10% (TBD) adjusts the SF by X%. Lower (e.g. collateral ratio => 120%) and upper limit (e.g. collateral =<300%) collateral ratios would be determined prior to optionality launch. Potential Benefits  Higher ratio of DAI generated from ETH/BTC. Less reliance on USDC/RWA Increased vault duration and retention Pricing optimization - Should the range be 0.5% - 4.0%? Seems inefficient for both being over-collateralized, so this should be scaled in some way Align pricing to evolving market conditions in a formulaic way Better customer experience leads to longer-term and/or higher-use customers Incentivizes new vault creation Reduction in loan defaults of bad debt  Potential Risks  Temporary SF reduction Lower liquidation fees (Long-term, this is a good thing for customers) Coding execution leads to faulty migration   Screen Shot 2022-07-02 at 11.50.09 AM888×303 35.6 KB  Pulse Check    Do you think the benefits outweigh the risks?  Yes, definitely No, this is not it Maybe, proposal needs work Abstain     0 voters     Poll ends Friday, July 8th 10pm EST If you can, please detail the reason for your vote in a comment. Would love to work with a CU to gather vaultholders input as well. ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-dai-borrowing-incentive-ideas-that-the-dao-could-test/16057/7",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/4"
                    ],
                    "GPT-summary": "The author proposes a shift in focus to core lending products to increase the volume of non-USDC backed assets and lower the percentage of USDC-backed assets. The proposal suggests introducing vault-holder optionality, defined as a one-time annual option to transition between same-currency vaults, to retain vault-holders and/or make vaults more attractive to new users. The post includes a summary of existing ETH crypto-backed vaults and potential benefits and risks of the proposal. The author also invites collaboration with a CU to gather vault-holder input.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.532732790085731
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rachel_G",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/07/2022-13:17:16",
                    "content": "    TRUEMAKER:  What is the right balance between on-chain and off-chain collateral?   That’s a great question, I don’t think we have defined limits ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.714285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "6",
                    "time": "04/07/2022-13:21:52",
                    "content": "    TRUEMAKER:  In an attempt to retain vault-holders and/or make vaults more attractive to new users, there should be vault-holder optionality, defined as a one-time annual option to transition between same-currency vaults.   Vault holders are already able to do this for free (bar gas costs) and at will via DAI flash loans. I believe DeFiSaver and possibly Oasis as well support it directly on their frontends. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.74025974025974
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#4",
                    "likes": "1",
                    "time": "04/07/2022-18:48:21",
                    "content": "Thanks for the info. I couldn’t find the option on DeFiSaver but assuming that its possible with the DAI Flash Loan repayment mechanism you mentioned. Do you know where I would be able to track wallets that shift vaults? In order to assess if the process is being utilized. I was hoping that the process of shifting between same-currency vaults (ETH-A → ETH-C) would be more seamless and wouldn’t require loan repayment and new setup, thus avoiding gas fees, since it would be an internal reassignment. Maybe this is not possible under the existing smart contract rules… but for new vaults we should probably consider things like:  Adjustable collateral ratios Variable (tied to benchmark) and fixed pricing options Bracket pricing (lower SF for higher borrowed amount) Invest excess collateral (Coll ratio - 100% Coll)  Reasoning that the ability to adjust and self-serve vault settings during shifting market conditions would attract more customers, all while remaining within established parameters. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.014235764235765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#5",
                    "likes": "1",
                    "time": "06/07/2022-23:52:50",
                    "content": "It is not possible to do this without incurring transaction fees. Collateral needs to be moved from one Join adapter to another + other internal accounting. DeFiSaver facility to do this is here: DeFi Saver ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/07/2022-00:46:22",
                    "content": "Thanks for taking the time to explain the current setup. For future vaults, would it be possible to create vaults that have adjustable collateral ratios (set an allowable range) without incurring transaction fees? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.25
                }
            ]
        }
    ]
}