{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/new-singapore-crypto-law-requires-overseas-only-operators-to-be-licensed-report/14589",
            "title": "New Singapore Crypto Law Requires Overseas-Only Operators to Be Licensed: Report ",
            "index": 14589,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "regulation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "3",
                    "time": "12/04/2022-13:16:44",
                    "content": "I came across this article and figured some might find it informative.    BeInCrypto – 5 Apr 22    Singapore passes law tightening rules for crypto businesses Singapore has given the green light to a new law that provides stricter oversight of cryptocurrency providers, reports confirmed.  Est. reading time: 1 minute       According to the various articles online:   Singapore’s crypto entities are not currently regulated for anti-money laundering and countering the financing of terrorism and thus the move is aimed at tightening rules for cryptocurrency providers.   People have been opining that Singapore is walking a tightrope by welcoming Web 3 companies while issuing guidelines to limit crypto advertising.   The new bill includes the imposition of a higher maximum penalty on financial institutions if they experience cyberattacks or their services are disrupted.   The bill gives greater discretion to the Monetary Authority of Singapore to preclude those who are deemed unfit from performing important activities and functions in the financial industry. These apparently will now include individuals providing payment services and conducting risk management.   ",
                    "links": [
                        "https://beincrypto.com/singapore-passes-law-tightening-rules-for-crypto-businesses/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7972027972027975
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/04/2022-15:52:05",
                    "content": "It is curious, being the Singapore government so strict, it would not have made this measure before. Sometimes it is notorious the gap in the understanding of the regulators about the crypto area. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/04/2022-16:12:40",
                    "content": "Seems governments are all over the place for sure and it’s hard to rationalize some of it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/04/2022-18:39:58",
                    "content": "After talking with some of partners based in Singapore, it seems like the rule is hitting crypto business that has custody of clients’ cryptos (such as centralized exchanges, and custody service) more than non-custodial and token projects. So will be interesting to see the updates but the country still remains to be largely crypto friendly ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.589285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/04/2022-19:36:13",
                    "content": "Interesting indeed. It seems governments are still kind of working their way through these issues, even the ones that are more crypto friendly. We will see how it plays out I suppose. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.46875
                }
            ]
        }
    ]
}