{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dai-description-for-crypto-stars/14941",
            "title": "DAI Description for Crypto Stars ",
            "index": 14941,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "media-inquiry"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pixelfreshgames",
                    "index": "#1",
                    "likes": "1",
                    "time": "03/05/2022-19:22:52",
                    "content": "Hi, my name is Ievgen from Pixelfresh Games - an indie studio that develops mobile games and apps. We develop a mobile app Crypto Stars which helps people to get familiar with the crypto market by visual representation of crypto assets. In this app people can check statistics and a short description of any coin. Let me give you an example how it looks:  Tweet-061200×675 79.4 KB  Do you have a short description of DAI Coin, which we can add to our app? Or answer these 3 questions:  What is a DAI Coin? When was it launched? What is the main purpose of DAI Coin? What investors could do with DAI Coin? Its main benefits?  Thank you for your time and have a great day! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.067708333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "03/05/2022-20:13:03",
                    "content": "    pixelfreshgames:   What is a DAI Coin? When was it launched?    DAI is a stable decentralized currency, born from the need of users to have a currency 1:1 with the dollar but without intermediaries, which could be issued with the same assets that are in the chain. The price of DAI is pegged to the U.S. dollar and is backed by a combination of other cryptocurrencies that are deposited in smart contract vaults each time a new DAI is mined. One of the defining characteristics of DAI is that it was not created by a single person or a small group of co-founders. Instead, the development of the software that powers it and the issuance of new tokens are governed by MakerDAO and Maker Protocol. MakerDAO is a decentralized autonomous organization, a kind of company that runs in a decentralized manner using smart contracts, with self-executing agreements expressed in software code and executed on the Ethereum blockchain. This organization is democratically managed by holders of its Maker corporate governance tokens (MKR), which act similarly to traditional corporate shares; MKR holders can vote on key decisions related to the development of MakerDAO, Maker protocol and DAI. Voting power is proportional to the number of Maker tokens they hold. MakerDAO itself was originally founded by Danish entrepreneur Rune Christensen in 2015. Before he started working in the Maker ecosystem, Christensen studied biochemistry and international business in Copenhagen and founded the international recruitment firm Try China.     pixelfreshgames:   What is the main purpose of DAI Coin?    The main advantage of DAI lies in its linkage to the price of the US dollar. The cryptocurrency market is known for its volatility, with even the largest and most liquid coins such as Bitcoin sometimes experiencing price swings (both up and down) of 10% or more in a single day. In these circumstances, traders and investors are naturally predisposed to add safe haven assets to their portfolios whose stable price could help offset significant market fluctuations. One such type of asset is Stablecoins, or stable coins, of which DAI is an example. These are cryptocurrencies whose price is pegged to assets with a relatively stable value, for example, most traditional fiat currencies, such as USD or EUR. Another key advantage of DAI is the fact that it is managed not by a private company, but by a decentralized autonomous organization using a software protocol. As a result, all instances of token issuance and burning are managed and publicly recorded by Ethereum-powered self-executing smart contracts, which makes the entire system more transparent and less prone to corruption. In addition, the DAI software development process is governed in a more democratic manner, through direct voting by regular participants in the token ecosystem.     pixelfreshgames:   What investors could do with DAI Coin? Its main benefits?    Its main benefit is its decentralization, no one can take away your DAI or limit you to what to do with it, also DAI by default is the DEFI currency, as the same protocol was the first DeFi that was invented as we know it today, therefore investors can find better returns in open protocols in DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65119330560507
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pixelfreshgames",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/05/2022-14:10:16",
                    "content": "Thank you very much, very clear description  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65
                }
            ]
        }
    ]
}