{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-poll-use-multiple-stablecoin-e-g-usdc-vaults-with-different-lr-dc-combinations-to-manage-value-price-risk-exposure/4180",
            "title": "[Signal Poll] Use multiple stablecoin (e.g. USDC) vaults with different LR/DC combinations to manage value/price/risk exposure ",
            "index": 4180,
            "category": [
                "Governance"
            ],
            "tags": [
                "debt-ceiling",
                "collateral",
                "mips",
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "1",
                    "time": "15/09/2020-21:02:09",
                    "content": "Currently Maker governance is considering changing the USDC-A parameters. Currently recently changed USDC-A parameters: Collateralization Ratio: 103 (lowered just a day ago from 110) soon to 101 Debt Ceiling: 200M (raised from 100M just a day ago from 100M) Risk Premium: 2% The goal of this signal request is to modify how Maker is extending Debt Ceilings against Liquidation Ratios on not just USDC but all of the stablecoins.  I use USDC here just to give a flavor of what this proposal is suggesting. Goals   LR/DC consistency across all the stablecoins To provide for some control over the amount of stablecoins the system holds against the DAI minted indirectly controlling the PEG value via liquidity available in the total facilities.  Proposed is the idea for stablecoins to create multiple vaults with alogrithmic LR/DC consruction based on a singular BASE_LR_STABLECOIN value - which in the example below i set to 101 Example: BASE_LR_STABLECOIN=101 USDC_TOTAL_DC=700M DAI Construct the following USDC vaults. USDC-A1 with LR of BASE_LR_STABLECOIN=101 and DC of 100M USDC-A2 with LR of 2 x BASE_LR_STABLECOIN=102 and DC of 200M USDC-A3 with LR of 3 x BASE_LR_STABLECOIN=103 and DC of 400M Initial suggestion is to keep the SF the same on these vaults. The point here is that if the PEG is < 1.01 then all of these vaults can be used with varying amounts of leverage and differing amounts of DC.  My primary concern here was lumping all of our stablecoin borrowing into the same LR and hence the same backing collateral amount to DAI printed.   In the above model the average USDC deposit for 1DAI minted grows as the vaults are filled and the amount of leverage that can be applied diminishes. (see point below) One primary point.  If the DAI-USDC price is > 1.03 all vaults have infinite leverage only controlled by the DC level available.   This is the prime reason to have multiple vaults with different LR and DCs, and to have an exponentially (factors of 2) increase in the DC size of the vault to apply against the LR.  For each pricing tier breached another facility with effectively infinite leverage comes into play with DC to beat the PEG back down to the target.  These all are always in play at all times but it is my expectation these will fill sequentially due to ability to apply higher leverage with lower LRs. Realize while I picked a number of vaults and some basic parameters (the BASE_LR, and the 2x DC multiplier and 3 vs. 4 vaults) these are up for further discussion and refinement if the proposal passes with yes otherwise we leave this as a no. Should Maker use the above proposal as a multiple vault model to address the DAI liquidity in stablecoin facilities available to control the amount of stablecoins relative to DAI minted and hence PEG price with various levels of liquidity.     No - The approaches being taken now are good enough. Yes - We need something like the above (for at least USDC and perhaps all Stablecoins) and should would up a formal proposal. Abstain.     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-stablecoin-action-plan/4808/17",
                        "https://forum.makerdao.com/t/signal-request-should-we-increase-stablecoin-dc-and-diversify-exposure/4331/12",
                        "https://forum.makerdao.com/t/signal-request-should-we-increase-stablecoin-dc-and-diversify-exposure/4331/6",
                        "https://forum.makerdao.com/t/risks-on-usdc-a-and-all-the-other-collateral-with-l-r-101/4266/3"
                    ],
                    "GPT-summary": "The author proposes modifying how Maker is extending Debt Ceilings against Liquidation Ratios on not just USDC but all of the stablecoins. The proposal suggests creating multiple vaults with alogrithmic LR/DC consruction based on a singular BASE_LR_STABLECOIN value. The post explains the proposal in detail and asks for feedback from the community. A 3rd party gives constructive criticism and asks questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.324926900584796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/09/2020-21:07:32",
                    "content": "@MakerMan could you maybe make it more clear what this is intended to be? I think you intended this as an informal poll? Probably don’t include the word signal anywhere (also maybe remove the emergency response tag? Not sure.) If it’s a signal request, (or an emergency/urgent signal request) replace the informal-poll tag with the signaling tags. (And generally follow the practical guide.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "1",
                    "time": "15/09/2020-21:09:49",
                    "content": "Well I can easily pull tags.   I thought it applied to emergency response because we are doing most of this as a emergency repsonse to PEG.  I put informal poll but should have removed signal request.   I honestly am on the fence here.   Should this one be coupled with the other signal requests and emergency reponses.   Maybe, maybe not. I will pull out ‘emergency reponse and signal poll’ and leave is as informal for now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.760416666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "1",
                    "time": "15/09/2020-21:11:15",
                    "content": "Thanks, appreciate it. I know this isn’t really written down anywhere and it’s a pain in the ass to follow. I might write up something about informal polls soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.407407407407407
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/09/2020-21:12:39",
                    "content": "    LongForWisdom:  Thanks, appreciate it. I know this isn’t really written down anywhere and it’s a pain in the ass to follow. I might write up something about informal polls soon.   Yeah I know I am struggling to keep up.    I am having a hard time understanding what tags really are appropriate.  Each time I screw up I learn more and may lean more to informal polls unless I think it something that directly relates to a signal, emergency whatever. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.973765432098766
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/09/2020-21:16:24",
                    "content": "I think it makes sense intuitively to have tiers.  I’m just not confident we know what the correct ceilings should be, and I’m a little worried about adding complexity and therefore causing more future work by tweaking debt ceilings. I’m wondering, do we get a proportional amount of benefit from putting in this additional work.  Or is one parameter sufficient as a stop-gap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.078125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "0",
                    "time": "15/09/2020-21:22:30",
                    "content": "    Jtathmann:  I think it makes sense intuitively to have tiers. I’m just not confident we know what the correct ceilings should be, and I’m a little worried about adding complexity and therefore causing more future work by tweaking debt ceilings. I’m wondering, do we get a proportional amount of benefit from putting in this additional work. Or is one parameter sufficient as a stop-gap.   I am a big fan of KISS which is why I think we just apply the same model to all stablecoins to achieve an effective lower bound BASE_LR_STABLECOIN PEG target.   The formula for LR/DC is up for grabs.   I’d like it to be a singular formula where we just have for each set of vaults a DC_TOTAL and leave the SFs on all of these collateraltype subvaults be the same. The only thing I am proposing here is a kind of tiered LR/CR level of DC application of liquidity to PEG management.  The other goal is to ease governance management of ALL stablecoins and add a level of consistency between all of them if we are going to go to low LRs across the board.   The problem using a single vault with LR/DC is that once the DC is hit - that vault is done providing liquidity.  I want another vault to come on line (or be there) that provides the next tier of liquidity automatically. Our problem here is that BASE_LR_STABLECOIN that is used to determine the tiers of LRs should not be raised but only lowered.   The total DC’s managed by a single collateral type cap as we do now. Right now we can parse these out piecemeal and poll/approve each and every one like we have.   I am for taking a different approach on the stablecoins as a group since they for the most part will be used for PEG management. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.445089285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#8",
                    "likes": "0",
                    "time": "15/09/2020-22:09:37",
                    "content": "No, that just looks to me like fixing the bad design with more complexity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.500000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "0",
                    "time": "15/09/2020-22:20:07",
                    "content": "Well we already have a USDC-A and B vault - the B being available with high SF for keepers to use to get DAI for liquidations (Provided they have USDC). Bad ideas can easily be turned down.  So even though someone suggested I post this as a signal poll I put it up as informal. Frankly I am rapidly coming to the conclusion there isn’t enough collateral to satisfy the markets liquidity needs at the moment to bring PEG even close to 1 and one of the previously turned down approaches will be turned to next. RWA could help us here but won’t come on fast enough to mint the amount of DAI the markets need/want. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0070707070707074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#10",
                    "likes": "1",
                    "time": "15/09/2020-23:21:11",
                    "content": "I think the current measures are very appropriate. As long as we continue to reduce LR = 101% on Friday, and continue to increase USDC and other stable DCs by approximately 100 million, we can stabilize PEG. Finally, we only need to adjust the stablecoin DC according to market conditions, and we should be able to control PEG. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.410714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#11",
                    "likes": "1",
                    "time": "15/09/2020-23:35:39",
                    "content": "I would hazard two things.  A DC of 300M would be hit within 2 days at a LR of 101 Once the DC is hit the PEG will rise again.  Back to same question how much DAI liquidity is needed to bring the PEG to 1.0 and I am pretty sure this number is much higher than anyone expects given the return of farming. Given the diversity of farming options and returns out there it is difficult to estimate how much DAI liqudity is needed to bring us to PEG neutral 1:1   My numbers keep coming up at least $1B or higher.  A day or two ago I was thinking 200-500M.  Now 150M DAI later and PEG barely around 1.02 I am thinking it is at least another 300M and this might get us under 1.01.   500M or more to get us even remotely close to 1.0 ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#12",
                    "likes": "0",
                    "time": "15/09/2020-23:47:05",
                    "content": "If LR = 101%, the stable currency DC will reach 350 million within two days. I agree with your method of increasing the type of USDC vault. In my opinion, DAI includes unstable assets and stable assets, and their proportions should be about 50% respectively. Therefore, when the proportion of stablecoins is too heavy, I will support your method and raise a certain threshold. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.023809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#13",
                    "likes": "0",
                    "time": "16/09/2020-10:10:48",
                    "content": "From my lens, there is a disproportionate amount of time engaging with stable coins. They are important, no doubt. However, implementing a known portfolio of the same collateral type will help handle these scenarios. While the spirit of what was proposed I agree with, I would modify to something like: USDC-A1 with LR=1.01 and DC of 1000M with a RP of 50% USDC-A2 with LR=1.02 and DC of 300M with a RP of 10% USDC-A3 with LR=1.03 and DC of 200M with a RP of 2% Fundamentally it would be a waterfall for market makers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#14",
                    "likes": "0",
                    "time": "16/09/2020-18:26:48",
                    "content": "I think you want higher interest rates for the vaults with higher collateralization ratios. The vaults would be waterfall protection in case the first vault fills up. If the first vault does fill up, it means there’s a higher amount of demand for DAI, they’ll be okay paying a higher SF. Also we don’t want these waterfall vaults to fill up too fast. Also, since they’re used for demand spikes, users will probably use them for a shorter term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#15",
                    "likes": "0",
                    "time": "16/09/2020-20:44:43",
                    "content": "    mrabino1:  While the spirit of what was proposed I agree with, I would modify to something like: USDC-A1 with LR=1.01 and DC of 1000M with a RP of 50% USDC-A2 with LR=1.02 and DC of 300M with a RP of 10% USDC-A3 with LR=1.03 and DC of 200M with a RP of 2%   Is that a typo, or are you seriously advocating for 1B DC for USDC with LR 1.01? IMO–if there was a Credit Rating system for Borrowers–then I would totally support vaults with different LR/DC–but since we don’t know who is who–and who’s trying to game the system–we should stick to “all are created equal” parameters, IMO ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#16",
                    "likes": "1",
                    "time": "17/09/2020-08:23:17",
                    "content": "My thinking is that we need a collateral type that is intentional for market makers, folks that trade in and out with high leverage. We should want them to be able to use the USDC collateral to help pull down the peg with leverage BUT also as there is more risk (because of the 1.01 LR) the Maker system is taking more risk. If MKR is taking more risk, then the risk premium should be elevated to offset that. At 50% per annum, no market maker is going to keep his / her position outstanding very long. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.524652777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#17",
                    "likes": "0",
                    "time": "17/09/2020-08:24:24",
                    "content": "    flipflopflapdelegate:  are you seriously advocating for 1B DC for USDC with LR 1.01   Yes, but with a risk premium of 50%. It is for market makers. With an elevated risk premium, the vault will only be used in urgent cases. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#18",
                    "likes": "1",
                    "time": "17/09/2020-13:18:07",
                    "content": "    mrabino1:  Yes, but with a risk premium of 50%. It is for market makers. With an elevated risk premium, the vault will only be used in urgent cases.   My man! Love the aggressiveness. It takes a Real Estate guy to have that skyscraper vision!  “Landlords grow rich in their sleep.” -John Stuart Mill ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#19",
                    "likes": "2",
                    "time": "17/09/2020-22:39:41",
                    "content": "I want to say that charging 50% RP for a 101% CR vault is a bit of a joke. You’re basically asking for the vaults to get abandoned. And you’re not really charging a 50% SF, you’re just going to be minting unbacked DAI in the surplus. With a 50% RP, on vaults with a CR of 101%. You’re basically guaranteeing that the vault gets abandoned. They end up dropping under 100% collateralization after a week. Then you start printing unbacked DAI into the surplus. It makes little sense to have a 50% RP on vaults with a CR of 101%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.28125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#20",
                    "likes": "0",
                    "time": "25/09/2020-03:38:48",
                    "content": "I believe the gap here is whether or not liquidations are enabled or not. My intent is never for a vault to be abandoned. Rather for the protocol to be compensated for the risk it is taking. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}