{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/fixing-the-par-value-of-the-stablecoins/10598",
            "title": "Fixing the par value of the stablecoins ",
            "index": 10598,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "pegstab-module"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "1",
                    "time": "30/09/2021-15:55:36",
                    "content": "I wrote an article following my comment on the FEI PSM proposal.   Medium – 30 Sep 21    How to fix the par value of stablecoins In the real world, a one-dollar bill has the same value as $1 at your Citigroup account or $1 at DBS Bank in Indonesia. You can go from one…  Reading time: 4 min read       In short, it’s about setting tin/tout of the PSM to 0% (at least one) in order to achieve a 1:1 peg. From there, other stablecoin protocols will be able to provide a PSM-like facility to get this 1:1 feature as well (without having to deal with centralized stablecoins directly). By hoarding DAI to help their liquidity and peg, we obviously get more capital to work with. I reckon this is not super helpful now as we have 60% of stablecoins already, but I’m confident this will not last long. The aim is to have $1 = 1 USDC = 1 USDP = 1 DAI = 1 FEI = 1 FRAX = …I think it’s important if we want DeFi to become mainstream and it will be important for RWA as well (where 1bps lost might be too much). What do you think? ",
                    "links": [
                        "https://medium.com/@sebastien.derivaux/how-to-fix-the-par-value-of-stablecoins-ce52e82a179",
                        "https://medium.com/@sebastien.derivaux/how-to-fix-the-par-value-of-stablecoins-ce52e82a179",
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697",
                        "https://forum.makerdao.com/t/maker-relay-ep-65-en-espanol/10784",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-30th-october-7th/10837",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-09/10825"
                    ],
                    "GPT-summary": "The author of the post is explaining their proposal to fix the par value of stablecoins. They suggest setting tin/tout of the PSM to 0% to achieve a 1:1 peg, which will allow other stablecoin protocols to provide a similar facility. The author believes this is important for DeFi to become mainstream and for RWA. A 3rd party is asking for feedback by asking \"What do you think?\" and may be giving constructive criticism by suggesting that the proposal may not be super helpful now.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.634803921568627
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/09/2021-16:43:43",
                    "content": "    SebVentures:  What do you think?   Your argument reminds me of the fee on flash loans/mints. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}