{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poll-for-mkr-holder-only-discord-channel/18360",
            "title": "Poll for MKR Holder only Discord Channel ",
            "index": 18360,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#1",
                    "likes": "3",
                    "time": "13/10/2022-19:04:24",
                    "content": "Authors: @rspa for Flipside Governance and @twblack88 for Feedblack Loops. What if there were a place for MKR holders to provide input other than voting or delegating? A simple way to rally MKR holders to protect the hat, delegate, or determine their own involvement. Simply put, a community for MKR holders, a place to belong. Enter: a token-gated channel on the MakerDAO Discord. Bridging a communication gap between holders and contributors. Opening this environment could increase voter participation, MKR delegation and a sense of community and agency for MKR holders.  image1023×594 102 KB  Working off the SPACES model from CMX we can target Acquisition, Engagement, and Success for MKR holders by giving them a place for opt-in coordination. We’re suggesting an easy way for large MKR holders first (>500 MKR) and eventually opening the channel to smaller holders. (<10MKR). Core unit members and recognized delegates would be added manually. Delegated MKR counts as MKR held. This informal poll is about community feedback, clustering around the pros & cons of lowering this communication loop and dialing in the numbers. As voter committees start to come online, an async gathering place is especially helpful.  MKR Holders Channel Purpose  Participate  A place to connect with other MKR holders to discuss strategy or just hang out. This channel could be where voter committees (or some version of focused groups), holders, and delegates congregate around agendas and topics (in the form of Discord threads) outside of regular meetings. Voting experiments:  Pulse checks with emoji votes A possible first draft of off-chain polls. Sourcing signal on a hard choice for MKR holders before opening it up for more eyes might cut unnecessary chatter. Vote alerts and MKR in borrowing platforms alerts to channel     Events  Onboarding & special events for MKR holders, with links only going to this channel Forum at a glance and publications dropped in-channel directly Regular for MKR-eyes only calls announced here.   Alpha  Early ticket invites to events from partners Inclusion for testing of products that haven’t been launched yet Product discounts from partners (Nansen comes to mind) Growth can go all out on sourcing cool things for MKR holders exclusively. Safe space for market-cope.  Possible validation platforms are Our Guild or https://collab.land/ to validate a token gate in discord.  Pros  Growth loop: MKR holder joins chat → publicly talks about the great experience → sourcing more dormant MKR holders to join and post. Prioritization and blind spot catching. Can run native polls via emoji voting to get quick pulse checks before forum posts or as sentiment before adding things on-chain. Room to grow: include smaller holders, launch its own Discord server, and try fun governance stuff.   Cons  Both Guild and Collab.land are new-ish products and can have some friction  Link outs are spoofy, too,   It’s intimidating to connect wallets to services. Creates a dynamic of exclusion for regular community members or new contributors. More noise to manage for maintainers of the Discord If we use Voltaire for anon discussions: Posting anonymously using a bot has friction, and you’re immediately doxxed if you forget. There is no way for Discord to have hidden roles AND keep single channels anonymous without some heavy javascripting.  Next steps: Should this poll provide positive momentum, we can ask tech-ops how feasible it would be to add either service’s bot, add a channel, add a role or simple token gate, and map this into the MakerDAO discord. Extra credit points: we could enable Voltaire as the bot to enable anonymity.  Polls    Should we pursue a token-gated MKR holder channel in Discord?  Yes No Abstain I hate discord, long live IRC     0 voters        Should we use Voltaire for anonymous participation?  Yes No Abstain     0 voters        Should the first MKR gate be:  100 MKR 500 MKR 1000 MKR More? Suggest the amount below Less? Suggest a plan below     0 voters     ",
                    "links": [
                        "https://support.discord.com/hc/tr/articles/4403205878423-Threads-FAQ",
                        "https://guild.xyz/our-guild",
                        "https://collab.land/",
                        "https://nminchow.github.io/VoltaireWeb/",
                        "https://forum.makerdao.com/t/proposal-idea-utilizing-hats-protocol-erc-1155s/18480/4",
                        "https://forum.makerdao.com/t/techops-core-unit-updates-december-2022/19564",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-15/18478",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/26"
                    ],
                    "GPT-summary": "The post proposes the creation of a token-gated channel on the MakerDAO Discord for MKR holders to connect, discuss strategy, and participate in voting experiments. The post outlines the purpose, events, and potential growth of the channel, as well as the pros and cons of using certain validation platforms. The post also includes a poll for community feedback on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.551100628930818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "4",
                    "time": "13/10/2022-21:53:43",
                    "content": "I like the idea, but how many 100+ MKR holders are even active in governance? I would suggest a nominal value in the governance contract. The barrier of putting MKR in the governance contract and validating on an app like collab.land should be enough. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/10/2022-21:58:30",
                    "content": "Thanks for pointing that out. We would use the list by @hernandoagf to include delegates and core unit members. Amended the proposal idea to reflect that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/10/2022-22:08:27",
                    "content": "Do you think you’d actively remove them if they sold or were undelegated from or is the idea to have people who have at some point held MKR? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/10/2022-22:10:07",
                    "content": "One advantage to guild.xyz is that it actively monitors whatever conditions you have, collab.land I believe is more ad hoc. I think you can also whitelist too, so we could include historic addresses just for posterity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#6",
                    "likes": "4",
                    "time": "14/10/2022-06:37:04",
                    "content": "we should start with a lower MKR treshold, 10 MKR would be enough from my PoV ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#7",
                    "likes": "6",
                    "time": "14/10/2022-08:14:36",
                    "content": "I have been thinking a bit about this. While it would be cool to have this private` MKR channel, I am concerned about the lack of privacy and also negative emotions. Example: suppose a CU member join the channel (many CU-members are MKR holders). But at some point they quit (or worse, they are kicked out by a bot). People will infer that they sold their MKR.  it might be the case that he just used the MKR in a DeFi protocol (like aave) It might be the case that he had to sell for a short amount of time, maybe he’s just playing the “trader game” and hoping to make a profit  in any of these cases, the reactions could be negative with “WTF!?” moments. So I am not entirely sure that this idea will play out positively. Also     ultraschuppi:  we should start with a lower MKR treshold, 10 MKR would be enough from my PoV   while democratic, I am afraid would likely just be perceived as a waste of time/noise by whales with 3k MKR. All in all, MakerDAO discord channel (at the moment at least) already has very few active users, and generally quite polite and well informed. I don’t know if it is worth creating additional Elite channels. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.634427609427609
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisB",
                    "index": "#8",
                    "likes": "2",
                    "time": "14/10/2022-10:17:04",
                    "content": "I think this is potentially a good idea, although it’s always hard to say. I agree with Schuppi though that 100 MKR is too much. if there is worry about noise, I wonder if it’s easy to have different thresholds with different rights - so maybe 10-100 you get access, but read-only so you can at least see whats going on and being proposed and understand why, and then 100+ maybe get write access or something. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.529761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#9",
                    "likes": "0",
                    "time": "14/10/2022-11:44:53",
                    "content": "    iammeeoh:  I don’t know if it is worth creating additional Elite channels.   My rationale for proposing is more like: Having a community for MKR holders. Not: this is the elite. I don’t see MKR holders as better or worse than anyone else. But they might want to have a place where they can find like-minded people to jam. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#10",
                    "likes": "1",
                    "time": "14/10/2022-14:38:18",
                    "content": "Slight nuances but good points. At the end of the day, the MKR holder tag is just a role in discord. To keep it as private as possible, the role defaults to hidden. Only displaying within the MKR holder chat. Admins will know for example, which is a valid concern.     iammeeoh:  suppose a CU member join the channel (many CU-members are MKR holders). But at some point they quit   Another vote for using guild specifically, which actively monitors for conditions. Like selling/moving one’s MKR or removal of another role in discord.     ChrisB:  100 MKR is too much   Maybe, and it’s just a starting parameter. We figured it would be good to start with holders who could make a big impact in governance by giving them space to build community. From there, we could expand into smaller holders who may have a large voice than token weight. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.659863945578232
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#11",
                    "likes": "1",
                    "time": "14/10/2022-14:53:23",
                    "content": "    twblack88:  We figured it would be good to start with holders who could make a big impact in governance by giving them space to build community.   Wanted to second this. We’d iterate quickly to find the right parameters. To illustrate: Let’s say we set the gate at 100MKR, and no one shows up. We can then iterate down to 50 and see if it helps. If not, up to 200. And so on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.969576719576719
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#12",
                    "likes": "7",
                    "time": "16/10/2022-00:48:36",
                    "content": "interesting idea, and what if we have a channel for vault owners instead of using MKR as the criteria? That could allow us to receive feedback from them and make them part of our onboarding/offboarding processes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Freakytainment",
                    "index": "#14",
                    "likes": "1",
                    "time": "16/10/2022-11:43:42",
                    "content": "I voted in 100 MKR here, but I’m having issues voting on the vote.marker website, I complained about this, but it’s not resolved till now ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#15",
                    "likes": "1",
                    "time": "16/10/2022-12:26:20",
                    "content": "This is a good idea. The tricky part with vaults is that users don’t get a token back, so we would need a bot to list all addresses with opened vaults and then through some API; update the list daily into a whitelist on guild.xyz . I feels very doable and useful. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#16",
                    "likes": "3",
                    "time": "16/10/2022-15:35:40",
                    "content": "We track vault owners (EOAs), you can take a look here in the data api. It’s not perfect when third parties use weird design patterns but it’s probably a good start. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#17",
                    "likes": "1",
                    "time": "17/10/2022-12:41:07",
                    "content": "Very good idea, Nadia. We’ll start with asking TechOps if installing guild or collab.land is doable and secure, and then try an MKR channel, because it is very easy to implement. But once the functionality is there, it can be expanded to have a channel for vault users too. As @tadeo pointed out that would take some data mangling to get the addresses and to keep them up to date, but definitely doable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.341666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DYNSOYO",
                    "index": "#18",
                    "likes": "1",
                    "time": "17/10/2022-15:36:04",
                    "content": "I like the transparency of the current discord model. The last thing I want to another Discord. It feels like I’m working an unpaid job just trying to stay current with Discord, Telegram, Reddit, Twitter, Podcasts, and more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#19",
                    "likes": "0",
                    "time": "17/10/2022-15:51:37",
                    "content": "I can sympathize with that. The proposal is for a gated channel on the current server. How do you feel about that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#20",
                    "likes": "1",
                    "time": "17/10/2022-16:16:17",
                    "content": "I totally agree with you, a kind of filter could be made in which a holder who has that amount of MKR for at least a month enters the discord since it would pass the filter of at least wanting to have an opinion on governance, be it doing farming or simply obtaining them for governance, regarding the amount it can be lower (5-10 MKR) there are people passionate about DAOs in Latin America who do not have that amount of money to own 10 MKR or more, so lowering the threshold is better . Making it only holders of 100 MKR or more could convert it centrally for votes or just have a kind of indirect cabinet, so the lower the better ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#21",
                    "likes": "1",
                    "time": "17/10/2022-16:37:07",
                    "content": "    Nadia:  channel for vault owners   Don’t want to leak alpha, but I would say that, yes we could probably launch this channel as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DYNSOYO",
                    "index": "#22",
                    "likes": "0",
                    "time": "17/10/2022-19:13:30",
                    "content": "Yeah, if it’s on the same server I think it’s a good idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#23",
                    "likes": "4",
                    "time": "19/10/2022-21:30:49",
                    "content": "It’s an interesting idea, but     rspa:  Simply put, a community for MKR holders, a place to belong.   What do you mean by this?, i mean, in which way is the current discord state unwelcoming for MKR holders? What are some of the concerns MKR holders have with it?     Nadia:  and what if we have a channel for vault owners instead of using MKR as the criteria? That could allow us to receive feedback from them and make them part of our onboarding/offboarding processes.   I think this could add much value, we could get valuable metrics from users ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#24",
                    "likes": "2",
                    "time": "28/10/2022-18:06:15",
                    "content": "Looking like @rspa is going to take a much needed family break. I’ll steward this to the Tech ops requests with the following:  100 MKR gate channel current Vault holder gate channel  We can expand the latter category to historic vault hodlers too. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dumitru",
                    "index": "#25",
                    "likes": "3",
                    "time": "24/12/2022-16:30:19",
                    "content": "FYI, TechOps finished configuring discord 2 channels for MKR and Vaults holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}