{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-calls-this-week-tue-cvc-subcommittee-test-run-wed-importance-of-resilience-thurs-prep-for-constitution/20235",
            "title": "Endgame Calls this week: Tue: CVC Subcommittee test run Wed: Importance of resilience Thurs: Prep for Constitution ",
            "index": 20235,
            "category": [
                "Governance"
            ],
            "tags": [
                "public-call"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "1",
                    "time": "21/03/2023-10:37:49",
                    "content": "Overview of the 3 Endgame calls for this week.  Tuesday 7pm UTC: Stability and Liquidity Scope CVC Subcommittee test run Todays Endgame Call at 7pm UTC will be the first CVC Subcommittee test run. We will emulate holding the Regenerative Finance CVC Subcommittee for the Stability and Liquidity Scope. This CVC Subcommittee meeting is expected to be held for real, under the rules of the Maker Constitution, on April 4th 7pm UTC, so todays call gives us a chance to prepare. Personally, as a prospective future member of the Regenerative Finance CVC, I plan to propose as a topic for the call that the CVC discusses improving the language of the Advisory Council Article in the Stability and Liquidity Scope, in terms of what kinds of advisors to onboard, and what projects to prioritize with them, and general principles for how to approach this, in order to take sustainable steps towards improving the quality of the scope framework in the long run. Link: Launch Meeting - Zoom  Wednesday 7pm UTC: Importance of Resilience Tomorrows Endgame Call, also at 7pm UTC as usual, will focus on physical resilience and the importance of resilience and privacy on the ability for governance and the maker protocol to function in a chaotic external environment, such as the turmoil and risks that are materializing in global financial markets. Link: Launch Meeting - Zoom  Thursday 7pm UTC: Preparation for Maker Constitution operations Thursdays Endgame Call at 7pm UTC will be the last call before the Maker Constitution vote ends. It will focus on practicalities of how we start up operating governance under the constitutional framework, and I will also cover the Scope Framework edits I am putting up for proposal to be voted on during April. Link: Launch Meeting - Zoom ",
                    "links": [
                        "https://us02web.zoom.us/j/84758425312",
                        "https://us02web.zoom.us/j/84758425312"
                    ],
                    "GPT-summary": "The post provides an overview of three Endgame calls scheduled for the week, discussing topics such as stability and liquidity, resilience, and preparation for Maker Constitution operations. The author explains the purpose of each call and provides links to join. The author also proposes a topic for the Stability and Liquidity Scope CVC Subcommittee test run and mentions Scope Framework edits to be voted on during April. The post does not advertise the proposal, give entirely positive or negative feedback, extend to the proposal, or collaborate on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.035714285714286
                }
            ]
        }
    ]
}