{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-increases-in-the-eth-and-usdc-a-debt-ceilings/3265",
            "title": "[Signal Request] Increases in the ETH and USDC-A debt ceilings ",
            "index": 3265,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "signaling",
                "debt-ceiling",
                "usdc",
                "eth-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#1",
                    "likes": "5",
                    "time": "19/07/2020-15:23:48",
                    "content": "Hey all, The farming craze has taken another turn with the start of YFI farming. Until long term solutions are put in place the community may want to consider increasing the ETH and USDC-A debt ceilings. Please weigh in on what you feel is right given the current environment. The poll will last approximately 24 hours, and the results will be included in an expedited executive vote to go out on Monday. What should the new ETH debt ceiling be?     180 million (NO CHANGE) 190 million 200 million 210 million 220 million Abstain / Show results     0 voters     What should the new USDC-A debt ceiling be?     40 million (NO CHANGE) 50 million 60 million 70 million 80 million Abstain / Show results     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/liquidity-mining-response-summary/3134"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.077458256029685
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#2",
                    "likes": "4",
                    "time": "19/07/2020-15:31:31",
                    "content": "I think the ceiling should be as high as possible… unless we want to have another poll in 2 days ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#3",
                    "likes": "3",
                    "time": "19/07/2020-15:34:42",
                    "content": "There is 20 million in the queue from the recent executive, plus a potential additional 80 million from the two polls above. This represents 100 million of Dai. Even if it is ultimately not sufficient I hardly think we need to move faster than 100 million in 2 days. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#4",
                    "likes": "4",
                    "time": "19/07/2020-15:37:53",
                    "content": "yeah 100m is great, I am mostly trying to encourage people to vote for the higher limits ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/07/2020-15:52:08",
                    "content": "Are there reasons why we want to limit the market at the expense of the peg? If the ETH limit in particular is near to full, it is always going to impact the peg. In the past I know there was consideration to be cautious because of the risk of a contract failure. This risk seems very negligible at this point though as the contract is well proven. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "6",
                    "time": "20/07/2020-20:49:52",
                    "content": "The price oracle has a 1 hour delay, which means if an asset price dropped by more than 33% in an hour it would become possible to mint 1 DAI with less than 1 USD worth of collateral asset (or KNC and ZRX which have 175% liquidation ratio, they would need to fall by ~42% for this to be possible). Keeping the debt ceilings fairly close to the current borrowed amount limits the amount of money Maker would lose if that happened. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9523809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#7",
                    "likes": "1",
                    "time": "20/07/2020-22:27:40",
                    "content": "The selected options are on top of the range. Please offer a bigger range next time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#8",
                    "likes": "1",
                    "time": "20/07/2020-22:44:43",
                    "content": "Thanks for the reply. I understand the risk, and it seems like it could in extreme circumstances lead to small losses for Maker. However, this seems unlikely, and not big enough of a risk to warrant disrupting the peg for. If we keep assets right at the debt ceiling limits, we will continue to have peg issues as there is not room enough for significant arbitrage efforts to make a difference. A lot of arbitrage opportunities require the confidence that the peg will be restored in time before the stability fee removes the potential profit. If that confidence isn’t there, then less people are willing to participate. It creates a negative cycle. If there was enough of a debt ceiling available such that someone could come in, mint dai, and restore the peg tomorrow, it would create a positive cycle even if no one took advantage of it immediately. Certainly few rational actors would consider buying DAI at $1.02 in that scenario. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.05453342953343
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#9",
                    "likes": "2",
                    "time": "21/07/2020-00:25:39",
                    "content": "There’s an executive vote up to raise the debt ceilings for USDC and ETH: https://vote.makerdao.com/executive-proposal/raise-the-etha-and-usdca-debt-ceilings ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/experience",
                    "index": "#10",
                    "likes": "1",
                    "time": "21/07/2020-16:44:51",
                    "content": "Why were these proposals bundled together? USDC has a much different risk profile than ETH. It should be possible to vote for raising the ETH debt ceiling without approving more USDC backing new DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.795454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FabianSchuessler",
                    "index": "#11",
                    "likes": "1",
                    "time": "21/07/2020-17:54:46",
                    "content": "I agree with all the debt ceiling increases. But: Currently, MKR holders take all the risk while earning nothing in return. If we increase the risk of the MKR holders by increasing the debt ceilings to enable the yield farmers, then MKR holders should be at least a little bit compensated for their risk. Let’s increase ETH-A and BAT-A stability fee to 0.25%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#12",
                    "likes": "6",
                    "time": "21/07/2020-17:58:15",
                    "content": "I disagree, imo Maker’s greatest risk is fading into irrelevancy if we can’t meet market demand for DAI and maintain the peg. I think ETH should remain at 0% risk premium until DAI is under $1. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#13",
                    "likes": "3",
                    "time": "21/07/2020-18:01:33",
                    "content": "Whole heartedly agree with @monet-supply. I’ll keep re-iterating this point that start up companies generally do not take profits and in fact want to take on as much “reasonable” risk as possible gain trust / market share. All levers should point to maximum growth at this stage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#14",
                    "likes": "0",
                    "time": "21/07/2020-20:54:36",
                    "content": "PS : Right, it’s 0.4% so a multiple of 250x. My bad. Still cheap if DAI become a major stablecoin. As far I can tell from https://daistats.com/#/ , the return to MKR holders is 4%, or a 25x multiple. That’s cheap in the current environment. A lot of things can kill MKR value (default of USDC, sharp decrease of ETH with a network congestion). I agree with @monet-supply that fading into irrelevancy is a big risk, and one we can avoid proactively. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.192370129870129
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#15",
                    "likes": "2",
                    "time": "21/07/2020-21:21:45",
                    "content": "I think you mean .4%? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#16",
                    "likes": "0",
                    "time": "21/07/2020-21:32:16",
                    "content": "It’s 0,4% roughly but without a predictable revenue estimate and taking into account crypto fluctuations the number changes daily quite significantly. However we should not apply PE ratios to any crypto project quite frankly, it really does not matter even if it’s 20 if some regulator can come and shut you down or a bug is exploited and you are out of business. I agree we should push for adoption and the only revenue we should be focusing on is the one destinated for reserves in case another black thursday comes knocking the door. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.970486111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/experience",
                    "index": "#17",
                    "likes": "4",
                    "time": "22/07/2020-18:41:49",
                    "content": " Why were these proposals bundled together? USDC has a much different risk profile than ETH. It should be possible to vote for raising the ETH debt ceiling without approving more USDC backing new DAI.  Even if the executive vote is already up, I would like the Maker community to strongly consider this. Clearly these two should not have been put up in the same vote as the risk profiles for ETH and USDC are absolutely not the same. Holders should not have to raise the USDC exposure in order to raise the ETH debt ceiling. There is a fundamental process issue with this vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.594276094276093
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "3",
                    "time": "23/07/2020-08:14:39",
                    "content": "You’re correct that this is a concern. That said, it’s one we’ve been dealing with for a while. Having multiple executives up at the same time causes problems, so we’re limited to 1-2 per week. In this case, since these are emergency measures and that we were very close to both debt ceilings at the time the poll concluded, I don’t think there is a better way we could have done this with the current tools available to us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.73469387755102
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FabianSchuessler",
                    "index": "#19",
                    "likes": "1",
                    "time": "25/07/2020-15:03:42",
                    "content": "And right now the peg is already below $1. Time to raise the stability fees and hope that the peg doesn’t get totally crushed by the flood of Dai due to the possible end of yield farming. The MKR holders are carrying the risk while the big whales get into Dai, get a big return on investment in yield farming and get out of Dai again. The peg is decided and moved by these big whales. I would even bet 0%, 0.5% or 1% does not even make any difference to the peg because those whales might not care. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.043367346938775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#20",
                    "likes": "2",
                    "time": "25/07/2020-16:39:10",
                    "content": "    FabianSchuessler:  And right now the peg is already below $1.   The peg has certainly improved but there’s still over $100k of bids over $1 on coinbase pro. I’d be on board to raise rates once DAI is trading under $1 consistently. But I don’t think yield farming is going anywhere, the CRV token is likely to be released soon which could cause another wave of activity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#21",
                    "likes": "0",
                    "time": "26/07/2020-00:24:57",
                    "content": "The whales are controlling the price of DAI. They will not let DAI fall below one dollar. Because they want to use DAI with zero interest rate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JaVilletes",
                    "index": "#22",
                    "likes": "0",
                    "time": "27/07/2020-18:11:27",
                    "content": "Hello, the current ETH demand implies that we are short, the ceiling increase to 300M for the ETH can cause some risk to MAKER? I think no maybe is a good option? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#23",
                    "likes": "0",
                    "time": "27/07/2020-19:53:43",
                    "content": "Hi JaVilletes, welcome to the forum!!! While we should increase the debt ceiling in order to match demand and take away pressure from the peg, keep in mind there is always risk. By increasing the debt ceiling without any fees to compensate we are increasing our risk exposure as “custodians” of the assets (a billion by now) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#24",
                    "likes": "0",
                    "time": "03/08/2020-19:53:46",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}