{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-interest-rate-adjustment-by-debt-facility-utilization/1068",
            "title": "Proposal interest rate adjustment by debt facility utilization ",
            "index": 1068,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "idea",
                "rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "4",
                    "time": "04/01/2020-23:36:55",
                    "content": "I am posting this as a new topic for discussion because after the first round of analysis and the fact the GSM time delay is not activated means the IAMs that could be used to implement it could be coming on line shortly.   Also my wife is now suffering a debilitating medical condition that requires almost constant care currently and so it is time I hand various details/ideas I have found off to others for discussion and debate. I don’t want to talk about implementation issues but simply the merits of the proposal.   If there is consensus for this then we can talk about implementation pros/cons What I would like to see discussed is the idea of having the rates for the interest on vaults fluctuate based on the debt facility utilization percentages. Simple example for illustration purposes. Lets say we hve ETH-A risk premium fee at 1% and the Global SF at 4%.   Giving a total of 5%/yr being the fees charged. Right now the ETH-A facility Debt Ceiling is $100M DAI. What I would like to see is a Utilization Factor applied to the total interest charged on the ETH-A vault DAI borrowers. Here is an example curve formula. itarget=(gsf+etha) i(u)=itarget*((2.2*u-1)^7 + 1.25)/1.25 between 0<=u<=1  you can plot this on Graphing Calculator (u=debt facility utilization factor between 0-100%) i(0)=itarget x .2 i(.05)=itarget x .646 i(.1)=itarget x .859 i(.2)=itarget x .986 i(.3)=itarget x 1 i(.7)=itarget x 1.011 i(.8)=itarget x 1.117 i(.9)=itarget x 1.695 i(.95)=itarget x 2.462 i(1)=itarget x 3.867 If the itarget is 5% this means i(0)=.2*5%=1%, i(.05)=3.23%, i(.1)=4.295%, i(.2-.7)~5% i(.8)=5.585%, i(.9)=8.475%, i(.95)=12.31%, i(1)=19.335% The point here is that if we allow the fees to fluctuate based on the utilization of the debt facility the markets will adjust themselves automatically to accomodate this. My goal here was not to come up with an actual utilization curve but to present a demonstrative example where the Maker community can have in effect a floating fee curve that will respond dynamically to the market environment, that has enough flexibility to span a wide range of rates but to still allow the same kind of monetary policy management using the itarget rate. Realize we can break out the etha risk premium from this graph and just make the formula have itarget=gsf and then add on the etha risk premium to this level.   It will adjust the numbers somewhat but the effect is still the same. Based on the above example curve rates go down when debt facility utilization is below 20%, they go up when the utilization is much over 70%.    This will make borrow rates to be competitive with the industry and for users to decide which facility to use based on this rate.  It will cause an automatic management of the facility debt utilization and rate based on market demands.   The above maximizes return for MKR holders against risk automatically as well as DSR users (provided another proposal I have made regarding setting the DSR return rate to a fixed percentage of the generated interest) finds consensus.  A Governance Model for Maker - #5 by MakerMan The pros of this:   Better borrow rate matching and competition between Maker and the secondary markets.   Maximizes return dynamically for the existing debt facility based on debt ceilings and the chosen rates and simultaneously manages risk.   Minimizes completely the need for governance to micromanage these changes - the markets will do this automatically eliminating voter burn out.   Is roughly designed in most normal cases to still have some liquidity available even if the rates are high.   Retains the basic liquidity and PEG management functions based on target rate and DC changes.  Increasing the DC means rates stay the same or drop, decreasing the DC means rates may stay the same or increase.   Increasing/decreasing the SF means rates at all points of the curve increase/decrease.  I also suspect this might eliminate a DAI liquidity attack.   Also again better scientific data regarding effect of changing DC/SF rates on the PEG vs. a fixed rate model. Coupled with another proposal I have made regarding using a fixed % of the fees generated to pay the DSR actually maximizes the DSR payout. I think with the IAMs proposed this should be relatively easy to implement. Negatives of this:  Unclear whether smart contract changes would be needed to accomplish this.  Also a floating rate for borrowers may make them less likely to borrow.   This alone will not help provide liquidity during liquidity crunches and if the utilization is high may dissuade vault holders to mint more DAI even if the price is high because the incremental change to interest to their entire holdings may be greater than the return generated by minting the DAI negatively affecting the PEG.  (I am convinced with the DSR there are other better liquidity mechanisms to provide DAI during liquidity crunches than minting DAI from vaults during collateral price drops) but the effect on liquidity in the PEG <1 and PEG >1 I am less worried about with this proposal as I have observed SF changes during liquidity crunches are mostly irrellevant to the markets and borrowers than actually being able to find liquidity at decent prices to cover borrowers near liquidation points. Feel free to discuss. ",
                    "links": [
                        "https://forum.makerdao.com/t/a-governance-model-for-maker/1056/5",
                        "https://forum.makerdao.com/t/negative-interest-rates/842/20",
                        "https://forum.makerdao.com/t/debt-ceiling-adjustment/1099/4",
                        "https://forum.makerdao.com/t/discussion-is-gfxs-interest-protocol-a-direct-challenge-to-maker/15577/49",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-january-9-9am-pst-5-00-pm-utc/1084/4",
                        "https://forum.makerdao.com/t/an-idea-for-vaults-2-0-or-advanced-vaults/11389/2",
                        "https://forum.makerdao.com/t/mip17-weekly-actual-debt-ceiling-and-actual-risk-premium-adjustments/3021/19"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.550206228956229
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/01/2020-04:50:46",
                    "content": "I’m not good at this hardcore finance stuff, but the idea seems really interesting and I appreciate the thoughts/example. To me it seems like a stability fee optimizing competitiveness/safety based on collateralization ratio. Correct me anyone if thats misguided. My questions: A utilization percentage is calculated by the amount of debt a borrow could still take on right? Does the collateralization ratio symbolize this? if so, If eth price goes up and the borrowers do not take on more debt the utilization factor goes down right (since borrowers could take on more debt at the same collateraelization ratio)? Using this formula that would result in a decrease of the stability fee, would always lowering the stability fee when eth price goes up really be wise? Same question in reverse, would raising the stability fee whenever eth price goes down always make sense either? (both questions are when assuming all else stays constant) In general I have trouble seeing how the stability fee can be safely adjusted purely off of formulas. Wish you strength and love on your journey ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9337068160597575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "06/01/2020-11:17:53",
                    "content": "So I think that this is a good idea in general, and that we should move in this direction at some point. I’ve no idea what the actual curve should be, but I do think it could be better than the current system. I’d be interested to see if there is any value in combining it with the current system. Having the possibility of a fixed(ish) rate offering alongside a usage-determined rate offering. One thing we could do is apply the curve only above a certain utilisation factor, to implement ‘soft’ debt ceilings. One thing we would need to be careful of would be that the rate increase is not too punishing. If market conditions change and someone at 2% is jacked up to 10% due to market forces without realising it, that could be a problematic scenario. We dealt with this way back when we went from 0.5% to much higher, so it’s not a new problem, but the rate would have the potential to be more variable than ever before. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.630862193362194
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "1",
                    "time": "06/01/2020-14:35:41",
                    "content": "Mitote thank you for the consideration and reply.    u in the curve is the Debt facility utilization factor and NOT the collateralization factor.   You are right if the curve was collateralization based it would be horrible. So again u = actual debt/debt ceiling.   Right now stands at about .74 and so the SF based on my example formula would have the interest fees just starting to rise.   u(.74)=1.031*itarget ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "0",
                    "time": "06/01/2020-14:42:49",
                    "content": "What curve is up for discussion.   I wanted one that pretty much is flat and at the desired itarget between the debt utilization factor from .25 up to about .7 and then a pretty strong move up as we go from .7  to .9 and up and a pretty good drop as we go below .1 to lower rates and encourage borrowing.   The goal of this is to design a fee curve that makes it hard to extinguish all liquidity (i.e. we don’t want debt utilization to EVER hit 100%) as this exhausts the ability of borrowers to mint more DAI even if the price is > $1 and only leaves holders (DSR, etc) as last resort liquidity providers. Exhausting the debt facility puts the PEG at greater risk and only one of the reasons going into the above proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.773809523809524
                }
            ]
        }
    ]
}