{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/argentines-seek-usd-exposure-via-stablecoins-amid-surging-inflation/16320",
            "title": "Argentines seek USD exposure via stablecoins amid surging inflation ",
            "index": 16320,
            "category": [
                "Latin America"
            ],
            "tags": [
                "news"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#1",
                    "likes": "17",
                    "time": "04/07/2022-15:58:39",
                    "content": "DAI’s use case for LATAM inflation hedges remains strong. Exchanges were closed during the weekend, when the resignation was announced, while crypto markets were opened  and allowed Argentines to save a portion of their savings.    coindesk.com – 4 Jul 22    Argentines Take Refuge in Stablecoins After Economy Minister Resignation Major crypto exchanges reported that consumers purchased up to three times as many stablecoins over the weekend as they usually do amid a brewing economic crisis.      “Following Guzman’s resignation, the peso depreciated about 15% against the stablecoins DAI and tether on several leading local exchanges’ platforms”    TronWeekly – 4 Jul 22    Stablecoin Purchases In Argentina Seem To Have Tripled Amidst Economic Crisis Investors in Argentina bought two to three times as many stablecoins over the weekend compared to the average, according to the country's crypto firms. This      “According to the corporation, “many people” used their DAI as collateral to secure loans in Argentine pesos and buy more DAI as insurance against a prospective peso depreciation. The Argentine exchange Buenbit reported a 300 percent spike in trade on Sunday compared to the same day in prior weeks”    Cryptopolitan    Stablecoins become a hedge against inflation in Argentina The crypto winter is hitting each nation differently. Argentines are turning to stablecoins after the economy minister resigns to survive global recessions.      “On Saturday, the only market tradable in Argentina was Crypto, especially stablecoins. While volumes are modest, the moves might suggest anxiety among at least some traders” ",
                    "links": [
                        "https://www.coindesk.com/business/2022/07/04/argentines-take-refuge-in-stablecoins-after-economy-minister-resignation/",
                        "https://www.tronweekly.com/stablecoin-purchase-in-argentina-tripled/amp/",
                        "https://www.tronweekly.com/stablecoin-purchase-in-argentina-tripled/amp/",
                        "https://www.cryptopolitan.com/stablecoins-to-hedge-inflation-in-argentina/",
                        "https://www.cryptopolitan.com/stablecoins-to-hedge-inflation-in-argentina/",
                        "https://forum.makerdao.com/t/does-hiperinflation-help-cryptocurrency-adoption/16608",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-10/16685",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-10-traduccion/16689",
                        "https://forum.makerdao.com/t/la-hiperinflacion-ayuda-a-la-adopcion-de-criptomonedas/16890"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5643115942028984
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "2",
                    "time": "04/07/2022-16:34:34",
                    "content": "I understand that exchange rates went crazy with huge price differences. CRAZY ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#3",
                    "likes": "18",
                    "time": "04/07/2022-16:36:05",
                    "content": "I´m Argentine and those notes reflect our reality. Crypto allowed us to protect our savings from our FIAT currency devaluation on a Saturday, without having to wait for Monday, when it would be too late. Crypto, and stablecoins in particular, provides us a real and concrete solution to our suffocating economic reality. I don’t know if in the first world can appreciate what this technology is doing for our lives and for our economic freedom. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#4",
                    "likes": "5",
                    "time": "04/07/2022-21:43:21",
                    "content": "Just imagining how it was done before to change FIAT to gold or dollars in a hyperinflation without the existence of cryptocurrencies gives me chills Thinking of my grandfather or my father running like crazy to a foreign exchange house or to a place where they buy and sell precious metals, or spend it on material goods that depreciate less quickly than fiat just to protect the family’s assets is extremely scary And just observing that today thanks to cryptocurrencies you can do it in an instant without moving from your position is extremely beautiful ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.273148148148148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#5",
                    "likes": "1",
                    "time": "04/07/2022-21:55:03",
                    "content": "That is the history of our countries, and today thanks to crypto and stablecoins like DAI, we have the tools to defend ourselves. I´m deeply grateful for that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#6",
                    "likes": "4",
                    "time": "05/07/2022-04:16:45",
                    "content": "My words of solidarity to the inhabitants of that great country called Argentina in the face of the economic situation that continues to pulverize the savings of millions of people. Undoubtedly, those of us who have ventured into the crypto world have found a respite in stable currencies in order to protect our money. It is a pity that the use of the DAI is not yet in the majority, but these financial crises of the traditional economic system will undoubtedly continue to accelerate its use. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#7",
                    "likes": "8",
                    "time": "05/07/2022-12:15:17",
                    "content": "Exactly! It´s not a coincidence that Venezuela and Argentina are in top 10 countries for crypto users. Our task is to continue spreading the word to achieve much greater adoption by the majority.    DailyCoin.com – 25 Aug 21    Venezuela and Argentina in the Top Ten Globally for Users of Cryptocurrencies... Crypto usage has risen almost nine times in the last year, especially across Latin America.  Est. reading time: 3 minutes       ",
                    "links": [
                        "https://dailycoin.com/venezuela-and-argentina-in-the-top-ten-globally-for-users-of-cryptocurrencies/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.284722222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#8",
                    "likes": "5",
                    "time": "05/07/2022-16:07:28",
                    "content": "This one of the reasons why crypto adoption has been rising steadily in our country (i’m argentine). Stablecoins as DAI, and DEFI mechanisms are a game changer for us. With some financial instruction, any person can now access a market that has historically been reserved for a few. Crypto adoption will keep rising in LATAM, and this is great news for Maker. I forsee a ramp up in the latin american community numbers for the coming months and years and i can’t wait to see it become a reality. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.261904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#9",
                    "likes": "2",
                    "time": "05/07/2022-16:14:41",
                    "content": "Totally agree. Economic and financial crises are tough, but they also bring new opportunities. I think many will look at crypto from a different perspective over time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.31962481962482
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#10",
                    "likes": "7",
                    "time": "05/07/2022-16:58:37",
                    "content": "DAI can be so so useful for such folks but we need gas fees to be reasonable ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#11",
                    "likes": "3",
                    "time": "05/07/2022-17:08:59",
                    "content": "Yup agree, though in most inflation hedging cases centralized exchange fees are reasonable and if the strategy is just to HODL its fine. I agee that for scaling (payments, purchases, wallet transfers, DeFi, etc) the ETH gas fees are a problem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.861111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#12",
                    "likes": "2",
                    "time": "05/07/2022-17:47:59",
                    "content": "    Eumenes:  DAI can be so so useful for such folks but we need gas fees to be reasonable       TRUEMAKER:  Yup agree, though in most inflation hedging cases centralized exchange fees are reasonable and if the strategy is just to HODL its fine. I agee that for scaling (payments, purchases, wallet transfers, DeFi, etc) the ETH gas fees are a problem.   Agree with both comments. In fact, leaving aside CEX and speaking of blockchains, Ethereum is not used by the majority of stablecoins users in our region, the greatest stablecoin use is concentrated in BNB Chain (the first by far) and Polygon due to their low fees. Also Tron is very used for out of the radar p2p. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.267361111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#13",
                    "likes": "3",
                    "time": "05/07/2022-18:42:28",
                    "content": "From what I have gathered, people in unstable countries mostly use centralized exchanges or Polygon/Binance Chain to hold their coins due to the fee issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#14",
                    "likes": "0",
                    "time": "05/07/2022-20:38:34",
                    "content": "Binance dominates the CEX market globally, it has 8-10x more daily volume than the second CEX but I dont think DAI is supported ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#15",
                    "likes": "4",
                    "time": "05/07/2022-21:44:21",
                    "content": "Wish DAI existed back in 1999 during Ecuador’s Financial Crisis, we had rapid depreciation of the sucre, acceleration of inflation, widespread freeze of bank deposits and closure of financial institutions, it got so bad that 16 of the 40 banks went bankrupt. In 2000, Ecuador swapped its national currency “El Sucre” and adopted dollarization but by then our deposits had already lost all or most of its value. Stablecoins are a tool we did not have back then but that global citizens now have and for that I am extremely excited, but obviously they can be much bigger than this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#16",
                    "likes": "1",
                    "time": "05/07/2022-22:25:26",
                    "content": "There are plenty in the stable countries using those exchanges as well. Interesting to watch in the current market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#17",
                    "likes": "8",
                    "time": "06/07/2022-00:45:31",
                    "content": "    Marian:  I´m Argentine and those notes reflect our reality. Crypto allowed us to protect our savings from our FIAT currency devaluation on a Saturday, without having to wait for Monday, when it would be too late. Crypto, and stablecoins in particular, provides us a real and concrete solution to our suffocating economic reality.       Moi:  Thinking of my grandfather or my father running like crazy to a foreign exchange house or to a place where they buy and sell precious metals, or spend it on material goods that depreciate less quickly than fiat just to protect the family’s assets is extremely scary   Thank you for sharing these thoughts @Marian and @Moi - truly, this is (or should be) the true north star for DeFi and what keeps me passionate about the space. Offering a digital financial system that is trustworthy and globally accessible will be a generation-shaping achievement. We aren’t there yet of course, but we’re making progress and Maker is at the centre of that ambitious and worthy effort. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.162280701754386
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#18",
                    "likes": "3",
                    "time": "06/07/2022-07:28:46",
                    "content": "    Marian:  Crypto allowed us to protect our savings from our FIAT currency devaluation on a Saturday, without having to wait for Monday, when it would be too late. Crypto, and stablecoins in particular, provides us a real and concrete solution to our suffocating economic reality. I don’t know if in the first world can appreciate what this technology is doing for our lives and for our economic freedom.   It is a great truth. Cryptocurrencies have been a blessing for everyone, especially for those of us living in underdeveloped countries. Being able to have access to your money 24 hours a day, 365 days a year without a regulator setting conditions is something I value very much. Today, finally, we citizens have a great tool, a weapon that we can wield against bad government economic policies and safeguard our savings. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.695833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#19",
                    "likes": "5",
                    "time": "06/07/2022-13:46:34",
                    "content": "@Hajive, @Nadia - are there ways we can accelerate the brand and availability of DAI in these countries? seems like the perfect use case for DAI You cannot get  more organic demand than this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#20",
                    "likes": "4",
                    "time": "06/07/2022-13:52:04",
                    "content": "Highly recommend listening to this podcast, touches on Arg stablecoin demand during the weekend, deppeging to the top in some cases 15% premiums, as well as longer term struggles faced between local regulation, e.g. maximum of 200 USD purchased per month, and digital assets adoption.  Increasing Inflation Volatile Economy Currency Devaluation Restrictive USD market  DAI’s product use case is as real as it gets  Screenshot_20220706-094425_Google1079×955 127 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.859999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#21",
                    "likes": "5",
                    "time": "06/07/2022-14:22:22",
                    "content": "DAI a MakerDAO has a lot of presence in my country (Argentina), it is the second most used stablecoin. However, although crypto adoption is growing fast, it is not yet massive so there is much to be done. In that order, in August we will have ETH Latam in Buenos Aires, where MakerDAO will be a main sponsor and precisely @Nadia  will be one of the speakers. Without a doubt, this will help to promote DAI adoption.   twitter.com    ETHLatam at BA 🇦🇷 @ethlatam  TY @MakerDAO for supporting ETHLatam as GM sponsor✨ https://t.co/Wt0M0k6eev   9:12 PM - 28 Jun 2022           15                3            I am convinced that stablecoins will be key players in blockchain and cryptocurrencies in our region, DAI has many opportunities to continue growing here, because provides us real solutions in our lives. ",
                    "links": [
                        "https://twitter.com/ethlatam/status/1541892362007363590",
                        "https://twitter.com/ethlatam/status/1541892362007363590",
                        "https://twitter.com/MakerDAO",
                        "https://t.co/Wt0M0k6eev",
                        "https://twitter.com/ethlatam/status/1541892362007363590"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.098484848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#22",
                    "likes": "2",
                    "time": "06/07/2022-16:23:13",
                    "content": "Just finished listening to this podcast— sad to hear that Argentinians are paying a premium to get access to DAI. No bueno. We are finally banking the unbanked at  a Premium. SMH ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#23",
                    "likes": "5",
                    "time": "06/07/2022-17:20:10",
                    "content": "Yup but its more nuanced than that. Sadly paying  the premium, which I agree should not happen (how can Maker help prevent this?), is still a better option than the  “blue” USD rate which is almost 2x the official rate mostly due to 2019 law which prohibited Argentines from buying more than $200 per month. Argentina’s black market dollar trade is illegal but part of life. In 2021, economist Nicolas Gadano – a former Central Bank director – estimated that Argentines held about $200 billion in banknotes – 10 percent of all the dollars in circulation in the world and a fifth of those outside the United States. From our POV these USD/DAI holders are always buying and very unlikely to sell, unless an enormous goverment monetory policy shift takes place. Organic DAI demand is likely only going to increase ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.852777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#24",
                    "likes": "4",
                    "time": "06/07/2022-18:22:48",
                    "content": "This is what I mean by increasing DAI exposure, the cases of countries with economic emergency is the right time for DAI to be their lifeline, if we make them choose DAI before any other stablecoin, we will facilitate the adoption of DAI (which is already ) but imagine that most establishments deal with DAI before any other currency, those retailers can start to delve into the protocol and open a percentage of their money in vaults to protect it and a little reinvest it, or enable loans to merchants retailers with a kind of chain signed contract with specific parameters of loans in DAI and that establishment helps the spread of DAI as the first coin of choice, Tether will not have any security but it has something that any stablecoin would like. have and it is wide adoption I know a lot of folks wouldn’t approve of more Maker or DAI exposure in real life, but the vision of crypto in general is also to solve real world problems, and hyperinflation is a real problem that DAI can solve ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.628151260504202
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#25",
                    "likes": "0",
                    "time": "07/07/2022-19:04:51",
                    "content": "MKR already has a Delaware LLC, why not also have a USD vault to incentivize growth and compete with USDC, USDT, etc. That would allow for broader DAI adoption and support people in situations similar to that of Argentina… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#26",
                    "likes": "6",
                    "time": "25/07/2022-13:16:29",
                    "content": "   Decrypt – 22 Jul 22    Bitcoin Traders in Argentina Restricted From Buying Dollars - Decrypt Argentina is restricting crypto traders from buying dollars at the official exchange rate in a bid to stop capital flight.        Another recent development in Arg Market - Now the government is restricting all persons that have purchased BTC and other digital assets from purchasing USD at the official exchange rate. The power struggle between trustless crypto assets and a corrupt government that attempts to control the economy will be interesting to monitor. ",
                    "links": [
                        "https://decrypt.co/105772/bitcoin-traders-argentina-restricted-buying-dollars"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#27",
                    "likes": "1",
                    "time": "05/10/2022-02:33:31",
                    "content": "You can never get bored in our country!  The restrictive measures kitchen works 24/7 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#28",
                    "likes": "5",
                    "time": "05/10/2022-03:49:02",
                    "content": "    Eumenes:  @Hajive, @Nadia - are there ways we can accelerate the brand and availability of DAI in these countries?   Happy to pick up this discussion again. At Bidali we’ve supported DAI since inception, employ people in Argentina and have helped them protect themselves from inflation, and enable people to spend DAI. It’s been a while since we spoke @Nadia, @Jenn and @rune (hello again ). Since 2018 we’ve done a lot of research in LatAm around money, inflation, crypto usage and barriers to adoption. This has included gathering both quantitative and qualitative data via research articles, multiple surveys with thousands of respondents across all ages, genders and wealth, as well as interviews with dozens of individuals (both crypto users and not). The main blockers to adoption are:   The inability to spend DAI directly on common goods and services easily (which we solve, just need more help with marketing & BD);   With such high inflation for so long, many people don’t have spare income to purchase DAI to save if they can’t spend it directly. And even if they do have spare money to save, often it is negligible and the swap fees are cost prohibitive;   Ethereum gas fees make it cost prohibitive to use DAI for real world commerce without sacrificing decentralization, which is critically important where strict capital controls are highly likely. DAI being available on BSC and other faster, lower cost networks or L2s is required. We already support DAI on BSC and support 9 other blockchain networks in our payment tech stack, with more being added. Happy to discuss options here.   DAI is still kind of complex and not as familiar as USD or EUR. If it is presented as USD to the user and people don’t know it’s crypto (like we do in our mobile app) adoption will be better and easier. Needs to be a DeFi mullet that is easy to use but still non-custodial.    Capital controls in Argentina are aggressive and are a bit of an issue, but there are multiple ways to overcome this challenge. The best way is for people to earn DAI directly (so long as they can spend/convert it). Initial subsidies to bootstrap a network effect of P2P, consumer-retail, B2B and business-employee payments in key regions is likely required to kick start “hot spots” of a full circle of DAI enabled commerce. We have the tools (and localized in Spanish), we just lack all the resources right now. We’re preparing for a capital raise. Happy to discuss if there is serious interest from the Maker community.  It’s incredibly sad what we’ve seen hyperinflation do in Venezuela and now what we’re seeing in Argentina, Zimbabwe, Turkey and elsewhere. People deserve to have options. ",
                    "links": [
                        "https://forum.makerdao.com/t/crimson-creator-cluster/18241/8"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.050096525096525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#29",
                    "likes": "3",
                    "time": "05/10/2022-14:24:00",
                    "content": "Hey, happy to see you around in the forum  want to say I’m a huge huge fan of Bidali and thanks to you, at the time when DAI was unknown, we found a way to provide a solution to people in Latam, especially in Argentina. In the end, people are looking for solutions, not for an overcollateralized decentralized stablecoin. Some thoughts around the points you mention (based on my experience as part of the Growth team and as a DAI super user)     ekryski:  The inability to spend DAI directly on common goods and services easily (which we solve, just need more help with marketing & BD);   When we started, this was true, now, cryptocards/cryptobanks have changed the game. They offer the end to end solution with products that look alike other banks, transforming themselves into Fintech solutions and not a niche crypto product. Of course, gift cards are part of the solution,  but I want to point out the amazing work these cryptobanks have done in adoption. And btw, if you are in Argentina, you don’t want to spend DAI, you want to save DAI and spend in ARS, you always want to get rid of the most devaluated currency.     ekryski:  With such high inflation for so long, many people don’t have spare income to purchase DAI to save if they can’t spend it directly. And even if they do have spare money to save, often it is negligible and the swap fees are cost prohibitive;   True, swapping fees are the reason why one could prefer one stablecoin over another.     ekryski:  Ethereum gas fees make it cost prohibitive to use DAI for real world commerce without sacrificing decentralization, which is critically important where strict capital controls are highly likely. DAI being available on BSC and other faster, lower cost networks or L2s is required. We already support DAI on BSC and support 9 other blockchain networks in our payment tech stack, with more being added. Happy to discuss options here.   Also true, gas fees are a problem, but also wrapped DAI. That’s why our focus is on developing canonical DAI markets.     ekryski:  DAI is still kind of complex and not as familiar as USD or EUR. If it is presented as USD to the user and people don’t know it’s crypto (like we do in our mobile app) adoption will be better and easier. Needs to be a DeFi mullet that is easy to use but still non-custodial.   We have to be careful about that because DAI is not USD, although quite a challenge, it is not impossible to explain and with a good marketing plan, people will get it.     ekryski:  We have the tools (and localized in Spanish), we just lack all the resources right now. We’re preparing for a capital raise. Happy to discuss if there is serious interest from the Maker community.   I don’t have an answer now, but it’s worth exploring how Bidali could interact with creator metadaos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.237873754152824
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#30",
                    "likes": "2",
                    "time": "05/10/2022-16:18:15",
                    "content": "    Nadia:  We have to be careful about that because DAI is not USD, although quite a challenge, it is not impossible to explain and with a good marketing plan, people will get it.   As you said above, people are looking for solutions or escape from inflation, and they are guided more by simply using the most common currency in these cases is USDT, but let’s remember that currently the population is not fully educated, and there is the opportunity of DAI, teach in a didactic way how to protect your money without falling into the error of using unbacked centralized currencies. For this we can use the growth team to formalize basic cryptocurrency guides sponsored by Maker and DAI, physical workshops since in Latin America the use of cryptocurrencies is increasing due to inflation and this is the opportunity. I give an example of the country where I live, which is Venezuela, despite all the negative news of USDT, it is the most used currency for P2P exchanges, so the idea is to make DAI used organically in P2P trade, thus increasing the common use of DAI and we make more users want the opening of vaults. Even taking advantage of constitutional loopholes or making an agreement with the regulatory body in a country that urgently needs a budget is beneficial for Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.429082491582492
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#31",
                    "likes": "3",
                    "time": "05/10/2022-17:52:33",
                    "content": "    Nadia:  I don’t have an answer now, but it’s worth exploring how Bidali could interact with creator metadaos.   IMO, I can see folks like Bidali and others alike, participating as ecosystem actors. Each MetaDAO is free to buy services, or not, from ecosystem actors and other MetaDAOs. However, there’s always the possibility that you can also evolve and form a Creator cluster that competes against these platforms. At least this how I envision it.     Moi:  but let’s remember that currently the population is not fully educated   This seems to be the theme here in Colombia. I have been told that the education barrier is what needs to be improved the most. And here, they are making an effort to make sure children to go to school, and even provide incentives to make sure they do. Perhaps focusing on educating the youth will lead to better results. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.263888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#32",
                    "likes": "1",
                    "time": "05/10/2022-21:05:38",
                    "content": "    Nadia:  In the end, people are looking for solutions, not for an overcollateralized decentralized stablecoin.   Completely agree! (and also @flipflopflapdelegate and @Moi’s comments). @Nadia I will DM you so we can set up a time to swap some notes and see how roadmaps may align. To share a bit more publicly…     Nadia:  Also true, gas fees are a problem, but also wrapped DAI. That’s why our focus is on developing canonical DAI markets.   We’ve also quietly expanded our relationships globally and have expanded the network support. We have connections to other protocols that are interested in supporting bridging. I’ve been floating the idea of bringing DAI over to Solana or Stellar and there are grant opportunities to make that happen. We’ve also been discussing/evaluating bridges and L2s extensively over the last couple years. Currently we support 9 different networks (website will be updated soon but you can see on our giftcard website) and are soon to add Cosmos and then likely Arbitrum and Optimism. We’re paying very close attention to ZkPs and their applications. Would be keen to support in any way we can.     Nadia:  And btw, if you are in Argentina, you don’t want to spend DAI, you want to save DAI and spend in ARS, you always want to get rid of the most devaluated currency.   Completely agree. We’ve tried every possible option. Currently we use Settle to convert USDC to ARS or enable our people to convert and have had discussions with some of the other crypto banks to onboard more businesses. Took 2 years to get to this state with them. Still challenges here but it’s the best rates/experience we’ve found so far.     Nadia:  When we started, this was true, now, cryptocards/cryptobanks have changed the game. They offer the end to end solution with products that look alike other banks, transforming themselves into Fintech solutions and not a niche crypto product. Of course, gift cards are part of the solution, but I want to point out the amazing work these cryptobanks have done in adoption.   Also agree. Despite the challenges there has been incredible progress!  The challenge we’ve seen with these structures in general is that Visa/MC and local debit rails have bad FX rates and/or the fees are too high. As capital controls, inflation and capital flight in Argentina gets worse, this issue will also get worse and I suspect that a lot of these institutions will likely be shut down. The government already quashed some of the banks ability to support crypto within 1 day of announcing, because of the IMF pressure. In the long term we see the black market prevailing just like in Venezuela but this means higher costs for users that are a step backward. There are ways around this. Some that are more specific to LatAm but my fear is that most of the blatantly crypto native and centralized firms will continue to face tough challenges with banking and regulations. I would be much happier to be wrong here so please correct me if you think my view is too pessimistic.  There is also some overlap here with the discussions in Cryptocurrencies and credit cards. But for these reasons (and others in the credit card discussion) this is why we’re working on a crypto-native credit card and gift card alternative. Allows us to expand much more quickly and align with the P2P ethos. fwiw our end game at Bidali is and always has been to disrupt ourselves from the inside out. I think value accrual will occur at the protocol, smart contract and token level (if designed right) so our intent is to progressively decentralize and open source the toolset. This is impossible to do with gift card issuers and cryptobanks today and requires completely new technology, thinking and maybe even regulations. Our approach has been to start off regulated and centralized from an operational aspect, in the best jurisdiction we can find so that we earn trust and have an easier time integrating with banks and businesses to help onboard them to P2P transaction flows. If you’re not regulated and there aren’t incentives for banking (the fiat gateways required to use crypto as money today) then it is very difficult or slow to get people into the crypto economy. This is why speculation has been such an important driver, despite these challenges. The opportunity to make large returns offsets the ridiculous conversion fees. But when people come to crypto via speculation, they are much less likely to use it as money. Some do, but it’s a psychological issue due to a bunch of cognitive biases. This is why we think centralization and incentive alignment is initially very important for the money use case, and this is something that Circle and Tether have done a good job at. So while we employ a similar approach operationally (for now), at the same time we’ve been building our core tech as decentralized and P2P as possible. With time, this enables us to begin to open source pieces of the technology bit by bit and enable P2P economies and strong network effects that dramatically improve financial access and raise the GDP of the planet. This is the opposite of Maker which started off decentralized, and has been (arguably) more centralized as of late. Especially with regards to RWA. To me, decentralization only becomes possible at scale and to start off decentralized is much less likely to succeed, especially for real world payments that have to bridge between existing centralized, highly regulated and critical infrastructure. So it requires economies of scale that are directly correlated to the global distribution and diversity of payment network usage moreso than the governance and technology developers. We’ve been very intentional with how we’ve gone about this, from who we raised capital from, how much we’ve raised (very little), who we partner with, and how noisy we are about cryptocurrency (because it impacts the ability to work with brands, banks and even government at this stage). IMHO so far the introduction of most fiat on/off ramps has just added more intermediaries and costs to our financial the system, not less. This is something we are not willing to repeat and why we’ve chosen specific business models that ensure onboarding into and spending with crypto is actually cheaper than the status quo. While there have been some meaningful wins, particularly in countries facing high inflation or that lack adequate financial access, my present view is we are just reinventing the wheel and making our existing financial system worse. Especially since many of the on/off ramps are financially and/or legally obligated to continue with that structure. This is why we have avoided partnering with Visa/MC/PayPal. A bit of a long rant, but hopefully this shares more context around how we’re thinking about things and how it could align with Maker. This is why I’ve come back and been so active as of late. I see how DAI is uniquely positioned to help enable a better financial system, if the path is charted correctly. Looking forward to discussing!  ",
                    "links": [
                        "https://www.settlenetwork.com/",
                        "https://www.coindesk.com/policy/2022/05/13/argentina-was-at-the-cusp-of-a-crypto-boom-the-central-bank-had-other-plans/",
                        "https://forum.makerdao.com/t/cryptocurrencies-and-credit-cards/16737",
                        "https://forum.makerdao.com/t/crimson-creator-cluster/18241/8"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.426643763566032
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#33",
                    "likes": "1",
                    "time": "05/10/2022-21:34:01",
                    "content": "    ekryski:  There are ways around this. Some that are more specific to LatAm but my fear is that most of the blatantly crypto native and centralized firms will continue to face tough challenges with banking and regulations. I would be much happier to be wrong here so please correct me if you think my view is too pessimistic.    Governments only want their own benefit, talking to SUNACRIP, which is the entity in charge of cryptography in Venezuela, would be a good step so that they at least take into account the use of DAI in government platforms such as PetroApp or increase liquidity in centralized exchanges. pro-government such as CoinCoin X, or only allow talks by third parties or users of DAI or Maker located in the country, only so that the population becomes aware of which is the safest stable currency, it is not a fast path but it is a necessary path.   Sumarium - Información – 21 Jun 22   BCV inyecta USD 120 millones para contener el alza del dólar - Sumarium -... El Banco Central de Venezuela (BCV) incrementó este martes 120 millones de dólares la venta a la banca…      To combat inflation, the government continually injects dollars into the banks so that the value of the dollar continues to be on a par with the Central Bank and not the parallel dollar or the black market dollar (which is practically a supply and demand and is the one that everyone Venezuelan USA) just imagining that DAI has made a loan with an interest rate in a country that urgently needs to decentralize its economy, it is curious. The cons that I see is the political propaganda that Maker can receive, apart from this the most powerful people or the most successful companies always do business with the good and the bad of the film. ",
                    "links": [
                        "https://sumarium.info/2022/06/21/bcv-inyecta-usd-120-millones-para-contener-el-alza-del-dolar/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.413194444444445
                }
            ]
        }
    ]
}