{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/tesla-taps-makerdao-powered-lender-for-7-8m-real-estate-deal/14543",
            "title": "Tesla Taps MakerDAO-Powered Lender for $7.8M Real Estate Deal ",
            "index": 14543,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "5",
                    "time": "10/04/2022-11:39:45",
                    "content": "How did I miss this article (link below) ? I did have a busy couple of weeks and this one admittedly got past me. This is great news! And, even the article is quoting the forum! It says: \"MakerDAO forum-goer ‘aburban90’ responded to the news, commenting ‘we… closed our first deal with Tesla yesterday? Smells bullish.” I love it! Let’s keep going! Onward and upward!    The Defiant – 1 Apr 22    Tesla Taps MakerDAO-Powered Lender for $7.8M Real Estate Deal - The Defiant Tesla is financing a repair center with a MakerDAO-powered loan.  Est. reading time: 2 minutes       ",
                    "links": [
                        "https://thedefiant.io/tesla-makerdao-loan/",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-4/14770",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-7-13-2022/14624"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2978515625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#2",
                    "likes": "7",
                    "time": "10/04/2022-11:46:05",
                    "content": "Maker hasn’t done any deals with Tesla, so this is really bad journalism. If you deposit (lend) to a bank and that bank then does a deal with Tesla, did you then do a deal with Tesla? I heard people saying Tesla was upset about it, but don’t actually know if that’s true. It’s certainly proof that reporters read our forum and wrote things with no context or understanding. The first version of this article even said Rune was the name of an anon, but they appear to have fixed that. Then lesson is probably that we need a press office. In this case it’s not clear the reporter even tried to contact anyone, though. So maybe it wouldn’t have helped ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.11734693877551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "1",
                    "time": "10/04/2022-11:55:05",
                    "content": "LOL.     AliceinMKRland:  It’s certainly proof that reporters read our forum and wrote things with no context or understanding. The first version of this article even said Rune was the name of an anon, but they appear to have fixed that,   Yes and I saw the correction. Unfortunately, the lack of due diligence on the journalistic side is nothing new but at least put something in there that you tried to contact all parties for comment. That is a standard CYA move. Overall I have noticed many crypto related articles seemingly “miss the ball” when it comes to developments in the space and it gets butchered. At that point it’s like playing a game of telephone and the true facts eventually fade away. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.366303339517625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "2",
                    "time": "10/04/2022-15:44:16",
                    "content": "That’s tabloid press, but now Maker’s name will be spread more widely.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#5",
                    "likes": "1",
                    "time": "10/04/2022-17:07:35",
                    "content": "That is true. And while it could be written better, it shows that Maker is a growing presence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#6",
                    "likes": "0",
                    "time": "10/04/2022-21:26:06",
                    "content": "Bad MKT doesn’t exist right?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.9642857142857144
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#7",
                    "likes": "2",
                    "time": "10/04/2022-21:33:10",
                    "content": "    AliceinMKRland:  Then lesson is probably that we need a press office.   Totally agree. It will be a must on the plans of Growth if they want to reach more presence into mainstream media, cases of use & users for DAI & MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#8",
                    "likes": "0",
                    "time": "10/04/2022-22:32:59",
                    "content": "Sounds reasonable to me. It would help separate fact from fiction and help onboard. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#9",
                    "likes": "4",
                    "time": "11/04/2022-00:24:47",
                    "content": "    nahueth:      AliceinMKRland:  Maker hasn’t done any deals with Tesla, so this is really bad journalism. If you deposit (lend) to a bank and that bank then does a deal with Tesla, did you then do a deal with Tesla?  I heard people saying Tesla was upset about it, but don’t actually know if that’s true. It’s certainly proof that reporters read our forum and wrote things with no context or understanding. The first version of this article even said Rune was the name of an anon, but they appear to have fixed that. Then lesson is probably that we need a press office. In this case it’s not clear the reporter even tried to contact anyone, though. So maybe it wouldn’t have helped    Totally agree. It will be a must on the plans of Growth if they want to reach more presence into mainstream media, cases of use & users for DAI & MKR.   Only fair to note that this is on the plans for Growth! See this thread: The Maker Brand Team - #15 by MarianoDP, and in particular the bit about announcements: \"Within the announcement process, apart from the multimedia assets, a clear Public Relations plan must also be developed, where the purpose is to help outline the key objectives for the organization and how we want our brand to position itself in the market. Public relations helps manage perception by giving the brand clear business objectives by developing and driving the main stories to be told… Each announcement will be taken as a mini-project where resources will be assigned with a specific cost limit for each element. These elements will form “packages” that range from a simple tweet to videos, twitter spaces, and other activities to coordinate with communication agencies that we will hire.\" ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.465367965367966
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#10",
                    "likes": "1",
                    "time": "11/04/2022-00:29:36",
                    "content": "Thanks for the link. Looking forward to digging in! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#11",
                    "likes": "1",
                    "time": "11/04/2022-01:22:34",
                    "content": "Si existe una combinacion entre perfil visionario y analitico se encarna perfectamente en @MarianoDP Surely tonight I will read in depth this post to know & understand their plan and perspectives. Thanks for appointing it my fren! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#12",
                    "likes": "2",
                    "time": "13/04/2022-17:00:15",
                    "content": "    AliceinMKRland:  In this case it’s not clear the reporter even tried to contact anyone, though.   There were definitely no signs of contact by the journalist (at least on my end) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#13",
                    "likes": "1",
                    "time": "13/04/2022-17:23:40",
                    "content": "That’s poor journalism. Sometimes Journalist put that little sentence in there that they asked for comment when they really don’t anyway. Here they didn’t even bother to do that. Oh well, I suspect it could be worse. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.015625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#14",
                    "likes": "1",
                    "time": "13/04/2022-19:12:39",
                    "content": "I’m sure it’s common. But I also expect The Defiant to have a set of guidelines for credibility when publishing. At least a message, conversation, etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#15",
                    "likes": "0",
                    "time": "13/04/2022-19:40:49",
                    "content": "Yes, exactly. Seems there was not much due diligence prior to publication. They had originally quoted Rune as being anon. They note the correction in the article I believe but to me that’s just more evidence of being sloppy. While it might not be applicable here, there are possible legal consequences when putting some things in print so one would expect a little more preparation. Anyway, I remain bullish on Maker! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.704166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#16",
                    "likes": "2",
                    "time": "13/04/2022-19:44:17",
                    "content": "Very nice. This really flew under the radar for a bit. Great publicity, great exposure for Maker! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#17",
                    "likes": "0",
                    "time": "13/04/2022-19:57:33",
                    "content": "It is publicity for sure, whether it’s good or bad is for the greater community to discuss. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ]
}