{
    "poll_list": [
        {
            "title": "Investigate Implementation of a Notional Finance D3M - March 28, 2022",
            "index": "13782",
            "option": "No (Defer)",
            "supporting_mkr": "64,835",
            "highest_fraction": 0.47
        },
        {
            "title": "Investigate Implementation of a TrueFi D3M - May 2, 2022",
            "index": "14563",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "106,649",
            "highest_fraction": 0.95
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782",
            "title": "[Signal Request] Onboard D3M For Notional Finance ",
            "index": 13782,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-rejected",
                "d3m",
                "notional-finance",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#1",
                    "likes": "13",
                    "time": "09/03/2022-16:55:02",
                    "content": "Context The DAI Direct Deposit Module (D3M) was first introduced by @EthWarrior (of Aave) in April of 2021, with @hexonaut (of Maker Protocol Engineering CU) quickly following up with MIP50 to get governance approval for the concept. The Aave D3M went live in early November 2021. Since then, it has been widely considered a success for the Maker protocol, both strategically and economically, with a maximum approved deposit on Aave of 300,000,000 DAI. @GFXlabs followed with a successful proposal to create a Compound D3M, which is nearing completion and should be implemented in the coming weeks. There has also been a successful proposal to create a Maple Finance D3M. It is now recognized that D3Ms can sustainably increase Maker revenue in a fashion that serves the strategic goals of harmonizing DAI borrow rates across DeFi and solidifying MakerDAO’s position as key infrastructure to the DeFi markets. Direct deposit modules also provide a new tool for Maker to apply its deep expertise in engineering and on-chain risk assessment to ensure swift and safe growth of DAI supply.  1066×722 203 KB  Maker revenues have been drifting back towards summer lows (Source: TokenTerminal) With Aave, Compound, and Maker’s own overnight DAI borrowing rates firmly under the protocol’s influence, the next logical step is to exert conservative influence over the shortest portion of the yield curve – out to 3 months. This makes Notional Finance an ideal choice to be the first of several D3Ms targeting the short end of the credit curve. Signal Request GFX Labs is signaling to onboard a D3M for Notional Finance’s 3-month-maturity DAI lending pool, with an initial debt ceiling of 10 million DAI (unless recommended otherwise by Risk Core Unit). About Notional Finance Notional Finance operates a fixed-rate, overcollateralized lending platform. It currently operates with four assets: ETH, WBTC, USDC, and DAI. Currently supported maturities for DAI are at 3 months, 6 months, and 12 months (this signal is seeking to onboard the 3-month maturity). As of writing, the yield curve for DAI is an inverted humped curve, meaning the rates are lowest in the middle. This is a sign of short-term demand outstripping short-term supply.  1600×709 94.8 KB  Top to bottom yield curves: DAI, USDC, WBTC, ETH At its core, Notional’s model is the familiar overcollateralized lending model. Users lock collateral, which can also be lent for interest, which then secures the loan the borrower takes out. The main difference between a user locking ETH in a Maker vault to borrow DAI and that same user locking ETH in a Notional pool to borrow DAI is that Notional’s platform has a fixed term, at which payment is due, and governance cannot alter the fees that accrue to the borrower. Functionally, Notional is a marketplace for zero-coupon bonds, whose discount to face value provides the rate of interest. Notably, Notional offers the opportunity for lenders to withdraw early, subject to the available liquidity in an underlying pool for that purpose. Just as in traditional finance, where the market sale of a bond can incur interest rate risk and exposure to general supply/demand dynamics for that issuance, an early exit may expose that lender to losses or gains. A rise in prevailing interest rates, for instance, is likely to exert downward pressure on the price of the bond, and vice versa. From Maker’s perspective, rising rates would likely trigger an increase in D3M deposits (in order to suppress rates to the targeted rate) while any withdrawals would likely come when the underlying debt had appreciated. For the sake of simplicity, though, we suggest Maker develop its strategy with the intention of holding its loans to maturity when possible. Pros:  Increased revenues. As of writing, the 3-month rate on Notional is north of 7%, on a base of around 85m DAI. For example, even a trial 10m DAI DC would firmly put a Notional D3M in the top 10 ilks by revenue. (10m DAI is currently estimated to suppress rates only to 6% as of writing)   1378×274 48.8 KB  For reference, estimated yearly revenue from other top ilks are below:  1600×975 250 KB    Increased control over the front end of the yield curve. Strategically, Maker’s use of D3Ms across multiple lending venues will exert control over more of the total market, dampening effects of fragmented liquidity for DAI, as well as volatility during market downturns. Being fairly insensitive to gas costs, Maker’s D3M for Aave has allowed for steady DAI rates even in the face of intense volatility. That stabilization can be applied to the very shortest portion of the yield curve as well.   Diversification of counterparties. Maker currently faces existential risk from a variety of counterparties: Circle, Lido, Bitgo, Paxos, and occasionally Aave. By both growing DAI supply and increasing the rate by which the Surplus Buffer grows, a program of diverse D3Ms advances the goal of reducing excess reliance on individual counterparties.   Familiar credit risks and technological risks. The risks represented by exposure to Notional’s overcollateralized lending platform (listed under Cons) are risks that Maker has deep expertise in evaluating and monitoring through Collateral Engineering Services, Risk, and Protocol Engineering Core Units.   Reduced reliance upon stablecoin collateral. As of writing, the DAI supply is 68% backed by stable collateral, the bulk of which is 5,300,000,000 USDC and nearly 500,000,000 USDP. D3Ms have the ability to scale quickly, and are limited only by the depth of the markets they are deployed in, allowing them to grow as demand for DAI on the lending platform grows. Not only does this increase DAI supply, but it should also lower the demand for the PSMs, as there are alternative methods of obtaining DAI.    852×274 178 KB  Cons:   Smart contract risk. There is always smart contract risk with any protocol-to-protocol interaction. Steps to mitigate this for Notional include an audit by ABDK, a $1,000,000 bug bounty program on Immunefi, analysis via Code4rena, formal verification via Certora, and a pending diligence report by Consensys.   Multisig risk. Notional’s governance mechanisms are still in the early stages of decentralizing. At the moment, key portions of the protocol are governed by a 3 of 5 multisig. No firm timeline is set, but over time, the multisig’s admin powers are intended to be phased out. A possible mitigant of risk to Maker is that one of its delegates (GFX Labs) is one of the signatories, and all signatories are fully doxxed. Note that other underlying collaterals already in Maker’s portfolio also include governances with multisigs, so this is not a novel form of risk.   Illiquidity risk. If the amount of DAI in the liquidity pool drops due to LPs withdrawing their capital, there may be insufficient liquidity for Maker to withdraw 100% of its capital prior to maturity. It should be noted that Maker will always be able to withdraw its capital upon maturity regardless of the liquidity in the pool. This illiquidity risk only refers to withdrawals prior to maturity. To mitigate this, a gradual scaling of maximum exposure can keep this in mind.   Capital loss risk. If liquidations do not perform properly, there is the risk of capital loss. Notional has built a robust liquidation infrastructure and currently utilizes conservative parameters. Being an overcollateralized lending platform, the risk of bad debt stemming from default is in principle low. While probably unnecessary for Maker, there is also coverage available for Notional under Nexus Mutual.   Oracle risk. Notional utilizes Chainlink oracles for the four listed assets. Maker is already exposed to Chainlink oracles via Aave and (soon) Compound.   Detailed Reading Website for Notional Notional Dashboard (entire protocol) Notional Dashboard (3-month DAI pool) Notional Github Notional v2 Documentation Understanding Notional v2 Liquidations ABDK Audit Notional Governance Forum D3M Risk Assessment (Aave) D3M Risk Assessment (Compound) MIP50: Direct Deposit Module Disclosure Notice: GFX Labs is a signatory on Notional Finance’s governance multisig. Because of this conflict of interest, GFX will be voting “abstain” for on-chain polls related to this and subsequent proposals about Notional. This policy does not extend to executive spells, which typically are a bundle of protocol changes and have security implications if not executed.    Should Maker Implement DAI Direct Deposit Module For Notional Finance (3 Month Maturity)  Yes No Abstain     0 voters     Next Steps This poll will close on 2022-03-23T16:00:00Z. If this signal is successful, an on-chain poll will present this proposal to MKR holders. If this signal is unsuccessful, no further action will be taken. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip50-direct-deposit-module/7356",
                        "https://mips.makerdao.com/mips/details/MIP50",
                        "https://makerburn.com/#/collateral/direct_aavev2_dai",
                        "https://forum.makerdao.com/t/signal-request-should-maker-prioritize-onboarding-a-compound-d3m/11997",
                        "https://forum.makerdao.com/t/signal-request-maker-accessing-pools-of-institutional-loans-through-maple-finance/12349",
                        "https://notional.finance/",
                        "https://notional.finance/lend/DAI",
                        "https://github.com/notional-finance/contracts-v2/blob/master/audits/ABDK%20-%20Notional%20V2%2C%20Sept%201%202021.pdf",
                        "https://immunefi.com/bounty/notional/",
                        "https://code4rena.com/reports/2021-08-notional/",
                        "https://github.com/notional-finance/contracts-v2/blob/master/audits/Certora%20-%20Formal%20Verfication%20Report%2C%20Nov%201%202021.pdf",
                        "https://etherscan.io/address/0x22341fB5D92D3d801144aA5A925F401A91418A05#readProxyContract",
                        "https://blog.notional.finance/understanding-liquidations/",
                        "https://forum.makerdao.com/t/d3m-risk-assessment/9353",
                        "https://forum.makerdao.com/t/compound-d3m-risk-assessment/12580",
                        "https://notional.finance/",
                        "https://info.notional.finance/",
                        "https://info.notional.finance/dashboard/active-market/details?marketId=2:1648512000:1648512000",
                        "https://github.com/notional-finance",
                        "https://docs.notional.finance/notional-v2/",
                        "https://blog.notional.finance/understanding-liquidations/",
                        "https://github.com/notional-finance/contracts-v2/blob/master/audits/ABDK%20-%20Notional%20V2%2C%20Sept%201%202021.pdf",
                        "https://commonwealth.im/notional",
                        "https://forum.makerdao.com/t/d3m-risk-assessment/9353",
                        "https://forum.makerdao.com/t/compound-d3m-risk-assessment/12580",
                        "https://mips.makerdao.com/mips/details/MIP50",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-2-9-2022/13804",
                        "https://forum.makerdao.com/t/relay-semanal-22-28-de-marzo-de-2022/14333",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/10",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-2/14201",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-marzo-de-2022/14181",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-39-d3m-for-notional-finance-signal-request-discussion/13828/2",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-10-16-2022/13977",
                        "https://forum.makerdao.com/t/weekly-relay-march-22-28-2022/14300",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-39-d3m-for-notional-finance-signal-request-discussion/13828",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/47",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-28-de-marzo-de-2022/14308",
                        "https://forum.makerdao.com/t/collateral-status-index/2231"
                    ],
                    "GPT-summary": "The post proposes the onboarding of a DAI Direct Deposit Module (D3M) for Notional Finance's 3-month-maturity DAI lending pool, with an initial debt ceiling of 10 million DAI. The proposal explains the benefits of using D3Ms to increase Maker revenue, exert control over the front end of the yield curve, diversify counterparties, and reduce reliance on stablecoin collateral. The post also lists the potential risks and mitigating factors associated with the proposal. The post is written by the author of the proposal and includes constructive criticism from third parties, as well as an invitation for collaboration and questions.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Interoperability and Scaleability",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.515353110941346
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "09/03/2022-17:17:37",
                    "content": "Have not Polled, yet–but I like your thinking. I don’t know much about Notional, is there an opportunity to earn NOTE tokens when supplying DAI? Also, did you get a chance to run this idea by Risk, PECU, and others? If so, can you please provide some color. And last question–do you know why their TVL has dropped almost 45% over the last month of so? If not no worries. Thank you in advanced. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "7",
                    "time": "09/03/2022-18:23:15",
                    "content": "I voted No While D3M has been successful with AAVE and this might provide some return for lending out Dai, D3M should be integrated very carefully as the potential loss of the fund will have to be covered by the Maker protocol. Based on what I understand, Notional Finance has launched less than a year ago. So even if audits, there might be exploits that haven’t been found yet as it’s still very early. Also, TVL is 500 million according to DeFillama but the governance token (NOTE)'s marketcap is only $6.8 million (!) according to Coingecko. Their marketcap is even less than 10 million Dai that’s being asked. This can open up to various governance challenges. Therefore, it seems too early and risky for the Maker protocol to onboard D3M for Notional Finance at this moment ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.234848484848484
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twoodward",
                    "index": "#4",
                    "likes": "6",
                    "time": "09/03/2022-19:03:58",
                    "content": "Hi @flipflopflapdelegate , Teddy from Notional here. Lending fixed on Notional is not incentivized. The yields offered for lenders are organic and independent of token incentives/prices. With respect to Notional’s TVL, we saw some volatility with the amount of liquidity in the platform in the early days since launch as liquidity providers evaluated the opportunity and short-term LPs left. But protocol liquidity has found an equilibrium level and has been steadily increasing along with loan volumes for the last six weeks or so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#5",
                    "likes": "2",
                    "time": "09/03/2022-20:44:34",
                    "content": "Agreed— too early. Maker isn’t a desperate project, it can wait. The damage from a flop is huge, beyond the loss of the DC. Equally important, there is a large conflict of interest between the proposing delegate of the signal request, GFX, who is a controller of the notional multi-sig and stands to gain significantly from this proposal at MakerDAO’s expense-- governance-as-a-service pork barrel politics. Can you please describe the financial exposure of GFX to Notional tokens relative to your MKR position? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.555803571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#6",
                    "likes": "11",
                    "time": "09/03/2022-21:16:16",
                    "content": "I would like a “yes, but later” option. I’d prefer us to onboard first Maple and Compound (because they were approved and are in our pipeline) and in the meantime, they have time to work on the multisig risk ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#7",
                    "likes": "2",
                    "time": "09/03/2022-21:16:48",
                    "content": "Seconded on “ yes but later” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#8",
                    "likes": "3",
                    "time": "09/03/2022-21:59:09",
                    "content": "Is it possible that using a term lending module type mechanism would be more suitable?     MIP43 - Term Lending Module (TLM) Archive   MIP43: Term Lending Module (TLM)  Preamble MIP#: 43 Title: Term Lending Module (TLM) Author(s): Alberto Cuesta Cañada (@acuestacanada), Lev Livnev(@equivrel), Allan Niemerg (@niemerg) Contributors: n/a Type: Technical Status: Formal Submission Date Proposed: <2021-01-21> Date Ratified: <yyyy-mm-dd> Dependencies: n/a Replaces: n/a License: AGPL3+   Disclosure This MIP proposes an integration with Yield Protocol. Authors Allan and Alberto are employees of Yield, Inc. a company working to build Yi…     I’d also be concerned about scalability - how much work will it require to onboard a D3M for fixed rate instruments, and could Maker expect to earn enough to cover the costs given the relatively short timeframe when this would be active (before notes mature and a new version must be deployed for the next maturity date)? ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-march-2022/14424"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.605429292929292
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twoodward",
                    "index": "#9",
                    "likes": "2",
                    "time": "09/03/2022-22:20:54",
                    "content": "I won’t comment on the term lending module, but I will comment on scalability: Notional’s fixed income instruments are built on the ERC1155 standard, not the ERC20 standard. This means that one single token contract manages all current and future fCash maturities. Notional doesn’t manually deploy new maturities, they automatically open up upon each quarterly roll. This makes integration with Notional much simpler - you only need to approve one token contract. You will need to submit a transaction to roll your position forward upon maturity, but you shouldn’t need to make any changes to your smart contracts. So I think scalability in the sense you’re flagging should not really be a concern. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.199675324675325
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#10",
                    "likes": "1",
                    "time": "10/03/2022-02:31:11",
                    "content": "While I agree that Compound and Maple should come before Notional, my overall concern here is on timing. We have a wide ranging opportunity to increase fees and revenue, against the backdrop of ever increasing costs, with a protocol like Maple, which provides a “backdoor” for institutions to Maker financing. But it seems like neither Compund’s nor Maple’s D3M is progressing. Why is that?  If it’s a matter of no one (yet) taking responsibility to sheperd them through that’s one thing. Yet is there another impediment blocking their implementation (outstanding reviews from a relevant CU, say)? FWIW, I – a lowly MKR holder – do not have insight as to the delay. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#11",
                    "likes": "20",
                    "time": "10/03/2022-02:46:28",
                    "content": "Quick comment here on existing progress. Re: Compound D3M, this is progressing but involves a fairly significant rewrite to make it modular and scalable for future implementations. This is quite a departure from the way the existing Aave D3M is written - our new implementation decouples the Maker protocol-side code from the 3rd party implementation which means other teams (such as CES) will be able to take it and scale to any number of other integrations is an fairly easy manner - this saves a lot of time, effort and mainly security concerns in the long run. PECU is currently working on this codebase and plans to have code finalised by the end of the month, following which we will get it audited, which typically takes a month and so is expected to be wrapped up by the end of April. Re: Maple, they are actively working on an updated codebase that we will be helping provide input for a smooth integration, CES or PE will then provide technical assessments alongside the Risk team. Audits will then be provided so again, expect a mid/end Q2 delivery pending 3rd party development and audits. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.411174242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#12",
                    "likes": "0",
                    "time": "10/03/2022-03:26:21",
                    "content": "Much appreciate this update, Derek!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#13",
                    "likes": "2",
                    "time": "10/03/2022-03:34:29",
                    "content": "    Tosh9.0:  FWIW, I – a lowly MKR holder – do not have insight as to the delay.   Point well taken! We are working on better communications here. This is the start of revising the collateral onboarding process. MIP6c3-SP2: Subproposal for changing the collateral application form. More on the way very soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#14",
                    "likes": "0",
                    "time": "10/03/2022-08:16:32",
                    "content": "I was always a big fan of term lending and I’m betting it will be key in 2022. The Notional opportunity is very strong but small-scale and very time-sensitive. So i’m not betting on MakerDAO here. If we want to play first-in-first-out, MIP43 is approved for a year now and comes with the code. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.9541666666666675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#15",
                    "likes": "1",
                    "time": "10/03/2022-10:41:58",
                    "content": "Thank you for the initiative and write up here @GFXlabs I think given the work on the plate a real co-ordinated focus on bringing up new things that have the highest bank for productivity buck here. I abstained but am like ‘maybe later if notional is bigger’. Echoing comments I agree with:     monet-supply:  I’d also be concerned about scalability - how much work will it require to onboard a D3M for fixed rate instruments, and could Maker expect to earn enough to cover the costs given the relatively short timeframe when this would be active (before notes mature and a new version must be deployed for the next maturity date)?       Nadia:  I would like a “yes, but later” option. I’d prefer us to onboard first Maple and Compound (because they were approved and are in our pipeline) and in the meantime, they have time to work on the multisig risk       Doo_StableLab:  Also, TVL is 500 million according to DeFillama but the governance token (NOTE)'s marketcap is only $6.8 million (!) according to Coingecko. Their marketcap is even less than 10 million Dai that’s being asked. This can open up to various governance challenges. Therefore, it seems too early and risky for the Maker protocol to onboard D3M for Notional Finance at this moment   This part is interesting:     MadShills:  Equally important, there is a large conflict of interest between the proposing delegate of the signal request, GFX, who is a controller of the notional multi-sig and stands to gain significantly from this proposal at MakerDAO’s expense-- governance-as-a-service pork barrel politics. Can you please describe the financial exposure of GFX to Notional tokens relative to your MKR position?   My general take here is that ‘provided’ PECU can get the modular aspect on line and tested and we get others going first then we can look again later at a proposal. Biggest issue is notional seems small.  I like the idea of 6% on 10M though so worth considering…  While I am a ‘maybe later’ person I am a ‘no not now’ which is why I am going to switch from abstain to no atm because Maker isn’t ready and Notional seems kinda small in terms of what Maker will earn for the effort but expect later on Maker may really need revenue streams and this is a great candidate I think. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.545884262796028
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#16",
                    "likes": "3",
                    "time": "10/03/2022-12:00:28",
                    "content": "I think in terms of conflict of interest, @GFXlabs shared their disclosure so I wouldn’t be so critical. Afterall, whether it’s presented by GFXlabs or the Notional Finance team itself or unknown member, it’s ultimately up to the Maker community to assess whether it’s a good intitiave.     GFXlabs:  Disclosure Notice: GFX Labs is a signatory on Notional Finance’s governance multisig. Because of this conflict of interest, GFX will be voting “abstain” for on-chain polls related to this and subsequent proposals about Notional. This policy does not extend to executive spells, which typically are a bundle of protocol changes and have security implications if not executed.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.309523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#17",
                    "likes": "5",
                    "time": "10/03/2022-14:54:33",
                    "content": "Posted a similar thing before on discord, but will post here how it relates to Notional Finance. In terms of integrating with other protocols there are a few possibilities for Maker, which each have various trade-offs. I’ve made this table below to explain my thinking. *Note that the risks are heavily simplified for arguments sake.     Method Description Risks for users* Risks for Maker*     Regular collateral onboarding The relevant token does not have any special features, and can be onboarded as an erc20. E.g.: MANA, LINK, YFI, UNIV2 LP tokens. No special implementation required. Risks associated with this token & relevant protocol itself Risk that with liquidation not all DAI is made whole.   GUNI type abstraction method The protocol (e.g.: UniV3) does not have erc20’s that can be easily integrated. A third party (e.g.: Gelato) writes an abstraction in an erc20 that can be onboarded in Maker. Risks associated with the underlying protocol, as well as risks associated with the abstraction contracts. Risk that with liquidation not all DAI is made whole.   CropJoin type abstraction method The protocol (e.g.: Curve LP tokens), have something special that disallow regular collateral onboarding. Maker writes an adapter that makes it possible to integrate with these collateral types anyways. Risks associated with the underlying protocol, as well as risks associated with the adapter contracts. Risk that with liquidation not all DAI is made whole.   D3M method Maker doesn’t onboard the collateral from the third party protocol, but sprays DAI straight into the protocol. Maker writes this integration. N/A → D3M is protocol to protocol, no user can benefit. Risks associated with the underlying protocol, as well as risks associated with the D3M integration.    All in all, I think the D3M method, even if it is made more generic, is not the best way to reach more scale in DAI supply, as it has the effect of tying the Maker protocol to all the risks associated with the relevant protocols. Personally I think that all of these methods should be used, and it should be determined on a case by case basis what fits best. I do think there is a ton to gain from GUNI type abstractions - and I even think that Maker should create grants for creating these abstractions to third parties willing to build them. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6c3-sp2-modify-the-collateral-application-form/13787/9"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9817323481116595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#18",
                    "likes": "5",
                    "time": "10/03/2022-16:37:42",
                    "content": "We will leave questions about Notional itself for them to answer, but we do want to take a moment to clarify a few things.     Nadia:  I would like a “yes, but later” option.       twblack88:  Seconded on “ yes but later”   The purpose of this signal is to see if there is interest to explore a D3M for Notional. There is no intention to “jump the line” – and PE or CES is typically assumed to have wide discretion at the level of prioritization in their to-do lists. We hope anyone who thinks “yes, but later” understands that would be a “yes” vote here. Note this is to onboard a D3M rather than prioritize a D3M over other tasks.     monet-supply:  could Maker expect to earn enough to cover the costs given the relatively short timeframe when this would be active   Perhaps you meant differently, but this is a great opportunity to better state that these pools roll over, so it’s not a new D3M being built every 3 months. The rollover cost and effort is minimal.     MakerMan:  Biggest issue is notional seems small. I like the idea of 6% on 10M though so worth considering…    The 10m DAI maximum DC is requested because that is traditionally the “try it out and see” level of exposure Maker has used for new collaterals. There is already depth enough to increase beyond that 10m – and probably required to substantively lower borrow rates for DAI. But even the initial 10m DAI request would immediately make this D3M more profitable than 19 currently supported non-PSM ilks. It is also estimated to be the most profitable on-chain yield of any Maker ilk (only two small RWA vaults have higher than the estimated 6%). The revenues picture looks like this:  Screen Shot 2022-03-10 at 10.40.45 AM2512×980 173 KB  A D3M for Notional – as part of a portfolio of L1 and eventually L2 D3Ms – is more guaranteed to produce revenues from the moment of implementation than onboarding a new ilk for token collateral or RWA, both of which take time to see significant revenues. GFX feels that the current portfolio covers the base overnight lending in DeFi well with Aave and Compound, offers exposure to large institutional counterparties with Maple, and the fixed-rate, secondary lending market for DAI with Notional. Appreciate everyone’s feedback so far! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.294519874065329
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#19",
                    "likes": "2",
                    "time": "10/03/2022-16:37:55",
                    "content": "Conflicted Delegates This is an important point that I imagine will be addressed by the community and govalpha at some point – separation of powers and delegation. Simply disclosing a conflict of interest does not remove the conflict and does not improve bias. Whether the conflict is being a core unit member, an investor in a competing product, or a VC, combining these with delegation is a dangerous precedent. Governance motions have a real cost Simply raising a question or motion expends the energy of the community and directs governance, this has a real cost. Imagine if a delegate had a large financial interest to steer Maker in the wrong direction, creating signal requests would be a good way to stir up conflict, confusion, and misdirection. This is one way disinformation works, creating noise. Another way, is by legitimizing otherwise obvious questions. For example, “Should we extend a line of credit to an unproven new protocol with easily defined risks?” In this case, the conflict isn’t noise, just simple self-interest and clearly acknowledged in the post. If Notional gets the D3M, GFX stands to gain, just like the COMP D3M, hence, those two D3M have been proposed by GFX. Two protocol integrations that benefit projects they have personal relationships with and/or financial ties to. You do not see GFX proposing proposals for projects that do not benefit them (governance mining, comp D3M, notional D3M, etc.). At the end of the day, GFX is a for profit business performing an allegedly neutral role. We can not and should not expect their proposals to be solely in the interest of MakerDAO. GFX pays a forum member to watch Maker and figure out how to best take advantage of Maker for GFX’s own interests. Their interests include protocol interests, financial positions, and their bd/personal relationships. They should never be presumed to be a fan of maker or deeply aligned with MKR holders, since they are not MKR holders (as far as I understand, happy to be proven wrong). Skin in the game is important. Conflict is fundamental bias As Rune noted yesterday is in addressing Monetalis, he had a conflict, expressed it clearly and in a quantified way, and stated nothing he says should be taken as a neutral point. The same applies here. Signal Requests with questionable motives can be disinformation The problem is this proposal implies neutrality and no bias in its presentation. It also implies the author has done reasonable risk analysis. This is called “cooperative intent” in conversational logic. Everyone assumes the actor is proceeding in good faith and we all have aligned incentives, moving toward a common objective. When this happens, readers give the benefit of the doubt and seek to understand and make sense of the post, rather than review it critically. Disinformation and confidence men take advantage of this phenomena.  A signal request isn’t a big deal, it is just a signal request, right? This is not true in this case. A signal request would place a protocol ahead of others in receiving a line of credit from Maker, it would grant priority and favor to the integration above protocols who have not been proposed. If this signal passes it on-boards a D3M. I do not think this was the original intention of a signal request.  This means the investment of significant cash and time on Maker’s part and providing an advantage to notional amidst other early competing projects. Hence, it is directly relevant that GFX disclose their quantified financial incentives, and extent of personal relationships in bold at the top of the post, to clarify the motivation for their proposal. To my understanding, GFX holds no MKR and are a minor delegate.  With that in mind, the only way they can steer the DAO at the moment is through proposals and other soft power tools, such as the signal request we see here. Signal requests are governance tools and have real effects on the protocol, otherwise why would we have them? Raising a question is a meaningful act. For example, imagine a board member sits on two different banks, a large stable bank, of which they own no stock, and the newly formed bank their friend owns. They like their friend and want to help them out.  They prepare a board motion that would give the new risky bank a loan from the old stable bank. They submit the motion to the board, but suggest have a conflict, “ My friend owns the bank.” so they won’t vote, but they are still willing to prepare the documentation and raise the motion. Since the motion is already proposed, why doesn’t the board vote anyway? Something like this would have very real consequences in a corporate setting. In the example above, the question, “Should we give a risky loan to this new bank?” Would never be considered, the answer is obvious. The question is solely the product of misaligned incentives and conflict of interest by a board member. This is how disinformation works. Questions to whose answers are obvious (No.) become legitimized and normalized through conversational logic and cooperative intent (No/Maybe?). Review of delegation separation of powers It would behoove maker to look more carefully at the conflicts or interests with delegation, especially in a case like this where delegates have no skin in the game or are new entrants and hence, may care more about their own book acutely and less about the long-term health of the Maker protocol. It would also be a good thing to have standard expectations of disclosures and a process when conflicted delegates want to propose governance actions. MIPS and Signal Requests are powerful tools and should be treated as such.     GFXlabs:  Note this is to onboard a D3M   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.653154561487894
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#20",
                    "likes": "0",
                    "time": "10/03/2022-16:45:59",
                    "content": "GFX, In order to better understand the motivation of this Signal Request, could you please answer some of the following questions: Please clearly describe your financial and personal entanglements with Notional. Additionally,   Why are you one of the multisig signers? • What is involved in this role? • Who assigned GFX to this role? • Is GFX compensated in this role? • Does GFX receive any form of compensation from Notional?   What is the Notional policy on conflict of interest with other protocols?   Does anyone at GFX, or GFX itself, have a financial interest in Notional?   Does anyone at GFX, or GFX itself, have a financial interest in Maker?   Please describe the personal relationship between Teddy and Getty.    @twoodward If you are legitimately interested in a MakerDAO D3M integration, Please answer the above. This will to help us better understand the business arrangements and risk profile of the integration you wish us to enter into. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5673076923076925
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#21",
                    "likes": "7",
                    "time": "14/03/2022-19:41:35",
                    "content": "Many of us preach about increasing revenues, DAI supply, diversifying risk, and decreasing reliance on certain counterparties or stablecoins. Adding more D3Ms like Notional presents an opportunity to do just that. To those saying “Yes, but later”, a Signal Request essentially serves as a “Yes, but later” because this just indicates the community’s interest in investigating further. Knowing that the governance process is lengthy, combined with the fact that this would be third in the D3M pipeline, the reality is that this would not be implemented until many months from now. That would allow the Risk CU to analyze it thoroughly, the PECU to see how it fits into their roadmap, and us as the community to further investigate it by connecting with the Notional team, community, and users. Also, I don’t see @GFXlabs involvement with Notional (or other protocols, for that matter) as big red flags. I tend to see them as an indication of opportunities to expand Maker’s network. They’ve appropriately disclosed it and have constantly been trying to bring new integrations into the Maker ecosystem. In the current small world of DeFi, these interweaving collaborations are an advantage. I voted yes as a signal of interest to evaluate further and keep moving in the right direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.628156565656566
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#22",
                    "likes": "6",
                    "time": "15/03/2022-06:18:59",
                    "content": "Thanks ox, these would be just “opportunities to expand Maker’s network” if this was GFX proposing that Maker pay to host a networking brunch. Unfortunately, this proposal comes with real costs and real risks. Analysis costs money…notional should pay if they want it done. This is a potentially competitive protocol and governance as a service entity, seeking to give themselves a competitive advantage on Maker’s back, including a line of credit from MakerDAO. The upside for MakerDAO is not clear, performing this analysis and technical work is likely to cost more than the D3M Revenue annually. That is unless we dump a bunch of money in and in turn take on loads more risk. We also incur Analysis costs regardless of whether the D3M is on-boarded (technical, risk, governance time, etc), putting Maker in a weak position and a sunk cost fallacy. This sunk cost fallacy further increases the odds of on-boarding and taking a risky (bad) bet. We put ourselves in a weak position on behalf of a new and fragile protocol. Either we burned the money or we start pumping money into it and double down. And, opportunity costs. For every bad deal we take, we cannot focus on a good one or chase other options on the table. Why would we put ourselves in a position like this for little to no gain? I would rather our teams take a few days off to recuperate rather than waste a few days on this.  Not aligned…Why isn’t Notional the proposal author? GFX is not a MKR holder nor properly aligned with MKR holders. Notional, GFX, and their funders are not MKR holders (aside from Parafi). I am happy to be proven wrong but have not heard anybody address these issues in any substantive way. Why does Notional want this line of credit? What is it willing to offer? Why did they have GFX shill this instead of coming to us themselves with their own proposal, like the Yield TLM? The answer is because Notional is trying to leverage the advantage of GFX to appear as a cooperative ingroup member. The fact GFX has proposed this does not obfuscate the fact Notional is not offering Maker anything in return for the proposed arrangement Critical Analysis early saves us wasted resources later,  OR,  \"Killing bad deals before they go on chain.\" These are not neutral community members, but rather, external counter parties seeking a business deal solely to their advantage. There is no substantive benefit for Maker here, no real meat on the bone. We need to learn to push back, negotiate, and actually have some self interest. Instead, this proposal wants us to hand out candy for free, solely at our expense. Risk/ Technical analysis costs time and money The risk analysis and various costs to performing a D3M review should not be covered by Maker for a small, new, risky protocol like Notional. Each time we pass one of these, we add to the work pile. We need to make sure it is worth it. Otherwise, we waste our core team’s time (including PE and Risk), and we take away from other opportunity. The cost/benefit needs to work for Maker both acutely and down the line. Loading our teams up with work for bad business deals kills our other opportunities and slows our pipeline. As you noticed, we already have a backlog on our D3M work, is this D3M worth adding to the pile?  Notional can first perform independent risk analysis, then they can offer to pay for all the analysis regardless of whether it is onboarded or not Notional and GFX need some skin in the game. If GFX truly believes in this product, I would encourage them and Notional to come with an arrangement that will perform significant analysis upfront, and commit to pay for all of  Maker’s Risk and Technical analysis, before any vote. Otherwise, they are not serious about the business opportunity. Attempting to fast track something like this is cause for concern.  As it stands, notional wants Maker to foot the bill (and all the risk):   Maker has little revenue to gain, all the risk and upfront costs, and the ongoing risk of the D3M including potentially unknown Notional technical risks (early protocol).   Notional has loads to gain, boosts their token value, a substantial customer, Maker pays for everything. They also have no stability, no track record,  or real rep on the line. Notional also offers nothing to Maker to defray the acute cost of analysis and integration-- in short they offer us literally nothing here in exchange for a money printer.   I have to say, I am having a hard time seeing how this is an even-handed proposal… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.069288778192887
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#23",
                    "likes": "4",
                    "time": "15/03/2022-08:38:05",
                    "content": "Based on the discussion it seems a little early for this integration, but I can see the point with current delays that a signal really means “yes but later”. With our backlog and long lead times, I think these signal requests may need an update sooner or later where a go/no go confirmation is inserted before the actual implementation starts (long after the signal request passed.) Until that’s the case, voters may want to err on the side of caution.     GFXlabs:  While probably unnecessary for Maker, there is also coverage available for Notional under Nexus Mutual.   Given all the technical, capital, and oracle risk, insurance may actually make these integrations more feasible in the long run:   External team does the work using a sandboxed module with a limited DC.   Maker provides the capital and the gateway module to ensure proper risk isolation.   Capital at risk is secured by an insurance protocol. It may just be possible to make this permissionless, but probably very hard.   Other possibility is external investors putting up collateral in return for a profit share to cover the capital at risk. That may be easier to make it permissionless but it’s unclear whether we’d be able to give a competitive return since the investor could often lock their collateral in the target protocol directly.   Slightly off topic but the sandboxing model secured by external risk takers gets me excited every time :). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.210622710622711
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#24",
                    "likes": "2",
                    "time": "15/03/2022-20:20:52",
                    "content": "    twoodward:  Lending fixed on Notional is not incentivized. The yields offered for lenders are organic and independent of token incentives/prices.   Hey Teddy, so is the final verdict here that MakerDAO won’t Earn NOTE tokens? I see you guys are expanding rewards/incentives? Maker has been rugged too many times by 3rd party platforms who don’t reward it back and it can’t continue to rent out its time, IMO. But others might think its okay  ¯_(ツ)_/¯    Notional Finance – 14 Mar 22    Introducing NOTE Staking  - Notional Fixed Rate Protocol Today we are excited to announce the next step forward in the evolution of the Notional protocol: The NOTE staking module.      ",
                    "links": [
                        "https://blog.notional.finance/introducing-staked-note/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.7875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#25",
                    "likes": "5",
                    "time": "15/03/2022-21:55:52",
                    "content": "I very much appreciate your extensive posts on this Signal Request. My plan is to vote NO largely due to concerns about Delegate Conflicts of Interest in principle, which is a gating issue for me in this case. That said, I look forward to attending the Notional call tomorrow before voting in case there are specifics that merit overriding my general posture. Collateral Onboarding Call #39: D3M for Notional Finance Signal Request Discussion. I hope that some of this information regarding GFX [Signal Request] Onboard D3M For Notional Finance - #20 by MadShills will be included as part of the presentation tomorrow and for transparency posted here on the Forum. My views on the topic Expectations of a Delegate as pertaining to the ACREinvest Delegate Platform are discussed in this thread Expectations of a delegate - #5 by ACREinvest  Judicial Approach Without there being an explicit mandate from the community for Delegates to operate in this mode, ACREinvest views the delegate role more in the vein of a Judiciary actor. Accordingly, from my perspective initiating proposals would not be appropriate especially if the proposal includes a paid role for the Delegate or an affiliate to provide other services to the DAO. Dispassionate neutrality across the entire scope of matters before the DAO is what I’m striving for!  At this nascent stage of DeFi it is probably impossible and even undesirable to have a black-and-white, or rigidly proscribed conflicts policy. However, I do think now is a good time to elevate a discussion about Separation of Powers, and in any case set forth some daylight standards for proposals where a Conflict of Interest has been disclosed. Co-sign:  Review of delegation separation of powers It would behoove maker to look more carefully at the conflicts or interests with delegation, especially in a case like this where delegates have no skin in the game or are new entrants and hence, may care more about their own book acutely and less about the long-term health of the Maker protocol. It would also be a good thing to have standard expectations of disclosures and a process when conflicted delegates want to propose governance actions. MIPS and Signal Requests are powerful tools and should be treated as such.   Simply disclosing a conflict of interest does not remove the conflict and does not improve bias. Whether the conflict is being a core unit member, an investor in a competing product, or a VC, combining these with delegation is a dangerous precedent.   Governance motions have a real cost Simply raising a question or motion expends the energy of the community and directs governance, this has a real cost.  ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782/20",
                        "https://forum.makerdao.com/t/expectations-of-a-delegate/13406/5",
                        "https://forum.makerdao.com/t/expectations-of-a-delegate/13406/5",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782/19",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782/19",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782/19",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.646643155694879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twoodward",
                    "index": "#26",
                    "likes": "0",
                    "time": "15/03/2022-22:54:13",
                    "content": "Hi @flipflopflapdelegate , no Notional won’t be providing additional incentives to lend other than the high interest rates that the platform offers naturally. The blog piece that you are referring to refers to a plan to enable NOTE holders to share in Notional’s success through re-investments that come from Notional’s earned revenues. The core protocol’s incentive mechanisms aren’t changing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving clarification on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#27",
                    "likes": "4",
                    "time": "16/03/2022-02:27:00",
                    "content": "I do not understand. Did this delegate not make the disclosure and also promise not to vote? What else must they do? Promise to vote no?? I wish more delegates worked for the protocol! You all collect payment but only half of the delegates ever suggest new proposals or discussion. I see schuppi suggesting stability fee changes. I see the makerman starting discussion on spending changes. I see gfxlabs bringing new business. What do the other delegates do besides collecting a salary? Perhaps that is ok to only vote, but how can someone doing extra work be bad? If the proposal is bad vote no. But if anonymous people can get a core unit fired (they were right to do so), then why can a delegate not get maker money to help pay for all the constant spending? I do not understand how such small risk with gain to pay for a small core unit is getting no votes. How will maker pay for wasteful party core units without more money? I vote yes. Maybe you vote no but do it because you think the deal is bad not because angry anonymous person says so ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.697943722943723
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#28",
                    "likes": "2",
                    "time": "16/03/2022-03:51:37",
                    "content": "Delegate must present good deal. Even if say no vote, delegate hold multi keys. Deal bad- no skin GFX, Maker carry Notional on back. Delegate make Money only for self and friend, Maker take all risk, spend Maker money to D3M Notional. Notional win, Maker Lose. We agree puzzler-- No anger – Just business – Deal bad → Vote No. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.281250000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#29",
                    "likes": "5",
                    "time": "16/03/2022-11:56:11",
                    "content": "Governance (and informed voting) is work, my friend. There is great value in having some Delegates who are not involved in or in a position to financially benefit from business proposals made to the community. Time is a scarce resource, so a determination on a values and principles basis is a fantastic first screening prior to delving into or debating merits. If the first screen fails, then time and resources are spared for focusing our fire power on the work that most benefits the overall system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#30",
                    "likes": "2",
                    "time": "16/03/2022-13:07:17",
                    "content": "Hey @Puzzler! A couple of comments unrelated to this thread.  Role of Delegates     Puzzler:  I wish more delegates worked for the protocol! You all collect payment but only half of the delegates ever suggest new proposals or discussion. I see schuppi suggesting stability fee changes. I see the makerman starting discussion on spending changes. I see gfxlabs bringing new business. What do the other delegates do besides collecting a salary? Perhaps that is ok to only vote, but how can someone doing extra work be bad?   It is important to remember what expectations we have of the role of a delegate. It is also important that this is clear, mainly to avoid de facto requirements that add barriers of entry.  MKR holders as the ultimate decision-makers     Puzzler:  anonymous people can get a core unit fired   Anonymous people didn’t get a Core Unit fired. It was the MKR holders, either directly or through the delegates. Again, it is important to remember this, and how the governance process works.  The other side This one is probably the hardest one: we need to try to see what the other side is looking at.     Puzzler:  Maybe you vote no but do it because you think the deal is bad not because angry anonymous person says so   Should anyone vote yes because an angry (happy?) anonymous person says so?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.171401515151516
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#31",
                    "likes": "5",
                    "time": "16/03/2022-15:39:10",
                    "content": "Wanted to pop in and confirm how this Signal will proceed on-chain if successful. After some conversations with the last D3M Signal for Maple that went on-chain, we will be changing the language from “prioritize” to “investigate implementation” for this Notion D3M. No difference on the practical side of how Governance and the Core Units process the poll, this language is just a bit clearer as to what actually happens if this Signal passes an on-chain poll. Please let me know if this clarification causes any concerns or generates questions  ",
                    "links": [
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721/40"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#32",
                    "likes": "1",
                    "time": "16/03/2022-15:45:15",
                    "content": "    prose11:  “investigate implementation” for this Notion D3M.   This actually adds more clarity, which should help other teams in their assessments IMHO.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#34",
                    "likes": "14",
                    "time": "16/03/2022-18:13:34",
                    "content": "Changed my vote from Abstain to Yes. First, I have some Notional bonds (had them already before this SR), so you can assume I’m super conflicted if you want. The question is should we onboard Notional at some point. The answer is obviously yes. We should onboard Yield TLM as well. Term lending (i.e. bonds or term repo whatever you want to call it) is a key primitive for DeFi. Will it be the big thing in 2022? Maybe, maybe not. The question that matter is if it will be denominated in DAI or in USDC. Yield Protocol was only DAI at the time, but now USDC is the leading stablecoin and get more liquidity. For Notional, it’s currently even, but that’s due to the liquidity mining. The market cap is super small and the protocol is generating revenues, that means that a liquidity mining could be sustained. Just like the liquidity mining of Aave and Compound was a big chunk of our revenues (now approaching to an end it seems). Let’s fight for this market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4006410256410255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#35",
                    "likes": "5",
                    "time": "17/03/2022-16:21:34",
                    "content": "My vote was yes from the beginning, although several people here wrote me through various networks to change my vote, I understand them but I do not share it, it is part of a DAO and healthy community to have conflicting opinions. It is incredible that if we are talking about an aggressive growth campaign, they do not support growth in this area, it gives me to understand that there are conflicts of interest from other central units. I hope this is not the case. It seems prudent to me to try to embrace these spaces and to generate more sources for DAI’s aggressive growth. I think it is also prudent to target the Curve Wars directly and stop being the sleeping giant that Maker has become in the ultramodern world. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#36",
                    "likes": "8",
                    "time": "17/03/2022-16:28:57",
                    "content": "I am changing my vote to Yes because we should explore a D3M for Notional and try to grow D3Ms integrations. We should investigate implementation for the Notion D3M by assessing the risk and also explore agreements with Notional (for example DAI denomination as Seb suggested) that potentiate DAI usage in Notional. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#37",
                    "likes": "3",
                    "time": "17/03/2022-17:04:06",
                    "content": "D3M integrations are definitely an important growth path. It is unclear if a signal request is the appropriate process to onboard a D3M. This SR commits to onboard and make operational (implement) a notional D3M. It does not commit to solely explore or evaluate the D3M, or to simply perform analysis. If we wish is to assess risk and explore agreements with Notional at this time, the appropriate vote under the SR as proposed is “No.” Under this SR, Maker will do the following: perform all the work required to research the risk profile,  design and modify the existing D3M, perform additional audits as needed, and implement/ launch a D3M with a DC attempting to recoup these costs. This is a full bore commitment to implement the D3M. These costs all fall on Maker, upfront. By providing these services upfront for the benefit of Notional, Maker loses a large amount of leverage it has to negotiate. Maker alone bears all risk under this proposed arrangement. Perhaps, it would be better not to commit to onboard the D3M now, but rather Notional and Growth commit to exploring potential arrangements as @Nadia above mentions. Growth could then negotiate a fair deal on behalf of Maker.  There are a couple issues with this proposal as presented: First, it commits to onboard and operate a D3M for an early protocol without an understanding of the risks. This is not the same as a collateral greenlight poll. Second, It does not include any cost estimate to Maker under the cons section. We cannot perform a cost/benefit analysis without understanding the costs and opportunity cost to Maker. Third, agreeing upfront like this prematurely gives away leverage, leverage that could be used to command better terms from Notional upfront and down the line once we better understand the arrangement. A D3M is a loan, one term on the loan is the stability fees. By the time we are discussing stability fees, Maker has already invested significant capital. Before Maker invests this time and capital, it would be best to secure strong terms, upfront, in exchange for this investment. This also gives Notional skin in the game and aligns incentives. It makes them a committed partner, rather than a protocol receiving a near risk-free line of credit. Not against a Notional D3M, simply would like Maker secure fair terms and go about this in the right way. If we understand our costs, risks, and what we bring Notional, we can calibrate the arrangement to better align risk and reward for both sides. With this understanding Maker may then commit to onboarding a Notional D3M with confidence. Notional too can then be confident of its arrangement with Maker.  Instead of making a deal with no investigation or negotiation, let’s use our core units and resources to secure fair terms–terms that work for both Notional and Maker. It doesn’t make sense for us to commit to implement a D3M now, without any analysis done, risk or otherwise. Measure twice, cut once. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.407539682539682
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#38",
                    "likes": "1",
                    "time": "17/03/2022-17:18:08",
                    "content": "It’s true what you say about the dms and other issues, I also voted yes, there must be consensus in the decisions and respect the contrary. There will be valid reasons in both cases, but I support the innovation and of course with all the concrete study of this inclusion. We must be faster and more capable in the face of these types of opportunities that are presented to us. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#39",
                    "likes": "3",
                    "time": "17/03/2022-19:27:12",
                    "content": "Thanks for your detailed response. You make a lot of solid points, so let me add my two sats. 1 - Costs for Risk and Technical Analysis Indeed it costs time and money, but this is a growth investment. I don’t think the sunk cost fallacy will be an issue because we have many diligent members like yourself that will cut the cord if it doesn’t look good. That doesn’t mean we should kill a pitch at first glance because the opportunity cost also applies to not pursuing Notional. 2 - One-sided/Nothing in it for MakerDAO Going back to the main point here, the benefit for Maker is revenue plus diversification through the D3M. Of course, the current numbers are tentative projections, but they will become more apparent as we progress. Indeed they are a potential competitor, but like Aave and soon Compound, we can get a piece of their action through our competitive advantage; DAI. There are many threads about this, but we should do what we can to aggressively grow supply and demand for DAI. 3 - Notional/GFX Not Aligned Yes, Notional could have proposed this themselves, but I assume that @GFXlabs, a delegate and intimately familiar with MakerDAO Governance, would be better suited for the task. GFX has skin in the game because they’re a Recognized Delegate, which they can be essentially “fired” with their delegated MKR removed if their delegators think they don’t have their best interest in mind. However, this is all my speculation from what I’ve seen from them, and they can speak for themselves on this front. Regardless, I agree that I’d like to see more representation from the Notional team. Deals work both ways, and I welcome the notion of Notional paying for the risk analysis or third-party audit. I’d hate to see opportunities like this dead on arrival because it’s not perfect at first. However, that’s the beauty of our governance process; we can ask GFX and Notional to clarify these points and update the proposal to make it abundantly clear why we should move forward. I’m confident they’re both up to the task and hope to see them follow up on how they’re willing to work with us on a mutually beneficial initiative. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.90486111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#40",
                    "likes": "2",
                    "time": "17/03/2022-20:03:06",
                    "content": "Notional can do more for Maker. We do not yet know whether Notional would be willing to do more for MakerDAO because we have not pushed back. We can only know when we ask, or compel them to come to the negotiating table table. Committing to implement the D3M without any discussion or negotiation does not compel them to produce better terms. This does not follow a logical sequence and is backward from what we would expect. An analysis and negotiation of terms should come before a commitment of resources to launch and “turn on” a product. The more Maker invests along the way, the weaker its position becomes at the negotiating table. Negotiating upfront is better for Maker in this instance. A one sided proposal is a conflicted proposal. We can imagine Notional is willing to meet us based on the relative weight of each respective counterparty. Notional would benefit offering more substantive terms to Maker off the bat. We can presume this did not happen because GFX, a delegate, not Notional the counterparty, has proposed this integration. This is the conflict of interest GFX has acknowledged in writing above: this proposal, GFX, and Notional are acting in self-interest. Since the counterparties were not able to interact appropriately, they were unable to express their requirements before presentation of the proposal. Under this SR, Maker has not been able to negotiate and will not be able to act in its own self interest prior to committing to the D3M. The current proposal is a one-sided arrangement to the benefit of Notional and GFX. Rather than a signal request, the appropriate governance action is an MIP. This would allow a public discourse, negotiation with our CUs, and a RFC period (part of MIPs). This path would produce our desired outcome; one in the best interest of Maker. Maker must negotiate its own deals through the appropriate process. For this arrangement, it feels inappropriate that GFX be the intermediary. They themselves noted they have a conflict. If GFX were to do this again, they would have done best to propose the issue for discussion and connect Notional to Maker. Maker itself may then take the table across from Notional, not by means of a conflicted medium. When Maker negotiates directly with the counterparty this ensures an arm’s length transaction. This neutrality is necessary for the success of the arrangement. Any imbalance sets the arrangement up for trouble down the line (failure). As it stands, GFX has put itself in significant jeopardy. They themselves may not realize this. Were Notional to fail, a simple disclosure of a conflict will not protect them from angry MKR holders. When people lose money, we know what happens. Something like this would very bad for us and for GFX/ Notional. GFX may want to review their approach to these sorts of arrangements. Not all dogs are created equal: Big Dogs vs small dogs. Not all counterparties are equal and should not be treated as such. If Notional was well established, like AAVE or Compound, we would not be having this discussion around sunk cost. This proposal presents an issue based on the stage of the protocol. This means we should be appropriately calibrating the terms of the arrangement to the risk and scale of the counterparty. Maker is leaving money on the table. Slow is smooth, and smooth is fast. If Notional believes in the long term benefit of the D3M to MakerDAO, it makes sense to first open discussions directly with Maker CU, followed by an RFC period. The proposal would include the actual proposed deal terms for community feedback. This path would allow us to follow the appropriate process for a decision of this magnitude. It also allows us to make sure the relationship has the right legs to ensure long term success. A commitment by us to “implement” now does not hold any weight without due diligence; why are we even voting on it? Let’s do this the right way. Rather than proposals relying on foot in the door, we need proposals containing substance that afford evaluation based on merits. By using the appropriate governance procedures we can ensure Maker is protected. Otherwise, our commitments precede understanding. This is logically backwards. Scientific governance over governance exploits. Real business leads to real counterparties. This kind of behavior (conflict of interest and abuse of process) undermines the efforts RWA and others are making to professionalize Maker and present us as a serious counterparty. Real counterparties walk when they see this behavior accepted and normalized. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.813793874357255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#42",
                    "likes": "0",
                    "time": "20/03/2022-22:24:51",
                    "content": "    SebVentures:  The market cap is super small and the protocol is generating revenues, that means that a liquidity mining could be sustained. Just like the liquidity mining of Aave and Compound was a big chunk of our revenues (now approaching to an end it seems). Let’s fight for this market.   Early Protocol and More Risk should mean better rewards If we believe this protocol is at an early stage, but does not yet have legs and will grow, Why are we not negotiating upfront for better terms? If you like liquidity mining, secure a commitment for a favorable multiplier, but do it upfront while we still can.  Considering both the weight of Maker and inherent risk in Notional as an early protocol, Maker has the leverage. The way this proposal is proceeding is incorrect, regardless of whether or not you believe the integration is worthwhile. I hate beating a dead horse but the way this is presented does not benefit Maker puts Maker in the worst position: bearing all development cost, not estimating the costs to develop and integrate the product, not understanding the risk, and not offsetting that investment for favorable terms. As our strategic finance core unit, I would hope you would help us analyze and determine how to secure better terms upfront for integrations like this. This means before we commit, not after. If we like money, the best way to make it is to avoid giving away the farm in every integration and transaction. Conflicted Proposal not to MakerDAO’s Benefit This proposal is inherently conflicted, as noted above in writing by the conflicted delegate. They hope to push through a commitment on a signal request without appropriate analysis. Why? This is a  PR win for Notional and of no benefit to Maker. This seems concerning, inappropriate, and likely in violation of the delegate code of conduct. Maker carries unilateral risk. It can say, “No” to counterparties who don’t want to meet us on fair terms. Maker has the leverage in this case. It also carries the unliateral risk as presented, suggesting Notional has room to meet us on more equal footing to offset this risk. If we commit now under this SR, we remove the leverage, which is of course not integrating with Notional. The question is: Are we are so weak that we need to integrate everything, even if it is a bad deal, or if we believe in ourselves enough to say “No?”  Are we willing to forgo revenue if the counterparty is not willing to offer fair terms and stand behind it?  Or, are we going give away or leverage and put ourselves into a corner? If first you assume you are going to integrate with notional “obviously yes.” because they will make a little bit of money and maybe more, we have already failed and surrendered. Posting that openly also makes us weak. To take that position requires appropriate analysis and an understanding that is lacking on this thread. Otherwise, we might as well put up a sign that says “fools here with a money printer, come take advantage.” Maker must treat counter-parties in an even-handed and fair manner. Maker requires other neutral counterparties to follow appropriate procedures/ due diligence prior to receiving commitments from Maker, whether collateral, RWA, or otherwise. Offering an advantage and commitment to a conflicted delegate and proposal like this is a dangerous precedent. I cannot imagine the delegates permitting something like this.  Slow is smooth, and smooth is fast. Why are we rushing to failure, for the benefit of Notional, at the request of GFX? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.446314102564102
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#43",
                    "likes": "10",
                    "time": "21/03/2022-09:57:45",
                    "content": "@MadShills as you can read, I also said that being approved doesn’t mean getting implemented (as clarified by @prose11 here). The SF CU didn’t provided an analysis on the Notional opportunity. I’m not a facilitator so it’s safe to assume that only my post tagged with sf-001 are approved by SF CU. I’m speaking here as a MKR holder. On-chain term lending is a subject that will be worked on but later (or less later depending on the signal from the community). As a MKR holder, I would like to see 10M DAI diverted from the SB to a multisig, invested in those bonds and get some NOTE token for the partnership and get the ball rolling to take over this term lending market and make DAI the clear winner here. And I’m fully agnostic between Notional and Yield Protocol or whatever. This will not happen so the next best thing is not to block this Signal Request for no reason. The Maple Signal Request is almost the same and got quite an opposite reception (TVL are 500M for Notional vs 800M for Maple). Let’s be honest, it’s not about the proposal themselves. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-maker-accessing-pools-of-institutional-loans-through-maple-finance/12349"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.597756410256411
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twoodward",
                    "index": "#44",
                    "likes": "3",
                    "time": "21/03/2022-14:28:10",
                    "content": "Hi all, we’ve had some questions regarding the potential for a governance attack on Notional, so I just wanted to clear this up. The current circulating supply of NOTE is roughly 9.4M. This is less than 10% of the total supply of NOTE. By contrast, the team and early investors have 40M NOTE between them. This means that even if a malicious actor purchased every single NOTE available on the open market, that actor would still have less than 25% of the voting power of the team and early investors. This makes a governance attack infeasible without getting the majority of the team and early investors to act in concert with the attacker. I don’t think this is likely because the team and investors are subject to multi-year lockup schedules and can be expected to act in the long-term interest of the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.008928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#45",
                    "likes": "8",
                    "time": "21/03/2022-14:53:35",
                    "content": "After examining more closely, I have changed my vote from No to Yes. I had two concerns but they were addressed sufficiently. 1. Potential Security Risk -I still believe audits are not perfect. Even the Maker Protocol which went through countless audits and several formal verification, there are sometimes vulnerabilities. However, considering DeFi industry moves rapidly and its TVL is already more than half billion, it seems reasonable to believe the system so far has been secure and various security bounty programs helped me weight more on the potential reward of the integration. 2. Potential Governance Risk -Considering Notional Finance’s governance token has a small marketcap, I was particularly concerned about potential governance attacks (what if a malicious actor acquires more than half of the total and abuses one’s power?). However, the team’s response on why such is unlikely is reasonable.     twoodward:  The current circulating supply of NOTE is roughly 9.4M. This is less than 10% of the total supply of NOTE. By contrast, the team and early investors have 40M NOTE between them. This means that even if a malicious actor purchased every single NOTE available on the open market, that actor would still have less than 25% of the voting power of the team and early investors. This makes a governance attack infeasible without getting the majority of the team and early investors to act in concert with the attacker.   Therefore, unless there are other critical factors, I standby my decision to change the vote to Yes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.215773809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#48",
                    "likes": "4",
                    "time": "21/03/2022-15:35:26",
                    "content": "I think similar analogy can be applied to collateral onboarding applications. Not all collateral onboarding applications came from negotiating with BD / Growth team beforehand. Also, it was common for collaterals or integrations to pass the greenlight but discuss with technical or business team afterward for smooth and mutually beneficial integrations. I think deals and initiatives can flow in both directions. CUs presenting deals to the community and the community presenting deals to CUs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#50",
                    "likes": "1",
                    "time": "21/03/2022-15:53:38",
                    "content": "That’s a fair point but I think it’s up to the community. For example, we didn’t negotiate separate additional deals for AAVE or Compound from what I understand. For PAXG, I personally was against onboarding until we have clear collaboration points, but the community strongly voted for it. And I fully respect that.    [Signal Request] Onboard PAXG   Unless there’s a clear proposal to scale up the Maker ecosystem (or closer collaboration from Paxos team), this will result in another collateral that has higher cost just from gas fee for operating Oracle than potential stability fee from it.   Similarly, for this deal, while the team having such specific collaboration would been nice, lack of it was not strong enough for me vote against it after reviewing again. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7564102564102555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#52",
                    "likes": "2",
                    "time": "21/03/2022-17:27:00",
                    "content": "    MadShills:  @SebVentures Why did Maple post their own signal request when notional did not?   I can only speculate, but @twoodward was there for MIP43. He probably saw how useless it was, learnt from it and moved on. @GFXlabs is in the business of making things happening and take credit for it to build a reputation. @lucas-manuel is and ex-Maker and leveraged CUs influence for his signal. I feel that if you swapped the underlying of both proposals you would get close to the same result. This is obviously just a theory. The consequence of this theory is that no one should care about the community. Discuss first behind closed doors with CUs.    [Signal Request] Real World Asset Fast-Tracking   As stretched as they are, Maker’s legal, credit, governance, delegates and other facilitators and representatives have been generous with their time.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#53",
                    "likes": "0",
                    "time": "21/03/2022-17:28:47",
                    "content": "Seems like the wrong way about it, inappropriate incentives, and an opportunity to improve Maker governance instead of exploit it. Thanks for the analysis and explanation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twoodward",
                    "index": "#54",
                    "likes": "5",
                    "time": "21/03/2022-17:43:11",
                    "content": "Hey guys, the collaboration with GFX was a fortunate coincidence. We had done some initial work on a signal request ourselves, and we were considering raising the request ourselves. At that point, GFX reached out independently and proposed to raise this request themselves. This made sense to us - Maker’s governance process is complex and we didn’t totally know how it worked. GFX on the other hand is intimately familiar with this process. We felt that by working with them we would be able to avoid shooting ourselves in the foot because we didn’t fully understand Maker governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#55",
                    "likes": "0",
                    "time": "21/03/2022-17:55:44",
                    "content": "It makes the most sense to run your own arrangement with input from a contributor, rather than hand it over to a conflicted delegate. It also creates counterparty risk for Notional to allow a third party to run their deal, unless of course, they had to the ability to direct the delegate as needed. In general, arm’s length transactions create defensible outcomes. When you mix your deal in with someone who has someone else’s MKR staked, it can create big problems, both with that MKR holder and with other minority MKR holders. —- @twoodward Looking forward, Have you considered what you could offer maker to help offset the risk of the integration, the costs of the analysis, and the business development benefits you would receive? It seems like a good opportunity for you to grease the wheel and help offset the risk based on the stage of your protocol. Would you instead be willing to compose an appropriate MIP like the TLM instead of just this SR? Honestly speaking, relying on this SR will grant you the business goodwill and PR , but is not likely to help take this live on the timetable you desire. This also repairs the perverse incentives @SebVentures notes above, which are not to anybody’s benefit. If we can make a fair deal and clear understanding, it increases the odds of this getting done. That being said, as Wouter noted above, It is likely that you will need to perform technical development yourselves like yield did, craft your own spell, etc. All of this could be delineated in an MIP that includes what preferential terms you would contemplate for Maker. This would be to your benefit (establish expectations, costs, and a clear timeline) and to Maker’s benefit as well (mitigate risk and provide concrete rewards). Is this something you could commit to doing for us, regardless of the outcome of the SR? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.127582644628099
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#56",
                    "likes": "7",
                    "time": "21/03/2022-18:17:34",
                    "content": "Why are you so angry on this posting? You do not do this other places. Do they owe you money? Drive over your cat? Do you own a competitor? You are driving people to vote against your opinion. I hope Societe-General or a large bank does not read this and think they will need to have one complaint posted repeatedly. You have posted 14 times. Please stop unless you have new questions. Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.021374458874459
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#57",
                    "likes": "1",
                    "time": "21/03/2022-18:27:46",
                    "content": "When a position is valid, it deserves to be addressed. There are a number of positions and questions that merit reply and have not yet received an appropriate response. They have been expressed in the hopes they will be addressed, rather than avoided. No anger, just business. Maker would do better by demanding more from its counterparties, be it soc general or crypto collateral. I would be happy to offer the same critique of soc general but do not have a background to adequately evaluate that arrangement. When we do due diligence we improve Maker’s standing. If you would like to do analysis and bring it to attention, I am sure MKR holders would appreciate it. Also, these other borrowers are undergoing rigorous due diligence and using the appropriate MIP process. This arrangement is not presenting an MIP or has not yet agreed to so far. @twoodward can confirm or deny if they intend to submit an MIP. Hence, a cause for concern. MIPs take time but they represent commitment. Soc general and other counterparties would likely be more concerned seeing the absence of any critical analysis for a proposed credit line, and Maker not expressing sufficient self interest at the appropriate time in a business transaction. They themselves share the risk for each integration. Each integration  represents risk to DAI as a whole and in turn,  their credit line. The same questions would not recur if they were simply answered. I do not see any problem with this. If @GovAlpha-Core-Unit disagrees or has issue, they can let me know. The proposed questions above to @twoodward are quite clear and are questions we should be asking about all integrations, big or small. It would be appropriate to pose these evaluations to all future D3M integrations, and retroactively to Maple and other D3M who have yet to be integrated. We must be even handed in each instance and approach each arrangement with a clear understanding  of the risk and reward. This path will achieve the best outcome for us in each integration. Without a clear process, we engage ad hoc with our D3M integrations. This leaves us liable to fail, be taken advantage of, and to leave money on the table. Looking forward: Notional as a model D3M integration Notional has not yet addressed or acknowledged any of the valid points regarding asymmetry of risk, negotiation, technical costs, etc. They have the oppportunity to invest the time and make their proposal a model for D3M proposals moving forward. We hope they would do so and commit to preparing an appropriate MIP. Doing this would make it easier to be confident in their integration and be good for both us and Notional. It also increases the likelihood they get their integration live. If their objective is a live integration soon, this is the appropriate path forward. As it stands now, nobody can communicate what we are even voting on. The language was recently changed to “investigate.” What does this mean? This SR is in effect a straw man. If positive, it is most likely to result is a halo effect from a vote and less likely to produce a serious integration going live. Each of these questions above is a chance for Notional to make their case to MKR holders. It seems  a missed opportunity not to address them. This is reasonable and perfectly appropriate; in fact this is the point of due diligence: For both sides to kick the tires and agree it is a good fit… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.808872624550591
                },
                {
                    "author_link": "https://forum.makerdao.com/u/superTricycle",
                    "index": "#58",
                    "likes": "1",
                    "time": "22/03/2022-03:15:59",
                    "content": "    MadShills:  I think when we look at leverage it is best to take an honest look at what both parties bring to the table.   I get what @MadShills is saying. MakerDAO has the better position to leverage and Notional should bring something to the table. We want another D3M, but what else can Notional give in return since we’re bringing DAI and more users to them? They’re relatively new and small so you can almost compare this as a DAI incubation, which incubators usually get something in return for the investment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.597402597402597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#59",
                    "likes": "8",
                    "time": "22/03/2022-13:58:32",
                    "content": "Even though I have been following MakerDAO for over 2 years, I feel I’m quite new now that I work for the DAO, hence I feel I still see things with the perspective of  an outsider. I see 3 major gaps on the D3M discussions (i’m using this one as is the one driving most attention and interesting points of view):  D3Ms are a technological integration - a solution. If we propose a technological integration before discussing the business opportunity we are already discussing the solution instead of the problem. This normally leads to underperforming business projects. I would prefer the community and delegates to focus on the business aspects first, the technology proposal can be a secondary factor which of course can be proposed and would be helpful, but the framing is “D3M for X”, instead of “Grow the market share of Fixed Borrow DAI Rate by x% in the universe of Y”. The latter framing of the proposal forces the DAO and proposer to think about opportunity costs and the whole universe and players in the market. I don’t see an overarching strategy defined for “fixed borrow DAI rates in the DEFI ecosystem for the Maker protocol”. This might be a DAO failure or not, but who is defining the universe?, the market share targets? and the strategies to win if the token holders decide it is an area to pursue? In a centralized company a business team would be tasked to come up with a strategy for a business vertical which represents an opportunity. Such team would research, define the universe, the competitors, SWAT, projects to be derived from the strategy and then stakeholders would decide which ones to tackle first (collateral prioritization). Here (and in other D3M discussions), we are already tackling projects and even talking about the technology. I might be missing background discussions as I can only read a small percent of the forum contents, but I would assume delegates should be requesting strategy documents and research pieces from CUs and/or themselves providing such documents for business opportunities available or risks they foresee. D3Ms involve a piece of collateral, hence, the most correct approach from my PoV would be to go for a MIP6** and request CUs internally to help shape it or sense check it before posting to bring clarity and remove misconceptions that might distract the important discussions. The MIP6 path is clear, and here we have wasted posts to understand what is the outcome of this SR.  ** In the MIP6 amendments CES CU is proposing to the MIP6 Application template, we have started driving the “business opportunity sizing” of an application in the “business questions” section that has been added: MIP6c3-SP2: Modify the collateral application form Happy to discuss further, get clarity about the gaps I point above and push for next steps. ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/91"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.626199494949495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#60",
                    "likes": "4",
                    "time": "22/03/2022-16:00:16",
                    "content": "    M_C:  In a centralized company, a business team would be tasked to come up with a strategy for a business vertical which represents an opportunity. Such a team would research, define the universe, the competitors, SWAT, projects to be derived from the strategy, and then stakeholders would decide which ones to tackle first (collateral prioritization).   100% agree to this point. Establishing a process for necessary research and stewardship of the outcome in a decentralized is environment is key ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#61",
                    "likes": "5",
                    "time": "22/03/2022-18:55:41",
                    "content": "    M_C:  I would prefer the community and delegates to focus on the business aspects first, the technology proposal can be a secondary factor which of course can be proposed and would be helpful, but the framing is “D3M for X”, instead of “Grow the market share of Fixed Borrow DAI Rate by x% in the universe of Y”. The latter framing of the proposal forces the DAO and proposer to think about opportunity costs and the whole universe and players in the market.   Terrific. And taking this approach can include community agreement as to expectations regarding our conflicts policy and standards for required disclosures. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#62",
                    "likes": "5",
                    "time": "23/03/2022-16:04:13",
                    "content": "Thank you to everyone who participated in this poll and spirited debate! The Signal was successful, and we will await word from @GovAlpha-Core-Unit to confirm that the on-chain poll will take place in the coming week. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#63",
                    "likes": "5",
                    "time": "23/03/2022-16:23:04",
                    "content": "Just confirming that the outcome of this signal request was “Yes”. We will schedule an on-chain poll for Monday. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#64",
                    "likes": "1",
                    "time": "28/03/2022-08:42:19",
                    "content": "    SebVentures:  The Notional opportunity is very strong but small-scale and very time-sensitive. So i’m not betting on MakerDAO here.   As predicted, those high rates didn’t last long (NOTE rewards are better now, so it might get pushed higher again).  image704×282 17.7 KB  Nevertheless, we should pursue integration with Notional (and the others). You can find below one account that is engaging in rate arbitrage. Not a great return, but if you have an endless stream of collateral … (i.e. arbing the rates between USDC and DAI)  image1118×511 31 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7491666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#65",
                    "likes": "5",
                    "time": "28/03/2022-08:51:41",
                    "content": "Would it make sense to invent some framework (perhaps MIP55 can be used in some cases) where a dedicated team can pursue these perhaps more time sensitive and short term opportunities rather than building a time consuming and costly integration every time? E.g. the DAO could lend out Dai to one or more dedicated teams that would manage LPs across different DeFi protocols who could take a percentage cut for their work. This would be a more agile and much cheaper construct than building a smart contract integration everytime there’s a positive yield opportunity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.370779220779221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#66",
                    "likes": "3",
                    "time": "28/03/2022-16:01:12",
                    "content": "This is a good observation Nikolaj. Market Makers generally serve this purpose and operate on CEX as well. Structuring and managing MM relationships is unfortunately time consuming. Generally, lending out Dai without security is not a practice we will engage in. The security can then come from a technical integration or legal structure. Either way there will be costs. As Miguel mentions, knowing the strategy and cost benefit helps ensure costs are recouped and action, informed. As Seb notes, using short term rates to infer long term revenue projections is untenable in new environments with high variability. The cost of moving quickly is risk. High yields come with high risk. For example, if we could quantify the gains from the proposed rate arbitrage we can understand how much money we stand to make and if it makes sense financially. We can expect if the market is good, there will ultimately be competition. If it is just a first mover advantage, we can expect the market to fade with time. —— As far as overall strategy, it would answer the questions: What are we trying to achieve? How much risk does Maker want to (can afford to) take? Where will we take these risks and why? What are the appropriate yields to offset our risks and costs? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.749934123847167
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#67",
                    "likes": "3",
                    "time": "29/03/2022-15:52:32",
                    "content": "    lollike:  E.g. the DAO could lend out Dai to one or more dedicated teams that would manage LPs across different DeFi protocols who could take a percentage cut for their work. This would be a more agile and much cheaper construct than building a smart contract integration everytime there’s a positive yield opportunity.   100% agree,   more than one team is smart. Roadmap could be simple too: trading done by people + bots → mostly bots → IAM's → team disbands.    [Signal Request] Allocate 20M to protocol owned Uniswap V2 MKR/DAI LP   If it helps, I think the best approach is to march towards a CU that operates these types of positions like Maker’s own desk. With a mandate to preferably automate their management away or disband after a couple of years. I would imagine we’d also want to try different platforms than just Uniswap v2 as well.   This team seems like a decent idea but needs shaping via discord rather than forum processes, since there is a lot of rough edges to think through. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.569534632034633
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#68",
                    "likes": "2",
                    "time": "12/04/2022-09:34:50",
                    "content": "The on-chain poll for this proposal was unsuccessful, with the majority of non-abstain votes voting for “No”. Therefore, no further action will be taken at this time. Thank you to everyone that participated and voted on this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#69",
                    "likes": "0",
                    "time": "12/05/2022-19:35:20",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-truefi/14563",
            "title": "[Signal Request] Onboard D3M for TrueFi ",
            "index": 14563,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "d3m",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#1",
                    "likes": "20",
                    "time": "11/04/2022-18:27:43",
                    "content": "Context: In line with MakerDAO’s ‘Aggressive Growth Strategy’, TrueFi is proposing a MakerDAO-only pool to allocate DAI into diversified lending and credit opportunities. While this may lend to existing and reputable crypto trading firms, the goal would be to lend into more ‘traditional credit’ opportunities that share a low level of correlation with the wider crypto market, utilizing solid and tested structures, and in partnership with reputable (potentially regulated) lenders. TrueFi, in consultation with MakerDAO members from the Protocol Engineering Core Unit, Growth Core Unit, Real World Finance Core Unit, and Lending Oversight Core Unit, is signaling to onboard a D3M for the creation of a TrueFi DAI pool. Signal Request: TrueFi is signaling to onboard a D3M for a newly created TrueFi 3-month-maturity DAI lending portfolio with an initial debt ceiling of 50-100 million DAI (unless suggested otherwise). About TrueFi: Launched in November 2020. TrueFi was DeFi’s first uncollateralized lending protocol. Since launch,  The protocol has originated ~$1.3bn in uncollateralized loans across 119 loans and ~35 borrowers with 0 defaults.   1404×524 43.7 KB   The protocol currently supports USDC, USDT, TUSD, and BUSD and offers loans ranging from 30 to 180 days. Average borrower rates (without token incentives) are roughly 9.5% with a range from 7.16% - 18%.   1600×1088 183 KB   Total interest generated between November 2020 and today is 19.32mm USD   1278×598 21.9 KB   1600×588 164 KB  Pros:  Non-Crypto Lending Opportunities: While the majority of loans have so far been distributed to trading firms (Wintermute, Alameda, Jump, etc.), TrueFi is onboarding many “real world” lending opportunities and institutions such as Delt.ai. Some examples of borrower candidates in our pipeline include some of the largest Web 2.0 lending platforms, some of the largest BNPL companies, publicly listed companies, venture debt providers, and many non-crypto companies offering innovative debt products. Conservatively, over the next 12- months, this pipeline represents several hundred million dollars to low-billions of dollars worth of lending opportunities that are not correlated with the broader crypto market. Customized Loan Opportunities. Given the pipeline of opportunities we have, we will be able to work with MakerDAO core units to understand the exact type of credit opportunities you would like to lend and present those. For example, we would be able to work with MakerDAO to source financing opportunities that support community members initiatives around ‘clean money’. Future Collaborations.  Layer 2 Expansion: TrueFi hopes to be live on Optimism in Q2 and potentially additional Layer 2s in coming quarters. TrueFi plans to offer similar revenue opportunities for MakerDAO on other Layer 2s. Tranching: TrueFi is planning to partner with tranching protocols and also looking into building tranching natively into the protocol. We will work with the MakerDAO Protocol Engineering Core Unit to define requirements from MakerDAO so that Maker can have principle protected/bankruptcy remote senior lending tranche.    Cons:  Smart contract risk. This is impossible to completely eliminate, but our security engineering team has designed a process to discover and mitigate vulnerabilities. Before launch, our smart contracts undergo formal verification using Certora, two external audits, and a small-scale bug bounty. These are all benchmarked against secret injected bugs from our engineering team, to ensure high audit quality. After launch, we have a large-scale bug bounty to encourage hackers to disclose vulnerabilities instead of exploiting them. We wrote more about our security processes on our engineering blog (Link) Multisig Risk. Our smart contracts are owned and controlled by separate Gnosis Safe multisigs. For instance, contract upgrades require a higher threshold of signers than configuration changes, and setting token distributions requires a different set of signers than borrower KYCs. This zero-trust architecture ensures risk is divided by business function. Centralization risk will be further reduced by the end of May, when we hand over control of all core smart contracts to DAO governance. Illiquidity Risk. Given the uncollateralized nature of our protocol’s lending, it would not be possible to call back a loan before maturity. That said, given the fixed-term nature of our loans, it is transparent when a loan is due to be repaid. Compliance Risk - to mitigate we have an internal team that runs bank level KYC/AML on each borrower. The process is approved and regularly audited by our partner banks.  Additional Links:  Website Launch Post Blog post on lending marketplace Dune Analytics (Loan Stats) Dune Analytics (TrueFi at a Glance) Dune Analytics (many additional links)     Should Maker Onboard a TrueFi D3M?  Yes Abstain No     0 voters     Addendum: This poll will close on April 25, 2022 at 12:00pm EST. If this signal is successful, an on-chain poll will present this proposal to MKR holders. If this signal is unsuccessful, no further action will be taken. #sig-status-active #truefi-d3m #truefi ",
                    "links": [
                        "https://www.pymnts.com/loans/2022/mexican-fintech-uses-defi-to-provide-collateral-free-loans-to-small-businesses/",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684",
                        "https://github.com/trusttoken/audits/tree/master/TrueFiLendingMarketplaceV1",
                        "https://medium.com/truefieng/preventing-billion-dollar-hacks-403d7bffac75",
                        "https://truefi.io/",
                        "https://blog.trusttoken.com/introducing-truefi-the-defi-protocol-for-uncollateralized-lending-9bfd6594a48?source=collection_home---1------0-----------------------",
                        "https://blog.trusttoken.com/truefi-launches-lending-market-to-support-independent-asset-managers-announces-first-fintech-ede079a723a9",
                        "https://dune.xyz/tt_tyler/truefi-loan-stats",
                        "https://dune.xyz/tt_tyler/tru-staking-burns",
                        "https://dune.xyz/tt_tyler",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-abril-de-2022/14616",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/70",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/39",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/60",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-abril-02-de-mayo-de-2022/14970",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/19",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-2-de-mayo-de-2022/14923",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/72",
                        "https://forum.makerdao.com/t/weekly-relay-april-26-may-2-2022/14939",
                        "https://forum.makerdao.com/t/relay-semanal-19-25-de-abril-de-2022/14841",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/weekly-relay-april-19-25-2022/14815",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-4/14770",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-14-20-2022/14727",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-abril-de-2022/14724",
                        "https://forum.makerdao.com/t/weekly-relay-april-12-18-2022/14691",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/weekly-relay-april-5-11-2022/14590",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-7-13-2022/14624"
                    ],
                    "GPT-summary": "TrueFi is proposing a MakerDAO-only pool to allocate DAI into diversified lending and credit opportunities. The proposal is to lend into more traditional credit opportunities that share a low level of correlation with the wider crypto market, utilizing solid and tested structures, and in partnership with reputable lenders. TrueFi is signaling to onboard a D3M for a newly created TrueFi 3-month-maturity DAI lending portfolio with an initial debt ceiling of 50-100 million DAI. The post also includes pros and cons of the proposal, and a poll for MakerDAO to onboard a TrueFi D3M.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Change to proposal pipeline",
                        "Token economics",
                        "Privacy, Security and risk management"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.591925010473398
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/04/2022-19:03:07",
                    "content": "I think this is great, we see more green flags than red ones, and the red ones come with direct mitigation solutions. If this is not bullish, I don’t know what else is. I like this idea of building regardless of market noise, follow this course!!! Let’s go Maker!!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.23455810546875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "3",
                    "time": "11/04/2022-19:55:40",
                    "content": "Hey @RyanRodenbaugh, as per the guide to the signalling request process, can you include a Next Steps section that provides clear lines of progress? Specifically, a date when this signal ends, and indication that  this will subsequently move to an on-chain vote? You could also include a link to the D3M documentation here.  On a more general note, we do not onboard collateral or D3M’s directly via the signal request process. Similar to the recent Notional D3M poll, if and when this moves on-chain, it will be phrased in the “Investigate Implementation” format - in this case “Investigate Implementation of a TrueFi D3M” - and wrapped into the existing collateral prioritization framework.      RyanRodenbaugh:  In line with MakerDAO’s ‘Aggressive Growth Strategy ’, TrueFi is proposing a MakerDAO-only pool to allocate DAI into diversified lending and credit opportunities.   I want to clarify here as well that the Aggressive Growth Strategy referenced is not something that has been approved by Maker Governance at this time. ",
                    "links": [
                        "https://manual.makerdao.com/module-index/module-dai-direct-deposit",
                        "https://vote.makerdao.com/polling/QmcBwWAx#poll-detail",
                        "https://forum.makerdao.com/t/aggressive-growth-strategy/13958"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#4",
                    "likes": "5",
                    "time": "11/04/2022-20:01:55",
                    "content": "Thanks @LongForWisdom! I’ve added     RyanRodenbaugh:  This poll will close on April 25, 2022 at 12:00pm EST. If this signal is successful, an on-chain poll will present this proposal to MKR holders. If this signal is unsuccessful, no further action will be taken.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#5",
                    "likes": "6",
                    "time": "11/04/2022-21:06:24",
                    "content": "Thank you @RyanRodenbaugh for this signal request. As I have stated several times, my personal opinion is that, in the long run, MakerDAO will programmatically plug into white-listed protocols and projects, by providing last resort liquidity and expand the footprint of DAI while pushing out of the DAO (prudently) most activities. Long-run and prudently are key words in my statement. For this reason, I am excited to see protocols like TrueFi, and others, approaching the DAO with a similar vision, although there is still a lot to do and examine. I am voting YES to the Signal Request and I look forward to collaborate with the other core units.  Note: in the extract below you refer to the Lending Oversight Core Unit. The Lending Oversight Core Unit (or LOVE-001 - where I would be prospective Facilitator) is part of SES’ incubation program but hasn’t yet been approved by the community through on-chain governance mechanisms.     RyanRodenbaugh:  TrueFi, in consultation with MakerDAO members from the Protocol Engineering Core Unit, Growth Core Unit, Real World Finance Core Unit, and Lending Oversight Core Unit, is signaling to onboard a D3M for the creation of a TrueFi DAI pool.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.409090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#6",
                    "likes": "5",
                    "time": "11/04/2022-21:17:12",
                    "content": "I am worried that people who voted no only last week immediately vote yes this week for a very similar topic. That is strange… Truefi is a good partner. I vote yes! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#7",
                    "likes": "10",
                    "time": "11/04/2022-23:54:00",
                    "content": "Voting yes because onboarding TrueFi will allow us to improve DAI liquidity: Market makers’ main concern is capital efficiency, and solutions that can offer them uncollateralized loans are perfect for them (that’s why they are one of the main users of these platforms). By onboarding TrueFi we could lend DAI to Market Makers and improve Dai liquidity on L2 and sidechains. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#8",
                    "likes": "3",
                    "time": "12/04/2022-00:03:44",
                    "content": "Very supportive of this and is something TrueFi could spin up with relative ease! Not exactly the same, but:  using a TrueFi pool for this purpose would alleviate some of the concerns that came up in this post (Proposal: Market Making Proposal from Wintermute Trading) We’re doing something similar with Perpetual protocol right now where we lend to market makers with the added clause that the funds can only be used to provide liquidity on Perp. We’ll be spinning up an additional portfolio like this in the coming weeks, as well.  I think this pool of lending DAI to MMs with intention of supporting L2 liquidity is likely a separate post (I already have it drafted based on my convos with @Nadia), but something we are super keen to move ahead with pending this D3M signal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6970238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#9",
                    "likes": "4",
                    "time": "12/04/2022-00:31:27",
                    "content": "This looks good, but almost too good to be true. 9% rates with 0 defaults? Why are the rates so high? In the “cons” section, I don’t see default risk?  High rates usually offset high risk.  Product Explanation Could you please help us understand more about your product, please? Are these undercollateralized or uncollateralized loans? Can you please explain to us a little bit more and describe who your borrowers are? How do you protect against default? Are they offering to secure loans with their books? You note 0 defaults but your total interest revenue graph suggests you hit 1mm in revenue monthly very recently, in 2021 and a total lifetime revenue of 19.32mm. The protocol may be promising, but it does appear quite young.  Default Procedure What is your procedure here? How do you handle defaults? What would happen if a borrower fails to pay back their loan from the Maker pool?  Maker Specific Products You note Maker can “customize” loans? How would that work? Can you please describe what you are thinking or hoping for?  Additional Maker Incentives 50-100mm is quite a significant debt ceiling considering your total origination value is only 1.3 billion to date. 100mm at 9% in 1 year would generate approximately 50% of your lifetime revenue to date? What are we missing? Can you please walk us through some reasonable revenue projections at various debt ceilings and how that compares to your business to date? This integration is not only high risk line of credit to your benefit, but would significantly enhance your position in the market. Have you considered providing Maker holders additional gains in exchange for this halo effect? We are interested to see what you have considered to offset the asymmetric risk between Truefi and MakerDAO. How are you incentivizing Maker’s contribution to Truefi, beyond the yield? Is there preferential liquidity mining or other incentives you are able to offer us compared to your average user?  Technical Implementation In terms of implementation, what are the technical requirements for an integration like this? The D3M was written for liquid in and out. As you note, these are not liquid as an inherent risk. Can someone from PE comment on the challenge here and how much work it would be to get this off the ground? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.580208333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#10",
                    "likes": "3",
                    "time": "12/04/2022-01:10:47",
                    "content": "Nice to see teams coming to Maker with D3M proposals! Thanks for presenting this here @RyanRodenbaugh I hate to be the wet blanket, but connections to the 13th largest TRU holder hurt the TUSD team’s relationship with the community. Would you be able to share how that connection affects the Governance of the Truefi protocol? Or how governance is, or isn’t, relevant for this implementation. In addition to what Madshills pointed out, will there be TRU rewards we need to account for? TYSM.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#11",
                    "likes": "3",
                    "time": "12/04/2022-01:15:09",
                    "content": "FYI, Truefi has documentation covering many of their procedures in their FAQ. For example, their default process is covered here.   docs.truefi.io    SAFU (Secure Asset Fund for Users)      ",
                    "links": [
                        "https://docs.truefi.io/faq/main-lending-pools/risk-mitigation/safu-secure-asset-fund-for-users"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#12",
                    "likes": "0",
                    "time": "12/04/2022-02:43:53",
                    "content": "Thank you. It would be great if the TrueFi team would consider spending the time to prepare a post that explains their business model and its risks in a more accessible manner. A post that is tailored to our community and the proposed integration aids our understanding. Otherwise, the burden is on our community to do research on a protocol with which we may not be familiar. As we are all aware, documentation is not the same as a plain English walk through. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.303571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/massnomis",
                    "index": "#13",
                    "likes": "2",
                    "time": "12/04/2022-09:57:57",
                    "content": "I think this is a great contribution towards MakerDAO, expanding its balance sheet to include RWA’s as well as commercial paper/lending. Liquidity for DAI will increase, with little downside for risk. TruFi has never had a default, and the community is very effective at assessing risk, interest rates, and borrower profiles. The credit score model has a lot of potential, and is a great tool that can be even more improved with this collaboration. 10/10 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.923214285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#14",
                    "likes": "2",
                    "time": "12/04/2022-10:10:40",
                    "content": "I look forward to see it happen as well. For those who are curious about why the reward rate is higher is because the protocol itself is an undercollaterizrd loan which even in legacy finance gets premium for increased risk. That being said, it is still consistent with my thought on D3M expansion    Doo Delegate Platform   considering there are many D3M that might be on boarding, aggressively expanding Dai liquidity via D3M via different protocols might actually end up reducing the risk overall assuming it passes several criteria.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#15",
                    "likes": "4",
                    "time": "12/04/2022-14:29:34",
                    "content": "In back-to-back meetings for the next 7 hours, but I will get back to you on all these questions by EoD tomorrow  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#16",
                    "likes": "1",
                    "time": "12/04/2022-16:31:54",
                    "content": "The way the project is approached and viewed makes it a solid yes ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rob",
                    "index": "#17",
                    "likes": "0",
                    "time": "13/04/2022-10:12:36",
                    "content": "Is this proposing a specific investment strategy or just using truefi to be a bridge? If it’s the first, what are they? If it’s the latter, when do we decide how to use this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#18",
                    "likes": "2",
                    "time": "13/04/2022-10:31:41",
                    "content": "I don’t want to beat on the same drum for every D3M onboarding request, but I think MakerDAO should understand the various trade-offs for integrations with these other protocols. See my comment on the Notional Finance signal request:    [Signal Request] Onboard D3M For Notional Finance Signal Archive       Posted a similar thing before on discord, but will post here how it relates to Notional Finance.  In terms of integrating with other protocols there are a few possibilities for Maker, which each have various trade-offs. I’ve made this table below to explain my thinking. *Note that the risks are heavily simplified for arguments sake.      Method Description Risks for users* Risks for Maker*     Regular collateral onboarding The relevant token does not have any special features, and can be onboard…     If for example the default risk of TrueFi is deemed to high by Risk-CU to give a debt ceiling that is worth doing the integration with, there are other possibilities that Maker & TrueFi could pursue. Say TrueFi offers a token representing the shares of the deposit, Maker could consider onboarding that token in stead of the D3M. That means that users of this onboarded token can leverage their deposit in TrueFi. Going for this direction would mean that the returns are shared between the users of the collateral and Maker, while the risk for Maker is reduced by the users taking on defaulting risk. I think moving forward I think it would make sense for protocols that propose a specific method for integration, to also state why they believe that that method for integration is the best method for the use case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.126221804511278
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LukaszStoczynski",
                    "index": "#19",
                    "likes": "1",
                    "time": "13/04/2022-10:39:51",
                    "content": "Hey Rob, Lukasz from TrueFi’s BD team here. The idea we discussed with Maker CUF members was that there would be a sort of fund of funds on TrueFi and from there DAI would be deployed to investment strategies that are in line with Maker’s vision. This would allow less granular decision making on funds deployment from Maker DAO. The two strategies that were discussed, where funds could be deployed near-term:  To provide liquidity to MM’s who would trade the borrowed DAI on L2’s (Optimism, Arbitrum, starkNet) only, hence increasing DAI’s exposure on those RWA lending strategies - we have got one live strategy and currently onboarding few more  We are obviously open to suggestions on how this could be structured the best way and the decision making process is the most efficient. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.983164983164984
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#20",
                    "likes": "7",
                    "time": "14/04/2022-00:14:50",
                    "content": "    MadShills:  This looks good, but almost too good to be true. 9% rates with 0 defaults? Why are the rates so high? In the “cons” section, I don’t see default risk? High rates usually offset high risk.    That’s a good callout and I should have included “default risk” in the cons section. The majority of our existing loans have gone to reputable crypto firms (Alameda, Wintermute, etc.) where we’re doing a detailed analysis of their financials, existing debt, and a number of other factors. I think the fact that there have not yet been any defaults and that we’ve been able to bring on a number of smaller, lesser-known borrowers is a testament to the quality of our underwriting standards to date. That said, there is of course default risk on an uncollateralized loan.      MadShills:  Could you please help us understand more about your product, please?    TrueFi is the first uncollateralized lending protocol and aims to be the leading protocol allowing Asset Managers (we call them “portfolio managers”) to run lending strategies on-chain. Apart from already-proven lending strategies to crypto-native institutions, TrueFi is actively working with 3rd party Portfolio Managers who are interested in running their strategies on our protocol. We are aiming to bridge the gap between RWA and DeFi and provide a platform where RWA originators can access crypto capital.      MadShills:  Are these undercollateralized or uncollateralized loans?    These loans are fully “uncollateralized”, meaning that no collateral is held on-chain (like an AAVE) or off-chain (like a BlockFi). While they are “unsecured”, we have significant lender/creditor protections in place in our credit agreement (covered below).      MadShills:  Can you please explain to us a little bit more and describe who your borrowers are?    To date, our borrowers have mostly been crypto trading firms. Our largest borrowers have been Alameda Research, Wintermute, and Amber Group. In general, they are employing ‘delta neutral’ trading strategies where their risk is hedged. In line with our expansion towards RWA markets we have successfully onboarded one (and are currently onboarding a few more) FinTech firms (see Delt.ai coverage) who want to use crypto loans to enable their businesses (not unlike venture debt). At the same time, we are onboarding 3rd party Asset Managers who will run their own portfolios and lend to RWA markets. They potentially will also be interested in using DAI as an underlying asset.      MadShills:  How do you protect against default?    Underwriting in our existing pools includes a comprehensive borrower diligence review including analyzing asset coverage, reviewing structural considerations and modeling recovery scenarios in the unlikely event of an administrative proceeding. Some (non-comprehensive examples) of how we mitigate default risk in our founding pools include: a. Rigorous onboarding, including deep financial DD & KYB b. Restricting borrower scale-up based on repayment history c. Strict requirements around maintenance covenants d. Quarterly or monthly reporting requirements from borrowers e. Borrowers are contractually required to represent their financial position and ability to service new indebtedness  You can find more in the underwriting section of our docs, here.     MadShills:  Are they offering to secure loans with their books?    What do you mean by this exactly? I am going to assume you mean “are we checking for credit quality or running a formal underwriting on the end borrowers?” If so, yes and I expanded a bit on that process above. Additionally, I’d add that when we’re underwriting a borrower (some of this is specific to crypto borrowers), we are looking at specific factors such as making sure their capital is not used for margin collateral or not used in other secured lending agreements (whether on or off-chain), We do not rely on factors such as on-chain transaction history or reputation alone      MadShills:  You note 0 defaults but your total interest revenue graph suggests you hit 1mm in revenue monthly very recently, in 2021 and a total lifetime revenue of 19.32mm. The protocol may be promising, but it does appear quite young.    At this point, we are ~17 months old having launched November 21, 2020. Benchmarked against Maker, yes we’re young. Benchmarked against broader DeFi we’re middle-aged. Benchmarked against on-chain uncollateralized lending, we’re the oldest. Since TrueFi’s launch, 103 loans have been repaid worth $1.0B in total. The interest revenue metric we show is recognizing interest revenue as it is repaid on-chain, meaning this measure lags by 90 to 180 days (the typical duration of a loan). TrueFi has been regularly generating >$2M in monthly interest revenue since Oct 2021.      MadShills:  What is your procedure here? How do you handle defaults?    Besides the docs mentioned above, we’ve written a pretty extensive blog post on the topic. If you feel this is not satisfactory or still have questions, please ask and I will answer.      MadShills:  What would happen if a borrower fails to pay back their loan from the Maker pool?    For our first pool with MakerDAO, we would plan to only underwrite our most creditworthy/largest borrowers to decrease the risk of default. For future pools with MakerDAO, we are building pool-by-pool tranching so that MakerDAO will only be lending to the senior tranche (taking a lower rate and also taking on less default risk). Past those precautions, TrueFi would follow the default and collections response described above.      MadShills:  You note Maker can “customize” loans? How would that work? Can you please describe what you are thinking or hoping for?    Yes! So as mentioned in the post, we have a long pipeline of (non-crypto) borrowers. In many cases, they need to convert to fiat anyway and so they’re fairly agnostic towards the stablecoin they borrow in. If/when the D3M is approved, I plan to go to the MakeDAO core units (growth, lending oversight, etc.) with a few of the borrowers in our pipeline and get feedback (based on the type of loans, risk profile, yield) to understand what MakerDAO would most like. Additionally, in the same way that groups like RWA presented the Huntingdon Valley Bank opportunity to Maker directly, we are going to be working with managers who can originate those opportunities on TrueFi and present them to Maker/the D3M, as well. The hope is that once the D3M technical integration is done, originators may find it easier to use TrueFi’s rails to tap into DAI liquidity than to go direct.      MadShills:  50-100mm is quite a significant debt ceiling considering your total origination value is only 1.3 billion to date. 100mm at 9% in 1 year would generate approximately 50% of your lifetime revenue to date? What are we missing?    The 50-100mm debt ceiling was suggested to us by some of the core units. We are happy to discuss this figure This would not be a 1-year loan to start. The bulk of TrueFi’s $20M in lifetime interest revenue has come over the past few months because most of TrueFi’s originations have happened since last summer on 90 or 180-day loans.      MadShills:  Can you please walk us through some reasonable revenue projections at various debt ceilings and how that compares to your business to date?    We basically have two revenue models for the protocol at the moment. Out of our core “pools” (USDC, TUSD, USDT, and BUSD), stakers take 10% of the total interest generated when interest is paid back. We’ve also recently introduced “portfolios” where anyone can come on and create a lending portfolio on TrueFi. These take a 50bps origination fee when the loan is distributed. For this first 50-100mm with MakerDAO debt ceiling (let’s call it 100mm for easy math), we would put this into a portfolio since you would be the only lender. As a result, if we deployed 100mm worth of 90-day loans that would generate $123,288 in protocol fees (100mm * (90/365) * 50bps). The reason these fees are lower than our pool fees is that we want to attract the best managers and leave room for them to be able to set their own fees. You can play around with an example here.      MadShills:  This integration is not only high risk line of credit to your benefit, but would significantly enhance your position in the market.    It would! And I think given the total amount of capital that Maker is available to lend, Maker will be high impact for a lot of the protocols that it lends to.      MadShills:  Have you considered providing Maker holders additional gains in exchange for this halo effect?       MadShills:  How are you incentivizing Maker’s contribution to Truefi, beyond the yield?       MadShills:  Is there preferential liquidity mining or other incentives you are able to offer us compared to your average user?    This has not been discussed but we are open to discussion. As mentioned in the original post, we’re ~1-2 months out from moving to full decentralization of the protocol and given the overall sophistication of MakerDAO’s governance, we’d love to work in closer collaboration, get your members involved in our governance, and overall foster long-term collaboration between our protocols.      MadShills:  We are interested to see what you have considered to offset the asymmetric risk between Truefi and MakerDAO.    We are working closely with the core units who are responsible for diligencing the different managers and underlying loan opportunities.      MadShills:  In terms of implementation, what are the technical requirements for an integration like this? The D3M was written for liquid in and out. As you note, these are not liquid as an inherent risk. Can someone from PE comment on the challenge here and how much work it would be to get this off the ground?    I’ll leave this up to PE. Let me know if you want me to chime in. But at least on the TrueFi engineering side, we’ve dedicated one of our most senior engineers (Bartek) to focus on the technical integration if/when we get to that stage    Thanks for all the questions @MadShills. Happy to answer any more that you might have! ",
                    "links": [
                        "https://docs.truefi.io/faq/main-lending-pools/borrow#what-is-the-credit-review-and-how-is-it-conducted",
                        "https://docs.truefi.io/faq/main-lending-pools/risk-mitigation/safu-secure-asset-fund-for-users",
                        "https://blog.trusttoken.com/mitigating-risk-truefis-loan-default-process-454359a8c4b",
                        "https://docs.google.com/spreadsheets/d/1kxLBr2SprrMaueEW5X1qDvoc8fXASmhmKUe3bfDE1-o/edit?usp=sharing",
                        "https://twitter.com/barrutko"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.758941996298867
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#21",
                    "likes": "0",
                    "time": "14/04/2022-00:52:53",
                    "content": "    Frank_Brinkkemper:  [Signal Request] Onboard D3M For Notional Finance - #17 by Frank_Brinkkemper Say TrueFi offers a token representing the shares of the deposit, Maker could consider onboarding that token in stead of the D3M. That means that users of this onboarded token can leverage their deposit in TrueFi. Going for this direction would mean that the returns are shared between the users of the collateral and Maker, while the risk for Maker is reduced by the users taking on defaulting risk. I think moving forward I think it would make sense for protocols that propose a specific method for integration, to also state why they believe that that method for integration is the best method for the use case.   Integration Paths into Maker @RyanRodenbaugh Appreciate your reply and explanation above.  Have you considered the path Frank mentions? To be upfront, for TrueFi to rely solely on Maker PE for tech is not a great business practice for either side. Since this is DeFI, third party protocols have the opportunity to invest upfront and write their own integrations. There are other means of interacting with Maker that could be more appropriate. Would you and Bartek be willing to perform the technical research upfront regardless of the outcome of the signal? It would ultimately be to your benefit and increase your chances to go live. Some past integration proposals have lacked the requisite technical understanding of Maker which effectively killed them before they could start. Rates Also, could you comment on the rates we could anticipate on our early pools? For example, should we reasonably be expecting 9% like your loans to MM or are these going to go down when you interact with lower risk RWA lenders ? How would you deploy 100mm on your own platform today if it were your money? In the example you provided, you are taking 50bps fixed regardless of the total rate, so it could be a substantial portion if the total rate is lower, closer to 3 or 4%.     RyanRodenbaugh:  For this first 50-100mm with MakerDAO debt ceiling (let’s call it 100mm for easy math), we would put this into a portfolio since you would be the only lender. As a result, if we deployed 100mm worth of 90-day loans that would generate $123,288 in protocol fees (100mm * (90/365) * 50bps). The reason these fees are lower than our pool fees is that we want to attract the best managers and leave room for them to be able to set their own fees. You can play around with an example here.   Regulatory Risk One question about your regulatory risk, if I understand correctly, you KYC/AML borrowers but not lenders? So anyone can deposit into any pool and generate returns from your borrowers. If this is true, that may be problematic. I appreciate you are moving toward decentralization, but do you have any relevant legal opinions that would give us confidence you won’t get shut down? If something like this happened what would happen to our capital in such an instance? Do you have an unwind or emergency shutdown protocol? Thanks for your time. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1kxLBr2SprrMaueEW5X1qDvoc8fXASmhmKUe3bfDE1-o/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.765523828023827
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#22",
                    "likes": "3",
                    "time": "14/04/2022-01:49:45",
                    "content": "    MadShills:  So anyone can deposit into any pool and generate returns from your borrowers. If this is true, that may be problematic.   Can you please explain why this distinction is relevant?     MadShills:  appreciate you are moving toward decentralization, but do you have any relevant legal opinions that would give us confidence you won’t get shut down?   Though I would like to see some formal guidance, I doubt TrueFi will make their privileged attorney memos available for us to review. Other projects applying to on-board have not done it – even where it was clear they push Maker into security issuance land (e.g., Deco) – so I wouldn’t fault TrueFi for failing to disclose as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.980902777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#23",
                    "likes": "9",
                    "time": "14/04/2022-01:57:13",
                    "content": "I am reading all the commentaries here, both from Maker community and from TrueFi’s team, with interest. As prospective facilitator of the incubating Lending Oversight Core Unit, I have been part of the discussions with TrueFi (and other) and I am happy to see them posting the Signal. I wanted to provide a bit of colour to the community on why I think this integration makes sense, potentially, for the protocol - if certain conditions are respected.  Why a D3M-like integration with a protocol like TrueFi (or similar) makes sense for MakerDAO We have seen, based on our experience with real-world assets, that approving a loan and connecting it to MakerDAO is very complex. There is a lot of legal legwork to do, and we are subject to adverse selection by being one of the largest DAOs with one of the lowest cost of capital out there - but still not equipped internally or either structured to do appropriate underwriting. The reasons it would make sense to me, in the long run, to be a programmatic liquidity provider into protocols like TrueFi and others are the following:  Most of the origination heavy lifting can be abstracted away from the protocol - Maker’s competitive advantage is its size and cost of capital, not is ability to collaboratively and collectively react to market conditions Underwriting and alignment of interest can be observed, ideally on-chain, through the interaction between (KYC’ed) borrowers, institutional active lenders, passive liquidity providers, and the protocol - this doesn’t happen for the traditional asset managers that have engaged with MakerDAO so far Structuring, tokenisation, and trenching can be performed by the protocol - given Maker’s size, it can be expected that those protocols will work hard to morph their business model in order to adapt to our needs The relationship can be mutually beneficial: Maker wants simple and safe access to collateral for low fees and low legwork, and the protocols want a cheap source of funding that can make their whole business more attractive The D3M type of integration can allow Maker to stabilise supply of capital and interest rate, attracting better borrowers that are today afraid of the unpredictability of DeFi yields - and the inability to get fixed rates - we should, however, remain structure-agnostic when we assess all the risks and benefits of an integration    What we should pay attention to This integration, especially in its first iteration, will not be without significant execution, technological, and financial risk. We need to be aware of this, structure things appropriately, and size them and price them. What I think is particularly important:  Although we like the fact that DAI gets lent out to MM because this improves the liquidity of DAI across L1s and L2s, we are aware that this adds additional crypto-correlation to the collateral mix, we should consider this carefully Default risk is a real risk here - I personally dislike deeply strategies that have shown 0 observed default, as it means simply that they have been in a business that hasn’t gone through any credit cycle and that their exposure is not granular enough to be statistically significant - I second @MadShills here that expected rate is proportional to expected risk, on average Real-world use cases are definitely preferable - as I mentioned before, we should use this potential collaboration (and others) to facilitate the migration of traditional use cases without us having to negotiate deal-by-deal all the idiosyncrasies of institutional deal making; by providing a cheap credit line we can be instrumental to this de-risking process, especially in an environment of rising interest rate We should try to push the protocol to lend out to either regulated/ listed/ visible companies that see default as a huge negative, and/ or to lend out to several uncorrelated companies where one default is not too correlated with the rest of them We should push hardly for a structure that protects us on-chain, discounting heavily any weak guarantee off-chain - borrower selection, structuring, trenching, sizing of the pool, these are all elements of this effort - this means preferring trenching where first loss is provided by the asset manager / originator, mezzanine tranche is provided programmatically by passive liquidity providers that seek attractive (i.e. > AAVE) yield, and then it’s Maker  More in general, I believe we should as a community go into this exercise with our eyes wide open. Undercollateralised lending on-chain is experimental, hasn’t gone through a full credit cycle, and is mainly self-contained as it lends to firms active in crypto that take crypto risk themselves, even if somehow hedged. Plus the additional overlay of not having on-chain hard guarantees. Yet, it is promising, as those protocols are instrumental to facilitate the migration of lending (and of sophisticated on-chain underwriting that includes staking and tokenomics) into DeFi - ultimately, what DeFi needs are more and more sustainable use cases than simply trading on the margin. Although I see this more as a technological initiative, and I will let @hexonaut, @monkey.irish and @Nadia comment on this front especially when it comes to the D3M vs the standard collateral onboarding process, I can assure the community that Lending Oversight (not yet ratified), Legal and Transaction Services (not yet ratified), and RWF-001 (facilitated by @williamr) will look closely to what type of borrowing and lending is proposed by TrueFi and the likes, and will provide guidance to all stakeholders when it comes to the points I indicated above. Regards, Luca ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.609084467120181
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctcunning",
                    "index": "#24",
                    "likes": "1",
                    "time": "18/04/2022-17:48:39",
                    "content": "I was curious the process flow within Maker for evaluating / proposing a D3M vs the underlying risk and collateral that fills up such a D3M? Through the previous MIP 6 Process, the RWF CU (which has seen it’s fair share of change) would typically review any MIP 6 alongside the Community and then a formal process of Due Diligence would commence with eventual structure and onboarding being submitted for an Executive Vote. How does any D3M, whether it be for digital native assets or RWAs, have the underlying collateral structure, and counterparties of such a D3M be risk assessed, attested, and then such results/outcomes be submitted to the Maker Community for further review, scrutiny, debate/discourse, and eventual approval / vote (signal, greenlight, executive)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.070833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#25",
                    "likes": "4",
                    "time": "18/04/2022-20:26:37",
                    "content": "Let me give you a little background then I’ll answer your question. In the past, most proposers of new collateral have started with a MIP6 and followed the collateral onboarding process. The MIP6 gets into a lot more detail about the business opportunity and collateral. In this forum post, a Signal Request (SR) is different than a MIP6 process so we published  some guidance around what happens next. Overall, here is the process we follow:  COB Process Flow-sum1352×739 53.8 KB  If the SR and Governance Poll are successful, this “collateral” would be greenlit and ready for prioritization. The question of, “what is the collateral?” still remains open. The MIP6 application gives us a better idea of what is being proposed so feedback happens much earlier in the process. The core units responsible for the ultimate assessments (later in the onboarding process) typically ask the risk type questions. In the D3M and TrueFi case, it would most likely be both of our Risk and RWF core units. By the time we finish the assessment phase, all the details are well understood and documented. The issue with the D3M is there is a little conflation between the collateral technology and the actual collateral being onboarded. In the development of the D3M, we’ve used a few projects as use cases so I understand where the confusion is coming from. Moving forward, the D3M is a collateral technology and by itself, does not onboard collateral. To onboard collateral, we need to follow the onboarding process listed above and I would suggest a MIP6 for the actual collateral. The appropriate teams will do the due diligence. It’s my core unit’s responsibility to move the collateral through the process and provide status updates. I’m always available for a consultation about the collateral onboarding process. ",
                    "links": [
                        "https://collateral.makerdao.com/",
                        "https://forum.makerdao.com/t/clarity-around-collateral-onboarding-process/14221"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.568462401795735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctcunning",
                    "index": "#26",
                    "likes": "1",
                    "time": "19/04/2022-18:49:43",
                    "content": "Incredibly helpful and thanks for the thorough response and insight, as well as the links to the previous posts. I wanted to make sure understand the Process Steps of Prioritization vs. Assessment. As I understand it:  Polls (SR+Gov) green light the D3M for Prioritization. Prioritization occurs before Assessment. Assessments are led by the Risk and RWF Core Units  I’m reading in your Clarity Post that “the collateral stakeholders (Domain Teams) will be able to correctly prioritize all collateral work, regardless of how collateral is greenlit, to determine which collaterals are scheduled to be onboarded and continue with the COB process.” And I can see the collateral Prioritization Framework  from October 2020 here: Collateral Onboarding Framework - a model And the collateral Prioritization Pipeline here: Collateral Framework Official - Google Sheets But I guess perhaps the disconnect I’m feeling is this: The majority of this is Greenlit but it’s unclear how long the majority of these Applications have been in that “Status”. Further, it’s unclear to me who/how those decisions are made on an ongoing basis (scoring / prioritization and Status update). A couple of further thoughts:  How does the Applicant and Community understand / discuss the Prioritization scoring as it is given to an application? Has the Framework been updated in meaningfully / reviewed in the past 18 months? The Greenlit Poll feels public and clear with community input, while prioritization seems a bit harder to understand and more private.  If #3 is something you agree with, I’d love to see some of these Applications be Prioritized more publicly with input from the Domain Teams. Hopefully this is helpful and happy to discuss further as well. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1IX9e2fyfz7djtDMKn5gMyGsyFxHoY75GncMbAjnSXrM/edit#gid=0"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.053030303030304
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#27",
                    "likes": "6",
                    "time": "19/04/2022-19:30:39",
                    "content": "Correct on your Prioritization vs. Assessment. I recommend the MIP6 process since it’s the one I feel will get through the process most efficiently. On the second half of your reply, on Thursday, we’ll formally release the new Collateral Status Index with tons of clean up. In Q1 2022, CES and the collateral stakeholders did a deep dive to iterate on the first phase of the collateral onboarding process. The cleanup is almost done and good enough to make it final. This gives a pretty good summary of what was/is going on, Request for Definitive Description of Collateral Onboarding Process - #13 by monkey.irish On Weds next week, I’ll be doing a presentation to talk all about this, the changes we made, and what to look for in Phase II of the collateral onboarding process. The presentation detail forum post should come out shortly from GovComms. The prioritization in its current form relies A LOT on the information in the collateral application. If it doesn’t have the detail required, it makes it harder on the Domain Teams to score it. That is why I recommend the MIP6. The latest iteration of the MIP6 collateral application template is being voted on now. For RWAs, there is a MIP67 moving the voting process and this will again help the Domain Teams with additional clarity during the collateral application process and when prioritizing collateral. In addition, we published MIP6 collateral guidelines. The prioritization is a scoring/weighted structure given by the Domain Teams closest to the action. It’s a very qualified group to produce the scoring. Please note, the scoring is one dimension in making a decision on the next collaterals to move into the assessment phase. ATM, the stakeholders in  our On and Off-chain alignment meetings are making the actual prioritization decisions. Where we lacked is communicating the results of that prioritization. We’ll start doing that this Thurs. All this to say is that we listened and understood the problems with the current process and have made some major changes in our transparency and communication. And…there is a Phase II coming which will introduce many changes to the process and the MIP structure. It’s a big job and we decided not to wait by first iterating the current process so we can better address the long-term, ongoing collateral onboarding needs of the protocol. The net for you is, please follow the process and we’ll move you through it so you’ll get a timely decision on whether we can/will onboard your collateral and when. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6c3-sp2-modify-the-collateral-application-form/13787",
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.818769592476489
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#28",
                    "likes": "2",
                    "time": "24/04/2022-16:23:47",
                    "content": "    twblack88:  I hate to be the wet blanket, but connections to the 13th largest TRU holder hurt the TUSD team’s relationship with the community.   Hi @twblack88 sorry to have missed this. Moving our DMs to the forum for everyone’s benefit. TLDR is that this person has not participated in our governance to date and we have no reason to believe from our conversations that he would impede our protocol or this relationship at all. His large TRU holdings come from his participation as one of our larger lenders over the past 6 months. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.9744897959183674
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#29",
                    "likes": "0",
                    "time": "25/04/2022-16:32:39",
                    "content": "Thank you for the clarity and transparency! If you don’t mind, humor our community’s quest for game theory:     RyanRodenbaugh:  impede our protocol or this relationship at all   Based on holdings, would the above even be possible?  My hunch is no, but figured I’d clarify a little more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.9125000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#30",
                    "likes": "1",
                    "time": "25/04/2022-23:48:32",
                    "content": "Based on existing holdings, “said individual” would likely have enough to veto some governance decisions or at least make a lot of votes pretty close yes/no decisions. But the person would not have enough to e.g., vote to send themselves the entire treasury. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#31",
                    "likes": "8",
                    "time": "25/04/2022-23:50:17",
                    "content": "The poll is now closed (I can unblur, but was not sure what practice was here). We will be working with governance facilitators to move this to the next greenlight poll cycle.  CleanShot 2022-04-25 at 18.49.01822×571 32.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is updating on progress and next steps"
                    ],
                    "Sentiment": 4.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#32",
                    "likes": "5",
                    "time": "27/04/2022-09:42:55",
                    "content": "Confirming this  Weekly Poll will go onchain on Monday using the “Investigate Implementation” wording we have developed for new D3M integrations. CC: @collateral-core-unit ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.590909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#33",
                    "likes": "1",
                    "time": "28/04/2022-11:17:42",
                    "content": "Yo ho! When do we get a discussion ‘bout which swabbie will actually manage a pool?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#34",
                    "likes": "2",
                    "time": "28/04/2022-11:38:42",
                    "content": "If I’m understanding your question correctly (not entirely sure), seems like that would be appropriate after the MKR holders vote on if this should be investigated. If the vote on the poll is for the affirmative that should come up during the assessment phase if investigating implementation, and would be an appropriate thread to have a discussion about. You are, of course, welcome to start a thread before that point in time, but would want to keep in mind that if the poll is voted down the discussion would be moot. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.662037037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RyanRodenbaugh",
                    "index": "#35",
                    "likes": "4",
                    "time": "28/04/2022-15:59:40",
                    "content": "Yes, @Piratical, I agree with @prose11 here. From my discussions with Maker Team:  it will be the result of the risk assessment where we will set the parameters to onboard this D3M   the next steps are: (1) on Monday Governance will add you to the weekly poll → this is where all delegates have to vote to greenlit this D3M (2) once it’s greenlighted, we have an internal prioritization process, where we will ask to prioritize this collateral to initiate the assessments asap (3) CUs work on the assessment and post it when it’s ready, which gives us the risk parameters of the vault (4) it goes trough the governance cycle to include the collateral  I believe it is at step 3 here where we will decide which “swabbie” will actually manage the pool. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#36",
                    "likes": "0",
                    "time": "28/04/2022-16:34:49",
                    "content": "I’m really looking forward to see which swabbie makes it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#37",
                    "likes": "2",
                    "time": "03/05/2022-09:36:41",
                    "content": "The on-chain poll for this proposal is now live. Thank you to everyone that participated in this signal request. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#38",
                    "likes": "0",
                    "time": "02/06/2022-19:37:25",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "787"
}