{
    "poll_list": [
        {
            "title": "Ratification Poll for Declaration of Intent - Onboarding a new collateral type backed by B.Protocol v2 (MIP13c3-SP11) - August 9, 2021",
            "index": "8802",
            "option": "Yes",
            "supporting_mkr": "18,116",
            "highest_fraction": 0.92
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip13c3-sp11-onboarding-a-new-collateral-type-backed-by-b-protocol-v2-declaration-of-intent/8802",
            "title": "MIP13c3-SP11: Onboarding a new collateral type backed by B.Protocol v2 (Declaration of Intent) ",
            "index": 8802,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#1",
                    "likes": "14",
                    "time": "16/06/2021-11:43:23",
                    "content": " Preamble MIP13c3-SP#: 11 Author(s): Yaron Velner (@yaronvel) Contributors: n/a Status: Request for Comment (RFC) Date Proposed: 2021-6-16 Date Ratified: <yyyy-mm-dd> Declaration Statement: Onboarding a new collateral type backed by B.Protocol v2. Declaration to Replace: n/a   Specification  Context and Motivation  Maker, and the DeFi ecosystem in general, has conservative collateral ratios (CR), in order to mitigate potential failures in the liquidation process. High CRs narrows the potential user base, and the potential profit from stability fees (SF), and reduces capital efficiency in the market. B.Protocol introduces the concept of a backstop made of committed liquidators, who get priority in the liquidation process, in return for their commitment to execute liquidations. B.Protocol has been live since October 2020, and few successful liquidations were already done . B.Protocol’s V1 was designed as an opt-in system, where users can decide to manage their Vault with, and give priority to the backstop liquidators. B.Protocol liquidators in return share some of their proceeds with the users. In particular, it requires MakerDAO users to interact with a new set of smart contracts. The V2 of B.Protocol is based on the B.AMM. A user based liquidation system, with a novel rebalance algorithm that combines Curve Finance’s stable swap invariant with a price oracle. An experiment is proposed for a native integration between B.Protocol v2and the MakerDAO system, by on-boarding a new collateral type, namely WBTC-B or ETH-D, with lower CR than WBTC-A or ETH-B (respectively), which will be natively backed by at least 1M Dai deposits in the B.AMM. This proposal replaces proposal MIP13c3-SP9, with the more robust design of the backstop.   Committed backstop design using B.Protocol V2 The B.AMM will pool DAI deposits from users and will deposit it to the Maker’s DSR system where it will get some yield when the DAI is idle, and not used for liquidations. Upon liquidation, the flip contract will transfer the WBTC-B collateral to the B.AMM, who will give DAI in return, with a 5% discount over market price. The DAI will be used immediately to repay the undercollateralized vault debt in return for the discounted collateral. The B.AMM will offer the WBTC-B for sale according to a special formula that is described in the whitepaper. Once the WBTC-B is converted to DAI, it will be deposited back into the DSR. It is a trivial observation that 1M Dai deposits can trivially handle 1M Dai liquidations. And the experimental results in the whitepaper show that X deposits can cover up to 10X of monthly liquidations.  Declaration Detail Maker Governance declares its intention to experiment a native integration with B.Protocol’s V2. Namely, to on-board a new collateral that gives a priority(*) in liquidations to B.Protocol, in return to an on-chain commitment of 1M Dai locked funds for the duration of the experiment, towards successful liquidations. (*) If B.Protocol fails to liquidate a Vault, then the Vault will be liquidated by the standard Maker keepers, like today. Further, it is the governance intent that:  The development work will be done by the B.Protocol team, to the satisfaction of the protocol engineering core unit. The collateral price oracle will be recommended by the oracle core unit. The risk parameters, namely, the CR, debt ceiling, and auction parameters (if still applicable) will be recommended by the risk core unit. Stability fee and liquidation penalty will be discussed again with the community, in the form of signal requests.  Links:  Discussion: WBTC-B collateral type, backed by B.Protocol with x10 leverage 6 [INFORMAL POLL] Would the Maker Community want to onboard a new collateral (e.g., WBTC-B), backed by B.Protocol that has lower CR with the same SF?  Collateral Onboarding Community Call by 1 @juanjuan   ",
                    "links": [
                        "https://forum.makerdao.com/t/technical-report-b-protocol-liquidations-during-last-thursday/5389",
                        "https://medium.com/b-protocol/b-amm-efficient-automated-market-maker-for-defi-liquidations-fea7b0fdc0c5",
                        "https://forum.makerdao.com/t/mip13c3-sp9-onboarding-a-new-collateral-type-backed-by-b-protocol-declaration-of-intent/5920",
                        "https://cloudflare-ipfs.com/ipfs/Qmb2ZMk7F48jYSwJczdJeqXJz7CZVh8H4KnfyNdHZSMRG5",
                        "https://forum.makerdao.com/t/discussion-wbtc-b-collateral-type-backed-by-b-protocol-with-x10-leverage/5409",
                        "https://forum.makerdao.com/t/informal-poll-would-the-maker-community-want-to-onboard-a-new-collateral-e-g-wbtc-b-backed-by-b-protocol-that-has-lower-cr-with-the-same-sf/5652",
                        "https://www.youtube.com/watch?v=CaDnKAlCpiM&feature=emb_logo&ab_channel=MakerDAO",
                        "https://forum.makerdao.com/u/juanjuan",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-10-17-2022/13292",
                        "https://forum.makerdao.com/t/statement-regarding-b-protocol-v2-and-maker-integration-and-risk-considerations/13257",
                        "https://forum.makerdao.com/t/b-protocol-v2-integration-technical-review/12019",
                        "https://forum.makerdao.com/t/wbtc-b-and-wbtc-bprot-a-review-and-plan-of-action/11191",
                        "https://forum.makerdao.com/t/maker-relay-ep-58-en-espanol/9949",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948",
                        "https://forum.makerdao.com/t/riskdao-delegate-platform/18125",
                        "https://forum.makerdao.com/t/maker-relay-ep-58/9892",
                        "https://forum.makerdao.com/t/weekly-mips-update-49/9890",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/weekly-mips-update-48/9757",
                        "https://forum.makerdao.com/t/weekly-mips-update-47/9648",
                        "https://forum.makerdao.com/t/mip13c3-sp9-onboarding-a-new-collateral-type-backed-by-b-protocol-declaration-of-intent/5920/19"
                    ],
                    "GPT-summary": "The post is a proposal for Maker Governance to experiment with a native integration with B.Protocol's V2 by on-boarding a new collateral type, namely WBTC-B or ETH-D, with lower CR than WBTC-A or ETH-B (respectively), which will be natively backed by at least 1M Dai deposits in the B.AMM. The proposal explains the committed backstop design using B.Protocol V2 and the governance intent for the development work, collateral price oracle, risk parameters, stability fee, and liquidation penalty. The post also includes links to discussions and community calls related to the proposal.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.450440115440115
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#2",
                    "likes": "3",
                    "time": "16/06/2021-13:58:03",
                    "content": "Pleasantly surprised to see this proposal and look forward to seeing the B.AMM in action. Good luck @yaronvel. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/06/2021-14:03:08",
                    "content": "Hey @yaronvel, could you please propose a PR here for the new proposal? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.965909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "10",
                    "time": "16/06/2021-14:14:50",
                    "content": "    yaronvel:  Declaration Detail   This section is very clear, succinct and comprehensive. Well done! I’m excited to see the outcome of this declaration. I’ll ping @Risk-Core-Unit @Oracles-Core-Unit and @Protocol-Engineering here to ensure they are aware of the contents that involve their units. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#5",
                    "likes": "2",
                    "time": "16/06/2021-14:17:27",
                    "content": "    yaronvel:  Proposed: 2021-6-16 Date Ratified: <yyyy-mm-dd> Declaration Statement: Onboarding a new collateral type backed by B.Protocol v2. Declaration    Thanks. It will also be great to present it in one of the governance calls. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.420454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#6",
                    "likes": "3",
                    "time": "16/06/2021-14:22:22",
                    "content": "@yaronvel I had the time to add it Github, so don’t worry about this anymore  Reference: mips/MIP13c3-SP11.md at master · makerdao/mips · GitHub ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#7",
                    "likes": "5",
                    "time": "26/06/2021-00:24:08",
                    "content": "Thanks for the interesting proposal! Some initial thoughts:   The B.AMM design relies up-to-date oracle prices, whereas the Maker system currently uses only delayed prices. This is to allow time for reaction against oracle manipulation. Thus the new mechanism increases the impact an oracle manipulation attack could have (as collateral could potentially be sold at a very low price even if the delayed price is reasonable). The Risk+PE+Oracle teams should discuss this thoughtfully and consider whether the potential benefits outweigh the additional risks.   Who will have control of the StableSwap A parameter used by the B.AMM–Maker governance or B.Protocol governance?   How will the fallback to the Maker liquidation system work? How does the system know if a Vault has been “missed” by B.Protocol? This mechanism may be non-trivial. One concern: in the case that fallback to the Maker system is necessary, it seems there would be much greater risk of auctions underperforming since the collateralization ratio will presumably be set lower for the new ilk (otherwise there is not much point to integrating B.Protocol, since the main benefit of this should be lower collateral requirements resulting in a more attractive self-borrowing offering).   Of course we do not necessarily need to completely resolve all concerns before trying things with a low debt ceiling, but these areas and potentially others should be discussed in more detail first. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.919665404040404
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#8",
                    "likes": "4",
                    "time": "26/06/2021-08:22:17",
                    "content": "Thanks for the questions. Before replying to each of the questions it is important to observe that some are related to B.AMM user risk, and not to Maker risk, which give rise to the question if Maker should care about B.AMM user risk. The short answer is that it should care, but there are ways to mitigate it. On the most extreme case, B.AMM users might lose a lot from bad trading, and then fewer funds will be available to backstop the new collateral. However, an important observation is that the B.AMM dai balance can decrease only when liquidation happen. Therefore a mechanism that will peg the ilk max debt (line) to the B.AMM dai balance (possibly with some factor), could mitigate (or even fully mitigate if the factor is 1) B.AMM user risk from affecting the stability of Maker. Will now reply to each of the questions:   At least initially we can make it a B.AMM user risk. Meaning if the gem does not suffice for 1.05 * debt, then we can set the B.AMM to agree to take all the gem in return to repaying all the debt. Regardless to what the oracle price is. Bad oracle price would damage the rebalance process, but this is again user risk.   The parameter only affects the rebalance process, so it is again user risk, and should be under the control of the users (meaning B.Protocol). We can consider have the Maker governance dictating a range for possible As.         Kurt_Barry:  How will the fallback to the Maker liquidation system work? How does the system know if a Vault has been “missed” by B.Protocol?   The idea is that when calling bite it will check if the B.AMM can take it. And if not, it will execute the current auction process. Note that since liquidation 2.0, the dss relies on an external user to call bite. So there is no difference in that regard.     Kurt_Barry:  One concern: in the case that fallback to the Maker system is necessary, it seems there would be much greater risk of auctions underperforming since the collateralization ratio will presumably be set lower for the new ilk   This is true.  And eventually it is a matter of trust in the system (in the system code, and crypto economic incentives). Initially it will be easy to mitigate by setting the line to values that are not far away from the B.AMM dai inventory. But over time the idea is to have a partial reserve system. Still I would argue that it is safer than the current state. In the present state there is no public knowledge on the amount of liquidity available towards liquidations, which makes it impossible for the DAO to make a fully transparent evaluation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.214302112029385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#9",
                    "likes": "2",
                    "time": "26/06/2021-13:58:40",
                    "content": "Hope to see the B. AMM up and running soon to see how it handles a bear/choppy market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/talbaneth",
                    "index": "#10",
                    "likes": "3",
                    "time": "27/06/2021-12:10:27",
                    "content": "Very promising. Initiatives like this, which effectively allow lowering the CR and attractive leveraging can potentially grow to great sources for generating DAI. Some comments on the price oracle initial discussion: As I understand there are a few price feeds/oracles in the mix:  The price feed for triggering the liquidation (i.e calling bark). The price feed anchoring the proposed 5% liquidation price discount. The price feed used for the rebalance process algorithm.  I think that the price feed for triggering the liquidation (1) should remain the OSM delayed price. This will conform with the current liquidations system which tries to reduce price manipulation risk. The price feed anchoring the discount (2) should probably be a live feed (not delayed), but should also be trusted by Makerdao. This could possibly be the raw medianaizer, though we need to see if its resolution is fine grained enough. Regarding the price feed for rebalancing, ideally it would be the same as (2), but this should be further discussed with B.Protocol, as this is more on their side of the system and could be generic for other platforms. Regarding the mitigation suggested for an oracle manipulation, if I understand what is proposed is that if the price is low enough causing not all debt to be repaid (tab is not reached, leading to potential bad debt) - then all of the debt will be paid in return for all collateral. I think this is reasonable - it will effectively put a lower bound on the price, which should be deducted from the OSM delayed price. Note that this indeed puts the risk on the B.AMM users (not only in a manipulation but also in a potential “regular” flash crash), and not on the maker system. Overall this seems to me like a good experiment to cooperate with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.759543512043512
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#11",
                    "likes": "2",
                    "time": "29/06/2021-19:55:40",
                    "content": "Thanks @yaronvel, I would say overall I agree with your responses–most risks can be primarily B.AMM user risks initially, and establishing a relationship between an ilk's line and the B.AMM liquidity available for it would be a good mitigation. Some custom logic will be needed for the fallback, but I think it can be done without replacing any core contracts (and we might re-factor the liquidation system in the coming months to simplify this sort of integration, although that is not a blocker). I like @talbaneth’s comments on oracle considerations too–delayed price for liquidation, a Maker-trusted current price for discounting, and a B.AMM-determined price for rebalancing. The key challenge from a risk perspective seems to be making sure the discounting price and rebalancing price are sufficiently close to avoid taking either too much or too little collateral in the majority of cases. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.005681818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#12",
                    "likes": "1",
                    "time": "30/06/2021-05:32:56",
                    "content": "    Kurt_Barry:  The key challenge from a risk perspective seems to be making sure the discounting price and rebalancing price are sufficiently close to avoid taking either too much or too little collateral in the majority of cases.   Yes, and we can definitely take the medianizer as one sanity, and even the OSM price as additional sanity. I think eventually the liquidity providers will be Maker enthusiastic, so there is definitely a merit to rely on maker feeds as much as possible. However afaik the medianizer is being updated only after 2% price change, while chainlink, e.g., update every 0.5%. But yeah, taking a sanity with it and the OSM (say even up to 50% difference from the OSM) might be enough to provide some guarantees even if the medianizer and chainlink feeds are rekt. The feedback from the smart contract team (@Kurt_Barry and @talbaneth) is great and appreciated, and we will definitely implement it once the deceleration of intent is approved. For the deceleration itself, currently it is quite generic, and explicitly specified that it will take into account the core unit team member feedback. So there is no need to revise it (if I understand correctly). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.727120535714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#13",
                    "likes": "5",
                    "time": "02/08/2021-08:40:20",
                    "content": "@charlesstlouis we would like to move forward with the proposal and make it a formal submission towards this August governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "6",
                    "time": "02/08/2021-10:03:01",
                    "content": "@MIP-Editors ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "3800"
}