{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-summary-part-1/16018",
            "title": "Endgame Summary - Part 1 ",
            "index": 16018,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "11",
                    "time": "24/06/2022-12:53:01",
                    "content": " Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings. I wrote this for 2 reasons:  To help get my head around the Endgame Plan so I can form an opinion on it. To improve accessibility of what is an incredibly complicated set of concepts and proposals.    Endgame Summary - Part 1  Endgame Goals  Transform Maker from an unclear structure to structure that is well documented and understood. Maker operates on desireable and long-term-stable incentive mechanisms and derisked processes.    Current State of Maker  Growth + Profit Disappearing  DAI supply no longer increasing. No longer profitable.   Maker Core  Certain vaults carrying the protocol. PSMs, D3Ms, Vault types for major assets (ETH, staked ETH, wBTC)   Complexity Spiral  Spiraling Complexity of governance and scope Functional but opaque budget processes.   Relationship Problem  Tangled mess of relationships due to org-size - not scalable. Everyone has different expectations of Maker and each other. Cannot take action without conflicting with multiple others. Core Unit incentives diverge and conflict with Maker.   Voter Apathy  Exacerbated by the above issues. Also an inherent property of organizations and DAOs.    Organizing MKR Holders “But the most important thing is that MKR holders have to take the initiative to change things, because voting power ultimately determines all incentives in the system”  Step 1: Voter Committees  MKR holders come together openly to discuss direction and coordinate voting behaviour. Aligned around a direction or theme. Interact and engage with delegates. Rebalancing delegated votes between delegates based on their effectiveness and alignment to the Committee. Participants incentivised via long-term locked MKR. Controlled by an organizer, or a group of organizers, who can choose which MKR holders they invite.  Forces excluded MKR holders to start a separate voter committee with different direction. Encourages decentralization and redundancy.   Move towards committee specialization into logically grouped areas.   Step 2: Executive Delegates  In addition to Shadow and Recognized Delegates. Elevate the roles of delegates and recognize they serve a purpose as critical as Facilitators. High Compensation in DAI and MKR. Soft Job Security (not always directly dependent on delegated MKR) Stricter requirements of engagement with Voter Committees, full time work, and adherance to best practices.   Step 3: Interface with Supporting Core Units  (such as Sustainable Ecosystem Scaling and Strategic Finance) In order to communicate a voter-centric view of the DAO amd how it can be improved.   Step 4: Include External Consultants  In order to validate and challenge the internal perspectives in the community. Avoid echo-chamber situation. Ensure that Maker’s DAO structure is built on a solid theoretical foundation.    Organizing MakerDAO  The World Map  An overview of how to subdivide the whole scope of maker governance into logically consistent categories. Created with aid of supporting core units, whose job is to try to create overview and monitoring of the workforce. An executive summary of all scope maps - informs which specialized DVCs are needed.   Scope Maps  Open source document of the explicit structure and processes of the DAO. Divided by area? (ed: seems under-specified in documentation.)   Focus Objectives  Created through offchain polling done at Voter Committees - combined into global list using MKR weight. Priority list of current objectives - fairly low-level. Drawn from scope maps. Can quickly change in reaction to market conditions or critical risks. Core Units have freedom to interpret and follow the Focus Objectives in the way that they think will best benefit the DAO.  Failure to follow it must be documented by the Supporting Core Units with reasoning. Feeds into decisions on budgets for Core Units.      Genesis Focus Objectives  Would come into effect at the Endgame Plan Launch then change from there. Will be further altered based on input. Can be used in current form as input by Core Units when planning and prioritizing.   Genesis Focus Objectives List  Security Maintenance and Upgrades Voter Committees and Delegates Swap USDC to government bonds (Monetalis, 6s Capital) Shore up RWA (Socgen, HVB, Pando, Centrifuge) Restart the burn Compound D3M Maker Ethereum (see future end-game docs) M0 MetaDAO farm launch (see future end-game docs) MANO farm launch (see future end-game docs)    Index - Part 2  ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-summary-part-2/16019",
                        "https://forum.makerdao.com/t/eres-nuevo-a-en-el-foro-de-makerdao-entra-aqui-recursos-lecturas-recomendaciones-etc/17821/3",
                        "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158"
                    ],
                    "GPT-summary": "The post provides a summary of the Endgame Plan for MakerDAO, which aims to transform the structure of Maker into a well-documented and understood system with desirable and stable incentive mechanisms. The post discusses the current state of Maker, the complexity spiral, relationship problems, and voter apathy. The author proposes a plan to organize MKR holders through voter committees, executive delegates, interface with supporting core units, and external consultants. The post also includes an overview of how to subdivide the whole scope of Maker governance into logically consistent categories and a list of focus objectives.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.607130456349206
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/09/2022-18:53:02",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-summary-part-2/16019",
            "title": "Endgame Summary - Part 2 ",
            "index": 16019,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "4",
                    "time": "24/06/2022-12:55:11",
                    "content": " Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings. I wrote this for 2 reasons:  To help get my head around the Endgame Plan so I can form an opinion on it. To improve accessibility of what is an incredibly complicated set of concepts and proposals.    Endgame Summary - Part 2  MetaDAOs  MetaDAOs Are…  The primary tool of the end-game plan. Smaller specialized DAOs tied to main DAO Easy, simple and cheap to create.   MetaDAOs Have…  Their own token (but contract ownership maintained by MakerDAO) Their own community (with stake and autonomy) A tight incentive feedback loop.   MetaDAOs…  Silo complexity away from MakerDAO Core Are scalable Distribute MetaDAO tokens to DAI, Vault and MKR users/holders. Make decisions through off-chain polling Rely on Maker Core contracts for treasury management and on-chain governance.    Categories of MetaDAO  Creator  Generalized MetaDAO that fundamentally focus on innovation and experimentation, and using this to drive growth. No restrictions on what they can do or become. Particular potential to tap into intangible value and metaverse trends.   Governor  Professionalize and gamify the core governance processes and bureaucracy of Maker Multiple governor MetaDAOs provide decentralization and diversification of core processes and political dynamics   Reformer  Deal with the complexity of building bridges between DeFi and the legal world of real world assets    How MetaDAO’s Solve Hard Problems  Growth - Boost demand and supply via farming and long-term growth via MetaDAO communities. Profit - Profits from government bonds, MKR yield provides benefit seperate from profit and burn. Maker Core - Endgame Plan gives core the attention it deserves. Opaque Budgets - Externalize non-core budgets, simplify core budget scope, new tools for guaranteeing budget spend. Complexity Spiral - Core has simple immutable scope Relationship Problem - All interactions are DAO2DAO, Maker never acts as a unified DAO with any individual. Voter Apathy - Ensures strong incentives for MKR Holders to vote with optimized UX. Self-Completing Roadmap - MetaDAO’s once created are incentivized to implement endgame plan.    Launching Endgame and MetaDAO Paradigm  Maker Core  Vault engines - Synthetic assets / Multichain sharding / Bridge system Top vaults - ETH / BTC / PSMs / D3Ms Strong Governance - voter Commitees / Executive Delegates Supporting Pillars - Workforce / Infrastructure MetaDAO Creation   Alternative Standalone Core  Deploy capital into US Treasuries Low expenses Outsourced Oracles Higher efficiency due to expense savings    MATH - Maker Ethereum  Synthetic ETH Serves a usecase inbetween native ETH and Staked ETH tokens, by offering liquidity and exposure to ETH staking rates. In initial version wrapped staked ETH. Later upgradable by Maker Governance. Eventually powered by ETH (and staked ETH) PSMs.    Endgame Launch  Clustering  Identifying people, relationships, business opportunities, communities and technologies that can benefit from having a distinct governance structure and community.   Proof of Concept MetaDAO  Special considerations that must guide its design due to being the proof of concept. CreatorDAO Reversible Challenging to attract workforce for experiment - needs attractive benefits. Gets existing budgets and MKR bonuses in addition to MetaDAO tokens.    M0 - The First MetaDAO  DECO Core Unit provides a well suited fundamental core value of M0. CreatorDAO that focuses on pursuing profit opportunties that are external to Maker, or that adopt complexity Maker wants to get rid of, such as small vault types. Develop unique metaverse identity Profit Opportunity - Frontend with stability fee revenue share Profit Opportunity - Fixed rates   Profit Opportunity - Adopted Oracle Nodes  M0 adopts some of the existing Maker oracle nodes in return for payment stream from Maker. Maker has a results claim against M0, able to extract collateral from M0 in the event that there is outage / security issues / technical failure / oracle attacks on adopted nodes.   Profit Opportunity - Adopted Vaults  Maker Governance will set a minimum debt criteria for Maker Core vaults. M0 governance can adopt any vaults that meet criteria. Maker will only earn a baseline stability fee on adopted vaults. M0 earns stability fees above this baseline. M0 collateralizes risk of these adopted vaults, with maker extracting collateral to cover any losses it incurs from the adopted vaults. M0 is responsible for all oracle costs related to the adopted vaults. M0 has freedom to adjust risk parameters (within some global bounds.) M0 has freedom to migrate the vaults to lower cost oracle providers such as chainlink, but assumes all risk of doing so and must do all the work itself. Initial above is done  manually. Eventually MetaDAO Lending Engine technology will exist to do this.   No Dependencies(?)  (Ed: this section is not well explained and doesn’t actually seem to touch on dependencies) M0 is reversible. Any Core Unit members that join M0 will fully join the MetaDAO and become internal Core Units of the MetaDAO. More risk but higher reward for joining core units. M0 will have plenty of cash and MKR - anyone who makes the switch will get a significant raise as a result of the additional risk and leadership responsibility they take.   MZR Distribution  M0 MetaDAO tokens Ticker and Name will be changed by M0 - initially MZR. Distributed through fair launch yield farming with no insider allocations Planned main target of MZR yield farming rewards are MATH vaults  Provides a massive incentive for Dai to be backed by more decentralized ETH as collateral Maker earns cash in return for the free MZR token that are farmed out, because Maker can charge a stability fee on the MATH vault debt.   Provides a powerful incentive for MKR holders to delegate their votes by rewarding with MZR.    Benefits of Endgame…  …For MKR Holders  MetaDAO token yield. Greater benefits from long-term lockup - high yield and generating DAI with MKR. MKR gains utility and liquidity. MKR gains market resilience through captive liquidity.   …For DAI Holders  Massive amounts of staked ETH collateral Massive amounts of captive DAI-ETH liquidity Holding DAI as climate aligned activity   …For Governance  DAO2DAO governance overcomes relationship problem Resilient Decentralized Workforce Improved Budget and workforce prioritization and guarantees Strong Processes relying on minimal community altruism   …For Growth  Many decentralized front-ends Viral growth strategy based on MetaDAO communities. Parallelize expansion to L2 and multichain Parallelize partnerships and synergy with other communities and protocols Parallelization of RWA and Clean Money    Part 1 - Index - Part 3  ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/end-game-summary-part-3/16245",
                        "https://forum.makerdao.com/t/endgame-summary-part-1/16018",
                        "https://forum.makerdao.com/t/idea-additional-financial-incentive-to-get-people-to-participate-in-governance-voting/838/29",
                        "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158"
                    ],
                    "GPT-summary": "The post explains the Endgame Plan and the role of MetaDAOs in it. It also discusses the benefits of the plan for MKR holders, DAI holders, governance, and growth. The post also includes constructive criticism and suggestions for improvement. Additionally, the post extends the proposal by discussing the launch of the Endgame Plan and MetaDAO paradigm, and invites collaboration and questions from third parties.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.8584360084360085
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/09/2022-18:56:02",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/end-game-summary-part-3/16245",
            "title": "End-Game Summary - Part 3 ",
            "index": 16245,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "8",
                    "time": "30/06/2022-15:39:32",
                    "content": " Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings. I wrote this for 2 reasons:  To help get my head around the Endgame Plan so I can form an opinion on it. To improve accessibility of what is an incredibly complicated set of concepts and proposals.    End-Game Part 3 Summary - Decentralized Workforce  Goals and Aims “Making Governance easier and simpler for MKR holders is the number one priority of the Endgame Plan’s approach to the Decentralized Workforce.”  Easier and Simpler  Voter Committees Standardized open source frameworks for operational processes and results measurements Becomes easier to follow and understand the state of Maker and its value and risks Becomes easier for community members to onboard.   Focus on the Budget Challenge  Budget and spending on the decentralized workforce is the majority of all Maker governance work and complexity today. Governance is not well equipped to deal with it. Endgame plan needs to deal with today’s budget problems, and future budget problems when the DAO is in its final state. Budget Allocator Role and the Administrative Core Unit role both of help to stabilize overhead growth and increases the likelihood of overhead being determined through a fair and free market process.   Separation of Powers  Strict best practice, with the cornerstone being separation of powers. (Ed: Note, not identical to the commonly used definition of separation of powers.) Roles in the Decentralized Workforce operate independently in a decentralized and free market dynamic Roles cannot band together as a single group acting as a counterparty to MKR holders. Best practice is enforced by using MetaDAOs and their “results guarantee” feature.  Very easy for MKR holders to take action when best practice has been violated. MetaDAOs play the role of absorbing the risk of best practice violations.     Public Interactions  Strict transparenc surrounding relationships, negotiations and agreements between the actors in the Decentralized Workforce. All work related communication between different Core Units, or Core Units and Delegates, etc must be either done publicly or be publicly disclosed.   Open Source Frameworks  Pre-written and pre-agreed operational guides and impact measurement frameworks make negotiations and implementation of standard tasks very standardized and uniform. Reduces the probability of bus factor and reliance on specific individuals Decentralized workforce develops and improves the operational frameworks, while also interpreting and executing in accordance with them. Allows…  Objective audit of results and adherence to best practice Comparison of the work of multiple different Core Units More robust and scalable Decentralized Workforce      Roles in the Decentralized Workforce  At the Maker Governance level, only three roles exist. No roles are elected through a MIP, the way Core Units currently are. All elections are done by joining voter committees, receiving MKR delegation or budget delegation.  Relationships between individuals in the Maker Community. NOT relationships between Maker Governance as a whole and individuals.   Simplifies the core of Maker governance, and improves decentralization.   Decentralized Voter Committees  Covered earlier in the documents. Open, decentralized role that any MKR holder can participate in. MKR Holders participating receive small amounts of long term locked MKR as compensation. A one-stop shop for impactful participation in governance by MKR holders, in particular by setting the direction of governance on specific high level topics and providing feedback. Aim to ensure that all important high level decisions are always understood by and have received input from regular MKR holders   Delegates  Critical actors in Maker Governance that receive voting power from MKR holders Three types of delegates: Executive Delegates, Recognized Delegates, and Shadow Delegates   Shadow Delegates  Fully permissionless and decentralized form of the delegate role. Automatically displayed in official voting frontends, but are shown below the other types of delegates   Recognized Delegates  Standard form of Delegates that have proven their identity to Maker Governance as sybil resistance. Followed certain minimum requirements to become eligible for the role. Compensated with a cash reward that grow proportionally with the amount of MKR they have delegated to them, up to a maximum amount. Recognized Delegates have no requirement to attend Voter Committees, but will often use Voter Committees as the place to appeal to MKR holders to get more MKR delegated to them. Recognized Delegates together with Executive Delegates show up at the top of the official governance frontend in randomized order.   Executive Delegates  The Recognized Delegates with the highest amount of MKR delegated to them. Fixed number of Executive Delegates spots, defined through a MIP. Occupied by the Recognized Delegates with the most MKR delegated to them whenever there is a Executive Delegate election window. Fixed compensation based on Facilitator Compensation of the Decentralized Workforce, including a high MKR bonus. Have semi-job security, meaning that they don’t lose their Executive Delegate role even if they fall out of the top list of Recognized Delegates, unless  Within an election window. Lose a significant (ie more than 50%) of delegated MKR.   Executive Delegates will also have a lot of job requirements  Weekly minimum hours attendance of legitimate Voter Committees and workforce operational meetings.   Can be relied on to play a crucial role at the intersection of MKR holders, the Decentralized Workforce and the Maker Governance process.   Budget Allocators  Operates between delegates and core units. Responsible for making marginal adjustments to the operational budgets of Core Units. Provide an important check on the power of Executive Delegates with Voter Incentives  Ensure Delegates remain focused on the big picture and aren’t micromanaging budgets and individual projects. Reduces chance that Delegate politics will backslide into focusing budget towards prestige projects for political advantage.      How Budget Allocation Works in Endgame  Note: Planned as a ‘Midgame’ feature.   Baseline Budget  Core Units will have base levels of permanent fixed budget that are determined directly through the MIP framework in the same way as today. Will only cover lean, baseline operations.   Global Allocated Budget  Total amount of DAI for distribution between all Core Units. Voters determine the overall amount of the Global Allocated Budget Individual voters (or their delegates) delegate Budget Power to Budget Allocators based on MKR weight.   Baseline Global Allocated Budget  Way for Maker Governance to specify a “hardcoded” Global Allocated Budget using the MIP process Similar to budgets for individual Core Units today.   Relative Global Allocated Budget  Most powerful way to use the Budget Allocator paradigm. Global Allocated Budget scales with the protocol surplus of MakerDAO using a smart contract that is approved through the MIP process. MKR holders can ensure that expenses only increase when there’s actually money available to pay for them Expenses are automatically scaled down if the protocol’s income starts to dry up   Budget Allocators  Accumulate budget reserves from MKR Holders and delegates and pay it to Core Unit auditor wallets to fund specific projects. Once they reach a certain size and pass a process to become Recognized, Budget Allocators receive a management fee based on the size of the budget allocated to them.  Makes it a competitive job that can attract top tier talent.     Why?  Budgeting process for Core Units becomes incredibly flexible as it can be moved around without requiring a cumbersome MKR vote. More certainty around projects and budgeting. Core Units can be provided with the full budget for a large project up front, held in escrow. Minority Voter Protection - Budgets are determined proportionally based on active votes.    DAO2DAO Paradigm  Core Units change significantly with Endgame. Change is not instant, but a gradual transition.   Results Guarantee  Core Units are no longer companies or groups that are hired directly by Maker Governance to receive a budget and do work on a best effort basis. Core Units are a service provided by MetaDAOs to Maker. MetaDAO as a whole is responsible for delivering certain pre-agreed results and performance targets through an agreement called a Results Guarantee. If the MetaDAO fails to deliver the expected results, Maker can claim compensation in the form of a Guarantee Settlement from the MetaDAOs collateral (explained in future docs) MetaDAO earns a Guarantee Overhead of 20% on top of the agreed budget for the Core Unit MetaDAOs can earn significant profits if they can ensure the Maker Core Units they manage are properly organized and resilient. Maker has significantly reduced risk from onboarding an retaining Core Units.   Separation of Powers  Entire decentralized workforce framework and role breakdown is built around maximizing adherence to Separation of Powers and minimal chance of political breakdown or corruption. Bias and factionalism is a natural process of human organization, strict controls and best practice must be in place to prevent it from occuring even over very long time scales Zero-exceptions requirement for complete transparency and disclosure of all Maker Governance and Decentralized Workforce work. Such interactions must be recorded or summarized and disclosed through official Maker Communication channels. The 3 categories of Maker Core Units, and the MetaDAO categories that manage them, are specifically designed to maximize the effect of Separation on Powers. Results Guarantee Settlements are likely to often relate to a failure to adhere to Separation of Powers.   Types of Core Unit  Supporting Core Units (SCUs)  Managed by Governor MetaDAOs. Least “close to the action” Focused on developing open source frameworks that act as operational guides, documentation and knowledge bases within different Scope Maps. Supporting Core Units all work together on building the Maker Governance DAO toolkit, which is an open source ERP-like system that is built for all the specific processes required by Maker Governance. Supporting Core Units have fixed budgets from Maker Governance, and can in some cases receive Allocated Budget from the Budget Allocator system, however they do not rely on this and only use it special circumstances.   Administractive Core Units (ACUs)  Administrative Core Units are managed by Governor MetaDAOs Administrative Core Units do not directly perform work for Maker, but instead facilitate that the work gets done in accordance with best practice and with the interests of MKR holders in mind. Negotiate with Contributing Core Units and define requirements, milestones, roadmaps and verify the output and security of work products. Trusted to pick contributing core units based on fair and free market competition and negotiate fairly with the interests of MKR holders in mind. Reactively facilitate work done through the Maker Governance bounty pipelines.   Contributing Core Units (CCUs  Contributing Core Units (CCUs) are managed by Creator MetaDAOs. CCUs are the groups that do the actual work in the decentralized workforce. CCUs are meant to be quite numerous early on in the Endgame Plan and effectively be the backbone of the Decentralized Workforce in the same way legacy Core Units are in the Decentralized Workforce today. Over time they are meant to decrease in quantity and importance and their roles in the ecosystem will be mostly replaced by Internal MetaDAO Core Units as the ecosystem matures and stabilizes.    Workforce at the MetaDAO Level  The Decentralized Workforce at the MetaDAO level has roles similar to the Maker level equivalents. Makes it a lot easier for Maker to audit and understand internal governance processes in MetaDAOs, which may be necessary in some disputes. MetaDAOs don’t have to populate all the roles they have available to safely operate. In principle a MetaDAO should be able to function without any active Decentralized Workforce structure at all, allowing them to operate with no expenses and relying only on token holder governance. In practice MetaDAOs will likely populate the roles based on their own incentives in order to be able to properly manage their own complexity. MetaDAOs engage companies directly to provide Core Unit services (the way Maker engages Core Units today).   MetaDAO Delegates  Have broader authority than their Maker Level counterparts due to the lack of Voter Committees. MetaDAO delegates can have greater control and flexibility without creating political risk due to Maker Governance’s role at resolving disputes.   MetaDAO Budget Allocators  MetaDAO BAs can be used once a MetaDAO reaches a very large size. Very useful for MetaDAOs since they can change and even pivot strategies with reduced risk.   MetaDAO Administrative Core Units (MACUs)  The most important Core Unit of a MetaDAO. In charge of day to day operational decision making and budgetting. In small scale MetaDAO MACU’s can be consolidated, meaning they also perform contributing work and have no separation of Powers, similar to the present Day Core Units.   MetaDAO Contributing Core Units (MCCUs)  MCCUs are the contributors of MetaDAOs, that do the actual work for a MetaDAO. Can include internal MetaDAO work or Maker-level work that affects the MetaDAO.   Ecosystem Actors (EAs)  EAs are not directly a part of the MetaDAO Decentralized Workforce, but are very adjacent to it. Counterparties like Node Network Operators, RWA Arrangers, security auditors, marketing agencies, freelance developers, consultants etc. Interact with MetaDAOs through the MACUs or MCCUs (depending on the type of EA) and can indirectly interact with Maker through the MetaDAO. EAs are paid in cash only and do not receive MKR or MetaDAO tokens as additional compensation.    The Endgame Decentralized Workforce in practice  (Ed: Skipped because it doesn’t feel directly relevant. Refer to the source doc if interested.) (Ed: Addresses 3 scenarios of how the decentralized workforce may interact in the completed Endgame plan.)    Universal Dao Toolkit synergy with MetaDAO paradigm  Universal DAO Toolkit is synergistic with MetaDAOs and endgame.    Part 2 - Index - Part 4  ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/end-game-part-4-summary-understanding-metadaos/16416",
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/endgame-summary-part-2/16019",
                        "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370/3",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-junio-05-de-julio-del-2022/16473",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/4",
                        "https://forum.makerdao.com/t/end-game-summary-part-4/16416",
                        "https://forum.makerdao.com/t/this-week-in-governance/16382/2"
                    ],
                    "GPT-summary": "The post is a summary of the Endgame Plan's approach to the Decentralized Workforce, which aims to make governance easier and simpler for MKR holders. The post explains the goals and aims of the plan, the focus on the budget challenge, the separation of powers, the roles in the decentralized workforce, the budget allocation process, and the types of core units. The post also discusses the MetaDAO paradigm and the ecosystem actors. The author is explaining the proposal, while a 3rd party could give constructive criticism, ask questions, or audit and review the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.810169195883481
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/09/2022-21:40:28",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/end-game-summary-part-4/16416",
            "title": "End-Game Summary - Part 4 ",
            "index": 16416,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "2",
                    "time": "07/07/2022-15:05:53",
                    "content": " Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings. I wrote this for 2 reasons:  To help get my head around the Endgame Plan so I can form an opinion on it. To improve accessibility of what is an incredibly complicated set of concepts and proposals.    End-Game Part 4 Summary - Understanding MetaDAOs  Recap - Key Aspects of MetaDAOs  Very easy and cheap to create Do not have self-sovereign governance Run entirely on the Governance Infrastructure of Maker  Gives Maker Governance a way to regulate their behaviour and enforce claims against their collateral   Very safe to launch, since Maker never gives up control MetaDAO tokens of a newly created MetaDAO are distributed using a purely fair launch approach Start from scratch and try to create something new and unique Value Preservation  All the value that Maker transfers into MetaDAOs is recaptured by its own ecosystem Allows Maker to use powerful tokenomics without taking on significant financial risk      Recap - MetaDAO Categories  CreatorDAOs  General MetaDAOs that have a very flexible and autonomous scope Ideal for innovating new technology or identifying novel growth opportunities Manage and provide results guarantee for Contributing Core units   GovernorDAOs  Run core governance process and bureaucratic systems as a service for Maker Shield Maker from the relationship problem Make it possible to enforce decentralization and redundancy of critical core processes Manage and provide results guarantees for Supporting Core Units and Administrative Core Units.   ReformerDAOs  Handle everything related to the real world.  Real World Asset collateral# Legal risk Political outreach   Potentially activities that are legal intensive  Real world marketing campaigns Sponsorship deals.      MetaDAO Synergies and Profit Opportunities  Decentralized Frontend Revenue Share  Frontend is very important - a place to display its branding and metaverse identity and funnel users to its products, community and governance. 20% net revenue share from stability fees earned on Maker Vaults managed through their frontend.  Particularly lucrative on MATH vaults, as they are incentivzed through the MetaDAO token yield farming.   Springboard for the MetaDAOs to grow a sustainable userbase that can later be sold more products and features.   MetaDAO Lending Engine  Creator and Reformer MetaDAOs only Specialized Maker Vault Engine that they can use to provide collateralized lending with, similar to Maker Vaults. MetaDAOs have the flexibility to offer much more diverse collateral, and can use cheaper oracles. Capitalized by Maker, through a D3M from the primary Maker Vault Engine. Backstopped by MetaDAO collateral + MetaDAO tokens. Maker only takes a loss if all value in the MetaDAO is entirely wiped out.   Singularity Engine and Elixir Wars integration  (Ed: Not yet covered in documentation thus far) All MetaDAOs have an instance of the Singularity Engine MetaDAOs integrate into Makers Singularity Engine through the Elixir Wars tokenomics system  Deeply connects the value of MetaDAO tokens with the value of MKR Generate large amounts of captive liquidity for both MKR and MetaDAO tokens     Manage the Core Unit Ecosystem  Governor and Creator MetaDAOs play an important role in managing the Core Unit ecosystem for Maker Ensure that Maker only deals DAO2DAO. These DAOs guarantee the results and output of the work with their treasury used as collateral. Creates much tighter feedback loops around the performance of the Decentralized Workforce. Allows scale to very large levels.    Homebase System - Extending Maker’s Reach to L2  Gives each CreatorDAO the option to pick a Homebase shard. Homebase shard is an L2 where the MetaDAO has special, exclusive privileges.   Why?  One of the biggest opportunities for Maker is the expansion to L2  Obstacle is the Maker community’s inability to focus and execute easily on partnerships without relying on Core Units.   MetaDAOs help solve this problem in a way that gives Maker the best of both worlds  Get to interact closely and collaborate in uniquely tailored ways with different L2’s and partner projects Preserve decentralization and not rely on individuals to represent Maker.   Community and decentralized workforce of the CreatorDAO is incentivized to promote and develop a strong long term community and ecosystem on their Homebase Shard.  Makes them ideal to build ties to other communities and the core team of the Homebase Shard itself, potentially developing partnerships and collaborations.   Maker would not be able to tap into partnerships like this without allowing the Decentralized Workforce to centralize and represent Maker externally, which creates long term political risk to Dai stability and decentralization.   Benefits to MetaDAO  Permanent 1% revenue share of all net stability fee income of Maker Sharded Vault Engine on the Homebase Shard. Preferential prioritization of collateral onboarding bounties and collateral onboarding temporary revenue share programs for collateral that is specific to the Sharded Vault Engine on the Homebase Shard.   Synergies  Synergize with the roadmap of the Protocol Engineering Core Unit:  developing Sharded Vault Engines on Optimism, Arbitrum and Starknet.    Into the Metaverse  Cornerstone of the Endgame Plan is the focus on expanding Maker beyond its hyperrationalist original 1.0 design and vision. Endgame Plan proposes that it is not enough to achieve global impact, because it assumes global adoption is guaranteed, which it isn’t. The efficiency of blockchain is only one half of the equation  The other half is the communities and metaverse UX that can develop around a decentralized network with a membership token. Brings potential for enormous intangible value creation. This intangible value, which pays off human attention and emotion, has far more potential in the early stage than the fundamental value that can be created out of the efficiency of blockchain.   Intangible value is the dominant force in the blockchain space Maker has not tapped into the power of intangible value due to early designs not prioritizing its potential.  This was designed for governance integrity to maximize Dai stability (in theory). In practice it limits Makers growth and contributes to issues such as voter apathy.   Endgame Plan both aims to increase the intangible value potential of Maker and the MKR token itself.  But the most powerful source of intangible value are the MetaDAOs.   While Maker focuses on its product and protocol with the DAO taking a backseat…  the MetaDAO can be built from the ground up as an end-to-end user experience. The communities can experiment with increasingly blurring the line between user, protocol owner, community member, governance participant or full-time contributor.     MetaDAOs will benefit from intangible value more than Maker.  “born-decentralized” with fair launch, fully decentralized governance and no founding team - should make it a lot easier to develop a strong community spirit and sense of belonging. born “metaverse-aware” into an era of the blockchain space when NFTs have penetrated the mainstream significantly more than any other aspect of blockchain, and memecoins continue to dominate efficiency-maximizing DeFi protocols. The MetaDAOs will be defined by the interactions with each other, and the unique ecosystem of aligned, decentralized communities may create unique manifestations of metaverse experiences.   Different Points on the Metaverse Spectrum  Metaverse focus of different MetaDAOs lies on a spectrum.  Can choose to what extent they wish to tap into intangible value over fundamental value.   Some MetaDAOs will choose to be “simple” Google/Alphabet style “Alpha Bets” - offshoots of Maker that taps into its ecosystem and talent pool and competes as backend infrastructure or marketing funnels in the classical sense. Potential for unique value creation comes from the ability of the MetaDAOs to experiment freely with targeting any point on the spectrum of delivering fundamental vs intangible value to participants (the “metaverse spectrum”). Maker should take advantage of the unique opportunity to become a hub of MetaDAO creation.  The frontier of value creation is so vast that this can be permanent function of the system that never stops.   Each new MetaDAO can fail or succeed, and successive MetaDAOs can learn from all their predecessors to continuously innovate in an evolutionary process.   Community Activation  A core concept that MetaDAOs are built around, is the idea of explicit community activation. The shared activity and interests of the community is a critical priority of each MetaDAO  Should be continuously innovated and developed further in to attract as many community members as possible, and keep them engaged deeply in the community.   In all cases, a MetaDAO needs to be about more than just a business.  This will be required to keep an engaged and active community around in the long run, especially when going through long bear markets.     Community Activation Tools  Real life events Charity and impact donations or volunteering.   Gaming and Digital Meetups  In virtual worlds and metaverse experiences. MetaDAO can fund private servers and enhanced experiences for its members, as a way to deliver intangible value to its community. Gaming likely has the potential to be the strongest common thread of community activation and metaverse experience building of all the MetaDAOs  simple and cheap to deliver great shared experiences potential for developing interesting storylines and interactions between the MetaDAOs Competition and/or cooperation between MetaDAOs in a virtual setting.     Art  Creation and curation Community effort to continuously and organically develop their distinct aesthetic and brand Can take the form of NFT curation and acquisition by the MetaDAO.   Metaverse MetaDAO Examples  (Ed: Not included, hard to summarize examples effectively. See source doc for details.)    Proof of Concept Phase  The first 3 MetaDAOs, M0, M1 and M2 are reversible. Possible to cancel the experiment and instead focus on pursuing the Rai+ Endgame state. M3 represents irreversible complexity that is only safe with commitment to the MetaDAO paradigm.   Validation Criteria (subject to change)  At least 400 million Dai must be generated from MATH vaults incentivized through MetaDAO token yield farming. At least 25% of the circulating MKR supply must be active in governance. Must be achieved at the latest 6 months following the launch of M2.   Another look at M0   CreatorDAO that focuses on pursuing profit opportunities in and adjacent to the Maker ecosystem  Onboarding new users Adopting complexity Maker wants to get rid of, such as small vault types    Main goals of M0  bootstrap a new community that is powered by the Maker Ecosystem, but can be more fun and inclusive than Maker Governance experimenting with new product and growth ideas that aren’t suitable for Maker Governance.    (Ed: Reiteration of M0 section in part 1. Refer to there for details.)    M1 and M2: First Reformers  Proof of concept of ReformerDAOs Focus on taking over the RWA programmes Maker has been attempting to bootstrap Build up community and governance culture, and a decentralized workforce that is able to make it work at scale.   Simulated D3M for real world asset management  allows the ReformerDAOs to use the Maker Vault Engine to onboard Real World Asset deals  without any additional technical complexity# using MIPs to simulate the interaction that would occur with a fully functional MetaDAO Lending Engine and a D3M from Maker   Maker provides both of the ReformerDAOs global risk parameters such as target return and maximum debt ceiling ReformerDAOs then adopt RWA vaults from Maker, and begins onboarding new RWA vaults. ReformerDAOs will have two separate simulated D3Ms that they can use to adopt and onboard Vaults with:  high-liquidity D3M - meant for adopting bond exposure flagship D3M     Bootstrapping Core Units and Treasury  ReformerDAOs will need a lot of internal resources to be able to function properly from the start Will build their teams around, or with support from, members of the relevant legacy Core Units Will require significant upfront operational capital to pay expenses and ensure job security Require a minimum amount of junior capital to be able to collateralize and credit enhance the RWA deals they pursue.  Funded from the Maker Surplus buffer when the reformerDAOs launch     Frontend  M1 & M2 will be operating a simple copy of the MetaDAO frontend Initially, not be a major focus Later, frontend will be an entry point to the various MetaDAO Lending Engines that M1 & M2 will operate, providing them with sources of capital that go beyond Maker D3Ms.   Oracles  M1 & M2 will also tap into the business of running parts of Makers oracle and node network Earning some decent overhead fees and providing additional diversification security to the network Farm MANO tokens   Develop unique metaverse identity  On the frontlines of the opportunity for new models of intangible value creation Once enough tokens have been distributed and the community has started to crystallize, the community can internally organize a process for picking a new name and token ticker.   M3: Second Creator  Like M0 it focuses on its frontend development, growth and technical innovation No longer constrained by the MetaDAO proof of concept phase  Deep integration and codependency with Maker by adopting and managing core development resources and responsibility   Standard CreatorDAO features as listed elsewhere. Unique identity.   Contributing Core Units and DAO Quests  Unique focus of M3 will be that it can adopt critical resources from the legacy Core Units and restructure them into Contributing Core Units  Covered by a Results Guarantee Receive additional M3 MetaDAO Tokens   Help restructure the Decentralized Workforce towards its endgame state. Provide a strong starting point for ramping up output via DAO Quests (more details later)  Bounty that applies to a MetaDAO and gives it massive rewards for completing critical tasks that have a long term impact. Obvious target is a DAO Quest that incentivizes the development of the first version of the Singularity Engine (more details later)     M4 and M5 First Governors  Focus of these MetaDAOs are to restructure and enhance the administrative and supporting layer of the Decentralized Workforce Providing strong incentives for permanent adherence to best practice and critical principles such as separation of powers.   Decentralized Frontend  Will operate decentralized frontends like all other MetaDAOs  Extended to governance UI.   Once the Singularity Engine has been developed by M3, there is a new revenue opportunity in for MetaDAOs to provide best practice-compliant access points to Maker Governance. Reliable incentive for the Governors to be a self-sustainable force for decentralizing access to voting, shutting the door to the hypothetical possibility of governance frontend capture.   Supporting and Administrative Workforce management  Primary objective of the two Governors will be to restructure the supporting and administrative layer of the Decentralized Workforce  Bring strong incentives for separation of powers.   Guaranteed and provable decentralization and diversification of resources as the responsibilities are split across the two Governors Provides a significant and highly reliable source of income for the GovernorDAOs  Main source of long term value Endgame Decentralized Workforce will rely heavily on Supporting and Administrative Core Units.     Oracles  Will also manage Oracle Nodes, and farm MANO tokens like all other MetaDAOs.   No MetaDAO Lending Engine  As GovernorDAOs, M4 and M5 will not have the ability to run a MetaDAO Lending Engine   Metaverse Identity  Can experiment with identity and culture that helps promote honest participation in governance  Significant challenge as Maker is already struggling with voter apathy GovernorDAOs entire identity and fundamental reason for existing are focused on solving this problem and working with governance processes.      Tokenomics Ramp Up  Unique aspect of MetaDAOs and Maker in the Endgame Plan is their intertwined tokenomics, in a system called the Elixir Wars  Keeps MetaDAO token holders and MKR holders aligned and creates significant intangible value Ensures that MetaDAO tokens are always valuable and liquid MKR token is quote currency for MetaDAO token trading.   Full scope of the Elixir Wars will not get implemented until the Midgame During the Endgame Plan Launch Phase a simplified version of the Elixir Wars is implemented  Maker uses MKR token emissions to accumulate MDAO/MKR LP tokens using a dss-kiln-like implementation The LP tokens that are accumulated during the Endgame Plan Launch phase will be kept long term and eventually used in the Singularity Engine in the latest stages of the Endgame Plan.   During the proof of concept phase MDAO/MKR LP token acquisitions will be funded from the protocol MKR reserves rather than token emmissions. Permanent token emissions will only be implemented once the validation results have been met    Part 3 - Index - Part 5  ",
                    "links": [
                        "https://forum.makerdao.com/t/end-game-summary-part-3/16245/1",
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/end-game-summary-part-5/16759",
                        "https://forum.makerdao.com/t/end-game-summary-part-5/16759",
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/end-game-summary-part-3/16245",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/5",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-7-13-de-julio-del-2022/16740",
                        "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.856564814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/10/2022-21:05:54",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/end-game-summary-part-5/16759",
            "title": "End-Game Summary - Part 5 ",
            "index": 16759,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "12",
                    "time": "21/07/2022-17:43:30",
                    "content": " Summaries reflect my own work and have not been reviewed by Rune. Any mistakes are mine. They are based on the written posts in this forum from Rune. I do not regularly attend Endgame meetings. I wrote this for 2 reasons:  To help get my head around the Endgame Plan so I can form an opinion on it. To improve accessibility of what is an incredibly complicated set of concepts and proposals.    End-Game Part 5 Summary - Pregame and Early Game Products  Intro  Focuses on the first half of the Endgame Plan Product Roadmap. Key element of the Endgame Plan is that these features must be described with as much detail and context as possible, and as early as possible  Helps ossify the Endgame state Will of course never be 100% immutable but changes should only happen for very good reasons   Features need to be highly future proofed and remain long term relevant Community must consider designs up front before ossification.  No resource or time constraints on these designs Can take as long as it takes as long as details are understood enough that designs can improve without resulting in governance disputes     Timeline Divisions  Split into Pregame, Early Game, Midgame and Endgame   Pregame  Must be in place before the Endgame Plan Launch can happen Low cost, high impact   Early Game  Not developed and launched until after the Endgame Plan Launch Some Early Game products may be built before launch, but not prerequisites These are the only optional parts of the plan   Midgame  Most important new innovations built by the Maker ecosystem Long term efficient building blocks unique to the Endgame Plan Likely won’t be developed until several years following the Endgame Plan Launch First products to be developed through the Creator Quest framework   Endgame  Represent the most advanced long term designs of products that converge on the theoretical limits of efficiency gains that are possible for a DeFi protocol Could take a decade to develop fully May be iterated on over more decades to reach ever greater levels of efficiency and security Developed through the Creator Quest framework    Pregame - Objectives and Products  Objectives  Deliver the greatest possible impact in terms of growth and short term momentum Bootstrap the MetaDAO ecosystem Maximize Dai generated from Staked ETH Incentivize MKR holders to delegate their votes Aim to launch within 12 months.   List of Pregame Products  Pregame Product List (Explained below)  PRE-A - Endgame Plan Launch MIP PRE-B - EtherDai (ETHD) I (simple STETH wrapper) PRE-C - Elixir I (simple Balancer pool) PRE-D - Limit Order Staircase PRE-E - MetaDAO ERC20 token PRE-F - Meta Elixir I (simple UNI pool) PRE-G - Simple offchain voting system PRE-H - Rainbow Tokenomics PRE-I - Pregame MKR Tokenomics Accounts PRE-J - Rainbow Farm: MDAO with DAI PRE-K - Rainbow Farm: MDAO with ETHD vault PRE-L - Rainbow Farm: MDAO with delegated MKR PRE-M - Temporary Farm: MKR with ETHD/DAI LPT PRE-N - Rainbow Farm frontend PRE-O - Farm Balancing Lever PRE-P - MetaDAO token anti-rush mechanic PRE-Q - Pregame MetaDAO Tokenomics Accounts    PRE-A - Endgame Plan Launch MIP  MIP Set of multiple interdependent MIPs that together implement the Endgame Launch. Define fundamental rules of governance that will be binding on all future MIPs. Specifications that help maximally define the Endgame Plan Launch - minimize confusion and promote ossification Implemented entirely through MIPs, no technical component to it.   Purpose  Establish a social contract in the community enshrining values such as Clean Money and funding for charity and public goods Define the intangible value that the community expects to gain from following the purpose and values Ensure the community can align on the fundamental logic of why the purpose and values exist   Immutable Tokenomics  Defines completely immutable tokenomics schedules for both MKR and MetaDAO tokens Should be impossible to change after the fact   Product Roadmap Specification MIPs  MIP for each of the Endgame Plan products Provides as much clarity as possible around their implementation and requirements Creator Quest payouts will directly rely on these product specification MIPs    PRE-B - EtherDai (ETHD) I (simple STETH wrapper)  Goals  Have a staked ETH token under the control of Maker governance Can ultimately be upgraded to become a fully fledged synthetic asset   What is EtherDai I?  Simple ERC20 token wrapper around Lido’s Staked ETH Allows users to take STETH and wrap it into ETHD, or take ETHD and unwrap it into STETH   ETHD I is the Pregame implementation of EtherDai  uses a “shortcut” approach in order to quickly bootstrap the product     Governance has backdoor access to the ETHD collateral, as well as the ability to set permissions for minting and burning of ETHD.  Allows upgrade in Midgame.   Must also be onboarded as Maker Vaults   Why EtherDai I?  Central user facing product of the entire Endgame Plan  All other mechanisms and incentives aim to drive users towards EtherDai Vaults.   Will be a very valuable and useful product that can easily generate network effects   Other Note on EtherDai I  To facilitate large amounts of Dai generated from EtherDai vaults, the liquidity of EtherDai will need to be boosted with captive liquidity. Initially done using short term yield farming of ETHD/DAI on uniswap  Replaced by long term liquidity provided through Elixir accumulation   Only pregame product that can be launched before everything else Should be the very first priority of the entire Endgame Plan Demand for EtherDai vaults can be bootstrapped by providing them with a temporary stability fee of 0%    PRE-C - Elixir I  Universal long term liquidity solution for Dai, ETHD and MKR in the Endgame Plan Elixir I is a simple balancer pool that consists of 1/3rd Dai, 1/3rd ETHD and 1/3rd MKR In Early Game, Elixir I is accumulated by MetaDAOs by selling their MetaDAO tokens using the Anti-Rush Mechanic (Explained later).    PRE-D - Limit Order Staircase  At Endgame Plan Launch, large amounts of MKR and MetaDAO tokens are put into fixed limit orders on external decentralized exchanges to accumulate Dai. Accumulated Dai is then exchanged via dss-kiln to Elixir. Used for various purposes, but in all cases it helps bootstrap captive liquidity for ETHD and MKR Creates an accessible buying opportunity for new community members at Endgame Plan Launch and during the Early Game Prevents unsustainable price action as a result of the new Rainbow Tokenomics and yield for MKR.    PRE-E - MetaDAO ERC20 Tokens  MetaDAO Tokens are simple ERC20 tokens that are administratively owned by the Maker Governance Security Module Initially have 7 billion tokens generated and sent to a Maker Governance account  Then distributed to Yield Farms, Workforce Bonus pools, and other end destinations   Initial 6 Launch MetaDAO tokens are manually created, and starting with the 7th MetaDAO the tokens are created automatically by the Incubator (Explained in Midgame Products).    PRE-F - Meta Elixir I  Initially, simple Uniswap pool token of MetaDAO tokens against MKR. Core liquidity pool for MetaDAO tokens against MKR Goal is to be able to use Meta Elixir as the main source of cross-market and cross-chain MetaDAO token liquidity Helps establish MKR as the main trading currency for MetaDAO tokens across all markets. (Early Game) Meta Elixir I is continuously acquired by the Meta Elixir Acquisition Accounts, at a rate of 6667 MKR per year (details later)    PRE-G - Simple offchain voting system  Existence of a simple, offchain and gasless polling system required for MetaDAO governance to function.  Allows MetaDAO token holders to vote in non binding polls that Maker Governance can then interpret and execute.   Snapshot is fine, but could use something bespoke.    PRE-H - Rainbow Tokenomics  Intro  Central driver of the Endgame Plan ‘Rainbow’ refers to the system enabling a wide range of diverse and unique MetaDAOs to exist and be available for MKR holders and Maker Protocol users to farm. Overhauls MKR by introducing a permanent, continuous token emission schedule  Initially mints 50,000 MKR tokens per year, or almost 137 MKR per day.   As income generated by the protocol continues to be used for burning, this creates a circular flow of tokens that are emitted and then burned. Amount of tokens that are emitted are fixed, and the amount of tokens that are burned is variable based on protocol income  Should converge towards equilibrium where equal amounts of tokens are emitted and burned each day.     Interim Rainbow during MetaDAO Proof of Concept phase  Permanent activation of the Rainbow Tokenomics requires that the MetaDAO Proof of Concept phase passes During the Proof of Concept phase, no MKR is emitted. Instead 3333.3 MKR for each of the 3 PoC MetaDAOs (10000 MKR total) are manually transferred from the MKR reserve to cover the PoC phase without requiring new emissions.   Early Game Rainbow Tokenomics  MKR Permanent Emissions System begins to emit 50000 MKR per year into the Rainbow Account Account can whitelist other smart contracts to pull tokens from it, so each of the automatic components of the Rainbow Tokenomics can be plugged in to it one by one by Maker Governance. Maker Governance has access to the account, and will manually perform operations on it that simulate the long run Rainbow Tokenomics. 50,000 MKR from the Rainbow Account are split across 4 different accounts  Meta Elixir Acquisition - Up to 40,000 MKR Workforce bonus - Up to 4,000 MKR MetaDAO incubation - 2,000 MKR Creator Quests - 2,000 MKR The Well liquidity system - 2,000 MKR     Meta Elixir Acquisition  Simple dss-kiln implementation that uses MKR to acquire Meta Elixir 6667 MKR per year for each active MetaDAO Effective MKR emissions begin at only 20001 MKR per year after the MetaDAO PoC phase has passed, and before the 4th MetaDAO is activated. (Midgame) the Meta Elixir Acquisition Accounts are replaced by a single Rainbow Elixir Acquisition Account, and the acquired Rainbow Elixir begins to be distributed to Rainbow Engine users.   Workforce Bonus  Up to 4000 MKR per year Used for long run MKR bonus payment to Delegates, Council and Core Unit members The only MKR available for decentralized workforce payments, and the decentralized workforce has no ability to tap into additional MKR emissions or bonus programs beyond the Workforce Bonus Account. Reduces with 400 MKR every 4 years, until 20 years after the Endgame Plan Launch when it permanently settles at 2000 MKR per year. Over time less MKR is funneled to workforce bonuses and more MKR is funneled to Rainbow Engine MKR holders and MetaDAOs   MetaDAO Incubation  2000 MKR per year Converted to Elixir immediately through dss-kiln MetaDAO Incubator Account is used to provide seed Elixir for new MetaDAOs.  Seed Elixir helps new MetaDAOs compete against existing, established MetaDAOs in the Elixir Wars Provides the tokens an intrinsic value from the moment farming starts. Newly incubated MetaDAOs have collateral available at genesis which allows them to perform Results Guarantees for Maker, and allows them to receive D3M capital that they can allocate to their MetaDAO Lending Engine.     Creator Quests  2000 MKR per year period of 10 years (total of 20000 MKR) Immediately converts all received MKR into Elixir  Then rewarded to CreatorDAOs as they complete Creator Quests   After 10 years, the 2000 MKR per year stops being funneled to the Creator Quest Account, instead additional 2000 MKR per year is funneled to the Rainbow Elixir Acquisition Account   Well Liquidity System  Advanced backend system of 3 liquidity pools that are owned directly by the Maker protocol. Unique role in providing liquidity for the Rainbow Tokenomics to function efficiently Can only receive tokens, never send them out or spend them 2000 MKR per year is initially sent to the 3 different permanent liquidity pools  1,700 per year to Well LP (liquidity for MKR, Elixir and Rainbow Elixir) 250 MKR per year to Meta Well LP (liquidity for the different Meta Elixir tokens against each other, and against MKR.) 50 MKR per year is sent to The MANO Well LP (liquidity for MANO against MKR).   Every 4 years, the amounts sent are reduced by 10% of the original amount, until they reach 50% of the original amount at year 20, for a total of 1000 MKR per year.  Extra MKR goes to Rainbow Elixir Acquisition Account     Rainbow Tokenomics end state  Rainbow Elixir Acquisition Account for Rainbow Engine yield  45000 MKR per year   Workforce Bonus Account  2000 MKR per year   MetaDAO Incubator Account  2000 MKR per year   The Well  850 MKR per year   The Meta Well  125 MKR per year   The MANO Well  25 MKR per year      PRE-I - Pregame MKR Tokenomics Accounts  Pre-game MKR Tokenomics Amounts  Meta Elixir Acquisition Accounts  10000 MKR from reserve 40000 MKR per year from emissions   Workforce Bonus Account  33000 MKR from reserve 4000 MKR per year from emissions   Incubator Account  2000 MKR per year from emissions   Creator Quest Account (Temporary)  13500 MKR from reserves 2000 MKR per year from emissions   The Core Well  13500 MKR from reserves 1700 MKR per year from emissions   The Meta Well  2300 MKR from reserves 250 MKR per year from emissions   The MANO Well  500 MKR from reserves 50 MKR per year from emissions   ETHD bootstrap liquidity mining (Temporary)  5000 MKR from reserves     Meta Elixir Acquisition Accounts  3 PoC MetaDAOs will be bootstrapped with 10000 MKR, which will be used to acquire 3333 MKR worth of Meta Elixir for each of the MetaDAOs over a period of 6 months. Following PoC, the Rainbow Tokenomics is activated and the Meta Elixir Acquisition Accounts of the 6 launch MetaDAOs will receive MKR emissions at a rate of 6667 MKR per year. The Meta Elixir Acquisition Accounts work by receiving MKR, and then using dss-kiln to turn the MKR into Meta Elixir. The Meta Elixir is then accumulated. (Midgame) Once the Rainbow Elixir system has been developed, the Meta Elixir Acquisition Accounts for the 6 launch MetaDAOs will be replaced with Rainbow Elixir Acquisition Account that begins to acquire Rainbow Elixir at a rate of 40000-45000 MKR per year   Workforce Bonus Account  Initially receives 33000 MKR from the reserves, and then receives an additional 4000 MKR per year once the Rainbow Tokenomics has been activated.   Incubator Account  Used by the Incubator system of the Forge Converts the MKR to Elixir via dss-kiln. When the Incubator incubates a new MetaDAO, some or all Elixir contents of the Incubator Account is transferred to the new MetaDAOs Ember Account   Creator Quest Account  The Creator Quest Account is a temporary tokenomics account used during the Creator Quest period, which lasts at least 10 years. Receives 13500 MKR from the MKR reserves, and converts this initial batch of MKR to Elixir using a Limit Order Staircase Any Dai received by the Creator Quest Account from the Limit Order Staircase is then converted to Elixir using dss-kiln. Once the Rainbow Tokenomics has been activated, the Creator Quest Account receives 2000 MKR per year for 10 years. This MKR received from MKR emissions is immediately converted to Elixir via dss-kiln. The Elixir is used to pay out Creator Quest Rewards based on predetermined rewards specified in the specification MIPs for each Midgame and Endgame Product.   The Core Well  The Core Well is a core tokenomics backend infrastructure that is built in the Midgame The Core Well receives 13500 bootstrapping MKR from the MKR Reserve, used to create a limit order staircase that sells the MKR for Dai, and then converts the Dai to Elixir using dss-kiln. Additional MKR received by the Core Well Account once the Rainbow Tokenomics have activated just accumulates as MKR When the Core Well is activated, all of the Elixir and MKR in the Core Well Account is converted to Core Well LP tokens Once assets have entered the Core Well Account they can never leave again, and the Core Well can only grow its liquidity over time. Also accumulates capital from the MetaDAO Permanent Emissions System of all active MetaDAOs.   The Meta Well  tokenomics backend infrastructure that is built in the Midgame Meta Well Account is used to store MKR in preparation for the activation of The Meta Well in the Midgame Also accumulates capital from the MetaDAO Permanent Emissions System of all active MetaDAOs   The MANO Well  simple tokenomics back end infrastructure that provides liquidity for the MANO token against MKR LP pool of MANO/MKR liquidity activated in the Early Game, once the MANO token is launched The MANO/MKR LP tokens remain permanently in the MANO Well, and the amount can only grow over time. It also accumulates capital from the MetaDAO Permanent Emissions System of all active MetaDAOs.   ETHD bootstrap liquidity mining  5000 MKR from the MKR reserves Used to fund a liquidity mining program that lasts up to 2 years, at a declining rate over the 2 year period If enough Elixir is accumulated in the interim and ETHD liquidity in general becomes stable enough then can be cancelled.    (Explainer: Rainbow Farms)  The main way to distribute MetaDAO tokens The key to the successful bootstrapping and evolution of a MetaDAO is the distribution of its token If the MetaDAO token is distributed the wrong way, it simply becomes “free money” that is sold for cash by the users and promptly forgotten about  Risk can be mitigated (not eliminated) through a value preservation strategy Only distributed to users that are already users of Maker is some way At minimum Maker will be able to recapture some of the value that is being distributed with the free MetaDAO tokens      PRE-J - Rainbow Farm: MDAO with DAI  Simplest type of MetaDAO token farm Amart contract for each MetaDAO token that exists, and users can deposit their Dai into one of the farms and begin earning MetaDAO tokens on their Dai. Using Dai to farm MetaDAO tokens makes the Dai ineligible for earning the Dai Savings Rate.  MetaDAO tokens can help make a higher Dai Savings Rate sustainable   Amount of MetaDAO tokens to the Dai farms changes depending on Maker Governance adjusting the MetaDAO Token Balancing Lever (explained later).    PRE-K - Rainbow Farm: MDAO with ETHD vault  The ETHD Vault Farm is the MetaDAO Token farm that is most likely to distribute the most MetaDAO tokens. Main mechanism that incentivizes more users to generate more Dai from ETH collateral, which makes Dai more decentralized and resilient. Allows users to farm MetaDAO tokens based on the amount of debt they have in their ETHD Vaults Amount of MetaDAO tokens that users earn from ETHD Vault farms depends how Maker Governance has adjusted the MetaDAO Token Balancing Lever (explained later).    PRE-L - Rainbow Farm: MDAO with delegated MKR  Key mechanism in solving the issue of MKR voter apathy in the short run Set of farming contracts, one for each MetaDAO Allows users to pick which MetaDAO token they wish to farm Only possible to farm MetaDAO tokens with MKR that is actively delegating and participating in governance.    PRE-M - Temporary Farm: MKR with ETHD/DAI LPT  Simple uniswap farm that rewards MKR to users that deposit ETHD/DAI full range Univ3 LP tokens into it. Pays out MKR as rewards, not MetaDAO tokens, and there is only one farming smart contract available.    PRE-N - Rainbow Farm frontend  Simple frontend that exposes the 4 categories of farms Relies on users having already created vault or LP token, or delegated MKR Allows the user to choose which of the MetaDAO tokens they wish to farm The frontend then deposits the users tokens into the appropriate farm Designed to be as simple as possible, and expose no functionality beyond depositing into Rainbow Farms themselves. Can also contain instructions about how to obtain the farmable tokens in the first place    PRE-O - Farm Balancing Lever  MetaDAO tokens are distributed via yield farming with a halving curve like bitcoin  1.5 billion tokens first 2 years 750 million tokens next 2 years etc… Issuance stops year 10   1/3rd goes to MKR farms 2/3rds go to ETHD and Dai farms  The Farm Balancing Lever determines how the 1 billion is distributed between Dai and ETHD The Farm Balancing Lever is global for all MetaDAO tokens Maker Governance can use MetaDAO token distribution to influence the peg     Distribution Scheme  Interval 1 (Year 0-2): 1.5 billion tokens distributed in total Interval 2 (Year 2-4): 750 million tokens distributed in total Interval 3 (Year 4-6): 375 million tokens distributed in total Interval 4 (Year 6-8): 187.5 million tokens distributed in total Interval 5 (Year 8-10): 187.5 million tokens distributed in total (No halving, so the issuance ends)    (Additional Distribution Funnels for MetaDAO Tokens)  All MetaDAOs created with 500 million MetaDAO tokens in their MetaDAO Workforce Bonus Account, to be used for workforce bonus payments.  These tokens are fully controlled by MetaDAO token voters only The 6 Launch MetaDAOs, and MetaDAOs created before the MetaDAO Token Emission System receive an additional 250 million MetaDAO tokens Workforce Bonus is critical, must attract talent. (Vested appropriately)   250 million MetaDAO tokens are sold continuously over 2 years to build the MetaDAO treasury  MetaDAO tokens are first sold via dss-kiln to MKR The MKR is sold via dss-kiln to Dai      PRE-P - MetaDAO token anti-rush mechanic  What?  3 billion MetaDAO tokens are sold with a Limit Order Staircase Total of 100 limit orders of 30 million MDAO each Start price 0.01 DAI, increments of 0.001 DAI Final limit order at 0.109 DAI The Dai is converted to Elixir with dss-kiln and accumulated in treasury, to be transferred to Ember Burn Engine in Midgame   Why?  Prevents MetaDAO tokens from being too volatile when they are launched by having 3 billion MetaDAO tokens available as sell liquidity for each new MetaDAO. Ensures that MetaDAO tokens are less volatile early on, and that any price volatility is captured by the MetaDAO itself and converted to permanent treasury value    PRE-Q - Pregame MetaDAO Tokenomics Accounts  MKR Farm Account (temporary)  1 billion MDAO   Dai and ETHD Farm Account (temporary)  2 billion MDAO   Workforce Bonus Account  750 million MDAO   Treasury Funding Account (temporary)  250 million MDAO   Anti Rush Mechanic Account (temporary)  3 billion MDAO      Early Game - Objectives and Products  Early Game is the phase immediately following the Endgame Plan Launch Only phase of products where some of the products can be completely skipped   Objectives  “fast-follow” products that can build on top of the momentum created from the Endgame Plan Launch Keep the momentum going until the Midgame products are released several years later.   List of Early Game Products  Early Game Product List (Explained below)  EARLY-A - MetaDAO Vault Adoption Mechanism EARLY-B - Maker Node Network MANO ERC20 token EARLY-C - Farm: MANO with MDAO EARLY-D - Rainbow Vaults EARLY-E - MetaDAO vote delegation EARLY-F - Unified DAO Toolkit EARLY-G - Maker Teleport EARLY-H - Maker Sharded Vault Engine EARLY-I - Multichain Rainbow Farms EARLY-J - Multichain Dai Savings Rate    EARLY-A - MetaDAO Vault Adoption Mechanism  MetaDAO assumes all risks and running costs of adopted vaults. Maker periodically transfers all stability fees earned from them in excess of the Vault Adoption Cost of Capital Liquidation Penalties also transferred to the MetaDAO MetaDAOs can use the Maker Primary Vault Engine to simulate controlling their own MetaDAO Lending Engine This way, MetaDAOs can begin onboarding small scale collateral early on, and experiment with different types of collateral innovation The basic mechanism requires no additional protocol development and is run purely through MIPs MetaDAOs can experiment with new types of collateral and Vault designs Existing Maker Vaults, including RWA Vaults, can be migrated to Adopted Vaults following the Endgame Plan Launch. Requires Maker to designate the vaults as “adoptable vaults” using a MIP.    EARLY-B - Maker Node Network MANO ERC20 token  Maker has the worlds oldest Oracle network  Significant hidden value Vertical expansion: Can be used for more things!   Maker Rollup sequencers  future Maker Rollup (an Endgame Product)   Maker ETH Staking Network  Significant synergy with ETHD   Nodes as a service  Lido staking nodes Chainlink oracle nodes Other rollup sequencers Other blockchain staking   $MANO has simple, low risk purpose: Delegated Staking for nodes  MANO stakers take first loss risk and earn fee share MetaDAO provide core security with identification and hard collateral MANO doesn’t have its own governance, all decisions related to the MANO Rollup Ecosystem Account are made by MKR holders.   $MANO used as ecosystem incentive  MetaDAO Farming Maker Rollup ecosystem incentive fund Maker Rollup Development Fund      EARLY-C - Farm: MANO with MDAO  Distribute MANO quickly in order to begin bootstrapping the Maker Node Network ecosystem Permanent MANO emissions  50 million Midgame additional emissions of 1% of total supply per year is added   Each MetaDAO token has its own MANO farm Distributed to MDAO farms based on Rainbow Tokenomics split  8.33 million per year for each Launch MetaDAO Split based on Elixir Midgame and onwards   MANO Rollup Ecosystem Account  100 million MANO   MANO Workforce Bonus Account  100 million MANO      EARLY-D - Rainbow Vaults  Powerful but simple Early Game Product that provides short term utility to MKR prior to rainbow engine. Regular Maker Vault Type that can take actively delegating MKR deposited in a Rainbow Farm as collateral Allows MKR holders to continue participating in governance, while also farming MetaDAO tokens and at the same time also generate Dai. Liquidation Ratio for Rainbow Vaults must be very high Creates Dai backed by MKR which would result in greater losses to Dai holders in an Emergency Shutdown event  Mitigated by the fact that it provides a significant incentive for MKR holders to participate in governance and delegate their MKR Governance participation helps mitigate risks that can lead to an Emergency Shutdown in the first place      EARLY-E - MetaDAO vote delegation  Necessary for MetaDAOs to scale up their governance and communities over time MetaDAOs aren’t at high risk if there are only very few MetaDAO delegates, so vote delegation is purely a benefit for MetaDAOs.    EARLY-F - Unified DAO Toolkit  Will help organize the Decentralized Workforce and enable the community to have a possibility of actually following the work of the decentralized workforce Streamlining and organizing all processes into a single system Uses a consistent language, design and user experience to make it as easy as possible to understand the information being presented Single source of all information necessary to deeply understand and participate in governance or the decentralized workforce. Unifies the tooling used both for governance and for work processes    EARLY-G - Maker Teleport  L2 bridge system that enables fast withdrawals from Optimistic Rollups. Gives Dai a unique advantage when it comes to multichain UX. Part of the Sharded Vault Engine roadmap and leverages the same infrastructure and features    EARLY-H - Maker Sharded Vault Engine  First iteration involves deploying new versions of the original MCD codebase, with modifications, on Optimism, Arbitrum and Starknet. Will enable the Homebase System, that benefits CreatorDAOs by giving them a small revenue share of all income earned by the Sharded Vault Engine on the Homebase they choose. Enables the development of Multichain Rainbow Farms, and will enable MetaDAO Vault Adoption to become multichain as well. Launch of the Sharded Vault Engines is a major opportunity to build momentum for L2 adoption    EARLY-I - Multichain Rainbow Farms  Multichain deployments of the Rainbow Farms would allow Dai users and ETHD Vault users to also farm MetaDAO tokens on an L2 where a Sharded Vault Engine is present. Multichain Farm Balancing Lever that splits up the MetaDAO tokens between mainnet and the L2s.  Works automatically based on oracle input to regulate the amount of MetaDAO tokens that go to each multichain farm Makes the returns earned when farming the same MetaDAO tokens roughly the same across all shards.      EARLY-J - Multichain Dai Savings Rate  Would also allow users to access the Dai Savings Rate on L2s, making for a better user experience. Relatively straightforward, and would require no balancing mechanisms or similar    Part 4 - Index - Part 6 (pending) ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-11/16959",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/6",
                        "https://forum.makerdao.com/t/relay-semanal-19-25-de-julio-del-2022/16925",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-11-traduccion/16960"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.426660741684476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "10",
                    "time": "21/07/2022-19:10:48",
                    "content": "@LongForWisdom some serious work/time and tenacity went into this.     LongForWisdom:   To help get my head around the Endgame Plan so I can form an opinion on it. To improve accessibility of what is an incredibly complicated set of concepts and proposals    Can’t wait to see your opinion and your attempt as improving accessibility of the concepts.  While helpful this is still incredibly complex. I will give the simplest example why based solely on the above. The fact EndGame now has 7 parts (and still growing btw). The above ‘Part 5’ has:   4 sections Pre, Early, Mid, EndGame   Pregame - A-Q what 17 products   Each product above has a specific set of goals and notes without any tangible practical analysis or examples.  Each product has multiple details and points. Under pregame alone there is 10-20 other sections of ‘details’ some of these are extensive just for each single ‘product’.   EarlyGame - A-J 11 products - again each product with multiple points and specifications.   Mid and End Game not even included in this Summary which is now on Part 5.   If one just breaks down the total number of products and points it looks to be easily approaching 50 on products and perhaps 500 on points and bounding on something like 50-100 pages of text…   To even investigate a single point or product carefully could take a person some good amount of an hour or even a good fraction of a day depending on how complicated the point is.  Multiply by 500… Whenever I see something so complex I ask a simple question what is the least required to achieve the same goal(s).   Seriously what is the real goal of EndGame.  I have not seen one single concise statement of this goal yet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.733104858104858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#3",
                    "likes": "2",
                    "time": "21/07/2022-19:52:08",
                    "content": "    MakerMan:  Seriously what is the real goal of EndGame. I have not seen one single concise statement of this goal yet.   To partition risk across core Maker products (Simple Dai) and external structures (MetaDAOs) while enabling the decentralized workforce to grow Maker exponentially using a decentralized governance that is ossified in a functional and resilient manner. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.912698412698413
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "4",
                    "time": "21/07/2022-20:13:06",
                    "content": "    MadShills:  To partition the risk from core Maker products (Simple Dai) and external structures (MetaDAOs) while enabling the decentralized workforce to grow Maker exponentially using a decentralized governance that is ossified in a functional and resilient manner.   Appreciate the response @MadShills Going to have to take your word on that.   I assume this statement is somewhere in the extensive documents.    Honestly wouldn’t this one goal statement be enough to start a discussion because as I see this. I think this may be a better way to simplify and organize the points.   Hopefully LFW will be tolerant of us starting up a discussion here that may help others.  Partition Risk from core Maker products (what is simple DAI vs. DAI?) and external structures. Enabling decentralized workforce to grow. Ossifying decentralized governance. Attempt to make the ‘system’ more functional and resilient.  With respect to 1) above.  What external structures pose a risk to DAI? How does this plan address them?  With respect to 2) above  Is it necessary for the workforce to grow?  Why?  and more importantly Why is EndGame the preferential method to implement this growth? Is there a simpler plan that achieves the same goals. Growth has costs associated is Maker prepared to pay these additional costs and how will is measure success?   If we grow revenue slower than expenses is Maker doing better for example. Does this plan attempt to address at all the monopolistic bids on CU services or further cement these services into single MetaDAOs, and why is the metaDAO preferred or more efficient than simply opening up CU services to generalized service request and bidding by qualified/experienced parties.  With respect to 3)  Why is governance ossification important and what measure will be applied to measure this and more importantly to measure the improvement of it as changes are applied.  With respect to 4)  By what definition or measure is Maker more or less functional? By what definition or measure is Maker more or less resilient? I see no definition or measure, much less any data being presented that suggests these are significant issues much less anything that will be measured to see that they will improve based on ‘any suggested’ changes.  There is a hell of a lot of lip service being applied to describing problems at Maker vs. a scientific approach with data on any given problem subject,  this leads to a significant inability to determine if changes made created scientifically measured improvements to these problems, in terms of quantity or quality. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.849319727891156
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#5",
                    "likes": "4",
                    "time": "21/07/2022-21:47:22",
                    "content": "    MadShills:  To partition risk across core Maker products (Simple Dai) and external structures (MetaDAOs) while enabling the decentralized workforce to grow Maker exponentially using a decentralized governance that is ossified in a functional and resilient manner.   I guess, fundamentally, if that’s the goal shouldn’t we try to achieve that in the simplest and clearest way possible? Ossifying Maker’s fundamental structures makes sense. Spinning out external structures makes sense. But despite LFW’s helpful summary I still don’t know why we need things like MANO wells, elixir or Rainbow Farms in order to achieve those overarching aims. Every additional product and each new bit of complexity adds to the engineering backlog, increases technical risk, and increases the already imposing learning curve for those new to Maker. It doesn’t mean we shouldn’t do anything new, but there’s definitely some value in clarity and simplicity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.048295454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#6",
                    "likes": "2",
                    "time": "22/07/2022-05:23:16",
                    "content": "    Matt_NZ:  Every additional product and each new bit of complexity adds to the engineering backlog, increases technical risk, and increases the already imposing learning curve for those new to Maker. It doesn’t mean we shouldn’t do anything new, but there’s definitely some value in clarity and simplicity.   Echo Matt’s sentiment here. There is no indication that any of these extra tokens are improving the product or have any meaningful demand in the market. I’d really like to see a MIP strategy that is incremental rather than strapping everything to one ratification poll, take it or leave it. I see the word ‘exponential growth’ a lot in endgame posts, and no indication of where this growth will come from or why it will be exponential (for how long?), which makes it more of an affirmation of faith rather than a strategy or even a goal. Tokenomics can maybe optimize for local maxima but can only do so much for creating a product with real market demand.     LongForWisdom:   Deliver the greatest possible impact in terms of growth and short term momentum Bootstrap the MetaDAO ecosystem Maximize Dai generated from Staked ETH Incentivize MKR holders to delegate their votes Aim to launch within 12 months.    As an example, above the only mention of Maker vaults as a product or Dai as a stablecoin is captured in the presumption these are both reflected in ‘greatest possible impact in terms of growth’. The rest of the plan seems to be about accumulating staked ETH, delegating vote from token holders and investing inordinate amounts of financial and technical resources in executing meta daos. Would be useful to separate each of these initiatives and walk back from an ‘all or nothing’ strategy to bet the house.  What are we doing for Maker vaults? What are we doing for Dai holders? What are we doing to accumulate as much staked ETH as possible? What are we doing to attract more voter delegation? What are we doing to operationalize a better aligned workforce?  Looking at the Pregame product list, I’m not convinced this is a list of ‘low cost’ products. Not to mention the pivot from operating an existing system that is still miles away from an unassailable leadership position, to issuing myriad new tokens and entering three or four new markets at once. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.821108815426998
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#7",
                    "likes": "3",
                    "time": "22/07/2022-06:03:48",
                    "content": "Just to echo this, thinking that the tokenomics will be key to attracting talent to join the MetaDaos and will need to be simple enough to explain in a simple one pager. Too much complexity will make this very challenging. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#8",
                    "likes": "1",
                    "time": "22/07/2022-08:14:52",
                    "content": "Sic et simpliciter… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/07/2022-08:39:54",
                    "content": "This is incredible, I was working through the text, and you already distilled it during the same time. Great work! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "4",
                    "time": "22/07/2022-11:32:54",
                    "content": "    MakerMan:  While helpful this is still incredibly complex.   Yeah, I’m really aware of this as well. This first set of summaries is a (mostly) faithful reduction of the original text - the same content, but cut down. Once all parts are public, and all of these first set of summaries are done, I will create a second set to cover the main concepts / deliverables in increasing levels of detail. I’m hoping this will make it more accessible. I agree though, that much of the issue is just that there is a huge amount of source material, and there is only so much anyone can do to make so much information digestible.     Matt_NZ:  But despite LFW’s helpful summary I still don’t know why we need things like MANO wells, elixir or Rainbow Farms in order to achieve those overarching aims.   To be fair, it’s worth checking the original text for these as well, in some cases I’ve cut ‘why’ in order to succinctly explain ‘what’. That said, it’s not always that clear from the original text either. Iirc, some of the why is in P1 as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.10024154589372
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tru_Greg",
                    "index": "#11",
                    "likes": "4",
                    "time": "28/07/2022-10:56:45",
                    "content": "Incredible work LFW, admire your dedication here. I’m with @MakerMan on the complexity assessment, even though I like complex systems this one is just out of this planet. Not judging the merits (still processing them) but something so robust would require an exquisite design, management processes, not mentioning the coordination…   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#12",
                    "likes": "0",
                    "time": "27/10/2022-16:57:08",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1302"
}