{
    "poll_list": [
        {
            "title": "Ratification Poll for Modify Protocol Engineering Core Unit Budget, PE-001 (MIP40c3-SP68) - April 11, 2022",
            "index": "13797",
            "option": "Yes",
            "supporting_mkr": "77,786",
            "highest_fraction": 0.84
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp68-modify-protocol-engineering-core-unit-budget-pe-001/13797",
            "title": "MIP40c3-SP68: Modify Protocol Engineering Core Unit Budget - (PE-001) ",
            "index": 13797,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mip-accepted",
                "pe-001",
                "core-unit-budget",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "4",
                    "time": "09/03/2022-23:18:34",
                    "content": " MIP40c3-SP68: Modify Protocol Engineering Core Unit Budget - (PE-001)  Preamble MIP40c3-SP#: 68 Author(s): Derek Flossman Contributors: Protocol Engineering Core Unit Tags: core-unit, cu-pe-001, budget, dai-budget, active Status: Accepted Date Applied: 2022-03-09 Date Ratified: 2022-04-25 Forum URL: https://forum.makerdao.com/t/mip40c3-sp68-modify-protocol-engineering-core-unit-budget-pe-001/13797 Ratification Poll URL: https://vote.makerdao.com/polling/QmWphKJY   Sentence Summary This subproposal is requesting a 12 month Budget of 7,590,000 DAI for the Protocol Engineering Core Unit starting from May 2022. This will be implemented via a 632,500 DAI per month stream using DssVest.  Paragraph Summary  Specification  Motivation Protocol Engineering would like to secure an operating budget for it to deliver its mandate over the next 12 months. The prior year’s budget in review gave a good illustration as to where Protocol Engineering under- or over- budgeted for the work we sought to accomplish, which has subsequently helped inform this document. The following proposal is also in support of the forum post: Protocol Engineering Core Unit Workstreams. Our team stands behind this proposal as an optimal solution for scaling the Core Unit in a dynamic environment. We encourage readers to review that post in conjunction with the below budget request.  Core Unit ID  PE-001 (Protocol Engineering)   List of Budget Implementations  Using DssVest, the budget will be distributed monthly to the Protocol Engineering Core Unit Multisig: 0xe2c16c308b843eD02B09156388Cb240cEd58C01c The first month’s payment will include the core unit cost for May (632,500 DAI) plus the Emergency Fund amount (800,000 DAI) for a total of 1,423,500 DAI. Multisig Ownership: This multisig is anonymous individuals selected by the Protocol Engineering Team.  For reference, the Protocol Engineering Emergency Multisig remains in operation: 0x83e36aAA1c7b99E2D3d07789F7b70FCe46f0d45E, with the following 3-of-6 signatures:  Derek (Protocol Engineering): 0xe3a76328edE8Fd61d5fA7840b878Dd69cdfD67d8 Nadia (Growth CU): 0xc8E6c287F6c127AFE5e4CB30bC440607b44c35f8 LongForWisdom (GovAlpha) : 0x66f40F044E0e2F77bB746e3275E82e88dCBA2D69 Primoz (Risk CU): 0x5d67d5B1fC7EF4bfF31967bE2D2d7b9323c1521c Cmooney (Protocol Engineering): 0xEeF3026eF864C9398c008195E65d16D9cb42a512 Nik (Oracles CU): 0xB4CFf22c0d5a015460Fd503a9328Bf00a24f686c   List of Budget Breakdowns The following table illustrates the proposed budget for 2022-2023:  1486×800 57.2 KB   Budget Details The following items provide further detail into the above data points.  Salaries & Healthcare  The team has decided to remain on the same salaries as the previous year. The biggest cost driver is due to the team choosing to increase headcount by 3, from 14 to 17. Further detail about this decision and the roles being sought can be found in the  Protocol Engineering Team Core Unit Workstreams Forum Post. Healthcare as a line item has been removed, standardized across team members and rolled into the salary line item (previously we had a two-tier model: US and non-US), this means some team members are seeing up to a 2% increase in pay as a result. New monthly reporting will indicate how many resources each workstream is using (Core Protocol, Cross Domain Scaling and Safety Workstream). To-date the reporting has been at the level of the core unit, not the individual workstreams, therefore we intend to provide an extra level of insight. Initial planning suggests the following balance:   1644×1008 85.7 KB   Events & Travel  Events and travel will remain at existing levels to maintain a presence at industry conferences and meetings, ($12k p/person), with a small addition to cover meeting room bookings.   Hardware  Hardware budget will be maintained at the same level ($3k p/person)   Referral & Sign-on Bonuses  Referral & Sign-on Bonus shall also be retained as we plan on growing our team based on the above Salaries section.   Auditor Costs & Retainers  Auditor funding will be increased to account for higher market costs as experienced last year. Due to the fact that we have already paid for the existing retainer, we expect to be able to pull forward some savings here.   Gas Costs & Contract Deployment  Matching last year’s gas cost usage for this line item.   Legal/Operating Expenses  To cover ongoing annual reporting, entity fees, and legal advice.   Contingency Buffer  The Contingency Buffer will be reduced from $200k to $100k as we have a better understanding of costs and cashflow requirements.   3rd Party Contractors / SC Verification & QA  Continuing our engagement with 3rd party providers, including Certora and Runtime Verification. This tooling helps ensure our contracts adhere to formal correctness as well as support the development of new engineering tools.   Extending the Operation of the Emergency Multisig  As per the previous year, this multisig is only to be used in the event that the protocol has suffered a worst-case scenario event (for example, extreme de-peg or protocol loss leading to emergency shutdown). It is to be made available only to support a complicated wind down across multiple chains and eventually reboot the protocol. The fund will cover; auditor fees ($356k), gas costs ($120k) and salaries ($1.8M) for existing employees, for 6 months in order to support rebooting the protocol, based on last year’s running actuals. The existing Emergency Multisig currently holds $1.5M. To support this request we are seeking to extend the current balance by $800,000, to bring to total multisig value to $2.3M.   Other Notable Items not Reflected Above  Any funds remaining in the monthly multisig from May 2021-April 2022 will be returned to the protocol in the first month of our new term. The $100k bug bounty line item in our budget has been removed as it falls within the remit of the Immunefi Core Unit (IS-001).   MKR Vesting  Existing core unit members are not requesting additional MKR as their vesting plan will carry over from 2021. The proposed new team members (3 in total) if hired will vest at the same level as the rest of the team, prorated to a duration of 3 years, ending on April 30th 2025. The MKR is equivalent to 248.75 MKR per person per year, over 3 years, including the 1 year cliff. At the time of setup, this will be administered via DssVest. It is worth noting that last year’s two MKR streams remain unused.  ",
                    "links": [
                        "https://forum.makerdao.com/t/protocol-engineering-core-unit-workstreams/13795",
                        "https://forum.makerdao.com/t/protocol-engineering-core-unit-workstreams/13795",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-18-de-abril-de-2022/14700",
                        "https://forum.makerdao.com/t/weekly-relay-april-12-18-2022/14691",
                        "https://forum.makerdao.com/t/weekly-mips-update-83/14673",
                        "https://forum.makerdao.com/t/relay-semanal-5-11-de-abril-de-2022/14616",
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246/31",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-11-de-abril-de-2022/14594",
                        "https://forum.makerdao.com/t/weekly-relay-april-5-11-2022/14590",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/63",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2",
                        "https://forum.makerdao.com/t/pecu-month-in-review-march-2022/14493",
                        "https://forum.makerdao.com/t/weekly-mips-update-81/14443",
                        "https://forum.makerdao.com/t/weekly-mips-update-80/14274",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106",
                        "https://forum.makerdao.com/t/weekly-mips-update-78/13903",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-2-9-2022/13804",
                        "https://forum.makerdao.com/t/bear-cu-facilitators-transparent-and-proactive-cash-management/16151/15",
                        "https://forum.makerdao.com/t/monthly-governance-review-april-2022/14986",
                        "https://forum.makerdao.com/t/mip40c3-sp79-mkr-compensation-for-starknet-engineering-core-unit-sne-001/17042",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/57",
                        "https://forum.makerdao.com/t/relay-semanal-12-18-de-abril-de-2022/14724"
                    ],
                    "GPT-summary": "The post is a proposal for a 12-month budget of 7,590,000 DAI for the Protocol Engineering Core Unit, with a breakdown of the budget and implementation details. The proposal is explained in detail by the author, and there is positive feedback from a 3rd party. There is also constructive criticism and auditing of the proposal by the author and 3rd parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Board composition",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.281274281274281
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/03/2022-00:53:44",
                    "content": "Congratulations to PECU for a successful campaign from from May 2021 to February 2022–the success of the DAO was highly dependent on your work. Thank you! With regards to the Team’s focus, will any part of your budget also include supporting the evolution into sidechains like Polygon, or any other EVM compatible chain that has been making headway in crypto? Does that fall under cross-domain scaling, and is the mandated actor, or the Facilitator in-charge of making such decision? I know we have been told that PECU will do what MKR token owners request, but trying to get an idea of the thinking behind this new structure that has been proposed. Also, can you please provide more color on on what the additional headcount (future hires) will be concentrating on? Is there any chance these folks will work on helping 3rd party contractors build on top of Maker? Which on the 3 team structures will be beneficiaries of the new hires? (sorry if I missed that part). Thanks in advanced–and again, nice job–looking forward to the new Structure–should be a dandy! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7994652406417115
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "2",
                    "time": "10/03/2022-01:19:39",
                    "content": "Hey ElPro, Thank you and good questions. The rationale for rebranding the work stream from “L2” to “Cross Chain Scaling” or “xchain” (We’ll see what meme sits with the community), is precisely to take into account the realisation that we’re not just exploring Optimistic or ZK rollups, but that there is a community-voiced evolution towards other chains such as Polygon/others - of course all of this will depend on Governance and the appropriate risk and technical assessments as usual. So, in short yes, other chains will be under consideration for this Cross Chain Scaling Work Stream - much like we’ve been doing today, just that it wasn’t encapsulated in the existing L2 reference. Regarding decision making, the facilitator remains responsible for actions of the core unit and is the final arbiter of decisions made. The benefit of introducing the mandated actor is that it enables formalizing additional technical ownership to complement the decision making of the core unit. I give a bit more colour for the specific roles and how I see them fitting within the CU here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.735294117647058
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#4",
                    "likes": "3",
                    "time": "20/03/2022-19:40:45",
                    "content": "Appreciate the additional transparency included in the budget and am excited to see the team evolving into the three separate workstreams. When is the team targeting to hire the three additional headcounts by and what are your thoughts on continuing to invest growing these teams? Do these plans change significantly if the DAO is able to raise the Surplus Buffer to 150-250M by raising funds? This is one of the budgets I’d like to see be more ambitious in terms of expansion. Goldman Sachs did a study in 2013 measuring stock returns of Nasdaq 100 companies relative to R&D expenditure and found them to be positively correlated to the tune of an r-squared of 75%. If there was a study done on this in crypto, I imagine we’d see even higher correlation.  image987×784 87.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.548295454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "3",
                    "time": "20/03/2022-20:23:21",
                    "content": "    Aes:  an r-squared of 75%   Wow, so PE is our marketing core unit?  But seriously, this puts some color on @hexonaut’s support of the Events CU. Maybe we should invest a lot of faith in our engineers’ ability to navigate the business. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#6",
                    "likes": "0",
                    "time": "21/03/2022-00:46:27",
                    "content": "Can this unit provide lists? Of what time costs maker? It is difficult to understand what projects are expensive in time and which are not. The spells are very expensive? What about new collateral? Or changes to government smart contracts, example delegation changes? Thank you  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.7006493506493503
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#7",
                    "likes": "0",
                    "time": "24/03/2022-04:01:13",
                    "content": "Reminder that this proposal will enter its Frozen Period in one week, on March 31, 2022. Last day for modifications is March 30, 2022. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. Please reach out if you have any questions! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#8",
                    "likes": "4",
                    "time": "03/04/2022-16:27:00",
                    "content": "Hi Puzzler, apologies for missing this message in my alerts. In general, the more core contracts that a particular change touches, the greater the level of effort and safety review required. It’s a tough one to generalize because of the unique aspects of each change, but I can give some examples of what work takes time. The biggest recurring cost on resources are the weekly governance spells - they require one individual to write the code and at least two individuals to review the code before it gets deployed. We enforce the idea of 3 independent sets of eyes to review anything that goes into the protocol because it’s critical to eliminate any chance of mistake. You mentioned collateral types - going forward, these are mostly written by the CES team and so will likely require only a review from PE, but liaison and oversight of new implementations can also take time away from other tasks to ensure that new additions fit with existing design patterns. On the other hand, for example, a complete replacement of the chief contract - which manages the approval voting system of Makerdao would take significantly longer (several months) - similar to what we saw with the liquidations2.0 rewrite. Delegate contract changes, although important are permissionless and are not interacting directly with core contracts so would take much less time (days) to develop. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.468045843045843
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#9",
                    "likes": "1",
                    "time": "04/04/2022-21:13:01",
                    "content": "As the time is upon us, please put this forward for formal submission @blimpa . Further discussion or direct messages on any of the above is more than welcome, thanks all. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#10",
                    "likes": "0",
                    "time": "14/04/2022-02:58:02",
                    "content": "This proposal is currently being voted on. Its RP will run from 04/11 to 04/25. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "13/07/2022-02:58:09",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "798"
}