{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/some-thoughts-on-liquity/8881",
            "title": "Some thoughts on Liquity ",
            "index": 8881,
            "category": [
                "Governance"
            ],
            "tags": [
                "liquity"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "24",
                    "time": "21/06/2021-13:53:05",
                    "content": "Couple of people on this thread: [Signal Request] Shorten the PPG process - #9 by Tosh9.0 were commenting on the competitiveness of Liquity in relation to Maker. I’ve looked pretty deeply into Liquity at this point (it’s an interesting protocol!) but I am not convinced that it represents an improvement for Vault users in Maker, regardless of the attractiveness. I believe that any vault holders that migrate to it are eventually going to realize that it’s much worse for them than Maker is, regardless of the relative fee.  Almost 90% of all LUSD in existence is in their Stability Pool and receiving LQTY incentives. This means either (or some mix of the following) are true:  Close to 677M worth of usage doesn’t reflect any desire for credit / leverage using Liquity - meaning it’s not stealing users from us. Everyone using Liquity for leverage is not going to be able to pay back their Troves if (when) the ETH price drops - leading the price of LUSD to spike the same way it did to DAI on Black Thursday and Trove users taking up to a 10% haircut as they need to buy back LUSD close to $1.1.     [Signal Request] Shorten the PPG process   I’ve also seen a marketing campaign by Liquity-connected persons to pump up the positives of LUSD vis-a-vis Dai. Now would be a good opportunity for content production or marcomms (if there was one) to point out why LUSD is problematic for the typical user/borrower.   To be clear, LUSD is probably a superior asset to DAI provided you purchase it at close to $1. It’s that superiority that makes Liquity as a platform a terrible deal for Trove/Vault users. The trade-offs that the protocol makes to ensure LUSD is a great asset directly and negatively impact Trove users. This is most apparent in these mechanics:  Redemptions to maintain lower bound of the LUSD peg are directly negative for Trove users, and introduce a zero-sum game mechanic when trying to maintain a safe collateralization ratio. Stability pool incentives that lock-up such a huge proportion of the existing LUSD - preventing Trove users from accessing it when they want to de-lever. ‘Liquidations’ that socialize bad debt to all Trove users in the absence of LUSD in the stability pool (admittedly unlikely in the near future due to the incentives above.) The upper bound of $1.1 on the LUSD peg risking haircuts when wanting to close up a Trove.  Edit: Some counterpoints to the above have been provided by Liquity in a recent medium post. Feel free to give it a read. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-shorten-the-ppg-process/8862/9",
                        "https://medium.com/liquity/addressing-concerns-about-liquity-2af3e1d0a946",
                        "https://forum.makerdao.com/t/maker-relay-ep-51/9011",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-18-24-2021/8943",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-147-thursday-june-24-17-00-utc/8904/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-51-en-espanol/9063"
                    ],
                    "GPT-summary": "The post discusses the Liquity protocol and its competitiveness in relation to Maker. The author provides constructive criticism of Liquity and argues that it is not an improvement for Vault users in Maker. The author also mentions a marketing campaign by Liquity-connected persons and suggests that content production or marcomms should point out why LUSD is problematic for the typical user/borrower. The post ends with an edit mentioning counterpoints provided by Liquity in a recent medium post.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.194270833333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#2",
                    "likes": "1",
                    "time": "21/06/2021-14:04:40",
                    "content": "Appreciate the deep-dive analysis and explanation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "0",
                    "time": "21/06/2021-14:46:45",
                    "content": "    LongForWisdom:  Almost 90% of all LUSD in existence is in their Stability Pool and receiving LQTY incentives.   This means that if the incentives run out or drop considerably, as happened with Iron Finance and your Titan, then the liquidity they have generated could be greatly depleted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/06/2021-14:50:43",
                    "content": "They have it setup for the long haul:  LQTY’s community issuance (outside of LP incentives and the Community Reserve) follows a yearly halving schedule, described by the following function: 32,000,000 * (1–0.5^year). The purpose of this issuance curve is to favorably incentivize early adopters while also maintaining incentives for the long term. LQTY Rewards and Distribution - Liquity Docs  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/06/2021-14:56:48",
                    "content": "I am not sure about credit / leverage, what can happen is someone mint/sell Lusd to buy something else and another user buys Lusd to get reward. Therefore, it can be used for leverage. It works a bit like our SRD, they pay to get the demand. But I agree with the others point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#6",
                    "likes": "1",
                    "time": "21/06/2021-15:40:24",
                    "content": "Agreed – thanks for doing this, Long. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/06/2021-19:19:23",
                    "content": "Wow, that’s steep. Downward? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#10",
                    "likes": "0",
                    "time": "21/06/2021-19:27:06",
                    "content": "Main issue with it, it is actually very good for borrower. If you have the liquidity you can repay your interest free loan with benefit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.46111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#11",
                    "likes": "1",
                    "time": "21/06/2021-19:52:56",
                    "content": "wow super peg xd ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#12",
                    "likes": "2",
                    "time": "22/06/2021-02:37:24",
                    "content": "the price graph looks like the rhythm of a heart, omg xd ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#13",
                    "likes": "0",
                    "time": "22/06/2021-22:37:47",
                    "content": "Liquity is a very cool protocol, but as a functioning stablecoin it currently lacks liquidity on the majority of DEXES and seems primarily to be focused as a cheaper alternative to Maker’s ETH-B Vault allowing people to make riskier leverage on ETH with less cost. Nice Write Up  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.288333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#14",
                    "likes": "0",
                    "time": "22/06/2021-22:48:50",
                    "content": "I feel it is a coin designed for farming, but in itself without the use of DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#16",
                    "likes": "1",
                    "time": "23/06/2021-15:38:59",
                    "content": "    KoltenB:  Out of curiosity, where did you see this 12 cent move?   Coinbase’s price feed. It also shows LUSD going between 97 cents and $1.08 in the last 24 hours. So… not a very stable stablecoin if there’s that much volatility in secondary markets  I wish them luck, but they’re not a competitor to us. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#17",
                    "likes": "0",
                    "time": "23/06/2021-17:26:34",
                    "content": "    PaperImperium:  I wish them luck, but they’re not a competitor to us.   Clearly, it is as if you pay and return the change, you issue LUSD you can stake it and receive “rewards” those rewards go down in value, there are no incentives and all for sale, it makes no sense. more than speculative not long term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party giving negative feedback on proposal",
                        "3rd party questioning proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.586805555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#18",
                    "likes": "0",
                    "time": "23/06/2021-19:58:29",
                    "content": "There is incentive, you can get 25% off during the Liquidation as LUSD provider. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#19",
                    "likes": "3",
                    "time": "24/06/2021-01:03:25",
                    "content": "    PaperImperium:  Coinbase’s price feed. It also shows LUSD going between 97 cents and $1.08 in the last 24 hours. So… not a very stable stablecoin if there’s that much volatility in secondary markets    To be fair check the price history of dai was quite volatile before the PSM was implemented. I acknowledge they are certainly significantly behind MKR in terms of development cycle however it would serve us well to not totally ignore them either. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#20",
                    "likes": "0",
                    "time": "24/06/2021-15:08:33",
                    "content": "What about sUSD or sEUR? Do they not have enough liquidity? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#21",
                    "likes": "0",
                    "time": "24/06/2021-16:09:05",
                    "content": "These are Synthetix assets? If so, I would say they are not structurally sound as they have no enforcement mechanism for their pegs nor do they have an emergency settlement mechanism to enforce the peg in extreme circumstances. We could easily find ourselves holding assets that are completely detached from their intended price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.010416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#22",
                    "likes": "0",
                    "time": "24/06/2021-17:26:01",
                    "content": "    g_dip:  These are Synthetix assets   In addition, according to their meaning in English, synthetic assets simulate or imitate the price of the asset to which they are linked. Therefore, I do not see how they could counteract a major turbulence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#23",
                    "likes": "1",
                    "time": "24/06/2021-17:54:47",
                    "content": "Sorry should have been more clear - I’m asking if these are synthetic assets from the company Synthetix ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#24",
                    "likes": "2",
                    "time": "24/06/2021-19:49:25",
                    "content": "I feel like we have this kind of discussion quite often (and it’s good!). For example, remember how the community talked about Reserve Protocol and Kava as potential Maker Killer. But now their stablecoins are not scaling at all (and Kava’s stablecoin is constantly 5-15% off peg). Then the community also talked about Vigor on EOS… not doing so well. Then some talked about Venus and Vai. Vai is under peg all the time and due to recent manipulation, millions in debt and they don’t know how to solve it. Point is: Gotta watch these competitors for a long time before we worry about them. For example, I think UST managed to grow to a point that they can challenge us in certain niche markets (E-commerce for example but I mean their founder company is an E-commerce giant). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.600892857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#25",
                    "likes": "3",
                    "time": "24/06/2021-19:51:23",
                    "content": "I think some also mentioned Celo dollar, Fei and Rai. Both might be interesting ideas but in terms of adoption especially in DeFi, Dai is still superior ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#26",
                    "likes": "1",
                    "time": "24/06/2021-20:00:53",
                    "content": "Also it might be shocking to some but DSR has been one that might be able to make Dai more attractive and competitive even for institutions but we haven’t had a decent level DSR for so long, even before I lost my sense of humour. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.763888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#27",
                    "likes": "1",
                    "time": "25/06/2021-16:16:26",
                    "content": "    Doo_StableLab:  I think some also mentioned Celo dollar, Fei and Rai. Both might be interesting ideas but in terms of adoption especially in DeFi, Dai is still superior   In every explanation I give about DEFI I always say that thanks to makerDAO and DAI is the current construction we have of them, therefore I imply that DAI = DEFI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#28",
                    "likes": "0",
                    "time": "02/07/2021-09:58:57",
                    "content": "Some counterpoints to the above have been provided by Liquity in a recent medium post. Feel free to give it a read. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#29",
                    "likes": "1",
                    "time": "02/07/2021-10:37:21",
                    "content": "Hey, Liquity, if you’re reading, all of the price volatility I cited in this thread came from Coinbase’s feed, not CMC or Coingecko, just a heads up. Your “stable” coin has a 5c range on a very typical day like today. Fix your peg before talking so much smack on Twitter. It’s like your pants are falling down and we can see your underwear. Also, I wish y’all luck. To anyone else, I know it’s unfashionable to say so, but if a business has to pay equity to its customers, it is losing money. Full stop. It’s not cash, but no one with an even basic understanding of accounting would say that’s a good strategy for more than an extremely short time. In theory, yes, you could dilute slower than you grow profits, but I’ve never seen evidence any protocol (not trying to only pick on Liquity) is in that situation. TLDR; anyone providing their own equity/governance to pay customers cannot do so forever, so we don’t need to view them as a competitor until they prove their model actually generates value and isn’t a place where capital goes to die. Maker worrying about Liquity is like a professional boxer worrying about some 5 year old who trash talks them on Twitter. Maybe they’ll grow into a threat, but it’s not clear they can even hit a keyboard — much less a punching bag — without spraining something. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.653703703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#30",
                    "likes": "0",
                    "time": "02/07/2021-10:44:43",
                    "content": "    PaperImperium:  Hey, Liquity, if you’re reading, all of the price volatility I cited in this thread came from Coinbase’s feed, not CMC or Coingecko, just a heads up. Your “stable” coin has a 5c range on a very typical day like today. Fix your peg before talking so much smack on Twitter. It’s like your pants are falling down and we can see your underwear.   Lets maybe avoid talking our own smack, hmm? I made the thread to highlight some aspects of the Liquity protocol that it felt like were being overlooked, not to start a shooting war. Likewise, I linked the response thread so people had access to the other PoV - not because I’m planning a rebuttal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.302777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#31",
                    "likes": "1",
                    "time": "02/07/2021-10:57:00",
                    "content": "    LongForWisdom:  Lets maybe avoid talking our own smack, hmm?   You are, as is usually the case, correct. I shouldn’t be so rough on the new kid. The substance of what I said still stands, though. Since they were already preserved through quotation, I’ll leave my comment above as a testimony to how grumpy a grown up can be before coffee. How I long for the vigorous mitochondria of youth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.280303030303031
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#32",
                    "likes": "0",
                    "time": "02/07/2021-12:45:57",
                    "content": "Well, we can say what we want, something is sure, at the end of the day, they are totally closed except from an oracle point of view (the only failure point) and governance less. They will stay forever, it is the beauty of it. At least until Ethereum die. They successed the most difficult parts which are the start-up and getting close to the billion. Also I think their response is fairly good. They acknowledged the trade off of being totally code closed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.098484848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#33",
                    "likes": "0",
                    "time": "01/10/2021-18:46:15",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}