{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/questions-about-mip47-multisigs-makershire/16072",
            "title": "Questions about MIP47 multisigs & Makershire ",
            "index": 16072,
            "category": [
                "Governance"
            ],
            "tags": [
                "multi-sig",
                "spf",
                "mip47"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#1",
                    "likes": "11",
                    "time": "27/06/2022-03:53:48",
                    "content": "If Makershire passes, 10,000,000 DAI belonging to MKR holders and entrusted to MakerDAO governance will be transferred to a 5-of-7 multisig. I have some questions that were not answered by MIP47, which outlines how MakerDAO multisigs will work. If any of the below questions cannot be satisfactorily answered, then the DAO will be putting MKR holders at significant and possibly reckless levels of risk by transferring community funds to a multisig.   What are the specific rules, processes and security that will be utilized during the multisig ceremony? Will the ceremony be in-person or virtual? If virtual, how will the rules, processes & security be enforced?   How can the DAO be assured that the private keys and/or mnemonics securing each of the 7 signing keys were generated in a proper clandestine fashion, have been infallibly secured throughout their existence, and were not compromised before being designated as a multisig signer?   How will the community multisig signers prove to MakerDAO that the multisig keys are not being held in a hot wallet like Metamask (as has happened with numerous other multisigs)?   What ongoing measures will MakerDAO be able to take to ensure that any future compromise of a multisig signers wallet becomes known to the DAO the moment that it happens?   Who will be legally & financially responsible if 5 of the 7 mutlsig keys are compromised and the funds are stolen (as has happened with numerous other multisigs)?   If MakerDAO governance decides to cancel Makershire and revoke the funds, what assurances does the DAO have that the multisig signers will act in the DAOs best interests and return the funds?   What measures are being taken to counteract the financial incentive that 5 of the 7 community multisig signers have to collude to steal, or fake a theft, from the multisig (as has happened with numerous other multisigs)?   In the spirit of decentralization, trustlessness and security for MKR holders, if these questions cannot be satisfactorily answered now, then we need to explore ways to delay the transfer of funds to the Makershire multisig until we can answer them, even if the poll & resulting executive passes. Even if Makershire doesn’t pass, we should still require answers to these questions before transferring MKR funds to community multisigs in the future. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3",
                        "https://forum.makerdao.com/t/mip55c3-sp4-adding-a-special-purpose-fund-makershire-hathaway/14643/55"
                    ],
                    "GPT-summary": "The post is a set of questions about the MIP47 multisigs and Makershire proposal. The author is concerned about the security of the multisig and asks specific questions about the rules, processes, and security measures that will be used during the multisig ceremony. The author also raises concerns about the financial and legal responsibility in case of a compromise of the multisig keys. The post can be categorized as 3rd party asking questions about the proposal, 3rd party giving constructive criticism of the proposal, and 3rd party auditing and reviewing the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.381578947368421
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#2",
                    "likes": "1",
                    "time": "27/06/2022-13:32:37",
                    "content": "Hi Chris, been following you for a while in Twitter, want to ask you something that supose you already explain long time ago but I never see. Following you, what’s the best practice towards multi-sigs? Cuz you always talk about them (like sometimes I feel you hate them haha). Cuz most of the CUs and other initiatives here includes multi-sigs, so would love your explaination about it. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.7375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#3",
                    "likes": "2",
                    "time": "27/06/2022-14:19:47",
                    "content": "    RoFz:  what’s the best practice towards multi-sigs?   Multisigs are very useful tools when you created the multisig, you distributed the keys and you’re securing your own money. If you do this properly, either you don’t have to trust anyone or you choose the level of risk that is right for you. But when you are trusting your money to a multisig that was created and is secured by someone else, you run into major security problems. The above questions are a clear demonstration of this. If you are trusting your money to a multisig and cannot answer the above questions, then how can you bring yourself to rationally believe that the multisig is infinitely secure and its creators will act in the correct way?  You simply can’t. Tldr: Multisigs are great if you create them to secure your own money. But they are existentially & incurably wrong when you are trusting your money to a multisig that someone else created and is responsible for securing. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.355691964285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/06/2022-14:37:06",
                    "content": "Thanks for all of your work on this. Good questions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#5",
                    "likes": "1",
                    "time": "27/06/2022-14:43:20",
                    "content": "The solution could be to further distribute the responsibility for signatories among Dao members with the most track record, experience and reputation, further decentralize that part meticulously, while still not being able to effectively automate it through smart contracts ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.511904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#6",
                    "likes": "0",
                    "time": "27/06/2022-14:54:45",
                    "content": "    cryptenthusiastic:  The solution could be to further distribute the responsibility for signatories among Dao members with the most track record, experience and reputation   Which of my questions would that answer? It would still require untenable amounts of trust from MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#7",
                    "likes": "0",
                    "time": "27/06/2022-15:03:05",
                    "content": "This is why we need to work on a smart contract with artificial intelligence that can solve this problem of trust. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.035714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#8",
                    "likes": "0",
                    "time": "27/06/2022-15:33:09",
                    "content": "    ChrisBlec:  Tldr: Multisigs are great if you create them to secure your own money. But they are existentially & incurably wrong when you are trusting your money to a multisig that someone else created and is responsible for securing.   Then what would be the best practice for any initiative within the DAO? Cuz if everything needs to pass through governance will be like suuuper slow right?     cryptenthusiastic:  This is why we need to work on a smart contract with artificial intelligence that can solve this problem of trust.   This is like too much no? haha ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.909090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#9",
                    "likes": "1",
                    "time": "27/06/2022-15:33:44",
                    "content": "    RoFz:  Then what would be the best practice for any initiative within the DAO? Cuz if everything needs to pass through governance will be like suuuper slow right?   Decentralization is much slower and less efficient than centralization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.019047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#10",
                    "likes": "0",
                    "time": "27/06/2022-15:48:36",
                    "content": "If there is no other better option, it must be done even if it involves a lot of work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.40625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "26/09/2022-21:48:55",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}