{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/specialization-unlocks-complexity/15709",
            "title": "Specialization Unlocks Complexity ",
            "index": 15709,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "delegation",
                "mission-focused-dao"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#1",
                    "likes": "16",
                    "time": "09/06/2022-18:02:43",
                    "content": "MakerDAO Governance - How Specialization Unlocks Complexity Thanks to reviewers @humancapitol @Hasu @hexonaut @adcv @SebVentures @christiancdpetersen @Eumenes. This piece reflects only my own thoughts.  1308×984 374 KB  As Maker proceeds, we must check-in along the way to ensure that our decision-making apparatus, or governance, remains effective. Rather than tear up the playbook, we should look towards history for lessons in how to best adapt our system to an ever-changing environment. What history tells us is that, as organisms, societies, countries, or companies grow more complex, those that are successful adopt specialization. As they do so, they can grow even more complex. The human brain is divided into semi-autonomous regions that execute within distinct cognitive domains, say motor movements or visual interpretation. The United States is just that, a collection of semi-sovereign states, each of which manage local priorities and decisions. Without superb reasoning to suggest otherwise, Maker should adapt its organization structure to reflect this natural law. What’s the Problem? Maker’s product has grown too complex for the governance apparatus that manages it. Definitions Specialization: clusters, communities, or groups focus and execute on distinct categories of activity. By demonstrating competence , such units earn a high level of autonomy to act within their respective domains. With specific consideration toward MakerDAO, I’d consider core units such as Real World Finance (RWF), Legal and Transactional Services (LTS), and Collateral Engineering Services (CES) to be part of a single Cluster. Framing: Organizational Structure of MakerDAO Maker consists of two primary functions, a software protocol and a decision-making apparatus that manages that protocol. Product and Governance, respectively. Maker is meant to generate economic value. It is not a non-profit organization. Product: DAI. Implemented through crypto lending, the PSM, the D3M, and RWAs. The protocol is a set of rules that determine under what conditions DAI is issued and burnt. Governance: MKR token holders, delegates, core unit contributors, and the community. Governance should guide the protocol in such a way that A) maintains the strength of DAI’s peg to the dollar and B) scales the demand for DAI. If governance is functioning correctly, a stable DAI and demand for that DAI should drive subsequent lending revenues to the treasury. Through executive voting, MKR token holders hold supreme responsibility to chart the course of the protocol. This supreme responsibility is distributed across a wide MKR holder base to prevent 51% attacks by self-interested parties. Current State of the Nation  1600×839 153 KB  The scope of executive votes and governance polls spans the entirety of DAO activities, from broad, strategic decisions (e.g. Add RWAs as business line) to granular ones (e.g. prioritize RWA collateral). Maker is functionally a micro-management machine. As structured, voters, whether MKR holders or those to whom they delegate, are ultimately responsible for understanding the details and context of each and every core unit’s activities in the DAO. (I have spent fourteen hours a day for nine months inside Maker and still can’t understand it all) As a result, most large token holders either delegate or remain dormant. Of 901K in circulating MKR, the average executive vote receives approximately 80K of voted MKR, a 9% participation rate. The reason no one shows up to the ballot box is due to the sheer complexity of Maker today. Complexity requires time, effort, and context to parse. Delegates are stuck between a rock and a hard place: either vote on all issues, even those in which you do not have expertise, or lose delegation as a result of inaction. Large funds tend to remain passive indefinitely, neither delegating nor participating directly—institutions are reluctant to delegate because it signals a lack of sophistication but are equally reluctant to vote due to a lack of resources required to parse the complexity. At some point, perhaps in the post-SAI and pre-RWA era, our decision-making structure made sense. But now the complexity of Maker’s product has outgrown its brain. No one should be expected to make informed decisions at every level of the hierarchy, from strategic direction to day-to-day, across every domain, from rate setting to RWAs. The issue lies not in the delegates, large token holders, core units, nor any other individual component but rather the basic design of governance. It’s simply impractical for current needs.  1228×916 208 KB  For the sake of impact, I will spell out the irony I see in Maker governance. Because MKR holders vote on everything, as the DAO becomes more complex, voter truancy will continue to grow. As truancy grows, decision making becomes highly centralized. Our variety of “liquid democracy”has watered the seeds of “liquid autocracy”. Ironically, we’ve invited censorship, the very threat that decentralized governance sought to dismantle in the first place, back to Maker’s doorstep. Future State of the Nation: Where Governance Needs to Go To cope with increased complexity, Maker must adopt specialization. Specialization occurs naturally in free markets because it’s dominant: the knowledge required for solutions is distributed among individuals, rather than concentrated in a central authority. Maker purports to acknowledge the local knowledge problem through “decentralization”, but in reality is plagued with the worst of both worlds. Governance is distributed amongst the many but most don’t vote due to complexity, making it ineffective. Core units, meant to solve that complexity locally, are impotent because they must submit all activity back to the governance apparatus, which again, is ineffective.  1472×1042 141 KB  Solution Part 1: Less is More Rather than act as a universal voting committee (referendum-maxi model), Governors will make fewer, more directional decisions around hiring, firing, budgeting, and “corporate” actions. I.e. less MKR voting on non-strategic items. Rather than make battle decisions, you’d plot the direction of the war. Does raising debt capital to pursue a growth strategy make sense? Should 20% of costs be cut in a bear market? Should a core unit’s budget be approved? If it enhances DAI network effects while sacrificing “hardness”, should MakerDAO onboard “unsecured” debt? Should the protocol adopt an official ESG mandate? Instead of monitoring the forums 24/7, the Governors would sit-in on key progress updates from Mandated Actors and coalesce monthly to deal with critical, directional issues only. This change would invite large token holders to participate alongside existing and new delegates, enhancing decentralization of thought and decision making. To implement this change, we’d cleave the decision-making apparatus in two: (1) The Governors (2) Clusters. This is not, in principle, dissimilar from MetaDAOs. It differs, however, in that it seeks to isolate and correct a governance mismatch with minimal existential disruption to the scaling of core business lines. Solution Part 2: Specializing With regard to how Clusters are managed, the Governors would focus solely on appointing/removing best in-class facilitators and approving/removing the budgets of core units, who might collectively form a Cluster such as Real World Assets. An RWA Cluster might include LTS, RWF, and CES and would focus on all collateral for which credit risk existed (i.e. off-chain credit, unsecured on-chain lending, secured on-chain lending etc., not crypto-lending). All but the highest-level decisions must be exported to the core units themselves. This includes prioritization of the collateral pipeline as per the strategic mandate set by the Governors. Note: I was deliberate in homing in on Real World Assets. RWAs most incisively the weaknesses in contemporary governance. It is extremely complex, yet not managed by those most equipped to understand the complexity. Specialization of function without autonomy in execution is free market theatre. Core units should, and I would argue must, be given a remit to act more autonomously within the domains they were hired to understand. Finally, highly complex domains like structuring credit risk exposures (RWA Cluster) will need an independent review mechanism. Whether assets are funded through traditional off-chain structures or more nimble D3M-like deployments, neither the finance tourist nor the engineering tourist will fully appreciate the nuance in building a sturdy bridge between credit assets and Maker. This independent function should be staffed with highly competent individuals with a demonstrated track record and ownership of MKR. Solution Part 3: Tracking Progress For Clusters to earn their keep, we’ll need a mechanism for feedback and subsequent resource allocation. This will enable the Governors to dynamically allocate resources effectively. I trust that other members of the DAO (e.g. SES, LOVE, StratFI) will be able to craft much more effective feedback mechanisms than I can. My only recommendation would be: rather than assay performance based on vanity metrics (knowledge problem), Maker should create a structure by which core units can evaluate the performance of other core units. Should the Governors regard such evaluations as legitimate, they may adjust the purse strings accordingly. Summary Although I take issue with both the ambit of and sequence by which Endgame came into being, it correctly identifies a few core issues. These include specialization and solving MKR voter truancy. Rather than restructure the foundation of Maker, as Endgame contemplates, I think both of these issues can more immediately and less disruptively be solved by adjusting the decision-making framework. What we are building (the product) may actually be less complex than what this piece suggests. (It is only natural at Maker to over-complicate what should be simple). But we’ve constructed governance such that everyone is thinking about everything all the time. Everything Everywhere All At Once. This chaos can be extinguished via a coherent vision and specialized execution of that vision. Governors align on what a five or ten-year success looks like, perhaps DAI as money. Core units pilot the ship to the promised land. Anticipating the Contra The fact that core units don’t have more autonomy is, I believe, a function of the looming spectre of “centralization” and “gatekeeping”. Community and token holders worry that core units with too much power will somehow bend the protocol towards their own ends. Of course, it is reasonable to be dubious of those with levers. However, given that we rely on MKR appreciation, we are incentivized to build something that is long-term valuable, rather than seize short-term opportunities. I’ve always found it difficult to understand these “gate-keeping” arguments. Why would domain experts who could be paid 2x or more salary elsewhere make decisions that fail to maximize the long-term value of their tokens? Further, When considering if core units evaluating other core units makes sense, please also consider the above logic. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Local_knowledge_problem",
                        "https://en.wikipedia.org/wiki/Mission-type_tactics#:~:text=Mission%2Dtype%20tactics%20(German%3A,specific%20means%20of%20achieving%20it.)",
                        "https://forum.makerdao.com/t/makerdao-long-term-growth-strategy-for-the-future-of-defi/15457",
                        "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2/15456",
                        "https://forum.makerdao.com/t/a-north-star-dai-as-the-destination/14838",
                        "https://forum.makerdao.com/t/relay-semanal-7-13-de-junio-2022/15897",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-09-15-2022/15843",
                        "https://forum.makerdao.com/t/weekly-relay-june-7-13-2022/15818",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-16-22-de-junio-del-2022/16204",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-09-15-de-junio-de-2022/15954",
                        "https://forum.makerdao.com/t/kickoff-governance-from-first-principles-building-a-resilient-decentralized-and-uncensorable-stablecoin/15978"
                    ],
                    "GPT-summary": "The author discusses the complexity of MakerDAO's governance apparatus and proposes a solution to adapt the organization structure to reflect the natural law of specialization. The proposal suggests dividing the decision-making apparatus into two parts, Governors and Clusters, and allowing core units to act more autonomously within their domains. The author argues that this change would enhance decentralization of thought and decision-making and invite large token holders to participate. The proposal also suggests creating a mechanism for feedback and resource allocation to track progress.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.554882108985161
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#2",
                    "likes": "5",
                    "time": "09/06/2022-18:41:56",
                    "content": "This appears consistent with @rune’s  efforts for decentralized voter committees, which intends to create groups of delegates and MKR holders to evaluate specific focus objectives or “strategic decisions” as per your above. His plan also has the benefit of having different groups with unique knowledge specific to each focus objective (i.e. Each governor need not have knowledge of and govern on every topic. Governors with special knowledge can apply their knowledge in the appropriate context by participating in a specific group). This is termed a transactive memory system, whereby specific individuals are responsible for knowledge in specific domains – everybody need not know everything nor evaluate every proposition. It seems the teleological ends for the “cluster” approach above is the MetaDAO, which at its simplest form are wrappers for core units that partition risk away from Maker core and into distinct, specialized silos that have more autonomy, hedge systemic risk, and offer commensurate risk/reward for their participants. Have you considered supporting his initiative as it is already proceeding? These seem like parallel and comparable approaches to solve the same problem. If they are not, could you please highlight where these two models are at odds so MKR holders can consider the pros and cons of each approach? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.718984962406015
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#3",
                    "likes": "4",
                    "time": "10/06/2022-01:12:35",
                    "content": "Whilst @runes endgame plan and @teej’s proposal have similar objectives I think that the differences will be in the ease of implementation. I think what @teej has proposed could be implemented more easily, with less disruption to the ongoing operation of the Dao (obviously subject to agreement of the core units and definition of how these clusters would operate) so if quicker action is required by governance holders this may be a parallel/transitory approach that could be taken whilst experimenting with the MetaDaos. 100% agree that having the clusters revolve around product has a lot of potential upside especially when confronting the challenge of developing new approaches to financing that are highly scalable. As a contributor who has only been at the DAO for only 2 months my primary observation with respect to real world assets, is that the current approach, primarily using MIP21, is not scalable. The main reasons being transparency and the large reliance on manual monitoring of off-chain data. As well as manually having to trigger liquidations. This approach can only continue for so long before, we start having to staff up like a conventional TradFi bank in order to effectively monitor and manage these deals. Ignoring, all the decisions that governance token holders will need to vote on for the custom management of these MIP21s if their growth continues. With a clustered approach we could focus on developing more scalable ways to grow real world assets, whilst enhancing transparency, and ultimately scaling real world collateral for on-chain liquidations using the combined expertise of engineering and finance specialists.  The endgame being a set of custom real world vaults and associated real world asset token standards that would easily facilitate the wholesale funding of assets as well as the development of secondary markets to facilitate liquidations. With respect to @teej’s proposal I think that it would be important to define how the core units would cluster, specifically developing an approach that rationalizes budgeting and other core unit overhead and gets buy-in from each of the core unit teams. Based on my experiences as a core unit contributor to date definitely feel that this idea should be explored further in parallel with @rune s. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.64182745825603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#4",
                    "likes": "3",
                    "time": "10/06/2022-02:55:01",
                    "content": "Great observations and layout. Love a good problem statement.     teej:  make battle decisions, you’d plot the direction of the war.   Agree, more an more it’s clear that on the ground tactics are units in the day-to-day, not delegates. We’re not writing the code or in the calls, so we’re constantly out of context. Context is everything.     dbkcan:  I think what @teej has proposed could be implemented more easily, with less disruption to the ongoing operation of the Dao   TBH I see one leading into the other quite nicely, to your point about running these in parallel. These seem like the first fissures into focused groups for better results DAO -wide.     dbkcan:  the current approach, primarily using MIP21, is not scalable.   agreed.     teej:  Note: I was deliberate in homing in on Real World Assets.   @teej what were the other groupings that made sense here? One thing about Rune’s plan that’s very articulate is the creator, governor, and reformer groupings. I guess I’m echoing the argument for parallel execution.     teej:  mechanism for feedback and subsequent resource allocation.   This just comes down to cadence, clear updates, checks & balances IMHO. You articulate some of them.  The only addition I can see is legwork for the delegates to understand the competitive landscape and adding in a check to help with prioritization. Roadmaps and execution change constantly, especially in this space, so some level of sanity checks would be great to build into current running practices. I mean, loops are in the name  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.016435185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#5",
                    "likes": "4",
                    "time": "14/06/2022-15:23:15",
                    "content": "Outstanding post. several lines stick with me: Maker is functionally a micro-management machine Specialization occurs naturally in free markets because it’s dominant: the knowledge required for solutions is distributed among individuals Governors will make fewer, more directional decisions around hiring, firing, budgeting, and “corporate” actions. I.e. less MKR voting on non-strategic items. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.2333333333333325
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#6",
                    "likes": "4",
                    "time": "15/06/2022-20:25:24",
                    "content": "    teej:  institutions are reluctant to delegate because it signals a lack of sophistication   Can you say more about this @teej? I see it the exact opposite way. Delegation signals an institution is quite on top of things enough to adopt and engage in the mechanism the community has provided for their participation. What I like about your approach here is that it gives a stronger role for the people who are the most knowledgable and talented caretakers of the DAO - the CUs. It’s a federal/state’s rights approach from a U.S. governance perspective that worked for a long time to make the country the powerhouse it became. It’s a good analogy. Dictation and management from Delegates and/or MKR holders is more analogous to the status quo that is not working well to unlock so much potential. I see the Endgame plan as doubling down on hierarchy and Dear Leader-style centralization in all the worst ways. So that’s a key difference from what I read described here @MadShills . My question is how we could implement this approach with a mechanism that supplements that current Recognized Delegate program as per conversation in this thread. Do you suggest Delegates make individual proposals? [Discussion] Delegate Roles and Incentives - #9 by Patrick_J ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.763888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#7",
                    "likes": "4",
                    "time": "20/06/2022-16:18:49",
                    "content": "    ACREinvest:  Can you say more about this @teej? I see it the exact opposite way. Delegation signals an institution is quite on top of things enough to adopt and engage in the mechanism the community has provided for their participation.   I should have rephrased to “Institutions are reluctant to delegate because [they worry that] it [might] signal a lack of sophistication”. I have received this feedback from two different groups of large holders. My guess is part of the pitch to LPs is geared around a unique ability to understand and affect the trajectory of a protocol. I agree with you fully though. It is both more reasonable and probably more effective, thus more accretive, to “underwrite an underwriter” (delegate) rather than parsing through the minutiae of the 5 DeFi protocols in which you hold a stake. In such a case, the subject fund would A) have some rather than no say in the governance of a protocol and B) free up resources to go be effective in other parts of the portfolio. Both results seem to improve fiduciary execution.     ACREinvest:  What I like about your approach here is that it gives a stronger role for the people who are the most knowledgable and talented caretakers of the DAO - the CUs.   A model that does not empower those with local knowledge to solve local problems is always going to be inferior to one that does.     ACREinvest:  My question is how we could implement this approach with a mechanism that supplements that current Recognized Delegate program as per conversation in this thread. Do you suggest Delegates make individual proposals?   A cohesive, multi-year plan for both product and governance is baking. Some of the best people in the DAO (my view) are on it. I recognize that thus far, at least on broad strategic items, I’ve mainly waxed philosophical. Proposing abstract criticism without concrete improvements is of limited value. Stay posted. Broadly, delegates should absolutely make proposals—and I think the providential ones will start doing just that. The composition of active MKR is changing rapidly. Big funds are looking for trustable, competent platforms to get behind, as everyone knows this next stage is critical. For whatever reason, we have perverted the climate such that Governors (delegates) feel it is not their role (presumably not in their best interests) to propose changes to the status quo. I think this is mainly a function of the active MKR breakdown. It’s been mainly Rune. As such, the risk to upsetting Rune and losing delegation outweighs the potential spoils to active value-add. But the big funds are awakening. And with that, the potential upside for vanguard delegates will off-set the risk to losing delegation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.845119047619047
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#8",
                    "likes": "0",
                    "time": "20/06/2022-18:35:50",
                    "content": "    teej:  A cohesive, multi-year plan for both product and governance is baking. Some of the best people in the DAO (my view) are on it. I recognize that thus far, at least on broad strategic items, I’ve mainly waxed philosophical. Proposing abstract criticism without concrete improvements is of limited value. Stay posted. Broadly, delegates should absolutely make proposals—and I think the providential ones will start doing just that. The composition of active MKR is changing rapidly. Big funds are looking for trustable, competent platforms to get behind, as everyone knows this next stage is critical. For whatever reason, we have perverted the climate such that Governors (delegates) feel it is not their role (presumably not in their best interests) to propose changes to the status quo. I think this is mainly a function of the active MKR breakdown. It’s been mainly Rune. As such, the risk to upsetting Rune and losing delegation outweighs the potential spoils to active value-add. But the big funds are awakening. And with that, the potential upside for vanguard delegates will off-set the risk to losing delegation.   Excellent post ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.630291005291005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#9",
                    "likes": "1",
                    "time": "20/06/2022-18:46:36",
                    "content": "    teej:  Some of the best people in the DAO (my view) are on it.   For the sake of transparency for the DAO and for MKR holders, can you please disclose who within the CUs is working on a global governance and product proposal? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#10",
                    "likes": "2",
                    "time": "20/06/2022-19:05:15",
                    "content": "    MakerDAO: Long-term Growth Strategy for the Future of DeFi Governance       Contributors: @adcv @Aes @hexonaut @teej @luca_pro @Nadia @SebVentures  To pick up the threads discussed in Against the Burn, a16z Tokenomics Part 3, Aggressive Growth Strategy and A balance sheet approach to an Aggressive Growth Strategy, we would like to share some views that we have been developing over the past few months. We wanted to share them with the broader community to gather actionable feedback and stimulate a lively discussion - and hijack some of the threads that have popped up suc…     ",
                    "links": [
                        "https://forum.makerdao.com/t/against-the-burn/13412",
                        "https://forum.makerdao.com/t/a16z-makerdao-tokenomics-proposal-three-increasing-financial-resiliency-and-fostering-growth/14138",
                        "https://forum.makerdao.com/t/aggressive-growth-strategy/13958",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.607954545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#11",
                    "likes": "0",
                    "time": "20/06/2022-20:39:32",
                    "content": "I’m imagining a sort of interactive and interdependent body consisting of delegates and voting committees (perhaps “delegate clusters”?). The individual delegates would represent a metaDAO/CU and be expected to have deep knowledge about the inner goings on there – perhaps each metaDAO could hold two or three. Then the delegate clusters would represent the Maker core, and they would have platforms and far reaching aims for Maker as a whole. People only interested in their particular metaDAO could delegate to their own group’s representatives, whereas people who want to engage on a more high concept level could delegate to the core delegate clusters, or to a mix of the two. When voting occurs, these clusters at the core could either vote as normal or push their MKR over to a delegate in the affected metaDAO who typically matches their platform’s goals. Or for votes where the metaDAO’s delegates feel they don’t have enough information, they can push their part of the voting power over to the core, or perhaps directly to a delegate in another mD. This way there can be an intentional, simple root structure where the voting power and key information can move in either direction, generally towards those with the knowledge best suited towards making a good vote decision, while keeping the MKR usage high for each vote. This would contribute to the sovereignty of discrete groups within Maker, while retaining checks and balances amongst themselves as a body. Additionally, this would avoid the current issue where delegates are all expected to know everything about anything related to Maker. With the current delegate system, overstimulation will only get worse as the organization scales and delegates’ knowledge becomes more and more diluted. A structure like this would dramatically increase the scalability of the organization while simultaneously improving the quality of both granular and far-reaching vote decisions. For those who might say that these kinds of voting systems add unnecessary complexity to Maker, I would wonder how the current system doesn’t just consign the already present complexity onto the nervous systems of our delegates. Taking a stab. Thoughts?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.601515151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "5",
                    "time": "21/06/2022-18:19:28",
                    "content": "    teej:  Product: DAI. Implemented through crypto lending, the PSM, the D3M, and RWAs. The protocol is a set of rules that determine under what conditions DAI is issued and burnt.   I believe you left out that Maker Vaults can also be consider a “Product”. Also, DAI as a product definition can be expanded as a peer-to-peer currency for everyday use. By keeping it to PSM, D3M, and RWAs we are limiting its growth potential.     teej:  For whatever reason, we have perverted the climate such that Governors (delegates) feel it is not their role (presumably not in their best interests) to propose changes to the status quo. I think this is mainly a function of the active MKR breakdown. It’s been mainly Rune. As such, the risk to upsetting Rune and losing delegation outweighs the potential spoils to active value-add. But the big funds are awakening. And with that, the potential upside for vanguard delegates will off-set the risk to losing delegation.   Personally, before I became a Recognized Delegate I proposed and tested some of the Wackiest Ideas, such as:  Expansion of DAI into Solana and NEAR Regulatory Compliance initiatives for makerDAO  And many other Delegates here have also issued proposals that have moved forward and/or failed. But yes, I agree–as Recognized Delegates we should take the initiative to create more proposals. I do disagree with your assessment that Recognized Delegates are afraid of upsetting Rune, when in fact the guy hasn’t even been involved until recently. He allowed this DAO to flow freely and allow Core Units, Delegates who wished to align, and MKR token owners who got up from their couches and participated. And even if we thought he would get upset, I doubt any of the Delegates would shy away from voting their view. Delegates aren’t afraid of their delegated MKR being taken away. There’s more to life than MakerDAO. Just like Core Units, Delegates have been given a fair chance to govern this protocol and some of us wanted to support our Core Units vision. And if that view wasn’t good enough, hey at least we tried. And No, I never once ask Rune to tell me how to vote. The guy let us ride it out and I think all in all Recognized Delegates have done a swell job with the limited resources they’ve been given. And even if I wasn’t a Delegate, I would still vote with my own MKR the same way I have voted to date. Believe that. ",
                    "links": [
                        "https://forum.makerdao.com/t/poll-should-we-the-maker-community-assemble-a-compliance-working-group-and-discuss-discover-the-direction-of-the-dao-with-regards-to-worldwide-regulatory-compliance/4531"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.328823953823953
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#13",
                    "likes": "0",
                    "time": "28/06/2022-08:42:18",
                    "content": "Thanks for the post @teej . I’m all for governance minimization in general. How do you envision the implementation of your design over the current on chain pool and executive system? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#14",
                    "likes": "2",
                    "time": "28/06/2022-14:17:24",
                    "content": "    ClausClowes:  This way there can be an intentional, simple root structure where the voting power and key information can move in either direction, generally towards those with the knowledge best suited towards making a good vote decision, while keeping the MKR usage high for each vote.   I like what you are adding to the conversation here. Not sure about the terminology, but conceptually agree:     ClausClowes:  This would contribute to the sovereignty of discrete groups within Maker, while retaining checks and balances amongst themselves as a body. Additionally, this would avoid the current issue where delegates are all expected to know everything about anything related to Maker. With the current delegate system, overstimulation will only get worse as the organization scales and delegates’ knowledge becomes more and more diluted. A structure like this would dramatically increase the scalability of the organization while simultaneously improving the quality of both granular and far-reaching vote decisions.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.72
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#15",
                    "likes": "1",
                    "time": "28/06/2022-20:11:16",
                    "content": "I really appreciate this!  Definitely still trying to get a handle on the organization’s lingo/general defi landscape, so I am especially grateful that you would read into the concepts beyond the misplaced terminology etc. Hopefully will be able to contribute better as I get a better understanding.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.107142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#16",
                    "likes": "1",
                    "time": "28/06/2022-20:32:25",
                    "content": "You are doing great! Thanks so much for your thoughtful engagement. Your terms are not misplaced per se… the landscape is quite undefined. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#17",
                    "likes": "0",
                    "time": "28/09/2022-02:32:26",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}