{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/does-it-make-sense-for-daos-to-turn-some-of-their-digital-assets-into-fiat-money-and-keep-in-a-cefi-bank-account/13769",
            "title": "Does it make sense for DAOs to turn some of their digital assets into fiat money and keep in a CeFi bank account? ",
            "index": 13769,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "banking",
                "e-money"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/jimilaoshi",
                    "index": "#1",
                    "likes": "0",
                    "time": "09/03/2022-12:21:20",
                    "content": "Hi guys, I wanted to hear your take on this topic. Do you think it makes sense for DAOs, or MakerDAO, to transfer some of their digital assets into fiat money and keep the assets partially in a bank account for the DAO? Because I see that DeFi is turning into a wild west, to me its a great opportunity for DAOs to have proof of reserves and benefit from banking solutions. What do you think? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "5",
                    "time": "09/03/2022-13:14:01",
                    "content": "I think doing it directly is quite risky as it adds another risk of potential embezzlement and freezing of the assets by the government or relevant agencies. But on the other hand, for some Core Units, they have bank accounts they use for certain payment and etc. But using it as proof of reserves would be undermining many of the protocol’s current benefits ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.778061224489796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Freakytainment",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/10/2022-03:24:03",
                    "content": "Thoughtful topic @jimilaoshi, I’m agreeing with @Doo_StableLab and I’d like to add some contributions to CeFi risks  Screenshot_20221001-0405361293×623 121 KB  CeFi platforms/bank got many risk when you try investing in them, alot of people really want to, but few take time to investigate the risks of investing in CeFi platforms. CeFi platforms operates just like a normal bank account, Id show a graphic representation to explain how exactly these platforms make their money.  Screenshot_20221001-0326391269×720 77.1 KB  The CeFi banks offers some interest rate to the depositors let’s say for example the interest rate here is 5%, you the depositor deposits Crypto or Fiat into the platform, the platform receives your deposit and it goes ahead and lends into some institutional trading partner who pays a higher rate to the platform maybe 8%, so the platform then pays you 5% and takes 3% for themselves. So at this point alot of people ask why this platform wants to be paying block fire or any of these companies 8% just to borrow money. Well there are alot of reasons but some of these revolve round the popular arbitrage trade that have popped up in Bitcoin market, for example the contango trade. CeFi got a higher yield farming of like up to a thousand percent APY strategy, it’s also managed by an Entity and funds kept there are secured. But although the CeFi has got a high yield gain, there are also some kind of risks that comes with putting your cash in contract like that. You could get rug pulled like the billionaire Mark Cuban.  Screenshot_20221001-0404591265×720 148 KB  Because interest rate are made up of the foundational interest rate or the risk free strategy or the risk premium as the cracking paper points out. And this risk premium in CeFi is basically the default risk that the platform takes when they reallocate your money to someone else, If that entity that they lend the money to looses the money or is unable to pay back, block fire or whatever this CeFi platforms is going to have a hard time giving you the interest that you deserve for that month, or maybe keeping your base deposit in your account, depending on how the losses are, though this risk rate is less than 1%.  Screenshot_20221001-0341451269×720 94.7 KB  Though depends on how much trust you out in institutions If they actually over collateralize everything, the risk goes down. Think the future is something like HodlHodl where lending is managed by a protocol and it can’t go. Though I’m not putting all my money in CeFi anytime soon. But I have some allocation and the interest is great. Not financial advice obviously. You can also compare  [CeFi vs DeFi](https://www.oobit.com › blog › defi… DeFi vs CeFi - The Critical Advantages and Risks | Oobit.com) ",
                    "links": [
                        "http://Oobit.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4734674329501924
                }
            ]
        }
    ]
}