{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govcomms-biweekly-update-mar-14-mar-25/14263",
            "title": "GovComms Biweekly Update: Mar 14 - Mar 25 ",
            "index": 14263,
            "category": [
                "Core Units",
                "Governance Communications"
            ],
            "tags": [
                "com-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "2",
                    "time": "28/03/2022-13:58:15",
                    "content": " GovComms Biweekly Update: Mar 14 - Mar 25 Mar 14 - Mar 25, 2022  Administrative Update  February Actuals Finalized Back on the 14th, we completed the accounting for the month of February and have posted our actuals to github and our tracker. We spent a total of $51,057.67 in February, running over the average monthly forecasted figure of $42,766.66 by $8,291.00, largely due to the ETHDenver team offsite that cost $7,502.93 and payment for legal services, both of which are non-recurring expenses. Total funds received to date: $289,839.47 Actuals incurred through Feb 22: $264,170.22  Budget Proposals in RFC We’ve continued talking to stakeholders about our two budget proposals in RFC; SP62 & SP63. SP62 is the “base proposal”. It includes;  Higher contributor compensation budget. Higher event sponsorship budget. Salary adjustments to account for annual raises. Some housekeeping fixes to include a budget for employer taxes and our legal spend.   869×458 22 KB  SP63 includes one additional larger item, a full-time hire of a Public Relations Project Manager Here’s a short video making a case for the hire:      874×454 22.3 KB   Program Updates The Stakeholder News and Reports Drive folder now contains a Vision, Mission, and Strategy document.  Weekly Relay The Weekly Relays have been published as usual. The Weekly Relay Drive folder now contains an overview of the publication, which includes its mission, OKRs, roadmap, and process documentation.  State of Dai We are considering ways to expand coverage to vault user behavior analysis. If you are interested in contributing to this, reach out to @Artem_Gordon.  Forum at a Glance Forum at a Glance is now published by EOD on Wednesdays instead of Thursday mornings. We’ve been pushing them out as usual.  Monthly Governance Review Will be released on Friday, April 1, 2022.  Monthly Core Unit Updates Expect March’s publication to be released on April 4, 2022.  Metrics New content analytics data such as average reading time, engagement ratio, platform media click-throughs, and optimal posting time have become accessible. This data is now being tracked for all Stakeholder Program Content on Twitter, Reddit, and Medium. For additional information, check out the Media Platform Analytics Process document.  Initiatives Tracking, Reporting, & Stakeholder Alignment Calls A new Resiliency initiative has entered the arena that focuses on improving MakerDAO’s financial and operational resilience, making it more “recession-proof”, working on organizational resiliency milestones in partnership with Recognized Delegates . Check out an overview of the new initiative from the 182nd Governance & Risk Call. The initiative features a focus on:  Longer-term planning (9+ months) Staying on course with contingency add-ons Minimum Viable Operations as a first principle Supporting a budget-neutral scenario Temaining flexible with scaling parameters. Transparency & accountability Role of delegates Governance evaluation & feedback tools  Join the #resilience-stakeholder-alignment channel on Discord. Progress continues to be made on the CMON, CMOFF, and SEC initiatives. Meanwhile, PE-001 continues to successfully employ the framework for the L2 initiative. In the coming weeks, we will be handing off CMOFF facilitation to @Retro who has been preparing to take on the role. Similarly, CMON will be handed off to @thomas.flitter, who has also been preparing to take on the role.  Public Calendars No major updates here. Calls Votes & Important Dates  Stakeholder Database We are continuing to work with TechGDPR to bring this project into a state of GDPR compliance. They recently completed their Assessment Report providing us with a list of 27 recommended actions to bring us up to code over the course of the next 3 quarters.  Issue Discussion Calls @thomasf is planning our next issue discussion call for March 30th, covering the Budget Update process. Check out the forum thread for more information.  Emergency Playbook After receiving some key feedback from mandated actors we have shifted our approach regarding incident role assignments. Instead of having assignments, roles will be assigned as needed in the event of an incident. There is so much variability in the type of incident that assigning static roles to people is an inefficient tactic. Instead, whoever is available must determine who is the best person to stand in as the immediate Incident Manager who can then assign roles as needed. In partnership with Immunifi Security Core Unit, we’ve begun working on an Emergency Playbook workshop that teaches members of MakerDAO the various incident roles and procedures to follow in the event of an incident.  Press Relations Support We are continuing to advocate for a Press Release program as our SP63 budget proposal remains in RFC. Assuming our mandate renewal and budget proposal passes in April, we will be clear to start hiring for a full-time Public Relations PM in May 2022. In the meantime, we are continuing to provide the same level of basic service.  Communication Platform Stewardship No major updates from the last two weeks.  Published 03/11/22 - 03/25/22  Weekly Relay Weekly Relay: March 15 - 21, 2022: English | Spanish Weekly Relay: March 8 - 14, 2022: English | Spanish  State of Dai March 15 - 21, 2022 March 8 - 14, 2022  Forum at a Glance March 17 - 23, 2022 March 10 - 16, 2022  Transparency Govcomms.MakerDAO.Network Notion Page Finances Public Google Drive Governance Communications Happiness Feedback Survey ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1H41VHDwZDlF9CSAlbR-u5NBUhp1qwTcaSGNkYB5C5bI/edit?usp=sharing",
                        "https://forum.makerdao.com/t/mip40c3-sp62-modify-core-unit-budget-com-001/13724",
                        "https://forum.makerdao.com/t/mip40c3-sp63-modify-core-unit-budget-com-001/13654",
                        "https://www.youtube.com/watch?v=nCHMuAC58g0",
                        "https://drive.google.com/file/d/1CzIU2Wj5qLBbanqj0FUON3p-CsWZDwxb/view?usp=sharing",
                        "https://drive.google.com/file/d/15rjbXnyhIWzcTsQ3gneVqfYY6X7KvbMx/view?usp=sharing",
                        "https://docs.google.com/document/d/1fX1iqRoKospqQxToHpPvSfIJX6MLqWTN4MLTLBTeynI/edit?usp=sharing",
                        "https://youtu.be/cMLUkPq7RNo?t=2953",
                        "https://discord.gg/7MkxHWtu",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/u/0?cid=YmRmNHVuMDVocGcwNjExbGczaWV1ZTR0M2NAZ3JvdXAuY2FsZW5kYXIuZ29vZ2xlLmNvbQ",
                        "https://forum.makerdao.com/t/issue-discussion-call-5-budget-modification-process/14226",
                        "https://forum.makerdao.com/t/weekly-relay-march-15-21-2022/14119",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-marzo-de-2022/14181",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
                        "https://forum.makerdao.com/t/state-of-dai-march-15-21-2022/14120/2",
                        "https://forum.makerdao.com/t/state-of-dai-march-8-14-2022/13916",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-17-23-2022/14191",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-10-16-2022/13977",
                        "https://www.notion.so/Governance-Communications-Core-Unit-e59d5cfcd2464498b98c9584f8cea7e2",
                        "https://docs.google.com/spreadsheets/d/1H41VHDwZDlF9CSAlbR-u5NBUhp1qwTcaSGNkYB5C5bI/edit?usp=sharing",
                        "https://drive.google.com/drive/folders/1GBAeTx4jmob7wRs7_LK32Bh_Y-pHzPvV?usp=sharing",
                        "https://forms.gle/yNZDcTCeRk3vwjNGA",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.499690082644628
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/03/2022-21:35:40",
                    "content": "What is Papaya used for again? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "1",
                    "time": "29/03/2022-01:25:31",
                    "content": "Papaya is a Professional Employer Organization. Basically global payroll/taxes/etc. Enables us to hire non-US folks.    Papaya Global    Papaya Global - People. Payroll. Payments Papaya integrates your entire global workforce and payroll management onto a single global platform connecting you to a network of verified local vendors      ",
                    "links": [
                        "https://papayaglobal.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.015873015873016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#4",
                    "likes": "2",
                    "time": "01/04/2022-23:08:03",
                    "content": "    Davidutro:  Monthly Core Unit Updates Expect March’s publication to be released on April 4, 2022.   Update: Because there are likely to be quarterly updates posted along with regular updates, I decided it is best to reschedule the Monthly Core Unit Update Review to Monday, April 11 instead of April 4. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "30/06/2022-23:08:15",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-14-feb-25/13462",
            "title": "GovComms Biweekly Update: Feb 14 - Feb 25 ",
            "index": 13462,
            "category": [
                "Core Units",
                "Governance Communications"
            ],
            "tags": [
                "com-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "4",
                    "time": "25/02/2022-21:48:55",
                    "content": " # GovComms Biweekly Update: Feb 14 - Feb 25 Feb 14 - Feb 25, 2022  Administrative Update  Budget Expansion A budget modification proposal will be coming from us at some time next week. Expect:  Increase in part-time Contributor funding needs by nearly 2x. Increase in full-time compensation needs, forecasting a potential new hire in Q3-Q4 and raises to existing employee salaries. Other house-keeping modifications, outlined in column AG of our public budget sheet’s Monthly Budget View.    MakerDAO.World acquisition We have sent payment to Gold Media and are waiting on the transfer of the makerdao.world domain.  ETHDenver Our team was there from February 16th - 20th.  The entire team met together for the first time. All three of us attended ETHDenver. We had a team breakfast every morning to recap the previous day and discuss various matters, including our team’s vision and objectives for the coming year. David, GovComms Facilitator, organized and participated in the Mandated Actor & Recognised Delegate dinner. All three of us attended the Daivinity Maker Event. David and Thomas attended the Winterproof RWF panel. We individually attended various other side events. We documented individual goals in our trip overview document.    COM-001 Feedback Survey Our team set up a Governance Communications Happiness Feedback Survey with the objective to encourage feedback on stakeholder experience with our team’s communication, relevance, timeliness, transparency, collaboration, inclusiveness, and integrity as a Core Unit.  Program Updates  Weekly Relay We onboarded a new contributor to help us with production. Welcome @nothsa!  State of Dai We are considering ways to expand coverage to vault user behavior analysis. If you are interested in contributing to this, reach out to @Artem_Gordon.  Forum at a Glance Forum at a Glance now contains greater detail for the descriptions of each post. Please give us feedback on the reader experience by reaching out to @Artem_Gordon!  Monthly & Annual Governance Review Planned for release on Friday, March 4th, 2022  Monthly Core Unit Updates Planned for release next Monday, March 7th, 2022  Initiatives Tracking, Reporting, & Stakeholder Alignment Calls Progress continues with the active initiatives in this program. We took a break from Stakeholder Alignment calls last week due to ETHDenver.  Public Calendars No major updates here. Calls Votes & Important Dates  Stakeholder Database We are continuing to work with TechGDPR to bring this project into a state of GDPR compliance.  Issue Discussion Calls @thomas.flitter is planning our next issue discussion call for March 16th. A topic will be chosen in the coming week.  Emergency Playbook We’ve created a draft Incident Role Assignments Tracker, which we will soon open for Core Unit facilitators to populate after final feedback and edits.  Press Relations Support After speaking to several people on the topic this week, we will be moving forward with expanding our scope in this program. Assuming our mandate renewal and upcoming budget modification passes in April, we will be clear to start hiring for a full-time Public Relations PM in May 2022.  Communication Platform Stewardship We are looking for an additional Reddit mod & Artem made some improvements to the program’s strategy and documentation.  Published 02/14/22 - 2/25/22  Weekly Relay Weekly Relay: February 8 - 14, 2022: English | Spanish Weekly Relay: February 15 - 21, 2022: English | Spanish  State of Dai State of Dai: February 8 - 14, 2022 State of Dai: February 15 - 21, 2022  Forum at a Glance February 10 - February 17, 2022 February 17 - 24, 2022  Transparency Govcomms.MakerDAO.Network Notion Page Finances Public Google Drive ",
                    "links": [
                        "https://docs.google.com/document/d/1kzEpixXfwwVbSZnHJZFujnrNeJLwIDSP6G2RY3gYzjo/edit?usp=sharing",
                        "https://forms.gle/yNZDcTCeRk3vwjNGA",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/u/0?cid=YmRmNHVuMDVocGcwNjExbGczaWV1ZTR0M2NAZ3JvdXAuY2FsZW5kYXIuZ29vZ2xlLmNvbQ",
                        "https://forum.makerdao.com/t/weekly-relay-february-8-14-2022/13239",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-febrero-de-2022/13294",
                        "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
                        "https://forum.makerdao.com/t/state-of-dai-february-8-14-2022/13240",
                        "https://forum.makerdao.com/t/state-of-dai-february-15-21-2022/13349",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-10-17-2022/13292",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-17-24-2022/13425",
                        "https://www.notion.so/Governance-Communications-Core-Unit-e59d5cfcd2464498b98c9584f8cea7e2",
                        "https://docs.google.com/spreadsheets/d/1H41VHDwZDlF9CSAlbR-u5NBUhp1qwTcaSGNkYB5C5bI/edit?usp=sharing",
                        "https://drive.google.com/drive/folders/1GBAeTx4jmob7wRs7_LK32Bh_Y-pHzPvV?usp=sharing",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-february-2022/13726"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3989346590909095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "26/05/2022-21:49:16",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "739"
}