{
    "poll_list": [
        {
            "title": "Stability Fee Adjustment Proposal - November 2, 2020",
            "index": "4877",
            "option": "Yes",
            "supporting_mkr": "28,542",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rates-changes-proposal-20-oct-2020/4813",
            "title": "Rates Changes Proposal 20 Oct 2020 ",
            "index": 4813,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "14",
                    "time": "20/10/2020-20:02:21",
                    "content": "Authors: @Primoz, @LongForWisdom , @Hexonaut, @Monet-supply, @SebVentures, @Akiva Screenshot 2020-10-20 at 21.53.051276×830 54.7 KB Source: Risk Premiums & Competitive Rates 20 Oct 2020 Table Notes:  Competitive rates are based on lowest stablecoin borrow rates on each lending venue for particular collateral, except when stablecoins are used as collateral (in such case only DAI borrow rate is compared) Negative competitive rates are mostly due to liquidity mining rewards at Compound and due to rates and rewards accrued on deposited collateral Risk premiums are currently based on proposed RP from collateral onboarding applications and adjustments made by governance. Lending products between secondary lenders and MakerDAO are not standardized and therefore rates can not be strictly compared. Please see a detailed spreadsheet in the link above where differences among lenders are addressed. Note that MakerDAO is better suited for larger vault owners who may wish to borrow larger amounts and won’t affect the rate (as they do at secondary lenders). On the other hand Maker charges highest liquidation penalty fees and requires more collateral on average to be posted when borrowing.  Overview We currently don’t foresee any rate changes for MakerDAO Vault types apart from potential changes for stablecoin Vaults proposed by governance, which will be voted in this Signal. Market rates on USD borrowing in crypto space seem to be currently slightly trending downwards due to a cooldown of a bull cycle and liquidity mining craze we witnessed during this summer (see futures basis in the spreadsheet). As seen in the table above, most of the MakerDAO rates are already slightly above competition and between 4% and 6% higher for ETH and WBTC compared to Compound being most competitive. On the other hand a small rate decrease can be justified only for ETH if risk compensation is still met. In the current environment we don’t foresee any rate changes needed and we will continue to monitor developments further, specifically related to borrowing demand that was put on hold due to liquidity mining cooldown. Largest Vault Types Outlook ETH-A: Since late September when rates were increased from 0 to 2%, DAI minted from ETH-A decreased for about 13m DAI or 3.7%. It is hard to judge whether this relatively small decrease in percentage terms was a consequence of a higher fee charged, particularly since other lending venues also haven’t been experiencing growth in stablecoin borrowing in the last month. It is quite possible that lower farming APYs and a significant price drawdown in DeFi assets put leverage seekers on hold a bit. This is also supported by the evidence that at least ⅓ of ETH-A Vault Types hold borrowed DAI for liquidity mining purposes. Note also that ETH-B with 130% LR and 6% SF was just enabled which might give us some feedback about sensitivity on higher rates with a LR set similarly as at Compound. WBTC-A: Since the last rate increase from 2% to 4% in late September DAI debt from WBTC fell a bit more significantly by 8m or by about 9%. The spread versus Compound is almost 6% and during this time Compound increased its Loan to Collateral factor from 40% to 60%. Quite possibly the 4% rate by MakerDAO is on the upper limit before larger refinancing might be witnessed. Other Considerations As noted, please vote on potential changes implemented to stablecoin SF due to different strategies outlined in the post and pros and cons associated with them. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-stablecoin-action-plan/4808",
                        "https://forum.makerdao.com/t/farming-activity-of-vault-users/4781/2",
                        "https://forum.makerdao.com/t/signal-request-stablecoin-action-plan/4808",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-115-thursday-october-22-16-00-utc/4757/2",
                        "https://forum.makerdao.com/t/week-21-dai-distributions-sourcecred-funding-mip13c3-sp6/4883",
                        "https://forum.makerdao.com/t/rates-changes-proposal-26-oct-2020/4877/8"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.060344827586207
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/01/2021-02:02:25",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/rates-changes-proposal-26-oct-2020/4877",
            "title": "Rates Changes Proposal 26 Oct 2020 ",
            "index": 4877,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "11",
                    "time": "26/10/2020-20:57:12",
                    "content": "Authors: @Primoz, @LongForWisdom , @Hexonaut, @Monet-supply, @SebVentures, @Akiva Screenshot 2020-10-26 at 21.53.431272×876 100 KB Source: Risk Premiums & Competitive Rates 26 Oct 2020 Table Notes:  ETH-B Risk Premium at this level of unutilized debt ceiling is likely higher due to OSM risks. The goal of proposed reduction of ETH-B SF is to attract more demand and increase debt ceiling utilization.  Overview ETH-B Vault type has been live for about a week but we haven’t seen much of DAI minting (current DAI debt from ETH-B is at 263.000 DAI). The reason behind originally proposed 20m Debt Ceiling and 6% Stability Fee on ETH-B was to meet potentially large demand coming from current ETH-A Vault users who are involved in liquidity mining. Due to lower collateralization requirements on ETH-B they would be able to boost their yields by performing migration and Maker would have been able to earn additional fees. It may be too early to tell whether the low usage is related to the fact that this vault type is in existence only for about a week. But since liquidity mining yields fell heavily in the past few weeks, the current 4% rate difference between ETH-B and ETH-A possibly doesn’t provide enough incentive for users to perform migration to ETH-B. Furthermore, the difference between Compound stablecoin borrow rate on ETH and ETH-B at current level is more than 5%. We are proposing a decrease of ETH-B SF to 4% from current 6% in order to attract more demand. There is also pending Signal vote for changes going forward regarding stable coin fees. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-stablecoin-action-plan/4808",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/3",
                        "https://forum.makerdao.com/t/signal-request-debt-ceiling-adjustments-29th-oct-2020/4931",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-116-thursday-october-29-16-00-utc/4835/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-19/4975",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-19-en-espanol/4981",
                        "https://forum.makerdao.com/t/week-22-dai-distributions-sourcecred-funding-mip13c3-sp6/4988"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.442080241187384
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/10/2020-00:12:16",
                    "content": "Interesting to see the spreadsheet with competitive rates.  The Dai borrow rate on Compound is 3.94% today - it looks like you have it listed at 0.85%? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#3",
                    "likes": "2",
                    "time": "27/10/2020-05:15:41",
                    "content": "@latetot The COMP distribution is also factored in. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#4",
                    "likes": "2",
                    "time": "27/10/2020-05:45:40",
                    "content": "Excellent comparison this - thanks! I have two questions:  The Best Competitive Rate is that a snapshot or something measured over a certain period? Is it in practical terms relevant to include competitors that offer negative rates just to build traction? These offers tend to go away fairly quickly?  I really like what you are doing here - please keep this up! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#5",
                    "likes": "3",
                    "time": "27/10/2020-08:03:33",
                    "content": "Thanks @Planet_X To answer you questions:  Yes, competitive rates are based on current snapshot. But yes, ideally we should be using 7d or 30d rolling average for all of them once we start storing data series. Centralized lenders have rates fixed though. I agree but Compound has been offering negative rates since it started liquidity mining 4 months ago.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#6",
                    "likes": "0",
                    "time": "27/10/2020-13:34:33",
                    "content": "Why there’s no suggestion to lower the DC on unused vaults - some of them have > 75M free space? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "0",
                    "time": "27/10/2020-14:10:03",
                    "content": "The LR on ETH-B is quite low and ETH is volatile so there is more of a risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "2",
                    "time": "02/11/2020-15:16:54",
                    "content": "The Rates Working Group has no changes to propose for this week other than the ETH-B and Stablecoin Action Plan votes already to governance votes today. Going forward the Rates Working Group will not be making posts on a weekly basis unless something changes. We will still be producing the monthly reports at the beginning of every month with the exception of this one because a detailed report was made recently. ",
                    "links": [
                        "https://forum.makerdao.com/t/rates-changes-proposal-20-oct-2020/4813",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-a-debt-ceiling/5315/7"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "01/02/2021-21:16:55",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2860"
}