{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/clarity-on-adding-rwa-001-6s-capital-as-collateral-type-poll-vote/5429",
            "title": "Clarity on Adding RWA-001 (6s Capital) as collateral type - Poll Vote ",
            "index": 5429,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "real-world-finance",
                "sixs",
                "rwa-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "15",
                    "time": "01/12/2020-17:27:52",
                    "content": "In a desire to mitigate any confusion on the point, currently there is a poll outstanding to administratively onboard RWA-001 (6s Capital) as a collateral structure to the Maker protocol. Given the nature of how Real World Assets are being collateralized by 6s Capital, this vote is NOT to approve the actual debt ceiling; rather, this is the adminsitrative process approval to allow things to move forward. Unlike all other previous collateral onboarded, the 6s Real World Asset implementation has legal infrastructure that needs to be deployed first. For complete clarity and as an MKR token holder myself, I am not asking for, nor would I expect or desire to have a debt ceiling until such time as I have demonstrated that I have caused the implementation of the legal structures outlined in the Declaration of Intent. As @cmooney has put on the schedule, this is scheduled for a technical implementation December 18 2020. Unless I can provide the community time to review the book of legal documents related to the legal implementation, the the debt ceiling that would be implemented for that executive vote SHOULD be for a value of ZERO. Only AFTER the community has seen the structure is in place should the debt ceiling be raised. I do not want a debt ceiling until it is safe for MKR holders. Period. My understanding of the sequence.  Administratively onboarding Techncial onboarding Debt ceiling increase (only after 1 & 2)  It is possible that all of the documentation is ready before the 18th and if I can compress 3 into 2, then so be it. However, we should bifurcate the onboarding from the actual raising of the debt ceiling to a non-zero amount. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914",
                        "https://forum.makerdao.com/t/weekly-sourcecred-distribution-payout-increase/5546"
                    ],
                    "GPT-summary": "The author of the post is explaining the purpose of a poll to onboard RWA-001 (6s Capital) as a collateral structure to the Maker protocol. The author clarifies that the vote is not to approve the actual debt ceiling, but rather to approve the administrative process to allow things to move forward. The author also explains that the legal infrastructure needs to be deployed first before the debt ceiling can be raised. A 3rd party may have questions about the proposal and may provide constructive criticism.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.558712121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/12/2020-18:20:16",
                    "content": "Thanks @mrabino1 that really clears up some confusion I was having. One question I still have however is what if the community and 6s Capital can’t reach an agreement on a debt ceiling that suits both parties? Will there be any losses on the Maker side if after approving going forward with this proposal we hit a future impasse that stops the project? Thanks again for all the time and effort helping us newer members understand what we are being polled on! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "3",
                    "time": "01/12/2020-19:19:05",
                    "content": "    prose11:  One question I still have however is what if the community and 6s Capital can’t reach an agreement on a debt ceiling that suits both parties? Will there be any losses on the Maker side if after approving going forward with this proposal we hit a future impasse that stops the project?   Good question. A few angles to comment on this. First, 6s is in this for the long-haul. The debt ceiling will come when LendCo can perform and the community is more comfortable with the associated risks. The reason why this proposal has so much legal infrastructure is explicitly to plan ahead to answer risk concerns way before they are here. “What happens if we cannot find something works?” Well, I prefer to focus on how we can build together (as the alternative painfully would be to only work at a reduced level). “Will there be losses on the Maker side?” If after some period of time, MakerDAO decides it no longer wants exposure to the credit quality and the loans that LendCo is providing, it need only to reduce the debt ceiling to zero. In doing so, this act will inhibit any future loans from being funded. Further it causes all future outstanding loans that are repaid to be returned to MakerDAO. In summary, this action would close LendCo’s loan book by attrition.  Alternatively with the nuclear option of liquidation, should the community trigger a liquidation instead of an orderly wind down, the Trustee step-in and sells the assets of LendCo. LendCo’s equity investors get “hit” first, but it is possible there are losses to MakerDAO as assets would be sold to willing buyers and would be net of any administrative fees the Trustee would charge.     prose11:  Thanks again for all the time and effort helping us newer members understand what we are being polled on!   Happy to ! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.770531400966183
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/12/2020-20:15:09",
                    "content": "Thanks for the clarification, Do you think at some point we will have a better integration between maker and the token assert? As I current see it, the main issue is in the truste. For me, the main point of blockchain is to remove the third party that “keep the contract” between two parties. Aka the truste. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "2",
                    "time": "02/12/2020-08:15:48",
                    "content": "    alexis:  For me, the main point of blockchain is to remove the third party that “keep the contract” between two parties.   That’s exactly, the main pain point we have currently as the smart contract is unable to keep the contract. My feeling is that we will do more off-chain deals (using a trust structure) before it moves on-chain. To be on-chain, we need a structured and liquid market. And let’s suppose a corporate bonds ETF is tokenized tomorrow with a liquid marquet (and no KYC). For instance NEAR to stay short duration (18 months average maturity). The yield is 0.77%. And there will be the market valuation to deal with (drawdown of 5% in March). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.311507936507937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#6",
                    "likes": "1",
                    "time": "02/12/2020-10:00:37",
                    "content": "Gotcha, Basically a liquid market is the main problem. With out liquid market, it actually doesn’t really matter in terms of risk if it is on or off chain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#7",
                    "likes": "4",
                    "time": "02/12/2020-12:26:46",
                    "content": "    alexis:  For me, the main point of blockchain is to remove the third party that “keep the contract” between two parties. Aka the truste.   The heart of why a Trustee is needed in this construct is painfully simple. The technology is moving lightyears ahead of the law. At present (and for the foreseeable future), a smart contract does not have standing in a Court of Law. That is to say, a smart contract (or its output) cannot be used (presently) to enforce a contract (e.g. it cannot cause or defend litigation). Guaranteed that jurisdictions will test implementations on smart contract legal standing enforcement within a set alpha protocol (e.g. like an enforceability standard to which a smart contract would have to interface to have standing). Those discussions are already starting within legal circles but still far away from laws being implemented or standards finalized (as this is new territory for them). Summary: The use of the Trustee today is paramount to ensuring enforceability from a regulated third-party. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.518804112554112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "03/03/2021-18:26:49",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}