{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/provision-clause-1-year-for-cu-certainty/16664",
            "title": "Provision Clause (1 year) for CU Certainty ",
            "index": 16664,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "budget",
                "core-unit",
                "core-unit-budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#1",
                    "likes": "0",
                    "time": "15/07/2022-13:20:27",
                    "content": "It sets a dangerous precident to have the DAO restricting future versions of itself. Delegates change and you end up with restriction made by the choices of their predecessors. I don’t think this proposal is bad in itself, but it will lead others to add similar provisions to their proposals and that can seriously impact the DAO. ",
                    "links": [],
                    "GPT-summary": "The post provides constructive criticism of a proposal regarding a provision clause for CU Certainty. The author expresses concern about the DAO restricting future versions of itself and the potential impact of similar provisions on the DAO. The post also explains the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.3666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#2",
                    "likes": "0",
                    "time": "16/07/2022-14:45:56",
                    "content": "Core Units need certainty to do effective organisation planning. I can’t hire people and spend time training them knowing I may have to fire them in 2-3 months. From the DAO/delegate side, it seems there is a desire to cut budgets but not necessarily the contextual knowledge to identify where those cuts should be made. This clause incentives CUs to proactively cut their budget and leads to determinism for CU planning. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/07/2022-17:35:53",
                    "content": "I agree that certainty is valuable, but that also needs to come with a more structured budget system. It shouldn’t come from ad hoc provisions in budgets that restrict the options of future delegates. This provision also indirectly hurts every CU that doesn’t include the same. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                }
            ]
        }
    ]
}