{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/focus-on-02-focus-on-new-silver/8817",
            "title": "Focus On #02: Focus On New Silver ",
            "index": 8817,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "new-silver",
                "public-call",
                "rwa",
                "pubcall-:-focus-on"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#1",
                    "likes": "7",
                    "time": "17/06/2021-08:37:11",
                    "content": "[image by @blimpa pending]  Focus On #02: Focus On New Silver Focus On is yet another a new MakerDAO original series, where we talk with Core Units about their progress and deep dive into the details. @SebVentures will be joining us again alongside @prankstr25 to discuss:  New Silver’s latest update All the specifics that you want to know about the deal Any other questions you might have!   When Time in your local-timezone format: 2021-06-18T15:00:00Z  Where When the time is ripe, follow this Zoom link  Or use this information:  Meeting ID: 829 4277 3725 Passcode: COREUNIT Find your local number: Zoom International Dial-in Numbers - Zoom  attn: @flipflopflapdelegate, @_LS, @williamr, @g_dip, @mrabino1, @ejbarraza, @ultraschuppi, @prose11, @PaperImperium, @omahalawyer, @spin, @Tosh9.0, @LongForWisdom, @alexis, @swakya ",
                    "links": [
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/37",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-146-thursday-june-17-17-00-utc/8785/4",
                        "https://forum.makerdao.com/t/signal-request-increase-debt-ceiling-of-rwa-02-ns-drop-from-5m-to-20m/9077",
                        "https://forum.makerdao.com/t/post-mortem-new-silver-executive-summary-change/8911",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-146-thursday-june-17-17-00-utc/8785/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.626578282828283
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/06/2021-14:04:52",
                    "content": "Thanks.  I may only be able to listen and not participate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/06/2021-14:17:49",
                    "content": "What he said. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/roollie",
                    "index": "#4",
                    "likes": "0",
                    "time": "17/06/2021-18:52:26",
                    "content": "Me three!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#6",
                    "likes": "3",
                    "time": "18/06/2021-17:17:29",
                    "content": "    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#7",
                    "likes": "4",
                    "time": "22/06/2021-18:40:33",
                    "content": "Hello DAO Community, Firstly, I wanted to thank those that were able to make it to to the Focus on New Silver call last week. Our team is 100% committed to making RWA and New Silver a successful partnership with the DAO. We have spent the last 2 years working with Centrifuge and the DAO to bring our asset class to the community, and we are deeply vested and aligned with everyone to make this a successful long term collaboration. This is a new process for us and we are all learning and improving, so we hear the feedback and appreciate it. I wanted to follow up on some of the requests for further clarity on the key metrics the fix and flip industry uses for underwriting loans:   ARV - after rehab value, measures the loan to the value of the property after renovation. This value is provided by the independent licensed appraiser after they review the comparable property sales.   LTV - loan to value, measures, in percent, the purchase loan to the as-is property value. The as-is value is provided by the independent licensed appraiser after they review the comparable property sales.   LTC - total loan to total cost, measures, in percent, the loan to project cost. Computed by taking the purchase loan plus the construction loan divided by purchase price plus construction cost.   For example, a repeat borrower with top-level experience and excellent credit applies for a new loan with New Silver requesting a max loan amount to buy a property for $190,000 and do $50,000 worth of rehab work. We send an independent, licensed appraiser to evaluate the property and they complete a full appraisal report. In this example, the as-is value comes in at $200,000 and the after-rehab value (ARV) is $300,000, purchase price is $190,000 and rehab budget is $50,000. Here is how we would underwrite this loan: Since the purchase price is less than the as-is appraised value, we would use the purchase price of $190,000 in the cost basis determination (to note, we would always use the lower value of either the as-is value or the purchase price, so inflating values would be difficult) plus the rehab budget total of $50,000 to compute the loan to cost ratio (LTC) so 190,000+50,000=240,000*0.9 =$216,000. The maximum loan amount based on 90% LTC is $216,000. We would typically include 100% of the rehab budget in the loan to make sure we control the funds required to complete the project, and the balance of the loan would be for the upfront amount, so the loan structure would look like this: Total Loan $216,000 ($166,000 purchase + $50,000 rehab reserves) Now we check to make sure the total loan amount is within the maximum ARV threshold of 80%. We use the appraised ARV of $300,000 * 0.8, so the maximum total upper loan limit would be $240,000. Since this is higher than the max LTC based amount of $216,000, the loan would be the lower number and the final loan structure would be $216,000 ($166,000 purchase + $50,000 rehab reserves). In this example the LTC is 90%, the ARV is 72% and the LTV is 83%. For the rehab reserves, we pay out only after work has been completed by the borrower and inspected by an independent inspector. Inspector sends a report with pictures and percentage of the budget completed, we pay out based on that. We take into account other data, such as average days on market, average prices in the zip, census, and more. We also look at the entire project’s feasibility to make sure it makes sense, so any of these leverages may be lowered or loan not issued at all if we determine the project is not feasible. We are also working on, and will be announcing a number of changes to improve the specifics concerns brought up in various conversations. Hope this post provides some clarity on the underwriting process, happy to answer questions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6554576376004935
                }
            ]
        }
    ]
}