{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/minting-new-dai-to-offset-lost-dai/6396",
            "title": "Minting New DAI to Offset Lost DAI ",
            "index": 6396,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "dai",
                "minting"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/jeycryptz11",
                    "index": "#1",
                    "likes": "7",
                    "time": "06/02/2021-00:07:08",
                    "content": "After chatting with dev and coming to understand that I permanently lost $10,064 DAI by accidentally sending it to a “sweep” address that catches all TUSD  transactions for Trust Token in the TUSD redemption process, I was encouraged to post here in the forum for future decisions of the DAO that may consider minting  new DAI to retrieve lost DAI, which will prevent the USD peg from breaking someday as more DAI gets lost in similar ways. I have used the Oasis app many times ND am not a newbie however  brief slip of the mind with what I was doing caused me to lose a significant amount of money. If I may post here to request this decision be brought forward and also as a record of my lost DAI of the following tx hash: 0xd1f114e36866048f257587e95e3ae6498a67a1ec6be7a4d0e894b6ad212a8928 I appreciate the consideration and it would mean a lot to me to gain access to these lost funds while attempting to utilize the DeFi ecosystem in its early years. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-128-thursday-february-11-17-00-utc/6367/2",
                        "https://forum.makerdao.com/t/governance-at-a-glance-feb-5-11-2021/6507",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-feb-7th-2021/6469",
                        "https://forum.makerdao.com/t/prioritization-framework-sentiment-polling/15554"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.649431818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "3",
                    "time": "06/02/2021-00:18:23",
                    "content": "Thanks for posting, and sorry that this happened to you.     jeycryptz11:  I was encouraged to post here in the forum for future decisions of the DAO that may consider minting new DAI to retrieve lost DAI, which will prevent the USD peg from breaking someday as more DAI gets lost in similar ways.   This is a very good point, as DAI gradually gets lost in unrecoverable addresses, it could cause issues for DAI’s peg stability. One consideration is that Maker would need to verify that the DAI in question is provably/permanently unrecoverable, and then organize an executive vote that mints new DAI to the party that lost funds and adjusts internal system accounting to correct for this. I imagine the costs involved would be significant, but maybe could be lower in percent terms if recovery operations were carried out on a periodic basis in batches. Costs should be deducted from the recovered amounts before distributing to impacted users on a pro rata basis. This would probably require a MIP to implement. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.878863636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "4",
                    "time": "06/02/2021-09:46:34",
                    "content": "With the PSM and balance sheet manipulations, this is no longer an issue for the peg. Each DAI lost is a perpetual loan with 0% interest rate for Maker. We really need a Customer Services Core Unit. The ability to recover DAI from mistakes would be a great thing for DAI usability (and DAI demand). We can use the surplus buffer and/or the mandated actor multisig to start with. In your specific case, I’m not sure it will help as it’s difficult to be sure that those DAI are really lost. ",
                    "links": [
                        "https://forum.makerdao.com/t/core-units-i-wish-existed/6248/14"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#4",
                    "likes": "5",
                    "time": "06/02/2021-14:28:51",
                    "content": "    jeycryptz11:  0xd1f114e36866048f257587e95e3ae6498a67a1ec6be7a4d0e894b6ad212a8928   @monet-supply In this transaction we can see that the DAI was sent to one of the TUSD deposit addresses 0x00000000000000000000000000000000000011ea.  These addresses are handled in the TUSD ERC20 by being swept to a single address.  This allows them to link deposits to users, while saving on gas.  In general, we absolutely must prove DAI is lost forever if we’re going to mint replacement DAI.  In this case, we can know with near certainty that this DAI is lost forever as the Trust Token team doesn’t have private key access to these deposit addresses. @SebVentures I want to caution against thinking about the PSM as a magic bullet for the peg.  It very much is, but given changing regulatory climates, we cannot always count on this mechanism.  That is, if tomorrow all the USD stablecoin IOU collateral were blacklisted, we would need to fall back on the old peg balancing mechanism of supply, demand, and arbitrage.  I believe we should still reason as though the PSM doesn’t exist, which would make lost DAI or too much DAI hoarded in the surplus buffer a threat to the peg.  The bonus is that we ingest less stablecoins when reasoning this way, and thus less custodial risk. On the topic of lost DAI, I think we can have a special collateral type for LostDAI that mints 1:1 with DAI much like SAI; however, SAI redeemed at shutdown would still have value.  This new collateral wouldn’t, as it’s really just an accounting trick to represent LostDAI.  This is like the Rai stone the Yap workers dropped in the ocean.  The village decided that still had value:    NPR.org    The Island Of Stone Money On the island of Yap, people used giant stone coins that weighed thousands of pounds. The island's story helps answer a fundamental economic question: What is money?      Our village may decide this DAI still has value, but I would have to think of how we solve this value problem at ES.  It would also be considerably more efficient if we could make a merkle tree redemption contract than give each user a vat DAI balance. But, periodically, I’m in favor of solving this problem for DAI users. ",
                    "links": [
                        "https://www.npr.org/sections/money/2011/02/15/131934618/the-island-of-stone-money"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.649686147186147
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#5",
                    "likes": "1",
                    "time": "06/02/2021-16:02:41",
                    "content": "    SebVentures:  Each DAI lost is a perpetual loan with 0% interest rate for Maker.   Going further… ALL DAI issued that remains outside the DSR has a 0% interest rate for Maker. DAI lost just makes it perpetual. I believe it wise for a MIP to be authored that a mandated actor may allocate a small amount each month to distribute DAI that has been permanent lost. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#6",
                    "likes": "3",
                    "time": "06/02/2021-16:57:37",
                    "content": "My worry would be that will bring a lot of time and effort to manage. At the end of the day if you lose 1 dollar note you don’t ask the FED to give your money back. Also how do you verify if a Dai lost is not reclaimed more than once? If we go down this way with time this is going to be a lot of administration that is not going to be paid by anyone. Unless it is sort of automatised which is not possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.430555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "2",
                    "time": "06/02/2021-17:01:12",
                    "content": "Think of it as a marketing/customer retention cost. The more people that have a good experience using our “product” the more likely they will be to continue using it and recommend using it to others. If small amounts are an issue we could also set a minimum refund policy so that we’re not wasting time on dust amounts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "1",
                    "time": "06/02/2021-17:14:53",
                    "content": "    alexis:  Also how do you verify if a Dai lost is not reclaimed more than once?   mosty certainly. i am specifically referencing when folks accidentally send to the dai contract so it is truly lost forever … and we can see it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#9",
                    "likes": "0",
                    "time": "06/02/2021-17:21:12",
                    "content": "I meant over time. for example 10 years from now, someone will reclaim some dais which would have been claimed already 3 years from now. My issue is this doesn’t scale well. Also, this can be used as a sort of DOS attack where you end up with a lot of demand made by a fake contract. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#10",
                    "likes": "5",
                    "time": "06/02/2021-21:00:23",
                    "content": "    cmooney:  @SebVentures I want to caution against thinking about the PSM as a magic bullet for the peg.   In my mind, USDC is a transition towards aDAI, cDAI, fyDAI and maybe DAI-USDC LP. Maybe other stuff, I don’t know. We need to onboard liquid assets (i.e. something we can liquidate easily, which is not the case with vault loans). Not saying it’s an easy solution, but I’m sure the solution exists. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.741666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/burda",
                    "index": "#12",
                    "likes": "1",
                    "time": "09/02/2021-21:33:17",
                    "content": "On the recommendation of the support chat of Makerdao, I leave a request for a refund tokens here. I mistakenly sent DAI tokens to contract 0x6b175474e89094c44da98b954eedeac495271d0f via Binance Smart Chain network. Transaction Hash: 0x069290a399cca6950153884221838cfc47e46eaf3303bb0022016abaeaa812e2 You can check the details of this transaction on the Bscscan website. If the situation is resolved for the better, then I will be very happy to receive these tokens back. Many thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.011904761904763
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#13",
                    "likes": "1",
                    "time": "09/02/2021-21:45:07",
                    "content": "@burda That txn doesn’t exist. Maybe you can post the correct txn hash. I suppose all the ERC20 token transfers to the DAI contract should be reversed. ",
                    "links": [
                        "https://etherscan.io/address/0x6b175474e89094c44da98b954eedeac495271d0f#tokentxns"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/burda",
                    "index": "#15",
                    "likes": "0",
                    "time": "09/02/2021-22:32:07",
                    "content": "    psychonaut:  @burda That txn doesn’t exist. Maybe you can post the correct txn hash. I suppose all the ERC20 token transfers to the DAI contract should be reversed.   Here is a link to this tx hash on the BscScan - Binance Transaction Hash (Txhash) Details | BscScan ",
                    "links": [
                        "https://etherscan.io/address/0x6b175474e89094c44da98b954eedeac495271d0f#tokentxns",
                        "https://bscscan.com/tx/0x069290a399cca6950153884221838cfc47e46eaf3303bb0022016abaeaa812e2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#16",
                    "likes": "2",
                    "time": "10/02/2021-18:45:16",
                    "content": "This is probably not the “usual” circumstance, but I think we should keep in mind that some Dai integrators (like Numerai) intentionally burn Dai. To recover lost Dai would not only imply that we know the Dai is irretrievable, but that this Dai was accidentally burned and not burned as part of a integrator’s crypto-economics. All in all, it seems like a high effort activity that will introduce more subjectivity at the governance layer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/billybob",
                    "index": "#17",
                    "likes": "1",
                    "time": "11/10/2022-16:05:11",
                    "content": "Ok. So replying to this thread as well. I have posted my original thread which is here: Lost Dai in contract reading through all the comments, I find that returning dai to those who have lost it yes can have its complications, and related costs. Has the idea of charging a recovery fee, per user, of say 5%, been floated? I lost 236,000$ of dai. It was a really stupid time in my life. My girlfriend was caught on video doing some very suspect stuff, while i was in florida awaiting her to arrive, and I thought i had left something at my house that would have given her a chance to decode some of my crypto accounts, and at the last minute before she arrived, i went into a flurry of transferring everything to a new account. The dai was my primary concern, yet when i went to transfer immediately the eth network was flooded, and wouldnt transfer, so i tried a few other tokens, those worked, moved a test amount of dai, it worked, and somehow got frazzled and copy pasted the curve token address i had pasted into my metamask account. the real frustrating thing is that i have been in crypto for so long and have never made a mistake, and i have sent so many transactions. Also, knowing that there is nothing I, nor curve can do to get my dai out, except me just stare at my money sitting there in the curve contract address: 0xD533a949740bb3306d119CC777fa900bA034cd52 just look at token balance and my dai will stare at you like it stares back at me. The hardest thing wasnt just knowing my girlfriend did suspect stuff, its that it led me to behave uncharacteristically and lose my cool and lose money. I feel awful. I think there are a good many ideas here, and I hope from a user perspective we can get this ironed out. Thanks for everything guys. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.154306220095694
                },
                {
                    "author_link": "https://forum.makerdao.com/u/billybob",
                    "index": "#18",
                    "likes": "0",
                    "time": "28/10/2022-15:26:05",
                    "content": "I would be more than happy to work for MakerDao in some sort of “customer service” capacity. Especially since I would hopefully be working to achieve some sort of fix for my “lost dai” balance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                }
            ]
        }
    ]
}