{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/deprecated-mip4c2-sp15-core-unit-offboarding-process-amendments/12920",
            "title": "{Deprecated} MIP4c2-SP15: Core Unit Offboarding Process Amendments ",
            "index": 12920,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "rfc",
                "mips-amen",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#1",
                    "likes": "5",
                    "time": "28/01/2022-18:54:03",
                    "content": " MIP4c2-SP15: Core Unit Offboarding Process Amendments  Preamble MIP4c2-SP#: 15 MIP to be amended: <MIP#> Author(s): GFX Labs (@gfxlabs) Contributors: @PaperImperium, @psychonaut. @longforwisdom, @juan, @davidutro, @seth, @twblack88, @sebventures, @MadShills Tags: mip-amendment Status: RFC Date of Amendment Submission: 2022-01-28 Date of ratification: <yyyy-mm-dd> Forum URL: https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/12920   Specification  Motivation Recent events (see RWF-001 facilitator and MKR-001 offboardings below) have shown the process for involuntarily offboarding facilitators and core units could be improved. These changes are an attempt to make the process more transparent, orderly, and conducive to substantive discussion surrounding an offboarding proposal prior to a vote.  Specific Goals  Clarify that a Core Unit can be offboarded in the same governance cycle as removing its budget and facilitator(s). Establish a standard for proposers to include detailed reasoning. Add an explicit Facilitator succession plan so that election by active Facilitators becomes a fall-back process.   Amended MIPs and Components  MIP39c2: Adding/Modifying Core Units MIP39c3: Removing Core Units MIP40c3: Adding/Modifying Core Unit Budget Process MIP41c5: Facilitator Offboarding   Amendment Pull Request  Rough draft from copy & pasted from forum by jpritikin · Pull Request #467 · makerdao/mips · GitHub   Relevant Information  Facilitator Offboarding (RWF-001) Facilitator Offboarding (MKT-001) Modify Core Unit Budget (MKT-001) Video Producing under MIP41c5-SP3: Facilitator Offboarding (MKT-001)  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip41c5-sp2-facilitator-offboarding-rwf-001/11306",
                        "https://forum.makerdao.com/t/mip41c5-sp3-facilitator-offboarding-mkt-001/12058",
                        "https://forum.makerdao.com/t/mip40c3-sp49-modify-core-unit-budget-mkt-001/12059/12",
                        "https://forum.makerdao.com/t/video-producing-under-mip41c5-sp3-facilitator-offboarding-mkt-001/12654/7",
                        "https://forum.makerdao.com/t/governance-and-risk-189-thursday-may-05-17-00-utc/14965/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-86-may-9-2022/15058",
                        "https://forum.makerdao.com/t/weekly-mips-update-85/14914",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-84/14786",
                        "https://forum.makerdao.com/t/weekly-mips-update-83/14673",
                        "https://forum.makerdao.com/t/governance-and-risk-185-thursday-april-07-17-00-utc/14464/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-82/14570",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-81/14443",
                        "https://forum.makerdao.com/t/weekly-mips-update-80/14274",
                        "https://forum.makerdao.com/t/weekly-mips-update-79-pinata/14106",
                        "https://forum.makerdao.com/t/weekly-mips-update-78/13903",
                        "https://forum.makerdao.com/t/weekly-mips-update-77/13706",
                        "https://forum.makerdao.com/t/governance-and-risk-179-thursday-february-24-17-00-utc/13369/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-76/13493",
                        "https://forum.makerdao.com/t/weekly-mips-update-75/13330",
                        "https://forum.makerdao.com/t/weekly-mips-update-74/13234",
                        "https://forum.makerdao.com/t/weekly-mips-update-73/13092",
                        "https://forum.makerdao.com/t/monthly-governance-review-january-2022/13052",
                        "https://forum.makerdao.com/t/weekly-mips-update-72/12945",
                        "https://forum.makerdao.com/t/issue-discussion-call-4-core-unit-and-facilitator-offboarding/12985/5",
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://forum.makerdao.com/t/weekly-mips-update-95/16504",
                        "https://forum.makerdao.com/t/weekly-mips-update-94/16330",
                        "https://forum.makerdao.com/t/governance-and-risk-196-thursday-june-23-at-17-00-utc/15998/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-93/16129",
                        "https://forum.makerdao.com/t/weekly-mips-update-92/15933",
                        "https://forum.makerdao.com/t/governance-and-risk-194-thursday-june-09-at-17-00-utc/15664/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-91/15787",
                        "https://forum.makerdao.com/t/weekly-mips-update-90/15648",
                        "https://forum.makerdao.com/t/weekly-mips-update-89/15464",
                        "https://forum.makerdao.com/t/new-mip4c2-sp15-core-unit-offboarding-process-amendments/15291/2",
                        "https://forum.makerdao.com/t/the-mkr-holder-confessional/15164/43",
                        "https://forum.makerdao.com/t/weekly-mips-update-87/15220"
                    ],
                    "GPT-summary": "The post is an amendment proposal for the offboarding process of core units in MakerDAO. The author explains the motivation behind the proposal and the specific goals it aims to achieve. The post also includes relevant information and links to previous offboarding events. A 3rd party could give constructive criticism or audit and review the proposal.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.1439393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/01/2022-18:54:49",
                    "content": "Anyone who contributed text or commentary and was not listed as a contributor, please reach out to be credited in the proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#3",
                    "likes": "4",
                    "time": "28/01/2022-19:13:37",
                    "content": "    GFXlabs:  “A Core Unit that has been offboarded should conduct all winding down activities within 2 weeks. This includes (but is not limited to) settling outstanding obligations to all contributors, settling any outstanding debts or current obligations of that Core Unit to third parties, orderly transfer of any intangible assets of the DAO to another Core Unit, and return of any DAI in excess of that needed to wind down activities in an orderly manner.”   Who is determining the settling? Doing an accounting like this is going to be difficult and requires a trusted counterparty. In this case the counterparty may not be cooperative while being off-boarded.     GFXlabs:  MIPXXc4: Template for Offboarding Summary of reason for offboarding: State the argument for offboarding. Include proactive actions performed to help the core unit achieve its mandate, if relevant. Explicit deliverables and responsibilities: List deliverables and responsibilities from the Core Unit’s MIP39 mandate, as well as any other specifically declared deliverables and responsibilities (link to source when possible). Implicit deliverables and responsibilities: List deliverables and responsibilities implied by the Core Unit (link to source when possible). Examples of unfulfilled deliverables and responsibilities: List examples of unmet or poorly executed deliverables and responsibilities. Possible remedy to avoid offboarding: Suggest a path to accountability for the Core Unit, so the offboarding proposal could be withdrawn. . (Optional)   A concrete example [here] (MIP41c5-SP3: Facilitator Offboarding (MKT-001) - #10 by MadShills).  An attempt to provide context, arguments, and possible remedies. Generally this was a well cited resource that helped third parties understand the broader rationale during the recent offboarding. It seems the general objective is to be charitable and avoid unnecessary conflict. As part of the process, the offboarding core unit should be required to respond to all principled and reasoned arguments and open issues presented within the MIP. There was no direct response or proposed remedies by MKT to the content of the context and arguments, which ultimately counted against both the CU and DAO. I would suggest that a core unit has 10(?) business days to respond in writing addressing the issues and their own proposed remedies. If the core unit fails to do so, it should be presumed to be a forfeiture. Just a thought but worth considering. One of the main issues with the MKT offboarding was they presumed community support and failed to respond to any of the issues, or offer any remedies of how the issues would be addressed. Mandating a reply is one way to create a serious process for petition and remedy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.036396329365079
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#4",
                    "likes": "2",
                    "time": "28/01/2022-20:26:16",
                    "content": "    MadShills:  As part of the process, the offboarding core unit should be required to respond to all principled and reasoned arguments and open issues presented within the MIP. There was no direct response or proposed remedies by MKT to the content of the context and arguments, which ultimately counted against both the CU and DAO. I would suggest that a core unit has 10(?) business days to respond in writing addressing the issues and their own proposed remedies. If the core unit fails to do so, it should be presumed to be a forfeiture. Just a thought but worth considering.   I’m not sure whether this needs to be documented. I mean, if the CU responds well and promptly to the offboarding proposal then MKR holders will not vote to offboard 'em. Simple as that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.881944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#5",
                    "likes": "3",
                    "time": "28/01/2022-20:30:42",
                    "content": "I appreciate that argument and believe it is valid-- hence just wanted to offer it. In the case of the recent offboarding, the core unit didn’t respond to the concerns or propose remedies, they were very close to being retained despite this omission. In the same way, operationalizing the template into formal arguments is also unnecessary, core units won’t be voted off for no reason. That is, unless their pay cannot be met. A proposal without implicit or explicit complaints will similarly fall flat.  In short, we agree. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.839285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#6",
                    "likes": "1",
                    "time": "28/01/2022-20:30:44",
                    "content": "    MadShills:  In this case the counterparty who may not be cooperative while being off-boarded.   I think the point is to set expectations about what adequate cooperation looks like in this context. Whether the CU receives offboarding gracefully could influence the perception about whether the affected personnel are good candidates for future employment in the MakerDAO ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.722222222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#7",
                    "likes": "5",
                    "time": "29/01/2022-17:10:35",
                    "content": "    GFXlabs:  A Core Unit that has been offboarded should conduct all winding down activities within 2 weeks.   This one seems unrealistic; in practice it takes a lot of time to wind things down gracefully and it may be harmful to force the process. This period should, for example, be enough to create a reorganization plan, submit a proposal for a new core unit, and have it ratified. 4 months would be a more reasonable term for this. The role of the interim facilitator is similar to the role of a curator or trustee in a bankruptcy process.     GFXlabs:  A budget modification proposal for a Core Unit made by anyone other than a member or facilitator of that Core Unit may only be to reduce budget to 0, and may not be voted upon until the earliest of:  All active DAI budgets to the Core Unit have been fully disbursed. Two months from RFC submission… Explicit endorsement from the CU’s facilitator or Interim Facilitator, in which case regular rules apply with regard to the RFC period.    RFC submission here is ambigious. I’m not 100% sure even what is intended: the RFC submission of the original proposal to offboard or one of the CU MIPs? I’m assuming the former. I’m also not sure if the Interim Facilitator’s role here is proper or even well-defined at this point: An Interim Facilitator appointed based upon a succession plan must be a current or former member of that Core Unit. – So this would be likely be a trusted ally of the Facilitator… but somewhat up to chance… if there is a conflict it should not be up to them to make the RFC period a month longer. Second step would then be to suggest another candidate, or, fall back to the Fallback Decision Process. This makes sense in the case an off-boarding is already decided, but it makes no sense to make delegates the proverbial prisoner of the facilitators here. More fundamentally, I think it would be a mistake to make the RFC period of an off-boarding MIP longer than the usual. In fact we should probably make it shorter. The RFC period is a period of crippling uncertainty. If there is a conflict going on, “bleeding the core unit dry” over 2 long months during which political games can be played is a very harmful thing. Once the off-boarding MIP is published, that is the official no-confidence vote, and it should be dealt with as swiftly as possible. It is almost an emergency situation. I suspect the intention here was to provide more time for remediation, but extending the RFC period is not the right way to do this, in my opinion. We’re confusing involuntary off-boarding with feedback and remediation here. Instead, efforts should be made to make involuntary off-boarding a rare exception:   Organize better feedback and evaluation processes. Create transparent performance metrics. Off-boarding should never be a surprise.   Provide the possibility for delegates to send an official warning. This official warning would signal to a CU that their performance has not been up to expectations and that they should make immediate efforts to improve their performance in order to avoid off-boarding. This official warning is important because it means that delegates do not want to proceed with off-boarding, and it separates this signal from an official off-boarding procedure. So it doesn’t create the uncertainty that an ambiguous “off-boarding unless maybe you promise to change” procedure creates.   In the event of a repeated negative evaluation, a voluntary off-boarding should still be encouraged. And it should be a properly understood practice: how should the involved parties proceed in case the off-boarding is consented to by the facilitator?   For the same reasons:     GFXlabs:  Possible remedy to avoid offboarding: Suggest a path to accountability for the Core Unit, so the offboarding proposal could be withdrawn. . (Optional)   I would remove this from the off-boarding proposal template. Once the off-boarding procedure is started, it should be assumed that all other options have been explored to no avail. (For the purpose of the text above, read “delegates and MKR holders” everywhere I mentioned delegates.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.256579184704185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "5",
                    "time": "29/01/2022-19:04:51",
                    "content": "I was under the impression these amendment would also include guidelines/specific Goal for an off-boarding experience that will:  Make off-boarding a positive experience for both Core Unit members and the DAO, by acknowledge their contributions and recognizing any positive results that were accomplished. This can lead to the “boomerang effect” which allows former CU members to either  contribute to the DAO in another role/community member, or while working within the DeFi ecosystem. Gather insights from Core Unit members/facilitator as to what can be improved—this is known as an “Exit Interview”— and it can also include surveys that are extremely useful in the overall employee off-boarding process. This will allow the DAO to identify problem areas, improve the work culture, and opportunities to improve the retention of core unit team members.  Is this something that should be tackled tomorrow, as oppose to today?     GFXlabs:  Implicit deliverables and responsibilities: List deliverables and responsibilities implied by the Core Unit (link to source when possible). Examples of unfulfilled deliverables and responsibilities: List examples of unmet or poorly executed deliverables and responsibilities.   I don’t believe Core Units should be micro-managed—how are community members/MKR token holders supposed to monitor the metrics and gain access to such tools (like shortcut ) and provide the results/evidence of such? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.277272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#9",
                    "likes": "3",
                    "time": "29/01/2022-19:36:32",
                    "content": "This is a solid and pragmatic interpretation. Core units should be afforded 4 months to unwind in the event of any Offboarding.  Involuntary offboarding should never happen in practice, except under rare and unfortunate circumstances. It is problematic for both the DAO and CU when this happens. Offboarding should be disentangled from performance management which has its own challenges, as Wouter and Frank both note. Involuntary Offboarding is the end of the line, not 3/4 of the way. A standard unwinding term for all CU is ideal. Such a term can be forgone at the discretion of the core unit, but something like this is even handed and fair. It is also likely to achieve the best outcome for both parties. A standard term respects the autonomy and challenges core units face. It also produces business good will in the event of an involuntary offboarding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#10",
                    "likes": "2",
                    "time": "29/01/2022-19:45:09",
                    "content": "    flipflopflapdelegate:  I was under the impression these amendment would also include guidelines/specific Goal for an off-boarding experience that will:  Make off-boarding a positive experience for both Core Unit members and the DAO, by acknowledge their contributions and recognizing any positive results that were accomplished. This can lead to the “boomerang effect” which allows former CU members to either contribute to the DAO in another role/community member, or while working within the DeFi ecosystem. Gather insights from Core Unit members/facilitator as to what can be improved—this is known as an “Exit Interview”— and it can also include surveys that are extremely useful in the overall employee off-boarding process. This will allow the DAO to identify problem areas, improve the work culture, and opportunities to improve the retention of core unit team members.    These are points the Maker Talent CU can probably address. Agreed that exit interviews are important to collect the data for improving retention. But this applies to any situation where a DAO member leaves. Moving CU members in a different role, or rehiring in another CU should often be preferred. I’m not sure if this aspect needs to be defined in a MIP. In general I think a lot of these procedures should not be MIP-ified but just be encouraged as best practices.     flipflopflapdelegate:  I don’t believe Core Units should be micro-managed—how are community members/MKR token holders supposed to monitor the metrics and gain access to such tools (like shortcut ) and provide the results/evidence of such?   @dux-core-unit and probably @collateral-core-unit use Shortcut (formerly Clubhouse) I believe. Agreed that these should typically not be accessed by delegates or MKR holders as it would constitute too much micro-management. The roadmaps, milestones, and status flags as presented on  the most recent G&R call seem to be closer to the level of granularity that should be reported imo. This goes well with two other initiatives that SES is looking into: our objective to kick-start an ecosystem performance dashboard, and the auditing & quality control track as one of our Q2 incubation tracks. Happy to provide more details if that’s useful. But the point is that these elements would not be part of the proposed MIP. I don’t believe they should be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.959321475625824
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#11",
                    "likes": "4",
                    "time": "29/01/2022-19:47:17",
                    "content": "    wouter:  @dux-core-unit and probably @collateral-core-unit use Shortcut (formerly Clubhouse) I believe. Agreed that these should typically not be accessed by delegates or MKR holders as it would constitute too much micro-management.   We use Shortcut as our project management tool. We also plan to use the Milestone and Epic features of that tool to report out to the community on the details of our work, below the initiative, and these will mostly show up in our bi-monthly updates. Any detail below that would take a lot of time to explain to people outside the core unit since it would be challenging to understand the context of the work, from gathering requirements, to story creation, to completing work. To get a flavor of what we do, I am open to having key stakeholders attend targeted meetings or ceremonies to get an idea of how the process works. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.768518518518518
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#13",
                    "likes": "7",
                    "time": "29/01/2022-20:39:57",
                    "content": "Yes. I think 3-4 months makes a lot of sense because:   I think that oftentimes the offboarding procedure will really be the offboarding of the facilitator, and we’d ideally want to salvage the team and keep it operational, maybe after restructuring. (Once again, compare this to a company restructuring or bankruptcy with a trustee or curator taking over.)   I’m assuming the interim facilitator takes over immediately when it comes to the operations of the CU in winddown. I’m assuming this person is not an advocate of the old facilitator, but someone neutral. I’m assuming the interim facilitator has control, maybe together with an auditor, over the CU’s multisig.   You want to have the time available to propose a new core unit (maybe even multiple CUs) to potentially move team members to and ensure business continuity. CU proposals need 2 months to go through RFC and FS; if the timing is unlucky (just missed an RFC deadline), it takes almost 3 months.   Since it will often be difficult to find a new facilitator, have all the necessary talks, and since it takes time to nail down a mission, vision, and strategy for a new CU, one or two extra months doesn’t seem unreasonable.   Many core units have 3 months runway in the operational wallet under full operation. So while it’s in wind-down, it should be enough to cover 4 months in situations where it makes sense.   Last point: 4 months is the maximum. In many cases, I would expect the interim facilitator to wrap things up much quicker.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.764088250930356
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#14",
                    "likes": "4",
                    "time": "29/01/2022-22:21:02",
                    "content": "I really think all of this discussion also reinforces the need for stricter assessment when onboarding new Core Units. As well as preference for leaner and smaller team which can grow in to a larger team if successful ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.086363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#15",
                    "likes": "2",
                    "time": "30/01/2022-03:25:28",
                    "content": "As well as establishing benchmarks and explicit expectations of the core unit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#16",
                    "likes": "4",
                    "time": "30/01/2022-14:11:15",
                    "content": "    monkey.irish:  Any detail below that would take a lot of time to explain to people outside the core unit since it would be challenging to understand the context of the work, from gathering requirements, to story creation, to completing work.   Adding my two cents to the discussion by underlining Robert’s statement. At DUX, for example, we use a set of tools (eg. Discord, Shortcut and GitHub) in our day-to-day work—the contents of these tools would not make sense to external stakeholders without relevant context. Providing this context would create a LOT of overhead for the team which would eat away our efficacy as an engineering CU. Similar to Robert’s approach at CES we use Canny to maintain an up-to-date overview of Epics we are working on (or planning to), and this overview is accessible to anyone. In addition we provide quarterly roadmap updates in high detail. In my opinion this should be the abstraction level where CUs should provide transparency on their work and be held accountable by the community—not at the lower abstraction levels of operational tooling (ie. a sprint board, project mgmt tools) ",
                    "links": [
                        "https://forum.makerdao.com/t/dux-roadmap-spotlight-q1-2022/12612"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#17",
                    "likes": "4",
                    "time": "01/02/2022-16:52:29",
                    "content": "(Note that this proposal hasn’t been built on top of the appropriate MIP4c2 subproposal template. It will be left as it is for now, but it will be made to conform to the template (either by the author or by the MIP Editor) before the Frozen Period kicks in. It will look more or less like MIP4c3-SP1). ",
                    "links": [
                        "https://forum.makerdao.com/t/mip4c3-sp1-rapid-payment-for-small-bug-bounties-mip64-mip40c3-sp42-amendment/12869"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#18",
                    "likes": "5",
                    "time": "01/02/2022-19:51:17",
                    "content": "Draft here, MIP4c2-SP15: Core Unit Offboarding Process Amendments - HackMD ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#19",
                    "likes": "1",
                    "time": "04/02/2022-14:51:32",
                    "content": "I don’t think anyone mentioned it but it would be interesting also to draft a plan of how the vested MKR tokens affect during the offboarding process. In my head it sounds okay if the offboarded core unit keeps the percentage relative to the current vesting cycle until the month the core unit is dissolved. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#20",
                    "likes": "7",
                    "time": "10/02/2022-01:00:52",
                    "content": "While it might be against my self-interest, I don’t think offboarded core unit should get the vested MKR tokens even in percentage terms. MKR vesting is there to encourage long-term commitment and quality. And from what I understand, MKR vesting starts getting unvested after an year. “A one-year cliff to make sure that there is reciprocity in the DAO-Contributor relationship” -SES - MKR Incentive Plan Details Similar to how companies have trial periods for employees or consultants, if a core unit is offboarded before 1 year, I believe it’s fair to say that the minimum contribution to the DAO hasn’t been met at least judged by Maker governance. And therefore, shouldn’t get the vested MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#21",
                    "likes": "1",
                    "time": "03/03/2022-09:11:19",
                    "content": "makes sense ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#22",
                    "likes": "6",
                    "time": "16/03/2022-15:07:02",
                    "content": "Closing the loop for those who haven’t been paying attention on discord, I’ll be taking over stewarding these improvements through to the governance cycle. We have a hack md summary of most everything, and a thread in discord if you have any thoughts we might have missed. Will post updates as the pull requests go into the MIPs github. Cheers. ",
                    "links": [
                        "https://discord.com/channels/893112320329396265/951552467965984828",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/43"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#23",
                    "likes": "1",
                    "time": "24/03/2022-04:09:52",
                    "content": "Reminder that this proposal will enter its Frozen Period in one week, on March 31, 2022. Last day for modifications is March 30, 2022. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. @twblack88 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#24",
                    "likes": "1",
                    "time": "29/03/2022-16:00:44",
                    "content": "Since the –fantastic– MIP 40 revisions just hit the governance cycle, it makes sense to move these revisions up a month as well. Offboarding a team is intimately connected to it’s budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#25",
                    "likes": "0",
                    "time": "20/04/2022-22:47:50",
                    "content": "Reminder that this proposal will enter its Frozen Period in seven days, on Thursday, April 28 at 00:00 UTC. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#26",
                    "likes": "0",
                    "time": "25/04/2022-10:20:04",
                    "content": "    GFXlabs:  Rough draft from copy & pasted from forum by jpritikin · Pull Request #467 · makerdao/mips · GitHub   Wanted to see if this PR is up to date. Appreciate the merging, made the conversations much easier to follow. But I do still see a few references to things that appear to be different in the PR copy and comments (how long dow CUs have to wind-down once offboarded, for example). Thanks for all the coordination work with crafting this document, btw. I know that is often the hardest part of the MIPs process (gathering shareholder opinions and aggregating agreed recommendations). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#27",
                    "likes": "1",
                    "time": "25/04/2022-15:29:14",
                    "content": "    prose11:  Wanted to see if this PR is up to date   It’s not, but I don’t think this amendment (which is turning out to be more extensive than was thought) will be entering the May Governance Cycle. @twblack88 is running point on this (with Gala and I collaborating), so I think it’s better if I just tag him  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#28",
                    "likes": "2",
                    "time": "25/04/2022-16:26:32",
                    "content": "Based on governance timing and the breadth of changes @blimpa is correct.     prose11:  Wanted to see if this PR is up to date.   We have one more meeting tomorrow where we’ll update that branch with a new PR. As a sneak peek for anyone curious, there is a list of action items, all the requisite changes, and copy for each edited MIP inside the workspace (thanks to blimpa). some adjustments we found along the way:  Clarity updates to MIP 38 and 39 Removing some clauses that try to pre-optimize for every state a Core unit can be in, instead of focusing on the actions to add/modify/remove Adjusting on the fly to the MIP40 revisions (thanks to @adcv and @Aes for the quick sync)  We spent quite some time thinking on MIP38, it looked a lot like this:  SPIDEY1920×1920 131 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.14983164983165
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#29",
                    "likes": "2",
                    "time": "27/04/2022-01:52:08",
                    "content": "    twblack88:  We have one more meeting tomorrow where we’ll update that branch with a new PR.   Hah, that was ambitious. After today’s call there is, sigh, still changes to incorporate. Sadly we won’t be formally submitting tomorrow. However! We’re closer to getting:  a PR with all changes here to the forum for feedback. a revised MIP4c2 (since we’re editing MIP38 we have to include those changes in the outline) handling all the edge cases for offboarding a core unit, vs it’s facilitator, and the involuntary vs voluntary triggers for those scenarios. Think flowcharts.    We’re meeting again on Friday, happy to open the call to anyone who asks for the link. And here is the meme that explains the battle for all these changes:  Group 140hydra1920×1082 180 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.884469696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#30",
                    "likes": "1",
                    "time": "20/05/2022-18:21:45",
                    "content": "This proposal is now being led by @twblack88. Work on this proposal continues in this thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}