{
    "poll_list": [
        {
            "title": "Increase the WBTC-A Debt Ceiling - January 18, 2021",
            "index": "6005",
            "option": "Yes",
            "supporting_mkr": "38,841",
            "highest_fraction": 1.0
        },
        {
            "title": "Increase the LINK-A Debt Ceiling - January 18, 2021",
            "index": "6005",
            "option": "Yes",
            "supporting_mkr": "38,812",
            "highest_fraction": 1.0
        },
        {
            "title": "Decrease the BAT-A Debt Ceiling - January 18, 2021",
            "index": "6005",
            "option": "Yes",
            "supporting_mkr": "37,216",
            "highest_fraction": 0.96
        },
        {
            "title": "Increase the MANA-A Debt Ceiling - January 18, 2021",
            "index": "6005",
            "option": "Yes",
            "supporting_mkr": "38,633",
            "highest_fraction": 0.99
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-debt-ceiling-adjustments-11th-jan-2021/6005",
            "title": "[Signal Request] Debt Ceiling Adjustments, 11th Jan 2021 ",
            "index": 6005,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "debt-ceiling",
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "5",
                    "time": "11/01/2021-13:42:53",
                    "content": "Hey all, As mentioned in the Rate Changes Proposal post, we are proposing debt ceiling changes based for particular vault types based on worsened or improved liquidity metrics. BAT-A: Decrease DC from 10m DAI to 2m DAI MANA-A: Increase DC from 250.000 DAI to 1m DAI We also feel the debt ceiling should be increased for LINK-A where utilization stands at 86% and larger refinancing might follow from Aave since the rate at Maker is much more competitive. WBTC-A debt exposure also seems to be increasing and is at 76% debt utilization and therefore we are proposing a 50m DC increase for WBTC-A vault type. As for ETH-B vaults where DC is currently almost fully utilized, I described here why I think we shouldn’t be increasing DC at this point. ETH-A has about 144m of buffer left which might be enough if we don’t see another price run-up from these levels. There is also a pending Signal Request for adjusting ETH-A DC. TUSD-A Signal Request is also looking to be in favour of setting DC to 0, which means that the winning vote will go into on-chain poll next week. Proposed Debt Ceiling changes: ETH-A: + 260m or based on winning vote according to Signal Request (1bn DC) WBTC-A: + 50m (210m DC) TUSD-A: - 135m or based on winning vote according to Signal Request (0m DC) LINK-A: + 10m (20m DC) BAT-A: - 8m (2m DC) MANA-A: + 750k (1m DC)    Do you agree with proposed Debt Ceiling changes?  Yes No - Comment below Abstain     0 voters     Please vote on proposed changes and provide feedback below. The vote ends this Friday 15th January 2021. If the proposal is accepted, the changes will go into next week’s on-chain poll. If the situation becomes urgent by maxing out ETH-A or WBTC-A debt ceilings, an urgent executive will be considered. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-b-line-iam-ceiling/5731/15",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-a-debt-ceiling-2021-02/5993",
                        "https://forum.makerdao.com/t/signal-request-manage-tusd-exposure-due-to-ownership-change/5821",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-a-debt-ceiling-2021-02/5993/17",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-17th-2021/6120",
                        "https://forum.makerdao.com/t/urgent-executive-debt-ceiling-adjustments-18th-jan-2021/6094",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118"
                    ],
                    "GPT-summary": "The author of the post is proposing changes to the debt ceiling for various vault types based on liquidity metrics. The post includes proposed changes for each vault type and a call for feedback and voting. The post also mentions pending signal requests for adjusting ETH-A and TUSD-A DC. The post is explaining the proposal and asking for feedback and voting. Some 3rd parties are asking questions and providing constructive criticism of the proposal, while others may be auditing and reviewing the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.590277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "2",
                    "time": "11/01/2021-14:31:21",
                    "content": "why not also increase the DC for PSM-USDC? utilization is at 92% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "8",
                    "time": "11/01/2021-14:57:05",
                    "content": "So the PSM is in a semi-awkward spot right now. Although a vote passed in favour of increasing it to 500M, there were some last minute debates over the wisdom of increasing it quickly up to 500M. While the Quantstamp audit has allayed some fears for some people, some of the mandated actors have questioned the quality of that audit. As most will be aware, the Foundation-supported mandated actors are unable to directly audit or comment on the PSM code themselves. This leaves them in the position of needing to trust other contributors and audit firms that this change is safe. On balance, increasing it more slowly than initially voted seems defensible, given that:  While the likelihood of exploit is very low (and imo decreases with each passing day that the PSM contract is not successfully attacked), the severity at a 500M debt ceiling is extreme bordering on catastrophic for the Maker Protocol. We are not currently having significant peg issues, therefore there is no immediate downside to not increasing the ceiling to 500M right this second. There is limited benefit from the potential trade income right now. It’s probable that 27M of liquidity at zero slippage already competes reasonably favourably with curve, even given the current fees, but we’ve not seen much usage yet. This one is harder to judge, but it’s not as though we’re seeing USDC flying in and out on a regular basis.  In general, I think we’re trying to thread the line between implementing the mandate in the recent governance poll as quickly as possible, and exposing the Maker Protocol to as little risk as possible. I don’t actually think it’s going to be possible to chose a course of action that doesn’t upset someone here, so at the moment I’m aiming for a compromise that will mostly likely leave everyone slightly unsatisfied. Quantstamp is due to release a more formal set of documents soon (as I understand), I think that would be the time to consider an increase. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.306394993894994
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/01/2021-18:27:19",
                    "content": "I’d like to get some more participation here if possible before Friday. Please vote, even if the results are one-sided. It helps to increase the mandated actors confidence in the proposed changes. ",
                    "links": [
                        "https://forum.makerdao.com/t/gobernanza-de-un-vistazo-14-01-2021-autor-original-prose11/6073",
                        "https://forum.makerdao.com/t/governance-at-a-glance-2021-01-14/6048"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "2",
                    "time": "14/01/2021-14:11:53",
                    "content": "Most of this makes sense to me. The only thing that gave me pause before hitting “yes” was the change to BAT. Looks like that would effectively turn off DAI generation for the collateral type as current utilization is well past 2M. Is there a specific reason we are trying to offload BAT, first with the increased SF then with capping utilization? It’s clearly not used a bunch so I don’t think it makes too much of a difference either way, but wanted to see if I could better understand why we are taking that course of action with BAT and not other underutilized tokens like ZRX or BAL Thanks for all the great work @Primoz. Even when I bring up questions I always feel very comfortable delegating to your decision making. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.144166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#6",
                    "likes": "3",
                    "time": "14/01/2021-15:33:22",
                    "content": "Thanks for feedback @prose11. BAT-A has LR of 150%, which is low compared to others erc20 tokens and the current BAT liquidity metrics don’t support 10m DC, but much lower one. It is as simple as that. We did a similar move to MANA-A weeks ago, but then liquidity improved due to Coinbase listing it and we are increasing DC back again. It may happen same to BAT, but for the time being we would want to lower current exposure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#7",
                    "likes": "0",
                    "time": "19/01/2021-18:21:58",
                    "content": "Don’t make decisions just by describing a proposal. Using algorithm to make a reliable and flexible solution! More clear indicators Believing in makerdao’s users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "1",
                    "time": "27/01/2021-21:52:54",
                    "content": "The various changes here passed successfully on-chain as part of this and this executive. Thank you to all who voted. ",
                    "links": [
                        "https://vote.makerdao.com/executive/collateral-onboarding-debt-ceiling-adjustments-other-changes?network=mainnet#proposal-detail"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/02/2021-21:52:58",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3144"
}