{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-actions-to-increase-competitiveness-of-eth-steth-collateral/14090",
            "title": "[Informal poll] Actions to increase competitiveness of ETH & stETH collateral ",
            "index": 14090,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "discussion",
                "governance",
                "informal-poll",
                "steth",
                "wsteth"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#1",
                    "likes": "8",
                    "time": "21/03/2022-11:22:04",
                    "content": " Overview stETH is gaining populairity as DeFi collateral. Within Maker the adoption has slowed down since about late February, see below.  Maker stETH adoption  Screenshot 2022-03-21 at 10.26.212176×1530 164 KB  Aave has launched stETH around the time that the interest for borrowing against stETH started to dwindle, and has seen a great adoption since. See this dune dashboard: Dune Analytics. The adoption of stETH on Aave is logical, as users can draw debt in ETH, and thereby just going long on stETH yield. However, MakerDAO should have a discussion about how the competitiveness of ETH & stETH can be increased on the Maker protocol.  AAVE stETH adoption  Screenshot 2022-03-21 at 10.55.551488×896 57.2 KB   Increasing competitive advantage There are multiple options MakerDAO can undergo. The ones I focus on here are: adding vault-types for stETH, and onboarding Aave Interest Bearing ETH (aETH) as collateral in Maker. Other options can be proposed and discussed in this thread or different threads.  Adding vault-types for stETH Summary of the options: adding a vault-type for stETH with lower liquidation ratio & higher stability fee (stETH-B), AND/OR adding a vault-type for stETH with higher liquidation ratio & lower stability fee (stETH-C)  Shall we add a stETH vault-type with a lower liquidation ratio?  Pros  Allow users to increase their exposure further on stETH Higher stability fee can be asked for this.   Cons  Could see usage of ETH-B moving to this new vault-type, which could increase risk to Maker protocol Increases risk to Maker protocol in case of depegging between stETH & ETH     stETH-B  Yes No Abstain     0 voters      Shall we add a stETH vault-type with a higher liquidation ratio  Pros  Allow users to get cheaper liquidity with their stETH, attracting more risk averse users Can increase the total amount of stETH collateral in the Maker protocol ETH-C users might switch, which could net more SF revenue if SF for this vault-type is higher   Cons  stETH-A users might switch, which could net less SF revenue if SF for this vault-type is lower   Increases risk to Maker protocol in case of depegging between stETH & ETH       stETH-C  Yes No Abstain     0 voters      Onboarding aETH as collateral in Maker AAVE Interest Bearing ETH (aETH) is what a user gets when depositing ETH into the supply side on AAVE protocol. As more people start going long stETH / short ETH on Aave, the interest rate for the supply side for ETH increases. This makes it cheaper to borrow stables on Aave against ETH. Therefore, onboarding aETH into the Maker protocol as collateral might make a lot of sense.  Shall we request core units to investigate aETH as collateral in Maker?  Pros  Allows users to go long on the supply side interest rate for ETH on AAVE Adds downward pressure on the interest rate on AAVE for ETH, making borrowing DAI more attractive on Maker with ETH   Cons  The downward pressure on the ETH interest rate on AAVE might make stETH on AAVE even more attractive.     aETH  Yes No Abstain     0 voters      Next steps The informal polls will run until 2022-03-28T10:00:00Z. After that based on the results, signal requests and/or a MIP-6 application for aETH will be made.  Update March 31st 2022  stETH-C → moving forward towards onboarding stETH-B → likely not feasible for risk/reward aETH → potential systemetic risks, so ditching for now.  ",
                    "links": [
                        "https://forum.makerdao.com/t/introduction-risk-parameters-for-wsteth-c-vault/14669",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-3/14549",
                        "https://forum.makerdao.com/t/monthly-governance-review-march-2022/14428",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-march-2022/14424",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-17-23-2022/14191",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-april-2022/14979"
                    ],
                    "GPT-summary": "The author of the post is proposing ways to increase the competitiveness of ETH and stETH collateral on the Maker protocol. The post includes an informal poll with options for adding vault-types for stETH and onboarding Aave Interest Bearing ETH (aETH) as collateral in Maker. The post also invites feedback and suggestions from the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.740779002142639
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "21/03/2022-11:39:24",
                    "content": "I like this, I like to see Maker more aggressive, trying to climb higher and higher, looking for the best opportunities in the market. Plus this could be a great strategy for Degen in DeFi. My vote is YES, I will still wait for the Risk CU resolution, but this looks more than good. Maker Eating more ETH, moving away from centralized tokens, I like the idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "11",
                    "time": "21/03/2022-14:04:08",
                    "content": "stETH usage is low (100M) and flat for a month. So there is a problem of product market fit. Aave found a product market fit with it that we can’t replicate.  image775×425 6.11 KB  We can say that ETH deposited on Maker is safer than on Aave, but when we want to build a “too big to fail” counterparty exposure on stETH is that good enough? We can also hope that the market will move from ETH as pristine collateral to stETH, even if it’s not. So far, market share remains unchanged, but if we have to decrease SF on ETH-A to fight … Only solution I see is to put stETH SF at 1% and try to get a monopoly on stablecoin from stETH and trigger a wave to make stETH the new ETH (and we can assume that our biggest customers can’t migrate to stETH so that wouldn’t hurt much our revenues). DeFi Summer 3.0? (it’s getting hot here). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.900568181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#5",
                    "likes": "0",
                    "time": "22/03/2022-06:01:01",
                    "content": "I’m all for stETH-B. If the DC’s can keep up, lets go! I will migrate the pathetic position I have left tomorrow. Charge me 7% 8% 9%… even 10%? idc ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#6",
                    "likes": "0",
                    "time": "22/03/2022-06:03:11",
                    "content": "No comment on aETH. Maybe? I should have voted abstain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#7",
                    "likes": "6",
                    "time": "22/03/2022-10:22:04",
                    "content": "Few remarks on alternative stETH vault types from my end:  questionable demand as stETH/ETH leveraging at Aave is becoming dominant use case while stETH liquidity is very solid, stETH liquidity risks could emerge when and if stETH/ETH strategy at Aave starts massively unwinding due to some unknown event, leading to a discount of stETH I believe PE and Oracle CU had some reservations related to aggressive DC increase of stETH products in the past on the other hand there are no significant costs of onboarding different stETH ault types apart from our and PECU time spent  As for aETH it could become interesting to collateral and should give nice supply yield on regular ETH also if this proposal passes. It does however increase risks of indirect stETH exposure as ETH supplied to Aave will be borrowed in large quantities and collateralized by stETH, so we might want to treat aETH risk profile as stETH with some layer of protection (depends on average LTV going forward). It is interesting to think how aETH holders will be becoming increasingly exposed to risk of stETH but won’t switch to it completely for better yield. As if new risk profile asset emerged for those not 100% convinced by Lido, but still want some yield benefit and partial exposure. stETH/ETH leverage strategists are basically boosting their stETH yield by sharing Lido risks with aETH holders and paying for it. Market will tell what happens, I kind of speculate aETH holders will become aware of this fact and migrate to stETH completely or seek Lido isolated ETH supplying on other markets. Or maybe this new third risk profile asset persists - partial exposure to stETH through aETH. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-march-2022/14424"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.399114997905321
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "4",
                    "time": "22/03/2022-12:26:18",
                    "content": "Speaking of competitiveness, does anybody know why a new protocol like Stargate launched and their go to market Stablecoin choice is USDC and USDT? Got 1 Billion TVL and not one DAI. And not just Stargate, I’m seeing new EVM compatible platforms launch and their preferred stablecoin choice is always USDC  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/03/2022-16:44:01",
                    "content": "Yes, why does that happen? even nft games use usdc or usdt, like for example axie or pegaxy  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#11",
                    "likes": "0",
                    "time": "28/03/2022-16:45:49",
                    "content": "Polls finished - Mostly postive. Will work on next step posts this week. If anyone would like to contribute, send me a message. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jbeezy",
                    "index": "#12",
                    "likes": "3",
                    "time": "28/03/2022-18:09:44",
                    "content": "Hey @Frank_Brinkkemper I am from the Lido BD team and would be happy to lend any support where we can / would be useful.  Of course we are biased in the discussion but let us know how we can support none the less. @SebVentures we welcome stETH as the new ETH narrative! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.903787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#13",
                    "likes": "0",
                    "time": "28/03/2022-18:53:41",
                    "content": " image1171×710 57 KB  I think it is because it is more than 10 times more liquid than DAI and does not have the biases and problems associated with USDT, is it? Also if something happens then obviously Circle will give you back your 1:1 in cash. Ah sometimes the answer is very obvious  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#14",
                    "likes": "2",
                    "time": "29/03/2022-03:14:21",
                    "content": "Of course, it’s a reason why the Maker protocol needs to expand more aggressively. The common feedback I heard was brand awareness and also that many NFT players and projects actually source their liquidity from central exchanges so USDT and USDC are preferred compared to Dai which has thin liquidity on central exchanges. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#15",
                    "likes": "0",
                    "time": "29/03/2022-10:52:33",
                    "content": "I see that aWETH was already Greenlit   → https://vote.makerdao.com/polling/QmVBGusc#vote-breakdown I will request the onchain collateral management (@gov-comms-core-unit could this become a taggable group?) to have a holistical view on this issue, so that all options are considered together, not one by one. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#16",
                    "likes": "9",
                    "time": "30/03/2022-10:57:54",
                    "content": "tldr; wstETH-B; Lower LR, Higher SF - Probably low demand and hard to compete wstETh-C; Higher LR, Lower SF - Higher potential to get traction (~80M debt from Aave) aETH - Probably added risks outweight the benefits Comparison of Lido stETH positions between Maker and Aave In order to better understand the potential effects of the proposed vaults in this forum post, we looked at the current Lido stETH positions in Aave and Maker. For sake of simplicity, we only looked at largest accounts, in Aave 10 largest stETH suppliers represent ~75% of total supply. The estimated Aave stETH-stablecoin borrow market is approximately $245M, 113% larger than MCD wstETH-A (115.23M dai), or in other words, Aave controls ~68% of wstETH collateralized stablecoin debt. The Aave stETH-ETH debt is at ~$795M, which is hardly addressable by Maker, due to different market risk profile of position. Liquidation ratio (LR) Some of the stETH collateralized positions in Aave use cross-collateralization, actually 8 out of 10 use it, but over all, almost 90% of collateral is from stETH. This shows that the feature is valuable to users, but not essential, as stETH is still dominating. Position debt type varies between positions, some of them are single asset debt, while others are multiple asset debt, but in total, ETH represents 73.82%, USDC 17.44% and DAI 3.83% of total debt respectively. The collateral ratio of these positions also varies. The ones which borrow more in ETH tend to have lower collateralization, which makes sense, as risk of liquidation due to market risk is much lower. The lowest CR positions are thus stETH-ETH, which range between 145-175%, with CR buffer of 12-40%. The positions which borrow stablecoins range in CR between 167-384% CR and CR buffer of 35-250%, while the stETH-stablecoin average collateral weighted CR is at 245% with 111% CR buffer. This tells us that the majority of these accounts are quite risk averse and do not strive for high leverage. Compared to MCD wstETH-A, these positions would be set at 270% CR on average (160% + CR buffer in Aave). While the collateral weighted average CR in MCD wstETH-A is at 553% and 393% CR buffer, majority of Aave positions could still be built in MCD with the similar safety buffer. This tells us that lower LR is likely not the advantage we seek right now, and probably shows that wstETH-B; lower LR, higher SF would not see large demand. Also note, that if we want to compete with lower LR, we would also need to set SF below ~3% in order to offer similar priced product, which is likely not acceptable from risk perspective alone and in addition, we use OSM price delay which makes this kind of a position much riskier for us compared to Aave which uses live price and faster liquidations. Effective interest rate The MCD wstETH-A SF is currently set at 2.5%. stETH currently can not be borrowed in Aave, thus there is no nominal interest rate on deposit, thus the effective borrow rate of stETH positions in Aave is equal to effective borrow rate of debt. For stETH-ETH position, this is 2.34%, USDC 2.42% and DAI 1.44%. While the ETH borrow position is incomparable, due to different market risk profiles, it is interesting to see that even though DAI is the cheaper option, the USDC debt is approximately 4 times larger.  The USDC or DAI borrow rate is still smaller in Aave compared to MCD, but since the more costly option - USDC is dominant, this shows that the stability fee is also not the most important factor for why these positions prefer Aave over MCD. wstETH-C; Higher LR, Lower SF option There is some potential here, basically this product would need to offer a reasonable CR buffer compared to current stETH-USDC Aave positions and lower stability fee, which is 2.42%. For example 180% LR vault would allow the average stETH-stablecoin position to still maintain a 65% buffer (26.5% price drop), compared to current 110% (45.5% price drop) which might be interesting for them assuming SF would be low enough to compensate for the additional risk (the positions would still have higher liquidation price in MCD compared to Aave). Nevertheless, it is highly questionable that this would trigger a migration, as there are other possible factors of why one protocol is preferred over another which we didn’t consider here. For example, the ability to borrow debt in multiple stablecoins at once. The current addressable market we could potentially take from Aave with the mentioned product is ~$80M. aETH as collateral Currently the ETH-A stability fee is 2.25%, while effective borrow rate on Aave ETH-USDC position with 200% CR is 1.36%. We could introduce aETH-A with 2.25% SF, which would effectively become 1.21% (due to positive interest accrued on collateral), assuming 200% CR, which is lower than at Aave. We must understand other possible applications of introducing aETH collateral in MCD. For example, current ETH collateral could shift into aETH, which would lower the ETH borrow rate in Aave and further increase the stETH-ETH positions. We must be very careful when we are introducing risks related to other protocols into Maker, especially lending/debt protocols. Each protocol has specific risks, when they are mixed together, we lose the ability to offer diversification benefits of using multiple protocols. For example, borrowers might decide to borrow from multiple protocols at once in order to diversify smart contracts or some other non-economic risk; LR and effective SF are just one part of the product. It is possible that introducing aETH as collateral would have a neutral or even negative effect on our competitiveness and debt market share in the new market equilibrium, while it is certain that we are increasing the risk in the protocol which could have a negative impact on current clients. Otherwise, we are already exposed to Aave and all the underlying assets and services they utilize, such as Chainlink oracle price feed via D3M. aETH would further increase this exposure and potentially canabinalize the DC of D3M. Furtheron, about 70% of all borrowed ETH in Aave is collateralized by stETH. By introducing aETH collateral we also increase our exposure towards Lido. Overall, my opinion is that benefits of aETH do not outweigh the introduced risks and complexities of protocol overlapping and added systemic risk. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-march-2022/14424"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.353340268146094
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#17",
                    "likes": "0",
                    "time": "31/03/2022-09:49:34",
                    "content": "Thanks for this analysis @rema . What does @Growth-Core-Unit or @collateral-core-unit think of the recommendations? If the argument against adding wstETH-B is that in the current market there seems to not be a big ask for low liquidation ratio vaults for stETH, perhaps this is a market that isn’t yet catered, that might nevertheless warrant the effort. Depending on the response, I’d propose to poll either just wstETH with higher liquidation ratio, or polling also the lower liquidation ratio vault type at the same time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#18",
                    "likes": "4",
                    "time": "31/03/2022-10:10:12",
                    "content": "I can only comment on the technical side. For wstETH it should be fairly low cost and quick to spin up a new ilk, since the technical assessment, adapter and oracles have already been implemented for wstETH-A, and would only add marginal maintenance costs as it would utilize existing oracles. All it requires really is to deploy existing off the shelf contracts and develop an onboarding spell. So the investment on the technical side would be low, and we would be able to execute quickly. To onboard aETH it would require the development of a new token adapter, due to the fact that the token contains rebasing logic (its token supply changes corresponding to accrued yield instead of token value). This would be more time consuming and costly to onboard, so for that work to make sense, it should be a net profitable investment for Maker. However the post above suggests it might only increase the systemic risk, with little to no added revenue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4807615629984054
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#19",
                    "likes": "6",
                    "time": "31/03/2022-11:09:19",
                    "content": "My personal opinion is that I am generally against low LR products in Maker;  We don’t have the best predisposition for competing in this space, for example price delay and dutch auction create this much more risky than with live prices and flat discount on auctions. Other protocols and centralized services will probably be able to offer higher leverage and better UX, for example perpetual swaps, futures. Newer and more risk tolerant protocols will outcompete us, as they have nothing to lose and will offer even higher and cheaper leverage with liquidity mining schemes on top of it. Maker was always risk averse and likely current dai holders and vault owners value this tendency. The “final product” of Maker is the dai holder. With decreasing dai collateralization, we might also lower trust in dai itself and hinder the “final product”.  Otherwise, with small DC the vault would likely be viable, but we would need to charge less than the risk premium to remain competitive. I would still recommend against going into low LR direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.904924242424244
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#20",
                    "likes": "2",
                    "time": "31/03/2022-11:36:35",
                    "content": "Ok thanks for this. You’ve convinced me, and now doesn’t make much sense to request additional resources being spent on this low liquidation ratio for now. Perhaps indeed this could be done in the future on a chain/L2 where faster liquidations are possible, or through some other long-tail asset integration. Let’s continue forward with stETH-C. Gonna request governance what the best way is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.930555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/superTricycle",
                    "index": "#21",
                    "likes": "1",
                    "time": "31/03/2022-22:20:38",
                    "content": "    Doo_StableLab:  The common feedback I heard was brand awareness and also that many NFT players and projects actually source their liquidity from central exchanges so USDT and USDC are preferred compared to Dai which has thin liquidity on central exchanges.   Wen CEX D3M??     Frank_Brinkkemper:  Let’s continue forward with stETH-C.   LFG ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#22",
                    "likes": "2",
                    "time": "04/04/2022-09:03:51",
                    "content": "    Frank_Brinkkemper:  Let’s continue forward with stETH-C. Gonna request governance what the best way is.   Happy to assist if you are still unsure what path to take  In some ways getting this up for vote is the “easy” part, but in order for it to be implemented we’ll need Risk, Smart Contracts, and Oracle assessments. Since things should be the same or similar on the Smart Contract and Oracle side, I’d recommend reaching out to @Risk-Core-Unit about work needed/timeline for their assessment on the initial parameters to sync the timeline for any governance votes needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.591836734693878
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#23",
                    "likes": "1",
                    "time": "04/04/2022-10:14:54",
                    "content": "I reached out to the On-chain Collateral Management Initiative, where risk responded that they will look into proposing parameters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#24",
                    "likes": "2",
                    "time": "04/04/2022-21:52:33",
                    "content": "Dear Rema, I don’t agree that the final product of Maker is Dai holder, or even Dai, Dai is a byproduct, in my eyes the product is Maker Vaults. We have been talking about Dai as our main product for years and I feel we gave a big advantage to our competitors that understood that leverage is what ppl seek. A stablecoin is actually much closer to a commodity, so talking about Dai as a product makes it really difficult to market, imagine even if the dollar enters a 10 year of high inflation…it only gets worse. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.766666666666667
                }
            ]
        }
    ]
}