{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-first-cycle-lessons-learnt-rwa-evaluations/5968",
            "title": "[Discussion] First cycle lessons learnt - RWA evaluations ",
            "index": 5968,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#1",
                    "likes": "6",
                    "time": "08/01/2021-00:06:22",
                    "content": "Background The RWA Risk team is about to wrap up the first cycle of collateral evaluations for Maker. In this first cycle, the team has worked on both DROP (CF & NS) and Trust Model (6s) assets. This is a brand new experiment for Maker where the team, with the help of partners and other internal domain teams, is creating evaluation frameworks, processes and internal intelligence from scratch to deliver on the RWA promise. It feels like our mission statement is “to build an investment bank in a couple of months”. To make sure we fulfill our mission and move as fast as we can without compromising on quality of work, the team is adopting an iterative approach and constant feedback loops. In a nutshell, we are adopting some agile practices in Risk management. This is not very common. The approach In the interest of keeping our communication channels open to the community, we have done our first round of “Lessons Learnt” retro, midway between risk assessment publications/discussions and setting up of monitoring tools for RWA assets. Our goal was to review where our work felt efficient and solid (i.e. good foundations to keep building); and the areas where we can improve a little or a lot. There was no better way than to structure our review as a “The Three Little Pigs” story:  Our “House of Bricks”: things we do that are solid and we should keep doing Our “House of Sticks”: things we do that are OKish, but can be improved Our “House of Straws”: things we do that just about hangs together, needs more attention  Once identified the core themes for each, the team “voted” on some areas we can take short term actions with incremental improvements that we think can bring benefits both to the community and to our own work with partners/other teams. image1800×858 186 KB Improvement opportunities Obviously, we identified some solid areas, but also quite a few spots that require tightening the screws. We incorporated feedback from the community in forum discussions and from people directly involved in delivering this first piece of work. Just a summary of a few common themes per “house” (non-exhaustive) House of Bricks  A very positive and professional mediation with asset originators The community engagement and contribution to risk assessments was great Valuation model approach took into account industry specific frameworks  House of Stacks   Risk assessments:  Make the risk assessment reading experience easier to the community Provide a tailored content of the “essentials” to governance (“exec summary”) Include more visuals (e.g. infographics) in the assessments Include more visual summaries of “red flags”, “question marks” to the community    Processes & expectations  Provide a clear workflow of interaction steps with asset originators Set as clear as possible expected timeframes with partners/support teams    House of Straws   Community experience & risk assessments:  Give a voice to the community i.e. “tell us what is important for you in assessments” Highlight why some pieces of information are important to be included Risk assessments may be long and the community does not always read them    Focus areas for the coming cycle The team is already working on some actions that will reflect in the coming round of evaluations and monitoring. Considering all improvement opportunities, our immediate focus are these top 4 actions:  Include an Executive Summary in all our assessments Provide a workflow diagram for AO engagements Get feedback from community on “What does the community look into the risk assessment” [Pool] Make clear the monitoring process and valuation model in a forum post  We hope these actions will bring noticeable improvements to the community. We’ll continue iterating, improving and communicating. Keen to hear from all of you. ",
                    "links": [
                        "https://forum.makerdao.com/t/ns-drop-collateral-onboarding-risk-evaluation/5418",
                        "https://forum.makerdao.com/t/sixs-rwa-001-collateral-onboarding-risk-evaluation/5352",
                        "https://forum.makerdao.com/t/poll-rwa-risk-onboarding-sections-most-valuable-insights/6123",
                        "https://forum.makerdao.com/t/mip7c3-sp5-domain-team-onboarding-risk-domain-team/5476/15"
                    ],
                    "GPT-summary": "The Maker RWA Risk team has completed the first cycle of collateral evaluations and has conducted a \"Lessons Learnt\" retro to identify areas of improvement. The team has identified some solid areas and areas that require tightening the screws. They have incorporated feedback from the community and people directly involved in delivering the work. The team is already working on some actions that will reflect in the coming round of evaluations and monitoring. They are keen to hear from the community and are asking for feedback and suggestions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.56472027972028
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/01/2021-07:00:34",
                    "content": "With regards to RWA I am overall feeling we are going down a path that will not scale. There is no way we in the community can learn about every business and every industry that needs capital and correctly price risk parameters. Just totally impossible. Additionally we are severely short on bandwidth. We are currently onboarding about 2 collateral types per month while the waiting list is 60-70 applications (!). There is no way this is going to scale. Is it possible we find companies that can act as a L2 layer between Maker and the individual RWA applicants? These will be given a debt ceiling and as long as certain parameters holds (lets say they use Centrifuge they need to issue maybe 80% DROP, 20% TIN) we simply do not bother about how they run their business and what companies they lend money to. Maybe we @spin and @mrabino1 are in on a discussion about this? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.700937950937951
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "1",
                    "time": "08/01/2021-11:26:24",
                    "content": "Let’s explain how I see it. Happy to get inputs. In my view, the end goal is for Maker RWA to manage 10-20 vaults. Each vault will be dedicated to an asset class and will have a corresponding SPV in the real world managed by a dedicated asset manager (non Maker related). For instance, Blackrock will manage an infrastructure-related SPV that will invest only in infrastructure loans (bridges, solar farms, toll roads, …). Another example will be a SPV investing only in T-Bonds. At this stage, the RWA team will mainly monitor and audit the asset managers. Governance will be able to allocate funds over those asset classes as they see fit. Maybe tokenization of the real world will move further and we will be able to have smart-vault buying tokenized treasuries on the market directly. Think something like USDC and the PSM. USDC is nothing more than using a T-Bills invested SPV (but leaving all profit to Circle). I personally think we should at some point audit them (they will likely laugh at us if we try now). But we are far from there yet. Currently, we are dealing with asset originators who are playing the asset manager role as well. There is a bit of conflict of interest here but we have to start somewhere to build experience and reputation. You can’t set up an industry level framework to manage $10M of assets. Most of the work we are currently doing is not related to the underlying asset. The main mission is due diligence and monitoring. Just like a banker check your balance sheet before giving a loan, he doesn’t have to understand the exact details of the banana business or cruise line business. Mainly that cruise line is a risky business currently. Berkshire Hathaway has only 25 employees to manage $800B of assets and they invest in almost every business possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/01/2021-12:58:13",
                    "content": "    SebVentures:  For instance, Blackrock will manage an infrastructure-related SPV that will invest only in infrastructure loans (bridges, solar farms, toll roads, …). Another example will be a SPV investing only in T-Bonds.   This basically means that if Blackrock becomes problematic or greedy Maker will have no other option for infrastructure-related investments. Also - while Blackrock is a large company they concentrate mainly on the US and Europe. Remaining parts of the world is not serviced by them as far as I can tell.     SebVentures:  Berkshire Hathaway has only 25 employees to manage $800B of assets and they invest in almost every business possible.   I will argue that the comparison is not valid. Berkshire Hathaway makes large investments in strictly selected companies that they keep practically forever. The vast majority of their investments are concentrated in the financial industry. They are not exposed to other risk than that of the equity. Maker on the other hand will most likely finance smaller things for a wide variety of companies in a multitude of businesses - just look at the Centrifuge applications. So in the not so distant future - either 25 employees for Maker RWA is either way too little or we need either a protocol or a L2 solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.155059523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "0",
                    "time": "08/01/2021-14:32:24",
                    "content": "    Planet_X:  This basically means that if Blackrock becomes problematic or greedy Maker will have no other option for infrastructure-related investments.   Right, maybe having two for each asset class might keep them in check. In any case, we can always change the asset manager.     Planet_X:  Maker on the other hand will most likely finance smaller things for a wide variety of companies in a multitude of businesses - just look at the Centrifuge applications.   That brings the subject of investment selection. The asset manager is a kind of L2 solution. Quite sure Goldman Sachs will not even bother having a discussion with someone wanting to borrow only $10M. Just like the Bank of England started by discounting invoices, I’m quite sure they don’t do that anymore. We will most likely not be in the invoice discounting business in 10 years. But it’s a good start. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.085515873015873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/04/2021-20:32:29",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}