{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-makerdao-be-registered-in-wyoming/8009",
            "title": "Should MakerDAO be registered in Wyoming? ",
            "index": 8009,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#1",
                    "likes": "2",
                    "time": "12/05/2021-04:37:44",
                    "content": "If DAOs can be recognized as LLCs in Wyoming, what would be the downside/upside to that?   The Block    Wyoming 'DAO law' to go into effect in July after receiving final approval Legislation introduced earlier this year in Wyoming to create a legal link between decentralized autonomous organizations (DAOs) and the state government is now the law of the land.      ",
                    "links": [
                        "https://www.theblockcrypto.com/linked/102813/wyoming-dao-law-to-go-into-effect-in-july-after-receiving-final-approval"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "1",
                    "time": "12/05/2021-06:39:53",
                    "content": "Good question. I suspect the answer is much more complex than just YES or NO. But it would be great if the legal experts of MakerDAO could navigate us in the type of things they are currently evaluating regarding this topic. Mostly to educate us (i.e., the maker community in general). thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gustav_Arentoft",
                    "index": "#3",
                    "likes": "3",
                    "time": "12/05/2021-08:43:26",
                    "content": "As a European I don’t see a reason for us to be incorporated in the US unless there are really big benefits from it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/05/2021-10:00:10",
                    "content": "I believe there is better place to be registered, like some island. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#5",
                    "likes": "1",
                    "time": "12/05/2021-12:02:32",
                    "content": "I was thinking more of a US-based wholly-owned subsidiary rather than HQ. I would imagine it would bring some legal clarity and possibly legitimacy to RWA loan originators who might be on the fence about borrowing from a DAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#6",
                    "likes": "0",
                    "time": "12/05/2021-12:07:11",
                    "content": "The upside would be that it is legally recognized, which may potentially encourage more users and participants. As for the downside, even though the legal structure is a bridge between DAOs and corporations, it would still go against the spirit of DAOs, which is not having one single entity in control. It would still make MakerDAO less decentralized in a sense. Despite the Pros and Cons, having the law in place is a great start from a long-term perspective. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.04421768707483
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "2",
                    "time": "12/05/2021-13:17:26",
                    "content": "I would want a Legal CU or outside counsel to weight in. It may not even be very easy to tell. My first thoughts are that the downside would be making the DAO formally under the purview of US laws. But the upside would be liability protection for holders of MKR. I should note on that second point that I hold my MKR inside an S Corp, and recommend anyone who isn’t pseudonymous to use an LLC, corporate entity, or some other form of personal liability shield to hold their MKR. I am not a lawyer but I am paranoid when it comes to litigation. Whether that is more or less personal liability protection than the DAO being a registered entity in Wyoming, I don’t know. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555303030303031
                }
            ]
        }
    ]
}