{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/wintec-reintroduction/15264",
            "title": "Wintec Reintroduction ",
            "index": 15264,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "collateral",
                "centrifuge",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/DavidJeng",
                    "index": "#1",
                    "likes": "4",
                    "time": "18/05/2022-21:30:22",
                    "content": "Hi Community, My name is David Jeng, and I’m CEO of Wintec Industries. We submitted our MIP6 submission in May 2021 and we continue to be excited to work with the Maker community. How our business has changed over the past year:  We’ve been following the progress of Maker and the RWF CU and understand that with anything new, it is best to crawl before we walk before we run. During this last year we have continued deploying hundreds of millions in capital into our customers’ supply chain assets from existing funding sources. We continue to patiently maintain our interest in piloting with Maker a way to bridge into real world assets. Wintec initially looked to pilot with 20 million DAI with plans to scale to 50-100 million DAI in the following 12-18 months. The target for the pilot still remains the same, and we expect to scale quickly thereafter.  As many of you are aware (and probably personally impacted by), the world’s supply chain has seen several shocks in recent years, first brought on by the pandemic and rolling global lockdowns and more recently by the Russian invasion of Ukraine. This has led to a few compounding issues in global supply chain:  First, given the supply chain shocks, may suppliers have increased lead times for their goods and/or reduced availability of their products. In response, customers have shifted planning strategies to increase purchase order sizes, increase purchase order durations, and/or increase safety stocks. This has created large burdens on manufacturing partners and factories supporting those supply chains. The bloating of partner supply chains is creating demand for supply chain financing solutions such as ours. Second, unsquared sets are becoming a larger problem. Imagine a factory that needs to produce a widget consisting of 10 components, if 1 of the 10 are delayed the rest of the 9 sit idle until the last component arrives - this is unsquared sets. Unsquared sets compound the supply shock problem. Not only are their inventories higher from the response to the supply shock, but they cannot move inventories they do have until the “square is set”. Global supply chains will continue to go through economic and geopolitical adjustments and we expect such environments to create significant demand for supply chain financing solutions such as ours.  What these supply chain shocks mean for Wintec:  Given these supply chain shocks, Wintec is seeing nearly double the rate of opportunities than we were in the prior few years. We continue to engage with existing and new institutional financing partners to match them with our customer’s demand. This allows us to better match funding sources with customers and ensure more competitive pricing for our customers. We are excited about new innovations within the Maker ecosystem that can position Maker to be a large credible global provider of capital.  Why Centrifuge? Centrifuge offers a platform that operates similarly to an evergreen fund where assets, which meet the quality criteria, can be collateralized for the intended supply chain financing transactions. We look to Centrifuge as a cost effective and less-friction scalable vehicle to continuously fund quality assets that are managed through our solutions. Since we know our assets the best, using Centrifuge allows us to take significant skin in the game in the first-loss tranche and allows investors in the senior tranche peace of mind knowing that Wintec will take the first loss. Why MakerDAO? As one of the longest standing blockchain ecosystems, Maker’s model of overcollateralization to ensure safety of the ecosystem has proven itself in both bull and bear markets. We believe that in order for blockchain-centric solutions to become mainstream, it must begin the journey to integrate with real world assets and expand use cases. We believe that the diligent steps that the Maker community has taken to ensure a safe ramp is exactly what is needed for mass adoption. For those in the community that don’t know us yet, here are some fundamentals on Wintec:  Wintec has been in operation for 30 years, and has managed over $5bn+ of supply chain assets over the last 15 years. Wintec has a global warehouse footprint across North America, Asia and Europe that are owned or controlled by Wintec. We have significant proprietary customizations for automation, controls and partner integration built on top of Microsoft Dynamics ERP System Wintec is able to obtain highly competitive banking rates for deals at scale already and is interested in exploring new sources of capital including newly developing solutions via Centrifuge and Maker for future opportunities. Wintec is reviewed and audited both by their clients and a top 10 accounting firm.  What’s next?  We will work with the RWF CU for what is needed for a refresh of the MIP6 in context of MIP67 We will host a community call through Centrifuge where you can get to know us and ask any questions to help inform the Maker and Centrifuge communities about the company, the asset class, etc.  ",
                    "links": [
                        "https://forum.makerdao.com/t/pa-drop-mip6-application-us-based-supply-chain-finance-for-large-oems/7787",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.826453626282393
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "20/05/2022-02:57:17",
                    "content": "Thank you David for posting this reintroduction of Wintec a MIP6 applicant from 2021 that has patiently endured the onboarding tranquility of MakerDAO. Much appreciated—-because as you know—patience is a virtue—and as your team also knows, patience and time are both a powerful component of success. You don’t successfully manage 15 years of supply chain orders in the billions without forbearance, perseverance, and uniqueness. Personally, I believe Wintec has the right stuff and should be taken seriously. Wintec has the dossier that showcases experience, reliability, compliance, tenacity, and more importantly the willingness to take chances. And this is why I believe  Centrifuge has chosen Wintec as one of its premier partners in the quest to solve the supply chain conundrum via a decentralized stablecoin like DAI. What can be better than that! Thanks again for the reintroduction to the MakerDAO community,  as we look forward to hearing more from Wintec!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.60515873015873
                }
            ]
        }
    ]
}