{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ilk-names-versus-display-names-for-vault-types/14759",
            "title": "Ilk Names versus Display Names for Vault Types ",
            "index": 14759,
            "category": [
                "Governance"
            ],
            "tags": [
                "wsteth-c",
                "vaults",
                "terminology",
                "wsteth-b"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "10",
                    "time": "22/04/2022-16:20:02",
                    "content": " Ilks So far, governance, front-end UI’s and the community generally has tended to use the Ilk Names (ETH-A, ETH-B, GUNIV3DAIUSDC2-A, etc) directly when referring to vault types within the Maker Protocol. This has some advantages:  Simplicity and shared terminology for communication and understanding. Direct link between changes in the code of executive spells, and the commonly used names.  And some disadvantages:  Ilk names cannot be (feasibly) changed. More complex collateral types end up with alphanumeric soup Ilk names: GUNIV3DAIUSDC2-A, CRVV1ETHSTETH-A, etc. Some collateral types have names that are completely disconnected from the collateral: RWA001-A, RWA002-A, etc. Ilk naming conventions are pretty loose and this can’t easily be fixed. This leaves front-ends with the choice of:  Displaying the (often hard to parse) ilk name directly. Making up a display name (may be inconsistent with other front-ends)      Why am I bringing this up? We’ve reached a situation where there is effectively no good ilk-name for a vault-type we may want to onboard because we have two contradictory conventions. I’m referring to wstETH-C. The two conventions are:  The letter suffix of an ilk refers to the order in which it was onboarded (ie, first -A, then -B, then -C, etc) The letter suffixes of -B and -C have taken on additional meaning from the usage with the ETH-B and ETH-C ilks, namely -B meaning higher leverage, and -C meaning lower leverage.  For the low-leverage, low-fee wstETH vault type being discussed, by one convention it should be wstETH-B, and by the other wstETH-C. Given that the ilk-names are more or less unequivocally a technical consideration, we’re going to follow the technical convention for the low-leverage, low-fee wstETH, so the ilk-name will be wstETH-B and not wstETH-C as we’ve been referring to it so far.   Solution The general way to resolve issues like this is to add a layer of abstraction to avoid the issue. In this case, add a new canonical ‘display-name’ (controllable by Maker Governance) that is used in front-ends and discussion instead of the ilk-name. This mitigates most disadvantages, imposes relatively lightweight costs, and brings some advantages. To give an idea of what this might look like, here are some ilks with possible display names.     Ilk Display Name     ETH-A Ethereum Balanced   ETH-B Ethereum High Leverage   ETH-C Ethereum Low Fee   PSM-USDC-A USDC Peg Stability Module   RWA001-A 6s Capital   GUNIV3DAIUSDC1-A UniswapV3 0.01% Fee DAI-USDC Pair (Gelato)   CRVV1ETHSTETH-A stETH-ETH Pair (Curve)    One huge advantage is that we can modify display names. IE, if we add an additional CRVV1ETHSTETH vault, we can modify both display names to reflect the differences. @Protocol-Engineering can obviously feel free to contradict any of the following, but my understanding of this setup is that you want to create an on-chain mapping of ilks to display-names (and any other metadata that is important enough to be set directly by governance.) This may already exist to some extent in the ilk-registry, but I’m unsure if this covers everything we may want from this system. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-21-27-2022/14839",
                        "https://forum.makerdao.com/t/introduction-risk-parameters-for-wsteth-c-vault/14669/3",
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
                        "https://forum.makerdao.com/t/relay-semanal-10-16-de-mayo-de-2022/15289"
                    ],
                    "GPT-summary": "The author of the post discusses the advantages and disadvantages of using Ilk Names versus Display Names for Vault Types in the Maker Protocol. They propose adding a new canonical 'display-name' that is controllable by Maker Governance to avoid issues like contradictory conventions for naming vault types. The post also suggests some possible display names for different Ilks. The author acknowledges that this proposal may require an on-chain mapping of ilks to display-names and other metadata that is important enough to be set directly by governance.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.3665930560667405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/04/2022-16:20:21",
                    "content": "Relevant discussion moved from the other thread below: ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#3",
                    "likes": "3",
                    "time": "22/04/2022-14:44:22",
                    "content": "On the technical side all of the collateral type labels so far have been added ordinally. So ETH-B is named so because it was the second one added. Choosing to add a second WSTETH vault but with the -C label violates that assumption. It seems like a trivial thing and I totally respect the desire to keep parameter parity between “C” types. I just don’t know if that parameter parity is going to hold for the long term and having a gap in ilk tags is going to increase the maintenance burden on the technical side on an ongoing basis. If we do go with the WSTETH-C nomenclature here for high-level convenience we may want to add a nulled out WSTETH-B collateral type just to be able to answer the inevitable “Where’s WSTETH-B?” questions asked by future DAO participants and developers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2749999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#4",
                    "likes": "3",
                    "time": "22/04/2022-14:50:07",
                    "content": "    brianmcmichael:  If we do go with the WSTETH-C nomenclature here for high-level convenience we may want to add a nulled out WSTETH-B collateral type just to be able to answer the inevitable “Where’s WSTETH-B?” questions asked by future DAO participants and developers.   Even this adds additional gas costs to iterations in the ilk registry and storage.  I would suggest we let go of the abstract idea of pairing ilk letter types (A, B, C, …) to risk categories.  The categories are likely to change over the years, and eventually the abstraction will be nothing more than confusing technical debt.  Let’s just go with wstETH-B for this, and just add letters on as we need them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "1",
                    "time": "22/04/2022-15:01:37",
                    "content": "    cmooney:  Even this adds additional gas costs to iterations in the ilk registry and storage. I would suggest we let go of the abstract idea of pairing ilk letter types (A, B, C, …) to risk categories.   Repeating something that I’d said in discord. I think it would be useful if we had a canonical on-chain mapping of ilks to front-end consumable values. This gives a few advantages:  We can help ensure that the various vault types have consistent branding across front-ends. (display-name mapping.) This display-name can reference risk categories, or anything else governance wants it to reference. We can mark vault types as deprecated, and front-ends can read this and react accordingly. (status mapping) Governance can update / format the information layer as needed to take into account new vault types and changing circumstances.  … at the cost of needing to maintain a structure similar to the existing chainlog and apply changes as part of executive votes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.49025974025974
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#6",
                    "likes": "1",
                    "time": "22/04/2022-15:11:12",
                    "content": "    LongForWisdom:  Repeating something that I’d said in discord. I think it would be useful if we had a canonical on-chain mapping of ilks to front-end consumable values.   The canonical list is available now. A UI to quickly consume it could be produced quickly by a DAO-affiliated frontend dev or possibly a gitcoin grant. A developer would need to call the list() function on the Ilk Registry and then iterate the array, converting each value from the internal bytes32 tag to their human-readable string counterparts. Additional information on each ilk type is available via the Ilk Registry as well, and you mention a good point about giving offboarded collaterals a different tag. I’ll bring this suggestion back to the team. I think in the short-term I could probably develop a reader contract for you this afternoon that would let you access these values as strings directly from the chain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#7",
                    "likes": "1",
                    "time": "22/04/2022-17:35:11",
                    "content": "It looks like my comment above was moved from the original post I’d responded to. With regard to LFW’s desire to have ilk tags correspond to arbitrary labels, I want to point out that the Ilk Registry includes a name variable that can be modified by governance. The value that gets used here is the string name of the underlying token by default, but governance has the ability to modify this value directly to something that makes more sense. I want to encourage the use of this variable to suit this use-case and request input from governance on how to label these values appropriately. ",
                    "links": [
                        "https://github.com/makerdao/ilk-registry/blob/master/src/IlkRegistry.sol#L250"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.145833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/04/2022-17:38:11",
                    "content": "    brianmcmichael:  The value that gets used here is the string name of the underlying token by default, but governance has the ability to modify this value directly to something that makes more sense. I want to encourage the use of this variable to suit this use-case and request input from governance on how to label these values appropriately.   Having token-name and token-symbol in addition to vault-type-name might also be useful. But yeah, you’re right, we could repurpose that easily enough. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.404761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#10",
                    "likes": "1",
                    "time": "22/04/2022-17:40:19",
                    "content": "    LongForWisdom:  Having token-name and token-symbol in addition to vault-type-name might also be useful. But yeah, you’re right, we could repurpose that easily enough.   The registry provides the address of the underlying gem contract as well, so an integrated UI could reach out directly to the contract to extract this value. We added the cached name function to the registry for precisely this sort of use. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.085714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "1",
                    "time": "22/04/2022-17:42:37",
                    "content": "    brianmcmichael:  I want to encourage the use of this variable to suit this use-case and request input from governance on how to label these values appropriately.   Perhaps @collateral-core-unit could propose a set of display-names for the existing vault-types? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/turbo",
                    "index": "#12",
                    "likes": "4",
                    "time": "25/04/2022-09:12:19",
                    "content": "We (Oasis.app) would really support having display names. Its a big frustration with onboarding users, who obviously struggle to understand the ilk names/ meaning. We actually decided a few weeks ago that we’d look to start using display names on Oasis’ front end. So would be good to agree on a common language. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#13",
                    "likes": "1",
                    "time": "25/04/2022-10:34:02",
                    "content": "This seems like a really helpful change. I appreciate that vault users are likely to be pretty sophisticated operators, but an ilk name like “GUNIV3DAIUSDC2” is pretty tough for anyone to easily understand if they don’t already know what it means. I find the RWA ilks particularly tricky, and it makes good sense from a UX perspective to provide display names that more closely relate to what the collateral actually is! That’s on top of the maintenance/consistency benefits noted above. Would be excited to see this change across the front-end, not least to make life easier for applications like @turbo and Oasis. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.212037037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#14",
                    "likes": "8",
                    "time": "02/05/2022-08:37:05",
                    "content": "@LongForWisdom Took a stab at this. I’m following your suggestion but taking it a step further. Once we all have agreement, CES can craft a spell to update the registry accordingly.  TL;DR  Customer facing product naming must focus on “customer benefit” rather than technology used or revenue streams such as “fees”. Using this approach eases the friction for new DEFI users to select the product that fits their needs. -A, -B, -C vaults become “Balanced”, “High Leverage” and “Low Leverage” respectively. PSM customer facing name becomes “DAI Arbitrage Vault” D3Ms get a suffix, either: “Fixed Rate” (Aave style protocol2protocol integration) and “Credit Line” (not-live-yet Maple protocol2protocol integration) Product type and subtypes are mandatory in order to communicate clearly and repetitively what our product is (apart from DAI).   Front-end examples These examples are using a mix of the Naming Conventions below, leaning towards the “short customer facing Product Display Name”  Makerburn  Before  1022×896 62.8 KB   After  931×924 73.8 KB   OASIS.app product cards  Before  1433×740 122 KB   After  1357×766 132 KB   Before  1577×754 141 KB   After  1506×805 161 KB   Instadapp  Before  1600×818 173 KB   After  1600×790 177 KB   Naming Conventions The naming conventions uses 4 concepts as input:  Customer Segmentation* Collateral Tech Product Type/Sub-type Descriptor  *This document does not involve any customer persona research. It is just using the already loosely defined customer segments that vaults -A, -B, -C are targeting for Ilks such as ETH and wBTC.  Customer segments Customer segments are a specifier to target a specific product (Vault) variation (Ilk) to a customer; focusing on communicating the customer benefit. Avoid mentioning protocol revenue streams such as “fees” which are not a customer benefit necessarily.     Segments Description     Balanced    High Leverage High SF, Low CR   Low Leverage Low SF, High CR     Collateral Tech Available collateral tech in the Maker protocol which serves as input on how to name and position product offering     Collateral Tech     GemJoins/CropJoins/etc   D3M   Permissioned: Gemjoins, D3M, MIP21   PSM     Product Types and Subtypes Using Collateral Tech as input the following product types are:     Collateral Tech Product Type Sub-type     GemJoins/CropJoins/etc Vault    D3M DAI Direct Deposit Module Fixed Rate   D3M DAI Direct Deposit Module Credit Line   Permissioned: Gemjoins, D3M, MIP21 Vault    Permissioned: Gemjoins, D3M, MIP21 Institutional Vault    PSM DAI Arbitrage Vault      Descriptor Extra element used to specify details about an ad-hoc product sub-type, for example, Centrifuge vaults.  Naming Convention Proposal Principles:   The convention uses onchain data such as token.name() or token.symbol() to provide consistency across front-ends and verifiability through blockchain explorers, but Maker can take the decision to overrule this principle for readability and añready adopted namings on front-ends across the ecosystem.   A concept in brackets, ie.: (segmentation), means that it is optional.   Customer Segment and Product Types will focus on communicating customer benefits, when irrelevant they become optional, such as when there is no -B or -C version of an Ilk.    Vanila ERC20 w/ GemJoin Adapter  Convention: Gem.name() + (Segmentation) + ProductType  Example:     ILK Customer Facing Product Display Name     ETH-A Wrapped Ether Balanced Vault   ETH-B Wrapped Ether High Leverage Vault   ETH-C Wrapped Ether Low Leverage Vault     Alternative Convention: Gem.symbol() + (Segmentation) + ProductType  Example:     ILK Short Customer Facing Product Display Name     ETH-A WETH Balanced Vault   ETH-B WETH High Leverage Vault   ETH-C WETH Low Leverage Vault     Uniswap LP ERC20 Token w/ GemJoin Adapter  Convention: Gem.name() + token0.name / token1.name + (Segmentation) + Product Type  Examples:     ILK Customer Facing Product Display Name     UNIV2DAIETH-A Uniswap V2 DAI/ETH Vault   UNIV2WBTCETH-A Uniswap V2 WBTC/ETH Vault   GUNIV3DAIUSDC1-A Gelato Uniswap DAI/USDC LP Vault     Alternative Convention: Gem.symbol() + token0.name / token1.name + (Descriptor) (Segmentation) + Product Type  Examples:     ILK Short Customer Facing Product Display Name     UNIV2DAIETH-A UNI-V2 DAI/ETH Vault   UNIV2WBTCETH-A UNI-V2 WBTC/ETH Vault   GUNIV3DAIUSDC1-A G-UNI DAI/USDC 0,05% Vault     Vanila ERC20 w/ PSM  Convention: Gem.name() - (Segmentation) + ProductType  Example:     ILK Customer Facing Product Display Name     PSM-USDC-A USD Coin - DAI Arbitrage Vault   PSM-PAX-A Pax Dollar - DAI Arbitrage Vault   PSM-GUSD-A Gemini dollar - DAI Arbitrage Vault     Alternative Convention: Gem.symbol() - (Segmentation) + ProductType  Example:     ILK Short Customer Facing Product Display Name     PSM-USDC-A USDC - DAI Arbitrage Vault   PSM-PAX-A USDP - DAI Arbitrage Vault   PSM-GUSD-A GUSD - DAI Arbitrage Vault     MIP21 RWA ERC20  Convention: Gem.symbol(): Partner Name - (Descriptor) - (Segmentation) + Product Type  Example:     ILK Customer Facing Product Display Name     RWA001-A RWA001 - 6s Capital Vault   RWA002-A RWA002 - Centrifuge: New Silver Vault   RWA003-A RWA003 - Centrifuge: ConsolFreight Vault     Miscellaneous  Convention: Gem.name() + (Segmentation) + ProductType - (SubType)  Example:     ILK Customer Facing Product Display Name     CRVV1ETHSTETH-A  Curve.fi ETH/stETH Vault   DIRECT-AAVEV2-DAI Aave interest bearing DAI Direct Deposit Module - Fixed Rate   DIRECT-MPLV1-DAI (NOT LIVE, for example purposes) Maple Pool Token - DAI Direct Deposit Module - Credit Line     Alternative Convention: Gem.symbol() + (Segmentation) + ProductType - (SubType)  Example:     ILK Short Customer Facing Product Display Name     CRVV1ETHSTETH-A steCRV Vault   DIRECT-AAVEV2-DAI aDAI Direct Deposit Module - Fixed Rate   DIRECT-MPLV1-DAI (NOT LIVE, for example purposes) MPL-LP - DAI Direct Deposit Module - Credit Line     Request:  Partners such as Oasis.app, Instadapp, Defisaver and others, please, feel free to provide feedback as adoption across decentralized front-ends is what will deliver the real benefit of achieving and implementing a naming convention. Also, share any other needs around product information you might have. Maker token holders and community members, communicating clearly our product benefits to our customers is the path to grow adoption by reducing friction, your feedback is valuable, it is your product, have a voice on its naming.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.133444055944056
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#15",
                    "likes": "0",
                    "time": "02/05/2022-16:22:51",
                    "content": "    M_C:  @LongForWisdom Took a stab at this. I’m following your suggestion but taking it a step further. Once we all have agreement, CES can craft a spell to update the registry accordingly.   Really appreciate you working on it  I don’t have super strong opinions over what we call everything, ideally it should take some input from @Growth-Core-Unit and/or branding/marketing if we have those in the future. Couple of notes friom me personally (though  may not be valid as I’m not approaching it as a customer)     M_C:  -A, -B, -C vaults become “Balanced”, “High Leverage” and “Low Leverage” respectively.   High Leverage + Low Fee rather than High/Low Leverage. Basically, naming vaults based on their positive attributes, rather than postitive/negative.     M_C:  PSM customer facing name becomes “DAI Arbitrage Vault”   I mgiht exclude ‘Vault’ from this. “DAI Arbitrage” by itself seems a little meh though. DAI-USDC Exchange? DAI-USDP Exchange? Exchange Vault? etc.     M_C:  D3Ms get a suffix, either: “Fixed Rate” (Aave style protocol2protocol integration) and “Credit Line” (not-live-yet Maple protocol2protocol integration)   Fixed rate is maybe misleading for D3M’s as we change the target rate semi-regularly (or have in the past.) Maybe “Rate Targeted” versus “Fixed Rate”? Honestly, naming conventions are less important for D3M’s as they are not directly customer facing. On balance I would just keep it as ‘Aave D3M / Maple D3M’ etc. Some of these are a little long to be convenient as well.     M_C:  A concept in brackets, ie.: (segmentation), means that it is optional.   I would not make Balanced/High Leverage/Low Leverage optional inclusions. I misunderstood, you mean it’s optional as in not every vault type will have a segmentation.     M_C:  |PSM|DAI Arbitrage Vault   I would probably not refer to the PSM product type as ‘Vault’ at all, in practice it’s a completely different product to everything else we are calling a vault.     M_C:  MIP21 RWA ERC20   Imo there is no reason to include the gem symbol in the display name for these. It’s a token that essentially doesn’t exist outside being a placeholder in the Maker Protocol.     M_C:  Partners such as Oasis.app, Instadapp, Defisaver and others, please, feel free to provide feedback as adoption across decentralized front-ends is what will deliver the real benefit of achieving and implementing a naming convention. Also, share any other needs around product information you might have.   Uhm: @Frank_Brinkkemper @turbo @nikola_j, don’t have anyone for Instadapp I’m afraid! Maybe @makerburn can comment as well if he feels the need. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.18141495601173
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#16",
                    "likes": "0",
                    "time": "03/05/2022-10:49:43",
                    "content": "Heya Appreciate the effort! From our perspective, we’d probably mostly use these display names in onboarding/documentation of new people within our team. For our front-end we will likely continue to use our own naming, which we try to make as user-friendly as possible. We will be restructuring our product cards into this direction in the near future, where we will likely keep the ilks just as ‘tags’. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8352272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Frank_Brinkkemper",
                    "index": "#17",
                    "likes": "2",
                    "time": "03/05/2022-13:24:17",
                    "content": "Let me be clear: I think it is going to be very helpful for anyone integrating with the Maker protocol to have these ‘human readable names’. However, I do not think it is going to work from the Maker perspective to standardize these names in a way that will suit all the integrators. If customers are more used to a certain term because the rest of DeFi/Tradfi is using that term, than it is much easier for UIs to quickly change it, rather than to push MakerDAO to update the naming. However, again, I think this will be really helpful, especially with new more complex ilks that will be introduced, to communicate about them to the broader audience in a more clear way of what it is trying to achieve. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.032301032301033
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#18",
                    "likes": "1",
                    "time": "05/05/2022-08:07:51",
                    "content": "    LongForWisdom:  I mgiht exclude ‘Vault’ from this. “DAI Arbitrage” by itself seems a little meh though. DAI-USDC Exchange? DAI-USDP Exchange? Exchange Vault? etc.   I wanted to use the Product Type “Vault” for every technology that a user B2C or B2B can interact with. I explicitly did not call the DAI Direct Modules “DAI Direct Vaults” as D3M tech is a protocol2protocol (machine2machine) integration so with Module and Vault I try to differentiate that “Vaults” are for users (through UI, programatically/bots) and “Modules” are protocol2protocol (smart contract to smart contract). That’s my reasoning to keep Vault when communicating D3Ms.     LongForWisdom:  Fixed rate is maybe misleading for D3M’s as we change the target rate semi-regularly (or have in the past.) Maybe “Rate Targeted” versus “Fixed Rate”? Honestly, naming conventions are less important for D3M’s as they are not directly customer facing. On balance I would just keep it as ‘Aave D3M / Maple D3M’ etc. Some of these are a little long to be convenient as well.   The key difference here is that Maple D3Ms are just a credit line to Maple pools. We fill up the pools up to DC as needed, we are not calculating a target APY on Maple, but a target Pool Liquidity. Aave D3Ms aim to provide a stable borrow rate for Aave DAI users. So the way the D3Ms work and the benefit are different. We could go for “D3M Stable Rate” and “D3M Credit Line”.     LongForWisdom:  I would probably not refer to the PSM product type as ‘Vault’ at all, in practice it’s a completely different product to everything else we are calling a vault.   It is a tricky one, agree, but my reasoning is that it is a end-user tech (B2C, programatically/bots) vs a D3M which is protocol2protocol only. I agree PSM’s collateral are not user specific, it is just a mix of all collateral anyone has ever arbitraged, but that doesn’t change the fact that any DEFI user can interact with it, where D3M are permissioned protocol2protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.232473544973545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#19",
                    "likes": "0",
                    "time": "04/08/2022-14:08:29",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}