{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-direct-end-game-party-delegate-compensation-to-runes-wallet/15856",
            "title": "[Informal Poll] Direct End Game Party Delegate Compensation To Rune's Wallet ",
            "index": 15856,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll",
                "compensation",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#1",
                    "likes": "3",
                    "time": "16/06/2022-19:02:53",
                    "content": "@rune has stated that delegates who want his MKR must vote the way he instructs them in his meetings. Because these delegates will be taking their direction from Rune, they will not be performing any work aside from receiving instructions and submitting vote transactions. It is unfair to Rune, who is doing all of the decision-making work to direct compensation to these delegates. This signal asks that any delegate compensation to End Game Party Delegates be sent to a single address of Rune’s choosing. Pros Pays the person making the decisions and doing the work Cons Delegates may not be willing to join End Game Party to secure pay    Should Delegate Compensation For End Game Party Delegates Go To Rune?  Yes No Abstain     0 voters     This poll will end 2022-06-23T04:00:00Z. If it is successful, it will go to an on-chain poll for MKR holders. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-16-22-2022/15999",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-16-22-de-junio-del-2022/16204"
                    ],
                    "GPT-summary": "The post is an informal poll proposing that delegate compensation for End Game Party Delegates be sent to a single address of Rune's choosing. The author explains that since Rune is doing all the decision-making work, it is unfair to direct compensation to the delegates. A 3rd party gives constructive criticism by pointing out that this proposal may discourage delegates from joining the End Game Party. The post also includes a poll and a deadline for the poll.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.449404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "6",
                    "time": "16/06/2022-19:22:38",
                    "content": "Don’t think this was intended as a serious signal @Ippy, if it’s intended as satire I will remove it from the signal category to keep it from getting cluttered. If it is serious some things you need to consider/define:  What makes someone an “End Game Party Delegate?” Does this apply to the full compensation for each delegate, or are they entitled to keep compensation they earn as a result of MKR delegated to them from other MKR delegators? Is this intended as a reoccurring/long term proposal? If yes, then it needs to be a MIP/MIP61 amendment. Our recommended signal time is two weeks, no urgent need has been presented to only run this signal for one week.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.298611111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ippy",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/06/2022-19:26:34",
                    "content": "    prose11:  End Game Party Delegate?”   Serious. There’s a thread where delegates self declare. It’s meant to be all of it since all of the MKR those delegates control is being directed by Rune. Indefinite but not permanent. Is 2 weeks required or recommended? I think delegates should know immediately if they will forfeit pay before getting deeply involved with Rune’s party ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 3.7777777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "2",
                    "time": "16/06/2022-19:30:36",
                    "content": "Sounds like you’re looking to modify MIP61, which would be a MIP not a signal request. Happy to help you with the drafting if you need it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "0",
                    "time": "16/06/2022-19:33:18",
                    "content": "Changing this to an informal poll - please feel free to discuss and vote, but know regardless of the voting no on-chain outcome will take place. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Katie",
                    "index": "#7",
                    "likes": "1",
                    "time": "16/06/2022-21:28:51",
                    "content": "What if one of the current delegates, such as @JustinCase becomes an End Game Delegate, would they not be compensated?  This doesn’t make sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#8",
                    "likes": "3",
                    "time": "17/06/2022-01:19:19",
                    "content": "It is just a troll post – unfortunate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "17/07/2022-11:20:13",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}