{
    "poll_list": [
        {
            "title": "Ratification Poll for Amend Interim Facilitator Appointment Process (MIP4c2-SP30) - February 13, 2023",
            "index": "18951",
            "option": "Yes",
            "supporting_mkr": "72,618",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip4c2-sp30-amend-interim-facilitator-appointment-process/18951",
            "title": "MIP4c2-SP30: Amend Interim Facilitator Appointment Process ",
            "index": 18951,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "cu-offboarding",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "11",
                    "time": "28/11/2022-15:21:04",
                    "content": " MIP4c2-SP30: Amend Interim Facilitator Appointment Process  Preamble MIP4c2-SP#: 30 MIP to be amended: MIP41 Author(s): @LongForWisdom Contributors: @Patrick_J Tags:  Status: Accepted Date Proposed: 2022-11-28 Date Ratified: 2023-02-27 Ratification Poll URL: https://vote.makerdao.com/polling/QmSYNed5   Specification  Motivation The existing Interim Facilitator process has proved to be less than ideal when applied. Primarily the issues are:  Lack of speedy resolution - If the initial process fails, the Fallback Process takes at least one week. While this doesn’t sound like a long time, it has the potential to cause major issues depending on the circumstances. Inflexibility - The existing process does not readily allow for modifications in processes by the Governance Facilitators in the event the circumstances are atypical.  This change should be valid for an amendment as the changes are limited in scope to a single process defined completely in MIP41. This change should not impact any other MIPs.  Amended MIPs and Components  Amended MIP41c3 - Minor fix of wording to clarify that Governance Facilitators determine whether any exercised Facilitator Governance Powers are related to the relevant Core Unit. Amended MIP41c6 - Now documents Interim Facilitator responsibilities and incentives more explicitly. Added MIP41c7 - Details the process used to appoint Interim Facilitators, and lists some edge cases and how to handle them.   Patch Notes Interim Facilitators  Limit the number of Interim Facilitators to one. This also limits the nominations to one. The incentive for acting as an Interim Facilitator is the compensation that would have been due to the Facilitator. Having multiple Interim Facilitators creates ambiguity around how this incentive is managed. In practice, the Interim Facilitator needs to act as a contact with governance and decision-maker, these requirements do not require more than a single Interim Facilitator. The maximum time an Interim Facilitator can serve is two months, this can be extended by a majority of Governance Facilitators at any time during the appointment via public communication of reasoning. This helps ensure that we never end up with a permanent Interim Facilitator. Interim Facilitators are now responsible for making a good-faith effort to find a permanent replacement (if the core unit is not being shut down.) Interim Facilitator compensation is more explicitly worded now: Equal to the previous Facilitator’s compensation (if it was publicly known) or 15,000 DAI per month.  Appointment Process  Gives Governance Facilitators more explicit power to modify the appointment process to suit circumstances. Voluntary offboarding Facilitators may nominate a single Interim Facilitator, which is immediately actioned. This is intended to reduce the period of uncertainty. Other Core Units may elect a willing Interim Facilitator within 72 hours of this automatic appointment. If they do so, the initial choice by the outgoing Facilitator is replaced. This gives other Core Units the power to override the outgoing Facilitator if they deem it necessary or prudent. Core Units get a single vote on each candidate, cast by agreement of the Facilitators of that Core Unit. This prevents the case where certain Core Units have more voting power than others and removes this incentive to onboard multiple Facilitators. If no Interim Facilitator exists after 72 hours, Maker Governance may onboard a Permanent Facilitator using the weekly process via subproposal disregarding feedback and frozen periods. If after one month, the core unit has neither an Interim Facilitator nor Permanent Facilitator, it is considered offboarded and its budgets revoked.  Edge Cases  Several edge cases are detailed in the MIP that I believe covers the most likely scenarios. Governance Facilitators are explicitly empowered to resolve edge cases that were not anticipated.  General Note on Governance Involvement  This change reduces the input Maker Governance has over Interim Facilitator selection in favor of speed and maintaining continuity. Empowering the existing Facilitators in this way should be safe given:  The power Maker Governance exercises over funds. A majority of Facilitators are honest actors. Interim Appointments are time-limited.     Amendment Pull Request   github.com/makerdao/mips         MIP41 Amendments to smooth out interim facilitator processes.   makerdao:master ← LongForWisdom:interim-facilitator-modifications              opened 03:51PM - 23 Nov 22 UTC                 LongForWisdom               +49 -27       Attached to: https://github.com/makerdao/mips/pull/712        Relevant Information Forum threads regarding the recent interim facilitator process at the CES-001 core unit: https://forum.makerdao.com/t/interim-facilitator-ratification-ces-001/18886 https://forum.makerdao.com/t/fallback-interim-facilitator-selection-process-ces-001/18911 ",
                    "links": [
                        "https://github.com/makerdao/mips/pull/711/",
                        "https://github.com/LongForWisdom",
                        "https://github.com/makerdao/mips/pull/711/files",
                        "https://forum.makerdao.com/t/interim-facilitator-ratification-ces-001/18886",
                        "https://forum.makerdao.com/t/fallback-interim-facilitator-selection-process-ces-001/18911",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/122",
                        "https://forum.makerdao.com/t/weekly-mips-update-125/19812",
                        "https://forum.makerdao.com/t/weekly-mips-update-124/19706",
                        "https://forum.makerdao.com/t/weekly-mips-update-123/19600",
                        "https://forum.makerdao.com/t/weekly-mips-update-122/19536",
                        "https://forum.makerdao.com/t/weekly-mips-update-121/19437",
                        "https://forum.makerdao.com/t/weekly-mips-update-120/19364",
                        "https://forum.makerdao.com/t/4-boletin-de-noticias-febrero-de-2023/20078",
                        "https://forum.makerdao.com/t/weekly-mips-update-118/19260",
                        "https://forum.makerdao.com/t/weekly-mips-update-117/19148",
                        "https://forum.makerdao.com/t/governance-and-risk-217-thursday-december-01-at-17-00-utc/18969/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-116/19059",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/34",
                        "https://forum.makerdao.com/t/weekly-mips-update-115/18956",
                        "https://forum.makerdao.com/t/weekly-mips-update-119/19289",
                        "https://forum.makerdao.com/t/weekly-mips-update-127/20001",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/41",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/46",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/46",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/99",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/18",
                        "https://forum.makerdao.com/t/weekly-mips-update-126/19881",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/41",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/61",
                        "https://forum.makerdao.com/t/coldiron-eth-delegate-platform/11193/162",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/51"
                    ],
                    "GPT-summary": "The post proposes an amendment to the Interim Facilitator Appointment Process, which aims to address issues with the current process, such as lack of speedy resolution and inflexibility. The proposed changes include limiting the number of Interim Facilitators to one, giving Governance Facilitators more explicit power to modify the appointment process, and detailing the process used to appoint Interim Facilitators. The post also includes information on edge cases and the general note on Governance Involvement. The post does not include any advertising or collaboration requests.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.623217960023515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "3",
                    "time": "28/11/2022-15:22:32",
                    "content": "@MIP-Editors: PRs are up on the github, please go ahead and assign numbers and add/modify any preamble as appropriate. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#3",
                    "likes": "0",
                    "time": "06/12/2022-14:00:04",
                    "content": "This is a summary of the contents of this subproposal and its impact, from GovAlpha’s perspective:  This is a valid MIP4c2 (Amendment Process for MIPs Older than 3 Months) subproposal. This subproposal amends MIP41: Facilitator Framework. Specifically, it adds MIP41c7: Interim Facilitator Appointment Process and amends the following components:  MIP41c3: Governance Facilitator Governance Powers MIP41c6: Interim Facilitators and the Fallback Decision Process   This subproposal modifies the nomination process for the Interim Facilitator. It reduces Maker Governance input in the Interim Facilitator appointment process in order to increase speed and maintain Core Unit continuity. The nomination process is as follows:  Faciliatators who are voluntarily offboarded may nominate their own successor without any Governance input. Core Units may override that choice by voting for an Interim Facilitator candidate within 72 hours. Each Core Unit has one vote and a simple majority is used to decide the winner. Should the above process fail, this subproposal allows for the submission of expedited MIP41c4 subproposals to appoint new permanent Facilitators.   This subproposal limits the number of Interim Facilitators to one, sets a two-month term limit for Interim Facilitators, and explicitly defines their compensation. The subproposal considers a number of likely edge cases and how to handle them. Governance Facilitators are explicitly empowered to resolve any other edge cases that may occur. This proposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-12-15 ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP41",
                        "https://mips.makerdao.com/mips/details/MIP41#MIP41c3",
                        "https://mips.makerdao.com/mips/details/MIP41#MIP41c6",
                        "https://mips.makerdao.com/mips/details/MIP41#MIP41c4",
                        "https://manual.makerdao.com/governance/off-chain/impact-estimations",
                        "https://forum.makerdao.com/t/weekly-mips-update-127/20001",
                        "https://forum.makerdao.com/t/weekly-mips-update-126/19881"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.21728650137741
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#4",
                    "likes": "0",
                    "time": "07/12/2022-17:01:11",
                    "content": "i think the “or 15000DAI” is alittle too high. to ascertain that the interim faciliator is acting out of good will it should be 50% of the previous faciliator’s remuneration subjected to an additional 50% based on timely replacement and performance determined by governance. This is to encourage finding a replacement on a timely basis, and not a “tyrant” on this position. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.866666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "1",
                    "time": "07/12/2022-17:19:12",
                    "content": "So, I think it’s important to keep in mind that the job is basically ‘do everything that the old facilitator was supposed to be doing, and fix (or at least mitigate) all the stuff they didn’t do the way they were supposed to in two months.’ It feels like a false economy to go cheap on this position, especially given the interim facilitator will likely get access to the CU budget as part of their work. I think I might be misunderstanding what you mean by ‘tyrant’ here. But assuming you mean something along the lines of ‘malicious dictator’ I think:  First that it’s unlikely that a tyrant would end up in the position, given that that would imply they’d been misjudged by a majority of existing core unit facilitators. If you’re assuming a majority of core unit facilitators are malicious, then you’re already screwed. Second, I don’t think changing the remuneration would impact the outcome if a tyrant was elected and gained control over a portion of the core unit funds (likely to be in excess of 30k.)  I would also say that I viewed 15k as a lower fall-back option in comparison to the facilitator remuneration in the case the remuneration wasn’t public. I would guess that most facilitators are paid in excess of 180k DAI per year. So in conclusion, maybe? I don’t think the change is worth the added complexity, but if others are in support of it, I can work it in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0390625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#6",
                    "likes": "1",
                    "time": "07/12/2022-17:26:20",
                    "content": "Tyrant more towards a person who refuses to leave the position. I understand there is a 2 month limit but still there is no encourage for the interim person to leave. I will still prefer to have the 50/50 compensation instated. Interim is appointed without the governance’s intervention already. it should be reasonable to make sure governance has a say in how well he does in finding the suitable replacement on a timely basis. TBH i would even go further to request for a performance review performed by a faciliator and made public for the governance to determine whether to even disburse the 50%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "1",
                    "time": "07/12/2022-18:30:13",
                    "content": "    fumoffuXx:  Tyrant more towards a person who refuses to leave the position. I understand there is a 2 month limit but still there is no encourage for the interim person to leave.   Just to address this, I think this case is covered?  If a permanent Facilitator has not been chosen before the expiry of an Interim Facilitator’s two-month term, the Core Unit is offboarded, and any budgets are revoked. A majority of Governance Facilitators may extend this time limit by stating publicly that they are doing so, and the reasoning for this decision.   If a new permanent Facilitator is onboarded to the relevant Core Unit through a MIP41c4 subproposal the Interim Facilitator is immediately offboarded and all powers and responsibilities are transferred to the new permanent Facilitator.  (both from the actual MIP text, rather than the summary here in the amendment) Basically, if they refuse to step down, then they stop getting access to any budget, and the DAO ceases to recognize them as the facilitator. There’s not really much else you can do when someone refuses to leave their position and has access to budget funds. That’s why budget funds are generally:  Streamed rather than transferred in one lump Controlled by at least a 2-of-2 multi-sig  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333585858585859
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#8",
                    "likes": "0",
                    "time": "07/12/2022-20:21:26",
                    "content": "Stoked to see these improvements so fast after the first usage of revised MIP41 n the wild.     LongForWisdom:  Just to address this, I think this case is covered?   agree, since adding a cap.     LongForWisdom:  It feels like a false economy to go cheap on this position,   +1 and as context when fleshing out the interim position: adding an actual incentive to the role was key. One of the biggest questions was “who the hell will sign up for this?” Interim facilitating was designed to be an additional job that you want to get off your plate as fast as possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#9",
                    "likes": "0",
                    "time": "13/12/2022-15:59:39",
                    "content": "is there a case where an interim  facilitator becomes perm? is this allowed? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "14/12/2022-12:13:09",
                    "content": "Only if they are voted into that position by MKR vote via an onboarding proposal. They don’t become permanent by default or anything like that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "2",
                    "time": "04/01/2023-11:09:47",
                    "content": "I’m going to hold this back til February to integrate some feedback that came in shortly before the holidays. I don’t think this needs to be rushed in. If anyone else has comments, please let me know in this thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "0",
                    "time": "11/01/2023-12:38:40",
                    "content": "I’ve made some minor changes to statement wording in response to feedback from MIP Editors. No material changes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "1",
                    "time": "07/02/2023-13:18:42",
                    "content": "I would like to formally submit this MIP for the March 2023 cycle. @MIP-Editors ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#14",
                    "likes": "1",
                    "time": "14/02/2023-02:36:55",
                    "content": "This proposal is currently being voted on. Its Ratification Poll will run from two weeks from 2023-02-13 to 2023-02-27. Please cast your vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1966"
}