{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/lower-eth-wbtc-stability-fees-to-reduce-usdc-reliance-and-attract-more-borrowers/17192",
            "title": "Lower ETH/WBTC stability fees to reduce USDC reliance and attract more borrowers ",
            "index": 17192,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "idea",
                "system-parameter"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mhonkasalo",
                    "index": "#1",
                    "likes": "8",
                    "time": "11/08/2022-21:38:41",
                    "content": "Introduction Due to Tornado Cash sanctions, recently there’s been increased discussion about the urgency to move away from USDC collateral. The most direct way MakerDAO has to incentivize borrowing using crypto collateral is by lowering stability fees. This is a superpower for Maker because it can undercut the competition and make borrowing attractive – and generally, this hasn’t been used enough as a tool for growth. Proposal idea Today, the relevant stability fees are listed below (by total supply) and in total generate  $15.4 million in stability fees annually:  ETH-C: 0.5%. WBTC-A: 2.25%. ETH-A: 2.25%. stETH-B: 0.75%. stETH-A: 2.5%. ETH-B: 4.0% WBTC-C: 0.75% WBTC-B: 4.0%.  My idea is that a subset of these would temporarily be set at 0%. This would push to the maximum the incentive MakerDAO has to promote these vaults and is a good test run in undercutting market rates. The goal would be to see some significant progress with regard to lowering the reliance on USDC. An alternative that could be discussed (needing input from the Risk CU) is lowering the liquidation ratios. A combination of lower liquidation ratios and 0% stability fees would be the most aggressive strategy. Concerns and replies Negative impact on protocol revenue:  Maker has ~80 million DAI in the surplus buffer, which is adequate runway for operations. Stability fees can always be raised if the tradeoff isn’t worth it. This makes it more important to bring in revenue from USTs to offset losses. Note, Maker’s unique value proposition is making it cheap to borrow – we should use this.  Unclear impact on borrowing interest:  If there’s an estimate/experience from previous experiences here, would be interested in hearing. In preliminary discussions, I’ve run into some skepticism on if this would have a material impact. In 2020, this has been tried with muted impact. It’s likely the market has changed since quite a bit since and there would be players jumping to get in at lower rates.  Next steps Open to feedback and suggestions. If there’s interest in the community, will start putting together a more formal proposal. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/10",
                        "https://forum.makerdao.com/t/reporte-financiero-07-2022-traduccion/17263",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-11-17-de-agosto-del-2022/17376",
                        "https://forum.makerdao.com/t/financial-report-2022-07/17194/3",
                        "https://forum.makerdao.com/t/financial-report-2022-07/17194",
                        "https://forum.makerdao.com/t/bajar-las-tasas-de-estabilidad-de-eth-wbtc-para-reducir-la-dependencia-del-usdc-y-atraer-a-mas-prestatarios-traduccion/17195",
                        "https://forum.makerdao.com/t/relay-semanal-09-15-de-agosto-del-2022/17353"
                    ],
                    "GPT-summary": "The author proposes to lower stability fees for a subset of crypto collateral to incentivize borrowing and reduce reliance on USDC. The proposal aims to undercut market rates and test the impact of lower fees on borrowing interest. Concerns about the negative impact on protocol revenue and unclear impact on borrowing interest are addressed. The author is open to feedback and suggestions and may put together a more formal proposal if there is interest in the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.1836419753086425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/08/2022-22:01:24",
                    "content": "Worth a shot for new vaults and potentially within a limited timeframe (30-90 days?) to test and analyze results? Other ideas to foster vault usage are listed below:  For new vualts: 0 SF and a one time mint fee (0.5 to 2%) For existing and new vaults: Reduced SF pricing for borrowed balances above XM (above certain threshold)  For the existing vaults, how would this proposal reduce the 3bn+ in the PSM USDC? I understand that the Collateral backing DAI would diversify but we dont know by how much vault usage would increase. It would be a 15M test that we might not be able to afford. Another option to reduce exposure and build the SB could be to add PSM fees when PSM balances exceed a certain percentage of DAI backing? My opinion:  In an ideal world this should be 10-25% but realistically today given the situation around 50%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907583487940631
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhonkasalo",
                    "index": "#3",
                    "likes": "1",
                    "time": "11/08/2022-22:05:15",
                    "content": "A couple of thoughts:  I like these additional ideas, the only issue is how quickly to get useful changes into production. Note the cost would be quite low given it could be evaluated on a week-to-week basis. Idea is that this drives more DAI minting →  downward price pressure → less need for PSM USDC to curtail >$1 demand.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.805555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#4",
                    "likes": "1",
                    "time": "11/08/2022-23:05:21",
                    "content": "@mhonkasalo i like your mental experiment for expansion, but at the same time I struggle for the why. Why are we so fixated to shift USDC reliance for Treasuries? Yes, it will improve our revenue profile, and reduce counterparty risk, but it won’t change regulatory risk by an inch - hence won’t improve the post Tornado era. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Roman_V",
                    "index": "#5",
                    "likes": "1",
                    "time": "11/08/2022-23:14:39",
                    "content": "There are obvious risks from having USDC in treasury, but also WBTC is not risk-free and still centralised. Ok stETH is just Lido with actual ETH staked on smart contracts, but what if Lido is also at some point converts to “the compliant ones”? The basically leaves DAI with only ETH being a really safe treasury asset. The point of DAI is to be as decentralised as possible, no? In my opinion the most regulation-resilient version of DAI was the one backed by ETH only (aka SAI). Don’t you guys think? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.757142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhonkasalo",
                    "index": "#6",
                    "likes": "0",
                    "time": "11/08/2022-23:19:18",
                    "content": "For the purpose of this proposal, I’m more trying to counter the concern that revenue loss will be unacceptable. We can operate with a view that there’s reasonable runway & improvements coming to that side. Understand that this path still includes keeping the regulatory risk of USDC/treasuries. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhonkasalo",
                    "index": "#7",
                    "likes": "0",
                    "time": "11/08/2022-23:20:29",
                    "content": "A couple of points:  WBTC can’t freeze assets (if I’ve understood correctly). While there’s centralization in WBTC & stETH, both could be considered still to diversify risk overall. It’s not impossible to me that these rate cuts would be exclusively be pushed to just the ETH vaults.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#8",
                    "likes": "5",
                    "time": "11/08/2022-23:25:14",
                    "content": " image1718×1038 80.4 KB  This isn’t the prettiest chart, but it was readily available and illustrates a point quite well. Data as of 6/6 This is the WBTC Maker Rate premium, as defined by the WBTC-A SF subtracted by the USDC borrow rate on AAVE V2, plotted alongside the Maker market share of stablecoins drawn against WBTC. WBTC-A directional rate changes are overlaid. The primary insight I gleaned from this is from the two rate drops mid 2021 and the subsequent 2 rate hikes toward the end of 2021: in both cases, it seemingly took the market months to react. So I’m afraid a trial that lasts a week or 2 would do nothing besides burn revenue for those weeks. Further, for WBTC and ETH vaults, we have about 45% market share (as defined by share of stablecoins drawn against those collaterals). If we vampired the entire market (not gonna happen), it would only ~double our crypto-backed DAI, so this move would likely only put a relatively small dent in our USDC dependence. And as soon as we turned SFs back on, the customers that moved over would likely leave (after ~3 months, of course haha). Realistically, I think the approach we should take to reducing USDC dependence is 2-fold:  Onboard a more diverse class of RWAs, including bonds. This plan is in motion but obviously stalled in the recent drama. Potentially swap out some PSM USDC for decentralized stablecoins (sUSD, LUSD if the price is right, etc), even if temporarily.  As always, my opinion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.233928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#9",
                    "likes": "1",
                    "time": "11/08/2022-23:27:47",
                    "content": "    lyt:  Potentially swap out some PSM USDC for decentralized stablecoins (sUSD, LUSD if the price is right, etc), even if temporarily.   Back in February @SebVentures was describing a ClearingDAO model for decentralized stablecoins to reinforce each other’s peg stability and compete against centralized government coin wrappers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mhonkasalo",
                    "index": "#10",
                    "likes": "1",
                    "time": "11/08/2022-23:31:53",
                    "content": "Thanks for the data. I think it’s reasonable to be skeptical given the past impact of lower rates on Maker relative to the market. It’s worth noting that it’s possible to increase the market size significantly, especially if the current positive ETH price trend holds and there’s a demand to borrow. Overall, I like the aggressive lower rates not just for getting more crypto collateral but as a growth strategy. I agree with both approaches you outlined – with the caveats that impact from those will (a) take a while as well and (b) for other decentralized stablecoins the amounts would be quite low. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.19724025974026
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#11",
                    "likes": "0",
                    "time": "12/08/2022-09:36:31",
                    "content": "I think if you truly want to incentivize vault usage, you have to pay users… So basically, you’d have to throw DAI or MKR at them… I’m not advocating for that. But I’d love to see PSM usage decrease and vault usage increase. The overall discussion is about how tight the peg has to be. If we need it to be sub 50bps then fatPSM™ is the only way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4017857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#12",
                    "likes": "0",
                    "time": "12/08/2022-15:33:39",
                    "content": "Is there any reason why we cant make the PSM more expensive at the same time? A 2% fee to buy Dai ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#13",
                    "likes": "1",
                    "time": "12/08/2022-17:37:10",
                    "content": "the peg would soften but adding a fee past a certain threshold (% of total DAI minted) would make sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.940476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#14",
                    "likes": "2",
                    "time": "12/08/2022-17:47:50",
                    "content": "I think threshold-based or tier-based (@MakerMan) fees do make sense for the PSM. If we were charging 1% fees to swap into DAI at this level (and 0 fees to swap back to usdc), the peg would become 1.00 - 1.01, which is acceptable imo. Would earn us some $ and also ensure dependence on usdc doesn’t grow (prob reduces). Maybe I’m neglecting something though ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#15",
                    "likes": "0",
                    "time": "12/08/2022-18:37:47",
                    "content": "Why not adding more centralize stables to the PSM (like BUSD) for decentralize the centralize problem (funny right?) and put fees on it (like be a kinda Curve Finance). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.726190476190475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#16",
                    "likes": "0",
                    "time": "16/08/2022-15:04:01",
                    "content": "Is this something that the SFCU would support and expirement with? I think it has potential for being a viable revenue stream while taking into consideration how exposed we can/want to be to USDC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}