{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-actual-expenses-vs-budget-november-2021-now-with-mkr-vesting/12358",
            "title": "MakerDAO Actual Expenses vs Budget - November 2021 (now with MKR vesting) ",
            "index": 12358,
            "category": [
                "Updates"
            ],
            "tags": [
                "expense-reporting"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "10",
                    "time": "23/12/2021-23:00:17",
                    "content": "All, Please see below for the November update of the monthly Core Unit expenses, including a rough forecast for the subsequent three months. As you can see from the below table, our DAI expenses have increased to $2.3M in November, or a $27.5M annual run rate. Onboarding the Deco, SAS, and Immunefi Security CUs, as well as delegate compensation increases our Dai burn by about  $300K or $3.6M annualized - though we are only forecasting a $150K increase in the monthly burn rate over the next few months due to offsets driven by non-recurring spend Growth had in November. Net, our total CU and delegate annual Dai burn is now $29.3M. Adding in estimated annual Oracle costs of $15.6M (Q1 estimate from Nik, annualized), brings us to an annual cash burn rate of $44.9M which is a $0.5M increase from last month. Gwei prices have started to stabilize and have decreased in December so there is potential for our Oracle burn to be lower than previously forecasted. As promised I’ve included a tab for the MKR vesting schedule (new tab) for every Core Unit and summarized the P&L impact incurred to date based on the vested price. To date this only covers Risk due to the 300 MKR retroactive payment approved by MKR holders. Link is provided at the very bottom if anyone would like to view the full vesting schedule and spreadsheets. Note - Oracle expenses are currently listed as cash flows  image2392×848 390 KB   image2259×234 39.2 KB   image809×453 46.7 KB  Full Details ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-budget-simulator-11-1-revenue-cash-flow-forecast/12364",
                        "https://forum.makerdao.com/t/maker-governance-review-2021/12478"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.978867623604465
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "31/03/2022-00:21:24",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}