{
    "poll_list": [
        {
            "title": "Ratification Poll for MIP14 Repeal (MIP4c4-SP2) - January 9, 2023",
            "index": "18533",
            "option": "No",
            "supporting_mkr": "75,097",
            "highest_fraction": 0.8
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip4c4-sp2-mip14-repeal/18533",
            "title": "MIP4c4-SP2: MIP14 Repeal ",
            "index": 18533,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "mips-amen",
                "impact-:-high",
                "mip14"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#1",
                    "likes": "5",
                    "time": "26/10/2022-22:49:25",
                    "content": " MIP4c4-SP2: MIP14 Repeal  Preamble MIP4c4-SP#: 2 Title: MIP14 Repeal Author(s): GFX Labs (@gfxlabs) Contributors: @PaperImperium Tags: Type: process Status: Rejected Date Proposed: 2022-10-26 Date Ratified: N/A Forum URL: https://forum.makerdao.com/t/mip4c4-spxx-mip14-repeal/18533 Ratification Poll URL: https://vote.makerdao.com/polling/QmQvR5vt   Motivation In an effort to simplify the growing body of DAO governance processes and policies, this subproposal repeals MIP14 in its entirety due to obsolescence. Originally passed in October of 2020, MIP14 outlines a generic procedure for DAI to be sent from the protocol to an Ethereum address. It does not appear to have ever been utilized, and the transfer of DAI for a number of purposes has typically been authorized through whatever governance action authorizes the activity financed by that transfer. Additionally, any subproposal under MIP14 would require a 4-week feedback period for sums between 10,000 and 100,000 DAI, and a 12-week feedback period for sums above 100,000 DAI. These thresholds make MIP14 impractical to use, but with no clear need for this MIP, repeal is favored over amendment.  Removed MIPs MIP14: Protocol DAI Transfer, in its entirety.  Removal Pull Request https://github.com/makerdao/mips/pull/734  Relevant Information  MIP14: Protocol DAI Transfer MIP14 Ratification Poll MIP14 Executive  ",
                    "links": [
                        "https://github.com/makerdao/mips/pull/734",
                        "https://mips.makerdao.com/mips/details/MIP14",
                        "https://vote.makerdao.com/polling/QmPuRP2c#vote-breakdown",
                        "https://vote.makerdao.com/executive/template-executive-vote-approve-october-2020-governance-cycle-bundle-october-26-2020#proposal-detail",
                        "https://forum.makerdao.com/t/weekly-mips-update-114/18875",
                        "https://forum.makerdao.com/t/weekly-mips-update-111/18610",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/38",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/33",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/36",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/151",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/39",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/13",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/42",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/87",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/117",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/50",
                        "https://forum.makerdao.com/t/weekly-mips-update-119/19289",
                        "https://forum.makerdao.com/t/weekly-mips-update-118/19260",
                        "https://forum.makerdao.com/t/weekly-mips-update-117/19148",
                        "https://forum.makerdao.com/t/weekly-mips-update-116/19059",
                        "https://forum.makerdao.com/t/weekly-mips-update-115/18956"
                    ],
                    "GPT-summary": "The post is a proposal to repeal MIP14, which outlines a generic procedure for DAI to be sent from the protocol to an Ethereum address. The author explains that MIP14 has never been utilized and is impractical to use due to its feedback period thresholds. The post includes links to relevant information and a removal pull request. The post does not include any third-party feedback or collaboration requests.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.7407407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#2",
                    "likes": "2",
                    "time": "27/10/2022-06:05:38",
                    "content": "hellos, to streamline this kind of MIP and to make it more concise. Can a collation of all MIPs which are obsolete be identified, explained with clear and concise narration with explanations for its/their obsolescence or deprecation be jointly included to this MIP? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/10/2022-10:42:55",
                    "content": "    fumoffuXx:  Can a collation of all MIPs which are obsolete be identified, explained with clear and concise narration with explanations for its/their obsolescence or deprecation be jointly included to this MIP?   That’s a great idea. Obsolescence, however, may be in the eye of the beholder for many MIPs. With this proposal, we simply wanted to continue pruning or amending outdated or unused MIPs that End Game began. A complete list of active MIPs can be found here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.37037037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#4",
                    "likes": "3",
                    "time": "27/10/2022-11:50:56",
                    "content": "Thanks for the proposal. It’s certainly good to see someone reviewing the existing MIPs for ongoing appropriateness. I will recommend against removing MIP14 in favour of amending the MIP to improve it instead. While it is true that MIP14 has never been used - this in itself is not a complete argument for the removal of a MIP or any other part of the Maker Protocol. With the removal of Signal Requests following the recent MIP16 amendment, there are now three ways to request funding from MakerDAO:  A MIP40 Budget subproposal. A Special Purpose Fund (MIP55). MIP14.  MIP14 fills a niche where a funding request does not fit into either of the first 2 categories and if it is removed, we may run into a situation where we would like to provide funding for something but have no defined governance process to do so. GovAlpha has recommended using MIP14 when approached for advice within the last few weeks. Of course, this is just an opinion; feel free to disregard it.     fumoffuXx:  Can a collation of all MIPs which are obsolete be identified, explained with clear and concise narration with explanations for its/their obsolescence or deprecation be jointly included to this MIP?   You may collate MIPs which are linked for removal; see the recent removal of the collateral onboarding MIPs as part of a set. But otherwise, the MIPs should be assessed individually. e.g. the Core Unit MIPs could be removed as a whole, but we wouldn’t allow the removal of, for example, Emergency Response Procedures and Delegate Compensation as a set. ",
                    "links": [
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/87"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.578373015873016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#5",
                    "likes": "2",
                    "time": "27/10/2022-15:45:28",
                    "content": "We support this general movement of bringing more simplicity and clarity to the Governance process. As a whole, MIPs are mounting in complexity and count, discouraging new participants. @Patrick_J  raises a good point:     Patrick_J:  With the removal of Signal Requests following the recent MIP16 amendment, there are now three ways to request funding from MakerDAO:  A MIP40 Budget subproposal. A Special Purpose Fund (MIP55). MIP14.    Is it best to repeal a MIP or amend it? The context may be a bit more contentious as we are hoping to streamline and limit the ways teams can get funding. It is my understanding that there is redundancy between MIP14 and MIP55, and MIP55 provides more accountability as it must be a transfer to a multi-sig. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.79250295159386
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#6",
                    "likes": "0",
                    "time": "27/10/2022-15:52:17",
                    "content": "    fig:  It is my understanding that there is redundancy between MIP14 and MIP55, and MIP55 provides more accountability as it must be a transfer to a multi-sig.   This is an important point to address. There is overlap, but Special Purpose Funds have a specific definition as well as requirements. Taking from MIP55:  The creation of the Core Unit Framework launched the initial building blocks for organizing work for the DAO. Facilitators define mandates that cover long-term work areas and a broad set of focus and responsibilities for the protocol to be secure and successful.(1) Since then, community members have uncovered a need for a framework that is particular to purposes:  Of high priority, yet narrow in scope. Receivers of Funds are accountable to their deliverables, but do not hold long term responsibilities like a Core Unit. The request is one-off or irregular.  This MIP can be used for situations like:  Protocol Audit Funding. Legal Reserves for the DAO. Gas Reserves for Oracles / Protocol Deployments. Funding a team that works independently of Governance. Funding DAO objectives with no existing Core Unit or Facilitator.  Special Purpose Funds should be used infrequently. This MIP should NOT be used for:  Grants. Teams with long term objectives that should be Core Units. Vesting or DAO Mandated Actor / Contributor compensation.   There has, at times, been a perception that SPFs are a “generic money request” tool - which is untrue. In fact, they are a specific tool. The generic tool is MIP14. There may be a valid situation where someone wishes to request funding that the DAO wishes to provide, but it does not meet the requirements of an SPF, and MIP55 is therefore inappropriate. That is where MIP14 is useful and why I don’t think it should be removed. It is a useful generic fallback option to have. That isn’t to say it couldn’t do with a freshen up. Many of the MIPs could do with some love. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.887148268398268
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#7",
                    "likes": "0",
                    "time": "27/10/2022-16:11:45",
                    "content": "Is there a case where funds would be sent without also needing a proposal to authorize their use? Currently funds are disbursed via standalone MIPs, budgets, and SPFs. If there is a realistic case where funds would be sent, but not require some other process to justify the sending, then we could explore amendment vs repeal. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.069444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#8",
                    "likes": "0",
                    "time": "27/10/2022-17:49:25",
                    "content": "    GFXlabs:  Is there a case where funds would be sent without also needing a proposal to authorize their use?   Not to my knowledge. But the point of MIP14 is that it provides a subproposal route for Governance authorization before distribution through an exec. I’m highlighting the unknown unknowns that we may wish to fund in future which don’t have a defined process. Ultimately, it may not be a big deal, and Governance is free to make the decisions it wants, but it’s nice to have MIP14 as an option for unforeseen circumstances IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#9",
                    "likes": "0",
                    "time": "28/10/2022-05:40:09",
                    "content": "Please provide various scenarios in which MIP14 will be activated in order for the community to decide whether it is obsolete or not ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#10",
                    "likes": "1",
                    "time": "28/10/2022-10:01:32",
                    "content": "The whole point of unknown unknowns is that we do not know what they are until they arise. But it isn’t hard to think of scenarios that don’t meet the MIP40 or MIP55 requirements. Whether or not these would be accepted by voters is another matter, but removing this MIP would leave these things without a defined process to follow at all:  Additional payment to a Contributor/Facilitator/Delegate/A. N. Other not otherwise covered by a budget - i.e. a bonus. Covering shortfall in a CU budget - i.e. the CU misses the submission window for budget proposals. One-off grants. A contributor who has been dismissed from a CU that wishes to escalate a request for (perceived) withheld pay directly to MKR voters.  Here are some real examples of previous requests for funding that would now be advised to use the MIP14 process, including one by a contributor to this proposal:  [Signal Request] One-time Payment to COM-001 to Cover Missing DssVest Funds [Signal Request] MakerMan Retroactive Delegate Comp [Signal Request] PaperImperium Supplemental Compensation Signal Request: MKR Pro-Rata Vesting Community Sentiment Poll  For the final example, I would have advised they could request the DAI value of the MKR through MIP14 if they wished. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-makerman-retroactive-delegate-comp/13051",
                        "https://forum.makerdao.com/t/signal-request-paperimperium-supplemental-compensation/10454",
                        "https://forum.makerdao.com/t/signal-request-mkr-pro-rata-vesting-community-sentiment-poll/17350"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#11",
                    "likes": "0",
                    "time": "28/10/2022-20:23:30",
                    "content": "Wouldn’t an SPF work for those purposes? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#12",
                    "likes": "2",
                    "time": "28/10/2022-20:27:55",
                    "content": "No. I’ve listed the requirements and the exclusion criteria for an SPF in this thread already. If SPF’s fit for these purposes, we would have advised them. To reiterate again, SPFs are not generic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#13",
                    "likes": "0",
                    "time": "17/11/2022-11:50:33",
                    "content": "This is a summary of the subproposal and its effects upon ratification from GovAlpha’s perspective:  This is a valid MIP4c4 subproposal. This MIP removal subproposal repeals MIP14 in its entirety. With the removal of Signal Requests following the recent MIP16 amendment, there are three institutional options to request funding from MakerDAO Governance: (1) MIP14, (2) MIP40c3: Adding/Modifying Core Unit Budget Process, and (3) MIP55: Special Purpose Fund. MIP14 provides a specific pathway for Governance authorization prior to distribution through an Executive Vote that differs from the other two procedures, namely by being a generic, unrestricted mechanism. This proposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-11-29 ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP14#resumen-corto",
                        "https://mips.makerdao.com/mips/details/MIP16#MIP16c1",
                        "https://mips.makerdao.com/mips/details/MIP40#MIP40c3",
                        "https://mips.makerdao.com/mips/details/MIP55",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.8410714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/frantic",
                    "index": "#14",
                    "likes": "0",
                    "time": "17/11/2022-15:10:27",
                    "content": "We need to define what these different types of funding requests are best used for. And I think the key thing is the DAO should what do the administration teams advise, which is look into the other protocols are doing and what they need to do to keep this up. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#15",
                    "likes": "2",
                    "time": "02/01/2023-15:40:46",
                    "content": "We would like to move this to formal submission. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#16",
                    "likes": "0",
                    "time": "13/01/2023-02:51:00",
                    "content": "This proposal is currently being voted on. Its Ratification Poll will run until 2023-01-23. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1875"
}