{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/getting-historical-data-without-an-archive-node/1163",
            "title": "Getting historical data without an archive node? ",
            "index": 1163,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/yaginuma",
                    "index": "#1",
                    "likes": "1",
                    "time": "22/01/2020-18:16:11",
                    "content": "Until recently, I’ve been able to use a free-tier of Infura.io to get historical data off the ethereum blockchain. Lately I’ve been using it to query my PIE balance in the DSR pot at various old blocknumbers (generally the end of each calendar day). I’ve also been calling the CHI value so I can reconstitute my total DAI in the DSR… Infura is now charging $250 per month for archive (old) data, so I’m somewhat stuck how to track this stuff. I’ve seen covalenthq.com has an API to call old blocks, transactions, and event logs, which I suppose I can use to track down DRIP events (good for getting CHI values), but that still leaves me unable to query my DSProxy PIE balance at older blocks… Is there some free/cheap alternative to get this data besides setting up an archive node? ",
                    "links": [
                        "http://covalenthq.com"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.271825396825397
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/01/2020-02:51:46",
                    "content": "Hi @yaginuma, There is other option out there, with a free-tier you could use AWS and there is a lot of tracking data available there. Azure also offer them, or Profiler on Github. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaginuma",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/01/2020-15:24:49",
                    "content": "Archive nodes go way beyond any free tier resource requirements. Fortunately, it looks like most of the data I want I can get via geth graphql: https://medium.com/ethereum-grid/exploring-ethereum-with-geth-graphql-and-grid-6df38f2a86c ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#4",
                    "likes": "0",
                    "time": "24/01/2020-16:08:54",
                    "content": "@yaginuma Hi again, Depend on what free tier you get. I have been able to start some Blockchain on AWS and cluster … Database and there is no limit almost but your wallet…   Database Cluster is the name of the cluster that holds the instances  Database Instances are the names of each instance in the cluster. By default, if you named the instances “mydb”, AWS will append the AZ to the name. So it would become “mydb-us-east-1c” for example.  Database Name is the name of the initial database that will be created within Aurora. Think database like where you will add tables and data. If you do not specify a Database Name, you will just need to create your own - which is likely what you want to do anyway  Ive done all of this with a free tier ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                }
            ]
        }
    ]
}