{
    "poll_list": [
        {
            "title": "Ratification Poll for Growth Core Unit Budget, GRO-001 (MIP40c3-SP37) - October 11, 2021",
            "index": "10228",
            "option": "Yes",
            "supporting_mkr": "71,203",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp37-growth-core-unit-budget-gro-001/10228",
            "title": "MIP40c3-SP37: Growth Core Unit Budget, GRO-001 ",
            "index": 10228,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "gro-001",
                "core-unit-budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "4",
                    "time": "08/09/2021-22:28:29",
                    "content": " MIP40c3-SP37: Growth Core Unit Budget, GRO-001  Preamble MIP40c3-SP#: 37 Author(s): @Nadia Contributors: Tags: core-unit, cu-gro-001, budget, dai-budget Status: Accepted Date Applied: 2021-09-08 Date Ratified: 2021-10-26   Sentence Summary MIP40c3-SP37 adds the budget for Core Unit GRO-001: Growth for November 2021 through June 2022.  Paragraph Summary This budget proposal covers a total of 8 months (November and December 2021 and H1 2022) to cover the remaining months until the end of the year and the first six months of 2022. Growth CU is requesting an eight months budget allocation of 2,208,484 DAI. 1,117,663 DAI will cover operations, and 1,100,000 DAI will cover the work we’ll do with our partners in the latest stages of the Growth Cycle (adoption campaigns, educational content, etc.). The remaining budget from the previous months (posted in our weekly updates at the beginning of each month) is deducted from the total of the current budget.  Motivation We are proposing this Core Unit Budget modification because Growth CU requires an operating budget to fulfill its mandate.  Core Unit Name Growth (GRO-001)  Q4-21 Focus (November and December)  Progression of our pipeline. The general outline of our traditional cycle consists of the following phases: Outreach → Initial conversations → Project formalization and commitment → Integrations support → Pre-launch growth → The partner Launch → Maintenance and growth. We want to focus on the 97 opportunities in the latest stages of the Growth Process cycle during this quarter (pre-launch, partner launch, and maintenance) which requires the “integrations and marketing” budget to execute the growth plans we created with our partners.   Chart1200×742 15.4 KB   As we have posted in previous weekly updates, there’s an interest from various companies to interact with the Maker Protocol but in a permission way (due to their compliance team, to operate with us, they need a company to KYC). We are exploring alternatives with our legal advisors and these companies’ compliance team to develop a product for these institutions (traditional institutions).   H1-22 Focus (January-June)   We have 612 leads to qualified and try to move them as opportunities into our pipeline, plus the progression of our open pipeline for H1. (During the beginning of each quarter, we will post the status of our pipeline).   Institutional vaults. We will be onboarding new institutions (crypto-institutions) into the Institutional Vaults product to increase the number of crypto-vaults with more than 200m DAI.   Multichain strategy. We will continue to include Dai in other chains and increase its utilization through new projects on those chains integrating and incentivizing Dai usage. Also, we will follow the protocol progress in terms of bridges and deployment in other chains to support its adoption and growth.   PSM and other collaterals. We will work with other projects/companies to develop partnerships when onboarding their token as collateral. The idea of these partnerships is to guarantee a long-term relationship and an agreement that benefits both parties.   Grants program. We want to promote the development of the Ecosystem, supporting and funding projects committed to innovating using the Maker Protocol as a medium. We want to motivate them to run projects that build technology or resources on the Maker Protocol. To support this initiative, we will be running an ongoing grants program and also partnering with ETHGlobal Hackathons.   Message Propagation. During the following months, we will look for different ways to propagate Maker’s voice through developing partnerships that will help us communicate Maker’s message.    Team Members The Growth team will consist of at least the following members during the next eight months: – Facilitator – @Nadia  -Full Time- – Contributors – @Jenn for North America and strategic partnerships -Full Time- @Lozadaluis12 for LatAm -Full Time- @joce_chang for Asia -Full Time- @Hajive for Europe -Full Time- @zxMori, Technical Integrations -Full Time- @MarianoDP , Growth strategy -Full Time- @Doo_StableLab for Asia -Part Time- @Gustav_Arentoft for Europe -Part Time- @nanexcool, DeFi advisor @tbd, operations  Combined November, December 2021 and H1 2022 Budget - November 2021 to June 2022   Contributors costs The Business Development contributors should feel persuaded toward behaviors that will support the Maker Protocol strategy. That’s why besides a base pay, each one of our BD persons will be under a compensation structure, a proactive process that forms goals around the account planning process and accounts for past performance/growth. The compensation structure follows these rules:  Two-quarters of goal achievement constitutes a 10% rise in their base Dai contribution. Not meeting goals results in base pay stagnation. Less than 50% of goal number achieved results in 0 bonus for the quarter. Bonus pay is determined as a percentage of base pay, and it’s relative to the goal number’s achievement. Bonus is capped at 100% of base pay.   Finance costs. To cover associated costs to legal advice and the enablement of all support applications. Direct operations costs. This item includes travel costs (for conferences and one offsite) and any software or tool needed to execute our job.  Buffer To support any contingency or opportunity that could appear, like a tier-one partner looking to execute a strategic action.  Integrations and Marketing When we are working with future partners, part of our job is to create a way to help that partner give more visibility to the new solution supported by the Maker Protocol. Sometimes the execution of that idea requires a budget for different purposes:   Educational purposes: When a partner wants to explain to their user/customer base about the new product, usually this is for creating content in a particular language oriented to a defined audience.   Marketing purposes: Budget for executing a marketing campaign to help our partner to expose the usage of the new solution.   Technical purposes: Some partners that are not part of the crypto ecosystem need specialized help to integrate the Maker protocol with their systems.    Budget Implementation Growth CU has a multi-signature wallet to administer the funds allocated to fulfilling the mandate. The details of this multi-sig wallet are as follows: Multi-sig Address: 0x7800C137A645c07132886539217ce192b9F0528e As we have fixed monthly expenses (contributor costs and the buffer) and variable quarterly expenses (Finance costs, Direct operations costs and Integrations and Marketing costs) we propose two parallel budget implementations, the streamed payment for the fixed monthly expenses and the manual implementation for the variable quarterly expenses:   942,663 DAI will be streamed to 0x7800C137A645c07132886539217ce192b9F0528e starting 2021-11-01 and ending 2022-06-30 at a rate of 117,833 DAI per month.  For the total Variable expenses for eight months = 1,265,821 DAI, the budget implementation is manual and paid at the beginning of each quarter. Because our quarterly schedule is misaligned, the first payment should be included in the first executive of November and the second payment should be included in the first executive of April (In the event of the first executive of the month failing to pass successfully, transfers should be included in the next available executive vote), for each executive these are the payments to be done:   791,138 DAI will be transferred to 0x7800C137A645c07132886539217ce192b9F0528e on 2021-11-10  474,683 DAI will be transferred to 0x7800C137A645c07132886539217ce192b9F0528e on 2022-04-06  ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517",
                        "https://forum.makerdao.com/t/weekly-mips-update-54/10398",
                        "https://forum.makerdao.com/t/weekly-mips-update-53/10310",
                        "https://forum.makerdao.com/t/weekly-mips-update-55/10539",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982"
                    ],
                    "GPT-summary": "The post is a proposal for a budget allocation for Core Unit GRO-001: Growth for November 2021 through June 2022. The proposal covers the remaining months until the end of the year and the first six months of 2022. The Growth CU is requesting an eight months budget allocation of 2,208,484 DAI. The proposal outlines the focus of the team for Q4-21 and H1-22, team members, and budget implementation. The post does not contain any advertising or collaboration requests, but it explains the proposal in detail and provides information for third parties to give feedback or ask questions.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Board composition",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.189045055821372
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "5",
                    "time": "09/09/2021-00:19:17",
                    "content": "Hello @Nadia with regards to Integrations and Marketing–IMO, a breakdown of a seven (7) figure budget request is generally good. Can you please provide a breakdown? In my opinion, some MKR token owners/Delegates are in need of proposals that proactively break line items and headcount costs down for transparency. And this is for every CU Budget proposal, not just picking on Growth CU  , por supuesto! Also, with regards to the Grants program–normally–from my experience in volunteering at non-profits that depend on Grants to survive–they usually employ a small team to work full-time on such (some hire professional grant writers)  and the Grantor/foundation  also retains a full-time staff (like the Ford Foundation). So, I was wondering which of the Growth CU team members will focus on such, and do you think it will not interfere with their other duties? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.987847222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "1",
                    "time": "09/09/2021-17:58:15",
                    "content": "In terms of your second point about Grants program, that’s a good point that the grant process can be difficult. However, by narrowing down key focuses (and therefore quickly only choosing grant candidates that fit such criteria), grant process can be much quicker and efficient. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3580246913580245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#4",
                    "likes": "3",
                    "time": "15/09/2021-02:46:44",
                    "content": "Hey ElPro, I didn’t reply before because I wanted first to post the M-J-J quarter review to explain to everyone what we did with the budget assigned for “Integrations and Marketing” or how we are calling it now, “B2B activations”. For the first quarter, we were very conservative because we thought it was going to be a slow beginning but we close 33 opportunities where about 21% were T1 and T2 deals,. It’s hard to know how much we will spend on a T1 B2B activation because it depends on the possibilities we have with the partner (we are very creative but sometimes these T1s have a more conservative team…) and also their resources, as we don’t have a marketing team, for specific activations, it’s possible that we have to hire a PR agency to give us support. In our current pipeline, we have an important number of T1 deals to be closed, if institutional vaults and the TradFi strategy go well. And we want to be prepared to support those activations in the following eight months and also have a stronger brand presence, sponsoring various events in the following months. Regarding Grants, I agree with you, and it would be great to have a Grants CU. Meanwhile, we want to maintain Maker’s presence in the main hackathons and have a budget to support projects that want to create something using the Maker Protocol as part of their solution. Part of our mandate is to increase Dai’s distribution channels, and because of that, we are constantly discovering new projects with a lot of potentials. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.715340909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "3",
                    "time": "15/09/2021-13:38:41",
                    "content": "This is great feedback Nadia–thank you! The community, Delegates and I appreciate it. Pipeline is looking good–the expansion into Asia is happening–and I happy to see your CU make a push into hackathons. Thanks again! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 8.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#6",
                    "likes": "3",
                    "time": "05/10/2021-15:16:38",
                    "content": "Moving the proposal to Formal Submission ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/liberuum",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/11/2021-11:38:00",
                    "content": "As part of our broader effort to bring more transparency to the CU budget structure, we have documented the wallet setup of this CU and others;  1425×778 78.4 KB  Read more about it here: Introducing the CU Budget Transparency Map ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "77"
}