{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/fixing-the-peg-in-this-new-world-and-boosting-mkr-value-too/3170",
            "title": "Fixing the peg in this new world, and boosting MKR value too! ",
            "index": 3170,
            "category": [
                "Governance"
            ],
            "tags": [
                "alignment",
                "idea",
                "liquidity-mining"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#1",
                    "likes": "2",
                    "time": "10/07/2020-17:39:29",
                    "content": "Now that other DeFi protocols are paying for deposits, Maker will have to also pay MKR tokens to attract deposits and outcompete Compound, Aave and others who will be giving governance tokens to users of the protocol. The alternative is that these other protocols, including potential issuers of a Dai-like token, will outcompete Maker because depositors and borrowers are better off using other protocols. If MKR holders decide they do not want to see the peg drift up to $1.10 as deposits leave Maker for Compound, Aave and other protocols, they can start issuing MKR tokens to depositors. The downside is MKR won’t be deflationary. The upside is MKR tokens will accrue tremendous price increases anyway. ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining a proposal to fix the peg in Maker and boost the value of MKR tokens. The proposal suggests that Maker should pay MKR tokens to attract deposits and compete with other DeFi protocols. The post also mentions the potential downside of the proposal, which is that MKR won't be deflationary. A 3rd party could give constructive criticism of the proposal, extend to the proposal, or advertise the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.314867424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/07/2020-18:08:31",
                    "content": "MakerDao does not need to play the same game as COMP or AAVE.  These games are unsustainable and result in a loss of value.  Consider the following: COMP offers a supply rate of 1.7% on USDC right now.  If MakerDao had a PSM that traded Dai for USDC at some price over $1.00  MakerDao would profit immediately from the trade, reduce the price of Dai in the process, and could then loan the USDC out to people for 1% or any percent lower than COMP.  MakerDao profits again from the interest, increases the Dai supply, and at the same time because those people are going to take the USDC they get as a loan over to COMP to “farm” this will increase the supply of USDC over at COMP which will make their rates less attractive. My point is MakerDao is doing things right and these places like COMP are doing them wrong.  We don’t need to emulate poor behavior.  MakerDao should make prudent sustainable choices and simply take advantage of COMP and AAVE making these short sighted mistakes they are making currently. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0017006802721085
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/07/2020-18:19:15",
                    "content": "Maker is in the same game as all other DeFi protocols. The question is, will Maker play to win or to lose? Without collateral and loans, there is no Maker. Right now the economically rational decision for every last Vault borrower with ETH collateral is to pay off their vaults by transferring them to Compound. As they do this, it destroys Dai and increases the price of Dai. At some point Maker will be forced into global settlement. The question is, whether MKR holders want to see the value of their token go to zero, or do they want to use MKR to pay to keep collateral in the system? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.311507936507937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#4",
                    "likes": "0",
                    "time": "10/07/2020-18:29:38",
                    "content": "@IslandHunting There are better options that are more sustainable.  MakerDao can loan cheaper than these other systems and then if they want to further subsidize MakerDao loans more power to them throwing money out the window while MakerDao profits and they continuously hemorrhage money (or Dao equity in this case). Eventually the profit from these loans could even be used to circle back into paying vault holders to generate Dai like you are saying. Let’s look at ETH as an example:  You can take ETH to COMP and get .3% for it in interest as a deposit.  OR you can take it to MakerDao and borrow Dai for 0% then take the Dai to COMP and loan that out for 2.5% interest.  Which is better? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#5",
                    "likes": "1",
                    "time": "10/07/2020-18:36:25",
                    "content": "You haven’t addressed my point. Right now I can borrow from Maker at 0% interest rate on my ETH, or I can borrow from Compound and get paid more than 25% annually to borrow. It is economically irrational for anyone to deposit ETH into Maker and generate Dai when they can deposit ETH into Compound and borrow Dai or USDC and get paid for it. There will be no long-term for Maker unless it survives the short term. Maker should immediate begin distribution of MKR tokens into people with vaults who have created Dai. This will incentivize the creation of Dai and will restore the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#6",
                    "likes": "3",
                    "time": "10/07/2020-18:46:26",
                    "content": "Remember Bitconnect?  Listen to yourself.  COMP is paying you more than 25% annually to borrow money.  As a result most people are borrowing with leverage and the rates are variable on the loan.  Not only that, the payment you are using is in COMP which can also change value at any time.  This is a recipe for disaster for borrowers over there.  What do you want me to address?  I have already stated it is unsustainable. Hopefully those loans unwind easily I am not too familiar with how that goes over there, but I can tell you that even if you believe that what COMP is doing does indeed work and will last… (which it won’t).  That even if it could, it would still make sense to borrow from MakerDao first and take what you have borrowed to COMP to get the subsidies in pretty much every asset MakerDao decides to give loans in.  (right now that is only DAI). COMP borrowing is essentially a ponzi scheme is what I am saying.  Just be sure to get out before everyone else or you are going to have a bad time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.747710622710622
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#7",
                    "likes": "0",
                    "time": "10/07/2020-18:56:41",
                    "content": "In any market you pay for customer acquisition. That is what advertising is. This is what the Foundation did when it created MKR tokens and sold them to many of the same VCs that also own the majority of COMP tokens, often at a steep discount. This is not “Bitconnect” this is basic customer acquisition in the blockchain world. Of course yields will adjust over time, but that doesn’t matter for what the economically rational decision is today. Yes the loans “unwind” easily I think you can even migrate from Maker to Compound or back in a single transaction using third-party tools. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.101190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#8",
                    "likes": "1",
                    "time": "10/07/2020-19:07:46",
                    "content": "Customer acquisition only makes sense when those customers have a reason to stay.  COMP and AAVE will have no competitive advantage over other platforms especially MakerDao after the tokens they are giving away have plummeted in value.  Once this occurs the “customers” they have gained will simply leave to where the price is best like you are saying and that will be MakerDao.  The entire time these gimmicks are going on COMP and AAVE will be losing Dao equity and subsidizing MakerDao loans for free while MakerDao profits.  That seems fine to me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.057291666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#9",
                    "likes": "0",
                    "time": "10/07/2020-19:17:03",
                    "content": "I don’t think the slipping peg of MKR is “fine”. It was $1.12 a couple months ago, do you want to see that again? The peg has been broken for 4 months. Issuing MKR to restore the peg is the least that should be done. As I stated, it is uneconomical for anyone to open a vault today when they can get paid to borrow from other protocols. That is not “fine”, that is a big problem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#10",
                    "likes": "0",
                    "time": "10/07/2020-19:19:48",
                    "content": "Do you understand the feedback mechanism I am discussing where collateral exit from Maker to other systems with consequent Dai burn kills the Dai peg? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#11",
                    "likes": "0",
                    "time": "10/07/2020-19:23:57",
                    "content": "This has not been happening.  Just because you went to chase a ponzi scheme does not mean everyone else will do the same.  I linked you to this before already. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.390625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#12",
                    "likes": "0",
                    "time": "10/07/2020-19:37:42",
                    "content": "Actually the most rationale strategy right now is the following:  deposit ETH on maker, borrow Dai for 0% SF, deposit Dai on Compound, leverage Dai on compound by borrowing more Dai on compound and depositing, repeat until 2-3x leverage.   This is what all the COMP whales are doing right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.309523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#13",
                    "likes": "1",
                    "time": "10/07/2020-19:39:40",
                    "content": "Agree that pays more but makes it hard to sleep at night as you can get liquidated more easily than just supplying / borrowing ETH on Compound. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.427083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#14",
                    "likes": "0",
                    "time": "10/07/2020-19:40:39",
                    "content": "Compound and Aave are not ponzi schemes. They are on-chain lending protocols. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#15",
                    "likes": "2",
                    "time": "10/07/2020-19:42:46",
                    "content": "Right but wanted to point out that ETH CDPs are going way up right now on maker- they are not being closed down. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.39484126984127
                },
                {
                    "author_link": "https://forum.makerdao.com/u/IslandHunting",
                    "index": "#16",
                    "likes": "0",
                    "time": "10/07/2020-19:46:41",
                    "content": "Fair enough. I don’t think people should count on that trade continuing unless the Dai peg goes back towards $1. There is risk associated with borrowing in Dai when the peg is not well controlled. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#17",
                    "likes": "0",
                    "time": "10/07/2020-19:51:31",
                    "content": "Well if you don’t sell it, just deposit it on Compound to start leveraging, you should be able to get it back out again.  Even if the trade unwinds, there is excess Dai available for withdrawal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                }
            ]
        }
    ]
}