{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/amended-mip40-important-information-for-core-units/15450",
            "title": "Amended MIP40: Important Information for Core Units ",
            "index": 15450,
            "category": [
                "Core Units"
            ],
            "tags": [
                "mips",
                "budget",
                "core-unit",
                "core-unit-budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#1",
                    "likes": "11",
                    "time": "30/05/2022-16:38:06",
                    "content": " Amended MIP40: Important Information for Core Units  image1024×511 76.5 KB  MIP40, the MIP that defines the Core Unit Budget Framework, has been amended (see forum submission, successful Ratification Poll). This amendment has brought in substantial changes that will need to be considered when making a budget proposal. What follows is a summary of the main changes.  Main Changes  Budget Submission Windows This amendment introduced Budget Submission Windows. Budget requests (MIP40c3 subproposals) can only be submitted quarterly on: March, June, September, and November. (Note that there’s no December Governance Cycle.) This restriction applies both to ratified Core Units and to Core Units to-be, effectively keeping new Core Units from being submitted for ratification outside of the Budget Submission Windows.  Budget Start and End Dates Budgets have now a maximum duration of 12 months and cannot start later than three months after they have been formally submitted, i.e., budgets must satisfy these conditions:  Budget Start Date <= three months after Budget’s Formal Submission. Budget End Date <= Start Date + 12 months.   Budget Composition Budget requests are now required to be of higher resolution by specifying:  How revenue growth and/or the potential for improvement in operational efficiency will be increased. How the Core Unit could guarantee viable business if operating Bear/Superbear/Bull context. A timeline for specific deliverables. Etc.   Transparency, Return of Funds, Unwinding In the interest of increased transparency, budgets are now required to:  List expenses by time. Specify percentage of budget going to ongoing or one-time expenses. Disclose headcount. Include a variance analysis in the case of budget increases greater than 10%. Etc.  Additionally, Core Units are now required to return all funds (with qualifications) in excess of three months of budget. For more details please see MIP40c4. They must also define how they are to be wound down in the event of a Governance vote to defund them, with accompanying rationale (period, use of funds, return of funds). See here.  MIP40c3 Subproposal Parameters Ratification Polls for MIP40c3 subproposals no longer use binary voting; instead, they now use ranked-choice voting—specifically they provide these options:  A: Approve existing budget only (business as usual). B: Approve increased budget. C: Reject budget. D: Abstain.   We will soon be hosting a Know Your MIP public call to discuss about this amendment. Date is to be confirmed. We have identified some areas that need clarifications and are planning on posting a MIP4c3 amendment in the near future. For any questions/comments please reach out to me, @blimpa, or @sebix. CC: @Core-Facilitators ",
                    "links": [
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
                        "https://vote.makerdao.com/polling/QmXVjbWG#vote-breakdown",
                        "https://mips.makerdao.com/mips/details/MIP40#MIP40c3",
                        "https://mips.makerdao.com/mips/details/MIP51#MIP51c4",
                        "https://mips.makerdao.com/mips/details/MIP40#return-of-funds",
                        "https://mips.makerdao.com/mips/details/MIP40#unwinding-and-defunding",
                        "https://forum.makerdao.com/t/know-your-mip-kym-11-mip40-core-unit-budget-process-friday-june-10th-16-00-utc/15662/4",
                        "https://forum.makerdao.com/t/weekly-relay-may-24-30-2022/15488",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-26-june-01-2022/15569",
                        "https://forum.makerdao.com/t/relay-semanal-24-30-de-mayo-de-2022/15594",
                        "https://forum.makerdao.com/t/governance-and-risk-198-thursday-july-07-at-17-00-utc/16370/3",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-06-03/15600",
                        "https://forum.makerdao.com/t/know-your-mip-kym-11-mip40-core-unit-budget-process-friday-june-10th-16-00-utc/15662",
                        "https://forum.makerdao.com/t/weekly-relay-june-14-20-2022/15950",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-junio-del-2022/16062",
                        "https://forum.makerdao.com/t/mip40c3-sp80-modify-govalpha-core-unit-mkr-budget-q3-2022/17164"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.848605098605098
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "11",
                    "time": "30/05/2022-16:47:16",
                    "content": "Wanted to add a note that we are enacting a Grace Period for Budgets posted to RFC for the June Cycle before these MIP40 amendments passed. For this upcoming June cycle, MIP40 Budget Proposals will not need to adhere to these new requirements in order to be put up for vote. With that said, the start of the frozen period isn’t until Wednesday and proposal authors may wish to consider the support for this amendment from MKR holders when making their final edits. For proposals going forward GovAlpha and Strategic Finance will be working together to ensure compliance and assist proposal authors. EDIT: The grace period for the submission window will be extended until September to account for existing CUs with budgets set to expire before then, and newly applying CUs who may have budgeted for a sooner submission window. All new budgets should comply with other aspects of the MIP40 amendments, but GOV-001 and SF-001 will work with authors to help achieve this goal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.284090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#4",
                    "likes": "1",
                    "time": "30/05/2022-18:32:55",
                    "content": "    Gala:  (see forum submission ,   I have read all of this, but did not find the answer I am looking for so hopefully somebody can help here. In the discussion thread it is stated that the following should happen once a quarter: Month 1: Design of the budget Month 2: RFC in forums Month 3: Governance Cycle and Vote Beginning Month 4: Effective Is Month 3 the month that now is locked to be March, June, September, or November? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#5",
                    "likes": "4",
                    "time": "30/05/2022-19:04:15",
                    "content": "    sorenpeter:  Is Month 3 the month that now is locked to be March, June, September, or November?   Yes that is correct. An example March governance cycle would look like: Through to end January: Design of budget proposal Beginning February: Post on Forums for RFC in submission window Beginning March: Formal submission March: Vote April: First effective date ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#6",
                    "likes": "1",
                    "time": "01/06/2022-10:16:50",
                    "content": "@prose11 Our mandate ends end of July but we have not scaled the team as much as planned given the delays on Maker and Starkware side. Hence we have enough funding until early September. Are those changes already in effect? Which would mean we would need to submit a MIP by end of June? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.984375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#7",
                    "likes": "3",
                    "time": "01/06/2022-18:16:19",
                    "content": "Hey Louis, thanks for bringing this up. Looks like you wouldn’t be the only one affected by this gap either, and there are incubating Core Units that would have to readjust too with such a narrow grace period. After talking with @strat-fin-core-unit, we’re making the call to extend the grace period for budget submissions until September. This will give applicants time to try out the new format without waiting longer than they might have been anticipating when making their budget plans for this year. So any new budget applications should follow the new guidelines, but GovAlpha and Strategic Finance will work with applicants during the grace period rather than enforcing the letter of the changes to the most strict degree. If there are questions, comments, or concerns I encourage them to be aired in this thread, though my DMs are always open if clarification is being sought before making a public post. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458677685950413
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#8",
                    "likes": "3",
                    "time": "01/06/2022-18:33:28",
                    "content": "To be honest, this illustrates the point that changes like this should not be immediately implemented as a MIP and have an in-flight test run. It would have been better to start with an experiment for a few CUs, iron out the wrinkles and then move to MIPifying it when it’s clear the procedure works. This is a general comment: imo we’re over-using the MIPs for things that could be done just as part of operations. You write it in a MIP, it’s official procedure, including the bugs. Now it’s just interpretation. Not meant as criticism to anyone in particular. Just an observation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.013888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#9",
                    "likes": "0",
                    "time": "01/06/2022-20:07:55",
                    "content": "The changes are not substantial enough to warrant a drawn out procedure. We can and should make further changes as needed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#10",
                    "likes": "0",
                    "time": "01/06/2022-22:23:51",
                    "content": "    prose11:  After talking with @strat-fin-core-unit, we’re making the call to extend the grace period for budget submissions until September.   As much as I appreciate granting exceptions (I’be been voicing the shortcomings of this proposal for some time, and this would definitely benefit me) I disagree with the very principle and precedent we’re establishing. We have literally created a rule that makes harder the onboarding or modification of budgets for core units, and then we grant exceptions for existing core units. This might be seen as core units hoarding power, instead of creating the open community we want. Change the rules, not the ruler. I propose to create an SPF to cover for the missing funds to bridge those Core Units instead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "3",
                    "time": "01/06/2022-22:46:53",
                    "content": "Definitely appreciate the viewpoint and it’s a decision I struggled with, but I think providing an extended grace period is the most prudent decision given the circumstances. Some key points:  The exception is not just being made for existing CUs, but for new applicants as well. The proposal author did not intend to immediately put a stop to Budget requests until September, and was under the impression that the grace period lasting until September was already codified. MIPs often have incomplete components and undefined processes attached to them that aren’t fully apparent until someone tries to use them. Despite attempts from GovAlpha to get more feedback on this process, the direct conflict of these issues were not addressed during the RFC period. MKR holders retain the right to vote down any budget requests before September if the budget submission window was a key factor to their MIP40 amendment support. Doing a stop gap measure guarantees at least 2 votes would need to take place and that outside parties would need to get involved (SPF structure) or the further eroding of the intended Signal process would need to take place.  Governance has a duty to facilitate community proposals. If a mission critical core unit was left without a budget due to this unintended issue we would be forced to make an exception. Rather than apply a narrow exception window that favors entrenched Core Units, this solution was selected to apply the rules fairly and give the community time to figure out the impact of the recent amendments. I welcome further discourse on this subject, and hope this provides a little clarity on why this grace period was put forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.295645326895326
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "1",
                    "time": "01/06/2022-23:10:10",
                    "content": "    prose11:  MKR holders retain the right to vote down any budget requests before September if the budget submission window was a key factor to their MIP40 amendment support   3F Delegate has indicated that we will continue to support applicants who’s budget request do not meet the MIP40 standards (assuming 3F delegate supports the budget request). Hopefully by September more CU teams will have grasp the details necessary to submit a proper MIP40 application.  image1468×600 138 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.525132275132275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#13",
                    "likes": "0",
                    "time": "02/06/2022-04:23:53",
                    "content": "Thank you elpro ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#14",
                    "likes": "1",
                    "time": "02/06/2022-13:28:54",
                    "content": "    flipflopflapdelegate:  3F Delegate has indicated that we will continue to support applicants who’s budget request do not meet the MIP40 standards    This is great, @flipflopflapdelegate. Unfortunately, GovAlpha would stop the proposal (this is a feature) before you can even support it. The alternative would be to create an ad-hoc MIP for every new budget. This might make it harder to manage (a bit like the dozen MIPs we have to onboard RWA, instead of a subproposal of some MIP).     prose11:  the direct conflict of these issues were not addressed during the RFC period.    They were not. But the amendment was voted in. And ideally, we define and follow governance processes that help us. I was thinking about fixing the amendment instead of using exceptions, but I won’t volunteer to do it, so I’ll shut up (for) now. In any case, the exception is welcome and we’ll be using it. Thanks, all. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4602272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#15",
                    "likes": "0",
                    "time": "02/06/2022-13:34:58",
                    "content": "Agree with this approach - test in an environment with less downside or severity. Identifying a few CUs to pioneer this amendment seems fitting. Looks like most will defer to relying on the extension for the grace period. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#16",
                    "likes": "1",
                    "time": "02/06/2022-14:55:49",
                    "content": "For high-impact MIPs or initiatives this approach makes sense but let’s not brew a storm in a teacup. We are happy to help as much as we can in a transition to new reporting requirements (save the date for a train-in call) but some Core Units have already been able to adapt their requests to the new format. There may well be other changes necessary and we should adapt this and any other MIPs accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.951704545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#17",
                    "likes": "0",
                    "time": "08/06/2022-02:36:51",
                    "content": "The Know Your MIP public call is set! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}