{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/content-production-update-end-of-year-review/12275",
            "title": "Content Production Update - End-of-Year Review ",
            "index": 12275,
            "category": [
                "Core Units",
                "Core Unit Archive"
            ],
            "tags": [
                "cu-update",
                "archive-mkt-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#1",
                    "likes": "6",
                    "time": "17/12/2021-22:44:29",
                    "content": "Greetings from the Content Production Core Unit! Rather than stick to our bi-weekly schedule, we decided to wait an extra week since this will be the team’s final (official) work week of the year, so this update covers the last three weeks instead of two. We’ve also included a longer update reflecting on the team’s accomplishments over the past year and discussing what we’re looking forward to in 2022.  Administrative Updates The team was obviously disappointed to see the recent offboarding proposals and have reached out to GovAlpha and a number of delegates to discuss the systemic issues associated with the lack of specificity around how offboarding proposals should be handled and the opportunity for individuals to use sock puppet accounts to disrupt Core Unit operations. We were glad to see the conversation around these issues during this week’s G&R call and look forward to more progress in the coming year.  Content Production 11/26 - 12/16  Video   Published  Monthly Governance Review: October [Maker Relay] The State of Dai (11/23- 11/29) & (11/30-12/6) & (12/07 - 12/13)    Posted  MakerDAO | Forum At a Glance | December 9, 2021 Governance and Risk | Ep. 171 Maker Explorer #2 | Crossing the Carbon Chasm Meet Your Delegate | Ep. 8 Ft. ACREinvest MakerDAO | Forum At a Glance | December 2, 2021 Governance and Risk | Ep. 170     Explainer Videos How to Vote is now featured in the Voting Portal. Thanks to the DUX Core Unit for adding that! Check out the white button under the green buttons for New polling votes and New executive votes. We’re also working with the Ambassador team to create Spanish subtitles and eventually, Spanish-dubbed versions of explainer videos. The first draft of Governance Processes has been completed and after a round of feedback, we’ve decided to split the video from talking about Signal Requests, Governance Polls, and Executive Votes into one video about Signal Requests and MIPs and a separate video about Governance Polls and Executive Votes. The script for Liquidations is still being drafted.  Writing Want to read Maker Relay and Dai on Different Networks in your email? Sign up on Substack: https://makerdaoupdates.substack.com/.   Forum  Maker Relay Ep 73, Ep 74, and Ep 75 in collaboration with GovComms. Multi-Chain Dai-Lights - Nov 24, Dec 2, and Dec 9   Maker Governance Review: November in collaboration with GovComms.    Substack  Maker Relay Ep 73, Ep 74, and Ep 75  The State of Dai Ep 15 and Ep 16     We’ve also recently created templates for Tweets to help encourage more activity on both our MakerMegaphone and GovComms’ mkrgov Twitter accounts. Big thanks to @twblack for the inspiration there.  End of Year Review  tl;dr  48 Maker Relay newsletters  43 Videos syndicating updates 45 syndicated on Substack    23 Multi-Chain Dai-Light newsletters published  17 syndicated on Substack  Two Dune Analytics dashboards:   Dai-Curious (higher level financials)  Dai on Different Networks (tracks the movement of Dai through DeFi)      How to Vote is now featured in the Voting Portal Surpassed 20,000 unique monthly views of the MakerDAO Subreddit in November 80.75% increase in subscribers on Youtube   And more! Read on for details.  Core Unit Update As a new Core Unit, our initial strategy was to start broad by building a team to manage major types of content production, from writing and audio to design and video. Now that the team has had an opportunity to get off the ground, we plan to narrow in on what’s been working and work to fill some of the gaps the DAO has identified, most notably around press relations and marketing strategy. To reiterate our focus, we don’t believe the DAO is in a place where we can focus on product marketing but the DAO generates significant value by having a respected brand and community, so that’s where our focus lies. The holy grail for any marketing team is to be able to get to a point where they can point at campaigns and say “this effort cost X and resulted in Y sales and Z profits” and we would love to continue supporting the DAO in its efforts to get there. In the meantime, we focus on creating content that gives people the information they need to make better decisions for the DAO and reinforces our position as an innovator among DAOs, DeFi, and the wider blockchain ecosystem. Conducting brand interviews and onboarding legal expertise has helped us better understand the values of the DAO and the boundaries under which we operate and combined with the expertise each team member brings to the table, elevate the overall quality of content coming from the DAO. The situation with our most recent budget and the recent offboarding proposals have obviously affected the team’s productivity, most notably around our ability to hire new contributors, but we’re continuing to make progress where we can.  Newsletters  Multi-Chain Dai-Lights @alec’s Multi-Chain Dai-Lights (formerly Dai on Different Networks), started as a means of tracking Dai totals and integrations on emerging solutions. Thanks to feedback from contributors like @MakerMan, @flipflopflapdelegate, and @saludiego, however, it’s evolved to cover a greater variety of statistics and news across fifteen layer-1s, 2s, and side-chains. The first episode was published on July 7th and a total of 23 newsletters have been produced in 2021. Multi-Chain Dai-Lights receives an average of 558.13 views per episode in the Forum and 40.1 views on Substack. Episode 15, posted on December 2nd, is currently the most viewed post on Substack with 67 unique reads sent to a total of 44 subscribers. The series also led to the creation of two Dune Analytics dashboards:   Dai-Curious (higher level financials)  Dai on Different Networks (tracks the movement of Dai through DeFi)   Maker Relay The Maker Relay team produced a total of 48 newsletters in 2021.  Forum In the Forum, the episodes of Maker Relay published in 2021 received an average of 1088.42 views compared with 701.78 views in Q4 and an average of 32.0 views and five new subscribers on Substack. The most recent edition of Maker Relay, published on December 13th, has 106 views (as of Dec 14, less than 24 hours later) and last week’s episode has 362 views. Based on the increased view counts of older editions, it’s interesting to note that readers seem to be frequently referencing older publications. We’ll have to chat with GovComms about what we might be able to do to try and identify what older information people are finding value in.  Community Portal We look forward to releasing Community Portal 2.0 in Q1 2022. This new version will include updates to content in the “Learn” section to reflect the current state of the protocol and improved navigation in the “Resources” section. The team has been coordinating with GovAlpha on the transfer of content to their Governance Manual and the content will undergo a legal audit prior to publication.  Explainer, Promotional, and Informational Videos  Informational Updates  During 2021, the team has produced a total of 43 videos syndicating weekly updates from Maker Relay. These can be found in the Maker Relay Youtube Playlist. It’s worth mentioning that the team takes on the responsibility of posting videos for other teams. While this might not be rocket science, uploading videos involves writing copy, ensuring consistency in the video descriptions, and dealing with reduced internet speeds as your computer waits for the upload to complete, so there is a significant amount of time involved in completing a seemingly simple task. This process also includes organizing videos into playlists to make access to different types of content easier to access.  Governance and Risk Calls Issue Discussion Calls Maker Explorer Delegation Core Unit Pod Sessions & More   Explainer Videos As we mentioned in our regular update, How to Vote is now featured in the Voting Portal and will be included in GovAlpha’s Governance Manual. We’re also working with the Ambassador team on Spanish subtitles for this and coming videos as well as Spanish-dubbed versions of explainer videos.  Promotional Videos John and Jerry also did a fantastic job on the Wormhole promo video, turning it out in less than 24 hours and garnering 1200 views on Twitter and decent engagement on Reddit. The team is currently making plans to collect content at ETHDenver 2022. Much of this will be able to be used for a variety of purposes, including documenting MakerDAO’s presence at the event, exploring DAO-related topics, general interviews content that can be used for various purposes, and photography and short videos for social media.  Ambassador Program We’re excited to be reviving the Ambassador Program previously managed by the Maker Foundation with a pilot focused on Latin America. This is a community development effort aimed at generating translations of various types of content, meetups in different regions around the world, and coverage on localized social media channels. The Ambassadors have already provided the DAO with Spanish subtitles for the How to Vote explainer (click “CC” in the bottom-left corner and select “Espanol CC”) and we’re looking forward to collaborating to make more educational materials available to our Spanish-speaking community.  Social Media We’ve gotten off to a slow start on social media, mostly due to the ambiguity around the Maker Foundation’s transfer of assets to the DAO and the Dai Foundation’s management of those assets, but are still managing to make good progress in terms of finding helpful ways to syndicate content across Reddit, Twitter, and the Maker Forum. In November, we surpassed 20,000 unique views of the MakerDAO Subreddit and recently came up with some templates to help us post more regularly on Twitter while we look for a contributor who can take full-time responsibility for our efforts on social media.  2022 Here are some of the things we’re looking forward to in Q1 2022:  Launching Community Portal v2.0 Publishing the two Governance Processes videos and Liquidations explainer we’re working on and continuing to work with GovAlpha to prioritize explainers. Working with our Ambassadors to provide Spanish subtitles and dubbed versions of explainer videos. Working with our Ambassadors to translate Maker Relay, Multi-Chain Dai-Lights, Community Portal v2.0 and other content. Attending ETHDenver 2022, hosting a kick-off party, and organizing content production efforts at the event.  If your team will be attending ETHDenver and members are willing to do interviews, please reach out so we can get an idea of what topics we’ll be able to explore. Happy Holidays! ",
                    "links": [
                        "https://www.youtube.com/watch?v=ydUReeAZxBs",
                        "https://www.youtube.com/watch?v=cXWXHMmrGpU",
                        "https://www.youtube.com/watch?v=9VXJQba_FwM",
                        "https://youtu.be/e9E7NDumWQE",
                        "https://www.youtube.com/watch?v=PjfAEZHdLEw",
                        "https://youtu.be/Fe83Dnu0wFY",
                        "https://youtu.be/9z96VWDC_Eo",
                        "https://www.youtube.com/watch?v=gsTnRVsSXeI",
                        "https://www.youtube.com/watch?v=Oc51JgPekLA",
                        "https://vimeo.com/649207489",
                        "https://makerdaoupdates.substack.com/",
                        "https://forum.makerdao.com/t/maker-relay-ep-73/11882",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/maker-relay-ep-75/12187",
                        "https://forum.makerdao.com/t/multi-chain-dai-lights-november-24-2021/11817",
                        "https://forum.makerdao.com/t/multi-chain-dai-lights-december-2-2021/11982",
                        "https://forum.makerdao.com/t/multi-chain-dai-lights-december-9-2021/12134",
                        "https://forum.makerdao.com/t/maker-governance-review-november-2021/12000",
                        "https://makerdaoupdates.substack.com/",
                        "https://makerdaoupdates.substack.com/p/maker-relay-ep-73",
                        "https://makerdaoupdates.substack.com/p/relay-74",
                        "https://makerdaoupdates.substack.com/p/maker-relay-episode-75",
                        "https://makerdaoupdates.substack.com/p/the-state-of-dai-episode-15",
                        "https://makerdaoupdates.substack.com/p/the-state-of-dai-episode-16",
                        "https://makerdaoupdates.substack.com/",
                        "https://makerdaoupdates.substack.com/",
                        "https://dune.xyz/alec/Where-is-my-Dai",
                        "https://dune.xyz/alec/Dai-on-Different-Networks",
                        "https://vimeo.com/649207489",
                        "https://www.reddit.com/r/MakerDAO/",
                        "https://www.youtube.com/c/MakerDAO/videos",
                        "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150/4",
                        "https://forum.makerdao.com/t/a-look-at-dai-on-different-chains/9231",
                        "https://dune.xyz/alec/Where-is-my-Dai",
                        "https://dune.xyz/alec/Dai-on-Different-Networks",
                        "https://www.youtube.com/playlist?list=PLLzkWCj8ywWPolnUhRn_HWeZJX35PuT53",
                        "https://youtube.com/playlist?list=PLLzkWCj8ywWNq5-90-Id6VPSsrk4OWVan",
                        "https://youtube.com/playlist?list=PLLzkWCj8ywWNAhOTxODIUDF6YFkOA7TyG",
                        "https://youtube.com/playlist?list=PLLzkWCj8ywWN2X1Dxr3RmvXng0iaMJ-9V",
                        "https://youtube.com/playlist?list=PLLzkWCj8ywWPEWJ8UDT-1WD4pQ5UD3wzX",
                        "https://youtube.com/playlist?list=PLLzkWCj8ywWPf-GwmG9kXu5ggKE1fGw2s",
                        "https://www.youtube.com/c/MakerDAO/playlists",
                        "https://vimeo.com/649207489",
                        "https://twitter.com/MakerMegaphone/status/1460304829369126912",
                        "https://www.reddit.com/r/MakerDAO/comments/quo819/introducing_maker_wormhole/",
                        "https://vimeo.com/649207489",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-1-3-1-14/12693",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-december-2021/12692"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.739060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "3",
                    "time": "18/12/2021-15:15:45",
                    "content": "A great year for the Content and Production team, I didn’t miss any of your posts, more than complete all the information given. Much success in 2022 Much success in the ambassador program, in ETH Denver and everything you plant. My favourite CU! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/01/2022-15:16:38",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}