{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip71-huntingdon-valley-bank-collateral-block-exemption/14469",
            "title": "MIP71: Huntingdon Valley Bank \\xe2\\x80\\x9cCollateral Block\\xe2\\x80\\x9d Exemption ",
            "index": 14469,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "rfc",
                "mips",
                "rwa",
                "rwa-co",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#1",
                    "likes": "7",
                    "time": "05/04/2022-19:53:00",
                    "content": " MIP71: Huntingdon Valley Bank “Collateral Block” Exemption  Preamble MIP#: 71 Title: Huntingdon Valley Bank “Collateral Block” Exemption Author(s): @g_dip Contributors: @maxrealestate Tags: Type: Status: RFC Date Proposed: 2022-04-05 Date Ratified: <yyyy-mm-dd> Dependencies: MIP21 Replaces: None Forum URL: https://forum.makerdao.com/t/mip71-huntingdon-valley-bank-collateral-block-exemption/14469   References  MIP65: Project Clydesdale: HVBank Arrangement I: Liquid Bond Strategy & Execution MIP6: Huntingdon Valley Bank Loan Syndication Collateral Onboarding Application MIP70: Huntingdon Valley Bank Self-Contained Onboarding Strategy & Execution   Sentence Summary MIP71 exempts the proposed HVBank collateral onboarding and subsequent amendments to the MBPT (as outlined in the MIP6) from any MIP65-like collateral onboarding blocks.  Paragraph Summary MIP71 will exempt the HVBank collateral onboarding application from any limitations placed on Core Units by MIP65 or similar MIPs which impose such restrictions. If passed, the HVBank application will be permitted to continue through the existing collateral onboarding process undeterred.  Component Summary N/A  Motivation RWAC (on behalf of HVBank) seeks to provide a professional and stable onboarding experience to its clients. This MIP will achieve that by exempting the HVBank onboarding process from the instability of collateral/work blocks. This MIP is being proposed in tandem with MIP70: Huntingdon Valley Bank Self-Contained Onboarding Strategy & Execution in the hope that both MIPs pass and HVBank can progress in the onboarding process without concern and maximum flexibility.  Specification / Proposal Details By accepting this MIP, MKR holders will be exempting the HVBank collateral onboarding process from any MIP65-induced Core Unit work blockages. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
                        "https://forum.makerdao.com/t/mipxx-huntingdon-valley-bank-self-contained-onboarding-strategy-execution/14468",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
                        "https://forum.makerdao.com/t/mipxx-huntingdon-valley-bank-self-contained-onboarding-strategy-execution/14468",
                        "https://forum.makerdao.com/t/weekly-mips-update-85/14914",
                        "https://forum.makerdao.com/t/weekly-mips-update-82/14570",
                        "https://forum.makerdao.com/t/mip70-huntingdon-valley-bank-self-contained-onboarding-strategy-execution/14468",
                        "https://forum.makerdao.com/t/mip65-project-clydesdale-monetalis-arrangement-i-liquid-bond-strategy-execution/13148/58",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-84/14786",
                        "https://forum.makerdao.com/t/weekly-mips-update-83/14673",
                        "https://forum.makerdao.com/t/mip65-project-clydesdale-monetalis-arrangement-i-liquid-bond-strategy-execution/13148/79"
                    ],
                    "GPT-summary": "MIP71 proposes to exempt the Huntingdon Valley Bank collateral onboarding and subsequent amendments to the MBPT from any MIP65-like collateral onboarding blocks. The proposal aims to provide a professional and stable onboarding experience to its clients and achieve that by exempting the HVBank onboarding process from the instability of collateral/work blocks. The proposal details that by accepting this MIP, MKR holders will be exempting the HVBank collateral onboarding process from any MIP65-induced Core Unit work blockages.",
                    "GPT-proposal-categories": [
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/04/2022-22:53:31",
                    "content": "Reminder that this proposal will enter its Frozen Period in seven days, on Thursday, April 28 at 00:00 UTC. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}