{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-discontinuation-of-g-r-call-snippets/12978",
            "title": "[Informal Poll] Discontinuation of G&R Call Snippets ",
            "index": 12978,
            "category": [
                "Core Units",
                "Governance Communications"
            ],
            "tags": [
                "discussion",
                "com-001",
                "snippet"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "7",
                    "time": "01/02/2022-19:53:39",
                    "content": " G&R Call Snippets Many of you know that the Governance and Risk Call is hosted every Thursday. However, we understand that it is not always possible to attend them, which is why @gov-comms-core-unit focuses on providing everybody information presented and discussed during the call. We provide this information through both snippets and semi-transcription summaries.  Snippet’s Value Under Question? The G&R call has undergone multiple improvements towards its agenda. Today, the call consists of a comprehensive slide decks which are publically accessible through G&R Call posts on the forum. This slide deck can be viewed along with its footnotes and comments. The current agenda for a G&R Call goes as follows:  Votes and Polls Overview Weekly MIPs Overview Weekly forums Overview Core Unit and Team Initiatives Unique Team-Led Discussion Open Discussion (if time permits)  Topics in bold will almost always have prepared slides that help cover relevant information. Discussions do not usually contain slides because they are open and invite anybody to jump into the conversation. However, discussions are difficult to summarize in a snippet; personally, it feels fragmented and misses the main values of the entire discussion(s).  Discontinuing the Snippet I want to ask the community how many of you utilize the snippet posted right after the G&R call is finished? I am thinking to discontinue only the snippets for the following reasons:  All of the semi-transcription summary information repeat the Snippets. Most of the Snippet information, such as the slide deck, MIPs update, and Forum update, can be found on the forums beforehand. Snippets clutter the G&R Call threads and essentially take up significant space making the semi-transcription more difficult to locate. Snippets are live notes that take up valuable time, which can be used to improve the slide deck, be more active during the call, and be more helpful to the call host(s). (Personal) Snippets are prepared and completed right after the Forum at a Glance and right before (and throughout) the G&R call - I do not get much of a hiatus for about 4-5 hours.   Should @gov-comms-core-unit discontinue production of the G&R call Snippets?     Yes, discontinue the Snippets No, the Snippets are valuable and should continue Abstain     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-175-thursday-january-20-17-00-utc/12747/3",
                        "https://drive.google.com/drive/folders/1XJNR4SKnyWub5KfZpxEZ_UMaPQ0SmbQl?usp=sharing",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://forum.makerdao.com/t/forum-at-a-glance-jan-27-feb-3-2022/13019"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.789420175783812
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "4",
                    "time": "01/02/2022-21:40:20",
                    "content": "Hey man, this request is out of scope for this poll–but is there anyway you can post a bi-weekly status report of the Milestones (1 thru 6) for Q1, and Q2 as they move along? Thanks in advanced. Voted, No–I find them helpful–but if you believe you can use the resources/time for something more valuable/productive by all means… discontinue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "3",
                    "time": "01/02/2022-22:19:09",
                    "content": "Hey, are you asking for a bi-weekly update on specifically the content publications? I am currently revising many of the project’s workflows, scopes, and milestones, which I can add to the next GovComm bi-weekly update. I just want to emphasize that content publications do have a different scaling curve than something more quantitative and apparent such as Auction UIs or technical stuff other CUs are working on; there may be periods where a particular publication is ideal given current circumstances and/or meeting the project’s vision and wouldn’t need any near-term changes. But that’s the future, and right now I am in the process of revising most of these publications in one way or another. So, yes, it is a good idea to add a comprehensive update for all the publication projects in our next update. Circling back to the actual poll… what exactly do you find useful about the Snippets? Is it the timeliness, short summary style, etc.? Let me know. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9189958592132506
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "3",
                    "time": "01/02/2022-22:42:59",
                    "content": "    Artem_Gordon:  Circling back to the actual poll… what exactly do you find useful about the Snippets? Is it the timeliness, short summary style, etc.? Let me know. Thanks.   The short summary, reminds me of cliff notes that I used in college to refresh my comprehension.     Artem_Gordon:  Hey, are you asking for a bi-weekly update on specifically the content publications?   Sorry, I meant the CMON milestones, as well as the CMOFF milestones that David presented in last week’s G&R call. Where can one track the progress of such? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#5",
                    "likes": "4",
                    "time": "01/02/2022-22:59:19",
                    "content": "i applaud the initiative @Artem_Gordon ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#6",
                    "likes": "4",
                    "time": "01/02/2022-23:06:57",
                    "content": "One way to do this is to simply take the agenda, which is prepared in advanced, and take notes directly on the agenda as the meeting goes on. Afterwards, one can simply take 20 minutes fleshing out the notes on the agenda. You could post those. This would take no more than 20 minutes more than the standard meeting prep. You could have one running thread that contains this information with each post as a separate week. It would allow a record of what happened at a glance as well as a comprehensive history for someone who wants to revisit past meetings. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#7",
                    "likes": "5",
                    "time": "02/02/2022-02:01:42",
                    "content": "    flipflopflapdelegate:  this request is out of scope for this poll–but is there anyway you can post a bi-weekly status report of the Milestones (1 thru 6) for Q1, and Q2 as they move along?       flipflopflapdelegate:  I meant the CMON milestones, as well as the CMOFF milestones   Hi Frank, We are actually targetting a bi-monthly cadence for sharing updates to these milestones. Some initiatives may have slightly different cadence, but i. general we are planning to do this all on the GnR. The progress tracking and execution of these milestones are done via the Initiatives Tracking & Stakeholder Alignment Framework we’ve been piloting. Milestone progress tracking is a result of coordination calls themselves as milestones are broken down into work items, which are then given statuses and estimated timelines (amongst other things.) At the moment the best point of reference is the Work Breakdown Sheet for each individual initiative, but some of those are not publicly viewable due to present sensitive information. As a proxy, Coordination Call facilitators are tasked with creating publicly available slides that outline:  Initiative Description Core Units Involved Milestones for a stated time period (usually two quarters) Major Components for each of the milestones. Statuses for each milestone and associated components.  These are shared on the GnR’s new Initiative Updates segment and are documented in the summaries that are produced afterward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.216658775252525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#8",
                    "likes": "3",
                    "time": "02/02/2022-15:07:27",
                    "content": "    MadShills:  One way to do this is to simply take the agenda, which is prepared in advanced, and take notes directly on the agenda as the meeting goes on. Afterwards, one can simply take 20 minutes fleshing out the notes on the agenda.   That’s essentially what I am currently doing; I prep whatever I already know beforehand and then write notes throughout the call. However, I’m trying to move away from live notes because it requires more attention and a general understanding of the discussion topics than the semi-transcription that contributors work on, which means it’s difficult to find someone I completely trust to do them. The primary reason I am contemplating moving away from Snippets is the duplication of information. Another idea can be to hunt for an experienced contributor and scale the Snippets but discontinue the semi-transcription? But this will 100% result in less “word-for-word” information and look more like a TL;DR.     MadShills:  You could have one running thread that contains this information, with each post as a separate week. It would allow a record of what happened at a glance and a comprehensive history for someone who wants to revisit past meetings.   I thought about this before and wasn’t sure whether the community prefers this to the current method. I’ll ask around and think about it. (Post note: some sections of the semi-transcription are taken from my Snippets and the slide deck, which does reduce the cost per semi-transcription since I provide contributors whatever information I already preppared.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.728867623604465
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#9",
                    "likes": "3",
                    "time": "02/02/2022-17:50:17",
                    "content": "I voted no, but I understand the other side of the coin that this involves your hard work (4, 5 h) especially repetition of content already posted on the forum, I think it is a waste of time and if it is used for something else, I think it is the right thing to do if it is discontinued.  In my opinion, I think that the snippets provide a great opportunity to develop a deeper understanding of some governance topics and to follow up on core unit initiatives. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.390873015873016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "03/05/2022-17:50:27",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}