{
    "poll_list": [
        {
            "title": "MOMC Guidance - Remove ETH Supply Yield And Liquidity Incentives From D3M Target Borrow Rate Calculations - October 10, 2022",
            "index": "18069",
            "option": "Yes",
            "supporting_mkr": "67,161",
            "highest_fraction": 0.95
        },
        {
            "title": "MOMC Guidance - Allowed Spread Between D3M Target Borrow Rate And ETH-A Stability Fee October 10, 2022",
            "index": "18069",
            "option": "Option 1 - 0.5%",
            "supporting_mkr": "67,161",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-modify-d3m-guidance-for-momc/18069",
            "title": "[Signal Request] Modify D3M Guidance for MOMC ",
            "index": 18069,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "rates",
                "sig-status-accepted",
                "ppg-omc-001",
                "d3m",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "9",
                    "time": "23/09/2022-17:11:27",
                    "content": "Hi all, At the end of last year, this signal request polled the community for guidance on a framework for setting D3M parameters. Specifically, the bar (target borrow rate) and line (maximum debt exposure) parameters were gauged based on market utilization and competitive positioning versus Maker’s core vaults. With the recent completion of the merge and declining stETH risk factors paving the way for potential reactivation of the Aave D3M, it’s a good time to revisit this framework and see if the community would support changes.  Context The previous signal request, ratified by Maker holders in an on chain poll, set guidance as follows: Debt ceiling (line): Up to 30% of real DAI supplied (excluding recursively borrowed and supplied DAI from calculations). Target borrow rate (bar): Up to 0.5% below ETH-A stability fee, including impact of liquidity incentives on DAI borrowed, and incentives and earnings on supplied ETH collateral assuming 200% collateral ratio. Due to significant increase in ETH supply rates, caused by the onboarding of stETH collateral at Aave and corresponding leveraged staking strategies, the bar parameter guidance framework is currently highly restrictive against deploying funds into the Aave D3M. With supply rates hovering around 0.9%, the current calculation offsets borrowing costs on Aave by 1.8%. The end result is that the bar parameter supported by existing guidance would be ~1.3% above Maker’s ETH-A stability fee (ETH-A stability fee - 0.5% allowed spread + 1.8% yield earned on ETH collateral at Aave). Aave’s DAI borrow rate is currently at ~2.75%, so a bar of 2.8% with existing guidance would not result in any DAI deployed. While the guidance on bar is intended to maintain competitiveness of Maker’s core vaults such as ETH-A, market dynamics indicate that it may not be accurately reflecting user preferences and rate comparisons. The effective DAI borrow rate calculated with the current formula at Aave is ~0.95%, well below Maker’s ETH-A rate. If users were comparing these rates strictly on a like for like basis, we’d expect to see more significant movement of users from Maker vaults to Aave. This may be explained by significant qualitative differences in risk profile. Aave aWETH collateral can be borrowed while Maker ETH vault collateral cannot, which exposes Aave users to tail risk of losing collateral due to a variety of factors: oracle problems, failure of any individual collateral asset on Aave, and indirect exposure to slashing or technical issues with Lido stETH backing outstanding aWETH loans.  Polls Given that collateral supplied pooled lending markets such as Aave and Compound is exposed to significant additional risk compared with Maker, the community can consider altering rate comparison calculations used to set the bar parameter to exclude yield and liquidity incentives earned on user collateral. Poll #1: Adjust collateral yield weighting within competitive rate calculations for D3M     Remove ETH supply yield and liquidity incentives from comparison Continue to count yield and incentives on ETH collateral (no change) Abstain     0 voters     If Maker removes yield earned on collateral from calculations, it may be suitable to adjust the allowed spread between D3M bar (target borrow rate) parameters and ETH-A stability fee. This would ensure that Maker doesn’t give undue advantage to usage of external protocols instead of Maker vaults. Inclusion of any changes to maximum spread from the below poll is contingent on a positive result to the poll above (if a majority of forum voters support making no changes in the above poll, the following poll will be disregarded). This parameter is intended to provide a lower limit to bar parameters proposed by MOMC. The MOMC can always propose a higher spread with bar(but not go below the one voted by Governance). Poll #2: Adjust allowed spread between bar (target borrow rate) and ETH-A stability fee     1% (implies bar of 2.5%, 21 million DAI exposure, 250,000 annual revenue) 0.75% (implies bar of 2.25%, 51 million DAI exposure, 490,000 annual revenue) 0.5% (implies bar of 2%, 90 million DAI exposure, 680,000 annual revenue) 0% (implies bar of 1.5%, 105 million DAI exposure at 30% real supply cap, 730,000 annual revenue) -0.5% (implies bar of 1%, 105 million DAI exposure at 30% real supply cap, 730,000 annual revenue) Abstain     0 voters     (Note that the existing guidance is -0.5%, but if a change is adopted in poll #1 the resulting bar from this maximum spread would be significantly different that the status quo. Due to this dynamic, the -0.5% option is not marked as “no change”.) The risk core unit and MOMC remain confident in the prior guidance of limiting D3M line (maximum debt ceiling) to 30% of real DAI supplied to mitigate potential withdrawal and liquidity risk, so no polls for changes to line are included in this signal request. If other community members feel that a change in guidance is warranted, they are welcome to start a signal request to change guidance on this parameter.  Next Steps This signal request will run for 2 weeks, ending on 6 October 2022. If forum voters support changes, an on chain poll will be submitted the following week. MOMC may include an option in the upcoming parameter changes proposal for October that includes changes to Aave D3M bar outside of previously approved guidance. If such an option is considered, the committee will also submit at least one other parameter change proposal option that continues to conform to prior D3M guidance. This would give the Maker community the opportunity to deploy DAI into the Aave D3M in October, while this signal request is still being considered. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties-round-up-4/18283",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/26",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/104",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/10",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/123",
                        "https://forum.makerdao.com/t/governance-and-risk-210-thursday-september-29-at-17-00-utc/18115/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/23",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-28-de-septiembre-de-2022/18259",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-september-2022/18239",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/22",
                        "https://forum.makerdao.com/t/governance-and-risk-211-thursday-october-06-at-17-00-utc/18244/2",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-october-2022/18564",
                        "https://forum.makerdao.com/t/propuesta-de-cambios-en-los-parametros-ppg-omc-001-28-de-octubre-del-2022-traduccion/18570",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/67",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/28",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/16",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/18",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/57",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/29"
                    ],
                    "GPT-summary": "The author of the proposal is seeking feedback from the community on modifying the D3M guidance for MOMC. The proposal suggests adjusting the bar parameter to exclude yield and liquidity incentives earned on user collateral and adjusting the allowed spread between the bar and ETH-A stability fee. The post includes two polls for community feedback and outlines the next steps if changes are approved. The post also explains the context and rationale behind the proposed changes.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.455661157024794
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "2",
                    "time": "23/09/2022-21:47:49",
                    "content": "Just wanted to add a note, the expected exposure and revenue values included in the poll were based on market conditions as of 21 Sept. It looks like the borrow rates for DAI on Aave have declined somewhat since then, which implies that exposure and revenue amounts will be lower. The revenue calculator here can allow for determining up to date estimates: Maker Risk | Block Analitica ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-september-2022/18239"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "2",
                    "time": "24/09/2022-14:21:07",
                    "content": " [Signal Request] Modify D3M Guidance for MOMC  This is a valid Signal Request that has been split into two separate items. Voting on this Signal will run until 2022-10-06.  If Poll #1 has over 50% support from non-abstaining votes, the question will be brought to MKR Voters on Monday, September 10.  If Poll #1 has over 50% support from non-abstaining votes AND at least one option from Poll #2 does as well, the qualified items from Poll #2 will also be polled on 2022-10-10.  If multiple items advance from Poll #2, they will be formatted in a separate poll using approval voting.*  If Poll #1 does not advance, no further action will be taken regardless of the vote on Poll #2.  Poll #1 asks the community to “Adjust collateral yield weighting within competitive rate calculations for D3M”  Voting for “Remove ETH supply yield and liquidity incentives from comparison” represents a change to the status quo, and if approved by MKR holders would result in the MakerDAO Open Market Committee removing the ETH supplier’s yield and AAVE liquidity incentives from their calculations for setting the bar (Target Borrow Rate).    Poll #2 asks the community to “Adjust allowed spread between the bar (target borrow rate) and ETH-A stability fee.” Note this poll is only relevant if Poll #1 passes the signal stage.  Because this poll is dependent on Poll #1, any non-abstain option will represent a change to the status quo. Thus, if Poll #1 advances, all options with more than 50% support from non-abstaining voters will be bundled into a separate poll. This spread is intended to help the MakerDAO Open Market Committee determine if changes should be recommended to the D3M during their monthly recommendations. It is not binding, but guidance on what MKR holders are looking to support regarding the D3M parameters.   This proposal has been assigned Medium-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-09-30 * - Note this is subject to @monet-supply’s consent, without it we will use the standard Ranked Choice (IRV) formatting if multiple options from Poll #2 advance. ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://manual.makerdao.com/module-index/module-dai-direct-deposit#target-borrow-rate-bar",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-september-2022/18239"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.261904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#4",
                    "likes": "3",
                    "time": "30/09/2022-14:42:48",
                    "content": "So polite bump to consider the approval voting option Monet  happy to chat about why I think this is a great question to break out @dux-core-unit’s innovation with (TL;DR is that for a recommendations committee like the MOMC, getting a choice that is supported by the most MKR voters is probably preferable to selecting the most favored option by current voting weight) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "2",
                    "time": "30/09/2022-16:08:55",
                    "content": "Sorry for Prose spam, confirmed in DMs! If the vote for Poll #2 has multiple advancing options we’ll be using approval voting for the first time on-chain to settle the matter  Hopefully goes without saying, but just so everyone can rest easy, @monet-supply can comment here if I’ve mis-represented his willingness. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.683333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "1",
                    "time": "05/10/2022-17:15:55",
                    "content": "Prose again, looks like we could use some more votes here before this closes out. Please take a look and express your opinion! CC: @Recognized-Delegates ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#7",
                    "likes": "1",
                    "time": "14/10/2022-12:10:37",
                    "content": "The on-chain polls have now concluded. There was a majority in favour of removing the supply yield and liquidity incentives from the Target Borrow Rate calculation.  image934×269 7.64 KB  In the follow-up approval poll, the winner was a spread of 0.5%.  image941×304 9.28 KB  The MOMC will use this information when deciding on future recommendations for D3M parameters. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-october-2022/18615"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "13/11/2022-22:10:54",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1770"
}