{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/request-for-proposals-for-a-on-chain-rwa-monitoring-solution/19535",
            "title": "Request for Proposals for a on-chain RWA monitoring solution ",
            "index": 19535,
            "category": [
                "Governance"
            ],
            "tags": [
                "rwa",
                "rfp"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#1",
                    "likes": "13",
                    "time": "23/01/2023-19:54:33",
                    "content": "Since MIP13c3-SP13 passed with flying colors, we request potential partners to submit proposals or intent and initial scope for proposals as an answer to this forum post. Here’s the original discussion for reference: MIP13c3-SP13: Declaration of Intent to Develop a Comprehensive On-chain Monitoring Solution for RWA Vaults - Maker Improvement Proposals / Formal Submission - The Maker Forum (makerdao.com) To recap: MakerDAO intends to fund a comprehensive on-chain RWA monitoring solution that covers as many of its vaults as possible. If a proposer wants to exclude certain vaults, that is possible, as long as a rationale is given. The proposer should demonstrate the ability and the credentials that they can develop a trustworthy and transparent solution to RWA monitoring. — Edited during RFC period: Solutions have three main areas to cover:  The first mile The infrastructure The presentation  ad 1.) This is the most important and the most difficult part any proposal must cover. Relevant data necessary to adequately judge RWA vault health needs to be gathered first. This could mean looking at detailed breakdowns of loans originated for a credit portfolio as well as the health of these loans. Or a detailed breakdown of the tenancy and cost of a real estate portfolio. Or the performance of installed solar panels, to give some examples. Ideally, this is done by more than one well-established third party so that multiple eyes perform cross-checks on each other, if feasible. The ideal proposer would include an initial list of data points to be monitored for at least one existing RWA vault as part of their proposal so the community can judge their acumen. If proposers host Q&A calls to field possible questions, even better. ad 2.) The more decentralized, permissionless, and uncensorable the transferring of data gathered is, the better. Proposers can request assistance from other proposers here if they are specialized in accounting and auditing but lack the necessary technical expertise. It would be great if collaborations were started due to this initiative. MakerDAO wants to remain the gold standard for decentralization, and any proposed solution should ensure this is taken into account. ad 3.) While it is necessary to have the gathered data available in its raw format and as openly as is permissible without running into confidentiality issues, the ideal proposal should also develop a dashboard where interested community members can dig into vault health parameters at their leisure, and also have the most important parameters visible at a glance. Strategic Finance has recently published an accounting dashboard for Maker, which can definitely serve as a benchmark in this regard. (See link below) The proposer should include the following information in their SPFs:  Developer team with a spokesperson for the team Credentials or references to prior work Proposed data points gathered for a selection of existing RWA vaults How the solution is designed and how it will be implemented Milestones for development with costs for milestones Total budget breakdown Time for execution  If one or more points cannot be addressed before the 30d proposal window ends on 22 February 2023 and a proposal is very strong otherwise, we will work on finding a solution here. Proposals should be in the form:  Title Team lead Team Proposal summary Link to the detailed proposal  To keep this forum post as succinct as possible.  Update two weeks before the end of the 30d submission window: It has become crystal clear that the proposed window is not enough for a fully formed solution to be proposed. We want to encourage proposers to step forward as they are and be clear about which parts they can or can not fulfill and where in the development process they are. This can lead to matchmaking here or in calls I’m happy to facilitate. If MKR holder see strong interest it is much more likely that an extension to the 30d window can be approved or the development of the desired on-chain RWA monitoring solution can be moved to a MIP97, DAO Level Objective. Bring it on, sers ",
                    "links": [
                        "https://forum.makerdao.com/t/mip97-spx-dlo-on-chain-rwa-monitoring/19901/5",
                        "https://forum.makerdao.com/t/mip105-the-real-world-asset-collateral-scope-framework/19688/24",
                        "https://forum.makerdao.com/t/mip95-100m-of-cogent-bank-loan-participations/19338/20"
                    ],
                    "GPT-summary": "The author of the post is requesting proposals or intent and initial scope for proposals for a comprehensive on-chain RWA monitoring solution. The post provides details on the areas that the proposal should cover and the information that should be included in the proposal. The author also encourages collaborations and feedback from the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.042364414192773
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "3",
                    "time": "25/01/2023-18:12:10",
                    "content": "Would there be an option to vote neither? Considering it’s only 30 days to prepare such, I can’t imagine it will be a competitive bidding nor have enough to communicate with the Maker community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/01/2023-19:06:52",
                    "content": "At this stage the intention is to get names in that propose in as much detail as possible in this timeframe. I’d love to vote whether to continue the project after these 30d window elapses and give parties time to answer all the questions, or whether to choose a solution, or abandon the project. Maker is certainly under no obligation to pick a winner. If no solution is adequate then that’s a possible outcome. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0396825396825395
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#4",
                    "likes": "2",
                    "time": "25/01/2023-22:27:23",
                    "content": "As a potential proposer, knowing that the project may be abandoned after all may not encourage potential proposers to put in the efforts for quality proposals, which could lead to none being chosen… a self fulfilling prophecy?. It would be more encouraging if Maker were committed to seeing the project through, even if it meant extending the 30 day window. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#5",
                    "likes": "0",
                    "time": "25/01/2023-22:41:45",
                    "content": "You might have misread the intention here. MKR holders can be polled, after 30d, to decide if they wants to give participants more time, or if none look promising. Do you feel that’s abandoning the project? How can MKR holders commit to funding something where nothing has been proposed yet? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#6",
                    "likes": "2",
                    "time": "25/01/2023-22:52:47",
                    "content": "Sure, thanks. I wanted to clarify the commitment to carry on with the selection process … not so much the commitment to fund when no/quality proposal is received. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#7",
                    "likes": "1",
                    "time": "25/01/2023-23:05:57",
                    "content": "    rspa:  Maker is certainly under no obligation to pick a winner. If no solution is adequate then that’s a possible outcome.   If no particularly strong solution presents itself in the 30d timeframe, one option is to open up for a longer period (say, another two months) to give potential partners more time to put proposals together. Maker’s need for on-chain RWA monitoring isn’t going anywhere, so I would be in favour of an extended process to find a suitable partner, if (and only if) a great solution isn’t presented in the next month. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.991341991341992
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#8",
                    "likes": "2",
                    "time": "26/01/2023-08:19:10",
                    "content": "I agree, and I feel the same here, but ultimately this is for MKR holders to decide. That being said, I’m having conversations with extremely interesting partners atm and hope they come forward to at least drop their name within the 30d window. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marcus_Leanos",
                    "index": "#9",
                    "likes": "13",
                    "time": "30/01/2023-21:52:38",
                    "content": "Hi @rspa - would love to intro Adapt3r Digital as we are spending a lot of time in this exact area of RWAs. Prior to formally applying to work on this initiative in an official capacity with the DAO, we were hoping to share our thoughts. We are actively working on solutions that may fit well here and would love to have a longer conversation on this topic (my TG handle is @mleanos and my DMs are open). Adapt3r Digital, at its core, is purpose-built for on-chain bank syndications similar to HVB in their basic structure. Our primary offering is ADAPT (Alternative Digital Asset Participation Trust). By creating a standard around credit, structure, liquidity, and reporting, we believe ADAPT will be able to address many of the painpoints that DAOs face when looking to scale their more conservative RWA exposures. We improve Maker’s existing RWA implementation through three key capabilities:   Scalability: The vehicle, fully compatible with Maker’s existing DST, allows for endless composability. We are currently coming to market with one bank, but intend to onboard 5-10 banks over the next 12 months. Given our background (we have collectively sat on over 20 community bank boards), we are able to socialize these deals with some of the most technologically advanced and well-run community banks in the country. Whereas Maker’s current deal with HVB has left 75% of the cash on the sidelines, our banks have the capacity to keep the vault full indefinitely.   Standardization of credit and liquidity: Lack of liquidity and a lack of standardization around credit are key pain points for Maker. We have attacked this from two angles: first, our deal includes collateral that is rated and we are in discussions to have the vehicle itself be rated by a Big Three rating agency. That would make ADAPT the first rated RWA syndication in DeFi. ADAPT will also be underwritten by a broker dealer and broadly syndicated through their ATS. We believe this combination of factors will be instrumental in solving issues around liquidity for longer duration assets, which we view as an inevitable path the DAO needs to take. As a side note, this also creates a potential revenue opportunity for the DAO via market making on the ATS.   Asset monitoring and reporting: We have witnessed a continuous need for transparency in the DAO’s RWA activity for quite some time. Below, we break down what we have built. In the world of community banks, reporting can be especially daunting as each regulatory regime requires a different reporting format. We have spent the better part of our careers building systems to standardize and compare this data. We would be more than happy to hop on a Q&A with the community to discuss any and all contents of this proposal.   Solution Overview and Context: Just last month we announced our strategic partnership with Archblock, the core development team behind TrueFi. By combining forces, we have developed a fully on-chain bank syndication platform, complete with end-to-end reporting on three levels:   Asset-Level Performance: Today there is little data on the actual assets that the DAO owns and how they are performing. We are able to provide granular data across the deal powered by direct integrations into bank core processing systems. This will be easily exportable or queryable, and enable robust analysis for core units. Due to bank privacy regulations, we will only be able to allow persons under NDA to view the full data package, but we have simply obscured private details away for community members to be able to view about 90% of it.   Example datapoints: Borrower type, Initial Loan, Unpaid Principal Balance, Yield, Payment History, Credit Score, Loan-to-Value, Recent Collateral Appraisal, Collection Status, Fixed or Floating Repricing, Maturity   1600×875 240 KB    Portfolio-Level Performance: On-chain asset-level data is reconciled with portfolio performance, which is monitored by our Trustee. This allows community members to parse the portfolio’s exposure and returns to accurately assess the composition of the portfolio (e.g. across loan types, collateral types, repricing rates, yields, and losses). Below we show key profitability metrics like ROE, regulatory capital ratios, and detailed loan portfolio composition, aggregated and subtotaled across approximately 40 different bank loan portfolios.   Example datapoints: All asset-level data points from above by aggregated to a portfolio of subcategory level.   |587.6x4101600×1116 391 KB    Bank-Level Performance: As career bank investors, we would be remiss if we did not stress the importance of understanding your bank. Although it may seem to be the case, not all banks are fungible. There are stark differences in quality of credit originated by different banks - which could be due to a variety of factors: who is the lending officer? How are underwriting decisions made internally? What geographic market are you operating in? What do your historical losses look like relative to the industry, including within specific loan types? These are all capabilities that we have already incorporated in our platform. We showcase sample tearsheets below for three separate issuers across different reporting regimes (one credit union, one bank subsidiary, and one bank holding company.)   Example datapoints: Historical loss rates, financial statements, enforcement actions, capital ratios, profitability, corporate actions dating back to 1990. For quantitative data points, can include industry average for a benchmark comparison. We can also focus this benchmark to specific geographies or asset sizes.   1332×1027 104 KB  Implementation and Data Sources: All data is pulled directly from bank core processing systems and/or public filings with regulatory agencies such as the Fed or the FDIC. Our systems are automated end-to-end. Data can be pulled into community dashboards directly on-chain, queried via API, or exported into CSV.  996×908 39.7 KB  We are able to do this primarily as a facilitator or Arranger under current Maker governance parameters, whereby we work with banks to onboard to the DAO and provide services on an ongoing basis. This allows us to be privy of all data sources in a transaction. We have been discussing our collateral onboarding plans with core unit members and would be happy to speak to anyone that sees this post and would like to learn more. Milestones for development with costs for milestones: We are ready to bring our first deal to Maker as soon as tomorrow, and would make a soft recommendation that the existing RWA collateral is moved into the ADAPT vault. If that were to happen, all existing bank collateral will be seamlessly integrated into our reporting functionality. We are open to exploring an arrangement like this, and would also mention that we plan on coming to these forums with a larger proposal around collateral onboarding in the future with members of our bank consortium. Who we are: We have chimed on some other posts around RWA reporting but wanted to formally introduce ourselves. We are Adapt3r Digital, a Maker community member with a unique background: we have spent the last 10 years investing in community banks and assisting in the management of $6 billion in community bank-originated securitizations. We are holders of MKR ourselves (both personally and within our digital asset hedge fund) so have been keeping close tabs on the development of Maker’s RWA strategy. The HVB deal obviously caught our attention, and after doing some diligence we saw an opportunity to greatly enhance this side of the DAO’s business. ",
                    "links": [
                        "https://www.coindesk.com/business/2022/12/15/defi-protocol-developer-archblock-aims-to-onboard-us-community-banks-with-new-partnership/",
                        "https://forum.makerdao.com/t/real-world-assets-report-2022-11/19072/10",
                        "https://forum.makerdao.com/t/real-world-asset-report-2022-12/19413/12"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.649735449735449
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#10",
                    "likes": "0",
                    "time": "31/01/2023-08:10:11",
                    "content": "Hey Marcus, Thanks for the exciting proposal. I’m a bit confused if you’re proposing an RWA or a monitoring solution. Could you elaborate? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marcus_Leanos",
                    "index": "#11",
                    "likes": "0",
                    "time": "31/01/2023-14:54:29",
                    "content": "These capabilities are tied to us bringing RWA deals but seem to directly address the requested proposal. Apologies if this is not the appropriate place to post this - we see this as an elegant solution to the DAO’s monitoring issues on the bank side. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#12",
                    "likes": "0",
                    "time": "31/01/2023-17:21:13",
                    "content": "This is for proposals for monitoring existing RWA vaults. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#13",
                    "likes": "2",
                    "time": "31/01/2023-18:36:23",
                    "content": "Could you get market pricing/valuations for the positions?  It would be great to see where Maker could get liquidity in the real world if needed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#14",
                    "likes": "3",
                    "time": "31/01/2023-20:18:40",
                    "content": "I think he’s saying its a package deal whereby their way of monitoring existing RWA vaults would also lay the groundwork for future collateral onboarding and possibly onboarding of new liquidity providers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.227272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marcus_Leanos",
                    "index": "#15",
                    "likes": "4",
                    "time": "01/02/2023-03:35:50",
                    "content": "hey @Eumenes - we can likely grab pricing for gov guaranteed paper and/or some of the rated collateral - but that does not apply to the existing HVB deal. On HVB, much of the loan portfolio is originated to be held to maturity and does not generally trade, which is not atypical. Optimally, Maker would retain the option of having the loans syndicated by a broker-dealer if need be (which is why our version of these deals incorporates that feature). It would likely see a bid. We could potentially get shown quotes from loan brokers on a periodic basis, but not entirely sure how much that would cost. We can do some work here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.078125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#16",
                    "likes": "0",
                    "time": "01/02/2023-12:48:38",
                    "content": "Hey Marcus, that’s really interesting. I still don’t completely understand your position, could you help me? Are you proposing to arrange RWA that you could then also provide good monitoring for? Or are you providing monitoring for existing Maker RWA, or are interested in doing so? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#17",
                    "likes": "1",
                    "time": "01/02/2023-13:16:58",
                    "content": "This would greatly increase the bandwidth of RWAs and potentially create a backstop of liquidators for such collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#18",
                    "likes": "4",
                    "time": "01/02/2023-13:24:42",
                    "content": "As I understand Maker do not own these loans but they are ultimately collaterals for Dai minted from various RWA vaults. The only time that Maker (through a real world legal structure ie trustees) would own them will be when the vaults are not performing leading to Maker seizing the collaterals. At that point a liquidation process will take place and the loans could be offered for sale. There is quite an active market for these NPL (c.$100bn a year in Europe) and we know a few large investors in this space. It will likely be possible to obtain quotes for these loans. Getting price quotes when loans are performing is often harder as lenders (before selling them to a SPV) will keep them on the banking book. That is why TradFi opt for a discounted cash flow valuation approach taking in various inputs such as internal ratings, probability of default and loss given default of a particular RWA asset class. If these inputs come through various endpoints/APIs with the core banking systems, third party sources then the valuation should probably be robust enough. (In that case according to Oscar Wilde we would not be someone  who knows the price of everything and the value of nothing) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.161904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marcus_Leanos",
                    "index": "#19",
                    "likes": "3",
                    "time": "01/02/2023-14:40:24",
                    "content": "From a business standpoint, we are configured to roll this service all into one fee, in basis points, at the pool level. For HVB, we would be happy to explore potential solutions where we can tie in retroactively and just provide the reporting - we would just likely need a grant or some level of AuM-driven fees so we can cover the cost of data and 1-2 dedicated analysts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#20",
                    "likes": "3",
                    "time": "01/02/2023-14:50:50",
                    "content": "Thanks. Agreed - you can get ‘matrix pricing’ for traded ABS/MBS and corporate stuff from a pricing source like Bloomberg. I think the bigger value add would be getting pricing/valuation on Maker’s illiquid credit positions - stuff that isnt rated or traded.  This a a key risk on Maker’s balance sheet and Maker should have a good sense of where it could be sold in real world if needed. You would need to use specialized valuation agents that traffic in that type of collateral.  For example, there is a private market for senior revolving debt facilities for blind asset pools. The first step, I suggest, is to list all of the Maker illiquid credit positions and determine what type of pricing agent/trading desk would be able to credibly price it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.795454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Manrui_Untangled",
                    "index": "#21",
                    "likes": "8",
                    "time": "20/02/2023-13:34:45",
                    "content": "Hi @rspa and the Maker community, I am Manrui from Untangled Finance. We have been working in the real world asset tokenisation and Defi space for the last few years and had some prior experiences working with the Maker RWA team. We believe that our technology as it stands now ticked most of the requirements per above and would like to submit a proposal for the core unit team and the Maker community to review. We look forward to receiving feedback on all aspects of this proposal. Thank you! Development Team The team for this project includes:   Untangled: develops RWA origination technology for DeFi. We focus on supplying institutional RWA collaterals to DeFi credit and stable coin protocols (see our prior progress with Maker and Celo) Institutional investor reporting partner: TBD. We are talking with a number of very interesting institutions who would like to work with Untangled to provide Maker with RWA on chain reporting and monitoring You: If you can collaborate with us on any of the above components/building blocks, please let us know.  Spokesperson: Manrui Tang @Muntangled Untangled founding team has:  Audit, due diligence (financial, commercial), and strategy experience with a Big 4 20+ years of experience working with global financial institutions/institutional investors Master’s degree in finance and chartered accountancy (i.e. CPA in the US) First-hand experience working in DeFi since 2017 via Binkabi (loan origination) and Untangled (tokenization and distribution)  More on the Untangled founding team can be found from the previous Maker risk assessment here. The Untangled team engaged with MakerDao’s then Real World Finance team for the second half of 2021 which culminated in that risk assessment. Solution overview This proposal focuses on on-chain monitoring of private credit RWAs. We are open to collaborate on other collateral types such as bonds and even specific asset classes within private credits such as property lending, or mortgages.  1600×1054 226 KB This solution is based on:  Tokenization of RWA collaterals - each collateral is tokenized into an NFT with appropriate metadata Reporting on key credit performance indicators by vault e.g. on-chain valuation (Net Asset Value - NAV calc) and covenant compliance Credit modeling: inputs into NAV calc with probability of default, loss given default (PD, LGD) appropriate for the underlying collateral asset class as described above.  The implementation is designed to be decentralized from day one. We have built a set of smart contracts for tokenizing and valuing private credits. They get inputs from various sources including off chain ledgers, public reporting or where exists, secondary markets. The outputs can be rendered in a customisable dashboard or through specific queries or API endpoints. Data providers can be banking counterparties, oracle services such as Chainlink, third parties service providers. We will keep a registry of data providers. Inputs into valuation models can be provided by valuation agents who specialize in specific asset classes. The community could also provide inputs to these risk parameters based on specific expertise or as a feedback loop from vault actual loss experience. We propose to deploy on Celo blockchain, an EVM compatible chain with low fee and a vision for real world impact. Celo’s technical roadmap also supports roll-up styled layer 2 with strong linkage to Ethereum. The smart contracts have been deployed to Celo testnet. This link contains relevant contract addresses and ABI files. (e.g. the batch tokenization contract - loan kernel - is at 0x4cdBd1E95b8C07A11846818a959F067f8F0f6C98 . These smart contracts have been audited as part of the Untangled protocol audit - For the audit result go Untangled Protocol Audit Report With the loan collaterals being tokenized into NFTs, they are also future-proof for on-chain loan liquidation. We see a future where RWA loans are originated directly on-chain. They can be used or packaged as collaterals in Maker vaults and be priced or liquidated via on-chain loan secondary market, just like other crypto native collaterals. Data points to be gathered We will provide a standardized format for data gathering and reporting, following guidance from public authorities such as EBA in Europe. You can view a template for SME loans by the EBA Data templates Status of development and what need to be done  Data inputs: We have built a data mapping for loans and invoices and an API to allow originators to tokenize collateral assets. We will need to expand to other asset classes and integrate with oracle and other public reporting services. Processing: Collateral tokenization and valuation is part of Untangled protocol which has been audited. We are planning to deploy a subset of these contracts for this service. For SME lending and trade finance we can also start the valuation exercise by providing appropriate risk parameters based on our expertise. We look to further decentralize this process by collaborating with specialist valuation providers for each asset class. Presentation: We have built a front end/UI for originators to interact with the smart contracts and for investors to view portfolio and asset-level performance. For a glimpse of the UI, please go to https://test.untangled.finance/. For this project, we will build output APIs and dashboards integrating with third party indexing, querying and presentation services.  We anticipate that the above remaining work will take 3 months to complete. We are open to collaborating with interested experts within the community and other potential strategic partners. Budget DAI 300,000 (excluding third party services, mainly any additional audit) for the remaining implementation and 0.15% pa (15 bps) of collateral outstanding for reporting and monitoring. For more information on the solution, please go here. Conclusion This initiative further proves that Maker is the most forward-thinking in scaling RWA within DeFi. We propose a system for RWA on-chain reporting that is designed to be:  Decentralized: data and valuation parameter inputs from many sources including institutions and the community  Robust and future-proof: based on tokenization of collateral assets and on-chain valuation  Cost-effective: not from scratch but purposely built, audited contracts and UI; cost scaling with AuM ",
                    "links": [
                        "https://forum.makerdao.com/t/untangled-finance-collateral-onboarding-risk-evaluation/12006",
                        "https://forum.celo.org/t/discussion-increase-the-reserve-s-natural-capital-allocation-for-upcoming-assets/3905",
                        "https://forum.makerdao.com/t/untangled-finance-collateral-onboarding-risk-evaluation/12006",
                        "https://drive.google.com/open?id=1tId4OU3_Sm3SdasZ64OgZUNmGPvGVMJV&authuser=quan.le%40untangled.finance&usp=drive_fs",
                        "https://explorer.celo.org/alfajores/address/0x4cdBd1E95b8C07A11846818a959F067f8F0f6C98/transactions#address-tabs",
                        "https://www.verilog.solutions/audits/untangle_protocol/",
                        "https://www.ecb.europa.eu/paym/coll/loanlevel/transmission/html/index.en.html",
                        "https://test.untangled.finance/",
                        "https://docs.google.com/document/d/1peAK_79_MXEAuQm-2SwOAAZBM5TulDRItxNN5wv5GYc/edit#"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.41498778998779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#22",
                    "likes": "1",
                    "time": "20/02/2023-18:06:02",
                    "content": "This is an incredibly strong proposal. Thanks for putting it up. I’m definitely open to help you find partners where you need them. Flipside Governance is currently working on a MIP97 DAO Level Objective to give this a bit more time and allow participants to apply to exactly where their strengths are. I expect to have a first draft on the forums tomorrow. Thank you for putting this forward. Please contact me or reply here with a request for any help I can provide. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering collaboration on proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Manrui_Untangled",
                    "index": "#23",
                    "likes": "1",
                    "time": "20/02/2023-19:51:29",
                    "content": "Thanks for the feedback @rspa. I will DM you to set up a chat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#24",
                    "likes": "3",
                    "time": "21/02/2023-10:34:33",
                    "content": "Thank you, @Manrui_Untangled, for the effort and for this detailed proposal. The proposal is commendable and addresses a market need, but it may be better suited for smaller protocols with fewer resources. Maker already offers a high level of service, that can catch some counterparties by surprise, and this proposal may face a similar first-hand experience. We should be mindful of settling for anything less than a very high standard. If nothing meets it yet, we run the DoI again, or longer. We should be solving for the problem not the MIP. My interpretation of the DoI is that what we should be asking for is:  An autonomous set of incentives that drives independent third parties to verify and value our private credit investments A way of bringing these values on chain in a credibly neutral way with robust consensus-seeking algorithms Triggers for liquidations and on chain debt ceiling changes when off-chain thresholds are met A website would be nice if all of the previous were accomplished but is not in itself value-adding  Fundamentally the proposal is offering:  A data standard for originators to input data into An NFT wrapper for existing loans A proprietary risk model and later a way for other risk models to chime in A website     MIP13c3-SP13: Declaration of Intent to Develop a Comprehensive On-chain Monitoring Solution for RWA Vaults   If we end up having three pairs of eyes look at the same website and punch it into a terminal, we are wasting our time and money.   1: While this proposal is an improvement for protocols without existing capabilities, arranger models and Foundation trustees already report similar data. The issue lies in the lack of independent verification of the data provided by the originator, which is a difficult problem not apparently solved by this proposal. 2: Many of our legacy vaults are already tokenized with Centrifuge, so there is no need to tokenize them again using a different standard or chain if there are no state changes to the vaults. 3: The proposal’s relevance lies in allowing independent parties to provide inputs, although this is already possible with available data. The challenge is creating incentives for independent parties to contribute and transferring this information into actionable on-chain outcomes. However, this proposal doesn’t address the issue of incentives. Additionally, we already have an in-house oracles team, Chronicle, which has a battle-tested track record. Building another in-house oracles team seems unnecessary, not to mention introducing Chainlink. 4: Finally, we can agree that having a dedicated, ground-up website built to report this information is something we don’t have. I personally think it would be a boondoggle to create one, a solution in search of a problem. But reasonable minds and token holders may disagree. Once again, it’s an issue of meeting the fact that Maker has very well developed in-house capabilities for a lot of things that are lacking in most other protocols. The sunk cost fallacy would be to consider this realized investment when evaluating new opportunities. The flipside fallacy is to disregard resources you already have and launch into new and uncertain investments anyway. I think this proposal has huge merit, but feels undersized for Maker in its current form. My 2c. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.458226584022039
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Manrui_Untangled",
                    "index": "#25",
                    "likes": "3",
                    "time": "21/02/2023-14:37:06",
                    "content": "Thanks @adcv for your comments which are really on-point. What you described is, in our view, the end state (perhaps together with native on-chain origination and disposal of RWA loan collaterals as mentioned in our vision).     Manrui_Untangled:  With the loan collaterals being tokenized into NFTs, they are also future-proof for on-chain loan liquidation. We see a future where RWA loans are originated directly on-chain. They can be used or packaged as collaterals in Maker vaults and be priced or liquidated via on-chain loan secondary market, just like other crypto native collaterals.   We also agree that this is worth solving for not just the MIP and welcome the extension of deadlines and other proposers coming forward. We are aware that Centrifuge tokenize a majority of these pools so there is no need to double up. Our proposal points to a general design for future RWA vaults or exiting vaults that could benefit from enhanced reporting.    RWA Foundation/HVB - Monthly Reporting (December 2022)   I always struggle making sense of these, so if you’ll forgive a potentially dumb series of questions:   It is a journey to achieve what you have described, in our view, pretty much like the pre-game/end game road map that the DAO is developing. We will extend/elaborate our proposal and would welcome any inputs. The solution could be a mixture of: Short-term: bootstrapping with trusted third party validators and valuers, like the Big 4 who receive a fee for their service and has a real world reputation to lose (proof of authority). This is quite akin to the trustee role in most of these private credit deals. Longer term: create a network of validators who are incentivised via a token (can even be a sub-DAO token?) who need to stake for their work. They can receive a share of the income for their work in exchange for their expertise and risk of their stakes being slashed. None of these is particularly rocket science  but just like anything touching the real world, implementation is key which, is influenced by not just economics/game theory but legal, regulatory … and FUD. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.641369047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/itsjake007",
                    "index": "#26",
                    "likes": "3",
                    "time": "21/02/2023-16:27:54",
                    "content": "MakerDAO Community, Allow me to reintroduce myself My name is Jake Goldstein. I am an active member in the MakerDAO community and an educator in the space. Our team has been working alongside Raph to develop an initial MVP and scope for the project. We believe this project would benefit from starting out as simple as possible and evolve with the ever changing rwa landscape. Our team has significant experience working with Maker and understands the nuances of the project both internally and externally. Our team is excited and eager to present this initial proposal and scope of work. Team: Core (full-time): Jake Goldstein: Spokesperson, Entrepreneur (@itsjake007) Ryan Silva: Software Engineer, John Hopkins Applied Physics Lab (@qwiksilva) Advisors: Max Glass: Arranger, former RWAco (@maxglass) David Krett: technical, former CES CU (@dbkcan) Our team has:  Worked internally at MakerDAO on the deal and technical side of implementing RWAs Executive banking and big 4 consulting experience with an MBA in Finance Arranger experience working directly with RWA originators on-boarding into DeFi Stanford Undergrad CompSci/Masters AI/ML leading development work  Our team came together rather quickly with relationships I had previously built pulling together this document for Maker’s benefit. Our Phased Approach:  GIven the diversity of real world assets onboarded to-date - it is difficult to provide a one-size fits all solution without pursuing a methodical approach. Therefore we are proposing a phased approach:    Data Collection and data standardization   Data analysis and valuation   Data presentation   Moving data on-chain   to facilitate ultimately automated liquidation   Phase 1: Our proposal outlines in detail our approach to phase 1. Phase 2: We believe we cannot pursue a strategy for Phase 2 until Phase 1 is complete. Because of the diversity of different RWA assets, it is challenging to scope out the work required for Phase 2. Further, additional data may be required from vault borrowers that under current vault documentation may or may not be available and/or may be subject to confidentiality requirements - requiring Maker to be involved in discussions with the Vault holders to make available any additional necessary info. For evaluation, our team would leverage existing structured credit actors within the ecosystem such as Centridfuge’s Credit Group, internally at MakerDAO or externally if necessary. Phase 3: Once phases 1 & 2 are complete, we plan on partnering with existing RWA players who specialize in frontend dashboards like Makerburn and DAI Stats. We believe we are doing MakerDAO a greater service by specializing in data and verification. Our data would be available to any ecosystem actor via API and CSV. At this stage we would be working closely with a credit analyst who could determine the credit quality of the collateral. Some data will be standard across all vaults. Some data will be standard per collateral. Phase 4: On-chain data is expensive therefore need to be selective as to on-chain data used - ultimately if the goal is to get to automated liquidation we need to design a technical architecture including appropriate and trusted oracles that can ensure reliable on-chain data. As the development of any smart contract infrastructure is expensive we recognize given the endgame plan that now may not be the time to commit to this investment. However at the appropriate time and based on Makers’ endgame strategy for RWAs we would be more than happy to provide a more detailed scope of work as to how we believe this can be achieved using Maker’s existing toolkit MIP21. Proposal (Phase 1): See detailed proposal here. This is a draft proposal. Once we gather feedback from Maker token holders and key stakeholders we will present a budget for our scope of work. Our proposal outlines a path forward for creating an MVP for MakerDAO RWA monitoring. Our team has significant experience working as an arranger between the various parties providing data and reporting. We understand data relationships between parties and are working towards an MVP for a standard schema, API and on-chain publishing. First Mile: See v0.1 Standard Schema here. Our team manually analyzed all publicly available data per each MakerDAO vault. We identified missed data based on our schema and understand third party relationships. Our goal is to meet with all stakeholders to identify data relationships and adopt traditional standards. For example, we would look to standardize RWA asset data for MakerDAO and try to ensure compatibility with traditional TradFi. For example, we would adopt the ISIN standards or a similar framework. Given Maker’s importance to the DeFi sector, there is no reason Maker shouldn’t be mandating this data framework. The Infrastructure: See API example here. Off-Chain: Our goal for developing the infrastructure will be to provide an API and CSV files for the community to leverage. Once the standard schema is established, all RWA arrangers would be required to publish a monthly CSV, which our team would either manually input or scrape into migration scripts. Standardized data would live off-chain in a database. On-Chain: Expand on MIP21 Toolkit. More detailed explanation post endgame RWA strategy. The Presentation: Our vision is to own the data. We hope to work with the MakerDAO community and other rwa actors to build front-end dashboards. We are only responsible for providing standardized and verified data via API and CSV. We hope to partner with ecosystem actors like Makerburn, DAI Stats and the greater MakerDAO community to help develop frontend dashboards. Please feel free to post your questions in the forum and will host a Q/A session with enough interest. big thanks to @rspa for proving us with this opportunity!! ",
                    "links": [
                        "https://la.uli.org/events/detail/DE25DF43-1AAC-44B1-B99A-189934E848F3/",
                        "https://forum.makerdao.com/t/mip105-the-real-world-asset-collateral-scope-framework/19688",
                        "https://www.linkedin.com/in/jake-goldstein/",
                        "https://www.linkedin.com/in/silva-ryan/",
                        "https://www.linkedin.com/in/max-glass-67790363/",
                        "https://www.linkedin.com/in/davidbkrett/",
                        "https://docs.google.com/document/d/1wSfIFCGO64CWRu9LnqfMCdFfYzCg-rHBp89DJaTKilA/edit?usp=sharing",
                        "https://gov.centrifuge.io/t/introducing-the-centrifuge-credit-group/4994",
                        "https://docs.google.com/document/d/1Fi8A3k7YBNRjcIApZ0xmxcA6O0odQetgrA_Cev1vr9Y/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1sE0dpHb0oLxyop_DVTiaRiFeq8pexacYmWWOw_QX3YE/edit?usp=sharinghttps://docs.google.com/spreadsheets/d/1sE0dpHb0oLxyop_DVTiaRiFeq8pexacYmWWOw_QX3YE/edit?usp=sharing",
                        "https://www.iso.org/standard/78502.html",
                        "https://app.swaggerhub.com/apis-docs/RYANSILVA95/SkyVest-V0/0.0.0"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.622065975150391
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#27",
                    "likes": "3",
                    "time": "21/02/2023-17:14:06",
                    "content": "Thanks Jake! Good to see this up. Just to clarify my and Flipside’s role. We helped Jake and his team of passionate builders to develop a sound proposal, in our role as delegates. We’re not partial to this or any other solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving clarification on their role in proposal development",
                        "3rd party offering support for proposal development",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#28",
                    "likes": "3",
                    "time": "21/02/2023-17:35:39",
                    "content": "I promise to look into this proposal in more detail, thank you for taking the time to put it together. Nice to see familiar names on it too. On a first cut, my personal view is that the same points apply as with Untangled, though with fewer on-chain technical components. This is a very promising idea for standardizing data from RWA, and will likely be a very promising proposal for protocols that are starting out on the RWA journey. However, for Maker, it’s clear there is not a problem of data availability (the standardized data are all in fact correctly sourced from arrangers and foundation reports). Nor is it indeed a problem of data standardization, where one choice is likely as good as any other. Rather, it’s a problem of lack of independent verifiability. In this proposal this is kicked all the way out to stage 5 with a big question mark: From the document:     itsjake007:   Off-Chain  A person / process to collect or ingest raw data  Jake and Max did the first run, but we will outsource this data entry   Preferably, all RWA Arrangers are required to publish a .csv monthly,  Better, the .csv data must conform to the Standard Schema   Migration scripts will probably be in JavaScript or Python. They need to be written only once and then run monthly. Each time the raw data schema changes, the script needs revision The Standardized Data should live in an Off-Chain database  Download .csv here Hit API here   Publishing the Standardized Data: Open Data should be open source, downloadable as .csv or accessible via API. The same with permissioned data but MakerDAO must approve all permissioned Parties.      In my view, this treads familiar paths and does not solve our problem. It is remarkably useful for smaller protocols with fewer resources, but likely not something that will materially change the state of Maker’s RWA reporting. I am curious, though, on the selection of data standards and how the team was thinking about the applicability of RWA vaults of varying types to standards that might not fit. Also, would this proposal entail feeding individual loan-level data into the format, or report on an aggregate basis? From the document:     itsjake007:   On-Chain  Oracle: Monthly, each RWA Arranger should review the Standardized Data and sign it to signify it is accurate, true, and authentic.  Find an Arranger to sign (New Silver)   Their accountant and/or other 3rd party service providers should sign, if we can get them to use a wallet Publishing (here’s is where I am not certain and we should ask Tadeo)  What of this data should go on Ethereum? Raphael wants automated liquidation of RWA vaults (which I think will never happen) so there needs to be data about asset value impairment, defaults, losses, etc. Arweave for all of the data for posterity? Are there On-Chain APIs? HOW ABOUT PUBLISH .CVS’s on ARWEAVE, then publishing the hash and URL in an ETHEREUM transaction?   We could be a MetaDAO with each RWA Arranger owning a piece of the DAO as a mechanism to facilitate cooperation and open source this project.      I also disagree that on-chain liquidation is ultimately impossible–it is one of the things we should be striving for in the first place. EDIT: for clarity, I don’t mean liquidating vaults to a third-party on-chain (which still why shouldn’t we aim for that also), I mean:  Independent third parties attest the value of the NAV They contribute their updates to an RWA oracle The RWA oracle finds a robust way to get to a consensus value This value reaches the on-chain vaults If undercollateralized it triggers an executive spell to issue a DAO resolution to liquidate      adcv:  My interpretation of the DoI is that what we should be asking for is:  An autonomous set of incentives that drives independent third parties to verify and value our private credit investments A way of bringing these values on chain in a credibly neutral way with robust consensus-seeking algorithms Triggers for liquidations and on chain debt ceiling changes when off-chain thresholds are met A website would be nice if all of the previous were accomplished but is not in itself value-adding    Or something to that effect From the document:     itsjake007:   Presentation  Our goal is to collect, organize, and publish the data via .csv and API so that others can use it We will make it available to MakerBurn, to DAIstats, and to community members like SebVentures who have a knack for building DUNE Analytics dashboards  Consult with these front end folks   Our focus is only on building the highest quality data for others to use    Based on feedback we will refine our proposal and pricing estimate. Based on our proposal above and the assumption all data will be available via strategic finance or the arranger.   I really don’t believe we need to hire someone to input loan data into a csv file and put it on a website. Centrifuge vaults are already an improvement on pure off-chain structures which is a great start. But organizing this into ISIN, ECB, ISO, or an infinite number of possible loan tearsheet formats is not the problem this DoI should be looking to tackle, imho. This is clearly a well thought through piece of work of great relevance for protocols that are at an earlier stage of adaptation to RWA. But, again, though reasonable minds can disagree, I don’t personally believe a new website with standardized data is what our RWA efforts are missing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.654659495755387
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#29",
                    "likes": "3",
                    "time": "21/02/2023-19:24:49",
                    "content": "Excellent points here, adcv. My high-level takeaway, which I support 100%, is that Maker doesn’t need more tokenized RWA strategies; it needs monitoring and attestation solutions that allow the DAO to come up with verifiable numbers as vault valuations. I just published a DLO that should give us more time to develop the desired solution and - more importantly - allow teams to bid for what they can do best without having to do everything. I think SFCU would be the perfect project owner / PM, but it is not for me to decide. MIP97-SPx DLO | On-Chain RWA monitoring - Maker Improvement Proposals / RFC - The Maker Forum (makerdao.com) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#30",
                    "likes": "1",
                    "time": "21/02/2023-19:25:57",
                    "content": "See my post here on how I think we should move forward. I agree with a lot of what you’re saying. Thanks for your detailed reply.    Request for Proposals for a on-chain RWA monitoring solution Governance       Excellent points here, adcv. My high-level takeaway, which I support 100%, is that Maker doesn’t need more tokenized RWA strategies; it needs monitoring and attestation solutions that allow the DAO to come up with verifiable numbers as vault valuations.  I just published a DLO that should give us more time to develop the desired solution and - more importantly - allow teams to bid for what they can do best without having to do everything.  I think SFCU would be the perfect project owner / PM, bu…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is requesting feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.055555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#31",
                    "likes": "4",
                    "time": "21/02/2023-20:43:43",
                    "content": "@adcv I spent some time providing insights and advice to the team here. I think the view of liquidations being impossible – may have missed the words “in the short term” - but I will let the op clarify that. Ignoring this, I believe data standardization is necessary to facilitate automated liquidations and effective and verifiable collateral valuation. Currently, there are inconsistencies in the data between the different RWA vaults. After reviewing with the team the available data on several vaults (New Silver, HVB, and Blocktower), in some cases, the required data to perform a meaningful evaluation of the underlying collateral – is not publicly available and/or is restricted by confidentiality requirements. As a result, until such data is made available, it will be challenging to complete collateral valuation. (Whether the vault borrowers are willing or able to make the necessary data available is another question). Data standardization will also be important if we are to be able to implement a scalable and automated liquidation process – trad-fi markets use ISIN standards to classify the various Financial Instruments, and as these standards are internationally accepted, it is important that Maker try to adhere to these classification standards as much as possible, for two main reasons – namely for placing data on-chain and secondarily to gain more efficient access to the significant number of trad-fi investors that would have an interest in a liquidation scenario. Data standardization will also be essential to determine what data is placed on-chain to enhance liquidity. @adcv I would propose you reevaluate this draft proposal given the above context and also in the context that the phased approach proposed ensures that monies spent on this initiative, should it proceed,  are not wasted because key data dependencies are not in place. One final point, Maker should not forget that as one of the most significant players in the RWA space, it wouldn’t be remiss for Maker to propose data standards for RWA loans/collateral and lead the defi space in the development of any such standards. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.687361419068736
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CLL_Michael",
                    "index": "#32",
                    "likes": "8",
                    "time": "21/02/2023-21:41:17",
                    "content": "Hi everyone, Michael with Chainlink Labs here. After speaking with numerous MakerDAO community members, delegates, and potential vendors, we want to state our interest and intent to provide the infrastructure component for monitoring Maker’s Real-World Assets (RWAs) on-chain with Chainlink Proof of Reserve. Chainlink Proof of Reserve is a time-tested decentralized oracle solution that enables the reliable and timely monitoring of the off-chain and cross-chain reserves that back tokenized assets used within DeFi. Given that MIP63-SP13 requests that the RWA data be provided on-chain, a reliable oracle transport layer is required. We believe Chainlink Proof of Reserve provides the ideal infrastructure for this data-transport layer requirement, given its highly configurable design, decentralized infrastructure, and proven reliability. Chainlink Proof of Reserve was first deployed in 2020 to bring transparency to bring WBTC reserve data on-chain, and in the years since, our expertise in deploying PoR solutions has continued to expand. Asset tokenization and the role of oracles have also been a subject that Chainlink has been exploring for years. We have experience with many different asset issuers that have integrated Chainlink PoR, including fiat-backed stablecoins (TUSD, GBPT), gold-backed tokens (CACHE Gold), and cross-chain wrapped tokens (BTC.b, WBTC). Live Chainlink PoR feeds operating across various supported blockchains can be seen on the Data Feeds dashboard, which pulls from on-chain data. This data feed visualization dashboard could be considered as a solution for the data presentation requirement, or as an addition to any other service providers seeking to solve the data presentation bucket.  The architecture underlying Chainlink PoR utilizes a similar design as Chainlink Price Feeds, where an on-chain reference contract is updated with fresh data by a decentralized oracle network (DON) based on preconfigured triggers. The same set of node operators who actively help secure billions of dollars within DeFi via Chainlink Price Feeds also help secure Chainlink PoR feeds. Once published on-chain, PoR data can then be retrieved by off-chain dashboards and/or consumed directly by smart contracts. Notably, Chainlink PoR is agnostic to any data provider or third party, and we at Chainlink Labs are happy to work with any of the issuers, arrangers, or vendors who are interested in providing the data needed for off-chain asset reserve verification. To kickstart the process, we are actively discussing with several parties to help determine data sources and logistics for different RWA vaults. One example is providing on-chain monitoring for Monetalis’ RWA vault with $500M in US treasury assets. To support independent reports of these assets, we have connected with The Network Firm, a registered, independent CPA firm led by the same experienced team that led the digital asset arm of Armanino. Together, we can jointly provide transparency to the IBTA and IB01 assets in custody with Sygnum Bank under Monetalis Clydesdale, attested to by an independent CPA firm. Below is a high-level diagram of the architecture.  The Network Firm Proof of Reserve Diagram_V3.13511×981 175 KB  In the future, this model can be taken to the next level by integrating PoR into the DAI minting function or other relevant vault functions such as triggering liquidations or parameter changes. Below is an example of how the PoR reference contract can be used to help ensure that no DAI can be minted until collateral has been proven to be sufficient.  The Network Firm Proof of Reserve Diagram_V3.24125×980 225 KB  We want to emphasize that Chainlink is a highly flexible middleware infrastructure and DONs are fully customizable. Thus, PoR Oracle networks can be customized to use data from multiple different data sources, data presenters, and independent firms that are seeking to be service providers for this proposal. That said, we wanted to provide the community with a tangible example before the 30-day window for proposals ended. If the community determines that Chainlink Proof of Reserve fits the data transportation infrastructure for RWA on-chain monitoring, the potential solution presented for Monetalis can be expanded upon and/or extended to other RWA needs. We are excited about the opportunity to help the Maker community continue pioneering the growth and adoption of real-world assets! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp13-declaration-of-intent-to-develop-a-comprehensive-on-chain-monitoring-solution-for-rwa-vaults/19095",
                        "https://blog.bitgo.com/chainlink-brings-onchain-proof-of-reserve-to-wbtc-fcda00f2815c",
                        "https://blog.chain.link/asset-tokenization-bringing-real-world-value-to-the-blockchain/",
                        "https://data.chain.link/categories/reserves",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-documentation-hq/17923",
                        "https://www.thenetworkfirm.com/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.492965920134287
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#33",
                    "likes": "6",
                    "time": "21/02/2023-21:59:19",
                    "content": "New Silver would love to pilot the idea for proof of reserves for the real estate asset class. We have discussed with Chainlink Labs in the past and thought this would be valuable for the community. We have some ideas on implementation as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party wanting to collaborate on proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.732954545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlieyou",
                    "index": "#34",
                    "likes": "7",
                    "time": "21/02/2023-23:36:31",
                    "content": "Hey everyone, This is Charlie from RWA.xyz. We had prepared a proposal, but given that the DLO will supersede this RFP, we use this post to signal that we will be submitting multiple MIP98 work proposals if the DLO is ratified. About us – our mission is to shepherd traditional finance onto DeFi rails by providing end-to-end visibility into real-world asset origination and transactions. Our data has been cited by major news outlets and research firms including Bloomberg, Messari, and CoinDesk. If other proposal submitters would like to discuss collaborations, particularly around DLO Buckets 1, 2, and 5 (areas we have limited expertise in), please reach out over DM. Thanks! Charlie ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2019557823129245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/itsjake007",
                    "index": "#35",
                    "likes": "1",
                    "time": "22/02/2023-01:54:46",
                    "content": "    dbkcan:  “in the short term”   Yes in the short term. Instant liquidity would mean there is a robust enough secondary market to be able to purchase these assets at Maker’s liquidation. There is currently no secondary market for these types of assets and IMO for the foreseeable future until there is enough data to complete a meaningful evaluation/calculation. The process is also entirely manual as it stands now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.245192307692308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#36",
                    "likes": "3",
                    "time": "22/02/2023-10:27:03",
                    "content": "    CLL_Michael:  To kickstart the process, we are actively discussing with several parties to help determine data sources and logistics for different RWA vaults. One example is providing on-chain monitoring for Monetalis’ RWA vault with $500M in US treasury assets. To support independent reports of these assets, we have connected with The Network Firm, a registered, independent CPA firm led by the same experienced team that led the digital asset arm of Armanino. Together, we can jointly provide transparency to the IBTA and IB01 assets in custody with Sygnum Bank under Monetalis Clydesdale, attested to by an independent CPA firm. Below is a high-level diagram of the architecture.   Appreciate Chainlink for taking the time to write a proposal and some key ideas. At the risk of sounding boring, I do feel it treads the same pitfalls as publishing csvs on a website. Newer protocols with burgeoning RWA exposure may well appreciate this middleware. However, I anticipated this might happen at the time of writing the DoI:    MIP13c3-SP13: Declaration of Intent to Develop a Comprehensive On-chain Monitoring Solution for RWA Vaults   If we end up having three pairs of eyes look at the same website and punch it into a terminal, we are wasting our time and money. We can settle for something like this as an improvement on no information whatsoever–but we can do it quickly, efficiently and for cheap using existing tools e.g. MIP65 dashboard . This dashboard for e.g. by its own admission is more POC than prod but it’s strictly better than nothing. Please correct me if I am misrepresenting the work of Chainlink but this is essentially their much touted Proof-of-Reserves.   MIP65 is fundamentally the easiest to solve, has the lowest variation in NAV and is already technically being reported to a blockchain (Polygon). As @sebventures explains in another thread,    Thoughts of next steps for ALM and RWA   First so the dashboard is filled by a trusted source. Second, so we might use the NAV at some point instead of the vault loan outstanding. Third, a loop with the PSM to instruct directly the trustee when/what to sell (in line with the quarterly process). I don’t see much value in doing so for private credit.   Adding in Chainlink to do this and pay an accountant to do it solves the smallest, already solved problem in the DoI. Doing it for private credit with multi-year duration vaults is unnecessary at high frequencies. And ultimately, it occurs to me that Maker has already invested a considerable amount of time and resources in developing an in-house @Oracles-Core-Unit team who have both the mandate and the capabilities to develop precisely this sort of oracle and integrate it with the vault. A sunk cost fallacy is to consider prior investments when looking into jumping into something new. Going with a proof of reserves screen-scraper from Chainlink today would be something like an inverse sunk cost fallacy, where we invest the resources, and then write them off for no apparent reason in order to invest in something new and uncertain. The technology may well be worthwhile, but Maker has this capability already which begs the question, why do we need to look for something new to begin with? ",
                    "links": [
                        "https://www.thenetworkfirm.com/",
                        "https://forum.makerdao.com/t/mip13c3-sp13-declaration-of-intent-to-develop-a-comprehensive-on-chain-monitoring-solution-for-rwa-vaults/19095/8",
                        "https://dune.com/SebVentures/makerdao-mip65",
                        "https://forum.makerdao.com/t/thoughts-of-next-steps-for-alm-and-rwa/19899/7",
                        "https://dune.com/SebVentures/makerdao-mip65",
                        "https://forum.makerdao.com/t/mip65-quarterly-process/19755"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.466010101010101
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#37",
                    "likes": "1",
                    "time": "22/02/2023-15:30:48",
                    "content": "@adcv I’m surprised by the lack of open-mindedness here. For years, Maker has invested in oracles, further placing a dependency on this group while outside teams have grown with scale. It has ignored the tech and innovation developed by teams like Chainlink and Pyth. In our conversations, interest from Maker’s oracle CU did not come till the last second. Conversely, Chainlink has been invested in this process and offered deep interest from the start. As outlined in the Endgame,  DVC calls, and  even products like Announcing Phoenix Labs and Spark Protocol, Maker will benefit from working with legitimate outside organizations; why become insular? We’re excited about teams like Chainlink sharing their experience and qualification - and encouraging more to do so, aligning new communities, new technologies, and talent to join Maker. Most of all, we’re excited to empower the DAO with more choices. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907575757575758
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#38",
                    "likes": "3",
                    "time": "22/02/2023-15:47:36",
                    "content": "I generally agree that greater choice is good, and though I don’t necessarily agree with your comments on the specifics of Maker’s Oracles group, I won’t wade further outside of my comfort zone in terms of technical side-by-sides. However, I don’t believe I’m being insular. I contributed to this DoI and want to see it succeed. I’ve made specific, constructive, comments to the points where I don’t (personally) believe each proposal addresses the intent or the request outlined in the DoI. I’m trying to make sure we don’t dilute our expectations for results, so that the DAO doesn’t pay (twice) for something it already has. My pov should hardly be surprising, it has been on the threads from the very beginning:  if we settle for a website or a dashboard that doesn’t advance our ability to manage our vaults on-chain or improve the ability for third-parties to independently verify the inputs, we are not accomplishing the objective of the DoI. That Maker should get a lot of inbound interest should not be surprising to anyone either. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.116666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#39",
                    "likes": "18",
                    "time": "26/02/2023-16:25:59",
                    "content": " Introduction After pioneering Real World Assets, it’s great to see MakerDAO continuing to lead the way on monitoring and automation of RWA. Since its inception, the Oracle Core Unit has been steadily developing industry-leading Oracles with best in class decentralization and reliability. The OCU has developed all Oracles MakerDAO currently uses including:  DeFi tokens: GNO, AAVE, YFI, WBTC etc. Liquidity Provider (LP) Tokens: Uniswap, Sushiswap, and Curve LSD: Lido stETH and RocketPool rETH  The Oracle Core Unit recognizes the important role Real World Assets play in Maker and what the OCU’s role is, which is why we included it in our mandate. I encourage anyone not familiar with the Oracle Core Unit to read its mandate ratified and funded by MKR holders. I think you’ll find it matches up rather nicely with the required work scope. RWA Oracle - Generalize on-chain and off-chain processes for trust minimized RWA Oracles - Explore opportunities with external auditors to verify and endorse data provided by asset originators - Engage with asset originators and their intermediaries to devise generalize-able solutions  Oracle Dashboard Design and Develop a dashboard that clearly displays real-time information in an easy ton consume format about: - Feeds - Medianizers - Oracle Security Modules (OSMs) - LP Oracles - RWA Oracles  We’ve been waiting a long time for RWA to mature and now that the moment is finally here we’re excited to collaborate with the DAO to make it happen!  Problem In order to propose an appropriate solution, we have to define the problem we are trying to solve. There is no point in creating a solution looking for a problem. I want to reflect on the comments made by @adcv from the Strategic Finance Core Unit who has direct experience with managing RWA deals and is therefore most familiar with the present challenges. Not only has has he been quite clear in articulating the challenges MakerDAO faces, but also the types of potential solutions that are helpful (and more importantly NOT helpful!).     adcv:  My interpretation of the DoI is that what we should be asking for is:  An autonomous set of inemphasized textcentives that drives independent third parties to verify and value our private credit investments A way of bringing these values on chain in a credibly neutral way with robust consensus-seeking algorithms Triggers for liquidations and on chain debt ceiling changes when off-chain thresholds are met A website would be nice if all of the previous were accomplished but is not in itself value-adding        adcv:  However, for Maker, it’s clear there is not a problem of data availability (the standardized data are all in fact correctly sourced from arrangers and foundation reports). Nor is it indeed a problem of data standardization, where one choice is likely as good as any other. Rather, it’s a problem of lack of independent verifiability.       adcv:  My pov should hardly be surprising, it has been on the threads from the very beginning: if we settle for a website or a dashboard that doesn’t advance our ability to manage our vaults on-chain or improve the ability for third-parties to independently verify the inputs, we are not accomplishing the objective of the DoI.   My understanding of the above is that:  Maker doesn’t have a Data Availability problem, Maker has all the data we need Maker needs credible third parties to independently verify this information Maker needs a decentralized and censorship resistant RWA Oracle to bring this data on-chain An RWA Oracle is ONLY useful if the protocol triggers actionable events (modify debt ceiling, interest rate, or liquidate a vault). The presentation of this data in a dashboard does not solve the problem but can be a nice-to-have.   Solution Now that we’ve identified the problem we can begin to propose a solution.  Existing Work I’ll be the first to admit that the Oracle Core Unit has not done the best job communicating what we have been working on internally. We’re in final stages of hiring a Marketing lead so this should change in the near future. I would like to take the opportunity to give a brief update on a few deliverables we’ve been working on that are relevant to this initiative.  MIP65 RWA Oracle At the request of @SebVentures from Strategic Finance, the Oracle Core Unit has already completed work on a RWA Oracle for MIP65 (Monetalis). It will go live on-chain in the coming weeks as we roll out our next major Oracle upgrade (v1.15) into production.  Screenshot 2023-02-26 at 16.59.081490×242 57.8 KB   Oracle Archive and API The Oracle Core Unit has completed an Archiver and API which exposes ALL offchain and on-chain Oracle data enabling end-to-end traceability. Anyone can look at an on-chain update and decompose it down to its individual components from each Feed, all the way to tracing the raw data that was queried from a data source like an exchange. We want to set the standard for verifiable data.  Dashboard Architecture v13117×1606 412 KB   Screenshot 2023-02-26 at 17.29.161320×1566 140 KB   Oracle Dashboard The Oracle Core Unit is actively developing an Oracle Dashboard to display on-chain and off-chain Oracle data and illustrate the verifiable data concept enabled by the Archiver and API. The Dashboard initiative is being spearheaded by a superstar duo of industry veterans who designed the UX for Craigslist and design for SushiSwap. This could easily be extended to support RWA data. We expect to launch the Oracle Dashboard in Q2.  TOR The aforementioned release of Oracle v1.15 introduces support for TOR (yes, that TOR) as a p2p networking messaging protocol which runs in parallel with Secure Scuttlebutt and libP2P. This will upgrade the Oracle networks resiliency to withstand nation-level threat actors. Furthermore it will increase the security, availability, decentralization, and censorship resistance of the Oracle protocol. This is in stark contrast to our competitors who only use libP2P.  Screenshot 2023-02-26 at 17.34.141522×242 56 KB  Several of our current projects have significant overlap with deliverables required for this initiative. Extending these solutions to include verifiable RWA data will lead to a much more polished and integrated solution for ALL Oracle data.  Deliverables Data Models for each RWA Oracle client to poll RWA data from sources RWA Oracle smart contract for standardized RWA data Oracle relay client to publish Feed attested data to the on-chain RWA Oracle Oracle Archive and API with RWA data Oracle Dashboard with RWA data  Milestones The Oracle Core Unit’s proposal is to break up the solution into three milestones with each step delivering tangible value-add to the protocol. Milestone 1 (Data Accessibility) This milestone builds out the end to end core technological infrastructure of the solution. The goal is to deliver something useful  Work with Strategic Finance to compose appropriate Data Models for each RWA Vault Oracle client which implements the Data Models, queries, processes, signs data, and subsequently publishes RWA data to multiple redundant decentralized p2p networks (ssb, libp2p, TOR). Archive RWA data and expose it through an API Present RWA data in a dashboard  Milestone 2 (Protocol Automation) The goal of milestone 2 is to deploy the on-chain RWA Oracles with decentralized Feed consenus on Ethereum Mainnet* and connect them to an RWA Vault Automation contract which can automatically manage the debt ceiling, stability fee, and liquidations for RWA vaults based on RWA Oracle inputs. As stated by @adcv previously, there is no reason to deploy the RWA Oracle data on-chain prior to the RWA Vault Automation module being activated.  Relay client for reading batched RWA data from p2p networks and pushing it to an on-chain RWA Oracle smart contract. RWA Oracle smart contract deployed for each RWA vault RWA Vault Automation Contract**  *Publishing to other blockchain networks like Polygon would be MUCH cheaper, however protocol automation is only possible when the Oracle is on Ethereum. Future iterations could explore moving RWA Oracles to L2 to reduce gas costs, with the RWA Vault Automation contract on L1 accepting a Merkle Proof of the state of an RWA Oracle on L2. **The Protocol Engineering Core Unit would likely want to implement this contract as it interfaces with Maker Core. Milestone 3 (Data Verification) This is the final milestone which enables data verification by credible third party institutions.  Auditor Client - generates key, signs audited data supplied by the Asset Originator / Arranger, and publishes signed data to p2p network. Update RWA Oracle to only accept data signed by Auditor(s) Update Archiver and API to only support data signed by Auditor(s) Update Dashboard to only display data signed by Auditor(s)  The DAO would have to decide the type of institution it would like to work with, what kinds of guarantees are necessary, and how the relationship will be structured. Is the DAO looking for one or more CPA licensed firms, a BIG4 accounting firm like EY, or someone more specialized in the types of credit arrangements used by RWAs? The final composition of the End Game will impact who the appropriate counterparty is (Arranger? SubDAO? Ecosystem Actor?) for the Auditor. Note that the sequence of Milestone 2 and 3 can be switched if the DAO deems it appropriate to prioritize Data Verification over Protocol Automation.  Team Facilitator x1 (@NikKunkel) Smart Contract Engineer x2 Backend Engineer x3 Fullstack Engineer x1 DevOps Engineer x1 Operations Manager x1 Designer x1  Budget $0 As all of this is explicitly cited in the Oracle Core Unit’s mandate, the DAO has already funded this project through the Core Unit’s budget and thus no further compensation is required. I anticipate this will be well received by a DAO which has publically committed itself to reducing costs and getting more with less. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP65#sentence-summary"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7124306065124655
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#40",
                    "likes": "1",
                    "time": "27/02/2023-12:33:27",
                    "content": "This is incredible! Thank’s a lot for the deep work and development going into this proposal. I like everything about it. But one thing remains, I’ll quote @adcv here:     adcv:  An autonomous set of incentives that drives independent third parties to verify and value our private credit investments   These incentives are the DLO I recently proposed. More and more I’m coming to the conclusion that this proposal might showcase the power of DAO level objectives perfectly. With the DLO we have incentives for third parties to go out and attest to the underlying independently from arrangers. With OCU we have a transport layer at 0 cost to the DAO. And with SF or other parties these can build permissionlessly on top of the decentralized, resilient data feeds to constructs dashboards or data feeds for the numerous clients we have inside the ecosystem.  CVCs and Delegates (need dashboards that give them top level information at a glance) CUs, advisory councils and facilitators (need data so they can create more specific and bespoke in-depth representations) smart contracts, that ultimately should regulate exposure to individual RWA vaults on autopilot.  Given the amount of talent that has applied here, I suggest doing coordination meetings to find the best way to work together. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party proposing an additional idea to the proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.361201298701299
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#41",
                    "likes": "2",
                    "time": "27/02/2023-13:09:23",
                    "content": "Thanks @NikKunkel for such an enlightening post. It is great to understand what work is already being done/planned by the OCU to avoid doubling up (your zero budget of this work is a hit). We think that oracle should be a standalone work bucket that solves the data integrity issue as a feed to the auto-pilot, e.g. lowering DC. This is bucket 3 in @rspa DLO whereas bucket 2 could be augmented with the following:  work done by relevant firms and experts in validating and valuing private credit vaults - think of a Big4 accounting firm or a specialist asset valuer   An on-chain framework/tech including an incentive mechanism for the above parties to independently provide validation and valuation services  Thanks @rspa for clarifying the objective behind each work buckets on our call. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#42",
                    "likes": "0",
                    "time": "01/03/2023-02:19:49",
                    "content": "    adcv:  I’m trying to make sure we don’t dilute our expectations for results, so that the DAO doesn’t pay (twice) for something it already has.   As one of the contributors to the first iteration, I agree with this viewpoint more than anything else in the thread. Maker doesn’t need inefficient spending or duplication of efforts and surely doesn’t need to subsidize competition that isn’t for any benefit. Nuanced take but the space’s reliance on chainlink is both simultaneously net good and net dangerous. Maker’s oracles are a gold standard and really welcome the incredible work posted here from @NikKunkel ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.613636363636363
                }
            ]
        }
    ]
}