{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/link-risk-parameter-request-for-comment/2118",
            "title": "[LINK] Risk Parameter Request for Comment ",
            "index": 2118,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "emergency-response",
                "rfc",
                "link"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#1",
                    "likes": "2",
                    "time": "21/04/2020-18:40:27",
                    "content": "This thread is for discussion of risk parameters for LINK as a collateral type. An earlier discussion can be found in this thread [Action Required] State of the Peg. The parameters that should be discussed are  Debt ceiling Liquidation Ratio Stability Fee Auction parameters  As a result of this thread, a governance poll will go up (likely) Wednesday with a specific package of risk parameters. ",
                    "links": [
                        "https://forum.makerdao.com/t/link-collateral-onboarding-application/2586",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-17-2020-the-state-of-the-peg/2177"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "0",
                    "time": "21/04/2020-18:56:23",
                    "content": "You mean yes/no vote or we can choose between several packages? If we don’t get to choose the parameters - why? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#3",
                    "likes": "1",
                    "time": "21/04/2020-19:03:04",
                    "content": "We’re likely to put up a specific package of risk parameters into the poll. IMO it is infeasible to poll for multiple combinations of risk parameters. That type of discussion should be had in the forums. However, I’m open to hearing other ideas/solutions as well. Keep in mind, we are attempting to put this up for an executive vote in an expeditious manner. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/04/2020-19:25:43",
                    "content": "are we trying to fit this into this weeks poll? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#5",
                    "likes": "0",
                    "time": "21/04/2020-19:27:17",
                    "content": "Will have to circle back with the engineering teams to see if LINK is feasible for this week’s executive vote. In either case, we can still hold a governance poll to get the ball rolling. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#6",
                    "likes": "0",
                    "time": "21/04/2020-19:55:53",
                    "content": "    cyrus:  IMO it is infeasible to poll for multiple combinations of risk parameters.   I can’t see why that would be infeasible i.e.: option 1 - DC: 3M, LR: 180%, SF: 10%, auction params: (…) option 2 - DC: 5M, LR: 150%, SF: 5%, auction params: (…) option 3 - DC: 5M, LR: 150%, SF: 2%, auction params: (…) … I’d vote for the most conservative option as I don’t believe new collaterals will have an effect on the peg. Or we can start with the riskiest set of params and see it immediately?? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.65530303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#7",
                    "likes": "1",
                    "time": "21/04/2020-20:09:53",
                    "content": "1- I would go for 3 million ceiling (its market cap can justify higher ceiling but it is very risky collateral) 2- 170% collateral ratio (I don’t want it to be too high that no one would use) 3- 0% SF (for now until we fix the peg) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.016666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/04/2020-20:35:38",
                    "content": "When I think a bit more about it - maybe the SF should be the same (0%) for all (most) collaterals until we have more knowledge about how each one influences the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#9",
                    "likes": "2",
                    "time": "21/04/2020-20:35:51",
                    "content": "I think a good starting point is BATs risk parameters - potentially with a higher debt ceiling in order to facilitate more generation, and then later, when DSR utilization has gone up and the system is more in balance, a risk premium that properly captures the jump risks of the asset (which is also needed for BAT and ETH eventually). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#10",
                    "likes": "6",
                    "time": "21/04/2020-20:45:13",
                    "content": "I think LINK’s unpredictability would command a significantly higher LR than BAT IMO. Personally, I would target something closer to 200%, with a stability fee of ~10%. Debt ceiling is difficult to say. but I would consider anywhere between 5-15million. In particular, the high marketcap of LINK gives me pause. The total supply (including the non-circulating portion) is north of $3 billion. This has such a high predisposition to collapse that I think the only way to hedge against that would be with a significantly higher liquidation ratio. And even at 200%, I’m personally against including LINK with a 0% stability fee at inception. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.221212121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#11",
                    "likes": "1",
                    "time": "21/04/2020-21:22:41",
                    "content": "about the SF it is possible to borrow DAI using Link as collateral using Aave at 5% fee so we may discourage Linkers with 10% SF ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#12",
                    "likes": "0",
                    "time": "21/04/2020-22:59:35",
                    "content": "I think the concentration of LINK ownership presents some risk as well, we should try to base the DC on the free float that is not held by insiders ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ZacharyDMM",
                    "index": "#13",
                    "likes": "8",
                    "time": "21/04/2020-23:14:19",
                    "content": "Context about the supply of LINK: 35% was sold in the token sale in 2017 35% is going to node operators as an incentive to bootstrap the network 30% went to SmartContract Chainlink Ltd for continued development 364M tokens are currently circulating with a total supply of 1B tokens. Aave offers a 150% collateralization ratio for LINK backed loans with a borrowing rate for stablecoins at 2-3%. There’s $18.5M in LINK deposited which is 37% of Aave’s market size and 46% of Aave’s TVL, I think a big reason for such high usage is that Aave uses Chainlink reference data networks as their price feeds creating mutualistic relationship for both projects, so imho if Maker doesn’t offer similar competitive rates, LINK may not get used as much as expected. That being said, I don’t see much of downside to adding LINK. It has no blacklisting or backdoor, it is a native Ethereum token, and it has a real utility within the DeFi space growing in usage. Arguable about its fair valuation, but as far tokens go LINK seems to be an obvious and relatively safe choice. MCD was supposed to be about multi collateral vaults right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.715238095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/paraficapital",
                    "index": "#14",
                    "likes": "5",
                    "time": "22/04/2020-05:18:42",
                    "content": "Given LINK’s market cap of $1.2 billion, weaker liquidity profile compared to ETH, and overall risk to MKR holders, we suggest the following parameters: Debt Ceiling: 5-15MM Stability Fee: 5-10% Liquidation Ratio: 175%-200% Any launch parameters can be monitored and adjusted accordingly. If there’s an influx of demand for borrowing against LINK, then the debt ceiling and SF can both be raised. If the parameters are set too conservatively, this may not incentivize usage to have an impact on the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#15",
                    "likes": "2",
                    "time": "22/04/2020-05:42:01",
                    "content": "My thoughts: match the DC with BAT for now (3MM). We can wait to see LINK holders appetite and raise it later if necessary, Love the higher liquidation ratio idea will second 175-200% Stability fee: i think under normal circumstances i would say 8% but given the discount we are giving on ETH right now i could see it go as low as 2%. I think anywhere in that range would be ok to me. 2%-8% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.936507936507937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#16",
                    "likes": "2",
                    "time": "22/04/2020-09:38:57",
                    "content": "I think almost all DAI parameters lost their primary purpose. Now we are using the SF for what - adding some assurance on top of the LR or I’m missing something? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#17",
                    "likes": "7",
                    "time": "22/04/2020-10:37:24",
                    "content": "Since this is just a interim measure until we can do a proper risk analysis of link and go through the regular process, we don’t have to worry so much about the long term risk (when it comes to the SF), because it would only take a few months at most to get the full assessment done, and if the token went to 0 within this time, even a very high SF would not make any real difference, and the DC would be the main means of protecting the system from exposure. For that reason I think we’re better off starting with relatively low risk parameters, and then likely adjust them upwards once we do the full risk assesment. Otherwise we may see little to no effect from the onboarding at all and the action will be pointless. Something to keep in mind is that the first impression will be really important. If LINK is seen as being added with pointless risk parameters, that impression will stick, even when they are later adjusted through the proper risk assessment, and it could hamper usage in the long term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.447433333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#18",
                    "likes": "6",
                    "time": "22/04/2020-10:58:52",
                    "content": "LINK is in the same category as BAT, both are high value ERC20 tokens. Present BAT stats: Debt ceiling: USD 3 million Liquidation Ratio: 150% Stability Fee: 0% Purely based on BAT stats, LINK will have the following stats Debt ceiling: USD 6 million Liquidation Ratio: 150% Stability Fee: 0% The auction parameters of auction lot size, bid increment, auction duration and liquidation penalty should be identical for both coins. The above is only a brief face to face comparison of the two coins. Since MCD was launched with BAT as the initial collateral type new information has surfaced with regards to behavior of holders of this coin: BAT holders are highly reluctant to leverage the token. Even at 0% stability fee, only around 12% of the BAT debt ceiling is currently utilized. This could of course be caused by BAT holders not being aware of the possibility, or (more likely) it could be that BAT investors are the type of investors that does not take advantage of such opportunities, unlike USDC holders for example. It is also possible that the reason BAT is underused as collateral is because of the very low debt ceiling of USD 3 million. What whale or VC bothers to get out of bed for such a trival amount? Even if your bet pays off it won’t even cover monthly expenses of champagne or sugarbabes. Planet_X recommendation: We go with the below revised stats for both LINK and BAT. Multiply the BAT debt ceiling by 10x and see if that draws in major BAT token holders, at least this will get their attention. Same for LINK. If this fails to generate interest it will be a learning opportunity for the Maker community, as focus needs to shift towards more financially literate communities. Proposed BAT stats Debt ceiling: USD 30 million Liquidation Ratio: 150% Stability Fee: 0% Proposed LINK stats Debt ceiling: USD 60 million Liquidation Ratio: 150% Stability Fee: 0% If the psychology of LINK holders prove to be a better match with the opportunities of leveraged finance compared to BAT holders, we can always change the LINK debt ceiling at a later stage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.29019816390506
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#19",
                    "likes": "0",
                    "time": "22/04/2020-11:01:56",
                    "content": "    rune:  Since this is just a interim measure until we can do a proper risk analysis of link and go through the regular process, we don’t have to worry so much about the long term risk   I don’t worry about long term risk. I worry about short term risk. I would start with 1-2 mil debt ceiling. I don’t think BAT comparison make sense. Launching with BAT was just marketing move anyway: you did not have the balls to launch multi collateral dai with just 1 collateral, hehe. (i would do the same). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#20",
                    "likes": "6",
                    "time": "22/04/2020-11:43:59",
                    "content": "Woah @Planet_X, I was with you until you suggested increasing the BAT ceiling to 30 million and setting LINK to 60mm. If that actually gets used up we’d be in a very dangerous place where another Black Thursday-type crash could easily create tens of millions of DAI of extra bad debt. Remember that these assets probably have at least an order of magnitude poorer liquidity than ETH, and are more volatile and correlated to eachother (and ETH). This is increasing existential risk which is not currently justified IMO. I liked your base case of 3mm and 6mm debt ceilings much more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mike.wyre",
                    "index": "#21",
                    "likes": "1",
                    "time": "22/04/2020-12:06:55",
                    "content": "I feel like this adds a material amount of risk into the system. Ultimately, may pacify short term needs, but won’t serve its purpose come liquidation and providing system wide support. Just have a hard time seeing who’s the buyer in the event of liquidations. Don’t get me wrong, I’m excited at the diversification, and the link team have been doing hard work in the ecosystem (props!) but these are my reservations. LINK is risky due to the following reasons:   Extremely high market cap says that it’s deflating is likely to happen in a bull market as a way for realizing profits (stab in the dark here btw).   Halving / Bull-market is going to then draw the market to run up in the majors at first. BTC/ETH. As these start running, it’ll exponentially consolidate liquidity from all the alternatives. LINK I would think is going to sit in this category, and be consolidated.   In this situation you’ve now got Makers system at risk both financially and also reputationally (bad stability --> bad sentiment --> rinse/repeat). I believe the latter could be just as important as it’s likely going to be all eyes on Maker for it’s next move.    image946×2048 202 KB  Nuo for example was paying 30% on USDC compared to others (the pic should show). This is because the risk is priced on the asset liquidation. So while people probably supply it but the systemic issue only gets larger. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.603125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#22",
                    "likes": "5",
                    "time": "22/04/2020-13:20:39",
                    "content": "I agree we need to look out for the short term risk, but wouldn’t you agree that LR and DC are more important for mitigating short term risk, rather than SF? Meanwhile SF has the biggest impact on adoption. As a result I think a solution that has conservative LR and DC, but low SF, would suit our current situation regarding the peg the best. Then later, once a proper risk analysis where the asset is run through the general risk model we can then readjust to better reasoned long term values. I do think the BAT comparison makes sense, and honestly if BAT and LINK - the two top ICO ERC20 tokens - can’t be compared, I can’t see how you would compare any ICO ERC20 tokens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#23",
                    "likes": "0",
                    "time": "22/04/2020-13:32:28",
                    "content": "    rune:  Yes, but wouldn’t you agree that LR and DC are more important for mitigating short term risk, rather than SF? Meanwhile SF has the biggest impact on adoption. As a result I think a solution that has conservative LR and DC, but low SF, would suit our current situation regarding the peg the best.   I agree. I was just commenting on BAT comparison. There are similarities in a sense both are eth crypto tokens and correlated to the crypto market. Probably not much else? Also, BAT parameters are quite arbitrary and were never adjusted in it’s history. I don’t know much about LINK, which probably means i have conservative bias (debt ceiling). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.055555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#24",
                    "likes": "1",
                    "time": "22/04/2020-13:34:13",
                    "content": "I agree SF should be very low and even LR shouldn’t be too high… I think 200% will be too much that’s why I think 170 - 175% will be a good balance between the risks and not killing adoption by Link holders ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#25",
                    "likes": "3",
                    "time": "22/04/2020-14:38:14",
                    "content": "when we consider the three parameters: LR, SF, and ceiling 1- low ceiling protect us from chainlink team dumping their huge supply on us so it is the most important risk parameter in link case… so I would vote for low ceiling 2- high LR protect us against huge price drop and frankly Link has very similar price movements to Ether and the rest of crypto… so very high LR will just hurt adoption 3- SF right now is being used as a tool to restore the peg and not as a risk parameter so I would vote for 0% or near zero SF until the peg restored ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1153246753246755
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#26",
                    "likes": "2",
                    "time": "23/04/2020-03:47:23",
                    "content": "Correct me if I’m wrong, but at least over the last year LINK has had LOWER volatility than both ethereum and BAT. Certainly its liquidity is lower than eth, and we don’t know if the volatility will increase in the future, but I don’t see any good reason to set its LR higher than 150% at least as long as BAT has the same LR. Likewise maybe the debt ceiling should be 5 - 10 million so there is a chance of the impact on the price of dai that we require to fix the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.007142857142856
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#27",
                    "likes": "2",
                    "time": "28/04/2020-03:55:33",
                    "content": " image1245×857 92.2 KB   image1359×279 19.4 KB  LINK in AAVE market size : $18.89M Holders: 128,748  addresses Transfers:  2,885,807 LINK>BAT ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#28",
                    "likes": "2",
                    "time": "30/04/2020-00:30:45",
                    "content": " Debt ceiling:$10M Liquidation Ratio:150% Stability Fee:2% Auction parameters:3%  Link has a broad user base, which can bring more new users to maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.873579545454546
                }
            ]
        }
    ]
}