{
    "poll_list": [
        {
            "title": "Should we add ENJ to the Maker Protocol? - June 22, 2020",
            "index": "2639",
            "option": "No",
            "supporting_mkr": "37,295",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/enj-mip6-mcd-application-enjin/2639",
            "title": "[ENJ] MIP6 MCD Application: Enjin ",
            "index": 2639,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Marc_Enjin",
                    "index": "#1",
                    "likes": "7",
                    "time": "27/05/2020-10:29:53",
                    "content": "1) Who is the interested party for this collateral application? Enjin Pte. Ltd. 2) Provide a brief high-level overview of the project, with a focus on the applying collateral token. Enjin offers an ecosystem of integrated blockchain products, tools, and services that enable anyone to easily manage, explore, distribute, and integrate blockchain assets. The Enjin ecosystem is fueled by Enjin Coin (ENJ), an Ethereum-based cryptocurrency used to directly back the value of Enjin-powered blockchain assets. 3) Provide a brief history of the project. Enjin was founded in 2009 by Maxim Blagov and Witek Radomski. In the same year, the company launched a gaming community platform called the Enjin Network, which has since grown to more than 20 million users across 250,000 gaming communities. In 2017, following a successful ICO that raised 75,041 ETH ($18.9 million), Enjin began building a blockchain ecosystem, with a suite of user-first blockchain products that enable anyone to easily manage, explore, distribute, trade, and integrate blockchain assets. Built on top of a robust on-chain infrastructure and comprised of the Enjin Platform, Explorer & Marketplace, Wallet, Beam, and other tools and services, the Enjin ecosystem is fueled by Enjin Coin (ENJ), an Ethereum-based cryptocurrency used to directly back the value of Enjin-powered blockchain assets. To date, over 10.5 million ENJ has been locked into 52 million blockchain assets. Along with the many game developers using ENJ-backed assets in their games, Enjin’s tools and products are trusted by industry leaders like Microsoft, Samsung, Unity Technologies, and Binance. The company has also received investment from Blockchain.com Ventures. View the company timeline, which highlights development, adoption, partnerships, and more: Enjin Ecosystem Timeline | Enjin 4) Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Whitepaper: Enjin Coin whitepaper - whitepaper.io  Documentation: Enjin Platform  Source code: GitHub - enjin/contracts: Enjin Coin Contracts  Ethereum addresses: 0xf629cbd94d3791c9250152bd8dfbdf380e2a3b9c Website: https://enjin.io   5) Link any available audits of the project. Both procedural and smart contract focused audits.  Enjin Token Sale Audit: https://s3.amazonaws.com/files.enjin.com/81/enjin-coin-audit.pdf  Enjin Coin Security Audit Report: Enjin Coin (ENJ) · Issue #308 · EthereumCommonwealth/Auditing · GitHub   6) Link to any active communities relating to your project.  Telegram: Telegram: Contact @enjin_coin  Twitter: https://twitter.com/enjin  Reddit: https://www.reddit.com/r/EnjinCoin/  Facebook Group: Facebook Groups  Facebook: Redirecting...  Forum: https://forum.enjin.io/   7) How is the applying collateral type currently used? Enjin Coin (ENJ) is a utility token used to directly back the value of ERC-1155 blockchain assets minted with the Enjin blockchain game development platform. 8) Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? Enjin Pte. Ltd., Singapore 9) Where does exchange for the asset occur? ENJ is listed on more than 75 exchanges, including platforms like Binance, Bittrex, Upbit, Bithumb, and Binance.US.   CoinMarketCap    Enjin Coin price today, ENJ to USD live, marketcap and chart | CoinMarketCap Get the latest Enjin Coin price, ENJ market cap, trading pairs, charts and data today from the world’s number one cryptocurrency price-tracking website         CoinGecko    Enjin Coin price, ENJ chart, market cap, and info | CoinGecko Get Enjin Coin price, ENJ chart, trading volume, market cap, exchanges and more.         coincodex.com    Enjin Coin (ENJ) Exchanges - Buy, Sell & Trade | CoinCodex List of Enjin Coin (ENJ) exchanges with real-time price comparison where you can buy, sell or trade ENJ for other currencies and crypto coins.      10) (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. Yes, we have obtained a legal memorandum regarding the regulatory standing of Enjin Coin in relation to certain US federal and Singapore securities and other laws, rules, and regulations. ",
                    "links": [
                        "https://enjin.io/products/platform",
                        "https://enjinx.io/eth/assets",
                        "https://enjin.io/products/wallet",
                        "https://blog.enjin.io/enjin-beam/",
                        "https://enjin.io/about/enjin-coin",
                        "https://www.microsoft.com/skills/azureheroes",
                        "https://assetstore.unity.com/packages/tools/utilities/blockchain-sdk-by-enjin-124133",
                        "https://enjinx.io/eth/platform/3380",
                        "https://www.blockchain.com/ventures",
                        "https://enjin.io/about/timeline",
                        "https://whitepaper.io/document/390/enjin-coin-whitepaper",
                        "https://cloud.enjin.io/docs/",
                        "https://github.com/enjin/contracts",
                        "https://enjin.io",
                        "https://s3.amazonaws.com/files.enjin.com/81/enjin-coin-audit.pdf",
                        "https://github.com/EthereumCommonwealth/Auditing/issues/308#issuecomment-508447337",
                        "https://t.me/enjin_coin",
                        "https://twitter.com/enjin",
                        "https://www.reddit.com/r/EnjinCoin/",
                        "https://www.facebook.com/groups/TheAvenjers/",
                        "https://www.facebook.com/enjinsocial",
                        "https://forum.enjin.io/",
                        "http://Binance.US",
                        "https://coinmarketcap.com/currencies/enjin-coin/markets/",
                        "https://coinmarketcap.com/currencies/enjin-coin/markets/",
                        "https://www.coingecko.com/en/coins/enjin-coin#markets",
                        "https://www.coingecko.com/en/coins/enjin-coin#markets",
                        "https://coincodex.com/crypto/enjin-coin/exchanges/",
                        "https://coincodex.com/crypto/enjin-coin/exchanges/",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/21",
                        "https://forum.makerdao.com/t/collateral-status-index/2231"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.884640578719527
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#2",
                    "likes": "3",
                    "time": "28/05/2020-17:53:25",
                    "content": "Well, I guess I’ll kick it off then. Thank you so much for your application @Marc_Enjin I think this is one of the more exciting release posts I’ve read in Ethereum in a while… A real, production plugin for MineCraft using assets on Ethereum is no small thing. Question: do users have to use the Enjin wallet for this to work? (Not directly related to a collateral application I know, but I’m curious). The “Smart” wallet and Easy Automatic Payments seem cool, but forgive a skeptic his doubts about safety. Seems like a fairly healthy distribution, and a not-insignificant market cap to me. I can’t seem to find anything in the whitepaper that discusses this mechanism in detail though:     Marc_Enjin:  (ENJ) is a utility token used to directly back the value of ERC-1155 blockchain assets minted with the Enjin blockchain game development platform   What happens to the value of my “Sword of Ultimate Wrath” if the value of ENJ goes down, or up? How tightly coupled are the assets minted through the platform to the value of the coin, which is just an ERC20 traded on the open market, correct? Is there some strong relation between the number and type of ERC1155 assets minted, and the price of ENJ? ",
                    "links": [
                        "https://etherscan.io/token/0xf629cbd94d3791c9250152bd8dfbdf380e2a3b9c#balances"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.439954051796157
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marc_Enjin",
                    "index": "#3",
                    "likes": "1",
                    "time": "28/05/2020-18:10:37",
                    "content": "Thanks andytudhope for breaking the ice!  I think this is one of the more exciting release posts I’ve read in Ethereum in a while… A real, production plugin for MineCraft using assets on Ethereum is no small thing.  Appreciate the enthusiasm! I’m really curious to see what people build with it!  Question: do users have to use the Enjin wallet for this to work?  For the time being, that’s correct, the Enjin Wallet is required at the moment to connect/link it.  Seems like a fairly healthy distribution, and a not-insignificant market cap to me.  We’ve mostly had small contributions during the ICO, we didn’t work with any type of funds or capitals.  What happens to the value of my “Sword of Ultimate Wrath” if the value of ENJ goes down, or up?  The price itself doesn’t affect the performance of the item. In most cases, the value baked in could be seen as a “vendor scrap” or “bottom value” of an item on the market.  How tightly coupled are the assets minted through the platform to the value of the coin, which is just an ERC20 traded on the open market, correct?  Correct - There’s very little correlation for the time being between the locked ENJ inside assets, but it’s difficult to ignore that at some point it will start having an impact on the tokens scarcity. Keep the questions coming, happy to get into diverse topics and also hear out ideas from the community on the intersection of DeFi / Gaming / NFTs and how we could help play a part into it. ( This might be slightly off topic, but relevant to the overall reason we’re applying ) ",
                    "links": [
                        "https://blog.enjin.io/enjincraft-plugin-for-minecraft/",
                        "https://etherscan.io/token/0xf629cbd94d3791c9250152bd8dfbdf380e2a3b9c#balances",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-18-9am-pst-4-00-pm-utc/2814/6",
                        "https://forum.makerdao.com/t/weekly-mips-update-6/2914"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.621676587301588
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#4",
                    "likes": "3",
                    "time": "16/07/2020-19:16:08",
                    "content": "ENJ was listed on Aave today, details about liquidation ratios can be found here: https://app.aave.com/reserve-overview/ENJ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marc_Enjin",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/07/2020-07:08:48",
                    "content": "Thank you adding it! Also added to Chainlink feed    feeds.chain.link    Decentralized Price Reference Data | Chainlink Access the most versatile list of decentralized pricing networks to build your smart contracts, powered by the Chainlink network      ",
                    "links": [
                        "https://feeds.chain.link/enj-eth"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7857142857142865
                }
            ]
        }
    ],
    "group_index": "2381"
}