{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-dai-on-other-chains/8675",
            "title": "Makerdao / DAI on other chains ",
            "index": 8675,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "concerns"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Anonymous",
                    "index": "#1",
                    "likes": "2",
                    "time": "10/06/2021-11:31:28",
                    "content": "Hi, Makerdao is an awesome project as we all know, which has led to many forks of the project on different chains. Currently, Makerdao is selective of adding projects, with criteria’s such as:  Uncorrelated with major cryptocurrencies Large marketcap Lots of demand for credit using that collateral. As decentralized as possible  A crypto currency ecosystem that I come from (and many others), would probably not fit 1-2 of these requirements. Which leads to projects forking makerdao on their own chain, which is not a problem in its entirety, but what this does is creates many ‘dai’ clones, and has many crypto stable coins scattered, rather than on a united front, it is best if they can all work together, or more if these projects could issue dai? I ask this out of genuine concern, would makerdao be able/willing to cooperate with other projects on allowing them to issue dai, to vastly grow the dai ecosystem? or do other projects have to go on to create another stable coin that is not part of the dai ecosystem? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.401785714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ianaz",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/06/2021-11:50:05",
                    "content": "Looks like the original DAI is only going to be issued on Ethereum as it’s the most secure and decentralized smart contracts chain, but there are already (community-made) bridges to bring DAI to other chains. You lock them up on one side and withdraw on the other. The problem with that is that we can have different versions of DAI (like USDT and USDC). From what I see, one option would be to endorse one of the bridges or do one ourselves. You can read more about this here ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.966269841269841
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/09/2021-11:50:51",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}