{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-cadence-improvement/14972",
            "title": "Governance Cadence Improvement ",
            "index": 14972,
            "category": [
                "Governance"
            ],
            "tags": [
                "governance",
                "pe-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "18",
                    "time": "04/05/2022-23:33:48",
                    "content": " Governance Cadence Improvement Protocol Engineering in discussion with GovAlpha are adjusting the governance cadence from executive proposals being posted on Fridays to these being posted on Wednesdays. This change will have the effect of slightly increasing the time between polling and the executive by giving engineering teams more time to safely deploy protocol-changing contracts (spells). The spell cadence will continue to be weekly.  Detail Describing the old process for reference before describing the new process and its implications.  Old Process and Pitfalls Polls have typically been available on a Monday and end on a Thursday, with the output going into the spell for deployment on Friday, as shown below:  Old Process1284×604 27.9 KB  Spell complexity and the time needed to deploy executives has introduced risk when trying to do this within a 24hr period of time. The rationale behind the decision to change the current process is as follows:  It is not possible to adequately test spells on Goerli first before deploying to mainnet because of the limited time available in the current process It is not best practice to be working on two spells in parallel (Goerli and mainnet) which can lead to confusion as there are multiple changes being made at once. Similarly, not all parameters are the same in each environment (Goerli often has dummy variables to aid testing e.g. liquidation times etc).  Last minute changes to spell copy often introduce changes to the code which can further introduce last minute errors making it difficult to triage into both environments and test in time  24hrs is not enough turn around time to ensure testing and deployment of the spell. There is often additional work required on external supporting contracts (DssExecLib, Keepers, Liquidation contracts etc) It is not industry-wide best practice to be releasing code on a Friday evening. It is not fair to those in European or Middle Eastern timezones who are already into their weekend. It does not give enough time to review and accept PRs from other engineering teams.   New Process Our approach to alleviate the above concerns is to slightly extend the time between polls and executives to give all participants enough time to participate in governance. Namely, moving spells from Friday to Wednesday, as shown in the below diagram:  New Process2360×680 58.9 KB  In more detail:  GovAlpha will continue to launch polls as they do today, starting on the Monday and ending on the Thursday. GovAlpha will collate poll results along with any delegate or core unit payment details on Thursday in order to provide final spell copy to Protocol Engineering by Friday morning.  In parallel with the above;  Protocol Engineering will have commenced Goerli spell preparation at the beginning of the week, working with CES, Oracles and others to merge PRs into the Goerli spell. Protocol Engineering will update the Goerli spell with the spell copy provided by GovAlpha by Friday.  The following week;  Protocol Engineering will deploy the Goerli spell on the Monday before commencing the mainnet spell targeting deployment on Tuesday. Protocol Engineering will inform GovAlpha of the completed spell, who will then post it on the Governance Portal.   Known Considerations This shift in timeframe does introduce the potential for office hour spells to run over the weekend e.g. if it is passed on a Thursday it may not get executed till early the following week. We consider this to be acceptable and is not too dissimilar from today.  Conclusion This improved process will give engineering and governance teams greater time to confirm, write and include protocol changing parameters into spells in a much safer and less pressured manner than is done today. Due to the above changes occuring this week, the next executive vote will take place on Wednesday the 11th instead of this Friday, the 6th of May. We look forward to talking through this change on the next G&R call, and optimising this process with you if there are opportunities for further optimisation. ",
                    "links": [
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/75",
                        "https://forum.makerdao.com/t/pecu-month-in-review-may-2022/15947",
                        "https://forum.makerdao.com/t/weekly-mips-update-92/15933",
                        "https://forum.makerdao.com/t/governance-and-risk-194-thursday-june-09-at-17-00-utc/15664/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-91/15787",
                        "https://forum.makerdao.com/t/weekly-mips-update-90/15648",
                        "https://forum.makerdao.com/t/governance-and-risk-196-thursday-june-23-at-17-00-utc/15998/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-88/15329",
                        "https://forum.makerdao.com/t/weekly-mips-update-87/15220",
                        "https://forum.makerdao.com/t/governance-and-risk-189-thursday-may-05-17-00-utc/14965/2",
                        "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://forum.makerdao.com/t/weekly-mips-update-86-may-9-2022/15058",
                        "https://forum.makerdao.com/t/mip4c2-sp20-mip16-amendments/14980",
                        "https://forum.makerdao.com/t/weekly-mips-update-89/15464",
                        "https://forum.makerdao.com/t/governance-security-module-gsm-adjustment-informal-poll/16205"
                    ],
                    "GPT-summary": "The post explains a change in the governance cadence for executive proposals, moving from Fridays to Wednesdays. The change is intended to give engineering teams more time to safely deploy protocol-changing contracts. The post describes the old process, its pitfalls, and the rationale behind the decision to change it. The new process is explained in detail, including known considerations. The post concludes by stating that the next executive vote will take place on Wednesday the 11th instead of Friday the 6th of May.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.254765702134123
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/08/2022-05:34:07",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}