{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-brand-team-monthly-update-may-2022/15980",
            "title": "Maker Brand Team Monthly Update, May 2022 ",
            "index": 15980,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tobalgarcia",
                    "index": "#1",
                    "likes": "11",
                    "time": "22/06/2022-17:45:53",
                    "content": " Maker Brand Team Monthly Update, May 2022 This is a continuation of the Growth Core Unit Monthly Update, where we aim to describe in more depth the most recent milestones and ongoing work from the Growth’s Brand Team.  Highlights of the Month   220513_MakerDao_Nature POAP1179×826 58.6 KB  1) Nature — a Brand initiative for Maker Vault owners.  We designed the whole Nature campaign and coordinated the execution of all needed assets to make it work: narrative, website, integrations with POAP and One Tree Planted, etc. We developed the announcement strategy through MakerDAO Twitter, Maker Growth Twitter, and Bankless Publishing. At the time of writing, Maker Vault owners have minted 284 POAPs and planted 117 trees through this initiative.   Thanks @Uncle  for helping the planet! 2) PR — we began positioning MakerDAO in the international media  The Brand Team was approached by several journalists and media channels to discuss the Terra/Luna crash from the MakerDAO’s perspective. Thanks to our PR help, many media outlets have covered the Terra/Luna crash story with input from MakerDAO via quotes and interviews. We were offered a speaking opportunity on the Permissionless’ stablecoin panel, where Sam MacPherson participated. This participation also had media coverage. For further details, please visit our latest PR Updates.  3) MakerDAO Twitter — growing metrics  Since we started managing the official MakerDAO Twitter account, we’ve reached sustainable growth on its overall metrics. During this time, the MakerDAO Twitter account gained over 24,000 new followers, surpassing the 200,000 follower mark. Since the last tweet from the Maker Foundation times, we are witnessing record levels in monthly Impressions and Engagements metrics.   Our PR work   We started our PR work with a press release on the StarkNet Dai Bridge deployment. The response from the media outlets was very positive, having Maker mentioned in over 30 different media channels.    StarkNet Dai Bridge on Media   Decrypt - Ethereum’s MakerDAO to Launch on StarkNet, Promises 10x Lower Gas Costs 1   CoinDesk - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain 1   The Block - MakerDAO to integrate StarkNet to cut DAI transaction costs   CoinNews - MakerDAO to integrate StarkNet to cut DAI transaction costs   Yahoo Finance - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   Markets Insider - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   LatestCrytpoNews - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   Bitcoin.com Makerdao Plans to Integrate Ethereum L2 Solution Starknet to Lower DAI Transaction Costs   CryptoBriefing - MakerDAO’s DAI Heads to Ethereum Layer 2 StarkNet   Investing.com - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   CoinTelegraph Espanol - MakerDAO se implementa en la red de capa 2 StarkNet para mejorar las funciones de la moneda estable DAI   BitcoinEthereumNews - Makerdao Plans to Integrate Ethereum L2 Solution Starknet to Lower DAI Transaction Costs – Technology Bitcoin News   Technical Ripon - MakerDAO Deploys StarkNet on Layer-2 Network to Enhance DAI Stablecoin Features   InvestoSignals - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   Coinolik - MakerDAO, İşlem Maliyetlerini Azaltmak İçin StarkNet’i Entegre Edecek   BusinessFast - Makerdao Plans to Integrate Ethereum L2 Solution Starknet to Lower DAI Transaction Costs   Coinphony - DAI di MakerDAO si dirige verso Ethereum Layer 2 StarkNet   LatestCrytpoNews - DeFi OG Protocol MakerDAO Announces April 28 StarkNet Integration For Cheaper DAI Transactions   Yahoo Finanzas - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   Yahoo Finaças - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   The Defiant - MakerDAO Steps Up Multichain Strategy With StarkNet Rollout   Coindesk - Market Wrap: Bitcoin Fades From $42K, Alts Still Ahead as ApeCoin Pumps   Coindesk | The Hash - MakerDAO Moves Toward Multi-Chain With StarkNet Bridge   CoinTelegraph Brazil - MakerDAO implanta na rede de camada 2 StarkNet para aprimorar as funções da stablecoin DAI   Blockchain Reporter - MakerDAO To Integrate Ethereum L2 Solution Starknet   Coin68 - MakerDAO integrates StarkNet to cut DAI transaction fees, ambition to go multichain   Micky.com - Ethereum’s MakerDAO to deploy on StarkNet, guarantees 10x lower fees   BlackCryptoNews - Ethereum DeFi Staple MakerDAO Adds StarkNet Bridge in First Step Toward Multi-Chain   BlackCryptoNews - MakerDAO deploys on layer-2 network StarkNet to enhance functions of DAI stablecoin   Investing.com Turkey - Kripto para sektöründe günün öne çıkan haberleri   AIThority - MakerDAO Accelerates Multichain Strategy with StarkNet Integration   Portal Do Bitcoin - Integração do MakerDAO a camada do Ethereum promete taxas dez vezes menores   Crypto Noticias - Podrás usar DAI con menos comisiones en Ethereum gracias a esta integración de MakerDAO   Ihodl.com - MakerDAO Integrates StarkNet’s L2 Solution     The Terra/Luna crash generated new organic interest for Maker, and we took this opportunity to respond to media inquiries, placing Maker in a strong position within this situation.    Terra/Luna Crash Inquiries  Coindesk: ‘Stable in Name Only’: Stablecoin Issuers Speak Out as UST Craters Yahoo! Finance: ‘Stable in Name Only’: Stablecoin Issuers Speak Out as UST Craters Yahoo! Finance Hong Kong: ‘Stable in Name Only’: Stablecoin Issuers Speak Out as UST Craters Nasdaq: ‘Stable in Name Only’: Stablecoin Issuers Speak Out as UST Craters TIME - The Real Reasons Behind the Crypto Crash, and What We Can Learn from Terra’s Fall Yahoo! Finance - The Real Reasons Behind the Crypto Crash, and What We Can Learn from Terra’s Fall NewsDeal - What Terra’s Crash Means For Crypto and Beyond Globe World News Echo - What We Can Learn From Terra’s Fall, And What’s Next For Crypto Bloomberg - DAI Is King Of Decentralized Stablecoins After Terra Collapse    image757×443 47.8 KB   We’ve been working with Bankless on the publications of MakerDAO important updates and relevant topics.    Bankless Publications  MakerDAO’s Paradigm-Bending Bridging Solution Begins on StarkNet MakerDAO Lets Money Grow on Trees    With our PR agency, we’re running a Brand Analysis and a Sentiment Analysis, which helped us understand the overall sentiment in the media about Maker and how we can use that to determine our following KPIs as the Maker Brand Team.   image1240×1032 91.9 KB   Ongoing PR work:  Since rETH passed its Governance Poll, we’re preparing a press release to spread a positive message around this Collateral Onboarding Process.  The Societe Generale Maker Vault deployment is getting closer, and, in the same line, we’re preparing a press release with our PR agency around this important milestone (in the event that it is approved by MKR holders). A Crisis Management Process is being designed with the help of our PR agency. We’re working on 3 new articles to be published on Bankless Publishing.   Our Twitter work    Monthly Impressions: Total tally of all the times our Tweets have been seen.   New Project - 2022-06-22T130704.684693×409 43.4 KB  Monthly Engagements: All the ways people interact with the MakerDAO Twitter Account and its posts.  New Project - 2022-06-22T131150.014693×409 44 KB  New Followers: New gained followers by month.  New Project - 2022-06-22T131319.367693×409 47.7 KB   Our Twitter Highlights & Learnings:  We’ve surpassed the 200,000 followers mark and earned over 24,000 followers since we started to manage the MakerDAO Twitter account. We had record highs in Impressions and Engagements during the last month. Due to the Terra/Luna crash, the MakerDAO Twitter earned organic attention from a new audience. We noticed that and responded with reports and important information that positioned us in a safe perspective during this difficult market context. Based on our top-performing tweets, we learned that our audience is interested in knowing how the different components of the Maker Protocol work (educational content) and what the status of the Maker Protocol is (informational content). From there, we created a content strategy based on these 2 pillars: information and education.   Top Tweets from May by Impressions:  StarkNet Dai Bridge Announcement. MKR listed on Celsius. Status of the Maker Protocol after the market downtrend. Mastercad x ConsolFreight x MakerDAO. rETH & sETH2 Collateral Onboarding Processes.   The MakerDAO Announcement Table    During the month of May, we’ve managed and executed 7 important announcements:   MakerDAO is sponsoring Hack Money 2022 - May 3  Mastercard taps DeFi through MakerDAO & Centrifuge - May 10  WSTETH-B Vault Type onboarding - May 16  Celsius listed MKR - May 20  StarkNet Dai Bridge on Mainnet - May 30  Nature Initiative - June 5  MOMC Committed not to increase Stability Fees for several Maker Vaults until August 31st - June 9     Current status of the MakerDAO Announcement Table: Since we are currently working to coordinate all of the major MakerDAO announcements for our Twitter and media audience, we created a workflow that treats each announcement as a project, and whose documentation process is publicly updated through this Notion database called MakerDAO Announcement Table. You can access this public table via announcements.makergrowth.com  New Project - 2022-06-22T132205.6851437×843 87.9 KB   The Brand Team Ongoing Initiatives    New Ad on Bankless Podcast: We’ve developed our first advertising action through the Bankless Podcast. This podcast has been downloaded 2.7 million times over the month of May.  “Dai is different” campaign: We want to showcase the benefits of Dai among all the other stablecoins, and how its decentralization makes it the original and trully unbiased currency for the world.  MakerDAO logo system: With the help of our visual agency, we’re designing a logo system for each entity represented by MakerDAO: from products like the PSM, D3M, and Maker Vaults, to DAO-related entities like the Core Units, the Maker Governance, and Governance cycle’s steps.   We want to hear from you  Share your thoughts, feedback or tips with us in the comments below. Please use this link if you prefer engaging with us anonymously. ",
                    "links": [
                        "https://twitter.com/MakerDAO/status/1533442499024408577?s=20&t=JPjAoPeXJGe1ExIyPTzpGA",
                        "https://twitter.com/MakerGrowth/status/1533459308595367937?s=20&t=JPjAoPeXJGe1ExIyPTzpGA",
                        "https://banklesspublishing.com/makerdao-lets-money-grow-on-trees/",
                        "https://forum.makerdao.com/t/maker-brand-pr-updates/15582",
                        "https://decrypt.co/98252/ethereum-makerdao-launch-starknet-10x-lower-gas-costs",
                        "https://www.coindesk.com/tech/2022/04/20/ethereum-defi-staple-makerdao-adds-starknet-bridge-in-first-step-toward-multi-chain/",
                        "https://www.theblockcrypto.com/post/142641/makerdao-starknet-integration-ethereum-layer-2",
                        "https://thecoin.news/articles/makerdao-integrate-starknet-cut-dai-transaction-costs-1650450861805",
                        "https://fr.finance.yahoo.com/news/ethereum-defi-staple-makerdao-adds-103000478.html",
                        "https://markets.businessinsider.com/news/currencies/ethereum-defi-staple-makerdao-adds-starknet-bridge-in-first-step-toward-multi-chain-1031367427",
                        "https://latestcrypto.news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin/",
                        "http://bitcoin.com/",
                        "https://news.bitcoin.com/makerdao-plans-to-integrate-ethereum-l2-solution-starknet-to-lower-dai-transaction-costs/",
                        "https://cryptobriefing.com/makerdaos-dai-heads-to-ethereum-layer-2-starknet/",
                        "http://investing.com/",
                        "https://www.investing.com/news/cryptocurrency-news/makerdao-deploys-on-layer2-network-starknet-to-enhance-functions-of-dai-stablecoin-2806947",
                        "https://es.cointelegraph.com/news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin",
                        "https://bitcoinethereumnews.com/bitcoin/makerdao-plans-to-integrate-ethereum-l2-solution-starknet-to-lower-dai-transaction-costs-technology-bitcoin-news/",
                        "https://www.technicalripon.com/makerdao-deploys-starknet-on-layer-2-network-to-enhance-dai-stablecoin-features/",
                        "https://investosignals.com/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin-2/",
                        "https://www.coinkolik.com/makerdao-dai-islem-maliyetlerini-azaltmak-icin-starkneti-entegre-edecek/",
                        "https://www.businessfast.co.uk/makerdao-plans-to-integrate-ethereum-l2-solution-starknet-to-lower-dai-transaction-costs/",
                        "https://coinphony.com/it/dai-di-makerdao-si-dirige-verso-ethereum-layer-2-starknet-32757/",
                        "https://latestcrypto.news/defi-og-protocol-makerdao-announces-april-28-starknet-integration-for-cheaper-dai-transactions/",
                        "https://es.finance.yahoo.com/news/ethereum-defi-staple-makerdao-adds-103000478.html",
                        "https://br.financas.yahoo.com/news/ethereum-defi-staple-makerdao-adds-103000478.html",
                        "https://thedefiant.io/makerdao-l2-starknet/",
                        "https://www.coindesk.com/markets/2022/04/20/market-wrap-bitcoin-fades-from-42k-alts-still-ahead-as-apecoin-pumps/",
                        "https://www.coindesk.com/video/the-hash-on-cdtv-clips/makerdao-moves-toward-multi-chain-with-starknet-bridge/",
                        "https://cointelegraph.com.br/news/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin",
                        "https://blockchainreporter.net/makerdao-to-integrate-ethereum-l2-solution-starknet/",
                        "https://coin68.com/makerdao-tich-hop-starknet-de-cat-giam-phi-giao-dich-dai/",
                        "http://micky.com/",
                        "https://micky.com.au/ethereums-makerdao-to-deploy-on-starknet-guarantees-10x-lower-fees/",
                        "https://blackcryptonews.com/2022/04/20/ethereum-defi-staple-makerdao-adds-starknet-bridge-in-first-step-toward-multi-chain/",
                        "https://blackcryptonews.com/2022/04/20/makerdao-deploys-on-layer-2-network-starknet-to-enhance-functions-of-dai-stablecoin/",
                        "http://investing.com/",
                        "https://tr.investing.com/news/cryptocurrency-news/kripto-para-sektorunde-gunun-one-ckan-haberleri-2293887",
                        "https://aithority.com/technology/blockchain/makerdao-accelerates-multichain-strategy-with-starknet-integration/",
                        "https://portaldobitcoin.uol.com.br/integracao-do-makerdao-a-camada-do-ethereum-promete-taxas-dez-vezes-menores/",
                        "https://www.criptonoticias.com/tecnologia/podras-usar-dai-menos-comisiones-ethereum-gracias-integracion-makerdao/",
                        "http://ihodl.com/",
                        "https://es.ihodl.com/technologies/2022-04-21/makerdao-integra-solucion-l2-starknet/",
                        "https://www.coindesk.com/business/2022/05/13/stable-in-name-only-stablecoin-issuers-speak-out-as-ust-craters/",
                        "https://finance.yahoo.com/news/stable-name-only-stablecoin-issuers-190018918.html",
                        "https://hk.finance.yahoo.com/news/stable-name-only-stablecoin-issuers-190018918.html",
                        "https://www.nasdaq.com/articles/stable-in-name-only%3A-stablecoin-issuers-speak-out-as-ust-craters",
                        "https://time.com/6177567/terra-ust-crash-crypto/",
                        "https://news.yahoo.com/real-reasons-behind-crypto-crash-223934303.html",
                        "https://newsdeal.in/what-terras-crash-means-for-crypto-and-beyond/",
                        "https://globeecho.com/news/north-america/united-states/what-we-can-learn-from-terras-fall-and-whats-next-for-crypto/",
                        "https://www.bloomberg.com/news/articles/2022-05-17/-king-of-decentralized-stablecoins-surges-after-terra-collapse",
                        "https://medium.com/bankless-dao/makerdaos-paradigm-bending-bridging-solution-1d77ba11d688",
                        "https://banklesspublishing.com/makerdao-lets-money-grow-on-trees/",
                        "https://vote.makerdao.com/polling/QmfMswF2#vote-breakdown",
                        "https://forum.makerdao.com/t/sg-forge-socgen-risk-assessment/15638",
                        "https://twitter.com/MakerDAO/status/1524756317495250944?s=20&t=Z9gQPSDQ1gGfltR5SiCEOw",
                        "https://twitter.com/MakerDAO/status/1524756364169564160?s=20&t=efSsXEuhLcv5FNezGGBdKg",
                        "https://twitter.com/MakerDAO/status/1531307441023066115",
                        "https://twitter.com/MakerDAO/status/1527738347803840513",
                        "https://twitter.com/MakerDAO/status/1524756317495250944",
                        "https://twitter.com/MakerDAO/status/1524146761752891392",
                        "https://twitter.com/MakerDAO/status/1529891415207170048",
                        "https://twitter.com/MakerDAO/status/1521625660309049348?s=20&t=eYS6bGpckxQJ3ujiqSC8pQ",
                        "https://twitter.com/MakerDAO/status/1524146761752891392?s=20&t=fLUkzI0Z18UlL3JGS_ZF4w",
                        "https://twitter.com/MakerDAO/status/1526279850289504258?s=20&t=-jKFcCAgiQk7tnjoTtlufg",
                        "https://twitter.com/MakerDAO/status/1527738347803840513?s=20&t=00JjmmgJpgewc4NWTiG1NA",
                        "https://twitter.com/MakerDAO/status/1531307441023066115?s=20&t=ngafWVeNGLv5aJ1m-lcf_Q",
                        "https://twitter.com/MakerDAO/status/1533442499024408577?s=20&t=qvwUcTFWC8y_eet_J2xq9A",
                        "https://twitter.com/MakerDAO/status/1534899871303483394?s=20&t=MREksDFi5uM8zDXJ_tmJ0g",
                        "https://www.notion.so/MakerDAO-Announcement-Table-d0b985e511f34b0392741e4f3d1cd406",
                        "http://announcements.makergrowth.com",
                        "https://www.youtube.com/clip/UgkxbIxidmt2gNnc715nxT4DlWpSWCfzq2p_",
                        "https://freesuggestionbox.com/pub/dclolom",
                        "https://forum.makerdao.com/t/maker-brand-update-june-july-2022/16858",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-08-23-makerdao-linkedin-page/17401",
                        "https://forum.makerdao.com/t/maker-brand-update-august-2022/18158"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6651662731208186
                },
                {
                    "author_link": "https://forum.makerdao.com/u/colby",
                    "index": "#2",
                    "likes": "5",
                    "time": "23/06/2022-08:11:24",
                    "content": "    tobalgarcia:  s, we learned that our audience is interested in knowing how the different components of the Maker Protocol work (educational content) and what the status of the Maker Protocol is (informational content). From there, we created a content strategy based on these 2 pillars: information and education.   Hey, my name is Colby Anderson. I am currently the facilitator of the incubating core unit, Maker Academy. We have been creating educational content for the past few months as well as creating an online academy where people could go to learn. In addition to showing our own content, we will show content that SES is making and PECU is making. Perhaps, Growth could set up a meeting with Maker Academy to ensure there is no duplication of work going on. We could also show you some of our features to see if you would like to utilize them when developing your own content. My discord handle is colbyanderson#8887 The link to the Maker Academy discord is MakerAcademy ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tobalgarcia",
                    "index": "#3",
                    "likes": "0",
                    "time": "23/06/2022-18:49:26",
                    "content": "Hey Colby. Thanks for letting us know what you’re working on. That’s a very good idea. I will reach you and your team to discuss this and other potential initiatives between both teams  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.231249999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "21/09/2022-18:50:07",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}