{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/using-dai-in-blacklisted-countries-by-usa-government-and-usdc-legal-compliance/4256",
            "title": "Using DAI in \"blacklisted countries by USA government\", and USDC legal compliance ",
            "index": 4256,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "risk",
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#1",
                    "likes": "8",
                    "time": "18/09/2020-22:28:50",
                    "content": "We are increasing the USDC debt ceiling considerably, action that has been heavily supported by the community to take the PEG back to 1. This said, we are aware of risks this type of collateral brings to the platform. USDC legal compliance states: Without limiting the foregoing, you may not use the USDC Services if (i) you are a resident, national or agent of Cuba, North Korea, Sudan, Syria or any other country to which the United States embargoes goods (“Restricted Territories”) Being Cuban myself, I’ve suffered all kind of “special measures” whenever I want to register in any American site. I don’t live in the island since many years ago, even though I am continuously annoyed by any American service I want to be part in, I should count the story of my life and demonstrate that I’m a resident now of an European country (a very painful process, including sending all kind of documentations to demonstrate that I’m not longer in the island). What I mean with all this is: USA really takes measures against any company which breaks their embargo rules, and they had extended these to companies outside of their country (ie. European banks which have collaborated in some moment with the island). Some time before, a good friend of mine contacted me, with the idea of provide my team to support the development of a Crypto coin which could be used by Cubans to receive remittances, to store value (since the Cubans Pesos have value nowhere else), and to handle digital exchange in the island (yes there doesn’t exist internet payments, VISA and Mastercards doesn’t operate in the Island at all for instance, it is a country “frozen” in the time, those old cars you have seen driving in Havana talk by themselves about how frozen is the country in the time). At this moment due to the global pandemic in fact the situation in the island is worst than before. I’ve really thought in cooperating to build software through my company (a Software House), and use DAI as the mean to help in the Cuban situation. This said, I’m a member of MakerDAO, and MKR holder myself, and I’m worried that the usage of DAI in the island could really alarm the USA government and happen what we in fact see like very low probability (since DAI usage has really the potential to grow a lot there, and this one is backed so largely by USDC, this means that “indirectly” Cubans would be using USDC) Am I being too pessimistic in this regard? Which is the stand of MakerDAO community in front of USA Embargo against countries (including their citizen) like Cuba, and us Cubans which suffer the “bad luck” of have been born in a communist country? Which is the position of the community to support the usage of DAI in Cuba even at the expense of increasing the possibility to have USDC Vaults blocked and who knows which other actions could be taken by the USA government? Really open to the discussion, thoughts and ideas in this regard. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-17-en-espanol/4804",
                        "https://forum.makerdao.com/t/lending-money-to-any-company-with-assets-in-europe-and-around-the-world-rwa/5508/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313",
                        "https://forum.makerdao.com/t/maker-relay-ep-13/4310",
                        "https://forum.makerdao.com/t/maker-relay-ep-17/4798"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.048304473304474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "3",
                    "time": "19/09/2020-08:35:59",
                    "content": "That a good concern. BNP Paribas (big French bank) had a 9 billion fine some years ago as they used USD in Sudan, Iran and Cuba (the underlying business activity was legit). They paid the fine because they want to continue to do business in the USA. Most likely those were euro-dollars (dollars liabilities on a non US-regulated entity) meaning that DAI is almost the same. Obviously USDC is way easier to froze but I wouldn’t limit the problem to USDC. That’s a serious problem to consider when DAI supply > 1 billions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "1",
                    "time": "19/09/2020-11:17:19",
                    "content": "Nice thread, thank you. We are at 750m now, so very close to >1billions. And we are currently pushing full throttle with centralised stablecoins to fix the peg and increase DAI supply. QUESTION: assume the worst happens. The USA forces Coinbase/Circle to blacklist the USDC owned by the MakerDAO smartcontract as collateral. Then what? Is this the end of MakerDAO? Losing 200m would be a Black Thursday amplified ~40x. The same problem seems to arise with any other centralised stablecoin (currently most have roots in USA) and also USA-related RWA. What kind of protection can we envisage on this road? Surely, the Foundation has something to say on this topic? I guess they have definitely investigated the legal complications associated with RWA in the last months/years. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.592261904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#4",
                    "likes": "2",
                    "time": "19/09/2020-13:20:53",
                    "content": "No- you’re making a huge assumption that they wouldn’t make an announcement giving time for innocent USDC holders to wind down their CDPs.  If their goal was to remove USDC from makerdao, they have every reason to make an announcement giving users a few months to withdraw their collateral before they blacklist it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#5",
                    "likes": "0",
                    "time": "19/09/2020-13:24:14",
                    "content": "All the USDC users are doing is depositing USDC into a CDP.  This is entirely within the ToS.  The USDC vault holders have no control over how people use their Dai and there is no way to connect the Dai use to the USDC use.  If USDC decides they need to change their ToS to say its a violation to deposit into a makerdao CDP, they would give people a few months to unwind their CDPs and withdraw. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#6",
                    "likes": "1",
                    "time": "19/09/2020-13:38:53",
                    "content": "You could be right. But I would like to warn about something here, I’ve never seen that government to make announcements and give months to withdraw even for American citizens when it comes to their “fight against the terrorism”. Let’s see a hypothetical scenario: Some terrorist organization manage to control 1B USDC somehow, and move all that into Maker, taking 900M DAI of collateral which makes it “almost impossible” for anybody else to freeze their funds. Then they conduct some unheard operation in middle east. The government could prefer to risk 5B locked in MakerDAO (assuming that’s all what is locked) to “destroy the DAI being used to support the terrorism”, than permit those guys running wild with all their DAI. I know this is extreme, but I would not put my hands in the fire to affirm that they’ll give time for everybody to withdraw their collateral in USDC from MakerDAO under some scenarios, which I would not see “impossible” given previous actions of the USA government when it comes to these matters. Not that MakerDAO should permit terrorist actions, but for me is very different our DAO taking an action, that some government self proclaimed the guard of the world taking actions for what they consider is “to keep the peace”. The danger is real and exist, and there is no reason neither to assume and support we’ll have months to solve the issue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.525297619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "1",
                    "time": "19/09/2020-13:49:06",
                    "content": "There is strong evidence that they froze and seize assets before asking questions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#8",
                    "likes": "0",
                    "time": "19/09/2020-13:54:33",
                    "content": "Of course they would freeze the CDP from a criminal or terrorist organization - but that’s a manageable risk for the system.   The only risk that is not manageable is if they freeze all CDPs at once.   There is no precedent for the US govt seizing assets for individual who are not even suspected of having committed a crime. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#9",
                    "likes": "0",
                    "time": "19/09/2020-13:55:52",
                    "content": "They would definitely freeze the CDP from the terrorist organization without warning, but that’s a very different risk to the system of freezing all USDC collateral at the same time.   They do not seize collateral from people who are not suspected of having committed a crime ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#10",
                    "likes": "0",
                    "time": "19/09/2020-14:03:42",
                    "content": "Let’s say some individual have a Vault in USDC worth 1B, with a debt of 900M DAI. If I understood it correctly, they could blacklist the USDC address in control of that Vault. But that doesn’t solve the issue for them right?, still the individual has access to those 900M DAI. The only way they could impact really that individual, is damaging our DAO. A “hypothetical but not improbable” solution would be blacklisting some important USDC contracts addresses which makes impossible for the protocol to run operations in USDC, would be ways more effective, since probably that will bring DAI price at least down to all that USDC collateral (suddenly there will be that same amount of DAI not backed). In fact, with further negative effects and possible catastrophic results for MakerDAO and DAI PEG could tend toward 0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.239858906525573
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#11",
                    "likes": "0",
                    "time": "19/09/2020-14:11:24",
                    "content": "If there was such announcement many will likely leave the vault open, assume the LR overcost and keep the dai or swap it for another crypto ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#12",
                    "likes": "2",
                    "time": "19/09/2020-14:17:28",
                    "content": "I think this are real risks to consider although basically any action you take has a risk involved, from there onwards it’s a matter of trade offs. Eventually this risk would be mitigated by two actions:   Alignment with the peg: This should imply a reduction of the debt ceiling   Diversified collaterization of dai outstanding   Currently as a community we value the risk of peg deviation > USDC government full crack down but this could eventually change once the risk of deviation of the peg is lower ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.828703703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#13",
                    "likes": "1",
                    "time": "19/09/2020-14:23:44",
                    "content": "In that case, we  would just liquidate the remaining vaults before the blacklist went into effect and the problem would be solved. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#14",
                    "likes": "1",
                    "time": "19/09/2020-14:40:03",
                    "content": "IMO–If FinCEN has a difficult time catching USD laundering in the U.S. – pretty sure they’ll be behind the “Eight-ball” when it comes to catching the 1B USDC launderer. And assuming that the 1B USDC Launderer works for a Terrorist Org., what Arms Dealer is willing to accept USDC/DAI for 30 M1 Abrams, 5 Apache helicopters, and 10,000 AK-47s in 2020? I am pretty sure most Terrorist, Arms Dealers, etc., prefer CASH/ACH wire via Panama, Jersey/Channel Islands, St. Nevis, etc., versus digital internet money, A.K.A. stablecoins–that 99.99% of the world has never heard off. I also like to believe that Terrorist/Army’s are smart enough to know that USDC, BTC, ETH, etc., etc.,  are not a smart choice when it comes to washing money. Best to use Cash via laundering tactics IMO.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.21904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#15",
                    "likes": "1",
                    "time": "19/09/2020-20:15:23",
                    "content": "Organized crime working with that amount of money is sophisticated and will know how to use something like Tornado Cash if the use of ERC-20 stablecoins is conducive to its operations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#16",
                    "likes": "1",
                    "time": "19/09/2020-21:52:15",
                    "content": "I think I read before a thread discussing front-running a transaction which would blacklist vaults or one of the protocol contracts to protect against a USDC blacklisting. But probably it is not a realistic solution. I was wondering if @latetot point couldn’t be used in fact to secure further these kind of “controlled” stablecoins? Vaults blocked will translate in the long run to unbacked DAI, but let’s assume that Circle and USA government will consider this twice if it implies to freeze the money of a lot of innocent people,  then why not to put all the USDC in a common pool (it could be a Liquidity Pool) in a way that the only blocking scheme is to block whole that pool? Since you claim the USDC in that pool with a token which could be passed to different persons, then nobody can really block it (at least that all the pool be blocked, which we assume will not be done due to damaging so many people) I definitely support (and will continue supporting) the usage of USDC to keep the PEG below 1.01. If there would be tomorrow some vote to increase it further 200M, I will vote yes. But I really would like to find a solution to the risk of unbacked DAI which could appears after a blacklisting in one of these stablecoins. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5532407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#17",
                    "likes": "0",
                    "time": "20/09/2020-09:12:40",
                    "content": "Probably the solution to mitigate it is to diversify the collateral with out going over 80% MKR price market for each collaterals and having some reserves probably around 5% of the max value. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#18",
                    "likes": "2",
                    "time": "20/09/2020-13:19:04",
                    "content": "Actually - the way that you would block a vault is to blacklist the account that deposited the USDC into the CDP.  This would mean that they could never withdraw the USDC from the CDP they control.  It would have no effect on the ability to liquidate the vault - so it actually wouldn’t result in unbacked dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.479166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#19",
                    "likes": "1",
                    "time": "22/09/2020-13:37:19",
                    "content": "At 101% the (US) government would want to hurt both the terrorist funds (USDC) and MakerDAO since MakerDAO makes it so easy to wash dirty USDC for DAI. The solution is to stop relying on stablecoins because they don’t bring the peg, just problems. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#20",
                    "likes": "0",
                    "time": "13/10/2020-19:20:57",
                    "content": "    latetot:  the way that you would block a vault is to blacklist the account that deposited the USDC into the CDP.   If we start getting into blacklisting accounts then we’re no better than PayPal. And no matter how much anyone says, “we’ll only use it when necessary”, that button simply cannot be allowed to exist. Here is why: A) If blacklisting was to be put to a vote, the United States Federal Government wouldn’t accept that since there’s a chance that the answer will be “no” and MakerDAO won’t comply. This would likely be followed by the USFG unilaterally outlawing MakerDAO. We’d retain our liberty, but it would make business very difficult and could potentially be the death of the system. B) If blacklisting was put in the hands of a few elected agents, then there is almost a guarantee that at some point, someone will abuse the button and potentially a lot of damage will be done before they can be stopped. We’d be no better than the USFG. C) If blacklisting was put in the hands of a third party–I don’t know how or why we’d ever do that, but if we did–then the USFG could just order them to blacklist whomever they liked and at that point it could be very difficult to stop them doing that in the future. We’d be no better than <insert credit card company or bank name here>. D) If blacklisting was handed over to some code–again, I don’t know why we’d ever do this–then the code will be flawed and could return either false positives or false negatives. We’d be no better than YouTube.     bit:  The solution is to stop relying on stablecoins because they don’t bring the peg, just problems.   The whole point of all of this–cryptocurrency, smart contracts, the Internet–was to get around traditional institutions censoring free trade and the free flow of knowledge. And now, it seems like people are completely unaware that the Internet (by the tenets it has been built upon) and cryptocurrency (by its nature) are borderless. This entire thread shouldn’t even have to exist, but we’ve invited the problem in. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.591836734693878
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#21",
                    "likes": "4",
                    "time": "13/10/2020-23:09:33",
                    "content": "I think you are misunderstanding the context here:  the concern is that USDC custodians would blacklist the CDP - not that MKR holders would do it.  What USDC decides to do is beyond our control - but MKR holders to provide insurance that we would pay off the CDPs if they were blacklisted by USDC to maintain the value of Dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#22",
                    "likes": "0",
                    "time": "14/10/2020-14:44:39",
                    "content": "Perhaps you’re right, but I’m just not understanding how Circle would keep a user from interacting with their CDP, since Circle has no hand in any of our contracts. Does USDC have some properties that allow them to exert that kind of control over it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#23",
                    "likes": "1",
                    "time": "14/10/2020-16:13:49",
                    "content": "The USDC contract blacklist prevents an address from sending or receiving the USDC token, as far as I understand it. If a blacklisted user tried to withdraw USDC to the address used to create the Vault, the transaction would not succeed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#24",
                    "likes": "1",
                    "time": "14/10/2020-16:26:42",
                    "content": "Interesting. I wasn’t aware that was even possible, it was my understanding that a token that was in a user’s address was entirely under their control. I hope I’m not the only one who has a problem with that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "2",
                    "time": "14/10/2020-16:39:16",
                    "content": "A token isn’t really it’s own thing. It’s a number next to an address in the token contract. All tokens do something similar to this (which is from Dai):    mapping (address => uint)                      public balanceOf; A user has as much control over any individual token they own as is specified in the token contract. ERC20 is an interface, so things can be ERC20 and also have additional functionality. It’s entirely possible to make a token contract with an owner who can randomly seize tokens from other addresses. No one would want to use that though, for obvious reasons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3522727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#26",
                    "likes": "3",
                    "time": "14/10/2020-16:55:34",
                    "content": "Actually - both USDC and USDT have blacklist function.  I think Dai may be the only major stablecoin that does not have a blacklist function.   Nevertheless, people have criticized Dai for accepting collateral like USDC which could be frozen this way.  Having centralized collateral does not make Dai itself centralized especially if MKR auctions would be able to insure against the collateral being frozen.   While MKR could not insure all of USDC collateral right now if it was all frozen at the same time without warning, I do think it could insure one large CDP being frozen (e.g. if it was proven to be owned by a criminal and Circle  blacklisted it).  Hopefully we will eventually get to the point where MKR is big enough to insure against the loss of any one type of collateral, but we are not there yet today. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.301136363636364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#27",
                    "likes": "0",
                    "time": "13/01/2021-22:55:37",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}