{
    "poll_list": [
        {
            "title": "Parameter Changes Proposal - MakerDAO Open Market Committee - April 12, 2021",
            "index": "7358",
            "option": "Yes",
            "supporting_mkr": "63,524",
            "highest_fraction": 1.0
        },
        {
            "title": "Parameter Changes Proposal - MakerDAO Open Market Committee - May 10, 2021",
            "index": "7835",
            "option": "Yes",
            "supporting_mkr": "28,615",
            "highest_fraction": 0.98
        },
        {
            "title": "Parameter Changes Proposal - MakerDAO Open Market Committee - June 7, 2021",
            "index": "8476",
            "option": "Yes",
            "supporting_mkr": "31,986",
            "highest_fraction": 1.0
        },
        {
            "title": "Parameter Changes Proposal - MakerDAO Open Market Committee - June 28, 2021",
            "index": "8991",
            "option": "Yes",
            "supporting_mkr": "12,869",
            "highest_fraction": 1.0
        },
        {
            "title": "Parameter Changes Proposal - MakerDAO Open Market Committee - August 2, 2021",
            "index": "9584",
            "option": "Yes",
            "supporting_mkr": "13,130",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-1-june-2021/8476",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - 1 June 2021 ",
            "index": 8476,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group",
                "ppg-omc-001",
                "ppg"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "18",
                    "time": "01/06/2021-12:20:27",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @Akiva, @hexonaut, @ultraschuppi  1364×760 335 KB  Source: Risk Premiums & Competitive Rates June 2021 Table Notes:   Risk premiums and Maximum debt ceilings are based on recent simulations available at https://simulation.blockanalitica.com/   Negative competitive rates are mostly due to liquidity mining rewards at Compound & Cream and due to rates and rewards accrued on deposited collateral   Lending products between secondary lenders and MakerDAO are not standardized and therefore rates can not be strictly compared.   DC-IAM ttl and gap changes are not included in this table, see proposed changes below    Lending Market Overview DeFi lending rates are trending downwards for the second consecutive month and there is no reversal expected in the short term. Low rates are still maintained mostly by liquidity farming incentives. Additionally, potential rebalancing of investor portfolios into stablecoins and popularity of L2 lending have increased the supply of stablecoins on secondary lending platforms, pressuring rates lower.  Chart1200×742 99.9 KB  Source: Calculations by Monetsupply Similarly and as we have shown in the past month, rates on centralized venues have been also trending downward even before the recent price downturns. In the last week and after the two daily significant price drops, rates have only gone lower. At certain centralized venues perpetual funding rates even went negative, showing sentiment changed among traders.  Chart1200×742 34.5 KB  Source: Binance ETHUSDT Perpetual Swap (7d rolling annual funding rate) Another indicator of less bullish sentiment is increased supply of stablecoins as people rebalance their portfolios towards risk off allocation. Increase of PSM-USDC-A exposure is one indicator of this dynamic. Another is the increased supply of stablecoins after 19th of May.  1600×761 61.8 KB  1600×953 140 KB  Source: mkranalytics & coinmetrics  Proposed Changes  ETH-A:  Decrease SF from 5.5% to 3.5% Increase gap from 80m to 100m Decrease ttl from 12h to 8h  In order to lower USDC backing of DAI, maintain competitiveness and follow market rates lower, a decent cut to ETH-A rates is proposed. We are also increasing minting capacity which was too low on certain days in the past.  ETH-B:  Decrease SF from 10% to 9% Increase line from 50m to 300m Increase gap from 5m to 10m Decrease ttl from 12h to 8h  Smaller rate cut is proposed for ETH-B since we believe this vault type is still one of the most appealing leverage ETH products in DeFi currently. At the same time we are increasing debt exposure capacity after witnessing good performance in the new liquidations system. Minting capacity is therefore also increased, but still a bit conservative due to OSM delay risks (potentially we can reduce ttl further).  ETH-C:  Decrease SF from 3% to 1% Decrease ttlfrom 12h to 8h  Similarly as for ETH-A we are also proposing a bit more drastic cut for ETH-C vault type. We believe this vault type at 1% rate should be a nice boost to a much needed new DAI supply. Minting capacity is also increased, partially also to unify 8h DC-IAM parameters across all vault types.  WBTC-A  Decrease SF from 4.5% to 3.5% Increase gap from 15m to 30m Decrease ttl from 12h to 8h  General reduction in rates and improvement in minting capacity.  YFI-A  Decrease SF from 5.5% to 4.0% Increase line from 90m to 130m Increase gap from 5m to 7m Decrease ttl from 12h to 8h  General reduction in rates and improvement in minting capacity. YFI-A vault owners demonstrated a very healthy unwinding process at price crashes which was incorporated into risk models, revealing lower risk premiums. Therefore a lower rate and higher line can be introduced despite the expected debt exposure growth.  LINK-A  Decrease SF from 5.0% to 4.0% Decrease ttl from 12h to 8h  General reduction in rates and improvement in minting capacity.  UNI-A  Decrease SF from 3.0% to 2.0% Increase gap from 3m to 5m Decrease ttl from 12h to 8h  General reduction in rates and improvement in minting capacity.  RENBTC-A  Decrease SF from 5.0% to 4.0% Decrease ttlfrom 12h to 8h  General reduction in rates and improvement in minting DC-IAM minting capacity…  BAT-A  Decrease SF from 5.0% to 4.0% Decrease ttl from 12h to 8h  General reduction in rates and improvement in minting DC-IAM minting capacity.  AAVE-A  Decrease SF from 3.0% to 2.0% Decrease ttl from 12h to 8h  General reduction in rates and improvement in DC-IAM minting capacity.  MANA-A  Decrease ttl from 12h to 8h  Changes to DC-IAM minting capacity.  ZRX-A  Decrease line from 10m to 3m Decrease gap from 1m to 0.5m Decrease ttl from 12h to 8h  ZRX on-chain liquidity is still low and risk models are proposing lower debt exposure. For that reason DC-IAM minting capacity is also adjusted downward.  LRC-A  Decrease line from 5m to 3m Decrease gap from 1m to 0.5m Decrease ttl from 12h to 8h  LRC on-chain liquidity is still low and risk models are proposing lower debt exposure. For that reason DC-IAM minting capacity is also adjusted downward.  BAL-A  Decrease ttl from 12h to 8h  Changes to DC-IAM minting capacity.  COMP-A  Decrease line from 30m to 20m Decrease ttl from 12h to 8h  Risk models are proposing a bit lower debt exposure, again due to lower on-chain liquidity.  KNC-A  Decrease ttl from 12h to 8h  Changes to DC-IAM minting capacity to unify parameters.  UNIV2DAIETH-A  Decrease SF from 3.5% to 2.5% Decrease ttl from 12h to 8h  General reduction in rates and improvement in DC-IAM minting capacity. Lower rates should also help retain Maker’s UNI LP user base if Uniswap v3 triggers liquidity incentives.  UNIV2USDCETH-A  Decrease SF from 4.5% to 3.5% Decrease ttl from 12h to 8h  General reduction in rates and improvement in DC-IAM minting capacity. Lower rates should also help retain Maker’s UNI LP user base if Uniswap v3 triggers liquidity incentives.  UNIV2DAIUSDC-A  Decrease ttl from 12h to 8h  Changes to DC-IAM minting capacity to unify parameters.  UNIV2WBTCETH-A  Decrease SF from 4.5% to 3.5% Decrease ttl from 12h to 8h  General reduction in rates and improvement in DC-IAM minting capacity. Lower rates should also help retain Maker’s UNI LP user base if Uniswap v3 triggers liquidity incentives.  UNIV2UNIETH-A  Decrease SF from 5.0% to 4.0% Decrease ttl from 12h to 8h  General reduction in rates and improvement in DC-IAM minting capacity. Lower rates should also help retain Maker’s UNI LP user base if Uniswap v3 triggers liquidity incentives.  UNIV2ETHUSDT-A  Decrease SF from 5.0% to 4.0% Decrease ttl from 12h to 8h  General reduction in rates and improvement in DC-IAM minting capacity. Lower rates should also help retain Maker’s UNI LP user base if Uniswap v3 triggers liquidity incentives.  UNIV2LINKETH-A  Decrease SF from 4.0% to 3.0% Decrease ttl from 12h to 8h  General reduction in rates and improvement in DC-IAM minting capacity. Lower rates should also help retain Maker’s UNI LP user base if Uniswap v3 triggers liquidity incentives.  UNIV2WBTCDAI-A  Decrease ttl from 12h to 8h  Changes to DC-IAM minting capacity to unify parameters.  UNIV2DAIUSDT-A  Decrease SF from 3.0% to 2.0% Decrease ttl from 12h to 8h  General reduction in rates and improvement in DC-IAM minting capacity. Lower rates should also help retain Maker’s UNI LP user base if Uniswap v3 triggers liquidity incentives.  UNIV2AAVEETH-A  Decrease SF from 4.0% to 3.0% Decrease ttl from 12h to 8h  General reduction in rates and improvement in DC-IAM minting capacity. Lower rates should also help retain Maker’s UNI LP user base if Uniswap v3 triggers liquidity incentives.  Revenue Effect Proposed rate changes would lower annual rate income from 123m to 81m, ceteris paribus. There is some upside expected from higher demand because of lower fees and higher DC on ETH-B, which could be negated by potential refinancing of ETH-A vaults to ETH-C.  Other Recommendations  As risk is becoming undercompensated at lower fees for particular vault types, @Risk-Core-Unit recommends to maintain Surplus Buffer at minimum 3% of risk assets (currently this would be above 70m). This means less MKR is burning is preferred in the next months, which is to some extent already implied by the current setting of Surplus Buffer lerp module. Increasing ETH-B exposure carries higher auction risks, therefore shorter auction duration and more aggressive auction curve is recommended. It is also recommended to increase ilk.hole auction throughput parameter for ETH vault types, most specifically for ETH-B and ETH-C where growing debt exposure is expected. Post about proposed auction parameter changes is following soon.   Final Note Proposed SFs will get included into next week’s on-chain poll on June 7, 2021, and if passed will be included in an executive vote on June 11, 2021. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1iJQTkf2PXgW35hO_t9G3kOy4s7ST-MUrhBzX72_dQO4/edit?usp=sharing",
                        "https://simulation.blockanalitica.com/",
                        "https://docs.google.com/spreadsheets/d/17jX1Myon2tS3qNcmhmW0Rps5JEi0eqdIp3G8ET8_s3g/edit?usp=sharing",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-28-june-3/8525",
                        "https://forum.makerdao.com/t/adjusting-auction-parameters-for-eth-vault-types/8477",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-18-24-2021/8943",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-147-thursday-june-24-17-00-utc/8904/2",
                        "https://forum.makerdao.com/t/maker-governance-review-june-2021/9211",
                        "https://forum.makerdao.com/t/informal-poll-defi-summer-2021-by-makerdao/8425/23",
                        "https://forum.makerdao.com/t/maker-governance-review-july-2021/9758",
                        "https://forum.makerdao.com/t/are-governance-decisions-to-increase-ucsd-debt-limit-trading-an-increased-stability-of-dai-for-a-lower-value-of-mkr/8810/6",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/35",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-6th-2021/8724",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-145-thursday-june-10-17-00-utc/8590/8",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-48-en-espanol/8636",
                        "https://forum.makerdao.com/t/maker-relay-ep-48/8609"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.978564446306382
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/06/2021-12:48:49",
                    "content": "I can’t see the PSM DC increase on it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/06/2021-13:04:40",
                    "content": " image926×97 9.22 KB   Compound. :  -.20% Aave           :  1% I am not sure where we are going but we need to increase the PSM. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/06/2021-13:05:07",
                    "content": "PSM DC to 3 B is happening tomorrow anyway. Let’s hope we get some more DAI from lowered SF non-stablecoin ilks instead ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#5",
                    "likes": "1",
                    "time": "01/06/2021-13:07:38",
                    "content": "Really happy to see  super low SF on ETH-C a lot of more headroom on ETH-B  So we finally cover both super leveraged and super conservative ETH-holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.642857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "1",
                    "time": "01/06/2021-15:15:24",
                    "content": "Given that BAT-A and AAVE-A already had pretty decisive forward projections of loss for the year, is this recommended lowering of fees based on a model that would narrow that loss? What is the estimated increase in adoption at these particular rates, ceteris paribus? Or are these numbers simply to keep the rates in those ilks competitive with alternatives? Thanks! ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-48/8609",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/34",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.466666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#7",
                    "likes": "5",
                    "time": "01/06/2021-15:43:08",
                    "content": "For smaller collateral types there was a general tendency to reduce rates across the board because of the reasons mentioned in the post. Apart from vault types where the situation with liquidity or collateralization ratio distribution got worse and risk compensation would be hardly achieved if rates went lower (example such as ZRX and LRC). I think you are referring to the net loss of these two collaterals based on oracle costs? I think this needs a separate topic that deals with potential off-boarding of collaterals that have low usage versus oracle costs. Because we can’t predict whether a 1% rate cut will bring enough additional demand to finally offset these costs. Proposal is based on risk and competitive grounds, fixed costs would be another input. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.753787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#8",
                    "likes": "2",
                    "time": "07/06/2021-19:38:26",
                    "content": "Proposal is now up in the voting portal as a poll, please participate so it can go into the executive vote on 2021-06-10T22:00:00Z. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#9",
                    "likes": "2",
                    "time": "15/06/2021-09:21:12",
                    "content": "Update: since the onchain poll passed with a 100% approval, the currently running exec is containing these changes. Please help on bringing this to effect by placing your MKR onto it. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#10",
                    "likes": "3",
                    "time": "17/06/2021-17:55:09",
                    "content": "Update: the exec containing the proposed changes just got scheduled, so we are going to see the new rates in effect at 2021-06-21T14:00:00Z due to the office hour modifier ",
                    "links": [
                        "https://etherscan.io/address/0x1dB8b702416D3174dC2F5b12287383AB693f894f"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.028409090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "01/07/2021-17:55:12",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-4-may-2021/7835",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - 4 May 2021 ",
            "index": 7835,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group",
                "ppg-omc-001",
                "ppg"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "10",
                    "time": "04/05/2021-12:19:11",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @Akiva, @hexonaut, @ultraschuppi  image1821×1008 268 KB  Source: Risk Premiums & Competitive Rates May 2021 Table Notes:  Risk premiums and Maximum debt ceilings are based on Liquidations 2.0 which is in rollout right now Negative competitive rates are mostly due to liquidity mining rewards at Compound & Cream and due to rates and rewards accrued on deposited collateral Lending products between secondary lenders and MakerDAO are not standardized and therefore rates can not be strictly compared.   Lending Market Overview During the past month, Aave began a liquidity incentive program covering primary stablecoins, WBTC, and ETH. This has lead to a substantial decrease in borrowing rates on Aave v2 and has pushed down the overall competitive rate landscape Despite the bullishness surrounding ETH, rates on centralized lending or trading venues seem to be trending downward as share of leveraged long positions was overtaken by increasing net short positions in ETH at Bitmex. Similarly data from Binance show that funding for ETH perpetuals decreased recently, suggesting that leveraged long ETH positions have lost some steam.  1600×719 99 KB  Source: Bitmex ETH longs  833×497 45.2 KB  Source: Binance ETHUSDT Perpetual Swap (annual funding rate)  Proposed Changes  ETH-C:  Decrease SF from 3.5% to 3%  Although risk metrics on ETH vaults improved in general with increased collateralization ratio metrics, lower on-chain slippage and Liq 2.0 implementation, we still want to promote higher usage of safer ETH-C vaults as overall exposure to ETH in Maker’s portfolio is growing.  KNC-A  Increase SF from 2% to 5% Decrease line from 5 MM to 0 MM  KyberDAO is currently in a migration process from the current KNC-token to a new one. The liquidity for the KNC will very likely dry out at some point and we don’t see any reason to wait any longer, so we suggest pushing for the vault-owners to unwind their positions now. Note that there are only 11 vaults remaining having approximately 50.000 DAI debt in total. Please note, that there is also a Signal Request about the future of KNC-A.  TUSD-A + PAX-A  Increase SFs from 0% to 1% Decrease DC for PAX-A from 100 MM to 0    Utilization of TUSD-A hasn’t changed a lot since the DC has been set to 0. For PAX-A - where liquidity is really low - we have seen a substantial increase in utilization in the last weeks as users tend to use PAX-A vault to farm with DAI since PAX on-chain farming is limited. We want to encourage vault-owners to close their position (which is essentially a free short position on DAI). Later on - with Liq 2.0 - we are able to liquidate these positions in a more controlled manner, so the threat of vault-owners abandoning their vaults is not existing anymore. In case vault owners don’t unwind their positions, we may however accrue some fees from vaults going below 100% CR, but the amount estimated is small (max 25.000 DAI per month).  USDC-B  Decrease DC from 30 MM to 0   USDC-B was planned as a last resort when PSM is fully utilized and we see a liquidity crunch during liquidations. With Liq2.0 the risk of a lack of DAI-liquidity is a lot lower since a vault-liquidation can happen in a single TX thanks to flashloaning, so there is basically no need to keep this tool.  Others  ETH-A We considered raising the ETH-A SF by a small margin, since we believe users are very insensitive to small rate changes in the current environment. Additionally this would also further incentivize migration to ETH-C. However the decision was made not to make any changes, since we still have a substantial inflow of USDC into the PSM and still want to encourage further increase in DAI supply to meet increased demand.  ETH-B  We have seen a rather big liquidation on ETH-B last week which went pretty well and produced a nice income to the protocol. At a first glance this could be seen as an indicator that even with Liq 1.2 we are in a pretty safe spot. However, this liquidation did not happen during a big market drop and would probably have had a different outcome if this would have happened during a real market crash. We suggest playing it conservatively, so we decided against raising the line for ETH-B until we have some proof that Liq2.0 works significantly better than the current system. The currently running executive will move ETH-B to Liq 2.0 - if this passes we will hopefully have some more data at the next regular MOMC-Meeting in the beginning of June to revisit this topic.  UniLP tokens The APY for liquidity providers is still really high so we could easily increase the SFs - but since Uni V3 is about to launch tomorrow we decided to just wait how this evolved in the next weeks.  Final Note Proposed Parameter Changes will get included into next week’s on-chain poll on 2021-05-09T22:00:00Z, and if passed will be included in an executive vote on 2021-05-13T22:00:00Z. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1ObuwXert5g3b4IoNF3-iPrRIGZNwVfbJSlAOrBrWSFU/edit#gid=1552963597",
                        "https://app.aave.com/governance/11-Qmf1JeXiw8BDUoKJ89VmUJ8wy22D2udqL4HxprCG7DZ5zG",
                        "https://datamish.com/ethusd/180d",
                        "https://www.binance.com/en/futures/funding-history/1",
                        "https://blog.kyber.network/knc-token-migration-guide-fda08bfe62c2?gi=4ab8870e81d3",
                        "https://forum.makerdao.com/t/signal-request-adjust-knc-a-debt-ceiling/7706",
                        "https://www.mkranalytics.com/vaults/USD/TUSD-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling%2CCollateral%20-%20Collateral%20Price&start=1588456800&end=1620511199&granularity=Weekly",
                        "https://www.mkranalytics.com/vaults/USD/PAXUSD-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling%2CCollateral%20-%20Collateral%20Price&start=1588456800&end=1620511199&granularity=Weekly",
                        "https://www.mkranalytics.com/vaults/USD/USDC-B?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling%2CCollateral%20-%20Collateral%20Price&start=1588456800&end=1620511199&granularity=Weekly",
                        "https://www.mkranalytics.com/vaults/ETH/ETH-B",
                        "https://vote.makerdao.com/executive/liquidations-2-0-activations-oracle-feed-changes?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-140-thursday-may-6-17-00-utc/7792/3",
                        "https://forum.makerdao.com/t/maker-relay-episode-50/8897",
                        "https://forum.makerdao.com/t/maker-governance-review-may-2021/8613",
                        "https://forum.makerdao.com/t/maker-relay-ep-50-en-espanol/8966",
                        "https://forum.makerdao.com/t/knc-migration-plan/7705/2",
                        "https://forum.makerdao.com/t/signal-request-adjust-knc-a-debt-ceiling/7706/4",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-140-thursday-may-6-17-00-utc/7792/4",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-30-may-6/7883",
                        "https://forum.makerdao.com/t/maker-relay-ep-52/9191",
                        "https://forum.makerdao.com/t/maker-relay-ep-52-en-espanol/9209",
                        "https://forum.makerdao.com/t/maker-relay-ep-44/7974",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/29"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25370087428911
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/05/2021-12:40:18",
                    "content": "    ultraschuppi:  During the past month, Aave began a liquidity incentive program covering primary stablecoins, WBTC, and ETH. This has lead to a substantial decrease in borrowing rates on Aave v2 and has pushed down the overall competitive rate landscape Despite the bullishness surrounding ETH, rates on centralized lending or trading venues seem to be trending downward as share of leveraged long positions was overtaken by increasing net short positions in ETH at Bitmex. Similarly data from Binance show that funding for ETH perpetuals decreased recently, suggesting that leveraged long ETH positions have lost some steam.   If this is the case why did you not consider decreasing ETH-A SF to compete? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.77020202020202
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "1",
                    "time": "04/05/2021-12:44:57",
                    "content": "    Aaron_Bartsch:  If this is the case why did you not consider decreasing ETH-A SF to compete?   ETH-A utilization is still growing and demand seems to still be really high (despite almost x3 the SF in the last 6 months).  I don’t think we have a real issue in terms of competition for those who are mega bullish and want to leverage as much as possible. For those who want to leverage moderately ETH-C is the right spot - and we propose to lower the SF there. No need to leave money on the table. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.538095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/05/2021-12:47:12",
                    "content": "    ultraschuppi:  demand seems to still be really high   But it could be even higher * taps head *. I guess we’ll never know. Edit: There is a lot more competition in this landscape these days. My intuition says that while a large portion may not be rate sensitive, there is still a large section that follows the best rates (since migration is so easy). This is the supply we’re missing out on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.484391534391535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "2",
                    "time": "04/05/2021-12:47:57",
                    "content": "I think everyone knows we are a bit over the price at the moment but, My understanding is that we should wait a bit until aave rate settled to see exactly where we are. I haven’t been part of the meeting but for me it makes sense to wait a month or two before changing things. Aave started one week ago and there are actually significant rate changes on they side. From 30% to 3%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#6",
                    "likes": "0",
                    "time": "04/05/2021-12:53:39",
                    "content": "    Aaron_Bartsch:  Edit: There is a lot more competition in this landscape these days. My intuition says that while a large portion may not be rate sensitive, there is still a large section that follows the best rates (since migration is so easy). This is the supply we’re missing out on.   Yeah well - I initially had the same feeling and I was surprised about the lack of adoption of ETH-C. My read on that is: the majority of players are totally okay with paying higher SF for being able to have a lower LR. For those that are happy with exposing a lot lower risk on us (by running with a higher CR): ETH-C is there - a lot cheaper than ETH-A  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.553968253968254
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "0",
                    "time": "04/05/2021-12:56:04",
                    "content": "Fair enough, I don’t see the risk side. So you’re saying that from a risk perspective, the rates we have at the CRs we have are as low as we should go right now given market conditions? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.232142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "2",
                    "time": "04/05/2021-14:01:41",
                    "content": "    ultraschuppi:  Yeah well - I initially had the same feeling and I was surprised about the lack of adoption of ETH-C. My read on that is: the majority of players are totally okay with paying higher SF for being able to have a lower LR.   Yes–agree. Good call/decision by the RISK Team on keeping Rates for ETH-A steady. As you said, the majority of folks are okay with paying higher fees–the opportunities in DeFi to gain higher returns with DAI are endless. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.288194444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#9",
                    "likes": "6",
                    "time": "04/05/2021-14:47:00",
                    "content": "    Aaron_Bartsch:  So you’re saying that from a risk perspective, the rates we have at the CRs we have are as low as we should go right now given market conditions?   We got 4.1% risk premium for ETH-A, mostly because ETH on-chain liquidity is really high and CR distribution improved. But there are few inputs of the model that we can’t really predict until we have Liquidations 2.0 running. For instance we aren’t yet sure what the average keeper’s profit will be in auctions. Higher profit means lower realized settlement prices in auctions and higher probability of loss for Maker, essentially higher risk premium. I think it is fair to say that Maker has this enormous advantage when it comes to borrowing larger amounts. So even if rates are lower at Aave and Compound, Maker is still much more competitive on the loan availability side of things as there are no liquidity constraints for taking out a loan. Not to mention OSM feature, non-volatile rates, etc…This is why I am personally not too worried if Aave or Compound are cheaper for 3 to 5% after liquidity incentive rewards. Especially in this market environment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.954621848739495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#10",
                    "likes": "0",
                    "time": "04/05/2021-15:20:11",
                    "content": "Thank you for putting my concerns to rest! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "0",
                    "time": "04/05/2021-22:03:54",
                    "content": "    Primoz:  I think it is fair to say that Maker has this enormous advantage when it comes to borrowing larger amounts.   Let’s not forget that if you’re really doing large scale stuff, with Maker you don’t move the market like with a LP. Also, our variable rates are a lot more fixed than many alternatives ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.383928571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#12",
                    "likes": "1",
                    "time": "15/05/2021-08:03:56",
                    "content": "Update: the proposed changed passed the onchain poll and are now part of this weeks exec. Please cast your vote ",
                    "links": [
                        "https://vote.makerdao.com/executive/parameter-changes-and-oracle-updates?network=mainnet#proposal-detail"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "29/05/2021-08:04:18",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-29-july-2021/9584",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - 29 July 2021 ",
            "index": 9584,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "ppg-omc-001",
                "ppg"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "10",
                    "time": "29/07/2021-16:44:50",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @Akiva, @hexonaut, @ultraschuppi  image1810×757 164 KB  Source: Risk Premiums & Competitive Rates August 2021 Table Notes:  Risk premiums and Maximum debt ceilings are based on Liquidations 2.0 Negative competitive rates are mostly due to liquidity mining rewards at Compound & Cream and due to rates and rewards accrued on deposited collateral Lending products between secondary lenders and MakerDAO are not standardized and therefore rates can not be strictly compared.   Lending Market Overview Will be delivered tomorrow  Proposed Changes  ETH-B: Decrease SF from 6.0% to 5.0%  The current SF on ETH-B is still pretty high compared to the rest of the market. As we haven’t seen a lot of USDC unwinding from PSM-USDC-A we suggest lowering the rate a bit to encourage more DAI from non-USDC. Decreasing the SF will cut our revenues by ~ $340.000/y.  LRC-A: Decrease line from 3 MM to 1 MM  Liquidity for LRC has dropped a lot - even on Loopring itself - so the Modeled Debt Ceiling is lower than the current utilization. We suggest lowering the Maximum Debt Ceiling therefore. Note there is also an ongoing task for the mandated actors to make a plan on how to offboard LRC.  UNIV2ETHUSDT-A: Decrease line from 10 MM to 0  @Risk-Core-Unit proposed to offboard this ilk as the utilization has been really low and generates virtually zero income, whereas downside risks related to USDT are high considering available debt ceilings. We support this idea and therefore propose to change the line to 0 as a first step of offboarding.  UNIV2DAIUSDT-A: Decrease line from 10 MM to 0 @Risk-Core-Unit proposed to offboard this ilk as the utilization is at 0 and generates zero income, whereas downside risks related to USDT are high considering available debt ceilings. We support this idea and therefore propose to change the line to 0 as a first step of offboarding.  UNIV2DAIUSDC-A  We are not proposing any changes to this ilk but we support the outcome of the Signal Request dealing with the line change.  Final Note Proposed changes will get included into next week’s on-chain poll on 2021-08-01T22:00:00Z, and if passed will be included in an executive vote on 2021-08-05T22:00:00Z. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1SiuvsR8CnOF-ARtv09LB3FBk0_z8qgL1ZB0zGRBzYD8/edit#gid=1552963597",
                        "https://www.mkranalytics.com/vaults/ETH/ETH-B?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CCollateral%20-%20Collateral%20Price&start=1619647200&end=1627595999&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/LRC/LRC-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CCollateral%20-%20Collateral%20Price&start=1619647200&end=1627595999&granularity=Daily",
                        "https://vote.makerdao.com/polling/QmTXLUng?network=mainnet#poll-detail",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2ETHUSDT-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1619647200&end=1627595999&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2DAIUSDC-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1619647200&end=1627595999&granularity=Daily",
                        "https://forum.makerdao.com/t/signal-request-adjust-univ2daiusdc-a-dc-iam-line/9481",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-1st-2021/9657"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "3",
                    "time": "30/07/2021-11:15:07",
                    "content": "Thanks Schuppi. Just wanted to say that I appreciate that you’ve added the effect on income under the ETH-B entry. Is that going to become a new standard moving forwards? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "2",
                    "time": "30/07/2021-11:23:52",
                    "content": "Yeah, it is part of the spreadsheet now. So no reason not to add it in the future. It is still a guesstimate based on current usage. If ETH-B adoption goes up, we can even end up net-positive ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#4",
                    "likes": "2",
                    "time": "30/07/2021-12:36:37",
                    "content": "Yeah its useful and definitely hope we do end up net positive. I’ve wanted a more liberal approach to ETH-B for some time. I think on the last PPG proposal several people asked for it so nice to see the proposal being adapted for it. If there’s more than one ilk having the SF lowered (or increased!) would you look at providing the net projected change at the end of the proposal? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.126136363636364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#5",
                    "likes": "9",
                    "time": "31/07/2021-02:18:57",
                    "content": " Competitive Rate Methodology Previously, we’d used an average value of the effective borrowing rates from Aave v1, Aave v2, CREAM Finance, Compound, Nexo, Celsius, and BlockFi, with each lender comprising 1/7 of the final value. However, liquidity has declined significantly on Aave v1 and CREAM so beginning this month I will no longer be including these two defi lenders in the competitive rate calculations. We’ve also found that rates on CeFi lenders tend to be much higher than Compound or Aave v2, which skews the competitive rate calculations. To account for this, their weight within the average has been reduced. Beginning this month onward, the average competitive rate value will be calculated with 1/3 weighting to Compound, 1/3 weighting to Aave v2/AMM market (depending on the collateral asset), and 1/9 weighting to each of Nexo, Celsius, and BlockFi. I believe this offers a more accurate view of the competitive landscape for crypto lending.  Lending Market Overview  image1318×1144 89.5 KB  Source: Paperclip Labs Compound Dashboard Borrowing rates have continued to be relatively low across defi lenders. The chart above shows Compound’s stablecoin borrow rates over the past month (including the effect of COMP subsidies but not including interest earned on collateral). Rates have begun to pick up in the past few days, but remain low by historical standards.  image1040×738 39.3 KB  Source: Coinalyze FTX ETH-Perp Chart Similarly, perpetual swap funding rates on CeFi exchange venues have been negative for most of the past month, but have recently begun to flip positive. If this bullish dynamic continues we may see growing demand for leverage against our crypto collateral vaults, potentially helping to reduce Maker’s stablecoin exposure. ",
                    "links": [
                        "https://coinalyze.net/ethereum/usd/ftx/funding-rate-chart/eth-perp_fr/",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-1st-2021/9657"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208770396270397
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#6",
                    "likes": "1",
                    "time": "01/08/2021-14:07:54",
                    "content": "Good riddance to Tether USDT. If you’re not up-to-date on the Tether story, check out The Grant Williams Podcast: The Tether Discussion feat. Bennett Tomlin & George Noble - FULL EPISODE. At the end of the podcast, I learned that the guys being interviewed have their own podcast, https://cryptocriticscorner.com/ ",
                    "links": [
                        "https://cryptocriticscorner.com/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#7",
                    "likes": "2",
                    "time": "03/08/2021-06:31:55",
                    "content": "Hey everybody The proposed changes are now in the voting portal, please express your support or opposition here. The poll will run until 2021-08-05T16:00:00Z ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "17/08/2021-06:32:01",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-october-1st-2021/10653",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - October 1st 2021  ",
            "index": 10653,
            "category": [
                "Updates"
            ],
            "tags": [
                "ppg-omc-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#1",
                    "likes": "7",
                    "time": "01/10/2021-22:44:52",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee  Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @Akiva, @hexonaut, @ultraschuppi The Open Market Committee has observed no substantial change in the competitive environment since last month. We have noted that revenues continue to support our Core Units and that we are also making revenues from liquidations on a sporadic basis. Over the next month we will continue to monitor changes from the economic environment and ongoing collateral onboardings. We anticipate that USDC can and will be cleared out of the portfolio eventually but not within the next month. We also anticipate a growing surplus buffer which can anchor MakerDAO as a creditworthy institution. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#2",
                    "likes": "4",
                    "time": "05/10/2021-10:32:49",
                    "content": "Here’s our collected interest rate data for the previous month: Risk Premiums & Competitive Rates October 2021 - Google Sheets  image1832×960 131 KB  Changes:  No longer covering KNC or USDT collateral types due to offboarding Added details for GUNIDAIUSDC and MATIC due to onboarding (MATIC uses data from Aave Polygon market for competitive rates)  ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-october-2021/11352"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "1",
                    "time": "05/10/2021-13:12:28",
                    "content": "Not a formal position, but have we thought about adding some nominal fee like 50 or 100 bps to UNI DAI-USDC? I don’t think I know how much yield they tend to provide, so not sure what the holders could bear and still have a reliable spread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#4",
                    "likes": "4",
                    "time": "05/10/2021-13:33:12",
                    "content": "Due to the massive leverage on UNIV2-DAI-USDC even a small fee may be enough to cause the pool to unwind. Previously the fee was around 0.5% and the pool was barely getting used. With such low fees in the pool you probably don’t want to go over 10 bps, and at that point is it even worth bothering. We’re going to get a lot more bang for our buck with the G-UNI version as the fees are much higher. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.253787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "19/10/2021-13:33:44",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-26-august-2021/10052",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - 26 August 2021 ",
            "index": 10052,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group",
                "ppg-omc-001",
                "ppg"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "7",
                    "time": "27/08/2021-22:07:49",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @Akiva, @hexonaut, @ultraschuppi  1810×758 89.5 KB  Source: Risk Premiums & Competitive Rates September 2021  Table Notes:  Risk premiums and maximum debt ceilings assume liquidations 2.0 and are calculated based on recent market conditions Negative competitive rates are mostly due to liquidity mining rewards and Compound and Aave, as well as interest and rewards earned on deposited collateral Lending products are not standardized across defi and cefi lenders, and therefore rates can not be strictly compared on a like for like basis   Lending Market Overview  772×354 13 KB  Source: Compound cUSDC Borrowing rates have begun to trend upwards over the past month on defi lending platforms Compound and Aave. However, they are still well below levels seen during the bull market until May of this year. If the trend continues, there may be some scope to raise borrowing rates at the next OMC meeting while remaining competitive. Aave has also recently broadened their liquidity incentive program to include deposit subsidies for several collateral assets (including UNI, YFI, and BAL). While this reduces incentives available for borrowing stablecoins (increasing Maker’s competitiveness in general), it also leads to lower effective borrowing costs for users of these collateral assets. This will increase competitive pressure on related Maker vault types.  1026×732 80.2 KB  Source: Coinalyze FTX ETH-Perp Chart In centralized trading venues, funding rates have increased markedly from last month, showing consistently positive borrowing costs for taking leverage on ETH. This hasn’t yet carried over to significant increased demand for Maker’s ETH vault types.  Proposed Changes We propose not to change any parameters at this time. In our view the covered parameters (stability fees, debt ceilings, and debt ceiling IAM metrics) are well positioned given current conditions. Because no changes are proposed, there will not be a poll or executive vote following from this post. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1zQFMpGg2gqIvv0VOzwaIoLoj2_ATTJZ9tpgdtNBjPE4/edit?usp=sharing",
                        "https://compound.finance/markets/USDC",
                        "https://coinalyze.net/ethereum/usd/ftx/funding-rate-chart/eth-perp_fr/",
                        "https://forum.makerdao.com/t/maker-governance-review-september-2021/10645",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-august-2021/10106",
                        "https://forum.makerdao.com/t/fixed-rate-vaults-proposal-with-deco-protocol/9707/36"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.299242424242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/08/2021-22:42:26",
                    "content": "    monet-supply:   Negative competitive rates are mostly due to liquidity mining rewards and Compound and Aave, as well as interest and rewards earned on deposited collateral Lending products are not standardized across defi and cefi lenders, and therefore rates can not be strictly compared on a like for like basis    I these are important notes. Also with respect to competitiveness.     monet-supply:  Aave has also recently broadened their liquidity incentive program to include deposit subsidies for several collateral assets (including UNI, YFI, and BAL). While this reduces incentives available for borrowing stablecoins (increasing Maker’s competitiveness in general), it also leads to lower effective borrowing costs for users of these collateral assets. This will increase competitive pressure on related Maker vault types.   I keep coming back to Maker issuing a MKR-R reward token to reward borrowers of DAI with so Maker can actually compete using another value token which can be used for polling borrowers, in the future can be used to achieve negative rates, act as a delay valve so SF can be kept high while the protocol builds reserves before deciding to allocate some Buffer to buy and burn of MKR-R.    There are ideas that MKR-R could be vested and with polling and maybe some voting options convert into MKR proper that only have to be ‘hinted’ at along with the idea that some small amount of revenue would be allocated to buying and burning MKR-R at the discretion of MKR governance. I think this is a huge missed opportunity for Maker and agree this is not in the scope of OMC, risk but probably more in the growth CU domains…   I mention it here because each time I see this ‘competitivenees comment’ being tossed out I am sure this one thing could bring in more deposits and increase DAI borrowed more dramatically than reduction of LRs proposed and passed by governance recently. BTW:  Wanted to say - nice report.  I like these things.   At some point I will have some ideas for new stuff to include but so far looks great @monet-supply ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.86506734006734
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "3",
                    "time": "27/08/2021-23:11:31",
                    "content": "    MakerMan:  Maker issuing a MKR-R reward token to reward borrowers of DAI   My opinion hasn’t changed since I voted against this idea, [Informal Poll] Offering DAI borrowers MKR to increase borrowing Let’s not copy the unsustainable, short-sighted business model that our competitors are foolishly pursuing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "27/08/2021-23:28:28",
                    "content": "    psychonaut:  Let’s not copy the unsustainable, short-sighted business model that our competitors are foolishly pursuing.   I completely agree with one part and disagree with the rest which will be obvious from my reply. Let’s copy exactly what our competitors have done and make it sustainable, and long term.   I am absolutely convinced we can do just that btw.   The beauty of using a second token is that governance can connect MKR-R burn to revenues, basically keep the SF higher balancing this against the vault reward metrics to encourage deposit and more important DAI borrow growth.  Rewards can also be connected to CR maintenance, used as a polling metric, as well as creating its own value to the Maker ecosystem.  In the loosest sense a MKR-R is the perfect reward intermediary because it gives governance another tool over rates and a way to connect with borrowers that simply doesn’t exist today.    To back a sustainable value governance only has to state an intention that some % (even 5% would be sufficient btw) of net positive revenue would be used to buy it back.   We could even take some of the MKR slated to burn and offer it via reverse auction for MKR-R. Using MKR as a reward has been a political hot potato.  Governance making a new token slated to be a reward imo shouldn’t have as much political baggage - but ofc your idea nor mine has ever gotten any traction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.91991341991342
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "1",
                    "time": "27/08/2021-23:32:05",
                    "content": "    MakerMan:  We could even take some of the MKR slated to burn and offer it via reverse auction for MKR-R   To help others who feel TLDR, some revenue is diverted from the DAO or MKR to pay for MKR-R. I remain firmly against this idea. @MakerMan, please stop trying to obfuscate it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "0",
                    "time": "27/08/2021-23:34:40",
                    "content": "    psychonaut:  To help others who feel TLDR, some revenue is diverted from the DAO or MKR to pay for MKR-R. I remain firmly against this idea. @MakerMan, please stop trying to obfuscate it.   obfuscate.  Really?!   Well I guess your firmness against the above idea is similar to others firmness against using MKR for any sorts of rewards.    So status quo… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#7",
                    "likes": "2",
                    "time": "28/08/2021-00:54:10",
                    "content": "Could you explain why you are against this idea? We are bleeding market share to competitors who are offering these incentives. We’ve lost 5% of the Eth market in the last four months (27.9% to 23%) meanwhile AAVE has increased share by 12% (7.1% to 19%) over the same time period. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#8",
                    "likes": "0",
                    "time": "28/08/2021-04:03:12",
                    "content": "    Aes:  Could you explain why you are against this idea?   It’s a gimmick. If we really want to attract collateral, lower the stability fee. Lower it to zero if necessary. Make it negative, even. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#9",
                    "likes": "2",
                    "time": "28/08/2021-14:01:08",
                    "content": "    Aes:  Could you explain why you are against this idea?   Probably because the reason COMP and AAVE are gaining that market share is by massively increasing their customer acquisition costs. Whereas not paying a MKR reward for borrowing means a lower CAC for MKR shareholders. I don’t know if there is a middle ground here, but there are certainly merits to each way of doing things. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#10",
                    "likes": "1",
                    "time": "28/08/2021-14:40:06",
                    "content": "    psychonaut:  It’s a gimmick. If we really want to attract collateral, lower the stability fee. Lower it to zero if necessary. Make it negative, even.   I think there is value in having customers own tokens and become stakeholders in the ecosystem beyond being solely vault users, but I see your perspective.     ejbarraza:  Probably because the reason COMP and AAVE are gaining that market share is by massively increasing their customer acquisition costs. Whereas not paying a MKR reward for borrowing means a lower CAC for MKR shareholders. I don’t know if there is a middle ground here, but there are certainly merits to each way of doing things.   Sure, but what good does a lower CAC do us if we cede all our market share to competitors? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.063492063492064
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "2",
                    "time": "28/08/2021-14:49:19",
                    "content": "    Aes:  Sure, but what good does a lower CAC do us if we cede all our market share to competitors?   Market share isn’t everything. We have to be good stewards of DAI solvency, while Aave does not. Maker should focus on the commanding heights of DeFi. Our product is DAI, not vaults. The former is the promise of being an actor on the world stage that can press for fulfillment of DeFi’s promises. The latter is just who can provide leverage the cheapest to the riskiest customers. Fees that are not the absolute lowest also filter out those depending upon thinnest margins, and most likely to leave us rekt along with their poor financial plans. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#12",
                    "likes": "2",
                    "time": "28/08/2021-14:52:51",
                    "content": "    Aes:  Sure, but what good does a lower CAC do us if we cede all our market share to competitors?   I agree that 100% of nothing is worse than 10% of something. However, the main point is whether diluting existing shareholders in order to incentivize borrowing is a sustainable business decision. If Wells Fargo gave $1 of equity for every $1 of debt customers borrowed, they would surely gain massive market share. The problem is that it would end very badly because it is unsustainable. Also, giving MKR rewards would undo all of the (supposed) good of buyback and burn. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.785416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#13",
                    "likes": "0",
                    "time": "28/08/2021-16:00:22",
                    "content": "I’d disagree with the comparison, MakerDAO is more like a tech startup than an institution founded in the 19th century and the valuation metrics are completely different at this stage. The equity market values tech stocks based on market share and not current profitability - once a company has complete market dominance they turn on the profitability spigot (multiple levers to do this). Look at Amazon, Google, Uber, Airbnb, SAAS companies or really anything listed on the Nasdaq. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#14",
                    "likes": "3",
                    "time": "29/08/2021-01:36:39",
                    "content": "Is the proposal to get into a race to the bottom with all of the other protocols and offer zero or negative interest rates in order to gain market share in a kind of war of attrition? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "12/09/2021-01:37:37",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-june-2021/8991",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - 28 June 2021 ",
            "index": 8991,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group",
                "ppg-omc-001",
                "ppg"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#1",
                    "likes": "14",
                    "time": "28/06/2021-13:25:15",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @Akiva, @hexonaut, @ultraschuppi  Screen Shot 2021-06-28 at 9.28.57 AM2484×1092 472 KB  The Open Market Committee has identified the concerns of the community around tail-risk with USDC as being a material discussion point on the topic of the longevity of MakerDAO. As a result we have concluded that the optimal course of action is to increase DAI supply (from non-PSM ilks). Even though we deem it unlikely to move all USDC off the balance sheet immediately from these changes - we think that as long as it shortens the time span till we can onboard better collateral it is a net positive. We have intentionally kept sufficient revenues in place so as to be able to continue to pay for our core units. MakerDAO continues to attract high quality clients who are borrowing at scale due to our significantly larger capital base than many other Defi protocols and centralized lenders. We believe that even in the presence of yield farming issuance from Defi competitors we can continue to grow the DAI supply for these reasons. We continue to be motivated to maintain proper System Surplus (i.e. Capital Ratios) so as to maintain MakerDAO’s creditworthiness. The following policies are commensurate with our above stated views and analysis. Source: Risk Premiums & Competitive Rates June 2021 Table Notes:   Risk premiums and Maximum debt ceilings are based on Liquidations 2.0 which is in rollout right now   Negative competitive rates are mostly due to liquidity mining rewards at Compound & Cream and due to rates and rewards accrued on deposited collateral   Lending products between secondary lenders and MakerDAO are not standardized and therefore rates can not be strictly compared.    Proposed Changes  ETH-A:  Decrease SF from 3.5% to 2.0%   ETH-B:  Decrease SF from 9.0% to 6.0%   ETH-C:  Decrease SF from 1.0% to 0.5%   WBTC-A  Decrease SF from 3.5% to 2.0%   LINK-A  Decrease SF from 4.0% to 1.0%   YFI-A  Decrease SF from 4.0% to 1.0%   UNI-A  Decrease SF from 2.0% to 1.0%   AAVE-A  Decrease SF from 2.0% to 1.0%   RENBTC-A  Decrease SF from 4.0% to 2.0%   COMP-A  Decrease SF from 3.0% to 1.0%   BAL-A  Decrease SF from 2.0% to 1.0%   UNIV2DAIETH-A  Decrease SF from 2.5% to 1.5%   UNIV2USDCETH-A  Decrease SF from 3.5% to 2.0%   UNIV2DAIUSDC-A  Decrease SF from 0.5% to 0.0%   UNIV2WBTCETH-A  Decrease SF from 3.5% to 2.0%   UNIV2UNIETH-A  Decrease SF from 4.0% to 2.0%   UNIV2ETHUSDT-A  Decrease SF from 4.0% to 2.0%   Final Note Proposed SFs will get included into this week’s on-chain poll on June 28, 2021, and if passed will be included in an executive vote on July 2nd, 2021. ",
                    "links": [
                        "https://docs.google.com/document/d/1EMC_tCvpOquS3X6qh58qXOHm8na0s2TEE_CWPyAEvRE/edit?usp=sharing",
                        "https://forum.makerdao.com/t/signal-request-repeal-parameter-changes-proposal-makerdao-open-market-committee-june-28-2021/9242/11",
                        "https://forum.makerdao.com/t/signal-request-shorten-the-ppg-process/8862/17",
                        "https://forum.makerdao.com/t/signal-request-repeal-parameter-changes-proposal-makerdao-open-market-committee-june-28-2021/9242/10",
                        "https://forum.makerdao.com/t/signal-request-repeal-parameter-changes-proposal-makerdao-open-market-committee-june-28-2021/9242",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-148-thursday-july-1-17-00-utc/9036/2",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-27th-2021/9107",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-25-july-1/9079",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-06/9074",
                        "https://forum.makerdao.com/t/maker-relay-ep-51-en-espanol/9063",
                        "https://forum.makerdao.com/t/maker-relay-ep-51/9011",
                        "https://forum.makerdao.com/t/mid-month-parameter-changes-proposal-ppg-omc-001-2021-10-15/11037/3",
                        "https://forum.makerdao.com/t/maker-governance-review-august-2021/10139",
                        "https://forum.makerdao.com/t/maker-relay-ep-53-en-espanol/9330",
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355/28",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-july-4th-2021/9273"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.964597402597403
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/06/2021-13:25:18",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "28/06/2021-13:31:57",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "3",
                    "time": "28/06/2021-14:01:28",
                    "content": "This has been included in the weekly polls this week in an effort to increase response time to the changes in the market. It will go live at 17:00 UTC today. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-53/9305"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#6",
                    "likes": "0",
                    "time": "28/06/2021-14:08:15",
                    "content": "  twitter.com    Maker DAI Bot @MakerDaiBot    Vault #22025 (ETH-A) was used to generate DAI: ️️🖨️ 11,500,000 DAI minted 📉 Liquidation price: $949.90 💳 Vault debt: 19,672,387 DAI 🐋 🏦 Total DAI Supply: 5,175.368M DAI  oasis.app/borrow/22025   2:01 PM - 28 Jun 2021       Market is already responding  ",
                    "links": [
                        "https://twitter.com/MakerDaiBot/status/1409512156580745217?s=19",
                        "https://twitter.com/MakerDaiBot/status/1409512156580745217?s=19",
                        "https://twitter.com/search?q=%2322025",
                        "https://oasis.app/borrow/22025",
                        "https://twitter.com/MakerDaiBot/status/1409512156580745217?s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "1",
                    "time": "28/06/2021-14:27:24",
                    "content": "I’m fairly certain these changes will make us unprofitable on an operating basis. I don’t like this, as it requires liquidations to maintain long run solvency if there is not upwards of a 30% increase in vault debt I will check the math when I am not in the field, but this is unsustainable. We should compete in ways other than price ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.06547619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#8",
                    "likes": "1",
                    "time": "28/06/2021-14:28:52",
                    "content": "The OMC has identified moving the USDC off the books as a primary goal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#9",
                    "likes": "1",
                    "time": "28/06/2021-14:30:25",
                    "content": "I cannot support that. Why would we pay money to remove float that is free? Please walk me through the thinking, because this sounds like a disaster ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#10",
                    "likes": "0",
                    "time": "28/06/2021-14:44:08",
                    "content": "Many people are concerned about blacklisting of USDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "0",
                    "time": "28/06/2021-14:44:58",
                    "content": "Let me be more specific. If we purposefully lend at a loss, not only does that make us unprofitable as our costs continue to rise, not shrink. It also means that we require liquidations for profits, and the optics will be “Maker is a predatory lender” trying to entice a bunch of degen small traders to lever up and get rekt ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#12",
                    "likes": "3",
                    "time": "28/06/2021-14:59:44",
                    "content": "We all recognize the downsides to the approach. Consider weighing against the optics of “DAI is a USDC wrapper” Historically, DAI has been branded as a decentralized stablecoin. So as far as branding goes maintaining Decentralization has been made a priority. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#13",
                    "likes": "4",
                    "time": "28/06/2021-15:11:04",
                    "content": "Right now it is not about being most profitable but to remain relevant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.976190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#14",
                    "likes": "0",
                    "time": "28/06/2021-16:52:57",
                    "content": "Out of curiosity, what is the target percentage of dai backed by centralized stablecoins that your team is aiming for? 30%? 50%? You have to be aiming for some reserves to maintain the PSM For the record I am aligned with the proposal and support protecting DAI’s decentralized integrity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#15",
                    "likes": "3",
                    "time": "28/06/2021-17:04:28",
                    "content": "Actually ideally there would be no PSM, instead there would be a DSR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#16",
                    "likes": "4",
                    "time": "28/06/2021-17:04:55",
                    "content": "I would be interested in seeing the math anyway but can you be more specific about which rates you think make us unprofitable? If the ETH/WBTC vaults are at an operating loss, this would be very surprising given how large those vaults are and given that all costs are fixed.  and the optics will be “Maker is a predatory lender” trying to entice a bunch of degen small traders to lever up and get rekt  Maker has offered zero or near zero rates before. The bad publicity wrt rates actually came about when rates were high (20% at one point), but even then they were annoyed more at how quickly the rates rose, not the rate itself! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8225396825396825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#17",
                    "likes": "0",
                    "time": "28/06/2021-17:11:26",
                    "content": "Agreed with @AstronautThis – historically low rates were never a PR issue, and that would be some surprising logic if people jumped from “rates just got lowered” to “Maker is now more predatory”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/defensible81",
                    "index": "#18",
                    "likes": "0",
                    "time": "28/06/2021-20:05:39",
                    "content": "Also agree; the main issue here is the success of the Oasis platform and the continued incentives for borrowers to interface with it and use it to mint DAI.  Moving rates lower ensures continued competitiveness against the current top 3 defi platforms by TVL, and may reduce the platform’s reliance on USDC. We should also be thinking about what we can do with all this USDC.  I’ve seen a few folks suggesting that USDC is an opportunity, but I’ve yet to see someone put together a concrete plan to employ it to make money for MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.763888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#19",
                    "likes": "1",
                    "time": "28/06/2021-20:06:33",
                    "content": "But do we realise that it will be a bearish santiment for MKR holders. Things moving very fast, There are only 10 days since last decrease. That way we can get a massive sell of mkr tokens as soon as this proposal gets throw. Maker is more transparent than any other protocol from not a tech user. But more expensive from liquidation point. What is really can make sence are changes of 13% LR. differentiation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4638888888888895
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#20",
                    "likes": "0",
                    "time": "28/06/2021-20:28:36",
                    "content": "Maker is actually the cheapest for liquidation. Other protocols take everything, maker return the excess. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#21",
                    "likes": "0",
                    "time": "28/06/2021-20:43:40",
                    "content": "(post deleted by author) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#22",
                    "likes": "0",
                    "time": "28/06/2021-20:55:12",
                    "content": "If so/ We should find a way to build awareness of that. it still looks like 13% Thats scares smaller traders. What are competitive rates at LR. I have not seen any disscusion on that topic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#23",
                    "likes": "0",
                    "time": "29/06/2021-05:26:51",
                    "content": "    MakerMak:  And its not competitive at all. Unless we want a massive sell of mkr tokens as soon as this proposal gets throw   Welcome to the forum! Actually we are not going to start to mint any new MMR just because of this proposal. We are still making money. The SB will take longer to fill (it is sitting at almost 50MM now, it needs to be empty before any new minting starts) and there will be fever burning - assuming we don’t immediately compensate the lost fees with more DAI minted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.194805194805194
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#24",
                    "likes": "0",
                    "time": "29/06/2021-11:38:40",
                    "content": "I do understand the outcimes of that proposal and its short term goals. But LR in AAVE for ETH A is 5%. And LR in Comp for ETH A is 8%. I might be wrong. But they show these figures in the first way.  Lets say ETH A SF 3,5% with LR 8%, and ETH C 1% with LR 5% might be a good alternative. Or is there any distribution channels conflicts that we should be aware of? (DefiSaver) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#25",
                    "likes": "0",
                    "time": "29/06/2021-11:59:24",
                    "content": "during last liquidation rounds. 90% of colateral were moved away. And sold elswere. I just suggest that it might be a good opportunity to keep clients at Maker if we make LR competitive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#26",
                    "likes": "0",
                    "time": "29/06/2021-12:03:14",
                    "content": "(post deleted by author) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#27",
                    "likes": "4",
                    "time": "29/06/2021-14:50:14",
                    "content": "I’m concerned we may be overshooting with rates in a market that’s not super elastic. I would understand if we were dropping rates this low due to competitive reasons but I don’t see that mentioned as a motivator in the OP. If USDC is blacklisted MKR is screwed even with these lower rates. We’ve started to see a rebound in TVL in both USD and ETH terms since our prior rate drop so I’d like to see smaller more frequent decreases and an analysis of how demand has changed since our prior rate change. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.192708333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#28",
                    "likes": "7",
                    "time": "29/06/2021-16:58:04",
                    "content": "Our competition (primarily Aave and Compound) are offering very competitive borrow rates when accounting for the value of incentives. The chart below shows borrow rates from Compound over the past month:  Rates have picked up a bit, but all assets are still at less than 1% in net borrowing costs. Compound’s Treasury product is also planning to supply USDC to the protocol, which will cause further downward pressure on interest rates.     PaperImperium:  Why would we pay money to remove float that is free?   The assumption here is that MakerDAO holding USDC directly is risky, and we need to account for this when deciding how to balance our collateral portfolio. Let’s say we assume an annual expected loss / risk premium of 4% on USDC (from a combination of credit and regulatory risk); every DAI debt that transitions from USDC backing to an alternative collateral brings a marginal benefit to Maker’s collateral portfolio. This needs to be weighed against the collaterals replacing USDC, but the loss of revenue may be partly compensated by improved risk profile.     PaperImperium:  It also means that we require liquidations for profits, and the optics will be “Maker is a predatory lender” trying to entice a bunch of degen small traders to lever up and get rekt   The auction grinding paper offers a good explanation of why high liquidation penalties are necessary. I also think it makes sense that objectively riskier users (those allowing their position to be liquidated) should bear a higher portion of the costs for risk compensation. ",
                    "links": [
                        "https://lev.liv.nev.org.uk/content/grinding.pdf"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.482291666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#29",
                    "likes": "0",
                    "time": "29/06/2021-17:04:58",
                    "content": "@monet-supply Thank you for the detailed walkthrough ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#30",
                    "likes": "5",
                    "time": "29/06/2021-23:38:37",
                    "content": "    Akiva:  The Open Market Committee has identified the concerns of the community around tail-risk with USDC as being a material discussion point on the topic of the longevity of MakerDAO. As a result we have concluded that the optimal course of action is to increase DAI supply (from non-PSM ilks).   and then the nailer to one of the many reasons I will vote against this proposal.     Akiva:  Even though we deem it unlikely to move all USDC off the balance sheet immediately from these changes - we think that as long as it shortens the time span till we can onboard better collateral it is a net positive.   and later     Akiva:  The OMC has identified moving the USDC off the books as a primary goal.   3B later and now this is a primary goal. Is there any evidence this radical rate move will achieve this goal? Also if you are just going to cut and paste the contents there is no reason to link to:     Akiva:  Source: Risk Premiums & Competitive Rates June 2021   I was expecting to see some actual analysis in the ‘source’ reference above. Example.   USDC on the books now is 3B or 60% collateral backing to all DAI.  Which means if the system was shutdown today everyone would get .6USDC for their 1 DAI. ~1.5B DAI is backed by ETH .25B DAI is backed by wBTC and .20B DAI is backed by everything else. First the market share of ALL the remaining ilks would have to increase by another 150% AND ALL that DAI would have to find a reason to buy USDC.   With no real incentive for this to happen it never will. Secondly what exactly is the evidence that making such a dramatic change to rates is going to even put a dent in this issue?   I second the following opinion on this:     Aes:  I’m concerned we may be overshooting with rates in a market that’s not super elastic. I would understand if we were dropping rates this low due to competitive reasons but I don’t see that mentioned as a motivator in the OP. If USDC is blacklisted MKR is screwed even with these lower rates. We’ve started to see a rebound in TVL in both USD and ETH terms since our prior rate drop so I’d like to see smaller more frequent decreases and an analysis of how demand has changed since our prior rate change.   Which is another reason to do this move in steps - to gather data.   I stand against this proposal as it stands because of the sheer lack of critical analysis or data indicating Maker giving up on 1-2M DAI/month revenue is going to do anything to solve this problem.  I’d rather put up a $1M bounty for solutions. Now lets go to what I feel are the peripheral issues.     Akiva:  Negative competitive rates are mostly due to liquidity mining rewards at Compound & Cream and due to rates and rewards accrued on deposited collateral   I have said this before and will say it again.  MKR-R for Maker Rewards - compete with your competition on equal footing and give yourself at least one tool to achieve negative rates.   MKR-R gives Maker expanded tools for rate management which if coupled with a feed back and vesting mechanism a way to expand governance participation. I also said a long time ago that what Maker should do is basically take it’s own surplus DAI and roll it into these protocols to earn return and farm the rewards.  This lowers returns due to competition, allows the protocol to participate in governance, or at a minimum sell the farming tokens for DAI or MKR lowering the price further lowering the returns, and sends a signal Maker isn’t going to stand still. It also allows the protocol to earn return on the growing surplus which then can be used to burn MKR and/or MKR-R formally.  I will be voting NO on this proposal as it stands until some amount of evidence or analysis is put forward indicating this move will address the problem, and that a move of this size is required at this moment. I am going to point out the reason why we are here is because so far there has been no movement on alternative PEG management mechanisms. Or what I consider to be the Maker Trilemma. Decentralization PEG maintenance Full $1 to $1DAI collateralization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1752525252525245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#31",
                    "likes": "1",
                    "time": "30/06/2021-00:04:25",
                    "content": "Thank you for the response MakerMan, Unfortunately there is no dataset of sufficient length which we can use to have a predictive model. As a result we reason from first principles. Also I feel it is very relevant to note that many of your criticisms address issues beyond the official scope (mandate) of the committee. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-trilemma-peg-decentralization-dai-1-1-collateral-backing-usdc-discussion/9064"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9624999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#33",
                    "likes": "4",
                    "time": "30/06/2021-08:08:24",
                    "content": "While it is unexpected that such SF decreases will make a big difference in the USDC, it is important to keep whatever we currently have as crypto loans. Some significant positions are barely or non-profitable for their holders (Maker loans for yield farming on Aave Compound). Therefore the loss of income from this proposal is already expected should this proposal pass or not. In my view, the only decision is between having 75% USDC (without this proposal) or 50% USDC (this proposal). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#34",
                    "likes": "0",
                    "time": "30/06/2021-11:35:14",
                    "content": "It will go to 75% or even 85% usdc anyway.  CDP Rank 100 (out of 5000) in ETH A - 250.000 Dai owed. DAI holder rank 1000 (out of 300.000) - 250.000 Dai. Its all about DAI demand for taking profits. Another demand comes from stories around UsdT balance sheet.  But this proposal will hit the Mkr holders in a first way. Just as previous one. As long as market in the Bearish santiment it should stay on hold. Extensive research on the cdp vaults across competitive protocols should be done. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.6944444444444446
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#35",
                    "likes": "1",
                    "time": "30/06/2021-15:51:43",
                    "content": "This not the way to move USDC off the books. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#36",
                    "likes": "2",
                    "time": "30/06/2021-15:53:41",
                    "content": "Please show, based on current usage and not expectations of gained market share, profit or loss if those rates are implemented.  Apologies if I missed it somewhere. If losing, then what additional market share/volume would need to be obtained to break even. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#38",
                    "likes": "0",
                    "time": "30/06/2021-16:31:55",
                    "content": "Even if no market share is gained, and accepting that it is difficult to prove a counterfactual, isn’t it reasonable to expect Maker to lose a substantial amount of leverage volume if its rates stay above those of other venues? As for profits, Maker is quite far from being safe enough to go for short term profit maximization. Also, about the current creativity we’re seeing wrt moving USDC to entities with a legal footing: these new real-world expansions should be done gradually, preferably at a safe pace. So we should fire on all cylinders (G-UNI, Portfolio, rates changes, etc). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.421401515151515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#39",
                    "likes": "1",
                    "time": "30/06/2021-16:34:55",
                    "content": "    swakya:  Even if no market share is gained, and accepting that it is difficult to prove a counterfactual, isn’t it reasonable to expect Maker to lose a substantial amount of leverage volume if its rates stay above those of other venues   What we need is a really comprehensive user survey. Remember that only about 20-30% of DAI are from sources other than the PSM and the top 5 (yes, just five!) vault owners. Without further data, I would say that shows we are competing on grounds other than price. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.074999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#40",
                    "likes": "0",
                    "time": "30/06/2021-16:45:08",
                    "content": "Independed research on demand available.     monet-supply:  Let’s say we assume an annual expected loss / risk premium of 4% on USDC (from a combination of credit and regulatory risk)   Let’s assume Bill Hinman Tomicah Tillemann Brent McIntosh major goal to neutralise regulatory risks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.604166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#41",
                    "likes": "1",
                    "time": "30/06/2021-16:45:19",
                    "content": "It is interesting because if I follow your reasoning for the last 2 years, before the PSM, we were extremely lucky and the change in rate we used to apply every weeks to maintain the peg had actually no effect. It was just a coincidence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#42",
                    "likes": "2",
                    "time": "30/06/2021-16:50:15",
                    "content": "    alexis:  if I follow your reasoning for the last 2 years, before the PSM, we were extremely lucky and the change in rate we used to apply every weeks to maintain the peg had actually no effect.   I wouldn’t say that the current situation is necessarily reflective of the past. Looking at active vs historical vaults shows that there clearly used to be a lot more small-holder vaults in the older ilks. Those users probably were more price sensitive. Big institutions care about price, but not only price. Being a reliable partner for them is probably just as important. At the end of the day, though, we’re speculating. Because we have made little to no effort to actually understand who our vault users are and why they use us. We can point to Nexo all day long and call them on the phone, but for most vaults, we have not a lot of insight into who they are or what they’re doing with their DAI. We’re at an ATH for DAI supply today. Where’s that extra 180,000,000 DAI going? < shrug > I’d feel less squeamish about drastic rate cuts if they were based on some data to let us understand the magnitude of demand at lower rates, and not just the direction. It all feels very… unscientific and like we’re engaging in some magical thinking if we think our most price-sensitive customers are necessarily going to be the ones who make up the shortfall in revenue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.617788461538461
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#43",
                    "likes": "1",
                    "time": "30/06/2021-16:50:59",
                    "content": "No.  As I read the chart we are already below the average competitive rates on the first 3 of 4 on the list, and didn’t those just get implemented?  Maybe a month or two to see what the market does with those recent SF rates? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#44",
                    "likes": "4",
                    "time": "30/06/2021-16:54:31",
                    "content": "Maker is still a decent amount above Aave and Compound rates (our most direct competitors). Check the “competitive rates” tab for a lender by lender breakdown: Risk Premiums & Competitive Rates July 2021 - Google Sheets ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#45",
                    "likes": "0",
                    "time": "30/06/2021-16:56:16",
                    "content": "I am not sure if we read the same graph and if we use the same network. Which chain id are you using? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#46",
                    "likes": "0",
                    "time": "30/06/2021-17:02:29",
                    "content": "    PaperImperium:  Those users probably were more price sensitive. Big institutions care about price, but not only price. Being a reliable partner for them is probably just as important.   obidient and polite puppy is a must. Its to early for partnership)) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#47",
                    "likes": "0",
                    "time": "30/06/2021-17:33:13",
                    "content": "    PaperImperium:  I wouldn’t say that the current situation is necessarily reflective of the past. Looking at active vs historical vaults shows that there clearly used to be a lot more small-holder vaults in the older ilks.   So we have data, and as all data there are based on past event. No one can have data from the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.066666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#48",
                    "likes": "1",
                    "time": "30/06/2021-17:40:09",
                    "content": "    alexis:  So we have data,   Active vs total vaults is pretty close to all the historical data we have. I’ve looked and asked and looked and asked, and very little historical data beyond the very big picture stuff you see on Makerburn is being captured. How did vault usage react to past changes? Can’t tell you, because we don’t know. And that’s pretty much exactly the data that would be relevant here. We can look at total DAI supply, but how much growth came from an ilk we changed and how much from ones we didn’t? That’s the data a rate recommendation should be based upon, and we don’t have it. It’s a fatal conceit if we think we can fine tune this stuff without any data. Even today, I saw members of this committee claiming victory that DAI must be minted in mass today simply because of this proposal. We need data. This committee can’t really do more than speculate like everyone else here without it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541053921568627
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#49",
                    "likes": "3",
                    "time": "30/06/2021-17:47:11",
                    "content": "    PaperImperium:  How did vault usage react to past changes? Can’t tell you, because we don’t know. And that’s pretty much exactly the data that would be relevant here. We can look at total DAI supply, but how much growth came from an ilk we changed and how much from ones we didn’t? That’s the data a rate recommendation should be based upon, and we don’t have it.   Completely agree that more data will help us here. For now we are aiming to remain competitive with Aave and Compound which seems like a reasonable assumption, but in the future I would like more analysis on user behaviour. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.979166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#50",
                    "likes": "0",
                    "time": "30/06/2021-17:48:52",
                    "content": "Do we think our users and those of the yield farms are the same? Honest question. Seems like only a tiny minority of DAI is even possible to be from that market segment, once you back out the PSM and institutions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#51",
                    "likes": "1",
                    "time": "30/06/2021-18:11:07",
                    "content": "    PaperImperium:  How did vault usage react to past changes?   lets do it ourselves. But we should trust data from that source then    defipulse.com    Maker | Stats, Charts and Guide | DeFi Pulse Total Value Locked USD: $6.66B Total $WETH Locked: 2.4M. MakerDAO is a decentralized credit platform on Ethereum that supports Dai, a stablecoin whose value is pegged to USD.      ",
                    "links": [
                        "https://defipulse.com/maker"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#52",
                    "likes": "0",
                    "time": "30/06/2021-18:18:40",
                    "content": "Unfortunately, TVL won’t tell us much except that collateral value rose or fell. We need how much DAI was minted before/after a rate change vs ilks that had no change. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#53",
                    "likes": "1",
                    "time": "30/06/2021-20:24:28",
                    "content": "     you are welcome. Purple line for Dai from colateral. Arrows decision. Yellow SF+ RED SF - Purple public noticed. Only sufficient changes applied to graph. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#54",
                    "likes": "0",
                    "time": "30/06/2021-20:25:07",
                    "content": "Nice! Thanks  Will look later when not cooking dinner ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#55",
                    "likes": "1",
                    "time": "30/06/2021-22:52:48",
                    "content": "Ok, I was looking at the average competitor rates.  What about matching collateral ratios of the competitors first (which should increase DAI generated)?  Then liquidation penatlies second?  Then finally eat at our SF income. Also again something like this shouldn’t be done without data showing how this will affect Maker’s profit/loss.  Hoping someone has or will do that analysis and provide it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#56",
                    "likes": "1",
                    "time": "30/06/2021-23:17:12",
                    "content": "Yield compression is bound to happen but it seems way too low at a 0.5% interest rate when Compound and Coinbase offer 4% on stablecoins. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#57",
                    "likes": "0",
                    "time": "30/06/2021-23:42:05",
                    "content": "Reducing CR is a very interesting pathway  and I would encourage you to signal forward it. Waiting for more data before taking action might feel safe and unlikely to result in anyone being blamed, but when the cost of the action is low and its potential impact is high, defaulting to action and maybe saying oops later is in fact much, much less risky. Especially if said data is not expected to arrive shortly but merely hoped for. While that experiment runs, by all means let’s find more data. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.43921568627451
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#58",
                    "likes": "0",
                    "time": "30/06/2021-23:54:26",
                    "content": "    swakya:  when the cost of the action is low   I think that’s the key phrase. And also summarizes why I’m not stoked about the magnitude of these proposed changes — especially when only a small minority of our vaults are even anything beyond institutions and PSM ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#59",
                    "likes": "0",
                    "time": "01/07/2021-04:23:00",
                    "content": "stablecoins are not that volatile. Yield for crypto assets was always at very low levels. Somebody has to go short on Mkr. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#60",
                    "likes": "1",
                    "time": "01/07/2021-05:47:00",
                    "content": "I like the idea of reducing stability fees, but can we wait until the surplus buffer is full? (I was going to ask this before the last SF drop, didn’t, and regretted it.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#61",
                    "likes": "1",
                    "time": "01/07/2021-05:47:05",
                    "content": "    omahalawyer:  looking at the average competitor rates. What about matching collateral ratios of the competitors   Historically we have never altered the collateral ratio’s of existing vaults due to the implications it has for vault owners. It’s easy to lower collateral requirements however nearly impossible to reverse the change without causing a subset of the vaults to end up in liquidation. Previously when the DAO has wanted to implement new collateral ratio it instead variables creates new vault types ie eth-a eth-b eth -c. Liquidation Penalty and SF are much more dynamic in the sense that we do have a historic precedent of updating these variables for existing vaults. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.044421487603305
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMak",
                    "index": "#62",
                    "likes": "0",
                    "time": "01/07/2021-07:19:19",
                    "content": "    someone:  I like the idea of reducing stability fees, but can we wait until the surplus buffer is full?   It doesn’t seem as a problem at the moment. SB almost 2,2% to CDP at the moment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#63",
                    "likes": "11",
                    "time": "01/07/2021-07:41:13",
                    "content": "    PaperImperium:  We need how much DAI was minted before/after a rate change vs ilks that had no change.   One of the biggest pain points in Maker imo is lack of data-driven mindset. This is something we’ve got all to improve on. This is one of those questions that, had we had a data engineering function by now would be a couple of lines of code to answer. I’ll try to fetch some data on this. It’s understandable to do excel/gsheets for quick and dirty one-off analysis and PoCs. But once the format is validated, we should move on to proper dashboarding tools where metrics can be actually understood. Excel is terrible to understand what’s going unless you’re the one that did the work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.111111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#64",
                    "likes": "4",
                    "time": "01/07/2021-17:19:14",
                    "content": "update: the onchain poll just passed with 99.98% approval since the last exec just got majority, it is quite likely we will see the proposed rates as part of tomorrows executive ",
                    "links": [
                        "https://vote.makerdao.com/executive/flash-mint-implementation-debt-floor-changes?network=mainnet#proposal-detail"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#65",
                    "likes": "1",
                    "time": "02/07/2021-17:42:08",
                    "content": "Wondering, how do you calculate the risk premium on the vault? For example, how come an eth-c is 0.4% and COMP 0.3%. COMP can be minted. eth-c at 0.4% with 175%. Intuitively the 0.4% seems high to me vs others. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#66",
                    "likes": "2",
                    "time": "02/07/2021-19:09:54",
                    "content": "@alexis it depends on debt exposure, slippage and collateralization ratio distribution (among other inputs). ETH-C debt exposure is much higher than COMP-A, so when you model a price crash and calculate amount of debt liquidated, ETH liquidated dollar values are far larger (also because of ETH-A and ETH-B liquidations are potentially happening at the same time) and hence similar auction slippage is being calculated compared to COMP-A, despite COMP being of course less liquid. More on the risk model here: https://simulation.blockanalitica.com/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.310185185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#67",
                    "likes": "1",
                    "time": "02/07/2021-19:23:28",
                    "content": "Do you think it would be interesting to add more models. I can see some factors like “possibility of admin minting”, “principal owner %” etc. Or even on pure liquidity for example eth liquidity is very linked to other assets via uniswap. I am not sure if that plays a lot, but if COMP plumb that won’t trigger arbitrage on other assets. At least not as much as eth or BTC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.452380952380952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#68",
                    "likes": "2",
                    "time": "02/07/2021-19:35:25",
                    "content": "Not really a huge fan of adding more inputs because we already have too many of them and the model quickly becomes too subjective on inputs side. I am more in favour of adjusting current input values for specific differences in asset profile. For instance you can model more severe and frequent drops for assets that have higher legal/counterparty/multisig/etc. risks, rather than trying to apply these risks as a separate input or create a new model. And we actually do that to some extent, you can see some default input values are different for certain assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.012136672850959
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#69",
                    "likes": "2",
                    "time": "02/07/2021-21:20:09",
                    "content": "I support the proposal as it is a step in the right direction. I am, of course, for more radical measures like lowering the ETH rate to 0% and use USDC collateral to buy ETH and provide liquidity to Uniswap USDC/ETH pool. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#70",
                    "likes": "1",
                    "time": "03/07/2021-07:37:26",
                    "content": "I was more thinking of an other model, so we keep this one as “maker risk model” ( it is quite linked to our vaults, if a vault increase the risk increase) and an other one more generic for example taking into account debt on other protocols as well ( if compound has a 10% debt at the edge, the liquidation risk is still high). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.560714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#71",
                    "likes": "2",
                    "time": "16/07/2021-18:57:31",
                    "content": "Quick update: the exec containing the proposed changes just got scheduled. We will have the new rates in a bit less than 48h. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.505050505050505
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#72",
                    "likes": "0",
                    "time": "17/07/2021-20:56:09",
                    "content": "    williamr:  One of the biggest pain points in Maker imo is lack of data-driven mindset.   I think if one had data Maker could drive better.    The issue was prioritizing getting that data. Tracking user behaviors was something I was interested in before Black Thursday and even more so after.   It is almost simpler to just look across vaults over a week and see net +/- deposits and borrows than to scan the entire DeFI ecosystem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.902777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#73",
                    "likes": "0",
                    "time": "31/07/2021-20:56:51",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-7-april-2021/7358",
            "title": "Parameter Changes Proposal - PPG-OMC-001 - 7 April 2021 ",
            "index": 7358,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group",
                "ppg-omc-001",
                "ppg"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "14",
                    "time": "07/04/2021-13:46:20",
                    "content": "Parameter Proposal Group: MakerDAO Open Market Committee Authors: @Primoz @LongForWisdom, @Monet-supply, @SebVentures, @Akiva, @hexonaut, @ultraschuppi  image1817×1007 297 KB  Source: Risk Premiums & Competitive Rates April 2021 Table Notes:   Risk premiums and Maximum debt ceilings are based on Liquidations 2.0 which should be implemented in next few weeks for all assets   Negative competitive rates are mostly due to liquidity mining rewards at Compound & Cream and due to rates and rewards accrued on deposited collateral   Lending products between secondary lenders and MakerDAO are not standardized and therefore rates can not be strictly compared.    Lending Market Overview Competition in the AMM backed lending space is beginning to heat up, with Aave’s v2 AMM market going live over the past month. This joins the Cream money market as a MakerDAO competitor. General competition for stablecoins is also increasing, with Liquity protocol (focused on ETH based lending) and Fei protocol both launching recently. Inverse Finance’s DOLA stablecoin is another notable upstart competitor. Greater competition in the stablecoin space could reduce DAI demand and increase Maker’s cost of capital, although this does not appear to be an issue presently. Rates have remained high throughout the month of March, with Aave in particular seeing very high stablecoin borrowing rates. This was partly caused by poorly tuned stable rate parameters, which allowed certain users to borrow all of Aave’s liquidity for below market rates. This in turn caused borrow rates for opening new positions to reach extremely high levels. Aave is addressing this by deactivating stable rates in Aave v1 via a governance proposal.  Compound DAI Borrow Rates  image885×533 65.3 KB   Aave DAI Borrow Rates (yellow)  image714×463 84.6 KB   Proposed Changes  ETH-A and WBTC-A We aren’t proposing any rate changes for our largest vault types this month since we have recently seen a notable amount of USDC-A and PSMUSDC-A unwinding and we may want to keep momentum going. The newly calculated risk premiums that are based on Liquidations 2.0 are also showing lower figures for higher debt exposures, which makes us less worried about the pace of debt increase on ETH-A.  LINK-A  Increase SF from 3.5% to 5%   Higher debt utilization has increased LINK-A risk premium and we therefore recommend 5% SF, which is still lower than average competitive rate of 7.9%.  ETH-B  Increase SF from 9.0% to 10.0%   Despite increasing SFs in the last months, the utilization of ETH-B has not changed. We believe we can increase SF by additional 1% as ETH-B borrowers might be less rate sensitive than believed.  YFI-A  Increase line from 75 MM to 90 MM   The current executive is raising the line of YFI-A from 45m to 75m. However, risk metrics for YFI-A currently look very good because of high collateralization of largest vaults and therefore an even higher debt ceiling can be implemented. We may though recommend higher SF for this vault type next month if the newly set debt ceiling becomes heavily utilized again or vault collateralization metrics worsen.  ZRX-A  Increase SF from 2.0% to 4.0%   ZRX has one of the worst on-chain liquidity metrics that is an important factor under Liquidations 2.0 implementation. Risk premium therefore increased and we recommend higher SF, especially if debt exposure continues to grow with recently increased debt ceiling to 10m.  AAVE-A  Decrease SF from 4.0% to 3.0% Increase line from 25 MM to 50 MM Increase gap from 2 MM to 5 MM   The on-chain liquidity of AAVE and vault collateralization metrics are very good and we can safely decrease SF. Similarly we recommend a higher debt ceiling despite the low utilization.  BAT-A  Decrease SF from 6.0% to 5.0% Increase line from 3 MM to 7 MM   BAT also has improved metrics which lead to risk premium to decrease. It is still higher compared to other similar collateral assets because of a lower 150% liquidation ratio. Yet, we recommend the decrease of SF and increase of Debt Ceiling.  RENBTC-A  Increase line from 2 MM to 10 MM Increase gap from 0.5 MM to 1 MM   Utilization on RENBTC-A has increased in the last month and recent joint undertakings from Alameda and Ren team decreased some of the risks associated with the RenVM protocol. We therefore recommend a higher debt ceiling.  LRC-A  Increase SF from 3.0% to 4.0% Decrease line from 10 MM to 5 MM Decrease gap from 2 MM to 1 MM   LRC on-chain liquidity is mostly on the L2 which creates some risks for Liquidations 2.0. We therefore recommend higher SF and lower debt ceilings until vault and liquidity metrics improve.  MANA-A  Decrease SF from 4.0% to 3.0% Increase line from 2 MM to 5 MM Increase gap from 0.5 MM to 1 MM   NFT hype has improved MANA metrics and we recommend slightly favourable changes to both debt ceiling and stability fee.  BAL-A  Decrease SF from 3.5% to 2.0% Increase line from 5 MM to 30 MM Increase gap from 1 MM to 3 MM   BAL metrics improved - although the volumes are lower, the on-chain market depth metrics are very good. Despite the SF being already low, we can afford to lower it additionally and boost demand.  Stablecoin Vaults  Decrease USDT-A Debt Ceiling from 2.5 MM to 0 MM   We believe the USDT-A vault doesn’t carry any business significance for Maker and we are recommending to “disable” this vault type by setting the debt ceiling to 0. Once we have PSM implemented for other stablecoins, we will also suggest setting debt ceiling for other stablecoins vaults to 0 (PAXUSD-A, GUSD-A).  UNI LPs  UNIV2DAIETH-A  Increase SF from 3% to 3.5% Increase line from 30 MM to 50 MM   Because of 125% LR, this vault’s risk profile is similar to ETH-A and higher SF should be implemented from a risk perspective. We though recommend a smaller increase compared to ETHUSDC pair since we prefer users favour DAI pair. Because of recent high demand after increased debt ceiling we are also recommending another increase to equal USDCETH LP pair debt ceiling.  UNIV2USDCETH-A  Increase SF from 3.5% to 4.5%   Similarly as mentioned above, this UNI LP pair should have higher SF from a risk perspective as ETH exposure in Maker is increasing. Because of a) higher APY for eth-stablecoin pairs and b) 5x max leverage and c) much higher competitive rates at Aave we believe such SF is still very tempting for users.  UNIV2DAIUSDC-A  Decrease SF from 3.0% to 1.0%   We may want to stimulate this pair as it has a similar risk profile for Maker as PSM but can be more yielding. APY for users at max 11x leverage and at 1% rate can reach over 50%.  UNIV2WBTCETH-A  Replace Debt Ceiling of 3 MM with line of  20 MM Enable DC-IAM and set ttl to 12h and gap to 3 MM   With the upcoming implementation of Liquidations 2.0 we believe we can safely increase debt ceilings of other riskier UNI LPs. The recommended debt ceiling increase is still lower than what models suggest due to caution and expected delay of Liq 2.0 implementations for UNI LPs.  UNIV2UNIETH-A  Replace Debt Ceiling of 3 MM with line of  20 MM Enable DC-IAM and set ttl to 12h and gap to 3 MM   Model suggests a higher available debt ceiling but we are increasing it with caution for reasons mentioned above.  UNIV2LINKETH-A  Decrease SF from 5.0% to 4.0% Replace Debt Ceiling of 3 MM with line of  20 MM Enable DC-IAM and set ttl to 12h and gap to 2 MM   A smaller increase in debt ceiling is due to higher LINK debt utilization on LINK-A vaults and lower demand.  UNIV2AAVEETH-A  Decrease SF from 5% to 4% Replace Debt Ceiling of 3 MM with line of  20 MM Enable DC-IAM and set ttl to 12h and gap to 2 MM   A smaller increase in debt ceiling is due to smaller UNIV2AAVEETH current pool size and lower demand. We are also recommending lower SF due to lower exposure and low pool APY.  UNIV2ETHUSDT-A  Replace Debt Ceiling of 3 MM with line of  10 MM Enable DC-IAM and set ttl to 12h and gap to 2 MM   We are suggesting smaller increases for USDT related exposures due to various Tether related concerns that still haven’t completely settled.  UNIV2DAIUSDT-A  Decrease SF from 4% to 3% Replace Debt Ceiling of 3 MM with line of  10 MM Enable DC-IAM and set ttl to 12h and gap to 2 MM  We are suggesting smaller increases for USDT related exposures due to various Tether related concerns that still haven’t completely settled. We are also recommending lower SF to stimulate demand as there is not usage, probably due to lower pool APY.  UNIV2WBTCDAI-A  Decrease SF from 2% to 0% Replace Debt Ceiling of 3 MM with line of  20 MM Enable DC-IAM and set ttl to 12h and gap to 3 MM   image1240×651 47.7 KB  This vault type is not seeing any demand even at 2% and we are suggesting 0% rate to boost demand. Increased liquidity in this pool would also help Maker with our overall WBTC exposure and WBTC liquidity risks.  Final Note Proposed Parameter Changes will get included into next week’s on-chain poll on 2021-04-11T22:00:00Z, and if passed will be included in an executive vote on 2021-04-15T22:00:00Z. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1gSQMJl9m1wAraqvRfTzR8op3_PMQqZVroiJ3TsXV5yo/edit#gid=1552963597",
                        "https://medium.com/aave/aave-amm-market-released-73ae76a7cbc0",
                        "https://medium.com/liquity/liquity-goes-live-on-ethereum-mainnet-203d295d2fc6",
                        "https://medium.com/fei-protocol/introducing-fei-protocol-2db79bd7a82b",
                        "https://medium.com/inversefinance/anchor-dola-capital-efficient-lending-borrowing-and-synthetic-assets-bf403bfe95f9",
                        "https://app.aave.com/governance/7-QmXwFPhN3ABDzBuEhPTzeXzuQdGkHfWtEZn348LQWxuFFZ",
                        "https://www.mkranalytics.com/vaults/LINK/LINK-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/ETH/ETH-B?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/YFI/YFI-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://vote.makerdao.com/executive/increase-debt-ceilings-provide-april-core-unit-budgets?network=mainnet#proposal-detail",
                        "https://www.mkranalytics.com/vaults/ZRX/ZRX-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://maker.blockanalitica.com/slippage/ZRX/",
                        "https://www.mkranalytics.com/vaults/AAVE/AAVE-A?stats=Dai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/BAT/BAT-A?stats=Dai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/BTC/RENBTC-A?stats=Dai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/LRC/LRC-A?stats=Dai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/MANA/MANA-A?stats=Dai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/BAL/BAL-A?stats=Dai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/USD/USDT-A?stats=Dai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2DAIETH-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2USDCETH-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2DAIUSDC-A?stats=Dai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://docs.google.com/spreadsheets/d/1LIr7cWdSwJlXbAA-pQcHIiixnp1itSea9-Xll5ah0VU/edit#gid=73123344",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2WBTCETH-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2UNIETH-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2LINKETH-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2AAVEETH-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://www.mkranalytics.com/vaults/UNIV2/UNIV2ETHUSDT-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1609974000&end=1617832799&granularity=Daily",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-136-thursday-april-8-17-00-utc/7279/4",
                        "https://forum.makerdao.com/t/call-to-arms-trading-pairs/7501/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-40/7467",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-138-thursday-april-22-17-00-utc/7515/11",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/25",
                        "https://forum.makerdao.com/t/the-choice-is-clear-vote-or-face-backlog/7662",
                        "https://forum.makerdao.com/t/maker-governance-review-april-2021/7853",
                        "https://forum.makerdao.com/t/maker-relay-ep-42/7673",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-136-thursday-april-8-17-00-utc/7279/8"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.342830666357452
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "1",
                    "time": "07/04/2021-14:08:23",
                    "content": "Have you guys discussed a timeline for when ETH-B DC can be increased? I’m assuming it depends on the successful rollout of Liquidations 2.0? Just wanted to confirm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "2",
                    "time": "07/04/2021-14:10:16",
                    "content": "yepp, imho the whole topic of low-LR-vaults can be revisited with Liq2 in action. WBTC-B has been delayed for the exact reason as well. weeks not months ™ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "0",
                    "time": "07/04/2021-15:56:43",
                    "content": "Since DAI/USDT UNI LP has 0 traction, did you guys think about dropping the SF for that vault to 0%? If not, why? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "3",
                    "time": "07/04/2021-17:31:08",
                    "content": "Mostly just ‘Tether bad’ I think. It does have slightly more liquidity in the pool than WBTC-DAI. It’s also that WBTC-DAI directly improves liquidity for WBTC, so if we can incentivise that pool into existence it provides us other benefits. USDT-DAI does have some benefits as well, but I think everyone in the group still feels Tether is a bit sketchy. I agree it’s not super consistent though heh. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.255952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#6",
                    "likes": "0",
                    "time": "07/04/2021-17:35:50",
                    "content": "With their recent attestations it might make sense to lighten up slightly on the Tether hate. I have been guilty just as much as others to distrust them but perhaps we’re needlessly shooting ourselves in the foot at this point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5277777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "07/04/2021-17:36:31",
                    "content": "    Aaron_Bartsch:  With their recent attestations it might make sense to lighten up slightly on the Tether hate.   Those came up as part of the conversation actually. @Akiva was not very impressed with them, perhaps he can comment? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.648717948717949
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#8",
                    "likes": "2",
                    "time": "07/04/2021-17:48:51",
                    "content": " From the attestation: “Activity prior to and after this time and date was not considered when testing the balances and information described above.” The other thing was that I could not find anything in the attestation which specified which kind of assets the entity holds.  Considering 1&2 together makes me concerned. I suppose if either one of those two were cleared up Id feel better about loosening parameters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#9",
                    "likes": "0",
                    "time": "07/04/2021-18:28:26",
                    "content": "If the debt ceiling on USDT is 0 then why not do the same to the LP token? I mean if Tether bad just kill it off the outset. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.3125000000000004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#10",
                    "likes": "3",
                    "time": "07/04/2021-21:21:11",
                    "content": "I think raising rates further on ETH is very user hostile. Is our goal really to squeeze our users so much that they quit using the protocol? Its especially strange when the new liquidation upgrade is coming soon which should supposedly allow higher DC for high leverage collateral types IMO it makes more sense to focus on long term growth ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.748181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#11",
                    "likes": "3",
                    "time": "08/04/2021-08:30:13",
                    "content": "    ejbarraza:  If the debt ceiling on USDT is 0 then why not do the same to the LP token? I mean if Tether bad just kill it off the outset.   We limited USDT exposure in total to 20m (actually 10m in if you count 50% exposure in both UNI LP pairs) which equals or is below current Surplus buffer. Stablecoin vaults are not usable anyway and we see more downside than upside of having USDT-A enabled at this point. Even PAXUSD-A and GUSD-A are not really usable now considering PSM, but we don’t see that much downside having it enabled until we have PSM for more stablecoins.     Replenish2030:  I think raising rates further on ETH is very user hostile. Is our goal really to squeeze our users so much that they quit using the protocol? Its especially strange when the new liquidation upgrade is coming soon which should supposedly allow higher DC for high leverage collateral types   Well I wouldn’t say it would be hostile considering the market wide rates going higher again and the spread between competition and Maker only growing. But you are right that Liq 2.0 decreases risk premiums and we are more relaxed towards growing exposure on ETH. This was one of the reasons we didn’t propose to increase ETH and WBTC first this time after 4 months of continuous rate increases even though the exposure keeps growing with the similar pace. It is debatable whether ETH-B needed a 1% increase at this point, but we jointly decided that ETH-B users are not very rate sensitive and we could afford another increase. ETH-B is also one of the best ETH leveraged products in DeFi (because of OSM and low LR) and for those bullish on ETH in current environment, 10% rate shouldn’t hopefully hurt considering competitive rates. Plus we wanted to have risk premium covered, calculated at 9.9%. I personally think a lot of users are very rate insensitive currently when we are talking about 2-3% spreads and the recent a bit slower than expected migration from ETH-A to ETH-C just confirmed this. In bullish environment, people care about LR mostly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.558967019822283
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#12",
                    "likes": "1",
                    "time": "08/04/2021-09:40:51",
                    "content": "    Primoz:  we wanted to have risk premium covered, calculated at 9.9%.   This is very important information. So users can expect that it will not go above 10% unless the risk materially changes? Right now these changes feel very arbitrary and “whatcha gonna do” IMO i would prefer to frame these things the opposite way. If the calculated risk premium is 9.9%, then anything below that is subsidized risk. So really eth-b right now has a risk subsidy of 1% which you are proposing to remove. That’s a much better way of framing it since this implies that this isn’t just yet another random rate hike that will just keep coming until we have crushed the users so much they start quitting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.573376623376624
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#13",
                    "likes": "4",
                    "time": "08/04/2021-10:19:41",
                    "content": "This is more or less the formula we’ve been sticking with for all collateral types. Do our best to compensate the risk premium while not overshooting the competition and some special consideration to try and get supply up at a reasonable rate. It’s a little subjective sometimes, but that’s the general idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.252125850340136
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#14",
                    "likes": "1",
                    "time": "08/04/2021-12:45:50",
                    "content": "Just wanted to say all good. It makes totally sense to increase eth-b as it max out and we can’t increase the DC. Thanks for doing it. And what an archivement if we compare at before when rates were moving up and down every other weeks without much consistency. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.68287037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "15/04/2021-12:46:27",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "0",
                    "time": "15/04/2021-17:10:58",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#17",
                    "likes": "2",
                    "time": "15/04/2021-17:15:49",
                    "content": "The onchain poll passed with a nice 100% approval (also by a16z). However, as the first step towards Liq2.0 are planned for tomorrows executive, the changes will get into the executive of 2021-04-22T22:00:00Z I will update here once the spell is online so you can help on making it real as quick as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#18",
                    "likes": "0",
                    "time": "20/04/2021-11:20:14",
                    "content": "I haven’t followed these calls so maybe I’m missing something but I’ll ask anyway. Given that the ETH-B vault is at its debt ceiling and has been for a while, can we either raise stability fees on it or increase the debt ceiling? I recall the Risk team had reservations about raising the DC some time ago though and that’s fair but then it seems like a good opportunity to raise the fees to get the additional revenue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#19",
                    "likes": "1",
                    "time": "22/04/2021-16:40:29",
                    "content": "It will be increased soonish once Liquidation 2.0 is in the wild for testing and then ETH-A/B/C will have Liq 2.0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#20",
                    "likes": "0",
                    "time": "22/04/2021-17:24:27",
                    "content": "Thanks for replying! Can I ask what the connection is between raising stability fees on ETH-B and Liquidations 2.0? I understand that raising debt ceilings requires Liquidations 2.0 to be working and that makes sense from a risk perspective. My question is why are we forgoing revenue in the meantime? Tagging @Risk-Core-Unit for comments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#21",
                    "likes": "1",
                    "time": "22/04/2021-17:34:11",
                    "content": "Good question. I think the rates group is trying to weigh risk/pr/revenue and since we’re covering the risk side, we’re not really in the business of milking our users just for an extra buck. Sure you could say we’re missing out since the DC is maxed which means rates aren’t a factor for these users at this time but if we keep increasing until users leave, whats to say they’ll want to come back once fees go lower/dc increases. I guess I’ll leave the real reasoning up for @ultraschuppi or @Primoz to answer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#22",
                    "likes": "1",
                    "time": "22/04/2021-17:36:40",
                    "content": "Hmm, I’m not sure if it counts as milking our users though. When demand for leverage exceeds supply, it seems perfectly fine to increase rates. Plus, with ETH doing what it’s doing, I doubt a couple of percentage points here or there matters to any ETH-B vault owner. I think this is the part where I should figure out how to start a signal thread! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.677083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#23",
                    "likes": "0",
                    "time": "22/04/2021-17:38:23",
                    "content": "We also only change rates like once a month right now so finding that sweet spot is hard. You don’t want to overshoot. If you’ll notice, almost every month the rates on ETH-B have increased. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.430059523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#24",
                    "likes": "3",
                    "time": "22/04/2021-17:39:22",
                    "content": "Hi! a) we are just leaving money on the table as ETH-B vault owners simply don’t care much about the SF - that’s why the MOMC proposed a raise of 1% b) I personally would love to have more ETH-B-DC, but since the past Liquidations on ETH-B have been pretty scary (on the edge of the protocol losing money) and Liq2.0 should be a lot better this needs to wait HTH tim ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#26",
                    "likes": "2",
                    "time": "23/04/2021-09:15:32",
                    "content": "One of the competitive advantages of Maker is that we are offering “quite stable” rates. The MOMC is moving each month by little steps when Compound can be all over the place up to punishing rates without warnings. This trust-building takes time and is more important than a few % of profits. It’s long-term profits vs short-term profits. Notice also that DAI is quite cheap on Aave v2 and Aave Matic those days. But people are sticking to Maker because they are sure that it will not stay that low for long. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8515625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#27",
                    "likes": "1",
                    "time": "23/04/2021-11:14:51",
                    "content": "Going at the 180 degrees on the opposite side, would it make sense to change the rate only once every 3 months? Also just to add more water on it by having a clear and stable rate we attract better client/user. The ones that don’t over leverage and stay longer. We could have notice that even during the down market, vault position didn’t change much and that is very valuable. We didn’t get much liquidation either. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8580246913580245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#28",
                    "likes": "0",
                    "time": "23/04/2021-12:36:08",
                    "content": "    alexis:  by having a clear and stable rate we attract better client/user   This. We need to start segmenting our customer base with different product offerings. Diversification of risk profiles is just as important as diversification of underlying collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#29",
                    "likes": "1",
                    "time": "23/04/2021-13:07:29",
                    "content": "Agree, on this side, I think having an oracle time of 6 hours will help eth-c to take off. As it will have a different type of user, the one who wants to sleep over night by giving them 12 hours to unwind. On our side it will also diversify the risk and remove the selling pressure by spreading the liquidation. @Primoz said once I think, there is not much different historicaly in max 1h drop vs max 1 day drop for Eth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#30",
                    "likes": "0",
                    "time": "23/04/2021-13:52:32",
                    "content": "    alexis:  I think having a oracle time of 6 hours will help eth-c to take off.   This might be a quite good idea risk-wise (at least it seems without too much thinking). For Liq2.0 I have some concerns that ETH-C liquidation will be treated equally that ETH-B and ETH-A (there are ways to incentivize a bit but unsure how this will work in real life). Having ETH-C liquidation kicking in 6 hours later would give more time to liquidate the most urgent ETH-A and ETH-B (less safety buffer). If there is a big crash it would take a day to liquidate all we need anyway (limited by hole that avoid having too much slippage). But @Primoz is better than me on Liq2.0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.86996336996337
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#31",
                    "likes": "2",
                    "time": "26/04/2021-12:58:21",
                    "content": "Update: the current exec will push the proposed to the protocol - please help making it pass by voting with your MKR tokens. This is also especially urgent because the MIPS exec is planned for today as well, so it would be nice if we can schedule it asap. Update: exec passed - the changes will come into effect on 2021-04-28T22:06:00Z. Thanks everybody! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/harbour",
                    "index": "#32",
                    "likes": "1",
                    "time": "29/04/2021-18:52:19",
                    "content": "Hi, it seems I’m unable to generate new DAI from the RENBTC-A collateral type. I believe the 48 hour period has passed since the vote was confirmed. Just a bit confused as I’d like to use Oasis. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.886363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#33",
                    "likes": "2",
                    "time": "29/04/2021-18:57:16",
                    "content": "The DC IAM hasn’t been triggered to increase the DC. You can do this yourself by following the instructions here: [Tutorial] Adjusting a Vault's Debt Ceiling with the IAM. If you don’t feel like spending the gas to do this, we have someone with a bot that updates the DCs every 12-24 hours if you can wait that long. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#34",
                    "likes": "1",
                    "time": "29/04/2021-18:59:33",
                    "content": "…or wait a day until the bot runs again ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#35",
                    "likes": "1",
                    "time": "29/04/2021-19:01:05",
                    "content": "Beat you to it  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/harbour",
                    "index": "#36",
                    "likes": "1",
                    "time": "29/04/2021-19:04:49",
                    "content": "Got it. Jumped the gun. Thanks all! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "18"
}