{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rocking-the-defi-chasm-4-the-real-competitive-moat-dai-network-effects/12458",
            "title": "[Rocking The DeFi Chasm #4 ] The Real Competitive Moat: DAI Network Effects ",
            "index": 12458,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "defi",
                "op-ed"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "13",
                    "time": "03/01/2022-14:11:53",
                    "content": "Former Qualcomm software engineer Anu Hariharan describes early startup network effects as:  In year 1 your goal is to achieve at least 1,000 users that love you   But by year 2 you should be asking, “what is the driver of critical mass, and then using that as an algorithm to build scale”    Competitors will spend $Billions to break down your Moat Great network effects don’t just happen, they are designed. When designed properly they can be powerful and provide a benefit to users while creating a barrier-to-entry to the competition. The benefit is that the end-user is gaining value from the fact that more users are on the network using the same product, and the barrier is that a competitor will have to spend an insurmountable amount of money to catch up. A good example of an Ethereum competitor spending dollars and playing catch-up is Avalanche. Not only by using a $180M DeFi-mining incentive scheme, but by also going as far as advertising in the NYC Subway system:  image1468×1402 101 KB   When Lyft went after Uber’s Moat Early Uber employee Andrew Chen tells the story of when Uber’s Network Effects were being challenged by Lyft. By a creating a Referral Incentive, Lyft had caused drivers to switch over in droves. Driver referrals were structured as a give/get incentive — give $250 and get $250 when your friend signs up to drive. This attack on the Uber’s moat led to former Uber CEO Travis Kalanick asking the question, “What if… we did a $750 / $750 referral bonus here in SF, LA, and San Diego?”  What are the key elements of network effects and has MakerDAO achieved them with its core product, DAI? First, let’s identify them:  What is the primary value proposition for the User? Can value be created w/DAI? Yesssss, I believe we can All agree that DAI has achieved value proposition. Food-for-thought: has value been created in single player mode only, or is DAI useless without multi-player mode? Like Skype  remember them.  Second, has DAI achieved DeFi growth organically without spending a fortune on marketing programs? Indeed, I believe we can All agree that DAI has achieved organic growth within DeFi. But outside of DeFi? Third, engagement trigger. What is the threshold that a customer should cross to likely become a fully-engaged customer?   And last, what is the primary thing that will further accelerate DAI’s network effects? What will make DAI adoption accelerate?    Looking at the past performers, movements like Facebook, Airbnb, and others—gained network effects by accelerating their networks via incentives, bringing users together(Airbnb/Uber), targeting specific geographical areas (Cities), events, etc., in order to gain critical mass. So, as we enter 2022—how does DAI build its network effects? What type of Network does the Maker Community want to build? What should be the entry point be to build a large scalable network effect, what are the growth levers, tactics, hacks, and the mass inflection point? How do we build more liquidity, how do we solve the chicken and egg problem of getting enough supply & demand to the masses at the same time? What are the complimentary products that will increase DAI usage?  Is DAI viral growth the same as network effects? No, they are not the same. Virility is about the speed of adoption, it is more about the distribution than about the product. Sure they can happen at the same time, but they shouldn’t be confused. So we can say that DAI has some network effects, but does it have virility? As we kickoff the first week of January, I ask you community members—what can you do to increase DAI network effects. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.449706694271912
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#2",
                    "likes": "4",
                    "time": "03/01/2022-18:29:18",
                    "content": "Great thoughts! IMO the only serious competitor to DAI currently is UST and the insane growth it has seen over the last year. Of course I believe that the UST model of a direct relationship with LUNA is flawed but I think that MakerDAO can learn some things from dAPPS like anchor and mirror finance. The problem right now is that DAI is only generated by relatively large holders of digital assets due to the gas fees. I understand this is changing with DAI being put on layer 2s but I think it’s hard to have network effects when the creation of DAI is so limited, of course this is currently out of the DAO’s hands but hopefully with ETH 2, sharding and zero-knowledge proofs vaults will be cheaper to open! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.78781512605042
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "04/01/2022-01:52:49",
                    "content": "    MungoBlakey:  IMO the only serious competitor to DAI currently is UST and the insane growth it has seen over the last year.   Here’s an interesting write-up published today by a LUNAtic community member: The Rise of $LUNA - by Jay J - Luna Digest It’s interesting how the Chai e-wallet has garner growth in a specific concentrated market: Korea ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/01/2022-02:11:37",
                    "content": "Wow certainly a lot happening in the terra ecosystem! It’s going to be interesting seeing how the game theory of incentives and network effects plays out amongst the various layer 1s. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.467857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tru_Greg",
                    "index": "#5",
                    "likes": "2",
                    "time": "06/01/2022-15:22:55",
                    "content": "Great one @flipflopflapdelegate! Good you pointed out that Network Effects is not the same as Virality. I believe it’s good to break this into smaller pieces (as Gary Fox did) and try to see how it all works together, how the elements are reinforcing each other…  What Are Network Effects1200×848 65.9 KB  Once you’d be doing some Zoom call session on this I’m happy to take part and contribute my two cents. Cheers and Happy New Year  G ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.585227272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tru_Greg",
                    "index": "#6",
                    "likes": "1",
                    "time": "13/01/2022-16:15:18",
                    "content": "I just saw this and thought of you @flipflopflapdelegate       ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#7",
                    "likes": "3",
                    "time": "13/01/2022-16:28:07",
                    "content": "excellent topic and post. Maker’s key longterm goal should be creating DAI demand, particularly into real world use cases. Networks effects (and economies of scale) drive markets into natural monopolies/oligopolies.  As such Maker needs to grow/scale quickly.  I believe slow growth is a big risk.  But not dumb growth of course ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "1",
                    "time": "13/01/2022-16:37:21",
                    "content": "    Tru_Greg:  I just saw this and thought of you @ElProgreso    Wowzers! This is a Gem of a find! Thanks for sharing. Nicely done, talk about Marketing network effects, this video production fires in all cylinders. I just picked up this book:  image430×682 78.6 KB  Good addition for that winter-reading-list      Eumenes:  Networks effects (and economies of scale) drive markets into natural monopolies/oligopolies. As such Maker needs to grow/scale quickly. I believe slow growth is a big risk.   For sure, well said. The competition out there is fierce and growing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.185185185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tru_Greg",
                    "index": "#9",
                    "likes": "1",
                    "time": "13/01/2022-17:58:35",
                    "content": "    Eumenes:  Maker’s key longterm goal should be creating DAI demand, particularly into real world use cases.   Agree. I believe NFX’s framework is the most robust and might be a great start to ideate on how to get it spinning, especially in the real world.     flipflopflapdelegate:  I just picked up this book:    Thankfully we’re past the Cold Start with DAI but I’m sure it’s an interesting position. Happy to help! As said, should you be taking this into some discussion, ideation process - I’d love to take part. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.352564102564102
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#10",
                    "likes": "1",
                    "time": "13/01/2022-18:29:55",
                    "content": "This subject is very well worth some serious thought and action. I very keen also on finding these tipping cascades that can decidedly move a stable complex system into a new stable state (i.e. going from FIAT to a DAI economy within a specific system/network). I wrote some thoughts about it earlier (scroll quite far down should you be interested)     COP26, a Technological Revolution History Lens, and some food for thought Proposal Ideas   COP26: Not Cool COP26 concluded a few weekends ago. It did not bring about a conclusive global turning point for climate action, as you may have read in the newspapers.  This sign perhaps summarizes the COP26 agreement best:   [image]  More scientifically, you can see a briefing from climateactiontracker.org from which I have copied the following picture:   [image]  Which shows both an action gap and a commitment gap.  The positive view on the conference might be that globally the target of 1.5…     My working thoughts on this subject, as of right now, goes something like this:   The green economy is spurring a good number of new networks/complex systems - like electrical vehicles and all the services and infrastructure that surrounds it including a related payment and financing system - but there are many, many more mushrooming.   They are all set for fairly explosive growth over even the near term. With no current particular dominance in the full system in respect of finace/payments today I believe.   Could Maker, introduce itself into these systems, and structure itself such that it could make the system into a ‘DAI dominated economy’ - i.e. financing of assets via Maker, payments in system in DAI, motivate participants to remain in Dai in the system etc. And then basically grow with the system that is “Dai locked-in”   All else being equal, the investments and motivations required by Maker to “tip” one of these systems to become dominantly a “Dai Economy” would be smallest today as most of these systems are indeed in their infancy.   This is obviously just a germ of an idea - a lot of watering needed before it blooms into something real. More questions than answers right now. But, I am hopeful, given we are able to get Monetalis going soon, that we can work with Maker Growth to find one of these ‘systems’ in an appropriate shape and size, and then assemble for a coordinated “attack” at trying to turn a new complex green economy system into a ‘Dai dominated economy’. Give us a month or two and probably we will have the idea in seedling stage - and hopefully a path to flowering/attack stage. ",
                    "links": [
                        "http://climateactiontracker.org"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.612723665223665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "2",
                    "time": "13/01/2022-19:08:34",
                    "content": "    Allan_Pedersen:  Give us a month or two and probably we will have the idea in seedling stage - and hopefully a path to flowering/attack stage.   Very interesting thoughts and thank you for sharing them. I’m not sure if you attended today’s Governance & Risk meeting, but part of the discussion was reducing DAI’s exposure to USDC (centralized)–here’s a screenshot courtesy of @gov-comms-core-unit  image1548×438 116 KB  And rightly so, community members stated that RWAs can diversify the USDC risk to DAI, as well as the perception that DAI is just a “USDC wrapper”.  image1740×328 138 KB  But I noticed a small sentiment that some community members believe it will take more than 12 months for RWAs to hit the ground running. I even saw someone post that they’re willing to bet that RWAs will not scale more than $1B this year. Assuming that in a month or two, Monetalis hits the ground running–do you believe RWAs can scale beyond that 1B DAI threshold in the next 12-months? If so, what are the immediate items that need to be resolve before such can at least start “walking”? Obviously part of the equation is the Arranger model, DST structures, but what more beyond that do we need to focus on? What are the network effects that we need to create between institutional players and DAI?     Tru_Greg:  Thankfully we’re past the Cold Start with DAI but I’m sure it’s an interesting position.   hmmm interesting observation–but do you think we have solved the Cold Start Problem to scaling to the hands of “everyday Jane’s & Joe’s”? Can you and I go to Times Square and ask 100 people if they ever heard of DAI and if they have used it to complete a transaction? I think portions of scaling DAI, is still a “cold start problem”–let me know what you think! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.258503401360545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tru_Greg",
                    "index": "#12",
                    "likes": "1",
                    "time": "14/01/2022-19:04:06",
                    "content": "    flipflopflapdelegate:  hmmm interesting observation–but do you think we have solved the Cold Start Problem to scaling to the hands of “everyday Jane’s & Joe’s”? Can you and I go to Times Square and ask 100 people if they ever heard of DAI and if they have used it to complete a transaction? I think portions of scaling DAI, is still a “cold start problem”–let me know what you think!   I didn’t intend to be too technical here  just that for me, a real cold start is where you start from scratch and have nothing to build upon… In the case of DAI - there’s already billions of it in circulation and I’d say there’s a pretty decent chance we might meet someone at Times Square who heard of it or even used it (even a higher probability if we consider South Beach ). You can always find an untapped market if you define it well but in the case of DAI I’d say there’s plenty of things to build and scale upon. Crypto space is more and more popular yet still is referred as a rabbit hole and so for any kind of cryptocurrency to be used by “everyday Jane’s and Joe’s” we need a bit of time and patience, but for it to be a truly mainstream use case it would take an effort of the whole crypto community (not just the Makers). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.317708333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#13",
                    "likes": "1",
                    "time": "15/01/2022-15:04:16",
                    "content": "Hi @flipflopflapdelegate Thank you for the question! On the sentiment that it might take more than 12 months for RWA to be up and seriously deploying - and possibly not reach more than 1B over this year - I think perhaps people like myself are to blame for not having communicated clearly to the community how much real, practical work there is actually going on right now within Maker (in particular with the RWF team I believe) on onboarding and designing robust, scalable credit platforms/arrangers allowing Maker to deploy capital safely at scale and at speed. I will immediately try to fill out that information gap better, for at least, how the Monetalis review/work is progressing. Within a month or so, I think the community will start seeing the results from all this work. Results that will allow Maker to scale way beyond USD 1B in RWA over 2022 in a safe manner - should the community wish to do so. The key item that needs to be resolved, at this moment, to sort of push the ‘on’ button for large scale deployment, is determining the right governance, legal structure, control & monitoring processes for the integration point(s) between Maker and the RWA credit/investment platforms (such as potentially Monetalis) that are in the works. The challenge here is, somewhat, that determining this structural aspect is ultimately a matter of judgement and making a number of choices (for instance, how to design the attestor and trustee role and responsibilities etc). The RWF team is well aware of this, and are indeed, as far as I can see, “knocking out” these decisions at a good pace - and, as said above, I think good results on this will soon be presented to the community. With this practical framework resolved, it becomes a lot easier to move fast forward with onboarding of credit platforms (and Arrangers) that meet the general current credit acquisition criterias for Maker and manage/control them appropriately at scale. What can Maker do to receive more attention from large institutional investors? Well I do actually think there is quite a bit of attention already - but I suppose several of these type of investors are in a ‘wait and see” mode right now. The first step to move beyond this state of affairs would be indeed resolving that governance structural aspect, which I think is getting done and will conclude shortly. The next step, in my view, is to ASAP start making some “Decisive Deployments” - i.e. gain large scale deployments in a few key markets (one of these could potentially be done via Monetalis). Basically, Maker needs to show the financial world that Maker is not dabbling or experimenting with RWA deployments, but is now decisively deploying, at scale, for the long-term - and is acting as a prudent institutional investor in these deployment relationships. If we do this, an accelerated pace of proposals will ensue, and more \"open doors” will be experienced, with large institutions for serious deployments - I am quite confident about that. And then you will have the start of that necessary self-reinforcing cycle of deployment required to take Maker past the many billion dollar mark in RWA deployments over a reasonably short timehorizon. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.850404312668464
                }
            ]
        }
    ]
}