{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-foundation-transfer-of-additional-assets-to-dai-foundation-next-steps/8478",
            "title": "Maker Foundation Transfer of Additional Assets to Dai Foundation; Next Steps ",
            "index": 8478,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "dai-foundation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#1",
                    "likes": "10",
                    "time": "01/06/2021-13:19:46",
                    "content": "Hello, I am Brian Avello, general counsel for the Maker Foundation for those of you who do not know me. As we work towards the Foundation’s dissolution, some Core Units and the Community members have expressed interest in how we plan to relinquish certain properties to the DAO. The purpose of my post is to explain the initial steps in that process from the Foundation’s perspective. First, the Foundation will transition the following assets to the Dai Foundation for temporary care-taking:   Maker Public Calendar   Accounts that only allow for one address (non-multisig): Gitcoin account, Opensea/NFT, VR plots of land   The Marketing website currently running on makerdao.com   Subdomains   Voting Portal Backend Content Management Service   MakerDAO Youtube   Social Media assets (Twitter, Telegram)   Forum, Rocketchat   Community Github Repo   mips.makerdao.com   analytics.google.com   Github Repos   Community Portal: community-development.makerdao.com   https://awesome.makerdao.com/   grants.makerdao.com code   Re Reddit - - we have decided to leave the sub as-is (the only Foundation employee moderator is Rune) Second, the Maker Foundation will transfer any remaining protocol-related trademarks to the Dai Foundation. As you all know, we have historically transferred these defensive marks to the Dai Foundation, and we will continue this practice until all the trademarks are dispersed. Our ultimate goal is to remove any lasting control from the Maker Foundation. Should you have any questions or suggestions, we encourage you to contact the Dai Foundation (Soren, Wouter and Jacek are the best points of contact). As a side note, you can read more about the Dai Foundation’s mandate regarding protocol assets and trademarks here and here. Thanks. Brian ",
                    "links": [
                        "http://mips.makerdao.com",
                        "http://analytics.google.com",
                        "http://community-development.makerdao.com",
                        "https://awesome.makerdao.com/",
                        "http://grants.makerdao.com",
                        "https://blog.makerdao.com/the-maker-foundation-transfers-trademarks-and-software-ip-to-independent-dai-foundation/",
                        "https://forum.makerdao.com/t/announcing-the-dai-foundation/1046",
                        "https://daifoundation.org/",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-6th-2021/8724",
                        "https://forum.makerdao.com/t/mip39c2-sp17-adds-core-unit-daif-001-dai-foundation/9239"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6610644257703076
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/06/2021-13:21:33",
                    "content": "In MKR we have virtual plots? where can I see that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#3",
                    "likes": "7",
                    "time": "01/06/2021-13:42:15",
                    "content": "Hi - to follow up on Brian’s post: I am Søren Peter Nielsen, chair of the board at Dai Foundation for those of you who do not know me. Dai Foundation wants to be as helpful as we can under our mandate to alleviate any gaps that may appear between Maker Foundation dissolving and the establishment of core units to provide services to the protocol. Note that the role of the Dai Foundation is limited to its mandate, as explained in our original announcement linked above by Brian. As part of this, Dai Foundation will temporarily take over management of the Assets Brian mentions in his post. Dai Foundation also will make a draft procedure to suggest how to involve governance in finding more permanent owners for the management of the assets. Notably, the ownership and control of some of these items – say, makerdao.com, the subdomains or social media accounts like YouTube and Twitter – are complicated; nevertheless, the Dai Foundation intends to assure that Maker Governance decides who can post on those accounts. At the same time, other sites, like the Voting Portal, could pose significant problems if not handled properly. Given these concerns, coming up with a workable long-term solution will take time. Please be patient. Søren ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.536210317460317
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gustav_Arentoft",
                    "index": "#4",
                    "likes": "1",
                    "time": "01/06/2021-16:03:15",
                    "content": "We have quite a big plot in Sandbox. We also have a MakerDAO building in Decentraland.    Medium – 2 Feb 20    Partnership Announcement:  The Sandbox ft. MakerDAO We are excited to announce that we are partnering with MakerDAO, the organization behind the leading decentralized stablecoin Dai! Reading time: 2 min read       https://play.decentraland.org/?position=68%2C23&realm=loki-amber ",
                    "links": [
                        "https://medium.com/sandbox-game/partnership-announcement-the-sandbox-ft-makerdao-1da62bb5b4de",
                        "https://play.decentraland.org/?position=68%2C23&realm=loki-amber"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "0",
                    "time": "01/06/2021-16:10:38",
                    "content": "    Gustav_Arentoft:  We have quite a big plot in Sandbox. We also have a MakerDAO building in Decentraland.   and we have something in Axie Infinity, I know we are a sponsor. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gustav_Arentoft",
                    "index": "#6",
                    "likes": "0",
                    "time": "01/06/2021-16:13:23",
                    "content": "I am pretty sure we don’t have land in Axie Infinity. We have been helping them on a bunch of stuff in regards to their tournaments and are long time friends of the project. We have more coming as well in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#7",
                    "likes": "0",
                    "time": "01/06/2021-16:26:46",
                    "content": "thank you for your time, it is very valuable for me, as they say in venezuela “you are a sun”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ]
}