{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rfc-budget-request-mip-break-on-going-from-expansion-budget-requests-budget-polling-to-rcv/13877",
            "title": "RFC Budget request MIP - Break on-going from expansion budget requests. Budget Polling to RCV ",
            "index": 13877,
            "category": [
                "Governance"
            ],
            "tags": [
                "core-unit-budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "17",
                    "time": "13/03/2022-17:05:07",
                    "content": "Dealing with budget requests. I want to be clear here.   It is my preference to have sufficient funds to fund a lot of growth.    At some point if we don’t have funds not just for growth but also for ongoing operations we are going to have to find expense cuts. I did not write this as a MIP because I believe it needs discussion first but the intent is to turn this into a MIP that alters the budget request and polling process. Maker now has >20 CUs with more ‘incubating’ and over 1/2 of these after as little as 6 months asking for expanded budgets with greater than 10% increases.   This also includes MKR vesting. With revenue on the decline and expenses still rising dramatically MakerDAO governance needs a better way to manage MakerDAO CU budgets (this includes DAI streaming and MKR vesting). I want to propose for discussion the following suggestions to help governance manange budgets.   All budget requests should break into ‘on-going’ cost for services provided delineating these services and their associated costs.   In these budget requests a first shot analysis of what happens if funding for the CU ongoing request is cut to 95, 90, 80, 50, or 0% should be undertaken to provide governance information as to what happens to services the CU provides is cut.   All CU ‘expansions’ to budget need to be a separate request including what new CU functions will be added, what including these will do to the ‘ongoing budget’ and implications if any for what we won’t have if the budget expansion is rejected.   Also an analysis of what we get or extended timelines if this expansion is funded at 50,80,90,95%.   Change polling on budget requests from yes/no on these to ranked choice voting 100, 95, 90, 80, 50, 0  (a choice of 0 effectively being a no to this request).   Goals of these changes.  For both CUs and governance to get a sense of budgetary continuity Segregate budget expansions from on-going expenses. Allow governance not to have to deny a total budget due to an expansion component that is unsatisfactory Allow governance a first shot at reducing budgets (50,0 would be extreme, but 95% not so much) Allows governance to adjust not just the total budget but also the total MKR vesting over the budgetary period - these should track anyway so why not have them track in the budget process  The above changes should allow for some sense of budgetary continuity for CUs, and some basic sense of budgetary control for governance.   It probably isn’t ideal and if anyone has an alternative approach as easy to implement feel free to propose it here in the forums. We don’t want CUs wondering if their budget was denied due to an expansion and that governance doesn’t intend to fund continuing operations.   The above changes forces CUs to think and report on their ‘on-going’ budgets from the perspective of what services they are sustaining and what happens if their funding gets cut. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-182-thursday-march-17-17-00-utc/13965/2",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-10-16-2022/13977",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/55",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906"
                    ],
                    "GPT-summary": "The author proposes changes to the budget request and polling process for MakerDAO governance to better manage CU budgets. The proposal suggests breaking budget requests into 'on-going' costs and 'expansions,' analyzing the impact of funding cuts, and changing polling to ranked choice voting. The goal is to provide budgetary continuity for CUs and basic budgetary control for governance. The post also invites alternative proposals and feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.928582702020202
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#2",
                    "likes": "11",
                    "time": "14/03/2022-10:37:40",
                    "content": "What I suggest is that we form an initiative around this with ideation, solution design, a roadmap and the rest of the tools that we’ve developed for coordination, because currently there are a number of activities going on in parallel and there seems to be no coordination at all. This would be the first initiative that has delegates as actively participating stakeholders, but I don’t see an issue with that. My two cents: the suggestions that are brought up so far are useful and they may become part of the solution. What they lack is a coherent broader strategy to make the DAO resilient to economic downturns. Forming a strategic initiative around this will hopefully help. Happy to support it as participant and, if it’s deemed useful, as facilitator. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.098484848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "3",
                    "time": "14/03/2022-14:23:47",
                    "content": " Monday Morning Thoughts     MakerMan:  With revenue on the decline and expenses still rising dramatically MakerDAO governance needs a better way to manage MakerDAO CU budgets (this includes DAI streaming and MKR vesting).   While I am a proponent of creating tooling for gauging Core Unit performance, or as @wouter  mentioned, perhaps creating an oversight committee–and the commentary here might not necessarily address the proposal being discussed here, I can’t help but think how Core Unit members feel when they read commentary pertaining to their budgeting and budget monitoring. I can’t help but to think that in the near-future Facilitators will Fear asking for room to Grow, and for expansion of their teams. Instead of focusing most of the recent Forum’s chatter on questioning and cutting budgets that 99% of the community does not comprehend, we should also encourage Core Units to hire the unsung talent of people that are currently stuck working at a Corporation that is eating-away at their soul. The hidden talent that is 12 levels below the CEO of a Corporation–those individuals can join this community and make an immediate impact, because innovative minds can come from professors, to engineers that never imagined themselves working with financial instruments. There is a large number of smart people who are locked-in professions that do not get the most out of their talent. Intelligence is being squandered and MakerDAO should be focus on attaining such talent. The focus should be on placing Capital in people who want to go after problems that are right in front-of-us. If we start forgetting and believing that there’s not enough problems to solve when it comes to DAI Distribution, that just means that we are lacking imagination. The Capital is available, it’s out there and it is in desperate need of Yield. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.514005602240896
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#4",
                    "likes": "3",
                    "time": "14/03/2022-15:10:08",
                    "content": "I personally support the idea of gauging CU performance via a tool or committee. Sometimes it may be stressful and difficult to accept criticism against one’s own beliefs for their CU and budget, but that challenge is usually needed, especially for newer CUs, to help us grow with the community. I am also aware and concerned about a potential bearish divergence between total spending vs. revenue, and it is up to each of us to keep that in mind. Nonetheless, market conditions have not been ideal, and new customers MoM has slowed down (hopefully just temporary). This makes CU growth just a bit more difficult for the time being as a majority of the mindset is very grounded and risk-off. This is, in one way, a pro; but as you mentioned, it can also be a con:     flipflopflapdelegate:  The focus should be on placing Capital in people who want to go after problems that are right in front-of-us. If we start forgetting and believing that there’s not enough problems to solve when it comes to DAI Distribution, that just means that we are lacking imagination. The Capital is available, it’s out there and it is in desperate need of Yield.   ^ Totally agree and support this objective. Another note: it is more difficult for certain CUs such as GovComms (and others) that do not directly help generate revenue, such as PECU, Oracles, etc. This makes our value relative to protocol revenue tricky to quantify, especially when many services offered are focused on communication and QoL improvements. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.33289794496691
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#5",
                    "likes": "3",
                    "time": "14/03/2022-17:01:54",
                    "content": "Just to address these points:     flipflopflapdelegate:  I can’t help but to think that in the near-future Facilitators will Fear asking for room to Grow, and for expansion of their teams.   Using the same logic, I think we can agree that if there’s no oversight and no closer examination for budgets especially budget increases, the protocol won’t have funds to actually fund initiatives that grow the ecosystem. We say “The first lesson of economics is scarcity” and we have to ensure that such resources are well used.     Artem_Gordon:  Another note: it is more difficult for certain CUs such as GovComms (and others) that do not directly help generate revenue, such as PECU, Oracles, etc. This makes our value relative to protocol revenue tricky to quantify, especially when many services offered are focused on communication and QoL improvements.   This is a fair point but at the same time, similar to in legacy companies or the government budget discussion, it is indeed possible to try to quantify or at least keep track of KPIs to see the progress. One of the most common approach has been measuring opportunity cost. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.360544217687075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#6",
                    "likes": "6",
                    "time": "14/03/2022-17:42:02",
                    "content": "I’m all for having a budgeting process that works for MakerDAO and look forward to the continued discussion. Budget processes match strategic objectives in an organization. I would vote to start there. The maturity of an organization, product lines, and market significance also impact the budgeting process. If we can identify and agree on MakerDAO’s phase of growth, we can model our budgets after similar companies going through the same growth phase. We also have a lot of stakeholders/VCs that have deep experience to draw on so we don’t have to reinvent the budgeting cycle wheel. My opinion is that MakerDAO is in growth mode. In many cases, this means we spend more than we take in for a period of time. Two things need to happen if this is the case: 1) We need to agree that we’re in growth mode and 2) We need access to funding/capital to fuel the growth. I think the later is the easier of the two. Budget questions are asked in the context of, how does this support the strategic objectives? Without that context, I’m not sure how we balance competing priorities and I get concerned the process becomes cookie cutter and subjective. It’s clear to me that there are areas we need to pour money into and areas where we can choose to be conservative. I’m relatively certain we will come up with a revised process for our budget. The question for me is, Are we going to design a model that only looks at the profits we generate and fund ourselves organically? I think this is the default unless there is agreement on other factors like organizational maturity (startup, growth, maturity, and renewal/rebirth…or decline) and strategic objectives. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4269480519480515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#7",
                    "likes": "1",
                    "time": "14/03/2022-18:01:19",
                    "content": "Very much agreed here with @monkey.irish on the need to put the discussion in a bigger context. We’ll go ahead and kick off the strategic initiative I mentioned to accomplish this. As a first step, we’ll bring the discussion topic to the G&R call this Thursday (pending topic approval.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#8",
                    "likes": "4",
                    "time": "14/03/2022-22:34:50",
                    "content": "The thing is that while everyone is talking about Maker being in growth mode and reinvesting profits, recent months have shown a large contraction in income and revenue.  You could say the industry in general has hit a rough patch but when the numbers stop saying you’re growing, people are going to call for you to consider your spending.  If the core units want to spend expand and spend more, then they need to find a way to increase revenue proportionally.  Fact is, spending is growing quickly and revenue is not just slowing, it’s contracting.  That just isn’t going to fit the narrative if it continues. Also, some of these expenses are for benefits, raises or efforts to compensate past efforts.  This isn’t going to affect future growth in any positive way except perhaps to make people happier (and maybe only temporarily).  Yes, there does need to be a perception of fairness but if people can get more compensation, they’re going to take it so you really need to exercise some restraint when trying to satisfy everyone.  I would argue that if you are truly in this for the long haul and believe in Maker, then when necessary, you need to collectively be okay taking less from the protocol while still working your hardest to make it successful.  If people have the attitude that they’re not going to work as hard because they’re funded at 80% of what they wanted, all this budgeting isn’t going to be super effective either because you don’t want to get 50% effort from a bunch of disgruntled workers who use the excuse of not being fairly compensated to work less.  What you need are people who are willing to work through the downturns even if they aren’t highly compensated.  Yes, there’s risk to this and there are factors like healthcare and benefits to consider.  But the upside is huge as well and from what I’ve seen, most here are quite well-compensated for what they do.  I don’t get the sense that anyone is scraping by to survive. So bottom line, either revenues need to grow or budgets are going to come under increasing scrutiny.  And even if revenues are growing, there still needs to be transparency as to how funds are used to actually benefit the Maker protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.955728466935364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#9",
                    "likes": "1",
                    "time": "15/03/2022-00:51:12",
                    "content": "    Traster_Tray:  So bottom line, either revenues need to grow or budgets are going to come under increasing scrutiny. And even if revenues are growing, there still needs to be transparency as to how funds are used to actually benefit the Maker protocol.   I agree. I can appreciate the conversation around people, hiring, salaries, incentives, etc. I know this is going to be an ongoing conversation in the DAO for some time and it’s great to get your perspective. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#10",
                    "likes": "2",
                    "time": "15/03/2022-13:47:09",
                    "content": "    wouter:  put the discussion in a bigger context   It would be worth looking from the perspective of competitiveness and sustainability. Competitiveness and sustainability are inseparable concepts. Competitiveness cannot exist without sustainability. At both the corporate and the economic level, only those who are able to sustain their excellent performance over the long term can be winners. To assess and improve our sustainable development and competitiveness, it would be necessary to measure them accurately. Unfortunately, this is not possible today.  In business, what cannot be measured cannot be changed.  In order to start to improve, it will be necessary to set up common indicators focused on this issue. I believe that mismanagement of this issue can cause as much damage as mismeasurement of credit risk, for example, so it is important to pay attention to it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#11",
                    "likes": "0",
                    "time": "14/06/2022-19:47:21",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}