{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/can-someone-put-a-vote-for-the-new-debt-ceiling/1257",
            "title": "Can someone put a vote for the new debt ceiling? ",
            "index": 1257,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "debt-ceiling"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#1",
                    "likes": "4",
                    "time": "12/02/2020-17:32:55",
                    "content": "The ETH Ceiling utilization is 92.4% and it might be 100% in a few days, so it is time to choose a new DC. I suggest the options:  150M 175M 200M 250M 300M  ",
                    "links": [],
                    "GPT-summary": "The author is explaining the need for a new debt ceiling for ETH and suggesting options for the new ceiling. A third party is asking for someone to put a vote for the new debt ceiling and may have questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.121212121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/02/2020-11:53:48",
                    "content": "Hey Bit. Thanks for bringing this up again. You’re right, in the bull market the amount of Dai minted can spike very quickly as everyone wants to go long. If you would like there to be a signal request on his subject, your options are either to run it yourself, or to find someone that is willing to run it. At this point there are a number of examples of how to run these threads. There are also posts with guidelines, and suggestions of what it should include. I’d also recommend giving some thought to the method we used for the SCD debt ceiling prior to the launch of MCD (maintaining a buffer, detailed here.) If you want to do this, feel free to let me know and we can chat about best practices and such on chat.makerdao.com In the absence of a signaling thread, I expect @Cyrus will make a decision on the number and the proposal will appear on-chain. I’m also fairly sure that Cyrus would much rather have a signal thread happen rather than make the decision himself, so if anyone else does want to volunteer feel free. ",
                    "links": [
                        "https://forum.makerdao.com/t/suggested-signaling-process/396",
                        "https://forum.makerdao.com/t/signal-request-should-we-increase-the-scd-debt-ceiling/506",
                        "https://chat.makerdao.com/home"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2624627976190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/02/2020-14:03:30",
                    "content": "…or we can discuss the views here in plain text. I’ll see if I can manage to do that formal process before the DC is reached. EDIT: Created a signal request. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.9285714285714284
                }
            ]
        }
    ]
}