{
    "poll_list": [
        {
            "title": "Change the Stability Fee Structure - May 18 2020",
            "index": "2380",
            "option": "Yes (allow negative Base Rate)",
            "supporting_mkr": "8,117",
            "highest_fraction": -1
        },
        {
            "title": "Base Rate Adjustment - May 25, 2020",
            "index": "2380",
            "option": "0",
            "supporting_mkr": "17,742",
            "highest_fraction": 0.79
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-change-the-stability-fee-structure/2380",
            "title": "[Signal Request] Change the Stability Fee Structure ",
            "index": 2380,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "meta-governance",
                "rates",
                "fee-structure",
                "base-rate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "5",
                    "time": "05/05/2020-13:40:31",
                    "content": "Discussion: Change the Stability Fee Structure Based on the discussion over the past week it seems there were no strong objections to proceeding with this initiative. The main points of contention were around naming and the negative base rate. I’ve decided to run a 4 polls to cover these points of contention as well as a poll to cover something which wasn’t really discussed - the polling cadence of the vault portion of the fee.  The General Idea The first poll is on whether you in general like the idea of splitting the stability fees into two separate components - one global fee portion (the Base Rate) and one per-vault fee portion (Name to be Voted).     Yes, I want to proceed with the change to split the stability fees into two components. No, I like things the way they are. No, I have a different way to proceed. Abstain (I disagree with the poll options) Abstain (I have a different objection) Abstain (I want to see the results) Abstain (I have no opinion)     0 voters      Naming I saw no objection to the term Base Rate to refer to the global portion of the fee, so I’ll assume that is okay to proceed with. There have been three terms floated for the vault portion of the fee. I will summarize as best I can.  Risk Premium Argument For: The vault-specific portion of the fee will mostly if not completely consist of the risk premium. Historically this is the term most people seem to use and understand.  Vault Fee Argument For: The Risk Premium is not the only part of the vault-specific portion, and so we should generalize the term to include future pieces such as collateral-specific taxes/subsidies.  Vault Spread Argument For: Similar argument to Vault Fee, but use the term spread as it may be less confusing to the vault owners. With Base Rate and Vault Spread as the main terms it is still clear that Stability Fee is what they will be paying and it won’t be confused with the vault-specific portion. There is also a symmetry surrounding the name Spread as the DSR Spread and Vault Spread both extend from the Base Rate in opposite directions. Pick your preference:     Risk Premium Vault Fee Vault Spread Abstain (I disagree with the poll options) Abstain (I have a different objection) Abstain (I want to see the results) Abstain (I have no opinion)     0 voters      Negative Base Rate Under this new system we have: Stability Fee = max(Base Rate + Vault-specific Fee, 0%) A negative Base Rate allows us to achieve a target Stability Fee of 0%. Without the negative Base Rate the lowest Stability Fee we can achieve is whatever the vault-specific fee of the collateral is. Keep in mind this is a governance construct and does not correspond to any system parameters being negative. For example, let’s say risk comes back and tells us that the Risk Premiums are as follows: ETH-A = 2% BAT-A = 2% USDC-A = 10% WBTC-A = 12% to encode the current setup of ETH-A Stability Fee = 0%, BAT-A SF = 0%, USDC-A SF = 0%, WBTC-A SF = 1% we can do this: Base Rate = -11% (MKR is subsidizing the risk premium in exchange for peg stability) ETH-A SF = max(2% + (-11%), 0%) = max(-9%, 0%) = 0% BAT-A SF = max(2% + (-11%), 0%) = max(-9%, 0%) = 0% USDC-A SF = max(10% + (-11%), 0%) = max(-1%, 0%) = 0% WBTC-A SF = max(12% + (-11%), 0%) = max(1%, 0%) = 1% I will attempt to summarize the pros/cons:  Pros  Allows more flexibility in what we can vote on in the weekly poll. Without a negative Base Rate reaching a Stability Fee of 0% requires initiating one-off votes for each of the vault-specific fees. Makes it explicit when we are subsidizing risk with MKR. Base Rate > 0% means the system should be bringing in revenue. Base Rate < 0% means the system should be taking on debt. In an ideal world the Base Rate should always be >= 0%, but it’s good to have this option available.   Cons  Too complex. It’s simpler for voters and users to not have to deal with a negative rate. MKR subsidies for risk should be a rare occurrence. We have the tools available with the vault-specific portion votes to set Stability Fees to 0% so why complicate this more than necessary when it will not be used that often.  Pick your preference on allowing a negative Base Rate:     Yes, allow a negative Base Rate. Disallow a negative Base Rate. 0% Base Rate will be the minimum. Abstain (I disagree with the poll options) Abstain (I have a different objection) Abstain (I want to see the results) Abstain (I have no opinion)     0 voters      Vault-specific Polling Cadence One of the reasons to make this fee split is to reduce the number of weekly governance fee votes from 1 per vault type to some smaller number for scaling purposes. The two options I see are having the vault-specific portions of the fee voted on at either an infrequent, but regular voting period or on an as-needed basis. An example of the as-needed basis is if the risk team shows that the risk premium has changed for ETH-A and it needs to be adjusted.     We should vote on vault-specific fees at an infrequent, but regular interval. We should vote on vault-specific fees on an as-needed basis. Abstain (I disagree with the poll options) Abstain (I have a different objection) Abstain (I want to see the results) Abstain (I have no opinion)     0 voters     Polls will run until Thursday May 14th at 11:00am EST to be discussed on the weekly governance call. Possibility for extension if there is not a clear answer by then. ",
                    "links": [
                        "https://forum.makerdao.com/t/dai-is-back-under-1-time-to-get-prepared-for-tightening-that-might-be-needed-soon-whats-next/2682/3",
                        "https://forum.makerdao.com/t/discussion-separate-centralization-risk-within-risk-premium/3005",
                        "https://forum.makerdao.com/t/a-note-on-stability-fee-parameters/3194",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-21-9am-pst-4-00-pm-utc/2579/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-14-9am-pst-4-00-pm-utc/2497/2",
                        "https://forum.makerdao.com/t/mkr-holder-dai-gest-week-19-2020-use-bitcoin-wbtc-to-open-a-vault-on-makerdao/2435"
                    ],
                    "GPT-summary": "The author of the post is proposing a change to the stability fee structure and is seeking feedback through a series of polls. The post explains the proposed changes and addresses potential concerns. The post also invites feedback and questions from third parties.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 4.160024906600249
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "5",
                    "time": "07/05/2020-15:12:18",
                    "content": "Any chance I can get people to reconsider the use of ‘Risk Premium’ as terminology for the Vault Spread? We already use Risk Premium to refer to the portion of the fee which balances the risk taken by the Protocol, this is distinct from any monetary policy adjustments to that number which combine to form the Vault Spread. It’s undesirable to name the combination ‘Risk Premium’ because it implies that we are correctly balancing risk for these Vault types whereas in actuality we would not be. I’d literally prefer we called it something nonsensical like ‘Jellybean Premium’ than ‘Risk Premium.’ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#3",
                    "likes": "0",
                    "time": "07/05/2020-15:26:57",
                    "content": "I always considered risk premium just a general term, that is just part of the financial vocabulary. Also, protocol is not really formally specified and versioned. I mean, i am the guy who is bothered by token being called Dai, instead of Dai 1.0., but i just don’t have the energy to fight for clarity, backwards compatibility, transparency etc… I don’t think majority of holders really care. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.8375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "07/05/2020-15:31:34",
                    "content": "I think I may be wrong on my definition anyway, had a quick look here: https://www.investopedia.com/terms/r/riskpremium.asp I’d still rather we didn’t overload the term though. If we call the combined rate ‘Risk Premium’ what do we call the two components? Risk Premium = Monetary Policy Modifier + ??? And then we have: Stability Fee (should be Vault Fee) = Base Rate + Risk Premium? Edit: Nevermind, risk free rate is something different  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.433333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#5",
                    "likes": "2",
                    "time": "07/05/2020-15:43:00",
                    "content": "Agree with LFW. We should be thinking forward on this terminology. Stability Fee has already been grandfathered in as the term for the total fee, but really only a portion of it is used for “stability”. Risk Premium may cover exactly what the vault portion of the fee is right now, but we are almost certainly going to be adding a monetary policy component later on. Also, I would like to hear some arguments for why people do not want the negative base rate? I feel like we are shooting ourselves in the foot by not including this. In the current market it’s clear MKR holders want to subsidize the risk of ETH to defend the peg. We will lose this monetary tool if we only allow for a positive base rate. I understand we can initiate one-off votes for each collateral type, but why do this when we can encode this goal into an existing weekly tool? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.683566433566433
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#6",
                    "likes": "1",
                    "time": "07/05/2020-15:56:00",
                    "content": "    hexonaut:  Also, I would like to hear some arguments for why people do not want the negative base rate?   I don’t think negative base rate makes any sense and have no problem if we are off the peg for a longer periods of time. I am not 100p against it, but such things should be taboo. But yeah, we are in bad situation since we are pegged to something fundamentally broken (current financial system does not allow for asset depreciation, and borrowers are perpetually bailed out). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.325
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#7",
                    "likes": "0",
                    "time": "07/05/2020-15:57:03",
                    "content": "Could you elaborate on what aspect doesn’t make sense? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "4",
                    "time": "07/05/2020-17:36:00",
                    "content": "I edited to explain the negative Base Rate more in the hopes that maybe the no votes are coming from not properly understanding what it means. Under this new system we have: Stability Fee = max(Base Rate + Vault-specific Fee, 0%) A negative Base Rate allows us to achieve a target Stability Fee of 0%. Without the negative Base Rate the lowest Stability Fee we can achieve is whatever the vault-specific fee of the collateral is. Keep in mind this is a governance construct and does not correspond to any system parameters being negative. For example, let’s say risk comes back and tells us that the Risk Premiums are as follows: ETH-A = 2% BAT-A = 2% USDC-A = 10% WBTC-A = 12% to encode the current setup of ETH-A Stability Fee = 0%, BAT-A SF = 0%, USDC-A SF = 0%, WBTC-A SF = 1% we can do this: Base Rate = -11% (MKR is subsidizing the risk premium in exchange for peg stability) ETH-A SF = max(2% + (-11%), 0%) = max(-9%, 0%) = 0% BAT-A SF = max(2% + (-11%), 0%) = max(-9%, 0%) = 0% USDC-A SF = max(10% + (-11%), 0%) = max(-1%, 0%) = 0% WBTC-A SF = max(12% + (-11%), 0%) = max(1%, 0%) = 1% ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.5524475524475525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#9",
                    "likes": "0",
                    "time": "07/05/2020-17:48:03",
                    "content": "We are in the world of crypto assets. As long as the collateral comes from crypto assets, the effect of low interest rate and negative interest rate is basically the same. Negative interest rates will only work if future collateral is added to real world assets. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "0",
                    "time": "07/05/2020-18:40:20",
                    "content": "Suppose we have a USDC-B vault type with a high stability fee (30% or whatever) for emergency liquidity. In your new scheme, can we keep the stability fee at 30% regardless of the base rate? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.160606060606061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#11",
                    "likes": "2",
                    "time": "07/05/2020-18:49:31",
                    "content": "i think in the way that this is currently proposed it would move in lock step with the base rate, so for instance you could imagine right now we have a base rate of 0%. Well if we wanted to add this 30% SF USDC-B vault type i think it would end up with a “risk premium” of 30%. Suppose in 12 mo ETH starts on a bull run and we need to raise the base rate to say 3% well once that happened USDC-B would have a SF of 33%. IF we wanted to keep it at 30% i think that would be doable but you would need an executive vote to reduce the “risk premium” on USDC-B to 27%. That said, IMO i don’t think this would be necessary given that in this hypothetical we would be looking at a more bullish crypto-economic cycle, but i think that is how it would work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.8469387755102034
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#12",
                    "likes": "0",
                    "time": "07/05/2020-20:32:50",
                    "content": "The issue with a negative base rate is it opens up the possibility of a negative total rate. Which maybe could work, but I feel like we haven’t properly discussed the ramifications of a negative total rate, especially for long periods of time. I don’t care so much about the terminology, but risk premium seemed like the most sensible thing to call it. Maybe collateral premium? Token premium? Vault spread doesn’t make any sense cos the rate is per form of collateral, not per vault. Alternatively we could call the total rate just “total rate” instead of risk premium, but that could be confusing with older use of defunct terminology. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.5773809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#13",
                    "likes": "3",
                    "time": "07/05/2020-20:35:09",
                    "content": "I also like Andy mcCall’s idea for a multiplicative base rate instead of an additive one, which would then allow us to move all collateral types to a total rate of 0% without using negative base rates. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 2.6249999999999996
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#14",
                    "likes": "2",
                    "time": "07/05/2020-20:48:04",
                    "content": "    befitsandpiper:  The issue with a negative base rate is it opens up the possibility of a negative total rate. Which maybe could work, but I feel like we haven’t properly discussed the ramifications of a negative total rate, especially for long periods of time.   The way I defined it is so that negative total rates are not possible.     befitsandpiper:  Vault spread doesn’t make any sense cos the rate is per form of collateral, not per vault.   The rate is actually per vault. For example ETH-A and ETH-B could have different rates. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.267857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#15",
                    "likes": "1",
                    "time": "07/05/2020-21:04:32",
                    "content": "A multiplicative base rate is interesting, but a special case would be needed for a USDC-B vault with high stability fee for emergency liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.271428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#16",
                    "likes": "0",
                    "time": "07/05/2020-21:18:25",
                    "content": "Why do we need two udsc vaults? Wouldn’t that be redundant? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#17",
                    "likes": "1",
                    "time": "07/05/2020-21:40:37",
                    "content": "It has been a popular idea thrown around lately that we need a second USDC vault type with a high stability fee so it could be used to generate DAI mostly in the context of a flop auction.  Would go into it in more depth but it is probably off topic for this forum thread. Maybe start a separate post for your question here? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.216666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#18",
                    "likes": "1",
                    "time": "07/05/2020-22:22:04",
                    "content": "    befitsandpiper:  collateral premium   FWIW i like this one ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#19",
                    "likes": "1",
                    "time": "08/05/2020-01:46:39",
                    "content": "I was originally liking a multiplicative base rate (ax+b). But realised that you then need to have two global parameters (a and b) plus a vault specific parameter (x). I think this adds too much complexity. I think having an additive system (b + a) strikes a better balance of utility and simplicity. I’m personally in favour of the negative base rate. Without it, we are saying that every collateral with a stability fee currently at 0% should start with their collateral premium at 0%, which I don’t think many people would agree is correct. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8522727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#21",
                    "likes": "0",
                    "time": "08/05/2020-03:52:52",
                    "content": "    The_Ratj:  I was originally liking a multiplicative base rate (ax+b). But realised that you then need to have two global parameters (a and b) plus a vault specific parameter (x). I think this adds too much complexity. I think having an additive system (b + a) strikes a better balance of utility and simplicity.   Yeah, it’s a bit too complex to poll for. And b+a should be fine as long as the vault spread gets periodically adjusted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.189814814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#22",
                    "likes": "0",
                    "time": "08/05/2020-04:10:18",
                    "content": "With this clarification from Hexonaut that negative total rates are not possible, does that change anyone’s mind on the vote regarding the ability to have a negative base rate? I don’t think an additive system makes much sense without the ability to drop the base rate to negative. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#23",
                    "likes": "2",
                    "time": "08/05/2020-06:10:03",
                    "content": "Personally my stance is unchanged. I think all of the discussion going on in this thread (not to mention the first thread revolving around this topic) is just more evidence that negative base rate is frankly confusing to people. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.458333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#24",
                    "likes": "1",
                    "time": "08/05/2020-12:15:52",
                    "content": "So are you advocating for the minimum stability fee being the risk premium or do you think we should have to initiate 4 polls (one per collateral) to change each of the risk premiums when the market becomes bearish? IE let’s say 2 years from now the risk premium on ETH-A is 2% and we have entered into a bear market with a 90% drawdown on ETH. This is similar to 2018. Are you saying you do not want the total Stability Fee on ETH-A to be able to go below 2%? In which case we are giving up some monetary policy control in order to make sure MKR does not take losses. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#25",
                    "likes": "0",
                    "time": "08/05/2020-14:53:39",
                    "content": "I guess im in the 4 polls camp, but I don’t think that is how things would work in practice. Lets take this Executive that passed shortly after the “black thursday” event as an example. We didn’t hold a bunch of on-chain polls where we decided what every one of those numbers should be. The risk team just proposed several of those numbers on the forums and a few hours later we ratified them on-chain. I think that in this scenario where we have another black swan event we would likely act similarly, so I don’t really see this as a big of a concern as we are making it out to be. Also FWIW, this idea of 4 polls doesn’t seem THAT crazy to me. Looking at this last event as a sort of a disaster response prototype, I think that it is likely that after any black swan event we will see a huge rate cut followed by a few weeks of price discovery where we try out progressively lower stability fees. Maybe next time it will play out differently idk, but it seems fairly reasonable that MKR holders would want to test the waters at a few different pricing points on our way to 0% as opposed to going from 8% to 0% overnight. ",
                    "links": [
                        "https://forum.makerdao.com/t/black-thursday-response-thread/1433/82"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.816666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#26",
                    "likes": "2",
                    "time": "08/05/2020-15:08:20",
                    "content": "So in another “Black Thursday” type event I think I agree with you that just overriding the regular governance process is maybe to be expected. I would rather focus on a slower drawdown like what happened in 2018 where ETH dropped from $1400 USD to $80 over the course of a year. I think we would all agree that something like this has a decent chance of happening again in the next few years. Not sure if you were around back then but the Stability Fee for SCD sat at 0.5% for most of the year IIRC. Under a no negative Base Rate scenario having a Stability Fee this low is unachievable within the weekly monetary policy cycle. Instead we would have to initiate a Risk Premium change poll to cover a monetary policy decision. Why not keep risk separate from monetary policy if we can instead of muddling them together during bear markets? Another point I want to make is that yes it is only 4 polls now, but I don’t think it’s out of the realm of possibility that we have hundreds of collateral types in the future. If we don’t ignore the governance process, do you really want to initiate hundreds of polls to adjust the Risk Premiums to adjust for a monetary policy decision of wanting more borrowing? Especially when we could have a tool to include this inside the existing monetary lever. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.052083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#27",
                    "likes": "0",
                    "time": "08/05/2020-15:24:17",
                    "content": "    hexonaut:  it is only 4 polls now, but I don’t think it’s out of the realm of possibility that we have hundreds of collateral types in the future   This, in my opinion, is probably a bit optimistic at least in the medium term. I think what is fairly likely is that we end up with 10s of different collateral types lets say 50 and that those 50 collateral types follow a sort of Pareto distribution in terms of their overall contribution to the DAI supply. I.E we are going to be in a situation where we have maybe 10 different collateral types that we really care about and would likely change their risk premium if the market situation demanded it and bunch more types of collateral that we aren’t really that concerned with that can just ride the base rate as it moves. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#28",
                    "likes": "2",
                    "time": "08/05/2020-21:11:13",
                    "content": "I still think the use of a multiplicative base rate is the best, simplest way to solve this issue, keep base rate above 0%, and have only 1 poll in most situations where we need to adjust rates. The idea that we need a constant addition (ax + b) and so a 3rd variable is moot I think. We don’t need a constant add, we can just multiply the base rate by a collateral specific risk variable (which in the future could be formalized and tied to volatility or some other objective metric for that collateral). Adding a constant offset from zero would give all of the bad parts of an additive system, and doesn’t benefit us in my opinion. We want all total rates to go to zero as we lower the base rate. In the event of a crisis where we need maximum liquidity, we can just set base rate to zero and all total rates will be set to zero. This has the advantage too that any adjustment in the base rate will adjust all total rates proportionally to risk, whereas with an additive system, upward adjustments could still have most collateral types unchanged at 0% while a few go positive in a discontinuous way. Personally I find this all much more intuitive than having negative base rates, having to think about maxs and mins, etc. These are all confusing technical details for lay people. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.297230113636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#29",
                    "likes": "1",
                    "time": "08/05/2020-21:12:16",
                    "content": "If we’re still planning on keeping a poll for every collateral type we have, we shouldn’t even change the stability fee structure, cos that’s what we’re already doing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#30",
                    "likes": "3",
                    "time": "09/05/2020-14:29:21",
                    "content": "The multiplicative Base Rate is an interesting idea, and yes you are correct it would encompass MKR subsidies with a rate between 0 and 1. That being said I have a few concerns with this:   It would too rapidly price out collateral with higher Risk Premiums. For example if ETH-A is 2% RP and wBTC RP is 10%. Now let’s say it’s Feb 2020 before the market crash where ETH-A was at a SF of around 8%. Under an additive system this would put the Base Rate at 6% giving wBTC a SF of 16% which is high, but I can still see vaults being made at this number. Now with a Base Rate of 4x in the multiplicative situation we have wBTC SF of 40% which I doubt very many vaults would be created at that level.   Striving for positive numbers in all your fees is pretty arbitrary and shouldn’t be used as a reason for one system or the other.   Overall it’s an interesting concept. I just view the additive as a more appropriate fit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.327139037433155
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#31",
                    "likes": "1",
                    "time": "09/05/2020-19:08:29",
                    "content": "I guess maybe it makes more sense to think of the base rate as an interest rate, and each of the collateral specific risks as multipliers, so yes you would have much smaller number for the individual vaults than we do now. say 1x for eth-a, 1.5x for usdc-a as an example to keep the numbers from exploding so fast. could call these risk multipliers instead of risk premiums. Anyway, that’s my two cents. I think I’ve explained my position well, but we’ll see what everyone else thinks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#32",
                    "likes": "3",
                    "time": "09/05/2020-22:54:11",
                    "content": "I’m not a fan of a multiplicative system in a SF = bx (1 global paramater, 1 Vault parameter) model for Hexonauts reasons above. I think that a SF = a + bx model (2 global parameter, 1 Vault parameter OR 1 global parameter, 2 Vault parameter) may be the best mathematically. But I think it adds quite a bit more confusion to the system plus a bit more overhead. I’m still in favour of a SF = a + b (1 global parameter, 1 Vault parameter). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.111111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#33",
                    "likes": "1",
                    "time": "10/05/2020-18:10:39",
                    "content": "I agree with the SF = bx (1 global, 1 vault) multiplicative system, but I don’t think we need to vote on risk premiums; we can have the system do it for us continuously by making an n-day average out of a Donchian Channel (a “channel” on a line graph whose upper boundary is the period’s highest high, and whose lower boundary is the period’s lowest low; I don’t know if that’s the proper term but that’s what I’ve always known it as) and using that spread as the risk premium. We would probably want more oracles, I would think, as that places more responsibility in the hands of the system. Although, I also don’t think think that we should allow the base rate to be negative, unless we also never allow the SF or the DSR to be be negative. I’m not sure how that would work, though. Negative interest rates for saving your Dai just seems weird. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.485714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#34",
                    "likes": "3",
                    "time": "11/05/2020-10:20:10",
                    "content": "When looking at this only from the position of finding the most efficient way to regulate the peg this looks like a low overhead way to regulate demand. But when we see truly uncorrelated and novel assets be added to MCD this fee structure is not going to work well: Let’s take the ETH bull run that pushed up the ETH SF to 8% last year as an example. If at the time we would have allowed people to borrow DAI against their house it’s unlikely that this asset class would have seen as much of a spike in utilization as traders using MCD to get leverage. The fictional tokenized real estate loans from my example would be relatively stable low yield assets. This means that adding a base rate to these assets would mean the next time there’s a massive ETH bull run you’d potentially price out an entire segment of uncorrelated borrowers that add a huge amount of stability to the system. Pricing out a large segment of stable low volume assets would achieve the goal of lowering the DAI supply but it making these borrowers default on their mortgages would probably scare them away for good. The more stable we make the stability fee the better. That is true for volatile assets as much as it is true for less volatile assets. However the same amount of volatility can make it impractical for some assets while it won’t do so for others. I think in a situation where DAI supply is too high, it’s not just a matter of looking at how much the stability fee should raise but also to look at the collateral types used to generate DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.445556972789117
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#35",
                    "likes": "5",
                    "time": "11/05/2020-10:55:16",
                    "content": "There are trade-offs, and it isn’t as cut and dried as ‘we should never price out anything.’ But leaving that aside for the moment, it still makes sense to have the option to change the base rate as a whole. It is low overhead, and the impact of that should not be underestimated, especially as the collateral portfolio grows. If necessary, we could always vote to exclude certain assets from the base-rate changes. With regards to the trade-offs, we have something like this: Option 1: Up the base-rate in a bull market and price out certain assets + May quickly destroy a large amount of DAI, which would have an immediate impact on the peg. + More stability fees for the same amount of DAI. + Allows us to use the DSR freely to effect demand. - Temporarily reduces diversification in the protocol. - Priced out assets may not come back to the protocol. Option 2: Up the rate on only the bullish assets + Reduces downward pressure on DAI peg from a specific asset. + Maintains diversification in the protocol. + No assets priced out. - Limits our ability to use the DSR freely to effect demand. - Less stability fees for the same amount of DAI.  With regards specifically to centrifuge and other assets (like mortgages) that prefer a low stability fee a solution is to have somewhere else on-chain to which these assets can refinance. In this way, these assets can move in and out of the Maker Protocol dependent on whether it can offer the best rate at any given time, which will be dependent on the level of DAI demand. Alternatively, I know there are some projects that want to provide a fixed rate as a layer sitting on top of the Maker Protocol. Using the base rate makes the protocol very much a market driven thing: Whomever is willing to pay the most in fees gets to use the protocol. Changing rates individually is a more active approach that there may or may not be appetite for managing. But all this said, the primary issue is the DSR. It is dangerous to increase the DSR higher than the SF on any asset. This gives lenders using those collateral packages the ability to leech DAI out of the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.436038961038961
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#36",
                    "likes": "2",
                    "time": "11/05/2020-14:03:56",
                    "content": "Great summary LFW. One thing I would like to add is that these decisions to subsidize or tax collateral types to ensure a certain portfolio makeup are risk decisions and not monetary policy decisions. For monetary policy we do not care how the Dai Supply is grown or curbed, we only care that it is. For risk, we may care that a certain % of the portfolio is made up of some particular asset. In this sense we have not lost any flexibility as this can still be encoded into the Risk Premium portion of the fee. The Risk Premium could very well be negative in the same way  (hopefully) the Base Rate can be. This would be a protocol-level subsidization to push for more of this collateral type. Going negative with the Risk Premium has some concerns with the DSR though as LFW pointed out. I’m not sure we even want to do it, but it is still there as an option if we choose. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1855158730158735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#37",
                    "likes": "1",
                    "time": "11/05/2020-20:40:11",
                    "content": "Pricing out low risk assets during a bull market in ethereum, particularly the tops of bull markets when SF end up getting really crazy is an extremely bad idea. This is exactly when we need that diversification since these are the riskiest moments when we are most likely to have extreme selloffs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.682291666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#38",
                    "likes": "1",
                    "time": "11/05/2020-23:42:47",
                    "content": "    hexonaut:  Stability Fee = max(Base Rate + Vault-specific Fee, 0%)   @hexonaut @LongForWisdom I don’t want to be too painful on terminology, but in credit risk management world this may cause some confusion down the road . Even as a governance construct, when you suggest to name something a Vault-specific fee, risk management may read this as a specific “interest rate” applied to a particular vault or cluster of vaults. Which in other words, in a risk world induces the idea of Risk-based pricing for individual vaults or clusters of. In normal risk setting, to be able to assign an individual vault “charge” you would have to determine first a “Probability of Default” (PD) and “Loss Given Default” LGD metric to each vault, which would determine the risk premium of that specific vault and therefore the “interest rate” or “charge” by the protocol. As far as I can tell, up until this point, that individual PD for each vault is not defined. So I would probably suggest rethinking the use of Vault-specific Fee. It means and induces a completely different thing for a risk specialist  I know it’s semantics. But unfortunately they have some meaning  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.895370370370371
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#39",
                    "likes": "1",
                    "time": "12/05/2020-00:12:20",
                    "content": "    hexonaut:  For risk, we may care that a certain % of the portfolio is made up of some particular asset. In this sense we have not lost any flexibility as this can still be encoded into the Risk Premium portion of the fee.   @hexonaut This is definitely an important consideration to be taken into account. Eventually, with the addition of new and diversely correlated collateral types (mortgage, stablecoins, trade financing loans etc), the consideration for “defaults” of particular asset types (via increased liquidations in case of asset price volatility) will need to be looked at on a distribution of risk across those collateral categories. We’ll need to have at least two levels of system resilience to defaults (i.e. liquidations with bad debt increase) then, in my view: #1 A system wide risk view #2 An “asset class” specific view of risk. From that we will likely come to some sort of calculation of risk-weighted assets in the system. At the moment, we don’t have that yet, as the system is mostly not diversified (only crypto asset class). But that situation will evolve  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.889159451659451
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#40",
                    "likes": "1",
                    "time": "12/05/2020-00:18:07",
                    "content": "The vault-specific fee term is temporary because I needed a generic term to describe this portion of the fee. As of now the naming poll suggests people want to refer to this as the risk premium, so I’ll refer to it as that going forward.     williamr:  We’ll need to have at least two levels of system resilience to defaults (i.e. liquidations with bad debt increase) then, in my view: #1 A system wide risk view #2 An “asset class” specific view of risk. From that we will likely come to some sort of calculation of risk-weighted assets in the system   Completely agree. When we get more assets we will likely need to split the risk premium into these two components. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.722222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#41",
                    "likes": "0",
                    "time": "12/05/2020-02:43:10",
                    "content": "Yes, will be interesting when the, ‘Risk Premium’ for WBTC = ETH-A Risk Premium + Additional Risk parameter. WIll also mean less voting overhead, Risk/Governance shifting the Risk Premium on ETH-A automatically shifting risk premiums for other linked collateral. ‘Risk Premium’ for BAT = ETH-A Risk Premium + 0 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.869791666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#42",
                    "likes": "0",
                    "time": "12/05/2020-05:29:52",
                    "content": "    hexonaut:  The vault-specific fee term is temporary because I needed a generic term to describe this portion of the fee. As of now the naming poll suggests people want to refer to this as the risk premium, so I’ll refer to it as that going forward.   is it worth polling this thread one more time based on some of the suggestions for alternative nomenclature? i.e take our top two choices from the poll above and pit them against some of the alternative proposed here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#43",
                    "likes": "0",
                    "time": "12/05/2020-05:41:01",
                    "content": "The pool should be used for this actually @Andy_McCall , Sure More pool at the end = more comprehension and cooperation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#44",
                    "likes": "0",
                    "time": "12/05/2020-12:33:04",
                    "content": "Maybe I missed it. What are some of the alternatives that have come up? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#45",
                    "likes": "1",
                    "time": "12/05/2020-15:05:57",
                    "content": "Personally I liked this one:     befitsandpiper:  Maybe collateral premium?   It kind of gets away from this idea that the premium is 100% based on risk and also does not conflict with existing financial terminology like risk premium would I had thought that @williamr was suggesting new terminology but on a second read it looks like that is not the case. Maybe I will restate my question as more of a statement: It looks like “risk premium” is going to be the winner on the terminology poll, but the options in that poll were based on a limited set of options discussed in the original discussion thread. If anyone else has suggestions as to what might a preferable terminology this thread seems to be drawing to a close and the next steps are likely on-chain polls, so you might want to speak those opinions before we move into next steps. ",
                    "links": [
                        "https://forum.makerdao.com/t/discussion-change-the-stability-fee-structure/2258"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.972697756788666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#46",
                    "likes": "0",
                    "time": "12/05/2020-22:21:40",
                    "content": "I like Collateral Premium. But would it become confusing when there are collateral types with multiple Vault options? (ie. USDC-A & USDC-B) What about Vault Premium? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#47",
                    "likes": "1",
                    "time": "14/05/2020-15:06:04",
                    "content": "Polls are closed. The results are:  Yes split the Stability Fees into two components. (69%) Call the vault-specific portion “Risk Premium”. (57%) No clear winner on allowing the negative Base Rate. I’m going to use a ranked choice governance poll to resolve this. Risk Premiums will be voted on in an as-needed basis. (60%)  Next Steps: I will wait until ranked choice governance polls are available and create a poll for the governance facilitator to add to the governance portal. Thanks for the feedback everyone! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.571428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#48",
                    "likes": "0",
                    "time": "14/05/2020-15:07:22",
                    "content": "    hexonaut:  I will wait until ranked choice governance polls are available   They are already available as of Monday, as far as I know. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#49",
                    "likes": "1",
                    "time": "14/05/2020-15:08:18",
                    "content": "Oh great. I’ll confirm with Derek and put together a ranked choice vote then. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#50",
                    "likes": "1",
                    "time": "14/05/2020-19:17:54",
                    "content": "Submitted a pull request: https://github.com/makerdao/community/pull/551 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#51",
                    "likes": "2",
                    "time": "18/05/2020-19:36:59",
                    "content": "Vote is up: https://vote.makerdao.com/polling-proposal/qmnun5btup2jmo5pnggsy2wviguzrpsqweb3aijn5muth3 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#52",
                    "likes": "7",
                    "time": "21/05/2020-13:14:02",
                    "content": "I’m in support of this proposal, in the context of the current collateral types that exist in the system. I think that the stability fee structure will have to be made more complex when some other collateral types are added. At that point, I think the collateral portfolio will have to be divided into segments, with a different base fee/rate adjustment policy for each segment. Examples of collateral types that will need to live in a different segment to liquid cryptoassets like ETH, BTC, etc.:  Illiquid assets Assets with a fixed maturity, or assets that are typically held for a fixed period of time Assets deriving value from the real economy Fixed income assets  For some of these, it may be necessary to lock in a fixed stability fee for a certain period of time, in order to not expose the DAI borrower to excessive variable rate risk (the opposite side of this is that Maker governance needs to price in the fixed rate risk on our side). For others, the stability fee could be adjustable but behind a time lock, or governance could simply pledge to follow some stability fee adjustment policy that is known in advance. Others could have stability fees that are continuously adjustable following a base spread derived from a LIBOR oracle, etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.719344061735366
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#53",
                    "likes": "3",
                    "time": "21/05/2020-13:48:39",
                    "content": "I’ve opposed this proposal mostly because it lacked to clarify the above point. I would generally agree that with the current collateral types we have the model makes a lot of sense so proceeding with adopting it is a good idea. I fully agree with @equivrel’s remarks: there will likely be asset classes added to MCD that will require us to start breaking the SF structure out into different categories. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#54",
                    "likes": "5",
                    "time": "21/05/2020-14:13:31",
                    "content": "    spin:  I’ve opposed this proposal mostly because it lacked to clarify the above point. I would generally agree that with the current collateral types we have the model makes a lot of sense so proceeding with adopting it is a good idea. I fully agree with @equivrel’s remarks: there will likely be asset classes added to MCD that will require us to start breaking the SF structure out into different categories.   So even if we do end up adding more esoteric collateral types, I think we should evolve the system to fit the needs as we go instead of generalizing too much too early. This proposal is the next step to simplify and scale governance, but it is certainly not the end. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.9010989010989015
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#55",
                    "likes": "2",
                    "time": "22/05/2020-07:08:52",
                    "content": "So I had this thought earlier in this forum discussion, but didn’t want to complicate the current vote. For refence, our soon to be system for determining Vault stability fees is: SFv = Base Fee + Risk Premium Say there exists a class of collaterals in the future that we want to remain at a set SF. We could introduce a third parameter to the equation: SFv = Base Fee * Fixed Rate Factor + Risk Premium On normal collaterals, FRF would remain at 1. On collaterals where a fixed rate is desired, FRF would be set to 0, and the Stability Fee would rely solely on the Risk Premium. This is how i see it working in the future. I would like the current proposal to pass the executive first, and then this system (or similar) can be added in later on. Innitially I would see the FRF either being set at 0 or 1. But it could be later set to any positive (or negative) value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.684491978609626
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#56",
                    "likes": "3",
                    "time": "22/05/2020-14:20:33",
                    "content": "Governance vote passed with 64.3% voting for the negative Base Rate variant. 100% of the vote in support of the proposal overall. @LongForWisdom This thread can be locked. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.1666666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#57",
                    "likes": "0",
                    "time": "22/05/2020-21:14:10",
                    "content": "As an aside, is there someone from the MakerDAO team or otherwise who is able to update the code and wording for these votes? Can it be updated for next Monday? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#58",
                    "likes": "1",
                    "time": "22/05/2020-21:14:38",
                    "content": "Amazing! Well done @hexonaut!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#59",
                    "likes": "0",
                    "time": "29/05/2020-21:14:43",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-change-the-stability-fee-structure/2258",
            "title": "[Discussion] Change the Stability Fee Structure ",
            "index": 2258,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "rates",
                "fee-structure",
                "base-rate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "11",
                    "time": "29/04/2020-20:14:05",
                    "content": "Motivation Now that we have started onboarding more collateral types and SCD is shutting down, I believe we should start thinking about how to restructure the stability fee votes from their current form. Currently we have the following governance fee polls: Dai Stability Fee -> Sets the stability fee for both ETH-A and BAT-A. USDC Stability Fee -> Sets the stability fee for USDC-A. Presumably if wBTC is added that would be yet another separate, weekly stability fee vote. This system made sense at the start of MCD as there was really only one type of collateral available (ETH). As we add more collateral types it will become unwieldy to vote on each collateral’s stability fee each week. I believe it’s time to refactor how we are voting on the fees before the flood gates of collateral are opened. Proposal I propose we refactor this legacy setup to the following:   The weekly “Dai Stability Fee” vote becomes the “Base Rate” vote. The base rate will remain a weekly vote to control for peg stability. The Dai Savings Rate Spread poll will continue to be a delta from the Base Rate poll.   All vault types (ETH-A, BAT-A, etc) get a “Vault Fee” that is voted on only when needed. The vault “Stability Fee” is calculated as Base Rate + Vault Fee. I want to call this a more general “Vault Fee” instead of “Risk Premium” because it may consist of more factors then just the Risk Premium in the future. Terminology is not a big deal though if more people prefer the term “Risk Premium” or something else.   The Base Rate can be negative to allow for MKR subsidization of peg support (such as what we are doing now).   Encoding of these governance parameters into the Maker system variables works as follows:   If Base Rate is positive: base = Base Rate duty = Vault Fee If Base Rate is negative: base = 0 duty = max(Vault Fee + Base Rate, 0) This conditional is only because both base and duty can only be positive. For example to encode the current setup of ETH-A = 0%, BAT-A = 0% and USDC-A = 6% we can do this: Base Rate = -2% (MKR is subsidizing the risk premium in exchange for peg stability) ETH-A Vault Fee = 2% (Risk Premium of 2%) BAT-A Vault Fee = 2% USDC-A Vault Fee = 8% If wBTC is added with a target Stability Fee of 1% (as per the governance poll currently up), then it would get a Vault Fee of 3%. This allows us to set the relative risks between collateral types once and move all the fees up and down in tandem to control overall Dai supply (and thus peg stability). It should not matter which collateral type is used to generate Dai. The only thing that matters is that moving the Base Rate down pushes Dai supply up on average and moving the Base Rate up pushes supply down on average. I will leave about a week or so for some feedback before moving to a signalling thread. ",
                    "links": [
                        "https://forum.makerdao.com/t/discussion-separate-centralization-risk-within-risk-premium/3005",
                        "https://forum.makerdao.com/t/signal-request-change-the-stability-fee-structure/2380/45",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-30-9am-pst-4-00-pm-utc/2260/3"
                    ],
                    "GPT-summary": "The author proposes to restructure the stability fee votes for different collateral types in MakerDAO. Currently, each collateral type has a separate stability fee vote, which will become unwieldy as more collateral types are added. The author proposes to have a weekly \"Base Rate\" vote that controls for peg stability, and a separate \"Vault Fee\" vote for each collateral type. The \"Stability Fee\" for each collateral type will be calculated as Base Rate + Vault Fee. The proposal is open for feedback and suggestions.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 3.8910533910533913
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#2",
                    "likes": "1",
                    "time": "30/04/2020-01:27:14",
                    "content": "100% on board with this proposal (unless anyone points out any flaws). Seems like it’s a lot clearer and I belive also minimises the risk of the fee on any particular Collateral type going rogue. I think the DSR vote structure has had success so far and paves the way for this similar system being utilised for collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/04/2020-02:54:05",
                    "content": "I’m not exactly sure if it’s more clear when people vote for a -2% base rate which means a 0% sf on ETH. Seems very confusing. ETH-A should just have a vault fee of 0%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.16
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#4",
                    "likes": "0",
                    "time": "30/04/2020-04:54:54",
                    "content": "So I can appreciate at face value these changes may seem more convoluted than what we have right now. Similar to when we adopted a DSR spread instead of a direct vote on the DSR. It seems more complex so why do it? We do it because by switching to the DSR Spread we were able to reduce the number of governance votes required per week. Similarly I am proposing this change to the fee structure to decrease our collective cognitive load and sharpen the votes to particular questions. There is really only one control that we need to be voting on every week and that is the peg stability control. Does it make sense to tweak 10 stability fees every week once we reach 10 collateral types? I’m of the opinion this is an inefficient way to think about the problem. So if our goal is to ideally have one peg stability control then what does it look like? To me this looks like a base rate, but different vaults have different risk profiles so you need some way to add that on top. If we take this approach then the negative base rate falls out of this if you want the ability to bring the stability fees to 0% like what we have now. We haven’t explicitly pointed it out but in fact MKR is subsidizing the risk premium for ETH right now. The negative base rate is nice because it makes the decision to start this subsidy an explicit choice. I welcome criticism, but would prefer an alternative implemenation rather than just saying this sounds confusing we should stick with the status quo. The status quo will not scale. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.334368530020703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#5",
                    "likes": "0",
                    "time": "30/04/2020-05:51:19",
                    "content": "Yes, a base rate makes a lot of sense to reduce cognitive load. I disagree though on the DSR spread being more complex, I think it’s quite straightforward. Changing the governance cadence for the stablecoin rate premium is another matter not for this thread. It’s an interesting idea to bake in a 2% risk premium on ETH-A, making a subsidy an explicit choice. Yes this trick could have a strong psychological effect. But my point still stands that it makes it needlessly complicated, increasing cognitive load. A 2% risk premium is also arbitrary, and if the ETH-A risk premium can be adjusted, it brings question to what actually the ‘base rate’ means. Also, the same change could be applied to the DSR spread vote. A 0% DSR spread is a subsidy in the current form. Is the DSR spread going to be connected to the base rate or the ETH-A rate? Does this bake in a 2% risk premium on the DSR spread? (Base rate 0%, ETH-A 2% risk premium, 0% DSR spread = 0% DSR) That’s definitely interesting. We don’t explicitly point out that a 0% DSR spread is a subsidy, but MKR holders can be smart enough to understand that a 0% ETH-A sf is a subsidy and a 0% DSR spread is a subsidy. We don’t need to bake in risk premiums. It’s also opens a can of worms to argue about. Is a 1% ETH-A SF a subsidy? Is a 0.5% DSR spread a subsidy? And all the arguing is a bit pointless because you’re just deciding on a psychological value.     hexonaut:  I welcome criticism, but would prefer an alternative implemenation rather than just saying this sounds confusing we should stick with the status quo. The status quo will not scale.   Yes, this is criticism but I am not suggesting the status quo.     hexonaut:  For example to encode the current setup of ETH-A = 0%, BAT-A = 0% and USDC-A = 6% we can do this: Base Rate = -2% (MKR is subsidizing the risk premium in exchange for peg stability) ETH-A Vault Fee = 2% (Risk Premium of 2%) BAT-A Vault Fee = 2% USDC-A Vault Fee = 8%   My suggestion: Base Rate = 0% ETH-A Vault Rate Premium = 0% BAT-A Vault Rate Premium = 0% WBTC-A Vault Rate Premium = 1% USDC-A Vault Rate Premium = 6% This is similar to the DSR spread argument of making things simpler to reduce votes. Vault Rate Premiums just make a lot more sense when the ETH-A vault premium is 0%. In your case, if you wanted to lower the ETH-A premium from 2%->1%, you might want to lower the WBTC premium from 3%-2% at the same time also. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6986331569664905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#6",
                    "likes": "0",
                    "time": "30/04/2020-06:03:19",
                    "content": "    hexonaut:  For example to encode the current setup of ETH-A = 0%, BAT-A = 0% and USDC-A = 6% we can do this: Base Rate = -2% (MKR is subsidizing the risk premium in exchange for peg stability) ETH-A Vault Fee = 2% (Risk Premium of 2%) BAT-A Vault Fee = 2% USDC-A Vault Fee = 8%   I generally agree with proposal, I just think in that case I wouldn’t prefer to call it ETH-A Vault Fee because some people might think this is the actual cost to borrow. Maybe ETH-A Spread is a better term? In reality this Vault Fee or Spread including Base Rate compensates peg stability, risk and other costs (DSR, etc). I think the idea is that changing Base rate just simplifies the process and makes it more clear that all assets are affected equally when changed. Also the Base Rate alone may not be enough to control peg stability. You may run into a situation where one asset generates too much DAI and you may need to raise only its Spread and don’t touch the Base Rate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.1328125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#7",
                    "likes": "0",
                    "time": "30/04/2020-13:02:37",
                    "content": "Thank you for the more detailed response @Jiecut. I made an assumption that you were arguing for the status quo because your answer was very short, critical and didn’t present an alternative. My apologies on that assumption. I have some rebuttals:     Jiecut:  We don’t explicitly point out that a 0% DSR spread is a subsidy, but MKR holders can be smart enough to understand that a 0% ETH-A sf is a subsidy and a 0% DSR spread is a subsidy. We don’t need to bake in risk premiums. It’s also opens a can of worms to argue about. Is a 1% ETH-A SF a subsidy? Is a 0.5% DSR spread a subsidy? And all the arguing is a bit pointless because you’re just deciding on a psychological value.   A 0% DSR Spread is not a MKR subsidy. It is the opposite. A DSR Spread of anything above 0% is a tax on the system that goes to MKR holders instead of from them.     Jiecut:  My suggestion: Base Rate = 0% ETH-A Vault Rate Premium = 0% BAT-A Vault Rate Premium = 0% WBTC-A Vault Rate Premium = 1% USDC-A Vault Rate Premium = 6% This is similar to the DSR spread argument of making things simpler to reduce votes. Vault Rate Premiums just make a lot more sense when the ETH-A vault premium is 0%. In your case, if you wanted to lower the ETH-A premium from 2%->1%, you might want to lower the WBTC premium from 3%-2% at the same time also.   So this is basically the same, but you seem to be moving the subsidy into the risk premium / vault fee (which should be voted on infrequently). So my 2% number for ETH-A / BAT-A is an example of what the risk premium might be. Really this number should be provided by the risk team, set once and not adjusted unless the risk premium actually changes. This is why I don’t want to store the subsidy into risk premium as currently the subsidy is in place because of the peg and will probably need to be adjusted on a weekly basis. I also want to keep these votes separate. The real ETH-A risk premium is very likely to be above 0% and if we don’t allow for a negative Base Rate then the only way to get the total Stability Fee down to 0% is to have a bunch of risk premium votes which need to be initiated outside of the weekly Base Rate. This global subsidy only makes sense to me as a peg stabilizer hence why I think it should be included in the global Base Rate parameter. For example let’s say in the future the ETH-A / BAT-A risk premiums are determined to be 1% (same as wBTC), and we have a regular weekly vote on the Base Rate which can’t be negative. All of a sudden a Black Thursday type event happens and we really need to get all collateral types as close to 0% borrow rate as possible. With your proposed alternative we would have initiate N (N = num collateral types) risk premium / vault fee votes to achieve this goal. With my proposal we can achieve this inside the weekly Base Rate vote by saying we want a negative Base Rate.     Primoz:  Also the Base Rate alone may not be enough to control peg stability. You may run into a situation where one asset generates too much DAI and you may need to raise only its Spread and don’t touch the Base Rate.   Completely agree, but I suspect this will be infrequent enough to be manageable on a monthly, ad-hoc timeframe instead of a week-to-week one. It may make sense to have a per-vault tax/subsidy as well as a risk premium portion with the Vault Fee / Vault Spread which is why I didn’t want to call the entire vault portion of the fee the Risk Premium. Really it should be Stability Fee = Base Rate (global) + Risk Premium (per-vault) + Collateral-specific Tax/Subsidy (per-vault), but I think that will be easy enough to add in later and don’t want to overcomplicate this initial change. PS I like the term Vault Spread as well as it is sort of the opposite of the DSR Spread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.481589903721051
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#8",
                    "likes": "2",
                    "time": "01/05/2020-06:13:47",
                    "content": "@hexonaut, In general I like this proposal. With an increasing number of collateral types this is the way things are going anyway so we might as well implement your proposed system sooner rather than later. Some comments: 2. “Vault fee” is a slightly misleading term as the fee you are proposing is collateral type specific, not vault specific. A more presice term could be “Collateral type fee” or something along that line. Also, in the future there could be a separate “Vault fee” depending on the collateralization level of each specific Vault, so let us save that term for that. 3. Negative base rate should be shunned almost at all cost. When negative base rates become attractive it means that something else is broken in the Maker system and needs fixing. Right now we need more collateral types so that more DAI can be made in order to ultimately get the peg fixed. Negative base rate is not a solution, just a band aid to improve how things look. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.730725623582766
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#9",
                    "likes": "0",
                    "time": "01/05/2020-12:44:36",
                    "content": "    Planet_X:   “Vault fee” is a slightly misleading term as the fee you are proposing is collateral type specific, not vault specific. A more presice term could be “Collateral type fee” or something along that line. Also, in the future there could be a separate “Vault fee” depending on the collateralization level of each specific Vault, so let us save that term for that.    This fee is vault specific as it can differ between ETH-A and ETH-B. Although I’m actually starting to prefer Vault Spread now.     Planet_X:   Negative base rate should be shunned almost at all cost. When negative base rates become attractive it means that something else is broken in the Maker system and needs fixing. Right now we need more collateral types so that more DAI can be made in order to ultimately get the peg fixed. Negative base rate is not a solution, just a band aid to improve how things look.    Whether we should go negative is definitely an important matter to consider. I just want to leave it available as an option in emergency situations such as what happened on Black Thursday. I agree with you that it should not be used after we diversify the collateral pool. I don’t think we are at that stage yet though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.836996336996337
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#10",
                    "likes": "0",
                    "time": "01/05/2020-15:28:24",
                    "content": "    hexonaut:  Whether we should go negative is definitely an important matter to consider. I just want to leave it available as an option in emergency situations such as what happened on Black Thursday. I agree with you that it should not be used after we diversify the collateral pool. I don’t think we are at that stage yet though.   It seems to me that we don’t really intend for the overall stability fee on a vault to ever actually go negative at this time, correct? I.E, BASE_RATE + VAULT_FEE >= 0%. I’m sure we may relax this requirement at some point in the future if the tech allowed it but that is my impression having read this. So it stands to reason to me that we may want to just put a floor on base rate at 0% to avoid arguments around it going negative. If some black swan event happens where we want to send all vault stability fees to 0% we could just put up an executive that would set base rate to 0% and adjust vault fees accordingly. P.S:     hexonaut:  Although I’m actually starting to prefer Vault Spread now.   On the topic of language, I prefer the “risk premium” terminology. I understand that there are reasons that you might change the fee that would cause it to drift from the definition there, but it seems to me that on average that would be the idea. My 2 cents. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.536458333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#11",
                    "likes": "0",
                    "time": "01/05/2020-15:42:27",
                    "content": "    Andy_McCall:  It seems to me that we don’t really intend for the overall stability fee on a vault to ever actually go negative at this time, correct? I.E, BASE_RATE + VAULT_FEE >= 0% . I’m sure we may relax this requirement at some point in the future if the tech allowed it but that is my impression having read this.   Correct.     Andy_McCall:  So it stands to reason to me that we may want to just put a floor on base rate at 0% to avoid arguments around it going negative. If some black swan event happens where we want to send all vault stability fees to 0% we could just put up an executive that would set base rate to 0% and adjust vault fees accordingly.   Why would we want to have a one-off vote that has to go through the whole governance process when we can encapsulate it inside of a negative Base Rate? Just because it’s available doesn’t mean we have to use it.     Andy_McCall:  On the topic of language, I prefer the “risk premium” terminology. I understand that there are reasons that you might change the fee that would cause it to drift from the definition there, but it seems to me that on average that would be the idea. My 2 cents.   I’m going back and forth myself on this. I’ll put up some language options in the poll next week. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.22671568627451
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#12",
                    "likes": "1",
                    "time": "01/05/2020-15:46:58",
                    "content": "    hexonaut:  Why would we want to have a one-off vote that has to go through the whole governance process when we can encapsulate it inside of a negative Base Rate?   The main reason that I see is that it avoids confusion. Additionally, though, as it appears to me black swan crisis management is sort of dealt with by one-off votes anyway, so we might be being a bit naive to say that this avoids doing that in the first place since we don’t really know what the next black swan will look like or how it will need to be managed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#13",
                    "likes": "3",
                    "time": "03/05/2020-21:33:37",
                    "content": "Another thing is that a flat risk premium may be too simplistic. It may work better in a ax + b form. A 3% vault fee with a base rate of -2%, makes a big difference with a 3% vault fee with a base rate of 10%. (Assuming ETH-A has a 2% vault fee). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.645833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#14",
                    "likes": "1",
                    "time": "04/05/2020-14:13:14",
                    "content": "Could you elaborate on this ax + b form with some examples? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                }
            ]
        }
    ],
    "group_index": "2311"
}