{
    "poll_list": [
        {
            "title": "Inclusion Poll for Governance Core Unit (GOV-001) MIP Set - March 8, 2021",
            "index": "6348",
            "option": "Yes",
            "supporting_mkr": "28,139",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c2-sp3-governance-core-unit-gov-001/6348",
            "title": "MIP39c2-SP3: Governance Core Unit - GOV-001 ",
            "index": 6348,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "governance",
                "core-unit",
                "gov-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "9",
                    "time": "03/02/2021-21:54:28",
                    "content": "MIP39c2-SP3: Governance Core Unit - GOV-001 Preamble MIP39c2-SP#: 3 Author(s): @LongForWisdom Contributors: N/A Status: Formal Submission Date Applied: 2021-02-03 Date Ratified: <yyyy-mm-dd>  Specification Motivation I am proposing this Core Unit because MakerDAO requires a consistent and well-run governance process managed by elected facilitators in order to remain stable and secure as it grows. Core Unit Name Name: GovAlpha ID: GOV-001 GovAlpha’s Mandate 1. Neutrality Neutrality is essential if GovAlpha is to maintain its position as a credible facilitator of governance within MakerDAO. Ultimately GovAlpha has this mandate because it is trusted by governance participants to fulfill it without bias towards outcomes. Lack of neutrality undermines this trust, however, GovAlpha must also maintain and improve the governance structures and processes within MakerDAO and this is impossible to do without expressing opinions on these structures and processes. Therefore, the Facilitators of GovAlpha commit to neutrality in areas unrelated to the governance of MakerDAO.  Facilitators within GovAlpha are required to remain neutral and objective on issues outside of the governance domain and focus on the facilitation of governance processes. Facilitators within GovAlpha must voice opinions on issues related to the structure and processes of governance within MakerDAO. GovAlpha must aim to onboard and maintain at least three Core Unit Facilitators at all times while prioritizing candidates from unrepresented geographic regions.  2. Facilitation of Governance The governance processes of an organization like MakerDAO will not operate consistently and clearly without facilitation. GovAlpha fulfills the role of officials in traditional systems of governance, leaving those involved in governance able to spend more time on decision-making and discussion.  GovAlpha is responsible for managing governance processes as directed by relevant Accepted MIPs or MIP sets. GovAlpha must ensure that appropriate consensus gathering methods take place once debate on an issue has come to a natural end. GovAlpha is responsible for creating on-chain polls on the ‘official’ voting frontend as directed by governance processes defined in relevant Accepted MIPs or MIP sets. GovAlpha is responsible for the documentation part of executive proposal creation which conveys the contents of each executive proposal and the reasons for each item’s inclusion. GovAlpha is responsible for determining and communicating clear lines of action in the event of ambiguity within governance processes. GovAlpha is responsible for operating emergency voting processes to protect the Maker Protocol in the event of an emergency. GovAlpha must look for opportunities to streamline governance processes without sacrificing governance integrity.  3. Effectiveness of Governance The strength of the MakerDAO governance system relates directly to the participation levels in both on-chain and off-chain governance. The expression of will by individuals interested in the Protocol’s success can only be as well-rounded and well-defined as the number of Governance participants. Similarly, a decision is only as durable as the consensus surrounding it. For these reasons, it is GovAlpha’s mandate to strive for participation and consensus which are crucial for the preservation and improvement of governance within MakerDAO.  GovAlpha should aim to promote and increase engagement by stakeholders in all aspects of the governance processes. GovAlpha should ensure that new members of Maker Governance have access to the resources necessary to bring them up to speed on the Maker Protocol. GovAlpha must encourage Maker Governance to explore the least objectionable option(s) in governance decisions rather than treating decision-making as a competition where a subset must end up disappointed in the outcome. GovAlpha must encourage Maker Governance to come together on divisive topics and to prevent political polarization and demagoguery.  4. Communication and Moderation Moderation and communication fulfill a supporting role in relation to the other items of the mandate. It is difficult to facilitate effective governance if high-quality communication platforms and norms do not exist. Additionally, GovAlpha should be accessible to the MakerDAO community and the MakerDAO mandated actors and attempt to bridge these two groups of stakeholders in cases of disagreement.  GovAlpha is responsible for scheduling, running, and moderating a weekly governance and risk meeting. GovAlpha is responsible for ensuring the health and integrity of the communication channels that are used for communication within MakerDAO. These tasks include moderation duties, establishing processes and social norms, and defending the channels from trolling and Sybil attacks. GovAlpha should aim to foster a culture of openness, receptiveness, and reasoned discussion within the community. GovAlpha must be accessible to Maker Governance on all commonly used communication channels within MakerDAO. GovAlpha is responsible for raising governance issues to other Core Units and ensuring appropriate follow-up for Governance.  Team Structure GovAlpha will function as a two-level hierarchy, consisting of facilitators and contributors. The key difference between facilitators and contributors is that contributors are not required to manage GovAlpha’s budget and that they are not directly answerable to Maker Governance for failing to fulfill GovAlpha’s mandate. This difference in accountability means that decision-making power must lie in the hands of the facilitators rather than the contributors, and is the reason for this explicit hierarchy. In practice, it is expected that the facilitators and contributors within GovAlpha will be relatively tight-knit and will operate and communicate on an equal footing in most matters. The facilitators of GovAlpha will always consult and seek input from contributors when making decisions that concern the future of GovAlpha, including drafting budget proposals. The facilitators of GovAlpha will endeavor to provide contributors with fair remuneration and the opportunity for as much responsibility as they wish to take on. Facilitators As mentioned in the mandate, GovAlpha will always aim to have at least three Facilitators, who should be considered equal in terms of budgetary control, powers, and authority. There are three main reasons why three facilitators are the target number.   Redundancy - With at least three facilitators the Core Unit can recover from any two facilitators leaving the Unit unexpectedly. This also facilitates time-off and more forgiving working practices.  Measured Decision-Making - Given that the Facilitators of GovAlpha will be required to determine lines of action in the face of ambiguity in governance processes, they must be able to discuss the issues privately with others in the same position.  Representation - MakerDAO is aimed to be a global organization. As far as possible, participants within Maker Governance should feel represented within GovAlpha by a Facilitator from their area of the world.  GovAlpha’s Facilitators are responsible for ensuring that GovAlpha fulfills its mandate. Disagreements between facilitators of GovAlpha regarding ambiguities in the governance process, or regarding the use of GovAlpha’s budget will first be discussed privately with other facilitators with the aim of coming to a consensus decision. The facilitators will aim to put forward a united position whenever there is time to do so. In emergency situations, whichever facilitators are present are empowered to make decisions on behalf of GovAlpha. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip41c4-sp12-govalpha-facilitator-onboarding/7994/17",
                        "https://forum.makerdao.com/t/maker-relay-ep-37/7154",
                        "https://forum.makerdao.com/t/maker-relay-ep-51-en-espanol/9063",
                        "https://forum.makerdao.com/t/maker-relay-ep-51/9011",
                        "https://forum.makerdao.com/t/mip39c2-sp8-governance-communications-core-unit-com-001-updated-5-26-21/7009/14",
                        "https://forum.makerdao.com/t/mip41c4-sp12-govalpha-facilitator-onboarding/7994",
                        "https://forum.makerdao.com/t/maker-relay-ep-37-en-espanol/7168",
                        "https://forum.makerdao.com/t/weekly-mips-update-30/7083",
                        "https://forum.makerdao.com/t/mip39c2-sp8-governance-communications-core-unit-com-001/7009/3",
                        "https://forum.makerdao.com/t/mip39c2-sp8-governance-communications-core-unit-com-001/7009/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-29/7000",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-2-governance-alpha-core-unit/6847",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/weekly-mips-update-28/6791",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/weekly-mips-update-27/6649",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-127-thursday-february-4-17-00-utc/6261/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/16",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-127-thursday-february-4-17-00-utc/6261/5",
                        "https://forum.makerdao.com/t/mip41c4-sp37-governance-facilitator-onboarding-gov-001/15284",
                        "https://forum.makerdao.com/t/maker-governance-review-june-2021/9211"
                    ],
                    "GPT-summary": "The post is a formal submission of a proposal for a Governance Core Unit in MakerDAO. The proposal explains the motivation behind the Core Unit and its mandate, which includes maintaining neutrality, facilitating governance processes, promoting participation and consensus, and ensuring effective communication and moderation. The proposal also outlines the team structure and responsibilities of the Facilitators and Contributors. The post does not advertise the proposal, nor does it seek collaboration or feedback. However, it may be subject to auditing and review by third parties.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.531309934790948
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#2",
                    "likes": "4",
                    "time": "04/02/2021-00:06:57",
                    "content": "I’d like to provide some backing for governance facilitators’ mandate. I believe that having an overarching vision of what the facilitators’ goals should be comes down to the relation of 3 concepts from political science: polity, policy, and politics.   Polity is the formal structure of a system. It’s the framework that sets the “ground rules” for any interaction within the system, e.g., voting mechanisms or the election of mandated actors. Think of MIP0 as the most important example of polity in MakerDAO.   Policy is the content of a system. Any change, whether passed or only proposed, constitutes the policy of MakerDAO, in addition to aims and tasks defined by the participants. Every piece of content is bound by polity in that it can only take a form defined by the framework, e.g., a general MIP template.   Politics are the processes of a system. It’s the road from an idea, through proposing and voting, to the implementation of a policy change. The MIP lifecycle is one of the primary examples here. In our case, the term politics includes both on-chain processes, e.g., voting, as well as off-chain ones, e.g., discussions and voting on the forum.   Now it’s fair to state the responsibility of governance facilitators as first-and-foremost the preservation and improvement of the polity. To go further, there are two aspects of a DAO polity that need to be preserved, improved, and equilibrated:   Autonomy, understood in terms of fundamental decentralization of decision-making frameworks and processes, and the self-sufficient nature of the DAO.   Efficiency, understood as the ability of MakerDAO to function in a well-organized manner while maintaining adaptability.   It’s based on those two principles in connection to the underlying responsibility to the polity that governance facilitators’ tasks stem from. One task I’d like to highlight here is that of neutrality:     LongForWisdom:  Facilitators within GovAlpha are required to remain neutral and objective on issues outside of the governance domain and focus on policy, procedure, and facilitation.   Governance facilitators neutrality needs to be well-defined. Knowing that their responsibility is to the polity first, facilitators have an obligation to voice their opinions on matters concerning the underlying system and proposed changes that directly affect the framework of MakerDAO Governance. Consequently, only insofar as the politics or the policy relate to the polity should the facilitators speak up. In matters unrelated to the formal structure of MakerDAO Governance, their only role is that of process facilitation. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.701388888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "05/02/2021-14:01:57",
                    "content": "Hmm, this feels like valuable feedback, I hadn’t considered that division of concepts before. I think I would have trouble taking this feedback and converting that to actionable changes (if that was the intention, I’m not sure.) I guess I’m asking whether given those divisions and your thoughts, would you suggest any changes to the mandate? These can be high level (eg focus more on this, less on this.) Or low level (eg remove this sentence, reword this, etc.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.036111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#4",
                    "likes": "2",
                    "time": "07/02/2021-18:41:34",
                    "content": "I rewrote GovAlpha’s Mandate using those concepts, @LongForWisdom. GovAlpha’s Mandate Three concepts and the relations between them define GovAlpha’s mandate: polity, policy, and politics.   Polity is the formal structure of a system. It’s the framework that sets the “ground rules” for any interaction within the system, e.g., voting mechanisms or the election of mandated actors. We can say that the MIP0-defined framework is the most important example of polity in MakerDAO.  Policy is the content of a system. Any change, whether passed or only proposed, constitutes the policy of MakerDAO, in addition to aims and tasks defined by the participants. Every piece of content, e.g., a Maker Improvement Proposal, is bound by polity in that it can only take a form defined by the framework, e.g., a general MIP template.  Politics are the processes of a system. It’s the road from an idea, through proposing and voting, to the implementation of a policy change. The MIP lifecycle is one of the primary examples here. In our case, the term politics includes both on-chain processes, e.g., voting, as well as off-chain ones, e.g., discussions and voting on the forum.  Towards the polity The responsibility and mandate of GovAlpha is first-and-foremost the preservation and improvement of the polity. To go further, there are two aspects of a DAO that need to be preserved, improved, and equilibrated:   Autonomy, understood in terms of fundamental decentralization of decision-making frameworks and processes, and the self-sufficient nature of the DAO.  Efficiency, understood as the ability of MakerDAO to function in a well-organized manner while maintaining adaptability.  These are the underlying principles of GovAlpha. Any specific task, either towards the polity, policy, or politics, should relate to those concepts. The strength of the MakerDAO governance system relates directly to the participation levels in both on-chain and off-chain governance. The expression of will by people interested in the Protocol’s success can only be as well-rounded and well-defined as the number of Governance participants. Similarly, a decision is only as durable as the consensus surrounding it. For these reasons, it is Governance Facilitators’ mandate to strive for participation and consensus which are crucial for the preservation and improvement of the polity. Regarding participation:  GovAlpha should aim to promote and increase engagement by stakeholders in all aspects of the governance processes. GovAlpha should ensure that new members of Maker Governance have access to the resources necessary to bring them up to speed on the Maker Protocol.  Regarding consensus:  GovAlpha must encourage Maker Governance to come to a consensus over the least objectionable option(s) rather than treating decision-making as a competition where a subset must end up disappointed in the outcome. GovAlpha must encourage Maker Governance to come together on divisive topics and to prevent political polarization and demagoguery.  Lastly, to preserve the system, GovAlpha is responsible for operating emergency voting processes to protect the Maker Protocol in the event of a critical emergency. Towards the policy Knowing that their responsibility is to the polity first, facilitators have an obligation to voice their opinions on matters concerning the underlying system and proposed changes that directly affect the framework of MakerDAO Governance. Consequently, only insofar as the policy relates directly or indirectly to the polity should the facilitators speak up. In matters unrelated to the formal structure of MakerDAO Governance, their only role is that of process facilitation. Towards the politics As caretakers of the polity, it’s in GovAlpha’s mandate to facilitate all of the Governance processes, aiming for an autonomous and efficient DAO. Regarding policy-making facilitation:  GovAlpha is responsible for managing governance processes as directed by relevant Accepted MIPs or MIP sets. GovAlpha is responsible for the non-technical portion of executive proposal creation. GovAlpha must ensure that appropriate consensus gathering methods take place once debate on an issue has come to a natural end. GovAlpha is responsible for creating on-chain polls on the ‘official’ voting frontend as directed by governance processes defined in relevant Accepted MIPs or MIP sets. GovAlpha is responsible for determining and communicating clear lines of action in the event of ambiguity within governance processes. GovAlpha must aim to onboard and maintain at least three Core Unit Facilitators at all times while prioritizing candidates from unrepresented geographic regions.  Regarding communication and moderation:  GovAlpha is responsible for ensuring the health and integrity of the communication channels that are used for communication within MakerDAO. These tasks include moderation duties, establishing processes and social norms, and defending the channels from trolling and Sybil attacks. GovAlpha should aim to foster a culture of openness, receptiveness, and reasoned discussion within the community. GovAlpha must be accessible to Maker Governance on all commonly used communication channels within MakerDAO. GovAlpha is responsible for scheduling, running, and moderating a weekly governance and risk meeting. GovAlpha must work to maintain and encourage healthy debate among Governance. GovAlpha must ensure that the upcoming governance schedule is well communicated to all stakeholders in a timely manner. GovAlpha is responsible for raising governance issues to other Core Units, and ensuring appropriate follow up for Governance.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5938466295609155
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "0",
                    "time": "08/02/2021-15:16:33",
                    "content": "Thanks, I’ll read this over and give it some thought over the coming days and may integrate some of it into the subproposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#6",
                    "likes": "2",
                    "time": "18/02/2021-11:02:00",
                    "content": "As a disclaimer, I believe this proposal to be fairly strong. I just pointed out a few points that have the potential to be misinterpreted. Probably more nit-picky than helpful, so take it with a grain of salt  The edits are merely suggestions.     LongForWisdom:   GovAlpha is responsible for the non-technical portion of executive proposal creation.    Prior points were more detailed, could you be more specific to what you mean by “non-technical portion”?      LongForWisdom:   GovAlpha must encourage Maker Governance to come to a consensus over the least objectionable option(s) rather than treating decision-making as a competition where a subset must end up disappointed in the outcome.    I understand where you’re getting at, but one of my concerns with choosing the least objectionable option is that it can be a supar decision for the whole. Instead of come to consensus over the least objectionable option, could it be to encourage exploration for the least objectionable option(s)?     LongForWisdom:   GovAlpha must encourage Maker Governance to come together on divisive topics and to prevent political polarization and demagoguery.    I think this sentence summarizes the intended outcome better than the point above.      LongForWisdom:  they are not directly responsible to Maker Governance for fulfilling GovAlpha’s mandate.   If possible, could you clarify “directly responsible”? Maybe “responsible” is not the best differentiator between facilitator & contributor? The mandate is a mix of responsibilities (things you have to do like moderating, hosting, etc) and specific approaches to actions (fostering openness, preventing political polarization, etc). I would think not all contributors have the same responsibilities, but all contributors and facilitators under this mandate would have to follow said approaches as well. For example, I believe a contributor who intentionally encourages political polarization would still be directly responsible for said actions.      LongForWisdom:    Representation - MakerDAO is aimed to be a global organization. As far as possible, participants within Maker Governance should feel represented within GovAlpha by a Facilitator from their area of the world.    This is awesome.  One other question I have is how disagreements between facilitators would be managed? In the case of disagreement over a topic/decision between 2 or even 3, would it be required that all Facilitators of the core unit represent one outcome or is it encouraged that there is one outcome, but Facilitators are still able to express their own personal opinion on the matter? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.465653153153153
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "2",
                    "time": "18/02/2021-14:47:25",
                    "content": "I have updated this mandate based on feedback. Thanks to all whom provided it. Major changes are:  Slightly restructuring the sections and adding a paragraph explaining the rationale. Thanks to @Elihu for his feedback in organising these. I didn’t take a lot of your suggestions, but the perspective was helpful and clarified my thinking around these. Fixed up some points mentioned by @amyjung regarding the clarity of certain statements. Added a section on how GovAlpha facilitators should make decisions.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.5084325396825395
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "1",
                    "time": "01/03/2021-12:47:03",
                    "content": "This subproposal has been moved to formal submission for the March governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#9",
                    "likes": "1",
                    "time": "10/03/2021-19:46:38",
                    "content": "Out of curiosity, have you given much thought to inter-core unit governance? I understand we’re giving Facilitators a lot of leeway in how they run their units but I see the weekly check-ins during the G&R call as an internal stand-up and a helpful complement to the more public stand-ups that happen in CommDev and think it would be helpful to continue these through the transition to Core Units. Do you think it would make sense to have a weekly or bi-weekly internal stand-up for Facilitators apart from the G&R call; would continuing with the check-ins during G&R suffice, or do you have any other thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.479166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "1",
                    "time": "10/03/2021-20:29:53",
                    "content": "    seth:  Do you think it would make sense to have a weekly or bi-weekly internal stand-up for Facilitators apart from the G&R call   The mandated actors have been having a weekly meeting for a while, mainly to coordinate collateral onboarding, but also for work generally. I fully expect this to continue under the Core Unit Setup. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.361111111111111
                }
            ]
        }
    ],
    "group_index": "3240"
}