{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-most-important-protocol/9097",
            "title": "Maker: Most Important Protocol? ",
            "index": 9097,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ZhakirSetie",
                    "index": "#1",
                    "likes": "0",
                    "time": "02/07/2021-15:06:13",
                    "content": "Does anyone else think Maker is still overlooked by most in defi? Does anyone believe due to its incredibly low amount it will be extremely valuable? I do. I really believe this will be one of if not the biggest defi project in the space. Its just as important as Ethereum imo but maybe someone can give me their thoughts? Ive been back and forth with maker but two weeks ago went all in on defi. Am i just hypnotized by defi gains or is it reall going to change the way we transact and value “money” in the future? showbox ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "3",
                    "time": "02/07/2021-15:24:08",
                    "content": "    ZhakirSetie:  Does anyone else think Maker is still overlooked by most in defi?   Not to be ignored, MRK and DAI are the originators of DEFI as we know it today with DAI being present in 60% of the existing DEFI Protocols.   twitter.com    MakerDAO Growth @MakerGrowth    Dai is the heart of DeFi. ❤️ \"The DeFi native stablecoin dominates the contest with 60% of the circulating supply deposited into smart contracts. 2nd place goes to USDC with approximately 45%.-\" via @Delphi_Digital reports one of the best DeFi alpha sources 🧠 https://t.co/dq8XjATcWs   8:07 PM - 1 Jul 2021           26                7                ZhakirSetie:  Does anyone believe due to its incredibly low amount it will be extremely valuable?   Of course, due to the small quantity, the policy of burning emission and also having a human talent behind it, I see the value of MKR far below what it should really be worth     ZhakirSetie:  I really believe this will be one of if not the biggest defi project in the space. Its just as important as Ethereum imo but maybe someone can give me their thoughts?   It is so important next to Ethereum to the point that Vitalik donated to India a large amount of ETH and MKR to fight Covid.     ZhakirSetie:  Ive been back and forth with maker but two weeks ago went all in on defi. Am i just hypnotized by defi gains or is it reall going to change the way we transact and value “money” in the future?   Its so important that nowadays big financial service providers are talking about what will be the Finance of the future. I leave you this interview of a representative of the St. Louis Fed who loves MakerDAO.      ",
                    "links": [
                        "https://twitter.com/MakerGrowth/status/1410691632052248580",
                        "https://twitter.com/MakerGrowth/status/1410691632052248580",
                        "https://twitter.com/Delphi_Digital",
                        "https://t.co/dq8XjATcWs",
                        "https://twitter.com/MakerGrowth/status/1410691632052248580",
                        "https://www.youtube.com/watch?v=CJ4vqE__f8g"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4429945054945055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "1",
                    "time": "02/07/2021-16:37:18",
                    "content": "Of course, Maker is without a doubt a fundamental pillar for DeFi, with all the changes that have arisen such as flash loans, new types of vaults, collaterals and RWA. Maker is just beginning to change the world of finance, and we will soon see the power of the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/10/2021-22:38:20",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}