{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/launch-of-the-new-collateral-status-index-csi/14723",
            "title": "Launch of the New Collateral Status Index (CSI) ",
            "index": 14723,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "collateral-onboard",
                "csi-update",
                "collateral-management",
                "collateral-status-index"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/agtaghoyjr",
                    "index": "#1",
                    "likes": "21",
                    "time": "21/04/2022-11:31:04",
                    "content": "Today, Collateral Engineering Services (CES) and the collateral stakeholders are excited to reveal the new Collateral Status Index! Many people have been hard at work during Q1 2022 to bring this update to you. Lots of gratitude goes to the CMON (on-chain) and CMOFF (off-chain) collateral stakeholders for making these changes a reality. Based upon a substantial amount of feedback, the Phase I iteration of the Collateral Onboarding (COB) Process addresses many of the issues that surfaced over the past few months. The focus for the process changes were on transparency and communication. Please know that we’re not complete in updating the COB Process. The Phase II iteration has already begun which will bring a wider array of changes to the process and the MIPs supporting the process. You’ll be hearing a lot more about this in the upcoming weeks. Starting today, CES will post a CSI update each Thursday before the Governance and Risk call. The old CSI Forum Post is now deprecated. We wanted to give everyone a fresh and direct way of viewing new information every week so we have divided the update into the following sections:   Collateral Application Status - Lists all collateral application statuses before prioritization.  Prioritized Collateral - The “Up Next” status on the new CSI.  The Work In Progress Collateral - All collateral in the Assessment through Executive Vote execution.  Please reference the below graphic for the phases of the COB Process funnel.  1352×739 53.8 KB  The definitive source of information for all collateral moving through the COB process is located in the CSI spreadsheet. Updates are being done by a limited number of collateral stakeholders to ensure the integrity of the data. If you see any discrepancies in the data, please reach out to the #collateral-engineering-services-public channel on the official MakerDAO Discord server, Discord If you have any questions or comments about specific collateral, please post your comments directly in the MakerDAO forum within the collateral application forum post. For general questions relating to the CSI update, please post them here.  Collateral Application Status This section contains all collateral applications in statuses before Prioritization. These are Application, Poll Active, Greenlit, or those that are recently moved to Application Withdrawn' or Deferred.`  CSI 101067×612 279 KB   Prioritized Collateral This section contains the pool of collateral prioritized to move into the Assessment step of the COB process. Please note these individual collaterals are available to be pulled in by the Collateral Domain Teams. The order is determined by the CMON and CMOFF collateral stakeholders based upon several factors, some of which include the completeness of the MIP6 collateral application, Prioritization tab of the CSI spreadsheet, Domain Team availability, response to market conditions, the scope of the work to be completed, collateral supporting recommended metrics, and alignment to MakerDAO strategic objectives. Currently, collateral meeting strategic objectives include crypto native tokens with strategic protocol or MakerDAO value, ETH and staked ETH solutions, experimentation with collateral using D3M collateral technology, parameter changes on current vault types, and Real World Assets (RWAs).  Screen Shot 2022-04-21 at 7.49.54 AM1036×50 7.14 KB   Collateral Work In Progress (WIP) This section contacts the collateral working through the Assessment to Executive Vote statuses. These are Assessment, Gov Poll Active, Gov Poll Passed, Implementation, Exec Active, and Active.  Screen Shot 2022-04-21 at 7.51.13 AM1066×273 77.8 KB   References, Resources, and Pre-Filtered Links Please use the following links to view the raw and filtered data on the CSI spreadsheet:  Collateral Status Index (CSI) spreadsheet CSI Prioritization spreadsheet tab CMOFF Prefiltered View CMON Prefiltered View Active (Onboarded Collateral) Prefiltered View On Greenlight Status Prefiltered View  Collateral Onboarding Framework - a model: This is being included for historical purposes only since it describes the origins of the Prioritization tab in the CSI spreadsheet.   CSI Spreadsheet Usage For your convenience, we have created several filtered views on the CSI spreadsheet. By using these filters, you will be working the CSI spreadsheet locally therefore not changing the overall view of the CSI spreadsheet.  ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc",
                        "https://discord.gg/Hka58Np5",
                        "https://mips.makerdao.com/mips/details/MIP6#MIP6c2",
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=185886246",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&fvid=2081541501",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&fvid=1149713581",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&fvid=1860629750",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&fvid=301389416",
                        "https://forum.makerdao.com/t/collateral-onboarding-framework-a-model/4838",
                        "https://forum.makerdao.com/t/weekly-relay-april-19-25-2022/14815",
                        "https://forum.makerdao.com/t/relay-semanal-19-25-de-abril-de-2022/14841",
                        "https://forum.makerdao.com/t/clarity-around-collateral-onboarding-process/14221/5",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.268331474726824
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#2",
                    "likes": "1",
                    "time": "21/04/2022-16:24:11",
                    "content": "Where’s the fire emoji instead of a “like”? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#3",
                    "likes": "4",
                    "time": "21/04/2022-16:30:22",
                    "content": "Hi everyone, A quick point of clarification. You might be wondering where all the on-chain (crypto native) Greenlit collateral went to. During the past few weeks, we initiated a clean up process for all on-chain, Greenlit collateral that had been Greenlit for some time. Based upon the new MIP6 application template and MIP6 recommended metrics, we asked each proposer to update their collateral application. If they decided not to (or didn’t respond), we gave them a week and then withdrew the collateral application. You can see all of these in the CSI spreadsheet under the Application Withdrawn status. On the CSI spreadsheet, you will see a variety of older RWA Greenlit collateral. CES has been working with the RWF team to get clarity on these applications. If MIP67 is ratified, RWF will follow a similar process to ask the RWA collateral proposers to update their application or withdraw it if they do not plan to move it forward. Hopefully this clarification helps. The goal is to have a very clear and tight collateral spreadsheet so it’s easy to read and understand. Please provide feedback on ways to make this better! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.710360094451003
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctcunning",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/04/2022-13:50:40",
                    "content": "Thanks for the updates everyone and exciting to see the progress. A couple of questions from my end:   How much visibility and communication is being led by CES / RWF in communicating to the backlog of MIP6 Applications that await MIP67 vote? How much change is required and is there any work that’s being led there?   Although the pipeline is now unified and updated in this CSI, how has scoring / prioritization changed? I see mentions of ‘collateral stakeholders’ and other such terms, but it’s unclear if the scoring framework has been updated meaningfully in anyway? Where can we see that progress?   Finally, and I think this may telling… Is it fair to say that CES (and all others giving input to this process) have agreed that the Collateral Onboarding Process are taking on-chain and off-chain collateral through the same process steps? As I’ve called out before, it seems that Assessment is taking a back-seat to Prioritization. Consistent with my question #1 above (what’s the prioritization framework for on-chain vs off-chain collateral)… Is it best practice and to the benefit of MakerDAO to place Prioritization before Assessment? Even with my limited understanding of the way RWAs work (compared to the people I engage with in TradFi), I’m concerned that the order of operations may perhaps do more harm than good. But I also think answers / frameworks for questions 1 and 2 could perhaps eliminate such concern. Thanks for all the hard work on this! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.102365288220551
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#5",
                    "likes": "0",
                    "time": "22/04/2022-17:02:15",
                    "content": "    ctcunning:  How much visibility and communication is being led by CES / RWF in communicating to the backlog of MIP6 Applications that await MIP67 vote? How much change is required and is there any work that’s being led there?   This work is being led by RWF. @williamr and team have a plan if MIP67 is ratified. The dates and next steps on the CSI are accurate. I’ll let Will provide any additional comments here.     ctcunning:  Although the pipeline is now unified and updated in this CSI, how has scoring / prioritization changed? I see mentions of ‘collateral stakeholders’ and other such terms, but it’s unclear if the scoring framework has been updated meaningfully in anyway? Where can we see that progress?   For Phase I, we didn’t make as much progress here as I would have liked. It was a balance, wait to fully complete this work or not? I choose to launch the new CSI with this part being a little squishy. Prioritization is Work In Progress right now and we’ll complete the current iteration of this and not wait for Phase II. A big dependency on the Prioritization was to clean up the Greenlit collateral so we could spent more quality time with the collaterals that are moving through the process. We’re working closely with Risk and RWF. RWF updated their dimensions to the model and CES is in the process of doing the same based upon the recommended metric work, MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding. To have an over reliance on the Prioritization tab would be misplaced. It is one of a few data points the collateral stakeholders decision making process. In the CSI update, I listed the most common ones Domain Teams will use. The goal is to drive out the subjectivity. One way to do that is to increase the information flow. For example, if Risk says, Fees Generated is Low, why? That’s the added data we need.     ctcunning:  taking on-chain and off-chain collateral through the same process steps?   ATM, same process steps, different level of detail and assessment for the obvious reasons. This may change in the future. We want the process to work for us.     ctcunning:  it seems that Assessment is taking a back-seat to Prioritization   No. There are details of the process that might make this appear this way today. Prioritization happens after the Greenlit. Greenlights are voted on by the community and right now, there is an incentive to Greenlight everything. That needs to change (Phase II work). Every collateral application pretty much comes to the collateral stakeholders. How do we decide on the Prioritization? Completeness of the collateral application is a big part of that. Up until now, many of these applications were incomplete or required A LOT of information so they didn’t get scored or got scored low and sat in a Greenlight status. Today, if something gets to a Greenlit status, we will promptly communicate with the applicant if they are prioritized and if not, why, so a conversation can happen. We meet weekly so it will happen quickly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.614228676728676
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#6",
                    "likes": "0",
                    "time": "22/04/2022-17:32:56",
                    "content": "For RWAs, there is effort required above and beyond on-chain collateral (crypto native). How do we reduce the costs on both sides and invest in the correct places in the process? We ask RWA applicants to be as complete as possible on the deal before publishing their application to get a go/no-go answer. Without the data, we’ll spin in the process and waste a lot of time. The RWA applicant is an expert in their business and the application needs to reflect that. The applicant is not an expert with MakerDAO so that is where we come in to help on a business and technical advisory process. There is some cost on the RWA applicant to put the application together and that seems reasonable and customary. For example, you don’t get paid to fill out a loan application. Let’s assume that we are past a Greenlight and Prioritization phases and now working in the Assessment phase in the process. This is where the a majority of the work happens. For RWAs, the Assessment and Implementation phases will probably at the same time (our early experience is showing us this). This is where we think the process will differ for RWAs in Phase II. During this time, the RWA applicant and MakerDAO are making a significant investment in putting the deal together, finalizing the legal details, and in some cases, doing the implementation. Once the details are fully documented and known, we go to a Governance Vote to get the final approval. To keep it really simple, in the traditional world, there is a loan application process (Application/Greenlight) and an underwriting process (Assessment/Governance Poll). Then after, signing/closing the deal (Executive Vote). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctcunning",
                    "index": "#7",
                    "likes": "0",
                    "time": "22/04/2022-17:55:00",
                    "content": "    monkey.irish:  Greenlights are voted on by the community and right now, there is an incentive to Greenlight everything.   Correct me if I’m wrong, but is all Collateral Greenlit? Or is there some collateral that is not Greenlit? My hunch is that different Collateral is taking different processes, applications, and approaches to accessing MakerDAO for capital. This means that some are using Signal Requests, some are using MIP6 (and soon MIP67), and others D3Ms. If the inputs are different (application), and the process stages different (assessment vs prioritization), then I’d imagine we’re in a world where collateral is being treated differently. And if you’re treating collateral differently, depending on its method of approach, but you keep all the collateral in the same dashboard (CSI)… I think something is going to slip through the cracks. I’d argue that:  Not all collateral is following the same process. Not all collateral goes through green light.  Would you agree? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9945054945054945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#8",
                    "likes": "0",
                    "time": "22/04/2022-20:15:59",
                    "content": "This is an interesting discussion and there are many, many hours of responses in the forum regarding this situation. A few things to keep in mind:  As a DAO, the community has the ability to participate in governance process per the MIPs. MakerDAO governance only ensures the rules and the conditions of the MIPs are followed when the community posts to the forum. There are many ways through the MakerDAO governance process: Governance Flow - Maker Operational Manual and Governance Process Selector - Maker Operational Manual   There is one Collateral Onboarding Process supported by CES and other collateral stakeholders. This is the guidance published for non-MIP6 users. MIP67 is part of the MIP6 process. It is designed to fill the gaps in the MIP6 application for RWAs. D3M is a collateral technology and therefore, cannot be onboarded by itself. For example, you will see Maple Finance publish a MIP6 application for the collateral with a pool delegate using the D3M collateral technology. Aave and Compound D3M has history and followed the SR/Gov Poll before we addressed the onboarding issues and updated the CSI update. We can provide fair and equitable treatment when applicants follow the process. When they choose not to, the process can take much longer. For applicants with history, we’ve made some choices based upon the collateral onboarding changes. While I would have liked to restart the process with some of them, it’s wasn’t feasible to do so. ",
                    "links": [
                        "https://manual.makerdao.com/governance/flowcharts/governance-flow",
                        "https://manual.makerdao.com/governance/flowcharts/governance-process-selection-flow",
                        "https://collateral.makerdao.com/",
                        "https://forum.makerdao.com/t/clarity-around-collateral-onboarding-process/14221"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5874999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ctcunning",
                    "index": "#9",
                    "likes": "2",
                    "time": "28/04/2022-14:51:25",
                    "content": "@agtaghoyjr could we add a link to the “Application URL” in Prioritization tab so it’s easy to tie “Asset” to Application? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                }
            ]
        }
    ]
}