{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-idea-conviction-voting/4731",
            "title": "Governance idea: Conviction Voting ",
            "index": 4731,
            "category": [
                "Governance"
            ],
            "tags": [
                "voting"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#1",
                    "likes": "3",
                    "time": "14/10/2020-06:56:39",
                    "content": "Hello, I have just read the following interesting article (see below) about Conviction Voting. I have come into it because it is currently used/experimented in the 1Hive DAO in xDAI, but the idea itself has been conceived/developed within the Aragon DAO community. TLDR: When you place your MKR tokens to vote, their ‘weight’ is initially zero, and it grows over time (following a certain curve) up to a certain limit. I’d like to hear the opinion of the MakerDAO community about this voting method. For me it looks particularly attractive because (as observed in the article):  it is a pretty simple idea to prevent sudden Governance attacks. If an attacker proposed and tries to approve a bad proposal, it will take some time for their MKR to ‘mature’.   Vote buying (borrowing MKR to vote, last minute, on some proposals) would need to become vote renting (for a longer amount of time) creating an interesting token-economics.     Medium – 18 Nov 19    Conviction Voting: A Novel Continuous Decision Making Alternative to Governance A Commons Stack Component Explainer Reading time: 11 min read       ",
                    "links": [
                        "https://medium.com/giveth/conviction-voting-a-novel-continuous-decision-making-alternative-to-governance-aa746cfb9475"
                    ],
                    "GPT-summary": "The author of the post is introducing the concept of Conviction Voting and asking for feedback from the MakerDAO community. The post also includes a link to an article explaining the concept in detail. A 3rd party may provide constructive criticism or ask questions about the proposal, and the author is advertising the idea.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 5.555803571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/10/2020-09:03:59",
                    "content": "I have read about this before, and I do quite like the idea. I’m not quite sure how it could fit in with Maker 's current voting processes though. Maybe increasing weight based on time-locked-in-DssGov. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/01/2021-15:03:59",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}