{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-discord-chat/7252",
            "title": "[Informal Poll] Discord chat ",
            "index": 7252,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#1",
                    "likes": "0",
                    "time": "30/03/2021-16:22:50",
                    "content": "today @NikKunkel in the rocket.chat wrote:  Screenshot 2021-03-30 at 18.12.081186×142 15.7 KB  and this started a discussion. Before starting a formal Signal Request for the creation of a discord server, I thought it would be useful to have a preliminary discussion, to sense if there is a real interest. Some elements to consider before answering the informal poll:  Rocket.chat has worked fine in the last few years in that it kept the community kind of ‘shielded’ from meme-boys. This kind of reflects the culture of MakerDAO based on very polite discussion, generally well-educated etc. At the same time, Discord is the standard chat platform of all Crypto (and not just crypto). It would simplify the life of many, and surely will attract many new people. Ultimately this is (imho) a good thing. In large numbers you find all types of people, including good/useful/serious ones. We will probably have to organise properly: several channels, moderators, bots, etc. This will require time/energies.  At the same time, though, SourceCred already supports Discord (@s_ben) and we could reward valuable Discord-activity (like moderation) with cred.  In general I love the calm environment of rocket.chat, but I think it is terrible for some tasks (e.g., searching old discussions). All in all, I am probably favourable to move to discord.    Would you like to have an official MakerDao Discord server rather than the current Rocket.chat?  YES NO ABSTAIN     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-136-thursday-april-8-17-00-utc/7279/3",
                        "https://forum.makerdao.com/t/transitioning-away-from-rocket-chat/10097/4",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-april-5-8-2021/7381",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-2-8/7376",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-april-4th-2021/7419",
                        "https://forum.makerdao.com/t/what-are-our-priorities-and-how-can-we-stay-focused-on-things-that-matter-the-most/8697"
                    ],
                    "GPT-summary": "The author of the post is proposing the creation of a Discord server for MakerDAO and is seeking feedback from the community. The author discusses the pros and cons of using Discord versus the current Rocket.chat platform and suggests that the move to Discord could attract new users. The author also mentions the need for organization and moderation on the new platform. The post includes an informal poll asking the community if they would like to have an official MakerDAO Discord server.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.699520717377861
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "1",
                    "time": "30/03/2021-16:30:44",
                    "content": "Does it make sense in any circumstance to run both? Or is that too much of a headache for moderation/co-ordination? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "3",
                    "time": "30/03/2021-16:34:28",
                    "content": "    Aaron_Bartsch:  Does it make sense in any circumstance to run both? Or is that too much of a headache for moderation/co-ordination?   imho it would be pointless. I should add one point:  In discord it is possible to restrict access to some channels only to some authorised users.  I think it would be reasonable to create a channel reserved to people with >k (K any threshold considered sufficient) cred so to have a basic filter. In some discord servers I have even saw channels accessible only if you have >K tokens of a certain type, etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.410714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneBiteLawnOrder",
                    "index": "#4",
                    "likes": "7",
                    "time": "30/03/2021-16:37:54",
                    "content": "I personally get a lot of value out of the Rocket Chat. I think it is just enough barrier to entry that you really have to want to take part in the MakerDAO chat. Every discord channel I follow gets polluted with noise, scammy messages, and low-effort posts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#5",
                    "likes": "3",
                    "time": "30/03/2021-16:40:41",
                    "content": "    OneBiteLawnOrder:  I personally get a lot of value out of the Rocket Chat. I think it is just enough barrier to entry that you really have to want to take part in the MakerDAO chat.   Me too. What you said is true, but isn’t the barrier a little bit too high? I mean, MakerDAO is the largest DeFi project and one of the largest DAOs (if not the largest) and we have less than 20-30 people daily active in rocket.chat and on this forum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneBiteLawnOrder",
                    "index": "#6",
                    "likes": "1",
                    "time": "30/03/2021-16:44:56",
                    "content": "Yes fair enough. I suppose as an extremely part-time participant and lurker I’m not really the target audience for a Discord channel. I find cruising through the Rocket Chat daily or every couple days is about as much as I can keep up with so I guess my concern is just that with Discord any signal I currently identify would get lost in the noise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.482142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "0",
                    "time": "30/03/2021-16:54:03",
                    "content": "That’s why I think we should have both. Rocket Chat for more measured discussion and Discord/Telegram for getting the degens in the door (they serve a purpose as well). Can Discord have private channels like Rocket Chat that you can’t see? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "12",
                    "time": "30/03/2021-17:03:05",
                    "content": "I will say that I’m not looking forward to moderating a discord server. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#9",
                    "likes": "1",
                    "time": "30/03/2021-17:03:30",
                    "content": "I also find Discord has way too much noise for most crypto platforms. I’m not sure it adds that  much value given the effort required to moderate it. Remember, we still have the Maker subreddit for the degens to post in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#10",
                    "likes": "4",
                    "time": "30/03/2021-17:30:54",
                    "content": "Having owned and managed a philosophy Discord server with 5,000 members, I’d personally stay away. If we do decide to go forward with it, I can see two scenarios happening. Either we let people run loose, risking damage to our brand, or we assign enough manpower to moderate the discussion well, essentially translating to about 2-3 full time moderators, going upwards to 5 in hard times or if SourceCred is implemented. Echoing @LongForWisdom, I’m not looking forward to that job either. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.986721611721611
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "0",
                    "time": "30/03/2021-17:39:33",
                    "content": "    Elihu:  I’m not looking forward to that job either   I get this and I frankly agree. But the question emerges naturally: why all other projects are using Discord? It seems likely to me that, while costly, there are some good returns in growing the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#12",
                    "likes": "2",
                    "time": "30/03/2021-17:55:18",
                    "content": "We have issues bringing/keeping out partners on RocketChat. But at the same time, not sure Discord would be any better. Not sure we want Slack/Teams. At the same time, maybe we want a digital workspace … The Maker Reprensetative group for 6S is already on Telegram as well and some people here prefer to use Telegram. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#13",
                    "likes": "3",
                    "time": "30/03/2021-17:58:40",
                    "content": "I’m surprised at the lack of love for Discord. I’m brand new to Rocket Chat but have used Discord for a while and the product seems vastly superior to Rocket Chat. I follow multiple projects on Discord and only use Rocket Chat for MakerDAO which admittedly I neglect since it’s isolated from everything else. If MakerDAO had a Discord server I would be participating more frequently. I think it would also make for a powerful tool for Core Units to coordinate work with their teams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.297979797979798
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#14",
                    "likes": "1",
                    "time": "30/03/2021-18:00:07",
                    "content": "Selfishly voting no to avoid an “Eternal September” situation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#15",
                    "likes": "5",
                    "time": "30/03/2021-18:53:25",
                    "content": "    SebVentures:  The Maker Reprensetative group for 6S is already on Telegram as well and some people here prefer to use Telegram.   Telegram is i think “worse” than discord (because of bots and tons of scammers over there), it would need lot of moderation. Discord it’s been pretty used by all the other major DeFi Protocols (Uniswap, Yearn, 1inch, etc…), but there still to much to moderate, keeping everything in rocketchat sounds nice in order to keep the DAO chill for work. But in order to get mass adoption (from crypto community), honestly Discord is the best plattform, since we see on the MakerDAO Telegram chat that there is not much value or trully conversations over there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4296875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#16",
                    "likes": "0",
                    "time": "30/03/2021-20:48:52",
                    "content": "I personally do not like Rocketchat and use discord. But discord does attract a lot of riff raff. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#17",
                    "likes": "2",
                    "time": "31/03/2021-06:52:52",
                    "content": "    Lozadaluis12:  But in order to get mass adoption (from crypto community), honestly Discord is the best plattform, since we see on the MakerDAO Telegram chat that there is not much value or trully conversations over there.   This is an important point. Earlier this year, “Maker the money lego” won the poll on the MakerDAO vision. This means integrating a lot with the crypto space and other protocols. Yet we stay an outlier and add friction to collaborate with others’ protocols (minor friction I would say, but still a discrepancy between our vision and the reality). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.232142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#18",
                    "likes": "2",
                    "time": "31/03/2021-12:00:43",
                    "content": "    SebVentures:  “Maker the money lego”   Aww man, I’m sorry I missed this.  Would have suggested “Maker the lego board” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/indy",
                    "index": "#19",
                    "likes": "0",
                    "time": "31/03/2021-14:25:02",
                    "content": "I voted “yes” purely out of my personal practical reasons → too many chat apps to monitor … A quick count of the chat apps I use amounted to 8, Rocket.chat, Discord, Viber, Signal etc. Functionality-wise all of them are ok as I’m a very basic user most of the time and usually don’t care for bots or how hard a particular chat app is to manage, but I do realize some of them can be difficult to manage. On the other hand I do appreciate the more calm and reasonable chat in MakerDAO but I never really connected that to the chat app used, I just imagined that’s because of a somewhat more mature community and general culture. If that was indeed connected to the Rocket.chat I would vote “no”  As mentioned, voted “yes” out of selfish reasons, but I would ultimately rather leave the choice to the chat moderators and maintainers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.499433106575964
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#20",
                    "likes": "3",
                    "time": "31/03/2021-14:31:23",
                    "content": "Everything, but having both. If we migrate to discord (i don’t see what we really gain, but ok), then you need to lock rocket chat write mode, but keep running it in read only mode. Otherwise we lose search history. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#21",
                    "likes": "0",
                    "time": "31/03/2021-14:40:48",
                    "content": "    jernejml:  Otherwise we lose search history.   One of my main issues with rocket.chat is that the search functionality is (imho) very poor. Could we, in principle, dump the whole history on some file(s)? It might actually make it easier to search. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.808333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#22",
                    "likes": "1",
                    "time": "31/03/2021-15:54:11",
                    "content": "I think the main issue is, we want to keep it close and “professional” on rocketchat, or we want to get more adoption, users, feedback, etc… with Discord. I personally like the rocketchat cuz i know that if i want to know something about Maker, the people and teams inside the DAO will be there and they are going to help. So i dont have to go and look in some other place, i know rocketchat is for Maker and that’s it. But yeah the circle is very small, we for sure loose users by not using discord, and i have to say that “nothing good grows in the comfort zone”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.837339743589744
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#23",
                    "likes": "2",
                    "time": "01/04/2021-11:58:31",
                    "content": "TG I generally don’t use and I haven’t seen much traction in the RWA group there but I wouldn’t be participating much anyway so meh… Discord.  Probably highest visibility - pretty much every project has a presence.  There are pros and cons to being there.  Not sure SC helps much because I know people/groups are already gaming SC instances across the board.    Moderation definitely required. Honestly one has to ask the question - what is the goal of more access?   More people joining in (this has pro’s/cons).  I will say via discord 1Hive has probably doubled it’s developers.  I am not sure they would have gotten more people any other way. I agree with @jernejml that one would want to keep rocketchat up at least for searching.  Rarely I go back in conversations looking for links to things etc. Since my approach is becoming ‘less is more’ I am tending to pull back from most if not all on-line activities and focusing on other things.   Others are doing more but the on-line work, governance, investing space is broadening dramatically so I am fully expecting a general dilution of people in places over time unless they are growing massively or there is huge interest. It is more difficult to get things done at Maker than in other projects hence there is a higher barrier to entry.  That also has pros/cons. I probably will vote abstain and let the rest of the community decide.    There literally are too many platforms for work, communication etc. now and I don’t think one community can do them all without significant effort and expense both financially and personally. Just think about the goals with branching out into other communication channels. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.746212121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#24",
                    "likes": "0",
                    "time": "01/04/2021-12:26:38",
                    "content": "Voted “No” – unless you can guarantee that Discord will improve Customer Service. I say that because I see a lot of folks struggle with RC when they need help. And when they do get help it comes from a high lever SC Team member like Gonzalo & Nikolaj (who should not be doing customer services). If there was an Oscar Award for Best Customer Service, it would go to the RAI Team (Discord) and a new platform called Raydium (Telegram)–their Customer Service is IMPECABBLE. You can be the biggest pain in the arse and the admins will be nice, patient, and helpful regardless of the situation/request. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.370454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#25",
                    "likes": "4",
                    "time": "01/04/2021-15:19:10",
                    "content": "Uniswap hired a company (I think Micah Zoltu, who has been active here has something to do with it) which is responsible for first line help on Discord. They’re pretty good at what they’re doing (answering questions, helping with stuck transactions and so on). Perhaps we should too? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.2666666666666675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#26",
                    "likes": "0",
                    "time": "01/04/2021-15:28:58",
                    "content": "Micah is at Uniswap? I thought he had joined RAI. But yea–do we really think that Discord will see more action than RC? Wondering, as RC sometimes can quickly turn into a ghost town. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#27",
                    "likes": "2",
                    "time": "01/04/2021-15:30:24",
                    "content": "I don’t know. All I know he’s Discord admin at Uniswap. I’m pretty sure Discord will see more traffic. More spam, too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#28",
                    "likes": "0",
                    "time": "01/04/2021-15:31:49",
                    "content": "@MicahZoltu ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#29",
                    "likes": "1",
                    "time": "01/04/2021-15:38:50",
                    "content": "Dude Micah has not stopped by here in 150 years. Doubt he’ll ever come back. Last time I spoke to him, he was not too fond of us… what can you do. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#30",
                    "likes": "14",
                    "time": "01/04/2021-15:58:18",
                    "content": "http://serv.eth (or https://serveth.support if you are on a legacy browser) I don’t work for Uniswap, but my team was hired on by them as part of their grants program and (unrelated to that) I’m a moderator in their server but that is basically just banning scammers.     flipflopflapdelegate:  Dude Micah has not stopped by here in 150 years.   I can be summoned with a mention.    While I don’t agree with all of the decisions Maker has made over the recent year(s), I don’t harbor I’ll will toward the project and I still consider it more honest than most projects in the space. If you all are looking to hire tier 1 support (triage, answering basic usability questions, first touch, etc.) feel free to reach out! ",
                    "links": [
                        "https://serveth.support",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-april-4th-2021/7419"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party offering collaboration on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#31",
                    "likes": "5",
                    "time": "01/04/2021-16:10:43",
                    "content": "    MicahZoltu:  If you all are looking to hire tier 1 support (triage, answering basic usability questions, first touch, etc.) feel free to reach out!   awesome news! This might be a practical way to address issues like:     LongForWisdom:  I will say that I’m not looking forward to moderating a discord server.   Also, the support of SourceCred provides another incentives. Lastly, there are very cool bots on discord. For example it’s very easy to tip people (https://tip.cc/). I have witnessed the following phenomenon: if you tip people (like with 1 or 2 DAI) that answer (well) questions, or that are politely useful in any way, this tends to improve dramatically the environment. It’s crazy how little incentives (1 or 2 dai) can make some very concrete difference. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0315972222222225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#32",
                    "likes": "2",
                    "time": "01/04/2021-16:50:51",
                    "content": "That support service is a great idea. If we do move to Discord I’ll be 100% for having Micah’s team there to help and to moderate. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#33",
                    "likes": "3",
                    "time": "01/04/2021-17:45:20",
                    "content": "Also Uniswap Discord has pretty good ticketing system used for those issues which Micah team cannot solve instantly + some good antispam measures. It’s worth checking out. I was initially very against Discord, it thought it’s some platform targeted to gamers with lot of silly and annoying messages and so on, but now I’m quite convinced it’s a great tool for communities like ours. Of course RC will have special place in my heart forever, but I feel it’s time to move on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.003571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#34",
                    "likes": "2",
                    "time": "01/04/2021-22:00:55",
                    "content": "Feels like this might be worth exploring regardless of whether we move to discord. Currently everyone just helps people as they feel like it, which works well enough, but is sometimes distracting. It also doesn’t really make sense efficiency-wise for the smart contracts devs and others with specialized roles to be doing that themselves. The advertised pricing is like $500 a month to start. With current volume of people needing help I don’t think we’d go much over that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.653061224489796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#35",
                    "likes": "7",
                    "time": "01/04/2021-23:08:50",
                    "content": "One thing I try to make very clear to everyone is that my team’s support services should be considered Tier 1, which means first line of answers to basic usability questions and such.  They are not seasoned developers, so their ability to troubleshoot advanced questions is limited.  Of course, over time they tend to pick up common answers of all levels and they can provide rapid first response to users whdch helps people feel heard. I just want to make sure expectations are appropriately set.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.697077922077922
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#36",
                    "likes": "2",
                    "time": "02/04/2021-07:19:08",
                    "content": "@flipflopflapdelegate pointed out that Discord channels in multiple languages might be a big plus. Would tier 1 support extend to some common non-English languages too @MicahZoltu? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#37",
                    "likes": "1",
                    "time": "02/04/2021-07:36:40",
                    "content": "Unfortunately we do not have the staff to handle multi-language yet, only English. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#38",
                    "likes": "3",
                    "time": "02/04/2021-08:43:04",
                    "content": "Micah is quite humble here, from what I saw they can handle perhaps 80% requests from users. Of course I’d expect them to be able to explain all most important Maker DAO concepts like vaults, collateralization, stability fee, liquidations and so on. Some has to train them, I’m not sure how this is handled? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#39",
                    "likes": "4",
                    "time": "02/04/2021-10:38:53",
                    "content": "The normal way we do training is having them read introductory user material and play around with the app on a test network to familiarize themselves with the application and UI.  They usually ask me or the product owners questions along the way.  Basically, they go through the same “training” as a new user of your product would go through, which is public facing docs and UI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.036363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#40",
                    "likes": "2",
                    "time": "03/04/2021-20:30:00",
                    "content": "Are you able to provide a list of current clients? Or at least some references where you think your team has done a good job? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#41",
                    "likes": "4",
                    "time": "04/04/2021-03:43:09",
                    "content": "I recommend joining the Uniswap Discord server, it has a high volume of messages and they are almost all Tier 1 support type questions so you can very quickly get an idea of the service we offer.  We also support Nethermind, Nethermind Data Marketplace and soon will be supporting an unannounced project but their question volumes are much lower and the technical depth of those questions is much higher (less we can handle directly) so they aren’t as good of examples. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.07037037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#42",
                    "likes": "8",
                    "time": "06/04/2021-10:29:07",
                    "content": "After 1 week, there seem to be a good consensus towards Discord. I think this provides a basis for moving on with a Signal Request. After discussion with @LongForWisdom , this is more of a community thing and doesn’t really pertain too much MKR holders. It doesn’t need a onchain vote. Next steps: The facilitators will verify with technical people, how/when to move to Discord. Things should move on, eventually  Thanks to all those who participated.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#44",
                    "likes": "1",
                    "time": "06/04/2021-18:32:13",
                    "content": "Thi is great news now I can follow all of my favorite protocols in one seamless app. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#45",
                    "likes": "0",
                    "time": "06/04/2021-20:36:05",
                    "content": "    iammeeoh:  Next steps: The facilitators will verify with technical people, how/when to move to Discord. Things should move on, eventually   @iammeeoh, I don’t think it works like that. ; ) There are several things to consider that were not outlined in this post (non-exhaustive):  Are there any drawbacks to switching? Will we get a flood of “Hai ser wer can I steak token wen moon ser”? Are there any costs associated with the switch (monetary or else)? Do the “technical people” have the bandwidth? Do they have any other priorities?  I do like the product slightly more (I voted yes originally), but I did not know that the decision would trigger an action plan without much further analysis. For what it’s worth, I don’t think that doing that analysis is worth the effort time right now, based on the current priorities. It’s not like there’s something terribly wrong with Rocket.Chat. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.530612244897959
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#46",
                    "likes": "0",
                    "time": "06/04/2021-20:39:15",
                    "content": "    juan:  @iammeeoh, I don’t think it works like that. ; )   yeah my original plan was to move on with a more detailed Signal Request, but @LongForWisdom said it’s not necessary.     juan:  For what it’s worth, I don’t think that doing that analysis is worth the effort time right now, based on the current priorities.   I agree with all you said. Anyway, I just started the poll for curiosity, after a rocket.chat discussion. I agree there is no hurry! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#47",
                    "likes": "5",
                    "time": "10/06/2021-06:25:04",
                    "content": "    iammeeoh:   etc. At the same time, Discord is the standard chat platform of all Crypto (and not just crypto). It would simplify the life of many, and surely will attract many new people. Ultimately this is (imho) a good thing. In large numbers you find al    There’s a majority of Yes and with a reason. All the major communities use discord for several reasons:  Bots Roles and community maintained channels Keep the ecosystem homogeneous  Having an official makerdao discord channel could be beneficial for new users to come. At the end is what matters. Teams/Core units can still have their private rooms ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0575049950049955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#48",
                    "likes": "1",
                    "time": "10/06/2021-06:58:05",
                    "content": "    rafinskipg:  There’s a majority of Yes and with a reason.   Yeah, there is quite a big consensus for Discord right now. The poll was initiated 2 months ago. While there is absolutely no hurry to implement this, it would be nice to start thinking about how we could try it out (maybe in parallel with rocket.chat for a while) in the medium term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.785714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#49",
                    "likes": "1",
                    "time": "10/06/2021-14:42:00",
                    "content": "I can’t wait to have a Maker discord channel. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#50",
                    "likes": "0",
                    "time": "10/06/2021-22:24:05",
                    "content": "I think it would be interesting also that Discord allows more interaction than rocketchat, so why not use both or have a strategy to have one over the other. Both have their advantages and disadvantages. Without doubts I would like Maker Discord Chat. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#51",
                    "likes": "0",
                    "time": "10/09/2021-04:24:44",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}