{
    "poll_list": [
        {
            "title": "Burning Borrowed, Attacking MKR in the Event of Protocol Redeployment - November 9, 2020",
            "index": "4903",
            "option": "Agree",
            "supporting_mkr": "55,178",
            "highest_fraction": 0.98
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-should-the-maker-community-burn-attacking-borrowed-mkr-in-the-event-of-a-governance-attack-leading-to-protocol-redeployment/4903",
            "title": "[Signal Request] Should the Maker Community burn attacking borrowed MKR in the event of a governance attack leading to protocol redeployment? ",
            "index": 4903,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "meta-governance",
                "emergency-shutdown",
                "sig-status-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "5",
                    "time": "28/10/2020-17:10:24",
                    "content": "The purpose of this signal is to disincentivise large MKR Holders from providing MKR Liquidity on Lending Platforms and AMM Platforms until such a time as the Maker Governance contracts can be replaced with versions that cannot be attacked using flash loans. Pros:  Hopefully disincentivises MKR Holders from providing liquidity that could be used for flash loans and used to attack the Maker Protocol. It may encourage Maker Holders to vote, and become more aware of the risks that come along with providing MKR liquidity to the wider ecosystem.  Cons:  This may reduce MKR Liquidity in the wider ecosystem, making MKR trades harder to execute. Reduced liquidity will make it harder for keepers to acquire MKR for FLAP and FLOP auctions. This has the potential to frustrate or annoy MKR Holders that are currently providing liquidity. This has the potential to drive MKR Holders that are providing MKR Liquidity away from the Maker Protocol.  The title is a simplification of the below statement. Please vote according to that statement and not the title of this thread. Statement + poll follows:     “In the event of a malicious governance attack that leads to redeployment of the Maker Protocol prior to the introduction of flash loan guards into the governance process, the community and domain teams should do everything possible to burn the MKR involved in the attack, regardless of whether the owner was directly involved in the attack.” - How do you feel about this statement?   Yes, I agree with the above statement. No, I disagree with the above statement. I believe that the above statement should be rephrased and will suggest an alternative below. Abstain     0 voters     This poll will remain open for at least 7 days (2020-11-04T16:00:00Z). After that time, it will either be extended or closed depending on participation. If someone provides valid and critical feedback about the statement as currently formatted, I may restart the poll with the new statement. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-21/5181",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-20-en-espanol/5084",
                        "https://forum.makerdao.com/t/maker-relay-ep-20/5078",
                        "https://forum.makerdao.com/t/mkr-burning-issue/5544/7",
                        "https://forum.makerdao.com/t/maker-relay-ep-19-en-espanol/4981",
                        "https://forum.makerdao.com/t/maker-relay-ep-19/4975",
                        "https://forum.makerdao.com/t/urgent-flash-loans-and-securing-the-maker-protocol/4901",
                        "https://forum.makerdao.com/t/urgent-flash-loans-and-securing-the-maker-protocol/4901/7",
                        "https://forum.makerdao.com/t/week-22-dai-distributions-sourcecred-funding-mip13c3-sp6/4988"
                    ],
                    "GPT-summary": "The post is a signal request proposing to disincentivize large MKR holders from providing MKR liquidity on lending and AMM platforms until the Maker Governance contracts can be replaced with versions that cannot be attacked using flash loans. The post includes pros and cons of the proposal and a statement with a poll for the community to vote on. The author is asking for feedback and the post includes a note that the poll will remain open for at least 7 days.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Token economics",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 4.966056670602125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "28/10/2020-17:15:57",
                    "content": "Wait, are you saying that if I lend my MKR on Balancer, AAVE, etc., and it’s used to execute a Flash Loan – my MKR should be burned? If you can provide a simpler explanation of the quoted statement – that would be highly appreciated. Thank you in advanced. NVM–that’s exactly what you’re saying… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.416666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "3",
                    "time": "28/10/2020-17:20:44",
                    "content": "From my eyes, if MKR that is borrowed by a 3rd party is basically maliciously used, then the MKR should be burned. How it got to being in a place that allowed it to be borrowed, is (in my eyes) irrelevant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#4",
                    "likes": "1",
                    "time": "28/10/2020-17:22:39",
                    "content": "If you are on the lending MKR side and MKR used for the attack is burned, that might actually benefit the MKR lender… As they are burned, interest rate for lending out MKR will get much higher. “But they are burned so they can’t pull out MKR liquidity” That is assuming MKR holders won’t redeposit to lending platform. In reality, as MKR lending interest rate will be high, many will actually deposit to take advantage of it (especially after the protocol is redeployed and burn penalty removed) Anyway, my point is the incentive is not so straight forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.792857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "5",
                    "time": "28/10/2020-17:23:51",
                    "content": "    flipflopflapdelegate:  NVM–that’s exactly what you’re saying…   Well, I’ll note that I’m abstaining as governance facilitator. But yes, that is what the statement means. I’ll also highlight that the statement is of limited scope (ends when the governance contracts are no longer vulnerable to flash loan attacks.) Signalling on something like this is a way of communicating with MKR Holders providing liquidity that what they’re doing comes with risks to the protocol that they are invested in, regardless of whether or not the signal passes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.464285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#6",
                    "likes": "5",
                    "time": "28/10/2020-17:45:49",
                    "content": "Also, wouldn’t this create pervasive incentive to conduct more governance attacks using MKR flashloans as some benefit if a large amount of MKR gets burned? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.7857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#7",
                    "likes": "1",
                    "time": "28/10/2020-17:49:59",
                    "content": "It could initially. That said, if that MKR is actually burned (e.g. the community stands together to show that attack doesn’t go unanswered), then the next guy / gal will probably not be in a rush to do … Further, if borrowed MKR is burned, presumably the attacker would have a collateral issue for his / her loan. Finally, folks depositing MKR in platforms that allow it to be loaned out via flash loans (or any loans) will have reservations about engaging in lending if the MKR might be truly lost. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "1",
                    "time": "28/10/2020-17:55:07",
                    "content": "    Doo:  Also, wouldn’t this create pervasive incentive to conduct more governance attacks using MKR flashloans as some benefit if a large amount of MKR gets burned?   We would only be burning it if they managed to successfully take down the protocol and we were forced to redeploy. Doing this would almost certainly lead to a massive drop in MKR price, and imo is unlikely to be profitable in either the immediate or extended term. To your other points, flash-loaned MKR used in an attack would return to it’s owner after the attack, meaning that the interest rate in whichever lending protocol shouldn’t be affected. It’s also likely that a successful flash loan attack would need to utilize MKR currently present in AMM pools, which would also revert to the pool after the attack. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.518467643467644
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#9",
                    "likes": "1",
                    "time": "28/10/2020-18:00:58",
                    "content": "I thought you and others (as you can see from mrabino1) were implying that if it’s flash loaned, then MKR can still be burned by whatever necessary. For example, if flashloan came from Aave, then contract somehow burn MKR there. Good to know that it’s not that way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#10",
                    "likes": "0",
                    "time": "28/10/2020-18:07:22",
                    "content": "A flash loan is a unique animal and I am absolutely not an expert in this. However, in general if borrowed MKR is used maliciously and it takes down the system, we should fork that MKR out of the protocol. It becomes far more difficult to grasp “how” when it is a flash loan… The spirit is the same. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.168402777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#11",
                    "likes": "0",
                    "time": "28/10/2020-18:11:15",
                    "content": "    Doo:  I thought you and others (as you can see from mrabino1) were implying that if it’s flash loaned, then MKR can still be burned by whatever necessary. For example, if flashloan came from Aave, then contract somehow burn MKR there.   I think that’s exactly what is being implied. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#12",
                    "likes": "1",
                    "time": "28/10/2020-18:19:04",
                    "content": "This seems quite agonistic towards LPs. This signal is open for 7 days, won’t the GSM pause delay be increased to 72 hours by then? Seems like it should be the responsibility of ALL MKR holders that a malicious proposal that passes doesn’t get executed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "1",
                    "time": "28/10/2020-18:26:40",
                    "content": "To be completely honest, the mechanics of this haven’t really been thought through at this stage. This signal is more about the intention “We’re going to try to burn your MKR if it’s used to attack the protocol.” Rather than a concrete proposal on how we would achieve that. And to be honest, I think that helps to achieve the goal despite the uncertainty.     Jiecut:  This seems quite agonistic towards LPs. This signal is open for 7 days, won’t the GSM pause delay be increased to 72 hours by then?   Possibly. If the GSM delay is increased to 72 hours, there is much less risk of a successful governance attack, so LPs should feel more comfortable where they are. It very much depends how much MKR responds to the posts and votes on the current hat. I feel like the community will be fairly antagonistic towards LP’s if there is a successful governance attack that was only possible because of the MKR deposited in AMMs.     Jiecut:  Seems like it should be the responsibility of ALL MKR holders that a malicious proposal that passes doesn’t get executed.   I agree with this generally, and to be honest if there was a successful governance attack that required redeployment I think we would also be having a discussion on whether non-voting holders should keep 100% of their stake in the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.62936507936508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#14",
                    "likes": "1",
                    "time": "28/10/2020-22:15:12",
                    "content": "The Maker Foundation could secure the hat with their MKR. The governance delay should be increased to 72h ASAP. Those 2 actions should be enough for now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#15",
                    "likes": "2",
                    "time": "28/10/2020-22:49:13",
                    "content": "I disagree because of the social contract we have with MKT token holder. Most will never see this. They have the ownership of their token and never were told that it can be removed. Lending is quite standard in DeFi. If I understand, those attacks are governance polls, not the hat. Hardly something that will change the world. Just have to follow the gov polls and the mandated actors can remove any suspicious result from the executive. If the hat is at risk, we have a bigger problem. Their first action will be to burn most MKR token they don’t control. Not an expert but looking at the contract and if we can burn some MKR token, they can. In any case, MKR tokens can move between the executive and the actual execution I guess. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.606481481481481
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#16",
                    "likes": "0",
                    "time": "29/10/2020-00:19:37",
                    "content": "The flash loan was used to lift the hat and execute in a non-organic manner (less capital was utilized than would normally be necessary). This particular hat didn’t have any nefarious code, but it is evident that a similar approach could be used to elect a malicious hat and cause damage to the protocol. In this sense, any flash-lendable MKR poses a risk. People choose to lend to secondary platforms at their own peril. Note that this risk only manifests if a flash-loan attack does end in emergency shutdown. I also believe there is no other way to uphold the social contract of “malicious MKR would not be reinstated during a system redeployment”. Because of the above, I think signaling this increases the DAO security by an appreciable amount without much realistic downside. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.6201923076923075
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#18",
                    "likes": "0",
                    "time": "29/10/2020-03:10:04",
                    "content": "Can’t you just take a snapshot of all of the MKR before the proposal/vote is raised and only let those token holders vote or have their vote count? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#19",
                    "likes": "0",
                    "time": "30/10/2020-12:45:55",
                    "content": "Yes, exactly! This is what is being proposed by the smart contracts team in the Governance Contract Redesign, where the notion of snapshots is being used to record MKR balances at a point in time relative to the amount of MKR locked in the governance contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.877976190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "0",
                    "time": "04/11/2020-11:58:21",
                    "content": "Poll closes in ~4 hours. Please vote if you haven’t already! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#21",
                    "likes": "1",
                    "time": "04/11/2020-16:07:12",
                    "content": "Polls are now closed and the majority appears to be in favour. This signal will move on-chain on Monday 9th November. Thanks to all who voted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#22",
                    "likes": "1",
                    "time": "05/11/2020-06:33:13",
                    "content": "I voted in favor but I regret it. I have a sneaking feeling we could be opening ourselves to a troll attack. The troll would flash loan (or other attack vector) just a minor amount of MKR and then just vote something. The system would detect the attack and possibly wipe out much more MKR than was intended - troll happy. Net result would be a declining faith in governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#23",
                    "likes": "0",
                    "time": "05/11/2020-12:58:01",
                    "content": "There’s no automatic solution to make this happen in the event of an attack. The statement specifically states that the attack needs to lead to a redeployment of the Maker Protocol, I don’t think it would be possible to abuse this intention with a small amount of MKR given that a small amount of MKR wouldn’t be able to trigger Emergency Shutdown. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#24",
                    "likes": "2",
                    "time": "13/11/2020-06:31:04",
                    "content": "I’m in favour of anything that makes MKR resemble it’s stated utility and responsibilities Specifically MKR is for governing responsibly and nothing else The fee collected is justified only for responsible and active owners, it is not ‘free money’ There is no requirement that MKR be available with high liquidity on AMM markets with flash loan functionality, that’s defacto irresponsible governance as shown by this latest successful attack Anyone serious about participating in governance should be able to find a way to acquire sufficient MKR even without uniswap and balancer The idea that MKR is forcibly confiscated and burned when clearly irresponsible behavior is engaged in is very interesting and makes the ‘utilityness’ rather than ‘securityness’ of the token stronger IMO  Anything that gives MKR owners more skin in the game makes the protocol safer for users Anything that makes the protocol safer to use makes the peg more resilient The fact that honest and responsible owners are willing to have this conversation makes me very happy ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.557936507936509
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "0",
                    "time": "13/11/2020-10:34:39",
                    "content": "This signal succeeded in the on-chain poll with 55k MKR voting in favour, and 700 MKR against. Thanks to those who voted, both here and on-chain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#26",
                    "likes": "0",
                    "time": "13/11/2020-10:48:21",
                    "content": "To me, it sound the same as “Should the USDC governance freeze the USDC in the Maker Vaults in the event of an illicit use of USDC/DAI coming from one of the Maker’s vaults.” EDIT: typo ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#27",
                    "likes": "0",
                    "time": "13/11/2020-10:54:12",
                    "content": "MKR isn’t a stablecoin, it’s a governance token. That’s it’s intended purpose and always has been. These are different cases. In the case we’re discussing and which this signal relates to, this would only be considered if the MKR was used to successfully attack the protocol via flash-loans. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#28",
                    "likes": "0",
                    "time": "16/11/2020-08:49:06",
                    "content": "USDC has frozen funds involved in illicit activity before    CoinDesk – 8 Jul 20    Circle Confirms Freezing $100K in USDC at Law Enforcement's Request - CoinDesk CENTRE froze $100,000 in USDC in response to a request from law enforcement, the group said Wednesday.      that is exactly what they should have done because USDC tokens are an on chain proxy to a bank account somewhere i’d expect USDC governance to freeze USDC in a vault if they needed to, that’s a great example of why it’s dangerous to rely too heavily on other stablecoins as collateral, the moment either the bank account itself is frozen or an individual USDC holder’s tokens are frozen, the DAI that was minted by that USDC has no collateral behind it, and so new MKR would need to be minted to cover 100% of that that is a risk that MKR holders took on explicitly when they voted to enable USDC as a collateral type and continue to raise the ceiling on that collateral type as of today, it seems that if circle’s banking relationship soured, about half a billion dollars of DAI would instantly lose backing… so we should hope that circle continues to co-operate with law enforcement because the fallout of minting and auctioning off half a billion dollars of MKR could easily be an existential event  this seems off-topic though because governing a stablecoin, or a collateral type are both different to governing a governance token ",
                    "links": [
                        "https://www.coindesk.com/circle-confirms-freezing-100k-in-usdc-at-law-enforcements-request"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.946678321678322
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#29",
                    "likes": "0",
                    "time": "16/11/2020-09:01:49",
                    "content": "    David_Meister:  i’d expect USDC governance to freeze USDC in a vault if they needed to, that’s a great example of why it’s dangerous to rely too heavily on other stablecoins as collateral, the moment either the bank account itself is frozen or an individual USDC holder’s tokens are frozen, the DAI that was minted by that USDC has no collateral behind it, and so new MKR would need to be minted to cover 100% of that   Is that correct? I undestood that all USDC collateral was in the same pool and that there’s no way to freeze an individual vault. In other words, they can either freeze USDC in all vaults or none. The USDC governance could use that weapon to dictate their rules to Maker - i.e.: no USDC allowed as collateral, KYC… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.825757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#30",
                    "likes": "0",
                    "time": "16/11/2020-10:59:57",
                    "content": "USDC can blacklist any address they want they can make USDC unspendable/frozen for the address that owns a specific vault, even if they cannot change the mechanics of the vault itself the owner would be able to spend DAI that is minted from collateral that is not ‘theirs’ if the MKR protocol auctions off blacklisted USDC then who knows how circle and/or law enforcement might react towards the new owner of the tainted tokens  still seems off topic… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#31",
                    "likes": "0",
                    "time": "23/11/2020-10:59:58",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2882"
}