{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-13-0-october-21st-2022/18454",
            "title": "Unified Auctions UI Release v1.13.0 - October 21st 2022 ",
            "index": 18454,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "8",
                    "time": "21/10/2022-17:13:56",
                    "content": " Unified Auctions UI Release v1.13.0 - October 21st 2022 Version: v1.13.0 Name: Leo Spik  v1.13.0 in a nutshell Today we are happy to ship release v1.13.0. The main focus of this sprint was to push and support the onboarding process of rETH. Our main duty here is to ensure that the clipper callee is tested and that both the Unified Auctions UI and the keeper do support this new collateral type. Besides the work on rETH we have pushed the development of the multi callee support and improved our devops infrastructure. This week’s release is named after the small Berlin based auction house Leo Spik. This auction house was founded in 1919 by the art dealer and namesake Leo Spik. The successors and current owners try to represent Leo’s spirit and values. One can argue similar to the rETH token representing how much ETH a Rocket Pool user deposited. That’s why we picked Leo Spik as the name giver of this release.  rETH onboarding work  RETH-Onboarding-Simulation1280×1284 336 KB  When rETH is going to be live as a new collateral type, it is our responsibility that the respective auction infrastructure for potential liquidations supports it as well. Our claim is that we ensure this not only after the fact of a successful onboarding, but even before the corresponding executive vote. Besides the adjustment to the auction infrastructure, the exchange callee contract for the new collateral type has to be tested. This will later enable participation in a corresponding auction via flash lending functionality. For these reasons, we have built a simulation infrastructure that enables the execution of the following steps in a mainnet fork:  Compile and deploy spell into a fork Execute spell  Obtain enough MKR Vote on the spell Schedule the spell Warp time Cast the spell   Set oracle price Obtain new token Create vault Bring vault in a liquidatable state Liquidate vault Participate in resulting auction with exchange callee contract (via UI and Keeper)  We are keen to make this implementation as generic as possible, so that it can be used for future collateral types. During the implementation of this simulation chain, we benefited greatly from @Protocol-Engineering close cooperation and knowledge transfer - thank you for that.  Multi callee component  Screenshot 2022-10-21 at 15.26.271768×708 86.6 KB  After finishing the concept for the multi callee support in the last sprint, implementation of this feature has started. The new UI component that will allow the user to select between different callees based on the market price is finished. Currently we are adjusting the core logic of our product suite in order to facilitate the multi callee functionality as well and aim for a rollout by the end of next sprint.  Kubernetes monitoring To ensure quick response time in case of unintentional behavior or even downtime of our products we deployed the kube-prometheus-stack which enables us to customize alerting rules based on resource metrics. In case of anomalies of the application like high latencies or resource throttling we will receive alarms via dedicated alert channels to immediately take action. This monitoring stack + autoscaling features will further ensure high availability and scalability of the Unified Auction UI. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.618360071301247
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/01/2023-17:14:03",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-14-0-november-7th-2022/18701",
            "title": "Unified Auctions UI Release v1.14.0 - November 7th 2022 ",
            "index": 18701,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "1",
                    "time": "07/11/2022-15:37:40",
                    "content": " Unified Auctions UI Release v1.14.0 - November 7th 2022 Version: v1.14.0 Name: Museo Nacional Thyssen Bornemisza  v1.14.0 in a nutshell It’s November, the leaves are falling, and we are shipping release v1.14.0 - so everything in its usual cadence. With this release we are introducing the next larger feature from our roadmap: Multi callee support. Getting this feature over the finishing line was our main focus throughout the last days but we also further extended our simulation suite as well as the usual improvements on the overall UX of our UI. As our product suite has extended over the last months, so does now the naming convention for our releases. So far, we have limited ourselves to names of auction houses. From now on, however, we also want to include art galleries. To start with, we have named the current release after the Museo Nacional Thyssen Bornemisza in Madrid. There you can find the famous painting “Autumn” by Frederic Church. Simply fitting for the current season.  Multi callee support  multiCalleeFeature1370×676 72.8 KB  As one of our guiding principles we want to continuously optimize for an auction result that imposes least possible damage to the original vault owner. One approach for that is to ensure auction settlement via good market prices. In the medium term we want to achieve this by developing a 1inch based callee contract. A first step on the way to this goal was to enable the support of more than one callee. For one thing, this is how we create redundancy. It means that if a service by any means fails there is a fallback solution in place. At the same time, depending on the collateral type, one or the other liquidity source can be of advantage. Through the multi callee support we ensure that always the price-optimal alternative is selected. We’ve implemented the logic to select by default the callee with the best market price. However, the user also has the possibility to make an adjustment via the UI.  Further improvements of simulation suite In our last release we extended the simulation suite in a way that it now covers the end-to-end simulation flow to onboard a new collateral. We used this sprint to further harden and extend these simulations. Our goal was to have a generic simulation that allows us to create and liquidate a vault for each supported collateral type supported by the protocol. Along the way we added the possibility to execute auth-protected methods to our overall simulation toolkit. Doing the above enables us to do regular checks whenever there are changes either on our product side or on the protocol side in order to always ensure a functioning auction infrastructure.  UI adjustments  LiquidationLimitPanel1328×686 85.8 KB  Besides other changes to improve the overall UX of our UI we re-designed the limits panel of the vault liquidation flow. The panel is used to provide the user an overview on the current state of liquidation limits and how a potential liquidation of the vault at hand plays into these limits. Other than that we introduced a better number formatting across the entire UI. A small but highly convenient adjustment. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.344238301381159
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/02/2023-15:37:51",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-15-0-november-18th-2022/18841",
            "title": "Unified Auctions UI Release v1.15.0 - November 18th 2022 ",
            "index": 18841,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "2",
                    "time": "18/11/2022-18:02:37",
                    "content": " Unified Auctions UI Release v1.15.0 - November 18th 2022 Version: v1.15.0 Name: High Museum of Art in Atlanta  v1.15.0 in a nutshell One week before thanksgiving we are happy to announce release v.15.0. This sprint we focused on designing the partial swapping feature and to push the implementation of the Uniswap v3 auto router. We also release the use of WalletConnect as an alternative to Metamask besides the usual polishing and UX improvements. Today’s release is named after the High Museum of Art in Atlanta. Couple of years ago this museum acquired the painting “All About Eve” by partially paying the buy price and swapping it with one of the paintings from their stocks. With a little imagination you can build the bridge from this event to the partial swapping feature that we have conceptualized during the last sprint.  Concept: Partial swapping  PartialSwap_Mock1920×1320 150 KB  Large auctions are typically harder to settle via flash loans due to liquidity constraints on the exchanges. Currently on these occasions a user can still participate in the auction and place a bid with own DAI funds. This approach allows them to only bid on a portion of the auctioned amount. However, it comes with the known disadvantage that the user must have the required DAI funds in the first place. We want to tackle this by introducing the feature for the execution of partial swaps. It comes with the benefit of no capital requirements for the user and will help to democratize participation and ultimately settlement of large auctions. In the next sprint, we want to turn the concept for this feature into reality and start implementing it.  WIP: Uniswap v3 auto router support Although the feature is not fully completed yet, we already want to give an insight into implementation work that we have pushed forward in the last sprint on the integration of the Uniswap V3 auto router. The current implementation of the exchange callee comes with fixed routes to perform the swap. Making use of the auto router allows us to first determine the most lucrative route for the swap to then pass this information to the existing uniswap v3 callee. This more flexible approach increases chances for better prices and ultimately faster auction settlement. Thanks to the recently introduced multi-callee feature the user still has the chance to either switch the fixed route approach. So besides a gain in efficiency we also ensured to have redundancy in case of the auto router not providing any routes at all. Since the implementation of this feature is close to being done it will for sure be part of the next release.  WalletConnect support Up until now our UI supported Metamask as the go to wallet. Due to its large market share it should serve almost all auction participants already. However, we decided to add support for the WalletConnect open source protocol to easily connect a variety of mobile wallets to the Unified Auctions UI. This way we want to avoid the risk that a potential user is excluded from using the UI due to his specific wallet preference. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.522401277584205
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "16/02/2023-18:03:38",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/unified-auctions-ui-release-v1-12-0-october-7th-2022/18277",
            "title": "Unified Auctions UI Release v1.12.0 - October 7th 2022 ",
            "index": 18277,
            "category": [
                "Core Units",
                "Sidestream Auction Services"
            ],
            "tags": [
                "sas-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/danik",
                    "index": "#1",
                    "likes": "4",
                    "time": "07/10/2022-16:09:40",
                    "content": " Unified Auctions UI Release v1.12.0 - October 7th 2022 Version: v1.12.0 Name: Poly Auction  v1.12.0 in a nutshell Today we are happy to ship release v1.12.0. In the last sprint we focused on the liquidity stream for collateral auctions. More precisely we’ve conceptualised the multi callee support and will proceed with its implementation in the upcoming sprint. Besides that we’ve further extended our simulation suite with a generic simulation that allows you to open and liquidate vaults for different collateral types. And finally we’ve further improved the UI based barking feature that was rolled out at the end of the last sprint. The release is named after the well known Hong Kong based auction house Poly Auction. This house runs auctions from a wide range (ie. poly) of categories and hence offers its customers flexibility. This is what we are aiming for with our multi callee support. Propose the user the best liquidity source but add flexibility and redundancy with the ability to switch to another callee.  Conceptualisation of multi callee support  MultiCalleeSupport1920×1339 145 KB  We are constantly trying to optimize the result of an auction so that the vault owner takes the least possible damage. One approach for that is to identify the best possible market prices and to use these for auction settlement. To get there we want to use the auto routing feature of uniswap v3 in the medium term and develop a new callee contract based on 1inch. At the same time we don’t want to lose any security or robustness. As a first step in this direction we have designed the Multi Callee support. So if in the future one of the supported callee contracts cannot be used (e.g. because 1inch failed), the user will always have an alternative available and still be able to participate in the auction via our UI.  Extension of simulation suite  TerminalExcerptSimulation1610×494 54.5 KB  We have extended our suite of simulations with the ability to create and liquidate a vault. This simulation will help us in the future when onboarding new collaterals and can also be used to test general vault related logic. We will be able to use the simulation already in the next sprint when we take care of the onboarding of rETH. For the simulation itself, we have therefore also made sure that it is a generic implementation and only minimal adjustments are needed to extend it for a new collateral type. As one can see in the screenshot above all of our simulations contain several steps that can be executed and monitored via the CLI.  Improvement of UI based barking feature  WithdrawDaiFromVatPanel1374×826 83.1 KB  After releasing the first version of the UI based barking feature in the last release we’ve used this sprint to improve the overall UX. One addition is a new panel that allows a user to withdraw DAI from VAT after successfully liquidating a vault. It might have been unintuitive for an inexperienced user that the liquidation incentive is paid out to the VAT and not to the user’s wallet directly. Other than that we have adjusted our limits panel in a way that makes it more transparent whether a complete liquidation or only a partial liquidation is triggered given the current liquidation limits. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.682045454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/01/2023-16:10:04",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1820"
}