{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/real-world-asset-report-2023-01/19934",
            "title": "Real-World Asset Report - 2023-01 ",
            "index": 19934,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "rwa",
                "sf-001",
                "reporting"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/steakhouse",
                    "index": "#1",
                    "likes": "14",
                    "time": "23/02/2023-19:01:42",
                    "content": " Below you will find the January 2023 update on Maker’s Real-World Asset exposure. Please note that for the deal-specific sections, the data is current through January month-end and that February’s data will be included in next month’s post. Overview  1167×487 59.5 KB  Maker’s RWA balance continued to grow during the first month of 2023, totaling 681mm Dai at the end of January, up from 640mm Dai in December. The majority of this growth came from BlockTower’s vault, which added 35mm Dai to its total. January also saw the first utilization of the SocGen OFH vault. While the total borrow was just 7mm Dai (which was quickly repaid in February), this action had symbolic significance for MakerDAO. Despite the bear market and onslaught of negative headlines, one of the largest banks in the world chose to borrow Dai through the Maker protocol, and the start to finish execution went as smoothly as planned. RWAs continue to be the most significant driver of Maker’s Stability Fees. Excluding stablecoins, RWAs made up roughly 73% of January’s Stability Fees. If stablecoins are included, that share rises to 77%. A summary of Maker’s RWA exposure over time is shown in the chart below:    997×529 20.4 KB  MIP65: Monetalis Clydesdale (RWA-007)  1911×970 105 KB  There were no material changes in MIP65 since the last report and the transaction continues to perform as expected. Over the course of the month, interest rates at the very front of the curve (1mo/3mo) moved up 30-40bps while the 3-year tightened ~30bps. As shown in the dashboard above, about 70% of MIP65 is allocated to 0-1yr treasury ETFs, with the rest in 1-3yr treasury ETFs. You can see the source data behind the dashboard, including a full transaction log, here. Additionally, @SebVentures continues to maintain the Dune dashboard, found here. Huntingdon Valley Bank (RWA-009)  1789×1021 91.6 KB  The Maker community now has insight into the underlying loans and loan payments in the HVB deal. The Strategic Finance team has been working in collaboration with HVB and Ankura to develop a Portfolio and Concentration report, which will be produced monthly by HVB and shared in these posts going forward. The underlying data is also incorporated in the dashboard above. To see the full Portfolio and Concentration report, click here [Note: The Portfolio and Concentration report loan balances will differ slightly from the loan balance shown in the above dashboard. The dashboard balance uses actual funded cashflows as reported by Ankura, while the loan-level detail is provided by HVB and reflects Maker’s loan allocation, which may not have been funded as of the reporting date] BlockTower (RWA-010 - RWA-013)  1942×755 61.2 KB  BlockTower made their first official vault draw in December and have steadily increased their debt to just over 40mm as of January month-end. All of the activity came from the largest of their four vaults, which has been designated for structured products. BlockTower is satisfying all covenants and the Strategic Finance team will continue to monitor the pool as assets are added. Additional detail on BlockTower’s vaults can be found in their monthly report here New Silver (RWA-002)  1791×992 138 KB  The New Silver deal continues to perform steadily and maintain a high-quality pool of collateral to support the vault’s Drop token. We completed our annual due-diligence call with New Silver in December and have now completed our due diligence call with Centrifuge as well, covering the organizations management, technical infrastructure, financial health, and compliance/regulatory oversight.  1349×611 71.6 KB  Like last month, all covenants are comfortably passing the thresholds, with exception of the co-investor ratio, which is failing by just 0.04%. We still do not view this as a material concern for Maker. Until that test is cured, however, New Silver is not generating new loans from the vault. The Strategic Finance team is excited to announce that we have begun reviewing transaction documents related to the proposed restructuring and debt ceiling increase for the vault. We will update the community as this progresses, culminating in a risk and legal assessment to be posted at a later date. 6s Capital Partners (RWA-001) At the end of 2022, no loans were outstanding from the trust, and it held a cash balance of $14,177,144, so no Stability Fees were accruing. In January, $5.3mm was drawn from the trust, so the deal is once again building Stability Fees. We will gain more insight into this activity once the quarterly report is published (which should occur within 45 days of quarter-end according to the Credit Agreement). Once we receive those reports, we will have more detail on the underlying collateral. As a reminder, the on-chain data for the 6s Capital transaction does not accurately reflect the realistic Dai balance or accrued Stability Fees of the vault. While the on-chain data continually accrues a 3% Stability Fee on the Dai in circulation, the actual borrower (6s Capital Partners) is only obligated to pay interest for the time that capital is drawn from the real-world trust (RWA Senior Lending Trust). SocGen OFH (RWA-008) As mentioned in the beginning of the post, SocGen drew its first loan from the vault in January, posting SocGen tokenized covered bonds as collateral. The loan was repaid a few days later and the vault was subsequently closed. We’ve received indication from SocGen that they would be interested in opening additional vaults in the future, and we look forward to those discussions. Monitoring & Reporting Process Update The Strategic Finance team has made significant progress in the past month in our analysis of the existing RWA vaults. In January, we’ve collected and analyzed new data sources from HVB, 6s, SocGen, and BlockTower, and we maintain active dialogues with these counterparties to optimize the processes moving forward. We will continue expanding our coverage of RWA collateral in next month’s report. Legal disclaimer This communication is provided for information purposes only. This communication has been prepared based upon information, including market prices, data and other information, from sources believed to be reliable, but such information has not independently been verified and this communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, financial or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment, financial or other advisory services. This content is not directed at nor intended for use by the MakerDAO community (“MakerDAO”), and may not under any circumstances be relied upon when making a decision to purchase any digital asset referenced herein. The digital assets referenced herein currently face an uncertain regulatory landscape in not only the United States but also in many foreign jurisdictions, including but not limited to the United Kingdom, European Union, Singapore, Korea, Japan and China. The legal and regulatory risks inherent in referenced digital assets are not the subject of this content. For guidance regarding the possibility of said risks, one should consult with his or her own appropriate legal and/or regulatory counsel. Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any decision. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others.  ",
                    "links": [
                        "https://dune.com/SebVentures/makerdao-mip65",
                        "https://docs.google.com/spreadsheets/d/1vdjHx0DNUdhxYid2mCkgYnJrMeU6iCkN/edit?usp=sharing&ouid=115695602055802866608&rtpof=true&sd=true",
                        "https://forum.makerdao.com/t/blocktower-credit-monthly-report-12-21-2022-01-31-2023/19614",
                        "https://forum.makerdao.com/t/4-boletin-de-noticias-febrero-de-2023/20078",
                        "https://forum.makerdao.com/t/request-to-poll-increase-debt-ceiling-for-mip65-by-750m-to-1-250m/20119/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.493272005772005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/03/2023-20:18:41",
                    "content": "    steakhouse:  There were no material changes in MIP65 since the last report and the transaction continues to perform as expected. Over the course of the month, interest rates at the very front of the curve (1mo/3mo) moved up 30-40bps while the 3-year tightened ~30bps. As shown in the dashboard above, about 70% of MIP65 is allocated to 0-1yr treasury ETFs, with the rest in 1-3yr treasury ETFs. You can see the source data behind the dashboard, including a full transaction log, here . Additionally, @SebVentures continues to maintain the Dune dashboard, found here .   Thank you for the dash and data. Could SF or @Allan_Pedersen walk us through some of the expenses? It looks like there were expenses labelled “Monetalis Expenses” for Oct 2022 of 560k and Dec 2022 for 200k and 260k. What are each of these three expenses? They total nearly a million DAI, and at first glance seem outside the scope of authorized expenses: a one-time reimbursement for legal entity setup that presumably is the October expense, and 15bps annually on the AuM. ",
                    "links": [
                        "https://dune.com/SebVentures/makerdao-mip65",
                        "https://forum.makerdao.com/t/proposal-to-increase-debt-ceiling-for-mip65-by-750m-to-1250m/20060/13",
                        "https://forum.makerdao.com/t/request-to-poll-increase-debt-ceiling-for-mip65-by-750m-to-1-250m/20119/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2727272727272725
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/real-world-asset-report-2022-12/19413",
            "title": "Real-World Asset Report - 2022-12 ",
            "index": 19413,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "rwa",
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/roo",
                    "index": "#1",
                    "likes": "26",
                    "time": "13/01/2023-18:49:58",
                    "content": " Real-World Asset Report - 2022-12 Below you will find the December 2022 update on Maker’s Real-World Asset exposure. Please note that for the deal-specific sections, the data is current through month-end and that January’s data will be included in next month’s post. Overview Maker’s RWA balance continued to grow over the course of December, reaching nearly 640mm Dai. MIP65 deployed an additional 200mm Dai into short-term treasury ETFs and BlockTower purchased its first Structured Credit bond this month, drawing 5mm Dai alongside their own junior capital to fund the purchase. RWAs make up more than 50% of the DAO’s current Stability Fee generation. These stability fees continue to be supported by higher short-term interest rates, which were flat to slightly higher for the month of December.   1038×525 34.9 KB  MIP65: Monetalis Clydesdale (RWA-007)  1928×991 163 KB  Since the last report, the Strategic Finance team was able to review the bank statements and expense detail associated with MIP65. This allowed us to fully account for all proceeds generated by the vault and get a clearer picture of the overall transaction, now presented in this dashboard. The dashboard will be updated monthly in the RWA reports until we are able to move more data on chain. Additionally, @SebVentures will continue to update his MIP65 dashboard on Dune, found here. Huntingdon Valley Bank (RWA-009)  1125×555 54.5 KB  In the past month, the Strategic Finance team had conference calls with all relevant parties in the HVB deal: Ankura, RWA Foundation, and Huntingdon Valley Bank. The first point of business was to establish more detailed reporting from HVB/Ankura that will include loan level information that we can then review, aggregate, and present to the community. HVB and Ankura have been actively working on a reporting solution for several weeks. We hope to be able to provide more information to the community on the next report. New Silver (RWA-002)  1844×1059 126 KB  The New Silver deal continues to perform steadily and maintain a high quality pool of collateral to support the vault’s Drop token. On this new dashboard, the first row of three charts provides a good overview of the transaction. From left to right:  A summary of Maker’s exposure and Stability Fee generation The health and security of the structure The health and security of the underlying assets  The second row of charts provides more loan level detail on the current portfolio   1398×627 99.3 KB  With exception of the co-investor ratio (more detail below), New Silver is comfortably satisfying its covenants. The Strategic Finance team held a formal due diligence call with New Silver this week, covering the company’s management, technical infrastructure, financial health, and compliance/regulatory oversight. We have a similar call scheduled with Centrifuge for next week. We are periodically reviewing samples of the underlying collateral and do not currently have any concerns about the health of the transaction. Regarding the co-investor ratio, we do not believe that its current level presents any material risk to Maker. However, because it is currently failing to satisfy the 25% covenant, New Silver has stopped generating new loans from the vault and will be on pause until the ratio is either satisfied or the revised structure and upsize from their latest proposal is implemented. This proposal was supported by community vote and can be found here. Monitoring & Reporting Process Update The Strategic Finance team will continue to establish monitoring and reporting processes for each of the remaining RWA deals and will prioritize them according to size, data availability, and/or community interest. Most of this infrastructure is being developed from scratch and will take time to complete, but we have made steady progress and expect to be able to provide more information and analysis with each monthly report. The process to date has been manual and a significant portion of the data remains off-chain. Our goal on the Strategic Finance team is to improve upon legacy financial standards to create a more transparent, trustworthy, and efficient system. Part of that system will be moving as much information on-chain as possible. However, before that mission can receive our full attention, we believe the primary focus needs to be on reporting and monitoring in any form, so that the interests of Dai holders and the DAO are protected.  Thank you to everyone for the continued engagement on Real-World Assets. On a personal note, I am excited to be formally contributing to the DAO and look forward to helping with all the great things Maker is creating. I’ve been fortunate to meet a good number of people already, but if we haven’t connected yet, please feel free to reach out and say hello.  ",
                    "links": [
                        "https://forum.makerdao.com/t/new-silver-requesting-debt-ceiling-increase/18752",
                        "https://forum.makerdao.com/t/makerdao-2022-financial-results-and-retrospective/19636",
                        "https://forum.makerdao.com/t/mip95-100m-of-cogent-bank-loan-participations/19338/11"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.154127379469845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "13/01/2023-22:04:38",
                    "content": "Very nicely done @roo, thank you for putting together this EOY RWA Report. With regards to New Silver (IMO, best performing RWA collateral type since RWAs were introduced), when do you think the community can expect the requested parameters to go to a Poll/Executive? Based on the good performance by Home Builders across the United States and BofA stating 48-hours ago that the RE market is experiencing a “home price correction rather than a crash”, wondering if the parameters should be sent to an on-chain Governance Vote soon:tm:,  rather than later. “Once you read about it on the Wall Street Journal, it’s too late to get involved. The smart money has come and gone.”  -unknown Thank you in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5191558441558435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/roo",
                    "index": "#3",
                    "likes": "7",
                    "time": "13/01/2023-23:08:35",
                    "content": "In my experience, New Silver has been a great partner, and I look forward to working on their proposal. The bottleneck for the New Silver restructuring is on the legal side. Since Christian is no longer formally contributing to the DAO, Strategic Finance and the RWA effort have been without a lawyer to review New Silver’s Indenture Trust setup. We have been interviewing lawyers to join the team since early December and plan to extend an offer in the next week or two. Once that lawyer is onboard, we will perform the necessary legal assessment and put the new structure and terms to a poll. I will be performing the risk assessment, and since I’m already familiar with the deal and the changes are minimal, I do not expect that side of the process to cause any delays. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.81555944055944
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#4",
                    "likes": "2",
                    "time": "25/01/2023-16:15:37",
                    "content": "    roo:  In my experience, New Silver has been a great partner, and I look forward to working on their proposal.   Will you be recusing yourself from working on New Silver and other Centrifuge assets going forward? You appear to be getting paid by the Centrifuge treasury to perform credit analysis at that protocol on their assets. Thank you for the the report. We’re looking forward to seeing more projects added to it in the future. It’s certainly more thorough than was the case under the latest RWF facilitator. ",
                    "links": [
                        "https://gov.centrifuge.io/t/rfc-establishing-a-centrifuge-credit-group/3554"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.529829545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/roo",
                    "index": "#5",
                    "likes": "2",
                    "time": "26/01/2023-16:54:17",
                    "content": "Thanks for taking a look at the report. I’ve made progress in the past couple weeks on some of the other RWA deals and should be able to include a bit of new information in next month’s post. Centrifuge has been incredibly important in Maker’s RWA journey and to the broader DeFi landscape, so I’m happy to help the DAO in some way. In my view, the stronger Centrifuge is, the better it will be for not only MakerDAO, but all of DeFi. Additionally, as the RFC on the Centrifuge forum noted, the budget for this effort is quite small (~2 hours/person/month), so I do not expect there to be any issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.868801652892561
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0x336c6",
                    "index": "#6",
                    "likes": "0",
                    "time": "26/01/2023-17:11:23",
                    "content": "    roo:  Huntingdon Valley Bank (RWA-009)  In the past month, the Strategic Finance team had conference calls with all relevant parties in the HVB deal: Ankura, RWA Foundation, and Huntingdon Valley Bank. The first point of business was to establish more detailed reporting from HVB/Ankura that will include loan level information that we can then review, aggregate, and present to the community. HVB and Ankura have been actively working on a reporting solution for several weeks. We hope to be able to provide more information to the community on the next report.   This report, she is really great, amazing work. About HVB, I see fee payments to Genesis disappear from the graph in October, not surprise. What happen with the broker? If I understand the structure correct from other forum posts, the funds can’t return to Makerburn without a way to onramp to USDC, yes? In the jurisdiction I know (ok, it is Latin American but still based in civil law), you stop or existing contracts and you find another supplier in the event of a termination of service or bankruptcy. You find a new broker to recover this interest? What is doing in the meantime? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1994206773618545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#7",
                    "likes": "3",
                    "time": "26/01/2023-17:12:57",
                    "content": "    roo:  the budget for this effort is quite small (~2 hours/person/month),   Are we looking at the wrong RFC? The one linked above says: “I would estimate that the starting budget could initially be roughly $12,500 per quarter - this covers 5 members working 40 hours at an average of $250 per hour, along with a small contingency budget for additional expenses. Member compensation could be based on the specific skills provided so individual members may earn more or less than $250 per hour.”     roo:  In my view, the stronger Centrifuge is, the better it will be for not only MakerDAO, but all of DeFi.   Agreed. But in this case, you are receiving payment from a platform that relies heavily upon MakerDAO’s usage. There is not a problem with you doing a parallel or supplementary analysis, but Maker needs another person to provide due diligence, monitoring, analysis, etc that is not being paid by the platform where the asset originators are coming from. There is nothing wrong with working at multiple protocols, and in related subject areas. It’s just that the person(s) charged with the official monitoring on MakerDAO’s behalf needs to not also be paid by a business partner whose interests are that these assets receive favorable reviews. That means you should probably recuse yourself from covering these assets, or at the least, another contributor should cover Centrifuge assets and report on them separately. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.593253968253968
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#8",
                    "likes": "4",
                    "time": "26/01/2023-17:29:26",
                    "content": "    GFXlabs:  is not being paid by the platform where the asset originators are coming from.   For clarity, the Credit Group pays contractors on a per-project basis. I expect @roo to recuse himself from working on issuers seeking Maker funding (and I expect the Credit Group not to ask him!). In the case of New Silver, the work is being done on behalf of MakerDAO. Credit analysis is a reputation driven business and I don’t think it’s fair to say the incentives are broken here for such a small amount of money and only on projects outside of Maker.     roo:  (~2 hours/person/month)   This is correct and it’s not expected that each member will be fully utilized. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7146464646464645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "7",
                    "time": "26/01/2023-18:01:21",
                    "content": "    0x336c6:  I see fee payments to Genesis disappear from the graph in October, not surprise. What happen with the broker?   Just no contribution from the vault after this date. Gemini Trading isn’t in Chapter 11. We are working nevertheless to add a new one. Core Unit don’t have any power in those structures so there will be a governance poll at some point.     GFXlabs:  Thank you for the the report. We’re looking forward to seeing more projects added to it in the future. It’s certainly more thorough than was the case under the latest RWF facilitator.   Thanks for your support, happy you like our work. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.883116883116883
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#10",
                    "likes": "3",
                    "time": "26/01/2023-18:23:19",
                    "content": "    GFXlabs:  Are we looking at the wrong RFC? The one linked above says: “I would estimate that the starting budget could initially be roughly $12,500 per quarter - this covers 5 members working 40 hours at an average of $250 per hour, along with a small contingency budget for additional expenses. Member compensation could be based on the specific skills provided so individual members may earn more or less than $250 per hour.”   40 hrs * 250 = $10k. “A small contingency budget” is thus $2.5k. It’s 40 hours total per quarter, divided by 3 months per quarter, divided by 5 people for approximately 2.67 hours per person per month. I think you read it (as I did) that it was 40 hours per person per quarter, but the math doesn’t math that way ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.493589743589744
                },
                {
                    "author_link": "https://forum.makerdao.com/u/DaveringtonPLLC",
                    "index": "#11",
                    "likes": "9",
                    "time": "26/01/2023-18:43:48",
                    "content": "I had exactly the opposite reaction when I saw the announcement the other week. Here is how @roo is introduced for the advisory role:  Name: Sam Paderewski Bio: Sam is currently a member of the Strategic Finance team at MakerDAO, focusing on the DAO’s Real World Asset effort. Sam was a CLO (collateral loan obligations - uses corporate loans) and CDO (collateralized debt obligations - mostly uses bonds and other debt instruments) analyst and trader at Hildene Capital, a structured credit hedge fund, where he also developed quantitative models and firm infrastructure. He was at Citigroup prior, where he worked on the CLO Structuring & Syndicate team, bringing CLOs to market through every step of the new issue process. He was also a salesperson on Citi’s institutional Investment Grade Credit team, focusing on IG corporate bonds, but also credit default swaps, high yield bonds, and credit indices. Sam graduated from Duke University with a B.A in Computer Science and a Certificate in Markets & Management.  I thought, this is FANTASTIC! MakerDAO has a representative on this new and important advisory resource that will be providing “unbiased and objective” reviews to the Centrifuge community. The group assembled here is highly credible and impressive. They are providing a service to the entire ecosystem that is desperately needed. The fact that Centrifuge happens to be well-positioned to organize and help sponsor such a group is to their credit. The fact that a member of our SF Core Unit is a member of this group is a credit to us! This role should be viewed like Board service in the corporate world, which is compensated quite generously actually. It has tremendous advantages for MakerDAO in ensuring that our approach to RWA and contributions remain at the center of the conversation and part of the emerging consensus in the field. This Tweet from the Centrifuge Founder speaks to how we should understand the situation. While I recognize a host of overlapping and intersecting business interests complicate the picture, we are dealing with it in many many areas including I would say how @GFXlabs is a Delegate here at MakerDAO while also having launched Interest Protocol, a competing project.   twitter.com    lucasvo ꩜ @lucasvo  “Real world assets are a great idea”  …..“but no one in our DAO has the expertise to analyze the risk.”   11:58 AM - 25 Jan 2023           74                4            ",
                    "links": [
                        "https://twitter.com/labsGFX/status/1532073456803667968?s=20&t=mZyZVOVAaPkMAXMZKNNrnA",
                        "https://twitter.com/lucasvo/status/1618216748930695168?s=20&t=mZyZVOVAaPkMAXMZKNNrnA",
                        "https://twitter.com/lucasvo/status/1618216748930695168?s=20&t=mZyZVOVAaPkMAXMZKNNrnA",
                        "https://twitter.com/lucasvo/status/1618216748930695168?s=20&t=mZyZVOVAaPkMAXMZKNNrnA",
                        "https://twitter.com/lucasvo/status/1618216748930695168?s=20&t=mZyZVOVAaPkMAXMZKNNrnA"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.800977517106549
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marcus_Leanos",
                    "index": "#12",
                    "likes": "7",
                    "time": "03/02/2023-16:57:50",
                    "content": "we are running an on-chain vehicle that would work well for this use case that incorporates integrated monitoring (asset-, issuer-, industry-level), broker-dealer (not Genesis), and enhanced liquidity via ATS. Maybe we could knock out two birds with one stone and work with @roo on integrating monitoring capabilities on existing vaults while setting up new BD for Maker? Happy to chat offline if easier…I would expect minimal legal outlay on the part of Maker. Linking you to our post which contains a short synopsis of what we are doing  Request for Proposals for a on-chain RWA monitoring solution. Figured you may be interested in this as well @DaveringtonPLLC . Here’s a link to recent CoinDesk writeup for background: Adapt3r Brings Community Banks to DeFi ",
                    "links": [
                        "https://www.coindesk.com/business/2022/12/15/defi-protocol-developer-archblock-aims-to-onboard-us-community-banks-with-new-partnership/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9188311688311686
                }
            ]
        }
    ],
    "group_index": "2075"
}