{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/calling-community-members-to-be-a-maker-representative/4519",
            "title": "Calling community members to be a Maker Representative ",
            "index": 4519,
            "category": [
                "Governance"
            ],
            "tags": [
                "collateral",
                "real-world-finance",
                "maker-representative"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "11",
                    "time": "02/10/2020-16:54:09",
                    "content": "TL;DR With Real-World Assets being on-boarded hopefully soon as collateral, the community needs oversight of the off-chain lenders and be a proxy for confidential information that cannot be shared in a public forum. Ideally not only one Maker Representative per lender, ideally more. MKR’s governance and risk, needs you ! – Real world assets are coming as collateral to the MakerDAO protocol. With each transaction where DAI is minted for an off-chain transaction, the community can only assess the true risk of the transaction (and price the capital accordingly) if the risks are known. Further, unlike “traditional” crypto transactions, the real-world has legal complexities and sequencing that make a huge difference to determine compliance. Further, unlike a crypto transaction governed by code, off-chain lenders must follow the agreement between the parties. As Maker is a DAO (literally), it cannot inspect a transaction. It must rely only on information being reported back to the DAO. While off-chain lenders can do this with the confines of what they are allowed to share publicly, the community needs to elect “one of its own” and new folks to interact with off-chain lenders and report back. For virtually all of these transactions, reputation is built with time. The risk to Maker is largely front-loaded, especially for a new off-chain lender. An annual audit of the financial statements is useful, but getting started the community should push for earlier spot inspections. Specific to 6s’ LendCo structure, not only do I request a Maker Representative, I invite it, encourage it, and clamor for more oversight from a cohort of Maker Representatives. Depending on the community turn-out, 6s’ LendCo may only have one. Having many Maker Representatives serves three purposes.  MakerDAO distributes the trust across many Maker Representatives to have better comfort and insight and ensure compliance. Maker Representatives gain more credibility within the community the more each attests in a similar manner in concert. LendCo diversifies its risk as it looks “better” the more compliance it demonstrates.  Subject to the community approving the MIPs that I have put forth, the remainder of 2020 will largely be reserved for administrative setup with hopefully time for a deal or two. During the course of 2021, the gloves come off, and 6s turns-on the deal machine. MakerDAO needs Maker Representatives. LendCos need Maker Representatives. I will be volunteering to be one (for other off-chain lenders) if the community grants me this role. Links: Translucent Finance Off-Chain Asset Backed Lender What a Maker Representative needs to do: Required Activities:   Execute a non-disclosure agreement with an off-chain lender   Review lender’s legal setup and construct   Review lender’s transactions on a spot and quarterly basis Confirm:  Independent Financial Statements and confirm they were delivered timely No operations outside of approved scope No loans above portfolio threshold issued Equity requirements for all loans in compliance All loans issued are either performing or under construction Report back to the community the abstracted summary of the above:  Fully Compliant Compliant with minor comments. Material Breach - Not in compliance.      Note: The Community can easily replace Maker Representatives ! Compensation: This role builds your credibility within the community and could evolve into either a community compensated role or a LendCo compensated role. (TBD) Indemnification: 6s (as a LendCo) will be indemnifying any Maker Representative for his / her role. Further, at the Maker Representatives discretion, a legal entity may be used to serve this role as well to provide further legal protection. An initial list of candidates that I would like to be nominated as a Maker Representative:  @Planet_X @MakerMan @SebVentures  @g_dip (1*)  (1*) He may be conflicted as he works at or w/ the Maker Foundation, though he does have significant business background that the community should want.  The above list is not set in stone. If you are interested, please feel free to volunteer below. We need folks from the community to step-up and help !  UPDATE: Based on the below thread, the below is the current list of folks volunteering. Given that this role is an administrative oversight role for the benefit of the community, I recommend the community appoint all of them as Maker Representatives with a known requirement that a Maker Representative must recuse himself / herself should their be a clear conflict (e.g. I should not be a Maker Representative “assigned” to my own project, but that doesn’t mean I shouldn’t be a Representative one day).  @psychonaut @Planet_X @MakerMan @flipflopflapdelegate @maarten @mario @iammeeoh @ejbarraza @SebVentures spin  (hit the limit of user mentions!) ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-en-espanol/4804",
                        "https://forum.makerdao.com/t/maker-relay-ep-17/4798",
                        "https://forum.makerdao.com/t/advisory-resource-board-for-maker-representatives/4765",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/2",
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/signal-request-approve-maker-representatives-as-an-oversight-role-for-real-world-assets-october-2020/4656",
                        "https://forum.makerdao.com/t/week-18-dai-distributions-sourcecred-trial/4602",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-pt-br-portugues/4597",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-en-espanol/4576",
                        "https://forum.makerdao.com/t/maker-relay-ep-15/4574",
                        "https://forum.makerdao.com/t/agenda-discussion-rwa-collateral-call-maker-representative-wednesday-october-7-16-00-utc/4570/9",
                        "https://forum.makerdao.com/t/rwa-collateral-call-maker-representative-wednesday-october-7-16-00-utc/4570",
                        "https://forum.makerdao.com/t/poll-rwa-working-group-covenant-structure/4836/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-pt-br-portugues/4810"
                    ],
                    "GPT-summary": "The author of the post is calling for community members to become Maker Representatives to oversee off-chain lenders and report back to the community. The post outlines the responsibilities of a Maker Representative and invites interested individuals to volunteer. The author also suggests a list of potential candidates and encourages the community to appoint multiple representatives for better oversight and compliance. The post is asking for feedback, extending an invitation to collaborate, and advertising the need for Maker Representatives.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.865926484230055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "5",
                    "time": "02/10/2020-17:12:07",
                    "content": "Roughly how much time would this take per week? Depending on the level of automation, it seems like it could be as little as a few hours per week once things are rolling? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.640625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#3",
                    "likes": "6",
                    "time": "02/10/2020-17:13:24",
                    "content": "Thank you for the shout out and the compliments, but I think it’s important that this is a community role. The Foundation does not control the DAO and I would not want anything that I do to compromise that reality – even if this wouldn’t necessarily mean that the Foundation is in any way exerting control, ensuring clarity around this reality is very important IMO. I will always be here for informal support and I want to see RWA in the protocol very badly!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.509375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#4",
                    "likes": "3",
                    "time": "02/10/2020-17:18:12",
                    "content": "The role is intended to be an oversight role. So for weeks where there is no closing, then it would be zero. For a week when we had a closing, the time would be around 10min. Then a monthly (if you wanted) and definitely a quarterly review to ensure that everything is running smooth. The intent is that the time be as much as needed, but it shouldn’t be viewed as a “job” and should be minimal.  (less time than a governance call !) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "10",
                    "time": "02/10/2020-17:31:47",
                    "content": "OK, I volunteer.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "5",
                    "time": "02/10/2020-17:34:56",
                    "content": "I understand that being a Maker Representative is not a ‘fun’ thing: it requires commitment, time, responsibilities taking, etc. This means that: [opinion] eventually Maker Representative should be paid by MakerDAO. And also that we should be grateful to the first community members helping with this type of role at the very beginning of this experiment. However, at the same time, I think we eventually need forms of security mechanisms that prevents/discourage bad (even illicit) behaviours of Maker Representatives. I am not sure if  6s (as a LendCo) will be indemnifying any Maker Representative for his / her role  takes care of this part? This sounds more like insurance for  Maker representatives, not from Maker representatives. Generally speaking I think that: [opinion] Maker Representative should (somehow) have stake in the game (related to the RWA they are dealing with). This could be in the form of locking some assets until the job is done (well), or stuff like that. Has this type of considerations already been discussed? thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "3",
                    "time": "02/10/2020-17:39:37",
                    "content": "Thank you @mrabino1 or mentioning me. I am with @psychonaut wondering not just how much time this is going to take, but what expected expenses in setting up independant auditors, legal consults, etc might be.  I think I am in in the location where LendCo is executing (Michigan and there abouts) so techncally I could actually meet with borrowers in my area (or not) and/or at least look at their projects directly. I am not entirely sure where such a rep sits, on the LendCo side, or Maker side. I will have to do some investigation on whether I could take such a position as I may have some conflicting obligations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "2",
                    "time": "02/10/2020-17:47:01",
                    "content": "    iammeeoh:  I understand that being a Maker Representative is not a ‘fun’ thing: it requires commitment, time, responsibilities taking, etc.   It really depends on what each person likes to do. In many ways, one could view it as a thank-less role. On the other hand, it is an essential role that gets the Rep “in the deal” and can see what is actually being done. So, from a United States perspective, think of it not only being in Congress but being on the Intelligence Oversight committee. That is my thinking.     iammeeoh:  However, at the same time, I think we eventually need forms of security mechanisms that prevents/discourage bad (even illicit) behaviours of Maker Representatives.   On this, I completely agree and why having many of them is important. For example, one could easily imagine LendCo getting extorted by a bad Representative (e.g. pay me 50k or else I will tell the community that you are cooking the books… etc.)     iammeeoh:  This sounds more like insurance for Maker representatives   That is correct. It is for the Representative.     iammeeoh:  Maker Representative should (somehow) have stake in the game (related to the RWA they are dealing with).   He / she should be somewhat familiar with what they are supposed to watch-over. To start, we have what we have. For now, my role in running LendCo is to answer questions to the reasonable satisfaction of the Maker Representative. And the Maker Representative should “hammer” me with questions to understand what is going on. Now, the transactions contemplated are the same over and over. It is more about ensuring that deals are in-scope (10seconds), approved tenants (30s),  equity moves first (1min), and review the docs that show that LendCo has the senior lien (3min). Of course, there is more than that, but the spirit is that LendCo has the obligation to tee everything up for a review. The review itself might take time the first cycle, but afterwards they will be routine.     iammeeoh:  This could be in the form of locking some assets until the job is done (well), or stuff like that. Has this type of considerations already been discussed?   So in the context of “business staking”… for now, today, I believe the community reputation is sufficient to get started. We can always evolve it with time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.605072463768116
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#9",
                    "likes": "3",
                    "time": "02/10/2020-17:51:41",
                    "content": "    MakerMan:  Thank you @mrabino1 or mentioning me.   Of course !     MakerMan:  I am with @Joshua_Pritikin wondering not just how much time this is going to take, but what expected expenses in setting up independant auditors, legal consults, etc might be. I think I am in in the location where LendCo is executing (Michigan and there abouts) so techncally I could actually meet with borrowers in my area (or not) and/or at least look at their projects directly.   Location is not the issue. Zoom does that ! LendCo has to tee-up the reports for a Maker Rep. “inspection”. As we get started any Maker Rep. should want to see how things are expected to work in a given transactions (paper flow … money flow…)… Then probably for the first deal (or more at the Maker Reps discretion), to participate in it… and then thereafter probably inspect when he / she wants with a minimum of quarterly.     MakerMan:  I am not entirely sure where such a rep sits, on the LendCo side, or Maker side.   Definitely on the Maker side. The role is to be “trusted” proxy of confidential information and see what a DAO cannot. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.278846153846154
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "3",
                    "time": "02/10/2020-17:53:59",
                    "content": "It seems like Maker representatives should own some MKR tokens. Maybe this should be enforced somehow. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "6",
                    "time": "02/10/2020-18:27:27",
                    "content": "Perhaps not the sharpest pencil in the box  but you can pencil me in Matt. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#12",
                    "likes": "5",
                    "time": "02/10/2020-19:06:24",
                    "content": "I have 7 years of experience within pwc as a former auditor, if it can be done I volunteer to confirm the requirements related to the convenants & financial statements, not the legal area since it´s not my area of expertise. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maarten",
                    "index": "#13",
                    "likes": "5",
                    "time": "02/10/2020-19:18:22",
                    "content": "Hi all, I would love to become more active in the Maker community by taking this type of role. I have been following Maker with interest for a couple of years now, though not very visibly, on the different channels. I am based out of Europe, have a legal background and I also went to business school. From early on in my career, 20 years ago, I have been involved with energy and real estate investments, not only in Europe but also in the US and other countries across the world. More recently, my focus is on renewable energy. You can count me in! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.631410256410256
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#14",
                    "likes": "2",
                    "time": "04/10/2020-00:57:22",
                    "content": "I would like to become a Maker Representative. Background in risk management. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#15",
                    "likes": "7",
                    "time": "04/10/2020-12:53:01",
                    "content": "Very interesting, @mrabino1. Thanks for moving this forward. I think we should have a zoom call where you present this role and its implications and everyone interested have the opportunity to ask questions about it. This Wednesday we have the Collateral Onboarding Call with Cache Gold and Keep/tBTC, so maybe we could do it at 16h UTC (one hour before)? --> local time: 2020-10-07T16:00:00Z Would that work for you? @SebVentures, would that work for you as well? Let me know, and if it doesn’t we can try another time. Attn:  @Planet_X @MakerMan @psychonaut @iammeeoh @flipflopflapdelegate @maarten @ejbarraza @spin  I probably forgot to tag many of the “regulars”. Please tag them if you think they might be interested in attending. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#16",
                    "likes": "3",
                    "time": "04/10/2020-13:13:11",
                    "content": "Yes, it should be fine for me. Happy to see that many people interested. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#17",
                    "likes": "0",
                    "time": "05/10/2020-10:07:36",
                    "content": "Sounds good ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#18",
                    "likes": "2",
                    "time": "05/10/2020-15:27:45",
                    "content": "I’m happy to join as a Representative! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#19",
                    "likes": "2",
                    "time": "05/10/2020-20:10:29",
                    "content": "Agenda posted here:     [Agenda/Discussion] RWA Collateral Call: Maker Representative - Wednesday, October 7 16:00 UTC Collateral Meetings       Time in your local-timezone format:  2020-10-07T16:00:00Z (UTC)  Dial In Details Zoom Call  Passcode:  RWA-WG  Numeric Passcode: 966885  Intro Welcome to another real-world asset collateral onboarding call, where we’ll try to move things forward in our quest to bridge the real world with the crypto-universe. Open for anyone to join.  After the interest raised by @mrabino1’s Forum Post (link here), we’re holding a call where the role will be presented more in-depth, and anyone interested will be …      See you all on Wednesday! ",
                    "links": [
                        "https://us02web.zoom.us/j/88508073720?pwd=R1FiRCtKK0hIVGJyMlpiekZIelY2Zz09",
                        "https://forum.makerdao.com/t/calling-community-members-to-be-a-maker-representative/4519/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.885416666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#20",
                    "likes": "4",
                    "time": "06/10/2020-07:07:35",
                    "content": "Happy to join in here as a Risk part contributor. I’ve been contributing to the governance work with @SebVentures, particularly focused on centrifuge. Background in banking credit risk management. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.416666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#21",
                    "likes": "1",
                    "time": "06/10/2020-11:30:23",
                    "content": "You should definitely be part of the risk committee then(assuming you want to). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maarten",
                    "index": "#22",
                    "likes": "1",
                    "time": "07/10/2020-10:44:55",
                    "content": "Works for me, looking forward to connecting later today! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#23",
                    "likes": "2",
                    "time": "08/10/2020-16:02:27",
                    "content": "Just posted a signal request to cover this… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#24",
                    "likes": "0",
                    "time": "08/10/2020-20:52:50",
                    "content": "If you missed the call around this, the conversation + presentation was recorded and the video is now up: https://youtu.be/6UiF3gB215M ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pensivepenguin",
                    "index": "#25",
                    "likes": "5",
                    "time": "09/10/2020-20:46:10",
                    "content": "If you need more people, I volunteer. I am a corporate lawyer and my background is in leveraged lending. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#27",
                    "likes": "0",
                    "time": "11/03/2021-01:59:31",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}