{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sourcecred-pilot-extension/3892",
            "title": "SourceCred Pilot Extension ",
            "index": 3892,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "sourcecred"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "11",
                    "time": "31/08/2020-09:02:45",
                    "content": "With the initial trial nearing completion, the success metrics are looking good (final report coming soon). However, to determine if SourceCred is suitable for paying contributors from the protocol, more data is needed. As a result, the Maker-SourceCred working group has decided to extend the trial for another three months using funding provided by the Maker Foundation. At the end of this three month extension, barring overt gaming or strong opposition from the community, the working group plans to ask MKR token holders to approve a pilot whereby participants receive ongoing payouts from the Maker Protocol.  3 Month Extension In the initial three month trial, the working group has focused primarily on ensuring that SourceCred is secure (not overtly gamed), a positive experience for contributors, and producing reasonable scores. On these fronts, we believe it has succeeded. To prevent gaming, the trial started out conservatively, with relatively small payout amounts. Payouts were increased in month 2, and increased again in month 3. However, for most of the trial, payouts have not been material for many contributors. Further, knowing that payouts were scheduled to end in three months undermines the effectiveness of the long-term incentives. By extending the trial another three months, with the intention of asking MKR holders to implement ongoing payments thereafter, contributors can have more confidence that their contributions will generate a more predictable income. It will also provide the working group time to experiment with finding the optimal payout amounts, gather feedback from the community, and implement new features customized to MakerDAO’s needs. MakerDAO’s SourceCred instance will also be more secure in the trial extension, creating new possibilities. During the trial, the working group identified a need to prevent brigading and other low-quality posts from receiving Cred. This led to the creation of a new feature, now in production, that uses Discourse’s trust levels to restrict minting of Cred to users with higher trust levels. This, in combination with other planned new features, gives Maker more room to experiment with increasing payouts, if necessary, and to promote the trial outside of the forum, with less risk of gaming. Funding for the trial extension will be provided by the Maker Foundation. SourceCred will receive an extension of its development grant in order to provide active support, including gaming mitigation and building of any needed features.  6 Month Interim Period At the end of the three month trial extension, barring overt gaming or strong opposition from the community, the Foundation plans to propose that ongoing payouts are sourced from the protocol. If approved, the working group will run a 6 month pilot, during which more data can be collected, and the details of a technical integration with the Maker protocol can be worked out. This will include deciding how token holders allocate reward budgets, change parameters, and working out any governance issues that arise. Before the 6 month trial starts, the working group will propose an interim method of funding directly from the protocol, while details of the technical integration are worked out. The second half of the trial will be focused on troubleshooting and optimizing a more long-term solution.  Trial Results (Sneak Preview) As laid out in the trial proposal, SourceCred will be producing a final report for the community at the end of the current trial period. While we won’t have final results for another couple weeks, results so far look good. As shown in the chart below, engagement (the main objective metric) is up.  1550×1036 57.4 KB  While it is difficult to attribute the increase of participation back to SourceCred based solely on these metrics, we believe it does demonstrate the need SourceCred is seeking to address; namely, the need to pay contributors for an expanding amount of work related to governing the protocol while furthering the goal of decentralization. This week, SourceCred will be distributing a short survey that will allow the community to rate their subjective experience of SourceCred and provide feedback and ideas for improvement. We would very much appreciate your participation. Thanks! Written by the Maker-SourceCred working group. ",
                    "links": [
                        "https://forum.makerdao.com/t/week-10-dai-distributions-new-instance-system-payout-mechanism-sourcecred-trial/3632",
                        "https://forum.makerdao.com/t/maker-sourcecred-trial/2551/1",
                        "https://forum.makerdao.com/t/weekly-sourcecred-distribution-funding-update/5417",
                        "https://forum.makerdao.com/t/opting-in-to-sourcecred-wth-is-sourcecred/3913/3",
                        "https://forum.makerdao.com/t/sourcecred-trial-final-report/4569",
                        "https://forum.makerdao.com/t/feed-back-regarding-sourcecred-to-drive-the-future-of-maker-rewards-for-community-effort/3970/5",
                        "https://forum.makerdao.com/t/week-13-dai-distributions-sourcecred-trial/3918",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-108-thursday-september-3-16-00-utc/3850/2",
                        "https://forum.makerdao.com/t/feed-back-regarding-sourcecred-to-drive-the-future-of-maker-rewards-for-community-effort/3970",
                        "https://forum.makerdao.com/t/mip13c3-sp6-sourcecred-funding/4545",
                        "https://forum.makerdao.com/t/mip13c3-sp6-financiacion-de-sourcecred/5015"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.856425364758699
                }
            ]
        }
    ]
}