{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/pre-mip-discussion-fixed-payment-schedule-lump-sum-vaults-on-existing-collateral-types/7581",
            "title": "Pre-MIP Discussion: Fixed Payment Schedule, Lump Sum Vaults on Existing Collateral Types ",
            "index": 7581,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "risk",
                "proposal-ideas"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "3",
                    "time": "20/04/2021-21:43:18",
                    "content": "Overview Provide vaults on existing collateral but different terms. Instead of a variable-rate vault that can have collateral added or DAI paid until the vault is closed or liquidated, provide a vault with a fixed payment schedule for a fixed lump sum of DAI. Whether the stability fee rate should be fixed or variable is still an open question. Background Those who follow the chat will know there’s been some talk about some differently structured vaults (like ones that are acceptable for those with religious proscriptions on interest). After soliciting some loose opinions from several folks about the technical complexity, a good first step may be to offer vaults similar to the current ones, but with a fixed payment schedule and a single lump sum of DAI, as it seems easier to implement without utilizing as many of the scarce resources of the smart contracts team. Purpose For a user, payment that is on a fixed schedule eliminates the risk of sudden liquidation during an unforeseen extreme market event. Our products offer leverage to those who don’t wish to sell their underlying collateral, so the risk of liquidation likely keeps our most conservative – and likely most credit-worthy – users far away from the liquidation threshold for their vaults. This is generally a good thing, but with knowledge they won’t get liquidated until after missed payments, these users may be interested in levering a bit more, which would result in more fees for us. In short, this should be a better customer experience for users who avoid or underutilize traditional vaults for fear of liquidation when not very actively managing their vaults during turbulent markets. Happier customers are repeat customers. From our side, this would introduce more market risk, as the value of collateral can continue to fall before a payment is missed but after a traditional vault would have been liquidated. This is a concern that would need to be weighed. If we chose to offer fixed rates along with a fixed payment schedule, that would also introduce interest rate risk. The benefits, however, would be a reduction in timing risk with regard to liquidation. In the event of a sudden market downturn, this would create rolling liquidations, as vaults would not be eligible for liquidation until scheduled payments had been missed. In some cases, this will allow the collateral’s market value to rise, and liquidation avoided. In some cases, this will allow the collateral’s market value to continue to deteriorate. An added benefit would be greater predictability of DAI cash flow into the Stability Buffer. We currently have excellent knowledge of receivable growth, but due to the flexible repayment schedules offered, that does not necessarily translate into DAI received on a certain schedule and receivables are still vulnerable to loss in bad-case scenarios. Risk Profile of User It is hard to extrapolate well-established characteristics of developed debt markets to the crypto debt market, as the users are by their nature self-selecting into the system. That being said, it seems very likely that someone inclined to choose a fixed-schedule vault would be more risk averse than someone taking a standard vault. At the least, it seems improbable that the two vaults would be used in the same way by the same user, and over time it may become apparent how they differ, and allow for more/less allowed leverage or higher/lower stability fees in one type of vault vs another. It also provides us a tool to manage risk of disorderly liquidations due to high volume in a short time. Fixed Rate/Fixed Debt Fixed payment schedule does not necessarily equate to a fixed rate of fees. A credit card is an example of a line of credit with a variable rate but a fixed payment schedule. It also allows the user to draw further upon their credit line. At the other end of the spectrum are car or home loans, which typically use fixed rates and a declining balance of debt owed. And one can imagine a vault with any combination of these features of fixed/variable rates, one-time draw or revolving credit. Under the right circumstances, any would be appropriate. Personally, since the idea is to diversify both the timing risk associated with mass liquidations and to attract a more risk-averse user, I would propose a fixed-schedule, one-time draw vault, either with or without a fixed rate. Why One-Time Draw/Lump Sum With a set loan issued upon receipt of collateral, each scheduled payment reduces risk to Maker, as the collateral remains unchanged in quantity, but the exposure to the individual loan declines over time, shifting the risk of slow, ongoing price declines in the underlying collateral to the user. Our risk is defined and reduced over the life of the vault. In a traditional vault, Maker becomes more and more exposed to the risks associated with liquidation in the event of slow, steady declines. Summary Offering a new set of terms for loans on the same collateral gives us diversification of user risk profiles, reduces timing pressure on the liquidation ecosystem in the event of a mass downturn, provides users with a way to know with certainty when liquidation can occur, reduces the exposure of Maker to losses on each individual vault as older vintage vaults would have repaid a greater portion of their principal and fees while still holding collateral steady, and increases the predictability of when stability fees owed will actually be deposited into the Stability Buffer. This can provide us with a greater offering to customers with existing collateral types, which hopefully should be fairly easy to do risk analysis upon. I would like to hear reactions to the financial structure, how difficult this would be to implement technically, and how much user education would need to occur from Content and other related teams. Please also include thoughts on fixed/variable stability fees for this product. Attn: @SebVentures @hexonaut @seth @Primoz and many others who may have relevant domain knowledge. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-45/9427",
                        "https://forum.makerdao.com/t/weekly-mips-update-44/9303",
                        "https://forum.makerdao.com/t/weekly-mips-update-43/9190",
                        "https://forum.makerdao.com/t/weekly-mips-update-42/9010",
                        "https://forum.makerdao.com/t/weekly-mips-update-41/8892",
                        "https://forum.makerdao.com/t/weekly-mips-update-40/8759",
                        "https://forum.makerdao.com/t/weekly-mips-update-39/8606",
                        "https://forum.makerdao.com/t/weekly-mips-update-38/8486",
                        "https://forum.makerdao.com/t/weekly-mips-update-37/8309",
                        "https://forum.makerdao.com/t/mips-update-36/8125",
                        "https://forum.makerdao.com/t/weekly-mips-update-35/7962"
                    ],
                    "GPT-summary": "The author proposes a new set of terms for loans on the same collateral, which would provide users with a way to know with certainty when liquidation can occur, reduce the exposure of Maker to losses on each individual vault, and increase the predictability of when stability fees owed will actually be deposited into the Stability Buffer. The proposal is explained in detail, and the author is asking for feedback and thoughts on fixed/variable stability fees for this product.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.6078357017132525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/04/2021-21:54:28",
                    "content": "So with this structure, isn’t the user essentially getting a cheap put on whatever asset we offer as collateral?  With that in mind I don’t think we’d be able to offer anything close to our current collateral ratios for opening a vault. But there might be a use case for new/underutilized vaults where we have a large collateral requirement but a cheap rate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.261904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/04/2021-22:05:59",
                    "content": "So assume asset X is used for two vaults — one fixed repayment, lump sum, the other the revolving credit we offer now. Both at 200% collateralization. As time passes, the fixed payment schedule reduces our exposure to that vault and makes us less sensitive to price movements of the underlying asset X. We are in effect long time in some regards, as the same collateral is backing a shrinking loan balance. As time passes, the standard vault increases our exposure to price movements of asset X unless the user is repaying DAI or depositing collateral. But the original collateral is backing a larger receivable since we need our stability fees paid as well as principal repayment. Can this structure be used to speculate? Of course. But a key point is that the speculative uses should be different, as even using the DAI to buy more of asset X and then getting a new loan compartmentalizes the risk for each leg of that trade. And gives us more predictable payment of our receivables. Or that’s the idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.396780303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#4",
                    "likes": "0",
                    "time": "20/04/2021-22:07:00",
                    "content": "But that gives users a free ride on the asset. If the price collapses they just stop paying their loan. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/04/2021-22:08:07",
                    "content": "And we will have already have recovered some of the fees unless it’s a brand new vault. Compare that to current vaults, where we effectively have more skin in the game on the same collateral as fees accumulate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.696969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "0",
                    "time": "20/04/2021-22:09:46",
                    "content": "But if the asset drops more than 50% in your example we have undercollateralized DAI. So if the asset dropped more than that we’d actually lose money on the vault, which would significantly lower its possible Debt Ceiling. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "0",
                    "time": "20/04/2021-22:11:16",
                    "content": "I’m not sure I follow. If the asset drops 50%, how would a standard vault perform better? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#8",
                    "likes": "1",
                    "time": "20/04/2021-22:14:38",
                    "content": "Would Liquity fall under this type of system? They have an origination fee but no stability fees. Not sure if they plan on increasing this fee eventually or their system can push the peg up in some other way. Creating a vault system similar to their implementation may be the easiest solution. Not sure how this would work long term as you need a way to incentivize users to close their vaults to recapitalize the DAI. How is fixed repayment different than fixed interest? Don’t think that would work in crypto since you can’t force a payment schedule without already holding the payment in escrow. I’m not sure if this would get around the rules but you could suck some amount of collateral from the vaults as repayment every month for a set amount I guess in theory. Then you have to think again about the game theory to the system about making users repay when we want them to, or having the ability to nudge them without changing the terms of the agreement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#9",
                    "likes": "0",
                    "time": "20/04/2021-22:16:33",
                    "content": "If a user’s vault drops below its liquidation ratio (varies depending on the asset price but always greater than 100% of the loan amount) we attempt to sell the collateral to pay off the debt. So it gives us a chance to still make money from the vault even if the collateral’s value drops below our risk profile. In your example there is no floor, so the collateral could end up being worth less than the initial loan amount minus the payments made. We can take on that risk, but it makes having to spend DAI from the Surplus Buffer to heal the bad debt quite likely over a large enough time frame. Currently the surplus buffer is set to 30M DAI and we use it to pay out expenses. That doesn’t leave too much room to experiment with a vault that has a  100% loss risk. edit ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.112554112554113
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "0",
                    "time": "20/04/2021-22:20:34",
                    "content": "So I imagined that we would not liquidate based upon collateralization but upon missed payments. If someone is under water on an asset but wishes to keep paying, we should let them. Perhaps they still wish to be long the asset and can afford the carrying cost. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "0",
                    "time": "20/04/2021-22:21:54",
                    "content": "But what is their incentive to keep paying if they have extracted more value from the collateral than it is worth now? Or rather: if they now owe more than their collateral is worth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "1",
                    "time": "20/04/2021-22:28:27",
                    "content": "We would need to have a payment schedule that was fairly aggressive — perhaps 25% per week — if the asset is so volatile. The idea is to key off of assets we have already evaluated and accept, so we could require extra collateralization if that’s a concern and it’s more a matter of exact terms. We should offer fixed collateralization terms rather than letting the user decide to the degree they do with current vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.107142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#13",
                    "likes": "0",
                    "time": "20/04/2021-22:31:29",
                    "content": "I think there could be some use cases, but it greatly increases our Value at Risk which puts a pretty hard cap on how big we could allow that vault type to grow. But it’s worth mentioning that’s not too terribly different than what the Real World Finance Team is doing for New Silver, except theirs is a revolving line of credit. So it is possible to implement it just takes an asset that is less likely to suffer sudden devaluations to make the math work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.511679292929292
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#14",
                    "likes": "3",
                    "time": "20/04/2021-22:40:24",
                    "content": "    PaperImperium:  Instead of a variable-rate vault that can have collateral added or DAI paid until the vault is closed or liquidated, provide a vault with a fixed payment schedule for a fixed lump sum of DAI. Whether the stability fee rate should be fixed or variable is still an open question.   If the interest rate is variable, the loan would amortize at a variable rate so the length of repayment schedule could not be know at the time of origination.     PaperImperium:  with knowledge they won’t get liquidated until after missed payments, these users may be interested in levering a bit more, which would result in more fees for us.   In consumer lending markets, the banks willingness to lend is heavily dependent on not only the consumer’s ability to repay (income and assets), but also the institution’s ability to collect on the funds if the borrower defaults. In consumer lending this is handled through the traditional legal and credit reporting systems, but I don’t think this would be feasible for defi lending where we don’t assess identity and credit risk. Our only defense against borrowers selectively defaulting on their loans is excess collateral and liquidation penalties. Also, fewer transactions is generally a benefit, will users prefer to need to make regular eth txs for loan payments versus paying only as needed? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#15",
                    "likes": "1",
                    "time": "20/04/2021-22:44:08",
                    "content": "The idea was to appeal to customers who won’t fear sudden liquidation. But it was also meant to increase predictability of cash flow. If those are too hard to marry, we could just tackle the latter by offering the same vaults we have now, but with a slight fee discount if they make minimum payments. We basically offer secured credit cards with no minimum payment as it is. There may be customers that would happily make payments independent of their liquidation risk on a schedule in exchange for a few bps off the fees. But I do think we need to begin thinking about how to offer a product where customers can’t literally get liquidated overnight ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.088541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#16",
                    "likes": "0",
                    "time": "20/04/2021-22:52:11",
                    "content": "Absolutely, we just have to protect the system at the same time. Otherwise users would just put their bags in the loan type as cheap insurance, passing a large percentage of asset risk off to the protocol. But we could easily offer something similar to this if we are not taking on more price risk than our interest income. Could look into a vault like you describe but with us buying price insurance from a crypto provider to cover the tail risk. I guess at the end of the day it’s a question of demand. Because if we can be appropriately compensated for the amount of risk we’d just need a big enough user pool to draw from to pay for the implementation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.123809523809523
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#17",
                    "likes": "1",
                    "time": "20/04/2021-23:01:22",
                    "content": "I feel like we pretty urgently need to begin to segment our customers/learn more about them. Offering different mixes of terms is one way, but we want to make sure we don’t live and die by crypto speculation or yield farming. In particular, as we attract institutional users, we want to know when their flows go in and out as related to what type of user they are. Unrelated to the suggestion outlined above, but relevant to segmenting and diversifying users of different risk profiles, it may be a good move to offer small fee discounts for private vaults to large users. Not necessarily to attract their business when we already offer competitive terms, but to know our customers, which will become increasingly important if we want to diversify our customer base and terms tailored to them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.652151769798829
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#18",
                    "likes": "1",
                    "time": "21/04/2021-07:31:57",
                    "content": "Hey, @PaperImperium. I love to see and explore new ideas. In this case, we need to separate the “repayment schedule” with the over-collateralization of the loan.  Repayment Schedule As @monet-supply suggested, with a fixed interest rate, it would be quite easy to calculate a repayment schedule. That said, in this case, you would be setting more constraints for the users (with no apparent benefit).  As a user, you’re probably better off choosing the “flexible repayment schedule” that’s in place today. You do have an “advantage” (the free ride) towards the beginning of the loan, but a clear disadvantage towards the end (assuming liquidation if the schedule fails).   Over-Collateralization As @prose11 mentioned, we need to keep the system secure (and we achieve this by over-collateralization). How often the user repays nowadays have nothing to do with the overcollateralization. When a loan becomes undercollateralized, we need to liquidate the collateral. Maybe you’re suggesting that a user could choose to avoid liquidation by having the liquidation removed? I think it comes down to this:  When the price of the collateral type drops, any (purely economical) rational user would take the Dai they borrowed and repurchase the collateral in the open market at a better price.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.063047138047137
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#19",
                    "likes": "1",
                    "time": "21/04/2021-10:25:32",
                    "content": "    juan:  Maybe you’re suggesting that a user could choose to avoid liquidation by having the liquidation removed?   Somewhat. I’m still turning over in my head how to avoid undercollateralization without the vault being put-able debt. It may simply be that it will only work on assets that are less volatile or on users we have some prior knowledge of. Yet another reason I’d like to find ways to know who our repeat users are and how they behave. At some point some CeFi will figure out how to peel away the most responsible customers who are effectively overpaying by being lumped into an average risk profile. A great example is GEICO, who famously divined that people who take government jobs are more risk averse and could be offered cheaper car insurance than the population at large ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.249007936507937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#20",
                    "likes": "1",
                    "time": "21/04/2021-10:33:28",
                    "content": "    PaperImperium:  the most responsible customers who are effectively overpaying by being lumped into an average risk profile.   KYC? Or do you want to “monetize” cred? Vector attack: potentially, a non-KYCed user could build up cred to get a leveraged position that they can walk away from. We have discussed in the past about giving risk-averse users (have tools in place to avoid liquidation) a more favourable Collateralization Ratio (to make their loans more capital efficient). A couple of examples were Yearn, or someone using DeFiSaver. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#21",
                    "likes": "0",
                    "time": "21/04/2021-10:40:57",
                    "content": "    juan:  or someone using DeFiSaver.   Cross-collateralization may have some promise. That’s a good idea we should remember for the future. I think a lot of this will hinge upon making users less anonymous in either past behavior or identity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party giving an idea for future proposals"
                    ],
                    "Sentiment": 5.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#22",
                    "likes": "0",
                    "time": "21/04/2021-10:50:50",
                    "content": "How about onboarding Whiteheart ETH and WBTC as collateral with 100% collateralization ratio. Instead of making payments to MakerDAO weekly, bi-weekly, or monthly; premiums are paid to Whiteheart/HEGIC for wrapping ETH and WBTC with a put option. If the collateral ever falls in value, the difference is paid to the vault in USDC maintaining its original value assuming the underlying crypto asset falls in price. If it rises in value, then the vault has a credit limit increase since the collateral has appreciated. Hence, non-liquidatable fully-collateralized loans with a fixed duration. It would be a win for MakerDAO since it would protect from Black Thursday-type events. It would be a win for customers to be able to sleep well at night while having all of the upside of ETH/WBTC and none of the downside of being liquidated due to market risk. ETH-A is already the most popular vault in the system. It would only require evaluating the risk of HEGIC options. If they are safe, then the underlying assets are safe by extension. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.762820512820513
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#23",
                    "likes": "0",
                    "time": "21/04/2021-11:06:15",
                    "content": "I worry about counterparty risk being higher rather than lower if even a high-quality party is backing large swaths of debt instead of a heterogeneous mix of individuals. But definitely something to consider as derivative markets develop. I guess it would be akin to buying insurance on a mortgage with a low down payment. There may also be some way to leverage time differentials like some credit unions and interest-free lenders do. But unfortunately I think we’re running down the road to lots of complexity. But wander around Reddit and you’ll find fear of overnight liquidation is discussed, and I think we can all admit that’s a bad user experience. It does absolutely have to be down in a way that protects the protocol from losses, though. If nothing else, we will eventually have some collateral that isn’t reprised every hour and this may be more appropriate to table until then. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.999007936507937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MGRay",
                    "index": "#24",
                    "likes": "0",
                    "time": "27/08/2021-09:58:02",
                    "content": "The risk always persisted, but people managed to deal with this somehow. In all financial transactions, there is varying degrees of counterparty risk. Default risk is another name for counterparty risk. Default risk refers to the possibility that businesses or people will be unable to meet their debt obligations. For the traditional payments, this will always be actual, but I am using gambling payment processors to avoid this risk as much as possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.5
                }
            ]
        }
    ]
}