{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-decentralized-voter-committee-meetings-wednesday-june-29-9pm-cest-and-thursday-june-30-9pm-cest/16212",
            "title": "Endgame Decentralized Voter Committee Meetings: Wednesday June 29 9pm CEST and Thursday June 30 9pm CEST ",
            "index": 16212,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "endgame",
                "pubcall-:-voter-committee"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "6",
                    "time": "29/06/2022-18:05:13",
                    "content": "The Endgame DVC calls for this week will start soon, so here’s a post with a little information. First, I am working on renaming some concepts to reduce confusion. What used to be called Parties or the Endgame Party, will now be called the Decentralized Voter Committee or the Endgame Decentralized Voter Committee, and the calls themselves will be referred to as the DVC meetings or calls. Hopefully this clears up the confusion about the intention of creating vocal voter groups, it is clear that the term party was way too loaded even if it is somewhat similar to what the groups are supposed to do. Hopefully this helps people understand they are supposed to be objective and fact-driven as much as possible, since in the end it is all just MKR holders trying to improve the project and generate more value.  Wednesday call Join link: https://us02web.zoom.us/j/81436458345 Today’s meeting, as all Wednesday meetings, is focused on the short term. We will once again be discussing the the DVC concept (including the above renaming of concepts), focus objectives and trying to understand the lay of the land and what is being worked on in the Core Units. Today, CES will also join and give a 20 minute presentation about the current state of collateral onboarding and their thinking regarding priorities and focus objectives. Finally we will focus on delegates and delegation, as I will be delegating the 33k MKR I currently have sitting on my shadow delegate to the delegates that show up today and have been consistently attending and active.  Thursday Call Join link: https://us02web.zoom.us/j/82286534666 Tomorrow on Thursday 9pm CEST the focus will be the long term Endgame Plan. We have reached part 6: The Midgame and Endgame Products, which is the most advanced part of the plan with some very powerful tokenomics and efficiency maximizing architecture of products that make up the list of potentially all features Maker Core would ever have.  Next weeks Friday I will go on holiday, and be away for two weeks. As a result the Thursday DVC calls will be cancelled, but as an experiment, I will let the delegates and other MKR holders or voters that are interested run the Wednesday calls without me, if there is interest in doing so. Wednesday one week from now, CES will be joining again to give a follow up presentation, so at least on that day there should still be a good reason to keep holding the call and discuss the topics such as focus objectives. Wednesday July 20 I will be back and from there will finish the Endgame Plan presentations with parts 7, 8 and 9, as well as a more detailed roadmap of the coming months that I will be working on while away. ",
                    "links": [
                        "https://www.google.com/url?q=https%3A%2F%2Fus02web.zoom.us%2Fj%2F82286534666&sa=D&ust=1656957840000000&usg=AOvVaw0zXe8-fE03XPGrTYO-Iw7l",
                        "https://forum.makerdao.com/t/this-week-in-governance/16382/2",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-junio-05-de-julio-del-2022/16473",
                        "https://forum.makerdao.com/t/governance-and-risk-197-thursday-june-30-at-21-00-utc/16216/2",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.615029761904761
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/06/2022-20:12:26",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "30/09/2022-02:13:23",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}