{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/maker-growth-strategy-we-must-act-now-part-1/14501",
            "title": "Maker Growth Strategy - We Must Act Now (Part 1) ",
            "index": 14501,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "longform",
                "growth-strategy-series"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Youss",
                    "index": "#1",
                    "likes": "34",
                    "time": "07/04/2022-13:16:15",
                    "content": "Authors: @Youss (Growth), @luca_pro (LOVE - in incubation). Contributors: @Nadia (Growth), @Aes (SF), @Primoz (Risk), @hexonaut (PE). Following the post on the “Aggressive Growth Strategy”, we want to share with the community our thoughts on the subject. The next key milestone will be to share a detailed work plan with the community (cf. step n°5 in the “Next Steps” section).  Executive Summary The purpose of this document is to share with the community the urgent need to build up the System Surplus (SS) to the necessary amount to strengthen Maker’s resilience in the face of current and future risks. This will allow the protocol to build an ambitious but necessary plan to accelerate its growth and solidify its central position as the core pillar of DeFi. The current market dynamics and growing competitive landscape offer opportunities but also pose threats to Maker if the protocol does not adopt an ambitious and bold growth plan. Maker must build its Second Growth Engine to expand its products’ usage and reach, consisting of the following initiatives: institutional vaults, real-world assets and multi-chain expansion. To fund these initiatives, the protocol requires a higher SS to ensure stability and resiliency through expansion and adverse market conditions. We estimated the need to increase the protocol’s System Surplus to at least [300] MM DAI, as a first estimate, in the upcoming weeks (as a reference, the current SS is at [68] MM DAI as of 01-April-2022, excluding 13M in Operating Reserves). This initial estimate (to be fine-tuned) is reached by deconstructing: 1) the current gap, 2) the prospective gap, and 3) the Second Growth Engine needs. To achieve such an increase of the SS, we suggest a hybrid and flexible approach, using a combination of different financing sources and mechanisms that could include different forms of (permissioned or permissionless) debt, as well as hybrid debt instruments, and straight tokens. The immediate next steps are:  Gather feedback from the community and reiterate our plan. Define desired capital sources and fund raising mechanisms. Indicate a desired mix among those capital sources and related timing. Define an actionable work plan to achieve the key objectives - the plan would also include a “walk away” clause in case discussions won’t have a satisfactory result. Share the work plan with the community.   Context Since 2017, Maker has been successfully consolidating its leading position in both the lending and decentralized stablecoin markets:  In the lending market, Maker enjoys a leading position with 52% collateral market share in ETH (slight increase at 3% MoM over last 6 months) and 48% in WBTC (strong double-digit increase at 20% MoM over last 6 months) as of january-2022. In the stablecoin market, DAI remains a leading decentralized stablecoin by market cap (#2, right behind UST which remains a different beast), representing 6% of the overall stablecoin market as of january-2022, growing at 10% MoM over the last 6 months, and outperforming the overall market growth (6% MoM for the overall market).  However, DeFi is becoming increasingly competitive with the emergence of new players in both markets, lending and stablecoin minting:  In the lending market, beyond the incumbent players such as Aave (TVL: $12.0B as of 06-April-2022), emerging ones have been growing and taking decent market share, e.g. Anchor (TVL: $6.5B of collateral as of 06-April-2022) In the stablecoin market, USDC and BUSD (both founded in 2018) have overperformed DAI in terms of growth and adoption reaching a respective MS of 27% and 9% as of january-2022. Beyond Mainnet, on new Layer 2s, USDC has been expanding aggressively (e.g., on Arbitrum, USDC supply is at 513M vs. 43M for DAI as of early 2022).  To ensure that Maker keeps its leading position in the crypto industry, the protocol must build its Second Growth Engine and adopt a bold approach to expand its products’ usage and reach. Today, the factor limiting DAI liquidity is supply, i.e. actors ready to provide whitelisted collateral to be financed by the protocol via new DAI minting. We believe that the most important challenge for Maker in the next months and years is to substantially increase this supply base, by selectively attracting new borrowers and use cases. As of today, we have identified three key levers that can ignite this Second Growth Engine: institutional vaults, real-world assets, and multi-chain expansion.  Lever 1 - Institutional Vaults (IVs) IVs represent a major opportunity for Maker to substantially increase its DAI supply. As a reference, although they represent only ~0.8% of overall Vaults (34 out of 4’226 in total as of january-2022), they each have minted over 10M DAI, representing a total of 7.9B DAI (~80% of overall DAI Supply).  The Nexo vaults alone brought 637k ETH to the protocol and led to the issuance of 912M DAI as of 06-April-2022 (~10% of total supply).  Yet, this product is not without risk to the protocol as it concentrates collaterals in a few vaults, increasing concentration at specific levels of the price curve with an impact on liquidation risk. Also, that makes the revenue base more lumpy and more dependent on the decisions of a few players. The more DAI supply increases, especially from risky/ more volatile collaterals, the more the protocol’s exposure to bad debt risk increases, implying higher degrees of systemic risk for Maker.  Lever 2 - Real-World Assets (RWAs) RWA collateral types will open a new era for Maker as the opportunity to hugely expand its sphere of influence beyond crypto native use cases. In addition, and maybe most importantly, RWA collaterals will help reduce correlation levels within the protocol’s collateral mix, considerably improving its resilience to face bear markets and crisis events. Yet, RWAs remain experimental at this stage and will come with high risks in the first months and years of implementation. Those implementations currently require the interaction with permissioned or centralized contracts or institutions outside the world of smart contracts, with limited visibility especially in the case of adverse behaviors. Although we can expect in the long term most of the lending rails to move directly on-chain, until then Maker will need to accept a higher level of embedded risk that can be only partially mitigated by good structuring and conservative collateralization.  Lever 3 - Multi-Chain Expansion The current major crypto effort of building and scaling new cost-efficient networks (i.e. Layer 2s and side-chains) offers great opportunities for Maker to accelerate its growth and preserve its leading position across the whole industry. However, these innovations also represent an opportunity for players existing on Ethereum to seize a first-mover advantage and outgrow the current leaders; this represents a non-negligible threat to Maker. The development of other chains (i.e. Layer 2s and side-chains) enables superior technological and economic performance for new applications to scale efficiently and be accessible to everyone (e.g., retail investors). Currently 90% of existing Vaults are owned by retail investors (which minted less than 1M DAI) and 70% of existing Vaults are minting less than 100K DAI. Yet, the transaction fee levels currently observed and the fact that a new Vault requires at least 15k DAI debt (i.e. dust limit set to 15k) have been reducing attractiveness for retail investors. The opportunity cost of not expanding rapidly and in size into other chains might cost Maker its leadership position. The protocol would miss the opportunity to interact directly with the retail segment, a segment that remains strategic for the expansion of the protocol as it increases the value of the network effects associated with Dai and advances the vision to democratize financial services to everyone. Today Maker’s presence in L2s is very limited in comparison to our competitors; as an example:   USDC supply is at ~660M in arbitrum where DAI is at ~49M as of 29-March-2022.   UST has reached 100M liquidity in Solana where DAI is at ~100k as of early 2022.   Yet, expanding on side-chains and L2s is not without additional risk for the protocol. In fact, the protocol is facing new technological challenges to mint, transfer and manage DAI liquidity in other chains while maintaining full control of the fungibility of DAI minted on these chains, protecting itself against hackers and other threats.  Why Do We Need to ACT NOW? As highlighted above, Maker’s ability to take bold moves and build its Second Growth Engine (initially through IV products, RWAs, and multi-chain expansions) comes with additional risks. The protocol must therefore prioritize building a resilient buffer to sustain adverse events that, although carefully diligenced and accounted for, might materialize following the expansion into new areas. Clearly, every initiative that implies additional risks will need to be formalized through a clear business case and submitted to the community vote before execution;as always, the quality of the collateral and the robustness of the legal contracts should remain a key priority for the protocol as DAI holders’ trust is our most precious asset. Today the protocol is not capitalized enough to support growth initiatives while maintaining optimal stability and resiliency. As an example, as of february-2022, the protocol is backing 9.7B DAI in circulation with only 68M DAI in SS (<1%). As a comparison, a traditional financial institution would retain 15-20% of its risk-weighted assets as equity cushioning to protect against “unknown unknowns”. Although Maker’s lending book is overcapitalized, the protocol is still at unacceptably high risk in case of black swan events. Therefore, we believe it is urgent to address both the growth and resilience topics, in order to protect and capitalize Maker’s first-moving advantage, and shape the future of the protocol.  What Is Our Suggested Solution?  1. Maker Needs to Raise its System Surplus. Why is it advisable to safeguard against adverse events through an expanded System Surplus rather than through the MKR minting process? We strongly believe the System Surplus is a way more effective source of capital to safeguard against bad debt and flop auctions when compared to minting new MKRs. In the current construct, new MKRs would be most likely minted at the worst possible time with a price significantly below their intrinsic value (i.e. distressed price that is already suffering from a market discount driven by adverse events). Minting a large volume of MKR under those conditions would dilute the value of current MKR holders. Expanding the size of the System Surplus, however, does not come without additional costs and complexity. We have tried to summarize those in the table below.  Table 1946×519 130 KB  Again, we strongly believe that a larger SS is a much better suited way to protect the protocols against unexpected losses. However, in the case the protocol would be successful in raising hundreds of millions in its SS, another question arises as to how to manage dormant money prudently and productively. The treasury management of DAI available in the reserves is not addressed here as not the purpose of this post and raises the broader issue of managing the stablecoin pool currently in possession of the protocol. Those topics should be addressed in a separate post. Additional capital in the SS shouldn’t be needed exclusively to sustain unexpected losses that might arise in the protocol’s course of business. Maker is still at its early stage and remains a startup in a fast-growing crypto industry. In such a fast-paced and competitive environment, we must preserve our “Day 1” mindset (i.e. stay agile, take bold decisions, be ready to fail), especially in a bull market when we are tempted to relax our efforts.We are on a multi-decade journey. It will require us to take bold and risky decisions to stay in the race and secure a leading position.  So what about MKR burn? Going back to burning MKR at this stage is shortsighted. We acknowledge that the burn mechanism is an integral part of Maker’s value proposition, but this should not prevent us from adapting to ensure a brighter future for Maker. The hypothesis that burning MKR is bringing value to shareholders by increasing MKR price is not proved. From a long-term perspective, the overall net result of this action is most likely negative. As shared in Kris Kaczor’s post: “During 03.2019 - 03.2020, MCD constantly burned MKR. It burned almost 14k MKR (1.4% of the whole supply) in a year. One would expect that such burn pressure would do wonders to MKR price. Unfortunately, the MKR price couldn’t care less and stayed relatively flat at around $550.” While this mechanism is looking to have a positive effect on PR and short-term MKR prices, it is ultimately a bad use of the protocol’s earnings. First of all, sharing our ability to burn is not the only way to achieve good PR and build trust and traction in the market. In fact, communicating on how Maker intends to invest resources with conviction in its own growth, with clear strategic planning, would most probably have a higher impact on PR and prices through higher valuation multiples. The “commitment to burn” is not the right way to measure the long-term success of the protocol as what we are ready to burn today will have opportunity costs in terms of foregone future growth and profitability. We remain convinced that the protocol must prioritize its growth over short-term gains. By investing in growth, the MKR price would naturally benefit, both in terms of additional profits and of higher valuation multiples recognised by the market. With growth slowing down, we think that focus on immediate return on capital will be swapped for care for tokenholders’ return and economic value added. As we have done before, we have summarized the pros and cons of a return to MKR burning in the table below.  Table 2954×450 90.1 KB   2. The Estimated Need of System Surplus Is at [300] MM DAI. Assuming consensus on the preference for System Surplus over forward MKR minting, we would now face the question of by how much should we increase the SS. Caveat - It is important to clarify that the objective of this effort is not to define the exact amount needed but to build the right framework to be able to re-evaluate the need at any time, as the variables vary over time depending on market dynamics, changes in the structure of our collateral portfolio and business decisions. We estimate the need to increase the System Surplus at [300] MM DAI (to be fine-tuned in the coming weeks). We have reached this initial estimate by unpacking: the current gap, the prospective gap, and the Second Growth Engine needs. The current gap refers to what the protocol would need to cover in order to compensate for:  Losses arising from adverse events related to existing outstanding debt - i.e. when the overcollateralization isn’t sufficient to protect against persistent collateral value drops. Other types of systemic losses that can be collateral-specific or not. Other types of generic technological and business risks, proportional to the size of the protocol.  Risk Core Unit has developed a risk model that tracks Capital at Risk (CaR) requirements at MakerDAO on a daily basis. Methodology and inputs used for the risk model are explained here. Currently the CaR metric is relatively low and measures only about $20m at the time of writing (an average of $55m over the last 3 months). This is explained by a) high debt-weighted vault collateralization b) high debt-weighted estimate for share of vaults protected and c) high on-chain liquidity of collateral assets.  The prospective gap refers to what that current gap would be if Maker would keep doing the same things it does currently. Accessing the market for additional funds is not something that we could do on a daily basis, and it would be good practice if we could raise sufficient capital to support baseline growth. At a level of 5B of volatile debt exposure, which is a more than 50% increase compared to the current level, we can see that the estimated CaR is around 150M. The prospective gap, estimated at [150] MM DAI, conservatively assumes that the protocol will breakeven, i.e. pay for maintenance and development costs through profits. If additional profits will occur, they would accrue in the System Surplus. Below you can find the Risk Core Unit estimate for marginal contribution of volatile debt exposure on Capital at Risk.  1200×600 33.2 KB  The Second Growth Engine of growth needs refer to additional capital needs in order to sustain the new Engine as described above. As described, the new growth initiatives identified will require a larger capital buffer to cover both additional growth investments as well as additional risks. The needs might vary depending on the chosen individual debt ceilings but are estimated at [150]M DAI (to be further fine tuned). Importantly, we believe we need to have processes and tools in place to be able to adjust SS to the change in portfolio risk profile in a timely manner. We are endorsing [Strategic Finance] and [Risk] core units to continue to monitor and fine tune those estimates as we go along. The incremental profits generated through the deployment of this Second Growth Engine, as there will be, will be redeployed in further accelerating Maker’s growth and solidifying its core position as the central pillar of DeFi.  3. We Suggest a Hybrid and Flexible Approach to Reach This Target. To reach our target of [300] MM DAI in the System Surplus, we suggest using a combination of various financing sources and mechanisms that could, for example, include different forms of (permissioned or permissionless) debt, as well as hybrid debt instruments, and straight tokens. At these valuation levels, Maker is better off issuing more debt than equity. Given market realities, we will have to conduct one part of the fundraising through a token sale from MKR held in the Treasury. We will provide long-dated vesting contracts to prevent investors from selling early and to make sure they are tied to the development of the protocol. This mix of capital sources will need to be further defined from a risk, cost and business development. In general, it would be the intention of the protocol to:  Minimize blended cost of capital (for the protocol). Maximize the capital stickiness - the capital we will raise as part of the System Surplus will have to be there when we need it, and therefore have some form of perpetuity and reliability.  There are several reasons why debt can be more attractive than token equity as a source of capital. Maker presents lower valuation multiples than other protocols, making token issuances today relatively expensive when compared to debt. Debt, in addition, would offer more flexibility in increasing/ decreasing quantum, as well as maturities, as we go along depending on needs and market dynamics. Investors would obviously need to lock their DAI for a certain period of time to be viable capital cushioning, and this can be done in exchange for attractive yield that can be generated by the protocol. Those mechanisms will need to be further defined. We are looking forward to engaging in discussions with the community and investors to continue to refine this strategy. Token equity remains the most immediate source of funding. As of today, Maker owns 84k MKR in the treasury. We could sell a portion of this under a multi-year vesting. The current context shows a significant interest in Crypto from large Growth VCs, non-native crypto funds. Terra for example has closed multiple deals in the past few months for 1B USD. Ultimately, decisions on the capital raise shouldn’t be entirely focused on minimizing cost, but also aiming at improving the engagement of investors and borrowers with the protocol, benefiting the ecosystem as a whole. This can be done in several ways but we are not discussing this in the post.  4. Growing the Protocol Must Be the Priority. The effort to define new tokenmics of Maker, given the market dynamics and competitive landscape, will have to be done in parallel to the increase of the SS. This effort is independent from the purpose of the increase of SS which is supporting the protocol’s growth and taking on additional risks.  What are Our Key Next Steps?  Gather feedback from the community and reiterate our plan. Define desired capital sources and fund raising mechanisms. Indicate a desired mix among those capital sources and related timing. Define an actionable work plan to achieve the key objectives - the plan would also include a “walk away” clause in case discussions won’t have a satisfactory result. Share the work plan with the community. Set up weekly Steering Committee calls to share progress, make decisions and mitigate risks, as well as community update processes. Develop the technical roadmap to implement the fund raising mechanisms. Engage discussions with financial partners interested to buy MKR (permissioned). Refine and finalize the fund raising mechanisms based on feedback from investors. Negotiate investment terms with financial partners. Go live!  ",
                    "links": [
                        "https://forum.makerdao.com/t/against-the-burn/13412",
                        "https://medium.com/block-analitica/maker-capital-at-risk-model-methodology-2423b0c5913c",
                        "https://twitter.com/terra_money/status/1496162889085902856",
                        "https://forum.makerdao.com/t/charting-a-path-for-rwas-the-case-for-continuity/14519",
                        "https://forum.makerdao.com/t/una-estrella-del-norte-dai-como-un-destino-traduccion/16326",
                        "https://forum.makerdao.com/t/discussion-capital-raise/15448/32",
                        "https://forum.makerdao.com/t/dsskiln-a-permissionless-token-purchasing-tool/14943/11",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-abril-02-de-mayo-de-2022/14970",
                        "https://forum.makerdao.com/t/weekly-relay-april-26-may-2-2022/14939",
                        "https://forum.makerdao.com/t/forum-at-a-glance-april-21-27-2022/14839",
                        "https://forum.makerdao.com/t/a-north-star-dai-as-the-destination/14838",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://forum.makerdao.com/t/is-maker-protocol-running-deficit/14741/3",
                        "https://forum.makerdao.com/t/mip55c3-sp4-adding-a-special-purpose-fund-makershire-hathaway/14643",
                        "https://forum.makerdao.com/t/prioritization-framework-sentiment-polling/15554"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541805804758107
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "6",
                    "time": "07/04/2022-20:48:52",
                    "content": "    Youss:  Define desired capital sources and fund raising mechanisms   I like the idea of adding debt tranches to the surplus buffer (see Aggressive Growth Strategy). This is a modest amount of smart contract development, will introduce a new product to sell to the public, does not dilute MKR, and will showcase novel tokenomics. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.563311688311688
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#3",
                    "likes": "5",
                    "time": "09/04/2022-08:35:22",
                    "content": "I would like to chime in to support this strategy, as a small MKR holder who tries to stay on top of Maker’s various developments, plans and proposals. I’m surprised not to see more engagement with this proposal (perhaps the original post gathered most of those interested). One thing that I especially like about this proposal is that urgently growing the SS seems compatible with the plethora of other ideas to grow the protocol - in other words, it is not mutually exclusive with other strategies Maker might implement now or in the future (other than burning MKR). @Youss made the point that growing the SS can be done parallel to the effort to define new tokenomics. That also seems to apply to discussions around RWA procedures, Wormhole, L2, the clean money vision, metaDAOs, etc. Maker is a cautious protocol, and not without reason. However, it seems to me that we should proactively push forward with exactly this kind of proposal, which both:  Improves the protocol’s ability to take advantage of existing and future growth opportunities, and Expands our capacity to execute on whatever other strategies achieve consensus (while maintaining flexibility to iterate and develop these in parallel).  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.565876152832675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#4",
                    "likes": "4",
                    "time": "11/04/2022-15:43:06",
                    "content": "Thank you for the in-depth action plan for aggressive growth. As we’ve recently seen on the forum, there has been much focus on priorities. For this robust plan with three focus areas, I recommend prioritizing L2s because that’s the lowest-hanging fruit for quickly invigorating growth. Specifically:     Youss:  Currently 90% of existing Vaults are owned by retail investors (which minted less than 1M DAI) and 70% of existing Vaults are minting less than 100K DAI. Yet, the transaction fee levels currently observed and the fact that a new Vault requires at least 15k DAI debt (i.e. dust limit set to 15k) have been reducing attractiveness for retail investors. The opportunity cost of not expanding rapidly and in size into other chains might cost Maker its leadership position.   I agree that the opportunity cost here is high. Is the plan that we will develop and deploy L2 Maker vaults once the Maker Wormhole bridges are complete? According to the above, this seems like the next logical step so that users can affordably use Maker’s vaults. I’m sure this is easier said than done, but I look at other protocols like Aave, who have been quick to deploy to L2s and alt L1s. Plus, it’s clear that there is demand for multichain Maker with DAI near 1B in AVAX as an example. For the “Key Next Steps,” I would like to see costs and timelines related to prioritizing Lever 3 - Multi-Chain Expansion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.297853535353535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#5",
                    "likes": "12",
                    "time": "11/04/2022-21:29:30",
                    "content": "Hi MightyOx, you are correct, following the Maker Wormhole deployment - and the ability to facilitate Fast Withdrawals - the next step in this space is indeed to work towards deploying MCD vaults on L2. At the risk of diverting this thread into the L2 world for a moment, allow me to answer some of your questions with a quick summary (a more complete forum post will be made soon as we nail down all the details): Firstly, the outstanding work for wormhole includes:  Contract verification on Rinkeby (for Arbitrum) Monitoring Infrastructure to support alerting Keeper support for L2 functions Complete Formal Verification specifications Merge final integration tests Frontend SDKs (not a blocker for deployment)  Summary: we’re weeks away from this being ready! So, turning to the next milestone: MCD on L2…This initiative is significantly more difficult and riskier that Aave expanding to L2 because with it, Maker is bringing the ability to mint canonical DAI and move it across domains - this needs to be done in concert with the L1 infrastructure to correctly interact with liquidations, debt/surplus, and other complex parts of the existing ecosystem. At a high level, this includes:  Defining L1 modules that need to be replicated to exist in an L2 domain Redefining L1 modules to account for surplus and debt in an L2 domain Defining L2 behaviours wrt Emergency Shutdown, liquidations and overall debt/surplus conditions. Formal Verification, Testing and audits  A lot of thought has been put into these above items and the team is already working on them as a priority. I’m holding a meeting later this week to add more tangible planning metrics/timelines and in the coming weeks expect to publish a post on what the breakdown of work for launching MCD on L2 looks like. All in all, that was a long winded way to say that Multi-chain expansion is definitely a priority and I hope to have a more granular breakdown in the coming weeks to better answer your above question. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.604218106995885
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Youss",
                    "index": "#6",
                    "likes": "2",
                    "time": "11/04/2022-22:35:02",
                    "content": "Thanks @MightyOx for your comment. As Derek explained, the PE team is working primarily on the Multi-Chain Expansion with the collaboration of other CUs.     MightyOx:  For the “Key Next Steps,” I would like to see costs and timelines related to prioritizing Lever 3 - Multi-Chain Expansion.   To clarify, the focus of this post is about strengthening Maker’s resilience to support its Second Growth Engine, i.e. achieving the right level of SS so that MakerDao can accelerate its growth without putting the protocol at risk. The development of the Second Growth Engine itself is ongoing with adequate steering and monitoring. This series of posts is not intended to capture that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.54702380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#7",
                    "likes": "5",
                    "time": "13/04/2022-10:33:26",
                    "content": "As many stablecoin companies / projects aggressively fundraise for expansions, it is indeed a crucial point for the Maker protocol to secure funding for rapid expansion as well.   twitter.com    Jeremy Allaire @jerallaire  1/ NEWS: Circle today announced a new $400M funding round and new strategic partnership with BlackRock focused on USDC.  This is a huge milestone on the road towards mainstream adoption of digital currency.  More below (link and thread). circle.com/en/pressroom/c…   12:52 PM - 12 Apr 2022           940                220            ",
                    "links": [
                        "https://twitter.com/jerallaire/status/1513862551058190344?t=6iTnehjFOrPTBYZDZVN_vQ&s=19",
                        "https://twitter.com/jerallaire/status/1513862551058190344?t=6iTnehjFOrPTBYZDZVN_vQ&s=19",
                        "https://www.circle.com/en/pressroom/circle-announces-400m-funding-round",
                        "https://twitter.com/jerallaire/status/1513862551058190344?t=6iTnehjFOrPTBYZDZVN_vQ&s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.040404040404041
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#8",
                    "likes": "1",
                    "time": "13/04/2022-11:11:35",
                    "content": "Thanks for this link! I need to get into this later. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#9",
                    "likes": "0",
                    "time": "21/04/2022-14:09:52",
                    "content": "As some of you know, I like to spend my sleepless nights on my dirtroads.substack.com. This week’s issue was dedicated to our capital planning and raising strategy. I am posting the article here given its relevance for Maker Growth Strategy. LFG!    dirtroads.substack.com    # 37 | Capital Structures for Stablecoin Protocols: the Revenge of the Sith MakerDAO Is Gearing Up for One of the Largest Fund Raising Efforts in DeFi History      ",
                    "links": [
                        "https://dirtroads.substack.com/p/-37-capital-structures-for-stablecoin?r=k87cd&s=w&utm_campaign=post&utm_medium=web",
                        "https://dirtroads.substack.com/p/-37-capital-structures-for-stablecoin?r=k87cd&s=w&utm_campaign=post&utm_medium=web"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#10",
                    "likes": "0",
                    "time": "21/04/2022-15:32:38",
                    "content": "Good read and nice to hear about your background. One thought I have - while I understand why the system surplus can be equated to a traditional bank’s capital requirements, I think we should also recognize there are a lot of differences between bank loans and crypto collateralized loans.  True, right now there are execution risks and liquidity risks because the system is not efficient.  But as we evolve, the software becomes more robust (ie. liq 2.0), the network gets faster (ie. eth upgrades), the market matures and at some point we should not be comparing crypto collateralized loans to traditional bank loans.  We should be able to lower our liquidation ratios and not need as much surplus because the liquidity of a mature and efficient crypto market is incomparably better than those assets backing bank loans (selling eth should be much easier/faster than selling real estate). Anyway, my main point is that we should recognize crypto backed loans as a new class that requires its own thought as to what is really necessary in terms of liquidation ratios and surplus requirements.  However, as we move into RWA, we do find ourselves much more in line with traditional banking and in that area, we should look closely at how things have traditionally been done to reduce risk. So honestly, I’m not panicking over that 2% ratio because we have over 2 billion dai backed by Eth that wouldn’t lose any money unless the market dropped by at least 25% before it could be liquidated.  Execution risk is of course ever present but in the crypto world, that is an existential risk no matter what surplus you have.  It’s not clear to me how much a larger surplus mitigates execution risk.  And actually, the first aggressive growth strategy post does seem to make a general distinction between low risk crypto backed loans and high risk RWA backed loans so I don’t think I’m the only one thinking this way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.862700740120095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Naren_Ramachandran",
                    "index": "#11",
                    "likes": "4",
                    "time": "21/04/2022-15:32:59",
                    "content": "There are a number of reasons why debt financing works out to be cheap source of leverage for a traditional real world financial institution (bank). This includes, among others: (a) Too big to fail guarantee from Governments (b) Liquidity provision by central banks as lenders of last resort during stress (banks fail mostly due to liquidity shortfalls, and sometimes due to capital shortfalls) None of these reasons apply for MKR. If there is stress, given the low level of SS and absence of liquidity backstops, the debt holders (whether hybrid or straight debt) will take the loss. In fact, why would such an arbitrage be able to exist? If you are selling hybrid bonds at 10%, and this is considered very low cost of capital vs cost of MKR tokens (Cost of Equity), why would I not rather buy MKR tokens because (a) in the absence of stress, MKR should gain (b) if there is stress, I’m not protected being a debt holder (vs the traditional banks which benefit from guarantees) The $400m investment in Circle is equity investment, I believe, not debt. Even traditional banks, resort to raising equity when they are deemed undercapitalised by the market / regulators. How many deeply discounted rights issues, at steep discounts to book values have we seen over the past decade - countless! The shareholders of these banks would have similarly come to the conclusion that debt would be cheaper, because bank shares typically trade below book value when they are deemed undercapitalised. However, that was not an option, unfortunately for them! A different way to think about dilution could be that issuance of equity (MKR) to increase SS could increase multiples (due to growth potential & increased resilience) and, consequently, increase the market capitalisation of MKR, more than offsetting the dilution that current token holders suffer.  Just like burning tokens did not increase value, there is nothing to suggest minting tokens will decrease value. It all depends on the business plan behind the minting - increasing resilience and funding growth could well be a good story. Of course, the market is hot and there may be a lot of capital to rush in irrespective of where they sit in capital structure and, if that be the case, the aforementioned points may be moot! ps: I have no educated view on if the current SS is adequate or not. I’m taking the authors’ view that SS is very low at the moment taking the risk into account and to fund future growth. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.998983739837398
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#12",
                    "likes": "4",
                    "time": "21/04/2022-16:31:28",
                    "content": "Thank you for your comments @Traster_Tray and @Naren_Ramachandran - being an open piece to stimulate conversations on the fund raising topic, I will try to answer your points as good as I can.     Traster_Tray:  I think we should also recognize there are a lot of differences between bank loans and crypto collateralized loans   Absolutely, and nobody is foolish enough to equate them. As things stand today, the tokens that Maker accepts as collateral are very liquid, with great price discovery, and large in market cap. The collateralisation ratio as well is extremely conservative. I, too, sleep well at night with a 2% surplus buffer ratio. The over-reliance on $USDC keeps me a bit more awake, but this is something we all know about and that we are all doing our best to improve. This is why nobody is advocating for a 10-15% SS ratio over risky loans. In addition, and consistent with the Maker Growth Strategy, the spirit of the article is to describe what type of reasoning we should employ when we think about raising additional fund to explore new avenues for growth. Many of them come with additional risks that we would be able to digest only with a larger surplus buffer. Moving to sources of back-up capital I must say I disagree with @Naren_Ramachandran, but probably due to the fact that the peculiarities of crypto markets are not evident to everyone in trad fi. There is high demand for stable-based high-yielding deposit strategy. Anchor has been paying depositors 20% and growing massively thanks to the attractiveness of the model. Yes, more sophisticated investors are understanding that maybe depositors are absorbing a lot of volatility and buying $LUNA would have been a better risk-adjusted play, but this is not stopping Anchor’s growth. Simply, there is significant demand for fixed-rate deposits denominated in pegged stables. The article is not advocating for hybrid instruments, but rather showing that there are several sources of capital that can be explored. The like-for-like for trad banking issuances is also irrelevant here. DeFi’s institutional equity capital is VC-centred, where VCs have a cost of capital maybe as high as 40%. We can argue that the market is not efficient to price the dilution, but acting based on assumptions of inefficiency doesn’t seem like a smart thing to do - or rather something better suited for a hedge fund than a stablecoin protocol. The comparison with Circle is not relevant I think, as Circle is an infrastructure play on top of a money market fund, not an issuer of native stablecoins. Success stories among stablecoin solve also the demand side of the equation. $DAI demand needs to be incentivised if we want to expand the $DAI footprint. And as we have seen from Terra’s recent move on the 4pool, stablecoin minters value highly demand expansion. Giving $DAI holders the possibility to deposit at fixed / higher yield is something we should investigate. Sure, $DAI holders already have this option through money market protocols such as Aave and Compound, but there is no reason why Maker couldn’t incorporate his own money market, or hybrid money market, in support of the stability of DAI. In addition, as Anchor, FEI<>Rari, and even Olympus have taught us, stablecoin vertical integration into fixed-yielding deposits has several benefit of stickiness and use case expansion. Thanks again for your comments, @hexonaut - PE, @Nadia - Growth, @Aes - SF, and the many other community members are exploring opportunities holistically to sustain the evolution of $DAI. Looking forward to everybody’s comments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.110862507058159
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Naren_Ramachandran",
                    "index": "#13",
                    "likes": "1",
                    "time": "22/04/2022-11:07:42",
                    "content": "Thank you for your response and comments Luca! Best wishes for next steps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#14",
                    "likes": "2",
                    "time": "22/04/2022-11:15:23",
                    "content": "Looking forward to see you on forum commenting and suggesting new ways of looking at things  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#15",
                    "likes": "2",
                    "time": "04/05/2022-16:57:01",
                    "content": "Why not use the future revenues of Maker to repay a bond? A revenue share financing where the bond is paid 25 cents of every dollar earned by Maker. As revenue grows, the bond is paid off faster thereby aligning everyone’s interest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#16",
                    "likes": "0",
                    "time": "04/05/2022-20:15:51",
                    "content": "Thanks! Not even, we are a crypto-bank rather than a corporate, we print DAI and don’t even need to wait for cash flows to come in to repay. I personally believe that developing yield-bearing solutions/ vaults could be an incredibly attractive frontier for MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/eka",
                    "index": "#17",
                    "likes": "4",
                    "time": "04/05/2022-20:17:06",
                    "content": "A few thoughts: -MKR Minting vs System Surplus: I’m not convinced that minting MKR is all that much more capital efficient than a reasonably managed Surplus. The trading price of MKR should incorporate the risk that it will be diluted during stressful times, so the less likely that is to happen (more surplus), the less it should be depressed. On the flip side, although I agree increased treasury management complexity is a ‘con’ with a larger surplus system, Maker should view managing the balance sheet/SS as part of the business. Even without disproportionately growing the SS, if the protocol grows so will the SS, and at some point it’s going to be the wrong answer to sit on capital. Better to start developing best practices for Maker earlier. -Institutional Vaults: The comments so far seemed to focus more on the multi-chain expansion, which I would agree is very important from a diversification and growth perspective. That being said I think the institutional vaults could play into Maker’s strengths and reputation for being more conservative and thoughtful around security and risk. Vault concentration is an important consideration, but maybe a worthwhile risk from the perspective of adopting an ‘ambitious and bold growth plan’. Further, large institutional and quasi-institutional demand for vaults may be more attracted to Maker’s track record and approach to risk (a big strength) whereas retail investors are clearly much more focused on maximizing yield (not Maker’s strength), vs optimizing yield and risk. -RWA - RWA could perhaps be the most important long-term development for Maker and for the space more broadly, but I’m skeptical around whether the initiative belongs in a plan focused on acting now to generate growth. The TAM is massive, it would be a massive point of differentiation for Maker, but the work to get to scale is massive too. Properly developing relationships with borrowers of scale takes time, legal frameworks will take time, underwriting real-world collateral and being a competitive source of funding will take time, etc, etc. I’m 100% behind doing it, just not convinced that’s as much of a near- or medium-term way for Maker to grow as compared to IVs and Multi-Chain Expansion. -Pref Equity Funding: could be considered as a way to balance the cost of capital with necessary incentives for capital providers. The structure could include parameters around callability and/or convertibility that would result in an obligation that feels more like debt from a cashflow perspective, provide some protection to Maker from having sold equity too cheaply, and still allow a capital provider to experience some level of equity upside. -MKR Burn: Finally, I agree with the thought around burning MKR. It’s effectively a share buyback, and growth companies don’t buy back their shares because they have higher return opportunities. I actually think having had the burn and then stopping it can be seen as a positive, “We stopped the burn because we are growing and have much better uses for the capital, but we know the burn works and once the company has fully matured many years from now, we have a proven mechanism to return any excess value creation to investors.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.022405844155844
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#18",
                    "likes": "0",
                    "time": "04/05/2022-20:36:59",
                    "content": "Can MKR credily commit to such payments or can a MkR vote simply annul them? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#19",
                    "likes": "0",
                    "time": "02/08/2022-20:37:21",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}