{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/jun8-22-post-mortem-for-irv-poll-issues/15671",
            "title": "[Jun8 \\xe2\\x80\\x9922] Post-Mortem for IRV poll issues ",
            "index": 15671,
            "category": [
                "Updates"
            ],
            "tags": [
                "governance-portal",
                "post-mortem",
                "dux-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#1",
                    "likes": "6",
                    "time": "08/06/2022-17:03:21",
                    "content": " Summary On June 7th 2022 @dux-core-unit team was informed about issues with voting on the two newly posted prioritization polls on the Governance Portal. Upon receiving the bug report DUX team started investigating and was able to confirm the root cause of the issue. DUX team deployed a hotfix to prevent users from submitting potentially erroneous votes while they worked on preparing & testing the fix. On June 8th around 4:30pm UTC, DUX team deployed an update to the Governance Portal which fixes the issue. Two users’ votes were affected by the issue—their votes were recorded in an inverse order. These users are able to update their vote using the Governance Portal which would correct the erroneously recorded votes. DUX team decided to refund them ETH for the gas expenses of both their erroneous and corrected votes from our testing wallet. All prior ranked choice votes are unaffected as the bug was introduced after they took place. DUX team has taken measures to prevent similar bugs from occurring in the future.  Background On June 7th 2022 at 2:02am UTC time a community member on the MakerDAO Discord flagged an issue with voting on the newly posted prioritization polls, found on the Governance Portal. Users that submitted multiple vote options to these polls would see their ranked vote options recorded in an inverse order. After confirming the issue, @prose11 of @GovAlpha-Core-Unit reached out to DUX team at 11:10am UTC time later that day, upon which we started investigating the issue. We were able to easily reproduce the bug and started a root-cause analysis. We closed in on multiple potential causes and were able to confirm the exact cause a few hours after starting the investigation. All prior ranked choice votes are unaffected as the bug was introduced after they took place. We also confirmed that two users were affected by this bug—their ranked choice votes were recorded erroneously.  Detailed Analysis The bug was related to how the Governance Portal stores IRV (ranked choice) votes through the ballot function. The process of converting ranked choice vote options to a valid uint256 expected by the smart contract involves first converting the options into a byte array, with vote option preference moving from right to left. So the first choice is slotted in the final (rightmost) index of the array. The second choice in the second-to-last index, and so on for all the options. Earlier this year we removed reliance on the dai.js helper library from the app, and ported over the relevant code. During that time we missed a key element of the ranked choice vote processing which is to sort the option preferences from right to left as described above. This resulted the inversion of the preferred options selected by a user.  Mitigation Steps Since deciding on the most efficient fix and performing the necessary testing before deploying the fix would require some time, DUX team made the decision to deploy a hotfix to prevent users from submitting potentially erroneous votes on the affected polls(poll ID 814 & 815). After deploying the hotfix DUX team took time to determine the most efficient fix, implement it, and perform thoroughly testing. Meanwhile DUX team has been in close contact with @prose11 who informed the community of the ongoing issues. Today on June 8th around 4:30pm UTC we deployed an update to the Governance Portal which fixes the issue. We have taken steps to improve our QA setup to account for this scenario, which would prevent similar issues from occurring in the future. DUX team apologies for the inconveniences caused. DUX team and @GovAlpha-Core-Unit discussed mitigation steps besides fixing the bug. We decided to refund the affected two users the ETH gas expenses for both their erroneously recorded vote and an update vote transaction, hoping this will provide an incentive to update their erroneous vote. We will send them the funds manually from the DUX Ethereum mainnet testing wallet. ",
                    "links": [
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-06-10/15738",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-02-08-2022/15703",
                        "https://forum.makerdao.com/t/governance-and-risk-194-thursday-june-09-at-17-00-utc/15664/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3001811114056006
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#2",
                    "likes": "5",
                    "time": "08/06/2022-17:04:16",
                    "content": "The affected polls are now fully functional once again. https://vote.makerdao.com/polling/QmYqBhDx https://vote.makerdao.com/polling/QmdZezCr ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmdZezCr"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/06/2022-17:05:02",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}