{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/please-re-delegate-the-new-flip-flop-flap-delegate-contract/16624",
            "title": "[Please Re-Delegate] The New Flip Flop Flap Delegate Contract ",
            "index": 16624,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "delegate-contract",
                "renewal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "7",
                    "time": "15/07/2022-13:39:30",
                    "content": " Renewal of Flip Flop Flap Delegate Contract – July 2002 Motivation Its been a year since the Flip Flop Flap Delegate Platform was born, and as we kickoff our 2nd year of being a MakerDAO Recognized Delegate, I am now more than ever excited to continue the Journey in representing MKR token owners in our mission to help this DAO reach infinite scale. Over the last 12-months we have grown and learn a lot about true decentralization. I am very proud that this DAO is recognized throughout the World as the only DAO pushing and moving obstacles in seeking true decentralization. I get goosebumps whenever I hear ecosystem participants pay compliments to MakerDAO’s leadership in becoming a fully Decentralized Autonomous Organization. We should All be very proud. Because together as one, we have made it happen. And nobody can take that away from us. I now ask All Flip Flop Flap Delegate, Delegators to continue to support our mission and please Re-Delegate to the new 3F Delegate Contract. New Contract 0x0f4Be9f208C552A6b04d9A1222F385785f95beAA https://vote.makerdao.com/address/0x0f4be9f208c552a6b04d9a1222f385785f95beaa#delegate-credentials  image1920×434 48.9 KB  Final Thoughts And finally I like to say thank you  to the MKR Delegators who have supported Flip Flop Flap Delegate throughout the first journey. Thank you for allowing 3F Delegate to Govern freely without every lobbying the platform. It’s been a pleasure serving you, and I look forward to continuing to be a servant of MakerDAO. ",
                    "links": [
                        "https://forum.makerdao.com/t/announcement-delegate-migration/16603/4"
                    ],
                    "GPT-summary": "The author of the post is explaining the Flip Flop Flap Delegate Contract and asking for support from delegators to renew the contract. The post also expresses gratitude towards the MKR Delegators who have supported the Flip Flop Flap Delegate throughout the first journey.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.171022727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#2",
                    "likes": "2",
                    "time": "16/07/2022-05:11:37",
                    "content": "Let’s keep working hard and smart so that we keep the baton and Maker can reach its full potential, because Maker still has a long way to go, this is just the beginning. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.222619047619047
                }
            ]
        }
    ]
}