{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-pragmatic-party-for-scientific-governance/15838",
            "title": "The Pragmatic Party - For scientific governance ",
            "index": 15838,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "strategy"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "21",
                    "time": "16/06/2022-12:29:29",
                    "content": "Just for the sake of governance discussion and being able to direct people to my personal mental model for MakerDAO, here is my platform. I will change my mind from times to times. Doesn’t reflect the view of Strategic Finance. It’s just the meta-platform you need to support if you want MKR to the moon. If you prefer convoluted stuff, you should support the endgame party. My overall mental model can be found on my Crypto Banking Blog North Star: Increasing Equity per MKR Why: MakerDAO is a financial protocol that make profit by the difference of financial revenues (Stability Fees on lending) and what we pay, financial expenses (DSR). Those organizations are valued between 0.5x and 2x the equity (see here). Therefore, from a strategical perspective, increasing this metric increase the price of MKR. That’s the game we are playing. One business: Balance sheet allocation Why: Simplicity is key. We should just find cheap funding (like DAI) and allocate wisely and programmatically. No need to do complex stuff or exotic investments. We should do three things: investing in liquid token (tokenized public markets, probably ETH, …), repo (lending) against those liquid tokens and market making. It is 3 products (PSM-style, vaults, and a LP manager) that work with ERC20. There is some work to be done on liability management as well, but nothing rocket science. It’s market-based finance, faceless finance. No relationship, custom deals or relationships. Sacred MKR rights: Burning 2% of the equity every year Why: Increasing equity is the goal but such provision provide some stability in price. The premium/discount over the equity value is mainly due to market trusting or not the management. We should be able to grow equity by 10-20% per year so 2% is just a bit. Cost control: Workforce expenses capped to 50% of recurring revenues Why: North Star and Sacred MKR rights come first. I’ve never saw a correlation between spending and growth for financials organizations The backstop: Burning only mode when MKR price < 90% equity Why: This is relutive and sound management. Only reason it is not done in TradFi is because almost no management wants to manage a smaller and smaller business. Not that it applies to MakerDAO currently (equity $92 while market price 10x higher).  That’s it, quite short and simple yet opiniated. I will allocate my vesting to delegates that are close to implementing this strategy, if any, going forward. You can signup below. I’m not asking you to bow, just to have a brain and have courage. Warriors of the world, let’s unite. ",
                    "links": [
                        "https://cryptobanking.network/",
                        "https://www.macrotrends.net/stocks/charts/FISI/financial-institutions/price-book",
                        "https://www.youtube.com/watch?v=wA4BBJh_t9M",
                        "https://www.youtube.com/watch?v=wA4BBJh_t9M",
                        "https://forum.makerdao.com/t/registro-de-delegados-de-gobernanza-cientifica-orientados-a-los-negocios-traduccion/15908",
                        "https://forum.makerdao.com/t/signal-request-deploy-a-trial-permissionless-open-market-operation-resurrect-the-burn/15381/38",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-16-22-2022/15999",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-junio-del-2022/16062",
                        "https://forum.makerdao.com/t/dao-resilience-improvement-initiative-status-update/16413",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-16-22-de-junio-del-2022/16204",
                        "https://forum.makerdao.com/t/viridian-cluster-introduction/18332/10",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/46",
                        "https://forum.makerdao.com/t/weekly-relay-june-14-20-2022/15950",
                        "https://forum.makerdao.com/t/recognized-endgame-delegates-donde-esta-latam/15909",
                        "https://forum.makerdao.com/t/kickoff-governance-from-first-principles-building-a-resilient-decentralized-and-uncensorable-stablecoin/15978",
                        "https://forum.makerdao.com/t/governance-and-risk-196-thursday-june-23-at-17-00-utc/15998/3"
                    ],
                    "GPT-summary": "The author presents their personal mental model for MakerDAO, which they believe will increase the price of MKR. They suggest investing in liquid tokens, repo against those liquid tokens, and market making. They also propose burning 2% of the equity every year and capping workforce expenses to 50% of recurring revenues. The author is not asking for feedback but is allocating their vesting to delegates that are close to implementing this strategy.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.4625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#2",
                    "likes": "4",
                    "time": "16/06/2022-14:06:26",
                    "content": "    SebVentures:  Cost control: Workforce expenses capped to 50% of recurring revenues Why: North Star and Sacred MKR rights come first. I’ve never saw a correlation between spending and growth for financials organizations   If Maker wants to reliably beat TradFi at the lending game, it should be able to sustain 10/100/1000x as many loans as today without a corresponding increase in expenses. This should naturally bring the % of revenues spent on the workforce down. But I’m not sure you achieve this with a fixed % cap in the event of dramatic balance sheet expansion in an upswing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.141414141414141
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "1",
                    "time": "17/06/2022-08:05:49",
                    "content": "The 50% ratio doesn’t make much sense but is based on the Cost to Income ratio of bank which is historically around 60% (people are happy at 60%). Less regulation and more automation should put us at a better situation. We should be able to be better at scale, but human nature is human nature.  image1157×530 38.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "6",
                    "time": "20/06/2022-20:28:04",
                    "content": "The best political metaparty is now the first one with an actual business plan. And folks, it is for greatness:  >$100M of annual recurring profits end of 2023 A bond centric strategy Only a 5% CU expenses cut to be within the 50% revenues cap. You still get multichain, parties and what not. 1.3% on the DSR because DAI holders need to be rewarded (to increase DAI adoption and supercharge growth). $17M of MKR burn in 2023 A 160M Surplus Buffer end of 2023 (x2) without any capital raise and without going more risky  And all that assuming a bear market and current interest rates. That should be the benchmark every other proposal are benchmarked with. ",
                    "links": [
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/46"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.902777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#5",
                    "likes": "4",
                    "time": "20/06/2022-21:44:48",
                    "content": "Looks like a solid plan - invest PSMs in bonds, then drive DAI growth with the DSR and make more money as DAI supply increases.  Biggest wildcard to me is what DSR would have to be to actually get that growth because DSR gets more expensive as supply goes up.  I think you set it to be equal to the tbill rate which should be higher than what retail savings accounts give but if the DSR needs to be higher to get growth, then you won’t make nearly as much.  I would love to just get to the point where we could experiment and see how the DSR actually affects demand for DAI.  That’s when we can actually start talking about marketing and brand making a difference. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#6",
                    "likes": "1",
                    "time": "20/06/2022-22:00:23",
                    "content": "    Traster_Tray:  I would love to just get to the point where we could experiment and see how the DSR actually affects demand for DAI.   Same, the work we are doing on bonds will eventually need to pass to our holders. It is a prime opportunity to understand the preferences of DAI holders. Managing our rates will be crucial to get good reads. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#7",
                    "likes": "6",
                    "time": "20/06/2022-22:09:13",
                    "content": "This looks really great. I’ll need to look at it in more detail but I think this looks compatible with the endgame plan where it could play the role as the Maker Core, in particular in the Rai+ outcome but also with some modifications as the Maker Core in the MetaDAO paradigm outcome. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.444444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#8",
                    "likes": "1",
                    "time": "21/06/2022-09:08:18",
                    "content": "It might be in the sense that a business outcome isn’t necessarily tied to a particular governance overlay. The open question is what governance overlay is best suited to enabling a particular business outcome. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#9",
                    "likes": "0",
                    "time": "21/06/2022-13:28:34",
                    "content": "not a joke not sarcastic how onboarding FEI fits into “scientific business governance” You see FEI fully rugged on Rari… that is on top of the retail they rugged Day 1…. Shame ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bri174",
                    "index": "#10",
                    "likes": "1",
                    "time": "21/06/2022-14:45:29",
                    "content": "FEI rugged Rari? How so? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "12",
                    "time": "24/06/2022-14:27:31",
                    "content": "As people are getting crazy with redesigning governance, the cryptobanking party provides a simple and effective solution.  No more gov poll with micromanagement All goes to the exec straight as decided by mandated actors, (voted by MKR holders/delegates) MKR holder appoint/remove board members, usually proposed by the board The board appoint/remove the mandated actors with a majority vote The mandated actors fill the weekly executive with review from the board When very unhappy, MKR holder can change everything.  It’s called he dual board system but with full control by the tokenholders so it is safe, transparent and decentralized. There will be plenty of shadowy secret meetings between all parties, some crazy political fight and power struggles. Welcome to the real life. You can read The Bank That Lived a Little to see how regulated governance is doing. Regulators can put all mandated actors and board members in jail, doesn’t impact the protocol. But if we, as MKR holders, are so bad that we elect only crooks as board members, every time, I mean maybe we should just fold the business. ",
                    "links": [
                        "https://www.amazon.fr/Bank-That-Lived-Little-Barclays/dp/0141987537/",
                        "https://forum.makerdao.com/t/simple-makerdao-governance-from-first-principles/16207/46"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#14",
                    "likes": "2",
                    "time": "24/06/2022-14:45:06",
                    "content": "So, just want to clarify your platform…. You simply intend to turn Maker into a corporation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#15",
                    "likes": "0",
                    "time": "24/06/2022-15:42:25",
                    "content": "    rune:  it could play the role as the Maker Core   This core should be denominated in cash surrender value. If TradFi already lends on this collateral why shouldn’t Maker? And the interest rates would be much higher than a T-Bill. Also, it can be used as an employee retention program that actually enables off-balance sheet leverage. On an overcollateralized basis. I have already found a third-party lender, The Bancorp, and a fintech KAPED credit that issues secured business credit cards with crypto cash back rewards. Imagine being able to yield farm cash value and MKR with your cash back rewards. Banks already use the cash value as a deposit and rehypothecate it. This would raise the DSR to a sustainable level that can expand. As more DeFi users borrow, more loans are issued to RWAs and as those RWAs grow, so too does the DSR which leads to a positive feedback loop.   Screen Shot 2022-06-24 at 6.55.20 AM826×552 65.1 KB   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.235795454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#16",
                    "likes": "8",
                    "time": "24/06/2022-16:17:18",
                    "content": "    MadShills:  You simply intend to turn Maker into a corporation?   Well corporation are usually regulated. But to your point, MakerDAO is a cryptobank, which is a non-regulated financial institution, so being close to a corporation is probably fine. I let you guys reinvent modern capitalism but until you come with a solution, I don’t see how creating a mess align with the north star here defined as increasing equity per MKR. What I suggest completely allows to upgrade to the new system when ready. A founder led startup is also an option, but we are not heading there neither (for legal or ideological reasons doesn’t matter). We are governed by our MIPs and I will defend them as long as they stay. But it’s time to change them. Or we can keep them. Whatever MKR holders want really. Let’s just decide so we can build. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.407512626262626
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#17",
                    "likes": "0",
                    "time": "24/06/2022-16:59:09",
                    "content": "    SebVentures:  A founder led startup is also an option,   Can you expand on this sentiment? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#18",
                    "likes": "3",
                    "time": "25/06/2022-01:53:01",
                    "content": "So, why don’t we just set up a company in Delaware, call it “Maker, Inc.” and the mandated actors can run it for MKR holders who receive an annual dividend based on Maker, Inc.'s performance? No need to recreate the wheel or call what’s proposed by a different name. FWIW, I’m indifferent about whether you all decide to do that, so long as my MKR position improves perhaps its better. But that is a perilous road to travel. Beware. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#19",
                    "likes": "2",
                    "time": "25/06/2022-10:08:17",
                    "content": "A regular company implies a delegation of effective power to some people. There is no delegation here. Only MKR holders can do real stuff. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#20",
                    "likes": "6",
                    "time": "06/07/2022-05:39:48",
                    "content": "The cryptobank thinktank have published The Crypto Banking System, a paper on how DeFi can replace TradFi and a roadmap on how to get there.  image1083×471 9.59 KB  Regarding MakerDAO, it proposes a very simple business model, which is one of maturity transformation. The articles lays how to get to the point where long-term assets (which are mainly RWA, but Notional or Yield bonds could work as well, but at a lower scale) are very liquid and standardized. Short-term investments being D3M Aave and the current crypto loans. In MetaDAO parlance, it is like RAI+ but ERC-20+ (all we really need is a PSM with an Oracle) and you don’t have a MetaDAOs but just an free market where some actors are providing a better product that you use. The whole job of governance would then to set the risk parameters of a ALM smart contract. Governance-minimized MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party advertising proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.044973544973545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#21",
                    "likes": "3",
                    "time": "02/10/2022-14:43:36",
                    "content": "I wrote two articles about stablecoins and currencies:  Stablecoins being credit or currencies Stablecoins and currency boards  This work lead me to believe that there is a great business opportunity with one motto short-term stability but long-term flexibility against US$. In the currency vs credit poll, most were in the view of DAI being a currency (or should become one). If you have some doubts about the US$ future (which I have), you might use it as unit of account (tight peg) but with the ability to keep the store of value feature should the US$ fade away (and therefore change the unit of account in the future). Such positioning should help getting traction (not saying easy). And you don’t sacrifice much as nothing would change for years/decades anyway (except you no longer try to get DAI in fungible with other stablecoins at crypto-exchanges, it is no longer a stablecoin but a cryptocurrency). It would help the world migrate seamlessly from US$ to ETH (assuming ETH wins). More technical details are in the end of the second article.  image1050×722 17.9 KB  Such a path is also compatible with the ALM forecast published earlier this summer. It don’t think much technical work would be needed, it’s more branding, marketing and ecosystem building. ",
                    "links": [
                        "https://cryptobanking.network/stablecoins-and-currency-boards/",
                        "https://forum.makerdao.com/t/informal-poll-is-dai-credit-or-a-currency/17624",
                        "https://forum.makerdao.com/t/makerdao-alm-forecast/16881"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.841600529100529
                }
            ]
        }
    ]
}