{
    "poll_list": [
        {
            "title": "Offloading TUSD-A - February 7, 2022",
            "index": "12814",
            "option": "Activate liquidations",
            "supporting_mkr": "40,055",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-offloading-tusd-a/12814",
            "title": "[Signal Request] Offloading TUSD-A ",
            "index": 12814,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "tusd",
                "sig-status-accepted",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "3",
                    "time": "24/01/2022-15:49:50",
                    "content": " Summary After a discussion and a signal-request the Debt Ceiling of TUSD-A was set to 0 DAI one year ago. Since then, the DAI from TUSD-A hasn’t changed a lot - there is still about ~26MM DAI outstanding debt and even an increase of the Stability Fee to 1% hasn’t changed anything.  This Signal Request is to find out if the community wants to do something about it or just keep it as it is.  Options  TUSD-PSM with 0 Debt Ceiling One option that was already discussed one year ago was to  set up a PSM for TUSD with a Debt Ceiling of 0 pay back the outstanding debt in the TUSD-A vaults pushing the backing collateral 1:1 into this new PSM  The result would be a permissionless PSM like we already have for USDC and GUSD so anyone could swap their DAI for TUSD until the PSM is drained. As the primary motivation for us is to get rid of the TUSD, a tout of 0 would encourage arbitrageurs to make use of it.  Pros  as this will not only create effort on PECU for setting up the PSM but also for adding the code to do the liquidation into the PSM, we could make use of this code for future use like liquidating USDC-A or GUSD-A    Cons  we are just making it easier for TUSD to get removed from the protocol, but might end up in no change on the debt   Activate Liquidations TUSD-A is running with deactivated Liquidations (like most other stable-coin ilks) - most of the vaults are already undercollateralized:  If we would activate Liquidations on TUSD-A keepers could just take care of the offboarding. Keepers would probably use curve.fi for recycling the collateral - resulting in at least 80k DAI loss which would be absorbed by the System Surplus.   Pros  would just use existing mechanisms just a configuration change smart-contract wise maybe adds some effort on the keeper implementations (as TUSD is not covered yet)   Cons  would result in a bit of loss for the protocol   Which course of action shall we take for TUSD-A?     Offloading to a new TUSD-PSM with DC 0 Activate Liquidations Do nothing Abstain     0 voters     FYI @Protocol-Engineering  Next steps The Poll will run until 2022-02-03T23:00:00Z , its outcome will result in an on-chain-poll assuming the outcome of the poll deems it necessary. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-manage-tusd-exposure-due-to-ownership-change/5821",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-debt-ceiling",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://www.mkranalytics.com/vaults/USD/TUSD-A?stats=Fee%20-%20Stability%20Fee%2CDai%20Supply%20-%20Dai%20Supply%2CDai%20Supply%20-%20Debt%20Ceiling&start=1483225200&end=1643669999&granularity=Monthly",
                        "https://manual.makerdao.com/module-index/module-psm",
                        "https://manual.makerdao.com/module-index/module-psm#fee-out-tout",
                        "https://www.mkranalytics.com/vaults/USD/USDC-A",
                        "https://www.mkranalytics.com/vaults/USD/GUSD-A",
                        "https://makerburn.com/#/rundown",
                        "http://curve.fi",
                        "https://curve.fi/",
                        "https://forum.makerdao.com/t/relay-semanal-18-24-de-enero-de-2022/12876",
                        "https://forum.makerdao.com/t/attention-tusd-a-users-collateral-offboarding/13927",
                        "https://forum.makerdao.com/t/monthly-governance-review-february-2022/13661",
                        "https://forum.makerdao.com/t/proposed-parameters-for-offboarding-tusd-a/13506",
                        "https://forum.makerdao.com/t/relay-semanal-01-07-de-febrero-de-2022/13151",
                        "https://forum.makerdao.com/t/weekly-relay-february-1-7-2022/13103",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-07-de-febrero-de-2022/13118",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/32",
                        "https://forum.makerdao.com/t/monthly-governance-review-january-2022/13052",
                        "https://forum.makerdao.com/t/forum-at-a-glance-jan-27-feb-3-2022/13019",
                        "https://forum.makerdao.com/t/relay-semanal-25-al-31-de-enero-de-2022/13007",
                        "https://forum.makerdao.com/t/weekly-relay-january-25-31-2022/12953",
                        "https://forum.makerdao.com/t/forum-at-a-glance-january-20-27-2022/12887",
                        "https://forum.makerdao.com/t/forum-at-a-glance-march-10-16-2022/13977",
                        "https://forum.makerdao.com/t/weekly-relay-january-18-24-2022/12829"
                    ],
                    "GPT-summary": "The post is a signal request to the MakerDAO community regarding the TUSD-A vault, which has a debt ceiling of 0 DAI and outstanding debt of ~26MM DAI. The author proposes two options: offloading to a new TUSD-PSM with a debt ceiling of 0 or activating liquidations. The post explains the pros and cons of each option and asks the community to vote on which course of action to take. The post also provides information on the poll's timeline and next steps.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.7362440191387565
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#2",
                    "likes": "9",
                    "time": "24/01/2022-16:18:26",
                    "content": "My recommendation is to just activate liquidations for this collateral. Adding a regular PSM will very likely result in the TUSD just being moved over to the PSM and sitting there. My expectation is that TUSD will not drain until USDC and possibly even USDP drains first. The only way to get this off the books quickly with a PSM is to implement a negative fee on the PSM which will require dev time probably in excess of the 100k or so it costs to just activate the liquidations. Not to mention we are paying for the fee as well which is comparable to the loss from auctions. These are not terribly large sums of money, so I think just doing the easiest thing is probably best. Setting up a stablecoin Curve keeper won’t be too much work, and probably should exist anyways. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.688095238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "0",
                    "time": "26/01/2022-11:50:12",
                    "content": "My understanding is Engineering groups are overloaded so any option that doesn’t involve them is preferred at this point. I honestly don’t think liquidating it is the best option. I see no reason to just let this sit (which is how I voted) until we can get a back end mechanism to convert these stables into $$ that can buy other collateral (say treasuries). Is there some pressing reason to get this off the books?   BTW:   Governance itself could use DAI slated for say oracles to purchase TUSD which then buys ETH to pull this TUSD off the books (effectively liquidating underwater vaults manually at either 1:1 or some other price) and using it to buy ETH for oracles. Personally given what I am hearing about work overload it would be better to just add dealing with this to a Maker To-Do list and deal with these in order of risk, cost, and manpower to accomplish as manpower becomes available. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#4",
                    "likes": "0",
                    "time": "26/01/2022-12:34:07",
                    "content": "    MakerMan:  Is there some pressing reason to get this off the books?   not more pressing than it has been a year ago when we decided to offboard TUSD. It just did not work out the way we expected (no outflow of TUSD), instead most vaults are underwater and I don’t think this is going to change in the future if we are not doing anything about it. The recent attempt to get a TUSD-PSM in place just reminded me that we still have TUSD-A and it is not going to unwind itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.15
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafael.cosman",
                    "index": "#5",
                    "likes": "1",
                    "time": "02/02/2022-16:03:41",
                    "content": "Hey folks, Rafael from the TrustToken team here. Is there anything we can help with on the TUSD end? We of course are sorry to see TUSD offboarded and still hope we can work together in the future. Just give the word if there’s anything we can support with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "1",
                    "time": "03/02/2022-12:01:24",
                    "content": "Bumping this to encourage a bit more participation before the poll closes tomorrow. If you haven’t expressed your opinion please consider doing so! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#7",
                    "likes": "1",
                    "time": "04/02/2022-16:40:50",
                    "content": "In my view of the world, unfinished business sitting dormant for a year has a way of putting a psychic drain on everything else. I am absolutely in favor of cleaning this up and running a tight ship. Agreeing here with @hexonaut on taking the path of least resistance and not putting pressure on devs. I voted to activate liquidations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.535714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#8",
                    "likes": "3",
                    "time": "07/02/2022-12:53:46",
                    "content": "This Signal finished the off-chain poll successfully. Since there is more than one option supported by over 50% of the non-abstaining voters, it will be a Ranked Choice (IRV) vote with the following options:  Activate liquidations on TUSD-A, causing currently undercollateralized vaults to be liquidated. Offload to a new TUSD-PSM with 0 Debt Ceiling, allowing anyone to permissionlessly swap DAI for TUSD, but not allowing new minting of DAI from TUSD. Take no action at this time. Abstain.  As a reminder to everyone, but particularly the @Recognized-Delegates, during IRV votes, you should rank all choices that you would support on an executive in order of preference. Not voting for an option indicates that you would not support the change on an executive vote. The poll goes live today at 16:00 UTC, and lasts until Thursday, February 10th. ",
                    "links": [
                        "https://manual.makerdao.com/module-index/module-psm#trade-offs",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-debt-ceiling"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.487878787878788
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#9",
                    "likes": "2",
                    "time": "11/02/2022-07:05:25",
                    "content": "Quick update: the option “Activate Liquidations” got majority the onchain-poll, however this is not going to get onchain soon as we are having a little executive-break during ethDenver. Will update here as soon as something is happening. Thanks everybody for participating. ",
                    "links": [
                        "https://forum.makerdao.com/t/planned-executive-proposal-update/13149"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is updating the community on the results of an onchain-poll"
                    ],
                    "Sentiment": 5.576388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "13/03/2022-17:05:55",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "2",
                    "time": "19/04/2022-14:14:08",
                    "content": "This has been passed and is the process of being executed as part of the most recent executive vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "585"
}