{
    "poll_list": [
        {
            "title": "Ratification Poll for MKR Compensation for StarkNet Engineering Core Unit, SNE-001 (MIP40c3-SP79) - September 12, 2022",
            "index": "17042",
            "option": "Yes",
            "supporting_mkr": "65,792",
            "highest_fraction": 0.61
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp79-mkr-compensation-for-starknet-engineering-core-unit-sne-001/17042",
            "title": "MIP40c3-SP79: MKR Compensation for StarkNet Engineering Core Unit (SNE-001) ",
            "index": 17042,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "core-unit-budget",
                "mkr-compensation",
                "sne-001",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#1",
                    "likes": "0",
                    "time": "05/08/2022-18:40:42",
                    "content": " MIP40c3-SP79: MKR Compensation for StarkNet Engineering Core Unit (SNE-001)  Preamble MIP40c3-SP#: 79 Author(s): @badgerofthe9d Contributors: Tags: core-unit, sne-001, budget, mkr-budget Status: Accepter Date Applied: 2022-08-08 Date Ratified: 2022-09-26 Forum URL: https://forum.makerdao.com/t/mkr-compensation-for-secu-members/17042 Ratification Poll URL: https://vote.makerdao.com/polling/QmWX6BSA   Sentence Summary MIP40c3-SP79 adds the MKR Compensation budget for Core Unit SNE-001: Starknet Engineering Core Unit.  Paragraph Summary This proposal contains the MKR Compensation budget for the Core Unit SNE-001: Starknet Engineering Core Unit, also called SECU in this subproposal. This proposal is based on Alternative MKR Compensation Guidelines 15 and benchmarked on the Protocol Engineering Core Unit (PE-001) budget. It provides an average of 135 MKR per FTE per year over 3 years with a 1-year cliff. In total, it provides 270 MKR to CU members per year over 3 years with a 1-year cliff. The SECU is financed 50/50 by Maker and Starknet. The other half of the value of the incentive will be provided by Starknet with a mix of USD and Starknet tokens. The total value of the USD and Starknet token provided by Starknet CANNOT exceed the value of the MKR allocation in USD.  Specification  Motivation About SECU role PECU and SECU are working very closely to deliver teleport to make DAI the easiest stablecoin to use cross-domains in DeFi. In parallel, numerous bridge hacks have made us have an even more careful approach to designing and scaling teleport. PECU has dedicated team members focused on L2. We are playing a very similar role to those L2-dedicated PECU members. The difference is that we focus less on L1 contract, but more on translating Maker contracts into Cairo, as well as writing new contracts in Cairo, trust assumptions, ad hoc workflows to improve security for MKR and DAI holders (e.g., escape hatch, circuit breaker), and formal verification. SECU has had challenges in the past year to retain and attract talents due to the lack of incentives, which contrasts with the need for the highest standards in our CU. SECU has taken the approach to not ask for MKR compensation from the start, mindful of the fact that the team needed to prove itself and earn trust from the community before. About deliverables **Phase I deliverables ** has been shipped before we started phase II. You can use the bridge here.  SECU has been working over phase I to strengthen the security of the bridge and recently shipped the monitoring infrastructure and the circuit breaker. We have had 30k + individual deposits on the bridge and we have seeded the first ETHDAI AMM on Starknet. Phase II deliverables were: fast withdrawals, wormhole (now teleport). Fast withdrawal contracts have been audited and are ready to be deployed, and we have so far rewritten more than half of the contracts required for teleport in Cairo, we are still working on tests. The timeline for deploying teleport has been pushed back as organizational as well as technical challenges had been underestimated by PECU and SECU. You will find more details in the post from Derek Layer II Roadmap - History and Future. About MKR compensation Many possible frameworks for MKR Compensation have been put forward in the DAO, providing solid principles for MKR compensation that are incorporated throughout this proposal. Our core unit MKR compensation should be very similar to that of PE-001, given the nature of the work we do at the SECU as described above. Alternative MKR Compensation Guidelines 15 suggest a 1.5 multiplier to calculate the MKR compensation, which we are using. Note that out of this 1.5 multiple, Maker is only paying 0.75, Starknet is paying for the other 0.75. The rationale for having a compensation aligned with PECU is based on the fact that dedicated engineers are doing a very similar job with PECU, but focused on EVM chains. One year ago, we decided to create a separate CU for Starknet because the overhead of diving into trust assumptions, learning Cairo, adapting user processes to Starknet trust assumptions, and formal verification would have been a distraction for PE. Additionally, it allowed Maker to only pay for 50% of the total budget and have Starknet finance the other half.  Core Unit ID SNE-001 (Starknet Engineering Core Unit)  List of Budget Implementations Eligibility Anyone currently working for SECU, who has not given notice at the time of this proposal, is eligible for MKR Compensation. Eligibility Period is from September 27th, 2021 until August 5th, 2022 for this proposal, dating back to the inception of the Core Unit. All the members of the Core Unit who are eligible have joined the Core Unit on September 27th, 2021. Eligible MKR compensation will have a cliff of 12 months, meaning SECU contributors will receive their MKR one year after the end of the eligibility period. Formula For all members of SECU, MKR Compensation will be derived based on the salary earned within the Core Unit during the retroactive eligibility period. We will be using the 1.5 multiplier proposed by Aes in Alternative MKR Compensation Guidelines 15. This number is then divided by 2 to account for the equal budget split between Maker and Starknet. The MKR price used is the 3-month average of $1109 (source: CoinMarketCap). MKR transfer  One-off transfer on September 27, 2022, of MKR 270. Representing the MKR payment for one year of work after the cliff. Paid from the Pause Proxy to 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1 Stream of MKR 540 from the Pause Proxy to 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1, starting on September 28, 2022, ending on September 28, 2024  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp68-modify-protocol-engineering-core-unit-budget-pe-001/13797",
                        "https://forum.makerdao.com/t/bridge-hacks-review-and-learnings-for-maker-teleport/17549",
                        "https://forum.makerdao.com/t/mip39c2-sp19-adding-the-starknet-engineering-core-unit-sne-001/9745",
                        "https://starkgate.starknet.io/",
                        "https://forum.makerdao.com/t/starknet-wormhole-implementation-details/12042",
                        "https://forum.makerdao.com/t/layer-2-roadmap-history-and-future/17310/7",
                        "https://forum.makerdao.com/t/mip56-alternative-mkr-compensation-guidelines/9230",
                        "https://forum.makerdao.com/t/mip56-alternative-mkr-compensation-guidelines/9230",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/14",
                        "https://forum.makerdao.com/t/weekly-mips-update-105/17999",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/23",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/16",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/26",
                        "https://forum.makerdao.com/t/weekly-mips-update-102/17511",
                        "https://forum.makerdao.com/t/weekly-mips-update-103/17674",
                        "https://forum.makerdao.com/t/weekly-mips-update-104/17861",
                        "https://forum.makerdao.com/t/weekly-mips-update-101/17392",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties-round-up-4/18283",
                        "https://forum.makerdao.com/t/weekly-mips-update-100/17265",
                        "https://forum.makerdao.com/t/weekly-mips-update-99/17102",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/101",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/14",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/23",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/5",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/46",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/17",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/119"
                    ],
                    "GPT-summary": "The post is a proposal for the MKR Compensation budget for Core Unit SNE-001: Starknet Engineering Core Unit. The proposal explains the motivation behind the proposal, the role of SECU, and the deliverables. It also provides details on the MKR compensation framework, eligibility, and formula. The post invites feedback and questions from the community and provides a forum URL and ratification poll URL for further discussion.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Smart contract updates",
                        "Board composition",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.209542230818826
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/08/2022-19:08:13",
                    "content": " MIP40c3-SP79: MKR Compensation for StarkeNet Engineering Core Unit (SNE-001) This post summarizes the main points of this subproposal from GovAlpha’s perspective:  MIP40c3-SP79 is an MKR compensation subproposal for the StarkeNet Engineering Core Unit (SNE-001). This proposal allocates 270 MKR to CU members per year over 3 years with a 1-year cliff. A total of 810 MKR will be vested. One 270 MKR transfer will be done on September 27, 2022, as a retroactive allocation for SNE-001 contributors. 540 MKR will be streamed from the Pause Proxy starting on September 28, 2022 and ending on September 28, 2024. This proposal is based on the Alternative MKR Compensation Guidelines 15. This proposal has been assigned High-Impact based on the methodology listed here.  ",
                    "links": [
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267",
                        "https://forum.makerdao.com/t/weekly-mip-update-106/18103",
                        "https://forum.makerdao.com/t/weekly-mips-update-103/17674",
                        "https://forum.makerdao.com/t/weekly-mips-update-104/17861",
                        "https://forum.makerdao.com/t/weekly-mips-update-101/17392",
                        "https://forum.makerdao.com/t/weekly-mips-update-105/17999",
                        "https://forum.makerdao.com/t/weekly-mips-update-102/17511"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#3",
                    "likes": "1",
                    "time": "05/08/2022-21:36:58",
                    "content": "So if I understand correctly, the current budget of SNE is 487K. You are asking for roughly 445K worth of Maker per year, which would almost double the cost to Maker holders of your CU. Is that correct? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#4",
                    "likes": "0",
                    "time": "06/08/2022-09:51:20",
                    "content": "@CodeKnight , we submitted two DAI budget requests, the first one in August 2021 of 210,375 DAI. The second one in December 2021 of 487,292 DAI. Our mandate was planned until July but we have been running cheaper than planned and we will not need to ask for another DAI budget until October or November (depending on audit costs). Our annualized burn is ~ 425k DAI, and we have been looking for ways to reduce further the burn: a ~15% budget reduction will be effective as of August. We are asking for 270 MKR per year which is ~ 300k DAI at last 3 month average rate. So for MKR holders it represents a 70% budget increase. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#5",
                    "likes": "0",
                    "time": "06/08/2022-13:48:01",
                    "content": "I see 810 MKR in the proposal. 270 in one-off transfer+540 streamed. Do you mean that the initial 270 is retroactive? So a 70% retroactive budget increase+70% forward looking budget increase?     pyramidmaker:  Our mandate was planned until July but we have been running cheaper than planned and we will not need to ask for another DAI budget until October or November (depending on audit costs).   If you are running underbudget, then why a 70% budget increase? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#6",
                    "likes": "2",
                    "time": "06/08/2022-14:31:44",
                    "content": "The 270 is indeed retroactive, knowing that we have launched the CU one year ago. The one-year cliff will end on Sept 27 2022. The 540 is covering a two years period starting on Sep 28, 2022. We have never included any MKR incentives in our previous proposal. So far everyone has worked in good faith knowing that after the one-year cliff we would ask for a “bonus” financed 50/50 by MKR and Starkware. One of our engineers already left for a startup who gave him attractive equity compensation, and I have had a very hard time replacing him with the current compensation plan. Please note that the current situation is not sustainable, we cannot legitimate to the team that all CU have a “bonus” MKR compensation but we don’t, and we cannot compete against other employers in the space with the current compensation scheme. In terms of how much we are asking in MKR compensation, we just followed the guideline multiple of 1.5 since we are the closest to the PE team in terms of our mandate and responsibilities. Let me know if you have more questions @CodeKnight . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.581845238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#7",
                    "likes": "0",
                    "time": "06/08/2022-16:47:57",
                    "content": "Thank you for your prompt replies.   Has SNE had any conversations with delegates where the expectation was set on MKR bonuses? Particularly on retroactive bonuses?   Can you clarify why you are close to PE in mandate and responsibility?  Protocol engineering is working on our core product and is essential to Makerdao, with responsibility for billions of dollars in assets. While I fully support L2 integration, SNE’s mandate and responsibility seem far smaller than that. Integration seems like a closer equivalent, with a 0.9 multiplier.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "1",
                    "time": "06/08/2022-18:46:57",
                    "content": "Once onchain, will vote no as disagree with the assessment of applying suggested multiplier of 1.5, which is the same as Engineering - Protocol. In fact, even if this CU is removed today, the Maker protocol will continue to function. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "3",
                    "time": "06/08/2022-19:18:27",
                    "content": "Speaking as a community member; not an official ISCU communication.     Doo_StableLab:  even if this CU is removed today, the Maker protocol will continue to function   Short-sighted! Who knows which roll-up will attract broad interest? Suppose Maker isn’t on StarkNet and StarkNet becomes extremely popular. Then what? The current pressure on budgets due to market conditions and lack of RWA is likely to ease in 3-6 months. This is the moment to approve new MKR issuance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.56155303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#10",
                    "likes": "1",
                    "time": "06/08/2022-19:37:43",
                    "content": "    psychonaut:  Short-sighted! Who knows which roll-up will attract broad interest? Suppose Maker isn’t on StarkNet and StarkNet becomes extremely popular.   There are several L2 and mainnet the Maker protocol is working with and we shouldn’t apply such logic as they all might become popular and in your logic, deserve max multiplier.     psychonaut:  The current pressure on budgets due to market conditions and lack of RWA is likely to ease in 3-6 months.   Using your own logic, suppose the current pressure on budgets increase (I mean especially on RWA will be likely delayed due to recent conflict), “then what” as you yourself pointed out ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#11",
                    "likes": "3",
                    "time": "06/08/2022-19:41:23",
                    "content": "Don’t forget that it’s easier to increase spending but much harder to cut spending. So increasing the budget should be carefully considered ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#12",
                    "likes": "2",
                    "time": "07/08/2022-00:02:34",
                    "content": "    Doo_StableLab:  easier to increase spending but much harder to cut spending   Agreed, but this CU already exists. Both Maker and StarkNet have already invested a bunch of money in it. I don’t think investing more could be regarded as an instance of the sunk cost fallacy. This CU is already successful and just wants to offer compensation commensurate with other similar CUs like PE. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#13",
                    "likes": "0",
                    "time": "07/08/2022-13:35:28",
                    "content": "    psychonaut:  This CU is already successful   In the same level as how PECU is operating the protocol? How much Dai is on the StarkNet via this bridge yet? Our standard for success is too low in my opinion if we think less than 1% of total Dai is considered successful. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.018518518518519
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#14",
                    "likes": "2",
                    "time": "07/08/2022-13:38:33",
                    "content": "@Doo_StableLab, @CodeKnight The rationale for having a similar compensation as PE is explained below. Let me know if you believe my logic is not sound. Please let me know if you have further questions. @Doo_StableLab having those discussions with delegates is on my list for the next two weeks.   Until ~ end of 2022 we will be building the teleport infrastructure to assure Starknet is part of teleport. The teleport infrastructure for EVM rollups is currently being built by dedicated engineers within PE. We are doing a very similar job, except in Cairo.   Until Q3 2023, we will be rebuilding the vault engine on Starknet. The vault engine for EVM rollups is being built by dedicated engineers within PE. We are doing a very similar job, except in Cairo.   After we have shipped teleport and the vault engine on Starknet. We will have to make a decision which we already started discussing with PE, particularly @Derek. There are pros and cons to both options:   option i. SECU runs operations the vault engine on Starknet, which means writing spells and implementing upgrades related to initiatives that are voted by governance. This is basically PE’s operational job, but on Starknet option ii. SECU merges with PE and does what is described in option i You can see SECU as an extension of PE that might merge with PE in the mid-term once the development is done. In terms of what we do now, it is very similar to what dedicated PE engineers are focused on. Of course we can take the short-term view and argue that without SECU the protocol would still operate. But given how fast Aave is moving cross-L2, I am not sure it’s a sound strategic argument. Without SECU we would not be building on Starknet which has been identified and voted as a priority. And once the teleport and vault engine build is finished, we would not be able to run operations, which would defeat the purpose. As a side note, we have an engineer who already decided to leave and we have lost candidates to Aave’s protocol engineering team lately. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1722222222222225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#15",
                    "likes": "2",
                    "time": "07/08/2022-14:06:49",
                    "content": "Maker placed a bet on L2 through governance. Only Optimism has just a little more than 1% of DAI at the moment, yet dedicated PE engineers are working on the other EVM bridges with lower TVL. Starknet itself has not scaled its own bridge because they are prudent. We will not go faster than them in scaling for obvious reasons. Given all the bridge hacks happening, I don’t think that TVL in bridges is exactly a good single metric to look at for MKR holders just yet. We spend most of our time thinking about how to get rid of trust assumptions, how users can execute a L1 escape hatch, how we can assure to circuit break the bridge in the event of a hack, and how to minimize impact on MKR holders in case a hack is actually successful. A lot of brilliant teams have dramatically failed at those things listed above and scaled too fast (e.g., Nomad this week). And it is not protecting MKR holders in the mid-term to consider L2 as an area where we can afford to let good talents go and attract average talents. Again, MKR holders are only paying for half of the multiple, hence 0.75, not 1.5. The reason is that Starknet is a young but very promising rollup with much faster withdrawal times and an impressive ecosystem of builders. Yet they are early, which is the reason why the budget is shared 50/50. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.106125992063492
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#16",
                    "likes": "1",
                    "time": "07/08/2022-14:13:42",
                    "content": "@Doo_StableLab I replied both of your questions in this thread. We are very careful with budget, we have executed a 15% cut lately, and we have been running way under the original budget proposed. The budget is also fully shared with Starkware so Maker is only paying half of it. However, without an attractive MKR compensation, it is very hard to compete with the Aave and Google and other startups in the ecosystem in terms of attracting and retaining protocol engineers. We would be left with average talents, which again represents a risk for MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.962083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#17",
                    "likes": "0",
                    "time": "07/08/2022-14:16:19",
                    "content": "I shared below and added in the main post more information about why our team does a similar job to dedicated PE engineers. I also shared what might happen to the SECU long-term (either merging with PE, or acting as a spin-off of PE to run operations). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#18",
                    "likes": "1",
                    "time": "07/08/2022-15:51:26",
                    "content": "    pyramidmaker:  The teleport infrastructure for EVM rollups is currently being built by dedicated engineers within PE. We are doing a very similar job, except in Cairo.       pyramidmaker:  Maker placed a bet on L2 through governance. Only Optimism has just a little more than 1% of DAI at the moment, yet dedicated PE engineers are working on the other EVM bridges with lower TVL.   PE engineers are also working on Polygon and Avalanche that have quite large TVL, and many other parts of the protocol. If StarkNet CU is inseparable from work from PECU, then I suggest the governance should look at resource dedicated to both carefully as adjustments within them might be needed.     pyramidmaker:  Given all the bridge hacks happening, I don’t think that TVL in bridges is exactly a good single metric to look at for MKR holders just yet.   Ok, then what’s the metric for success that the community can agree on? If your point is Dai on StarkNet won’t be strongly demanded and won’t contribute to the dramatic increase in Dai supply in a foreseeable future and thus feel that it’s not a good metric to work on, the point of such resource increase might not be a wise move.     pyramidmaker:  As a side note, we have an engineer who already decided to leave and we have lost candidates to Aave’s protocol engineering team lately.   And we saw several of Aave members left to join other protocols so I can’t imagine financial incentive is the only reason that resulted in such transition. If higher cost is needed to have an uncertain output, don’t you agree that the protocol should rethink about putting more resources into it? “We would be left with average talents, which again represents a risk for MKR holders” is a speculation but increased cost to the protocol is certain.     pyramidmaker:  We are very careful with budget, we have executed a 15% cut lately, and we have been running way under the original budget proposed.   That’s great but still doesn’t change the fact that this effectively result in much greater increase. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.617058270676692
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#19",
                    "likes": "2",
                    "time": "08/08/2022-19:20:34",
                    "content": "Thank you @Doo_StableLab, breaking down my answers in multiple posts so I can address all your points: Q: PE engineers are also working on Polygon and Avalanche that have quite large TVL, and many other parts of the protocol. If StarkNet CU is inseparable from work from PECU, then I suggest the governance should look at resource dedicated to both carefully as adjustments within them might be needed. A:   I’d love to share few additional insights on how we work with PE. PE engineers are looking at trust assumptions for Polygon and Avalanche, but there is no work that has started there. They are focused on Optimism, Arbitrum, and zksync will have its bridge but won’t be included immediately in teleport. There are dedicated engineers focused on L2 work within PE, just like we are. Obviously PE is outputting more work that is non-L2 related and more core to the L1 part of the protocol, but it is a much larger group with a much larger budget so I am not sure the comparison holds so much here. We are doing a similar work to what those dedicated CU members do, except that we are working on a non-EVM chain that requires learning Cairo, working around their roadmap, and collaborating with teams doing formal verification work. We collaborate closely on overall design and chain assessment. Regarding the structuring of the teams, we believe that the current structure is the most cost-efficient for Maker because it is financed 50/50, and it makes a lot of sense to have a separate CU focused on Cairo until we finish building teleport and the vault engine on Starknet. PECU and SECU facilitator (myself) have now discussed internally with three options that could make sense but no recommendation has been made yet: i. Keeping the CUs separate ii. Spinning off a CU for L2s specifically iii. Merging PECU and SECU. Having all the L2 engineers in the same CU would be very helpful for many reasons, but also has many drawbacks. We are actively thinking about this but we would suggest to wait until the END GAME becomes clearer, and understand how MetaDAOs might impact the restructuring of L2 work before changing anything. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5093327454438565
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#20",
                    "likes": "1",
                    "time": "08/08/2022-19:23:08",
                    "content": "Q: Ok, then what’s the metric for success that the community can agree on? If your point is Dai on StarkNet won’t be strongly demanded and won’t contribute to the dramatic increase in Dai supply in a foreseeable future and thus feel that it’s not a good metric to work on, the point of such resource increase might not be a wise move. A: My point is very much not that DAI won’t be in demand on Starknet, Maker decided to expand on Starknet because delegates and large MKR holders think that it will. My point was more that given where Starknet is today it is hard to have a discussion based on TVL only. I would look at metrics such as: developer community and potential TVL looking at the protocols currently developing on it, as well as market-makers community. My second point was related to security. TVL is worth little if bridges get hacked. Obviously hacks are black swan events so we will never get robust statistics around those. However, we are currently doing a review of all the bridge hacks and are designing a circuit breaker that will leverage this analysis. Stay tuned we will share summaries of analyses and design discussions there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.386620082815735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#21",
                    "likes": "2",
                    "time": "08/08/2022-19:34:04",
                    "content": "Q: And we saw several of Aave members left to join other protocols so I can’t imagine financial incentive is the only reason that resulted in such transition. If higher cost is needed to have an uncertain output, don’t you agree that the protocol should rethink about putting more resources into it? “We would be left with average talents, which again represents a risk for MKR holders” is a speculation but increased cost to the protocol is certain. A:  MKR is making strategic decisions to expand and we’re all focused on executing this the best we can. I am simply following the guidelines put forward by the Strategic Finance CU here. The rationale for the multiple 1.5 is that we need top engineers to not compromise the security of the protocol. L2 expansion is a hard task in unchartered technical territory. The increase to the protocol cost you mention is not as obvious, see next post for more details. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.599404761904761
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#22",
                    "likes": "1",
                    "time": "08/08/2022-19:39:29",
                    "content": "Q: That’s great but still doesn’t change the fact that this effectively result in much greater increase. A: Even including DAI budget + the MKR compensation we are asking for, we still are decreasing the budget vs. the original ask (which was not including MKR comp). 28% decrease: revised annualized burn + MKR bonus vs. the DAI only budget we asked 1 year ago 13% decrease: realized annual burn + MKR bonus vs. the DAI only budget we asked 1 year ago Same comparison but assuming we would have gotten MKR compensation on original burn: 57% decrease: revised annualized burn + MKR bonus vs. original budget including MKR bonus 48% decrease: realized annualized burn + MKR bonus vs. original budget including MKR bonus ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#23",
                    "likes": "0",
                    "time": "08/08/2022-20:01:19",
                    "content": "@CodeKnight  You are correct, except that our future burn will be 10-25% lower than our realized burn for the past year. We will be asking for a budget extension in October. See this post for further details ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#24",
                    "likes": "0",
                    "time": "08/08/2022-20:07:04",
                    "content": "@CodeKnight thank you for your questions, always appreciated.   this is top of my list this week   PE is indeed in charge of $Bn of assets, but PE have dedicated engineers working on L2s.  We are doing a very similar work to them except that we focus less on L1 and more on translating the Maker contracts in Cairo, trust assumptions, and formal verification. We are also participating in design with PE and working on additional designs that protect DAI and MKR holders (e.g., escape hatch, circuit breakers, mitigation plans, emergency shutdown). You will find further details in this post.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#25",
                    "likes": "1",
                    "time": "11/08/2022-00:47:48",
                    "content": "    pyramidmaker:  This proposal is based on Alternative MKR Compensation Guidelines 15    I have just learned that the guidelines you referenced were never actually voted on. They are still in RFC and do not accurately reflect the MKR earned by CUs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#26",
                    "likes": "1",
                    "time": "11/08/2022-06:46:04",
                    "content": "@Doo_StableLab @CodeKnight one thing I’d recommend you Delegates keep in mind here is that L2s in the EndGame will have a valuable role growing decentralized vault adoption—specially since the long term goal of the endgame is too have DAI backed mostly by ETH & other eth-based collaterals(Phoenix Ether, EthDAI, etc.), as oppose to USDC (today’s dilemma).  L2s will be apart of the Creator MetaDAOs— helping Maker grow decentralized vault adoption. From a proactive PoV, the most reputable teams of developers get their bridges hacked (Nomad as an example). So, if you believe you can find more talented engineers who are fluent in Cairo and you are willing to bet your reputation on those new lower wage engineers  to protect Maker Teleport, please by all means help this DAO onboard such team. But if you don’t, I then urge you to support this MKR compensation proposal and let SECU continue to do their job. Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.455681818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#27",
                    "likes": "2",
                    "time": "11/08/2022-13:25:54",
                    "content": "I am not necessarily against raising salaries. What I am against is the ad-hoc system for MKR compensation, which is providing a large portion of people’s salaries. As we are seeing, it isn’t even fair to CUs as it rewards those clever enough to sneak clauses by the delegates(like SF). There is also the retroactive compensation aspect. Lets look at what Starknet Engineering said.    MIP40c3-SP28: Modify Core Unit Budget - StarkNet Engineering (sne-001)   MKR vesting No MKR vesting is proposed for phase I. A MKR vesting based on deliverables will be proposed for phase II.   They clearly line out that phase 1 would have no vesting and that phase 2 vesting would be based on deliverables. This proposal includes phase 1 and is not contingent on any deliverables ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.879251700680273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#28",
                    "likes": "0",
                    "time": "11/08/2022-14:58:26",
                    "content": "I believe this is the best we have and was historically setup to manage CU’s expectations and avoid having to deal with unreasonable MKR compensation requests. I would get closer to Strategic Finance to discuss this further ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#29",
                    "likes": "1",
                    "time": "11/08/2022-15:17:21",
                    "content": "    CodeKnight:  I am not necessarily against raising salaries. What I am against is the ad-hoc system for MKR compensation, which is providing a large portion of people’s salaries.   You are more than welcome to take the torch as it were regarding coming up with a consolidated MKR compensation plan. I doubt there is anyone that has worked  more on this than Juan, Wouter, LFW, and myself, with my contributions being completely unpaid as at that time I authored and contributed to those MKR compensation plans I was a community member. I’d recommend starting with the following threads to read through the history and concerns if you’re serious about spearheading a proposal:  Working Group MKR Comp Guidelines Pre-MIP MKR Comp Guidelines MIP Alternate MKR Comp Pre-MIP Alternate MKR Comp MIP MKR Comp Financial Model Pre-MIP SES MKR Comp Plan      CodeKnight:  As we are seeing, it isn’t even fair to CUs as it rewards those clever enough to sneak clauses by the delegates(like SF).   Given the above and the discussion in SF’s MKR compensation thread, this is disingenuous at best. The 2-month trailing average was specifically asked about by one of the largest delegates and was answered publicly. To add onto those comments, our MKR compensation was specifically structured to retain team members during prolonged bear markets, when resources are needed most. All of our full-time contributors have received equal or more attractive offers from competitors. While compensation isn’t the only reason to stay with a team and organization it is important, especially in a DAO where you’re taking more risk contributing compared to a traditional organization. Let’s walk through an example looking at the 6 month trailing price and 30% discount parameters. If a team’s MKR compensation was priced during a bullish time in the markets, at a $3.8K 6-month trailing price, there is a strong incentive to leave the DAO when you can only reprice down to $2.7K (30% discount), which is currently a 245% premium to spot. Let’s look at some more data from the past 22 months and comparing . During that time using a 6-month trailing average, if a team priced their MKR on February 5th 2021, they could’ve locked in a trailing 6 month average of $720 compared to the spot price of $2,700, nearly a 4x premium. Using a 2 month trailing reduces the premium to 2.6x. On the flip side, if a team priced their MKR on June 16th, 2022, they’d be locking in at a 150% premium to spot ($1,826 vs $733 spot) - who would be willing to lock in a 60% lower bonus? The story isn’t much better for the 2month trailing average, which would allow a team to price their MKR at a 83% premium to spot, locking in a 45% lower bonus. The point I’m making with this data is that there are trade-offs for every parameter in a MKR compensation plan. SF has made the conscious choice to bias our plan towards attracting and retaining contributors during bear markets. ",
                    "links": [
                        "https://forum.makerdao.com/t/mkr-compensation-working-group-membership/7460",
                        "https://forum.makerdao.com/t/pre-mip-discussion-the-mkr-compensation-guidelines/7960",
                        "https://forum.makerdao.com/t/mip53-the-mkr-compensation-guidelines/8012",
                        "https://forum.makerdao.com/t/alternative-mkr-compensation-guidelines/9049",
                        "https://forum.makerdao.com/t/mkr-compensation-financial-model/9038",
                        "https://forum.makerdao.com/t/pre-mip-discussion-an-alternative-mkr-compensation-plan/8000",
                        "https://forum.makerdao.com/t/mip40c3-sp48-strategic-finance-unit-mkr-compensation-sf-001/12060/6",
                        "https://forum.makerdao.com/t/mip40c3-sp41-immunefi-security-core-unit-mkr-budget-is-001/10814",
                        "https://forum.makerdao.com/t/mipx-maker-compensation-guidelines/17235/4"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.883975812547241
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#30",
                    "likes": "2",
                    "time": "11/08/2022-15:36:23",
                    "content": "There might be a misunderstanding here. We explicitly added this sentence to make clear we were not asking for MKR budget in that MIP. It was hard enough to get a MIP for a new CU passed. We also did not ask any MKR compensation for the entirety of the first year we worked at Maker. In other word we have been working in good faith for a full year. I can’t think of any person willing to accept this type of agreement in a regular company, or of any company trying to attract best talents and doing this to their employees. But hey, we love Maker and trust the process so we still did it   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.195707070707071
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#31",
                    "likes": "0",
                    "time": "11/08/2022-15:45:33",
                    "content": "The statement seems pretty clear. No MKR vesting would be asked for in Phase 1. MKR vesting in Phase 2 would be based on deliverables. “give us a chance and if it works we would like MKR retroactively” is a perfectly fine approach for Phase 1, but I don’t see that in your initial proposal or discussion. And if you have changed your mind on deliverables for Phase 2, then that should also be noted. If total compensation is too low that is a fair issue to address, but it doesn’t line up with the initial proposal. If there is any documentation I am missing, please let me know. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.703703703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#32",
                    "likes": "4",
                    "time": "16/08/2022-17:00:30",
                    "content": "    flipflopflapdelegate:  So, if you believe you can find more talented engineers who are fluent in Cairo and you are willing to bet your reputation on those new lower wage engineers to protect Maker Teleport, please by all means help this DAO onboard such team   This rhetoric isn’t particularly useful. Going by this logic supporters of this proposal should be prepared to pay the asked for compensation from their own pocket. With more fiscal discipline in earlier onboardings and budgets we could have avoided some of the painful reductions we are now initiating. I will not be supporting this proposal in its current form. While I’m not opposed to a MKR vest in principle, the following proposal have some shortcomings, in my view. One of them is the total compensation sought in relation to the mandate. Another one is due to the agreed upon mandate explicitly stating that no MKR compensation is proposed for phase I. With phase I being extended for a considerable time beyond the original target date I think showing a deliverable is a prudent step prior to seeking increased compensation. After reviewing the original mandate I present the following agreed upon terms:    MIP40c3-SP28: Modify Core Unit Budget - StarkNet Engineering (sne-001)   MKR vesting No MKR vesting is proposed for phase I. A MKR vesting based on deliverables will be proposed for phase II.   Phase I is presented the following way:    MIP39c2-SP19: Adding the StarkNet Engineering Core Unit (SNE-001)   Phase 1 deliverable and timelines: DAI bridge to Starknet (3 months)   Product  DAI bridge (month 2):  Solidity contract with annotated code Annotated Cairo code   Governance  Upgradability mechanism (month 3): allows governance to vote on structural or logic changes to the bridge Bridge limit (month 2): during phase I and II, the bridge will be subject to a DAI limit.        From the July rapport we can see that deployment of the bridge is not yet complete despite being projected to be in place in month 2 (which would be November 2021):    Starknet Engineering Core Unit - July 2022 Update   On Risk Management  Posted with PECU a fast withdrawal risk assessment and recommendation for the Risk CU Posted the poll on Starknet fast withdrawals risk parameters, including a 1Mn DAI debt ceiling. The poll was successful.= Met with Starkware team in person and iterated with Veridise to discuss next steps on formal verification Our bridge contracts are currently being used as a test for formal verification Studied the previous bridge hacks and decided to  Run a systematic analysis on the past bridge hacks   Derive design recommendations Derive a circuit breaker design Update and post for discussion the emergency management protocol       I will be happy to engage in a discussion considering MKR vesting upon completion of phase I. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp28-modify-core-unit-budget-starknet-engineering-sne-001/9791/1",
                        "https://forum.makerdao.com/t/mip39c2-sp19-adding-the-starknet-engineering-core-unit-sne-001/9745",
                        "https://forum.makerdao.com/t/mip39c2-sp19-adding-the-starknet-engineering-core-unit-sne-001/9745/1",
                        "https://forum.makerdao.com/t/starknet-engineering-core-unit-july-2022-update/17147",
                        "https://forum.makerdao.com/t/starknet-engineering-core-unit-july-2022-update/17147/1",
                        "https://forum.makerdao.com/t/fast-withdrawals-and-risk-assumptions/16375",
                        "https://vote.makerdao.com/polling/QmZxRgvG#vote-breakdown",
                        "https://rekt.news/leaderboard/",
                        "https://docs.google.com/document/d/1bLbvePWfKjWwJoLvZa06HPCPuh8OcEFHrB-M7SZ3oS8/edit"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.738754734848484
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#33",
                    "likes": "1",
                    "time": "16/08/2022-17:48:04",
                    "content": "Thank you @JustinCase and @CodeKnight. **Phase I deliverables** has been shipped before we started phase II. You can use the bridge here. Note that we have had between 150k and 170k DAI in the bridge with a limit of 50 DAI deposit. It tells about the interest, 150k/50 = 30k potential users. We are increasing this limit to seed the first AMM on Starknet, we currently have a poll on that. Also note that the monitoring infrastructure you are referring to as “not done” was not in the original scope but we decided to add it earlier because we were not comfortable given the context with so many hacks. We also added a circuit breaker and an escape hatch mechanism which were not explicitly in scope but again felt very necessary in context. Monitoring infrastructure is now done and being integrated by techops. Phase II deliverables were: fast withdrawals, wormhole (now teleport) Fast withdrawals are done and we will be deploying in a couple of weeks after PE (August 31). Teleport (formerly wormhole) work has started 6 months ago, however we have had delay for reasons @Derek will detail shortly in a post. Tldr, the bridge hacks made us spend much more time thinking about security and design (monitoring, circuit breakers, how to scale), we originally underestimated the management of third parties and the dependencies between the teams (PECU, SECU, data insights, techops, rollups teams), and we also had to rethink the originally proposed design of teleport to accommodate a more generic flush mechanism. ",
                    "links": [
                        "https://starkgate.starknet.io/",
                        "https://forum.makerdao.com/t/request-for-poll-starknet-bridge-deposit-limit-and-starknet-teleport-fees/17187",
                        "https://forum.makerdao.com/t/starknet-wormhole-implementation-details/12042"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#34",
                    "likes": "0",
                    "time": "16/08/2022-17:56:35",
                    "content": "@CodeKnight @JustinCase , regarding the sentence “No MKR vesting is proposed for phase I. A MKR vesting based on deliverables will be proposed for phase II.” Apologies if there was a misunderstanding, our intent was not to change the eligibility period otherwise we would have mentioned the said eligibility period. We also did not asked for MKR compensation when posting the MIP for phase II. Our intent was simply to ask for vesting one year in, once we had proven ourselves. I would watch our actions rather than a “for” instead of a “at”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#35",
                    "likes": "0",
                    "time": "16/08/2022-18:19:57",
                    "content": "    pyramidmaker:  One-off transfer on September 27, 2022, of MKR 270. Representing the MKR payment for one year of work after the cliff. Paid from the Pause Proxy to 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1       pyramidmaker:  Our intent was simply to ask for vesting one year in, once we had proven ourselves. I would watch our actions rather than a “for” instead of a “at”.   but that’s clearly retroactive MKR for phase 1? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#36",
                    "likes": "0",
                    "time": "16/08/2022-18:22:14",
                    "content": "Yes correct @ultraschuppi . What we meant was that we were not asking for MKR comp “at” phase I, not “for” phase I. Our intent was not to ask for an eligibility period that would start later than the actual date when the CU was created. Simply asking for MKR comp after one-year since anyway everyone has one year vesting. See deliverables comment above for the output of the work, as well as the upcoming post from Derek. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#37",
                    "likes": "3",
                    "time": "16/08/2022-19:15:23",
                    "content": "uhm okay… that’s pretty… unfortunate. from the way i read the initial onboarding proposal it was about “let’s just show the value we produce, if you are all happy with the results we might later on start asking for MKR vesting for future commitment to the protocol”. but clearly not retroactively. I am fine with MKR-vesting for longterm engineering commitment, but this sets bad precedence for “advertise something and put a larger bill then expected later on”. not cool. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.871527777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#38",
                    "likes": "0",
                    "time": "16/08/2022-20:58:19",
                    "content": "    ultraschuppi:  I am fine with MKR-vesting for longterm engineering commitment, but this sets bad precedence for “advertise something and put a larger bill then expected later on”. not cool.   Actually this has some similarities to KPI options which are currently trending courtesy of the giga-brains at UMA. If you’re not familiar—Take a quick look: KPI Options for align incentives ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#39",
                    "likes": "3",
                    "time": "16/08/2022-21:10:41",
                    "content": "Retroactive allocation is actually not a bad system from Maker standpoint in my opinion. Let people deliver value and you reward them based on that retroactively. That’s exactly how all firms in finance work for a reason. More and more common in crypto. It’s less risky from the protocol standpoint, more fair and clear, and assures the teams are focused on getting things done. Also the type of people who are fine trusting a protocol to reward them retroactively is the type of people you want to recruit because their intrinsic motivation is high. @ultraschuppi we are not a short-term CU. I am a little bit confused by your comment.  Rereading my post, I agree I could have made things more clear. Not finding excuses but it was my first post on the forum ever and there was no on-boarding to learn how to post or understand how delegates would (retroactively) interpret a post. Facilitator on-boarding is probably something we could improve as a DAO. But just using good sense. It was implied as a long-term CU that we would ask for MKR incentives. How can we expect to be competitive against average companies if we bear a high regulatory risk, don’t provide benefits, and the community assumes long-term workforce would work without incentives. Again we’re all here because we love Maker, particularly those sticking during the bear market, but it does not feel right to hold as a core assumption that we can attract top talents while asking them to take more risk for a lower pay than elsewhere (i.e., flat pay without MKR). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.18197619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#40",
                    "likes": "2",
                    "time": "20/08/2022-10:10:36",
                    "content": "@JustinCase @CodeKnight, @ultraschuppi As mentioned in my previous comment, phase I was delivered. For phase II, fast withdrawals are about to be deployed and we have made good progress towards teleport. However teleport still requires work. You will find more information about phase II and III on the post Layer II roadmap - history and future ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.2333333333333325
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#41",
                    "likes": "0",
                    "time": "25/08/2022-18:34:38",
                    "content": "Reminder that this proposal will enter its Frozen Period in one week, on Thursday September 1st at 00:00UTC. Substantive modifications beyond that time will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#42",
                    "likes": "0",
                    "time": "05/09/2022-23:58:59",
                    "content": "@pyramidmaker, please confirm by Thursday 00:00UTC if you will be formally submitting this subproposal for the current cycle (September Governance Cycle). Let us know if you have any questions! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#43",
                    "likes": "2",
                    "time": "06/09/2022-15:07:04",
                    "content": "We would like to formally submit it @Gala , thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#44",
                    "likes": "0",
                    "time": "05/12/2022-15:07:31",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1537"
}