{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-addendum-to-the-current-poll-to-activate-the-governance-security-module/938",
            "title": "Signal Request: Addendum to the current Poll to Activate the Governance Security Module ",
            "index": 938,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "govsec-module"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#1",
                    "likes": "1",
                    "time": "11/12/2019-05:26:57",
                    "content": " Introduction On Monday, the Maker Foundation Interim Risk Team published a governance poll proposing to activate the Governance Security Module (GSM), increasing its delay from 0 to 24 hours. Since the launch of MCD, the delay has been set to 0. This allowed the community to take immediate action to mitigate technical errors, oracle malfunctions, or an economic attack should any arise.  Update to the GSM Proposal The Maker Foundation smart contracts development team proposes an update that will bundle the GSM update into two operations:  Set the GSM delay to 24 hours Exclude the Oracle Security Module (OSM) freeze method from the GSM delay.  By excluding the OSM freeze method, the GSM delay would no longer negatively impact the responsiveness of the OSM.  Effects of the Update  How the GSM delay protects the system  Continuous Approval Voting The decentralized governance layer of the Maker Protocol works according to the principles of continuous approval voting by MKR holders. New proposals are implemented by deploying a contract to apply a change to the Maker Protocol. Potential changes range from routine risk parameter updates to extensive upgrades, including new features, improvements and patches, or module updates. Once the contract has been deployed, MKR holders can start voting on the new proposal. If the proposal has more MKR voting for it than the last proposal that was voted in, the proposal is ratified, and the deployed contract is ‘executed.’ This code will then be authorized by the system to apply its changes.  Governance Attacks The system cannot distinguish between honest proposals voted in by the MKR community and malicious changes put in place by an attacker. Should an attacker be able to execute a malicious contract by overtaking the MKR votes on the active executive, the system will apply these changes indiscriminately. This attack category is called a governance attack.  Governance Security Module The Governance Security Module mitigates governance attacks by introducing a delay between the activation of the executive, and the actual execution of the code (when the changes are applied.) During this delay, the community can examine the changes that will be applied and react if the changes are deemed malicious. Two typical reactions against a governance attack would be:  Cancelling the delayed proposal by voting in a cancellation contract with an executive vote. Triggering Emergency Shutdown of the system.  In conclusion, a 24 hour GSM delay will allow the community to examine governance proposals that have been voted in for 24 hours and block proposals that are deemed malicious within this timeframe.  The downsides of the GSM delay There are three primary disadvantages to having the Governance Security Module delay of 24 hours in place:   Legitimate governance proposals are equally delayed by 24 hours, which may be undesirable for urgent changes. In the future, this can be mitigated by activating so-called Instant Access Modules_ (IAMs)_. IAMs will be permitted to bypass the GSM delay, but only for a pre-approved, restricted set of changes with limited input parameters. For example, the community may vote in an IAM to change the Stability Fee(s) within the range of ±2% from its current value.   Vulnerability patches will be delayed by 24 hours, as well. During this 24 hour period, the patch can be examined, and the vulnerability it is supposed to fix will become apparent. This gives attackers up to 24 hours to learn about the vulnerability and implement an exploit. This impediment is hard to overcome as it is fundamentally impossible to distinguish between good and bad changes to the system, other than through the judgement of MKR holders. Note that code obfuscation is not a realistic mitigation measure due to the availability of debugging tools that can decipher the contracts, or at least reveal the details of the intended effects. While Emergency Shutdown is always available as an alternative to a patch, more creative, and less destructive, solutions may be considered on a case by case basis, should a critical vulnerability be detected.   The GSM delay will render another security feature of the system, the Oracle Security Module freeze method, unusable. This issue can be avoided by excluding the OSM freeze method from the GSM delay. Read the next section for more details.    Why the OSM freeze method should be excluded The purpose of the Oracle Security Module is to delay price information coming from the Oracle by one hour, leaving an Emergency Oracle up to one hour to react and “freeze” the price data if it deems an attack is happening. If this capability is subjected to the 24 hour delay of the GSM, then the benefits of the OSM are rendered moot.  Conclusion The Maker Foundation development team proposes that additional steps be taken to exclude the OSM from the GSM delay. If ratified, the GSM delay of 24 hours will be applied to all governance proposals, but the OSM freeze method will not be subjected to it.  Next Steps  The Maker Foundation smart contracts team is working on finishing the code for the update and will conduct a security review. The code will be made available for public review once the team has finished their work. Community members can provide feedback and ask questions about this update in the forum thread. The update will be further discussed on the governance call on Thursday. Barring unforeseen complications during technical implementation and review, the update code will be put up for executive vote on Friday.       The OSM SHOULD be excluded from the GSM deployment and retain its current 1 hour delay The OSM SHOULD NOT be excluded from the GSM deployment and adopt the 24 hour delay Abstain (I just want to see results) Abstain (I have no opinion) Abstain (I don’t feel I am knowledgeable on the subject) Abstain (I disagree with the poll options) Abstain (I have a different objection)     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-should-we-have-another-executive-vote-regarding-the-governance-security-module/1209/23",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-december-12-9am-pst-5-00-pm-utc/947/5",
                        "https://forum.makerdao.com/t/signal-request-how-do-we-handle-executive-bundling-in-relation-to-technical-changes/965"
                    ],
                    "GPT-summary": "The Maker Foundation Interim Risk Team has proposed to activate the Governance Security Module (GSM) with a 24-hour delay to mitigate governance attacks. The Maker Foundation smart contracts development team proposes an update that will bundle the GSM update into two operations and exclude the Oracle Security Module (OSM) freeze method from the GSM delay. The post explains the effects of the update, the downsides of the GSM delay, and why the OSM freeze method should be excluded. The Maker Foundation smart contracts team is working on finishing the code for the update and will conduct a security review. Community members can provide feedback and ask questions about this update in the forum thread.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.224630761395468
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MicahZoltu",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/12/2019-07:49:28",
                    "content": "What is the name of the OSM contract and where can one go to look at the source code for it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#3",
                    "likes": "3",
                    "time": "11/12/2019-10:20:50",
                    "content": "@MicahZoltu The OSM is the Oracle Security Module. You can find the source code for it here.    GitHub    makerdao/osm Feed with 1 hour delay. Contribute to makerdao/osm development by creating an account on GitHub.       The void method will be allowed to bypass the GSM. I would like to clarify that upon further investigation the stop method will be allowed to bypass the GSM instead of the void method. ",
                    "links": [
                        "https://github.com/makerdao/osm"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#4",
                    "likes": "1",
                    "time": "11/12/2019-19:49:30",
                    "content": "As was discussed on the Community Call, the GSM time delay was planned to remain at 0 for at least another 1-2 months. This was because any unexpected vulnerabilities in the new MCD system are most likely to surface during that time. As mentioned above, this move to a 24 hour time delay would create a significant window for an attacker to exploit a known vulnerability before a fix can be implemented. The current vote is asking us to sacrifice the ability to implement a quick fix during MCD’s nascent period so that we can shield governance from attack. Can you further explain what kind of risk assessment was done to determine that this was the right recommendation to make in these early days of the MCD system? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.819388944388945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "0",
                    "time": "14/02/2020-01:02:49",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}