{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/liquidations-2-0-preliminary-risk-parameters/4850",
            "title": "Liquidations 2.0: Preliminary Risk Parameters ",
            "index": 4850,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "liquidation-system",
                "liq-20"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#1",
                    "likes": "9",
                    "time": "23/10/2020-16:31:37",
                    "content": "This post serves to inform all stakeholders of the risk parameters that are slated to be included in the upcoming Liquidations 2.0 release and to initiate discussion around them. Note that it is not too late to add, remove, or modify parameters, and this post will be updated accordingly as this occurs. For example, the best way to add a liquidation incentive is currently being considered, and will involve the addition of at least one more risk parameter. This post is intended to be more focused on the risk aspect rather than the technical smart contract aspect, and thus parameters are discussed in a way that is natural to human thought. For example, the chop parameter is often referred to in percentage terms during risk discussions (“a chop of 13%”) even though the underlying smart contracts would require that value to be expressed as 1.13 * 10^27. Liquidator Contract (Dog) Global Parameters Hole : upper limit on the amount of DAI needed to cover the debt and penalty of all active auctions; liquidations cannot occur once the limit is reached. Per-Ilk Parameters chop : as in the current system, a liquidation penalty that causes the auctions to seek a greater amount of DAI (above the Vault’s debt) before collateral can be returned to the Vault. Prevents the “auction grinding” attack. hole : similar to Hole, but per-ilk. This allows taking into account market liquidity on a per-collateral basis when limiting the amount of DAI needed to cover debt+penalty of active auctions. chip : percentage of the Vault’s debt to reward as DAI to the liquidator (caller of bark). Bad debt is simultaneously assigned to the Vow. This parameter acts to reward Keepers proportionally to the amount of risk they remove from the system by liquidating an undercollateralized Vault. So long as it is less than chop by a margin of safety, liquidations are still net-positive for the system in terms of income. tip : a constant reward paid as DAI to the liquidator (caller of bark). This parameter can be used to cover the gas costs of liquidation, or to add extra incentive for liquidating smaller Vaults which might be less attractive to liquidators. Auction Contract (Clipper) buf : percentage increase applied to the OSM price when determining the starting price for an auction. tail : maximum auction duration. Auctions that have run longer than this time period must be reset with a call to the redo function. cusp : minimum percentage of starting price that an auction is permitted to reach before a reset is required. E.g. if the starting price is 500 DAI/COL, and cusp is 20%, then if the price reaches or falls below 100 DAI/COL the auction cannot be bid on and must be reset. calc : a contract implementing a price versus time curve. Different price curves will have their own, separate, risk parameters. For example, a linear decrease function may be parametrized by the time required to reach zero, or an exponential function by its half life. Currently, the contract assumes an interface in which the price at time t is a function of only the auction’s initial price, it’s start time, and t. ",
                    "links": [
                        "https://forum.makerdao.com/t/small-vaults-liquidations-incentives/5166",
                        "https://forum.makerdao.com/t/week-21-dai-distributions-sourcecred-funding-mip13c3-sp6/4883"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.321097883597884
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "23/10/2020-17:25:29",
                    "content": "Nice! The Dog and the Clipper. Super cool. Would the cusp be the defender versus another mempool/black Thursday attack event? Sounds like it–but not sure. Otherwise, thank you so much for your hard work Kurt! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.848958333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#3",
                    "likes": "6",
                    "time": "23/10/2020-18:08:33",
                    "content": "cusp directly enforces some minimum price, so yes it’s a zero-bid prevention mechanism; but really the whole design was created with the intention of avoiding another BT-type scenario, so I’d say the entirety of Liquidations 2.0 is the defense against another Black Thursday :). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#4",
                    "likes": "2",
                    "time": "25/10/2020-07:33:37",
                    "content": "chop is 1.13e18 now (wad resolution), please confirm it will not go back to ray resolution in the dog contract. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#5",
                    "likes": "0",
                    "time": "25/10/2020-19:06:38",
                    "content": "Correct, it will remain an 18 digit fixed point number going forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "25/01/2021-01:06:41",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}