{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/foundation-blog-forum/7619",
            "title": "Foundation Blog - Forum ",
            "index": 7619,
            "category": [
                "Discontinued Categories",
                "Blog"
            ],
            "tags": [
                "blog"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#1",
                    "likes": "4",
                    "time": "22/04/2021-22:14:17",
                    "content": "More   _    from the Foundation. A post about this here forum, share with your friends if they’re too intimidated to jump in.    Maker Blog – 22 Apr 21    Why the MakerDAO Forum Is the Heart of the Maker Community For decentralized organizations, a primary hub exists for the most important community discussions concerning governance. For MakerDAO, that hub is the Maker Forum. Estimated reading time: 4 minutes       ",
                    "links": [
                        "https://blog.makerdao.com/why-the-makerdao-forum-is-the-heart-of-the-maker-community/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "23/04/2021-15:26:40",
                    "content": "When the Foundation is gone, who will have control over the blog, will it be discontinued, or will it be left with a UC? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#3",
                    "likes": "1",
                    "time": "23/04/2021-16:37:04",
                    "content": "The Content Production Core Unit is proposing to handle that. We’re in the process of planning the strategy for utilizing the Foundation and Community blogs. Community-driven content generates value in ways that are different from an “official” blog so we want to make sure each of these platforms are being used in ways that allow that value to be realized. If you have any ideas about what that could look like or are interested in publishing something, please reach out! ",
                    "links": [
                        "https://community-development.makerdao.com/en/blog"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "2",
                    "time": "23/04/2021-17:11:11",
                    "content": "Thank you, good man! At the DAG Venezuela we have a blog on Medium clearly in Spanish https://makervenezuela.medium.com, where we touch on various topics, tutorials and DeFi protocols on behalf of and in the interest of our communities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "3",
                    "time": "23/04/2021-19:02:24",
                    "content": "Seth–so, the Blog is not permissionless–does this mean y’all do the editing and fact-checking? Also, are opinion pieces welcome–if so, what criteria must an opinion piece have? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#6",
                    "likes": "1",
                    "time": "23/04/2021-20:47:36",
                    "content": "Yes. I’m not sure about opinion pieces on the official blog just yet but CommDev has recently been discussing how the meaning of “community” changes with the transition to Core Units and what we can do to squeeze the most value out of the awesome content management system the team behind the Community Portal has created to make it easier for community members to contribute. One of the most common problems with community-generated content is the number of low-quality posts you’ll inevitably receive so we do want to welcome opinion pieces and other content from the community but we also want to implement a plan for soliciting specific types of content and ensuring that readers can expect a certain level of quality. I understand that may not fully answer your question but I think that’s the best we can do before our Core Unit is voted on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1304945054945055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "07/05/2021-20:48:33",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}