{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/eth-latam-en-buenos-aires-argentina-11-al-13-de-agosto-2022-tickets-e-info/16347",
            "title": "ETH LATAM en Buenos Aires, Argentina - 11 al 13 de Agosto 2022 - Tickets e info ",
            "index": 16347,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#1",
                    "likes": "16",
                    "time": "05/07/2022-19:34:58",
                    "content": " image1500×500 12.8 KB  Entre el 11 y el 13 de Agosto de 2022 se llevará a cabo el GRAN evento ETH LATAM en Buenos Aires, con speakers de lujo ya confirmados como Gerrit Hall (Curve), Camila Russo (The Defiant), Santiago Palladino (Open Zeppelin), Fernanda Dixon (Axie Infinity), Stani Kulechov (Aave), y muchos muchos mas, entre ellos dos destacados miembros de la casa, @nanexcool  y @Nadia Asimismo, MakerDAO será uno de los sponsors oficiales del evento:  image1921×1081 45.7 KB  Las entradas son totalmente gratuitas, y el total de invitados ascenderá a una cifra cercana a las 4.000 personas. El jueves pasado, 29 de Junio, se liberaron las primeras 750 entradas por la plataforma https://www.eventbrite.com/ y se agotaron en 5 minutos. Mañana, miércoles 6 de Junio, a las 15 hs. de Argentina (UTC -3) se hará el segundo lanzamiento de entradas, por lo que hay que estar atento a las redes sociales del evento:  Página Web Twitter Telegram Discord Instagram  Mañana miércoles 06 de Julio a las 14.30 hora Argentina (UTC -3) hay twitter spaces en la cuenta oficial, estaría atento a lo que se anuncie allí sobre la nueva tanda de entradas que se van a lanzar ese mismo día. Y en todos esos canales de contacto encontrarán también mucha mas información, incluida data de lugares para alojarse en Buenos Aires para quienes nos visiten desde otras provincias o países. Se espera que haya varios side events en fechas cercanas al evento, a estar atentos a esas redes. Algo de covertura del evento en los medios:    Cointelegraph    La primera edición del ETHLatam se celebrará en Argentina. La primera edición del ETHLatam se celebrará en Argentina.         BeInCrypto – 29 Jun 22    ETHLatam se celebrará en Buenos Aires durante el mes de agosto Del 11 al 13 de agosto se llevará a cabo en Argentina ETHLatam, la conferencia sobre Ethereum más importante de Latinoamérica.  Est. reading time: 2 minutos       ESPERAMOS SU VISITA EN BUENOS AIRES, ARGENTINA! Les aseguro que no vivirán nada igual.   Yo ya tengo mi ticket, y tu?  Quedo a disposición de cualquier persona que tenga interés en visitarnos, así como encontrarán aquí una comunidad cripto muy grande, vibrante y hermosa que estará dispuesta a brindar colaboración. ",
                    "links": [
                        "https://ethlatam.org/",
                        "https://twitter.com/ethlatam",
                        "https://t.me/ETHLatam",
                        "https://discord.com/invite/D7uyZDXKDM",
                        "https://www.instagram.com/ethlatam/",
                        "https://es.cointelegraph.com/news/the-first-edition-of-ethlatam-will-be-held-in-argentina",
                        "https://es.cointelegraph.com/news/the-first-edition-of-ethlatam-will-be-held-in-argentina",
                        "https://es.beincrypto.com/ethlatam-celebrara-buenos-aires-durante-mes-agosto/?utm_source=twitter&utm_medium=embeded&utm_campaign=news",
                        "https://es.beincrypto.com/ethlatam-celebrara-buenos-aires-durante-mes-agosto/?utm_source=twitter&utm_medium=embeded&utm_campaign=news",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-10/16685",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-10-traduccion/16689",
                        "https://forum.makerdao.com/t/hilo-oficial-de-bienvenida/13566/81"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#2",
                    "likes": "2",
                    "time": "05/07/2022-19:37:56",
                    "content": "Va a estar muy bueno ETH Latam, con presencia de Maker de primera línea  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#3",
                    "likes": "3",
                    "time": "05/07/2022-19:48:20",
                    "content": "¡Qué nivel!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#4",
                    "likes": "5",
                    "time": "05/07/2022-21:06:12",
                    "content": "Vas a ir @Sol_Invictus ??? Vamos que tenemos que hacer una juntada de la comunidad Maker! Ya algunos nos conocernos ( @Leandro @nahueth  , @Nicolas_Bernabe  ),  ésta es la oportunidad ideal para conocernos quienes vivamos en Buenos Aires, y con quienes vengan de otras ciudades, provincias y países de la región! MakerDAO Meetup! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#5",
                    "likes": "4",
                    "time": "05/07/2022-21:55:59",
                    "content": "Bueno, incluso ya se están armando side events. No sé si da para organizar, pero sería genial un side event de Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#6",
                    "likes": "4",
                    "time": "05/07/2022-22:28:18",
                    "content": "I’d like to, but empleada de comercio, and comercio never sleeps.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#7",
                    "likes": "4",
                    "time": "06/07/2022-17:45:33",
                    "content": "Comparto las novedades!   La segunda tanda de tickets se lanzará en forma gratuita dentro de 15 minutos, a las 3 pm de Argentina (UTC -3), por medio de éste link: ETHLatam at Buenos Aires Tickets, Thu, Aug 11, 2022 at 9:30 AM | Eventbrite   Asimismo, se abrió una convocatoria a artistas NFT que quieran exponer sus obras en el evento, para lo cual deberán aplicar hasta el 20 de julio en éste formulario: ETH Latam NFT artist application form   Avísenles a sus artistas NFT conocidos o favoritos que les gustaría ver exponiendo!   twitter.com    ETHLatam at BA 🇦🇷 @ethlatam  ¿ Sos #NFTArtist y querés exponer tus obras en @ethlatam ? 👩‍🎨🧑‍🎨  Hasta el 20/07 tenés tiempo para completar el formulario y estar entre los posibles seleccionados 🤩👇🏼  docs.google.com/forms/d/e/1FAI…  ⚠️ No sé aceptarán respuestas fuera de término.   5:36 PM - 6 Jul 2022           6                2            ",
                    "links": [
                        "https://docs.google.com/forms/d/e/1FAIpQLSfRTuV1EYjLS1rUXZYex-na0FmrNWlHy-BbxfnoL5wdgz3TcQ/viewform",
                        "https://twitter.com/ethlatam/status/1544737042470318080",
                        "https://twitter.com/ethlatam/status/1544737042470318080",
                        "https://twitter.com/ethlatam/status/1544737042470318080",
                        "https://twitter.com/search?q=%23NFTArtist",
                        "https://twitter.com/ethlatam",
                        "https://docs.google.com/forms/d/e/1FAIpQLSfRTuV1EYjLS1rUXZYex-na0FmrNWlHy-BbxfnoL5wdgz3TcQ/viewform",
                        "https://twitter.com/ethlatam/status/1544737042470318080"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#8",
                    "likes": "3",
                    "time": "07/07/2022-04:22:38",
                    "content": "    Marian:  Quedo a disposición de cualquier persona que tenga interés en visitarnos, así como encontrarán aquí una comunidad cripto muy grande, vibrante y hermosa que estará dispuesta a brindar colaboración.   Excelente @Marian Marian, mucha suerte en el evento, que todo salga conforme a lo previsto. Quedamos atentos luego que se desarrolle y sí está al alcance puedan brindar algún resumen, o no se si habrá algún tipo de transmisión vía streaming. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#9",
                    "likes": "4",
                    "time": "07/07/2022-12:49:45",
                    "content": "Si, me idea es ir volcando aquí todas las novedades desde aquí al evento, y luego ir aportando material, fotos y resúmenes de lo que suceda en general, y en especial con MakerDAO, que será sponsor y contará con speakers.     FuchoCrypto:  no se si habrá algún tipo de transmisión vía streaming.   Habrá transmisión por streaming. Cuando estén los links, los compartiré y te aviso. Y para quienes deseen concurrir en persona, les cuento que ayer, la segunda tanda de 1.000 tickets se agotaron en DOS MINUTOS, pero el sábado lanzarán una tercer tanda. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#10",
                    "likes": "6",
                    "time": "07/07/2022-19:34:58",
                    "content": "Amigo como siempre excelente idea crear este post, hora de ponerse en modo reportero, hablando de amplitud de posibilidades y oportunidades… Che leyenda @MarianoDP consulta, que tan loco seria organizar un meetup entre participantes, entusiastas y colaboradores de Maker? Pudiendo ser antes, durante o después del main event. Creo que por acá ya tenes varios pares de manos mas que dispuestas a ayudar en todo lo que se necesite para hacerlo realidad. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#11",
                    "likes": "6",
                    "time": "07/07/2022-19:40:16",
                    "content": "Como ex empleado de comercio feeling you but…es un evento all day por lo que podrias asistir en cualquier ventana horaria que te sea posible o creas oportuna, si no me equivoco y por lo que me llegaron a comentar, pues radio pasillo y gossips a la orden del dia, el evento seria de 9am a 8pm (claro esta a confirmar). En todo caso que tan factible es enfermarse, guiño guiño, justo esa semana por unos dias, nada que un certificado acorde no resuelva… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#12",
                    "likes": "4",
                    "time": "07/07/2022-19:46:55",
                    "content": "Jajaja. ¡Muy astuto! Pero estoy recién llegada a este puesto de trabajo–no la puedo bardear–, y pierdo mucho tiempo en viaje. 3 horitas al día. Literalmente lifeless. Bueno, si eras empleado de comercio sabés lo que se siente la pérdida progresiva del alma. (Y) Mejor para la actividad del foro, pues estaré esperando tener noticias por este medio. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#13",
                    "likes": "6",
                    "time": "07/07/2022-22:06:09",
                    "content": "lets fucking do it! creo que el pana @tobalgarcia tambien va a estar, podemos hacer algo! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 0.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#14",
                    "likes": "5",
                    "time": "07/07/2022-22:42:58",
                    "content": "Buenísimo! Desde ya, como dijo @nahueth cuentan conmigo para lo que sea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#15",
                    "likes": "5",
                    "time": "07/07/2022-22:51:17",
                    "content": "Vamos que se va armando la meetup de Maker, porque todo bien con los chats y las conversaciones en topics/DMs, pero nada le gana a una mesa con cerveza. Y mas si nos visitan integrantes de otros países, tenemos el DEBER de recibirlos como corresponde. Si tenía manija con el ETH Latam ahora me apalanco x50. Para ir viendo cuantos seríamos y saber en que clase de sitio habría que pensar, hago un llamado a todos los integrantes de la comunidad que tengan interés en ser parte del encuentro: repórtense!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tobalgarcia",
                    "index": "#16",
                    "likes": "4",
                    "time": "08/07/2022-04:20:06",
                    "content": "No me lo pierdo. De una @Marian @nahueth, nosotros en el team la vamos craneando también. Si tienen algo ya pensado hablenme al Discord Tobal#3368 y por ahí la podemos seguir. Cuando lo tengamos listo lo posteamos acá en el foro así todos se suman! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#17",
                    "likes": "2",
                    "time": "08/07/2022-07:51:02",
                    "content": "    Marian:  Habrá transmisión por streaming. Cuando estén los links, los compartiré y te aviso.   Que bien, enhorabuena por esta iniciativa. Estaremos muy atentos para seguir la transmisión del evento. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#18",
                    "likes": "2",
                    "time": "08/07/2022-21:26:37",
                    "content": "Me encanta gente, gracias por coparse, ahora te mando al DS que tengo unas ideas/propuestas en mente a ver si coincidimos o vemos que podemos generar. Nuevamente, que locura tenerlos! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#19",
                    "likes": "3",
                    "time": "08/07/2022-21:33:30",
                    "content": "Excelente leyenda, gracias muchas, se va sumando gente al baile! No se si están al tanto pero van a estar presentes como speakers @nanexcool y @Nadia, que tantas posibilidades habría de que se sumen o estén presentes en la posible meetup? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#20",
                    "likes": "3",
                    "time": "08/07/2022-21:44:59",
                    "content": "Bueno había que intentarlo no? Claro entiendo la situación, en toda su dimensión, nada como ser esclavo del sistema. Personalmente aprovecho en lo posible con podcasts, libros o notas esos tramos discontinuos de travesía. Pero miremos el lado positivo, vas a poder presenciarlo en modalidad virtual. Y si el finde estas mas libre y con ánimos, tal vez puedas sumarte a algún side event de los que se están gestando. Everything is possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#21",
                    "likes": "2",
                    "time": "08/07/2022-22:07:59",
                    "content": "Para quienes deseen concurrir al evento y no tengan entradas, mañana sábado 9 de julio a las 12 hs. de Argentina (UTC -3) se lanza la tercer tanda de tickets.   twitter.com    ETHLatam at BA 🇦🇷 @ethlatam  Venimos con buenas noticias 🥳  El 9 de julio a las 12hs ARG será el tercer lanzamiento de entradas 🎟️🎟️  ¡Agenda la fecha y no te lo pierdas! 😉   9:54 PM - 8 Jul 2022           29                4            A estar atentos en ese horario en éste link, que seguramente se acaben rápido nuevamente:  ETHLatam at Buenos Aires Tickets, Thu, Aug 11, 2022 at 9:30 AM | Eventbrite ",
                    "links": [
                        "https://twitter.com/ethlatam/status/1545526768781639684?t=cNXGmERJzn8JWvkeiPROHQ&s=19",
                        "https://twitter.com/ethlatam/status/1545526768781639684?t=cNXGmERJzn8JWvkeiPROHQ&s=19",
                        "https://twitter.com/ethlatam/status/1545526768781639684?t=cNXGmERJzn8JWvkeiPROHQ&s=19",
                        "https://www.eventbrite.com/e/ethlatam-at-buenos-aires-tickets-374680147407"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#22",
                    "likes": "4",
                    "time": "11/07/2022-22:39:35",
                    "content": "Novedades para quien no tenga entrada y desee concurrir! Éste jueves 13 de Julio a las 18:30 hs. de Argentina (UTC -3) se lanza la cuarta tanda de tickes. Recuerden que son totalmente gratis y se agotan rápidamente, así que estén puntuales en ese horario refrescando la página de éste link: ETHLatam at Buenos Aires Tickets, Thu, Aug 11, 2022 at 9:30 AM | Eventbrite   twitter.com    ETHLatam at BA 🇦🇷 @ethlatam  La semana se arranca con buenas noticias 😉  El 13 de julio a las 18:30hs ARG será el cuarto lanzamiento de entradas 🥳  ¡Agenda la fecha!   10:32 PM - 11 Jul 2022           11                2            ",
                    "links": [
                        "https://twitter.com/ethlatam/status/1546623382288056327",
                        "https://twitter.com/ethlatam/status/1546623382288056327",
                        "https://twitter.com/ethlatam/status/1546623382288056327",
                        "https://twitter.com/ethlatam/status/1546623382288056327"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#23",
                    "likes": "4",
                    "time": "15/07/2022-13:39:47",
                    "content": "La cuarta tanda de 750 tickets se agotó en 4 minutos, ya se entregaron alrededor de 2.500 tickets de un total de 4.000. Todo indica que va a ser un éxito total, las tandas de tickets que fueron liberando se agotaron siempre en menos de 5 minutos. Mañana sábado 16 de Julio a las 12 hs. de Argentina (UTC -3) se lanza la quinta tanda, tendrán otra oportunidad quienes deseen concurrir al evento. Recuerden que son gratuitas y se habilitan a la hora puntual en éste link:  ETHLatam at Buenos Aires Tickets, Thu, Aug 11, 2022 at 9:30 AM | Eventbrite   twitter.com    ETHLatam at BA 🇦🇷 @ethlatam  ¡Hola comunidad! ✨  Agenda esta fecha, no digas que no te avisamos:  🗓️ El 16 de julio a las 12 PM ART será el quinto lanzamiento de tickets 🎟️🎟️  👉 ethlatam.org https://t.co/Yrrg4lVTgD   12:22 PM - 15 Jul 2022           33                10            ",
                    "links": [
                        "https://twitter.com/ethlatam/status/1547919519095525380",
                        "https://twitter.com/ethlatam/status/1547919519095525380",
                        "https://twitter.com/ethlatam/status/1547919519095525380",
                        "https://ethlatam.org/",
                        "https://t.co/Yrrg4lVTgD",
                        "https://twitter.com/ethlatam/status/1547919519095525380"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#24",
                    "likes": "2",
                    "time": "19/07/2022-01:04:48",
                    "content": "Ya tenemos nueva fecha para la distribución de la quinta tanda de tickets! Quien esté interesado en concurrir, agéndese éste el miércoles (20 de julio) a las 15:30 hs. de Argentina (UTC -3). Los tickets son gratuitos y se obtienen en éste link: ETHLatam at Buenos Aires Tickets, Thu, Aug 11, 2022 at 9:30 AM | Eventbrite   twitter.com    ETHLatam @ BA 🇦🇷 @ethlatam  ¡Lunes de buenas noticias! 🥳  El 20 de julio a las 15:30 ART 🇦🇷 habrá un nuevo lanzamiento de tickets 🎟️  ¡Agendá la fecha e ingresá a ethlatam.org el próx. miércoles! 🙌   11:11 PM - 18 Jul 2022           30                8            ",
                    "links": [
                        "https://twitter.com/ethlatam/status/1549170015450107904?t=wQ6sO2cAEnydGF2OWmCpRQ&s=19",
                        "https://twitter.com/ethlatam/status/1549170015450107904?t=wQ6sO2cAEnydGF2OWmCpRQ&s=19",
                        "https://twitter.com/ethlatam/status/1549170015450107904?t=wQ6sO2cAEnydGF2OWmCpRQ&s=19",
                        "https://ethlatam.org/",
                        "https://twitter.com/ethlatam/status/1549170015450107904?t=wQ6sO2cAEnydGF2OWmCpRQ&s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#25",
                    "likes": "2",
                    "time": "27/07/2022-14:40:15",
                    "content": "Atentos quienes deseen concurrir al evento y aún no tengan entrada, hoy miércoles 27 de julio, a las 17:30 hs. en punto de Argentina (UTC -3) se lanza la séptima tanta de tickets gratuitos en éste link: ETHLatam at Buenos Aires Tickets, Thu, Aug 11, 2022 at 9:30 AM | Eventbrite   twitter.com    ETHLatam @ BA 🇦🇷 @ethlatam  GM! 🤝 Reservate hoy a las 17:30hs ARG 😉  Será el séptimo lanzamiento de tickets para ETHLatam 🎟️ 🙌   2:29 PM - 27 Jul 2022           12            Además, les cuento que MakerDAO es uno de los sponsors y co-organizadores de Ultra Sound Party, el after party oficial del ETH Latam, que se desarrollará el 13 de Agosto, en Palermo, Buenos Aires. La primer tanda de 10 tickets se entregan por medio de un concurso de memes en el twitter del evento, mas tickets soon.   twitter.com    Ultra Sound Party 🔥 Aug 13 📆 @UltraSoundParty  Welcome to Ultra Sound Party 🦇🔊 @CalypsoExchange @CryptoAvisos @defiantApp @DeFi_LATAM @MakerDAO @Media_FDN  unidos en la #USP para festejar el cierre del evento crypto más grande del año: @ethlatam 🔥  Are you ready? 🥳 https://t.co/tvmuZXP58h         6:37 PM - 22 Jul 2022           130                29            ",
                    "links": [
                        "https://twitter.com/ethlatam/status/1552300024289271808",
                        "https://twitter.com/ethlatam/status/1552300024289271808",
                        "https://twitter.com/ethlatam/status/1552300024289271808",
                        "https://twitter.com/ethlatam/status/1552300024289271808",
                        "https://twitter.com/UltraSoundParty/status/1550550510402510850",
                        "https://twitter.com/UltraSoundParty/status/1550550510402510850",
                        "https://twitter.com/UltraSoundParty/status/1550550510402510850",
                        "https://twitter.com/CalypsoExchange",
                        "https://twitter.com/CryptoAvisos",
                        "https://twitter.com/defiantApp",
                        "https://twitter.com/DeFi_LATAM",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/Media_FDN",
                        "https://twitter.com/search?q=%23USP",
                        "https://twitter.com/ethlatam",
                        "https://t.co/tvmuZXP58h",
                        "https://twitter.com/UltraSoundParty/status/1550550510402510850"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.199999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#26",
                    "likes": "1",
                    "time": "02/08/2022-16:55:06",
                    "content": "Atentos quienes deseen concurrir y no tengan entrada, mañana miércoles 3 de agosto se lanza la última tanda de tickets del ETH LATAM, un saldo final de alrededor 500. Y hoy, martes 2 de Agosto a las 8:30 pm hora de Argentina (UTC -3) se lanza la primer tanta de tickets de la Ultra Sound Party, la fiesta oficial de cierre del ETH LATAM que se realizará el 13 de Agosto, y de la cual MakerDAO es main sponsor.   twitter.com    Ultra Sound Party 🔥 Aug 13 📆 @UltraSoundParty  🎟️El lanzamiento oficial de los tickets es HOY 20.30hs🦇  Se anuncia el código de inscripción previamente en el #TwitterSpace de @defiantApp 😉  Activen recordatorio 🔊👇 twitter.com/defiantApp/sta…   Defiant Wallet @defiantApp  📌No te olvides de agendar el recordatorio 👇  https://t.co/yFZIrOFWw8    5:27 PM - 2 Aug 2022           6                3            ",
                    "links": [
                        "https://twitter.com/UltraSoundParty/status/1554519228866351105?t=QM72QZJ3e2Rit3dWDB6uhw&s=19",
                        "https://twitter.com/UltraSoundParty/status/1554519228866351105?t=QM72QZJ3e2Rit3dWDB6uhw&s=19",
                        "https://twitter.com/search?q=%23TwitterSpace",
                        "https://twitter.com/defiantApp",
                        "https://twitter.com/defiantApp/status/1554253933979336709",
                        "https://twitter.com/defiantApp/status/1554253933979336709",
                        "https://twitter.com/UltraSoundParty/status/1554519228866351105?t=QM72QZJ3e2Rit3dWDB6uhw&s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#27",
                    "likes": "2",
                    "time": "02/08/2022-17:52:04",
                    "content": "Atentos hoy que se vienen tickets para la ULTRA SOUND PARTY! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#28",
                    "likes": "4",
                    "time": "03/08/2022-14:57:16",
                    "content": "Ya está la agenda del ETH Latam! Se puede consultar en éste link: https://ethlatam.org/ > AGENDA Speakers de primer nivel de Ethereum Fundation, Aave, Curve, Kleros, Balancer, MetaMask, The Graph, OpenZeppelin, Decentraland, Axie, POAP, y muchos más. En lo que respecta a MakerDAO, dos fechas para agendar, el Día 1 a las 16:30 hs. expone @nanexcool y el Día 2 a las 10:30 hs. expone @MarianoDP . No veo en la agenda aún cuando expone @Nadia o si fue reemplazada por MarianoDP.  image819×411 17.6 KB  Para quienes quieran seguir online, cuando publiquen el link para el streaming, lo comparto. Falta MUY poco! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#29",
                    "likes": "3",
                    "time": "11/08/2022-13:09:32",
                    "content": "Comenzó el evento! Para quienes deseen seguirlo por streaming, puede hacerlo en éstos links: Stage 1: Day 1 Link: https://youtu.be/wfh0qbgi6Dw Day 2 Link: https://youtu.be/m2hgU3WBDlU Day 3 Link: https://youtu.be/qU8XSfWfEKE Stage 2: Day 1 Link: https://youtu.be/3Cdsll-zVUE Day 2 Link: https://youtu.be/E3jTarGisG0 Day 3 Link: https://youtu.be/AeBZ4dJKMzk La agenda completa está en la web: http://ethlatam.org/ @FuchoCrypto @Andres @M.Bertuccio me comprometí a avisarles, ahí tienen  ",
                    "links": [
                        "https://t.co/jPV0KzbkKv",
                        "https://t.co/sYVVpERzL2",
                        "https://t.co/LfLAzXBgge",
                        "https://t.co/7SnW8jmHTk",
                        "https://t.co/FrWANn1gtq",
                        "http://ethlatam.org/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#30",
                    "likes": "3",
                    "time": "11/08/2022-20:50:19",
                    "content": "Gracias @Marian, excelente cobertura del evento la que nos ha brindado. Ya en sintonía.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#31",
                    "likes": "0",
                    "time": "12/08/2022-00:55:28",
                    "content": "De nada! Me alegro que pusiste verlo. Tremenda exposición de Mariano Conti, con polémica sobre DAI y MakerDAO incluida. Mañana viernes hay dos exposiciones de Marian DP, la primera a las 10am hora Argentina en el Stage 1 sobre stablecoins con un panel de lujo, y a las 3pm en el Stage 2 sobre comunicaciones en una DAO.  Screenshot_20220811-215103978×647 47.1 KB   Screenshot_20220811-2151211080×521 48.8 KB  La agenda completa y los links para el streaming son los que puse en el post anterior. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#32",
                    "likes": "0",
                    "time": "12/08/2022-13:45:14",
                    "content": "El Día 2 de ETH Latam comenzó con una charla sobre stablecoins con Mariano DiPietra de MakerDAO , Stani de Aave , Garrit Hall de Curve  y Benjamín de QiDao. Escenario repleto.  IMG_20220812_1007007591920×1437 86.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M.Bertuccio",
                    "index": "#33",
                    "likes": "0",
                    "time": "12/08/2022-14:17:26",
                    "content": "Lo prometido es deuda! Que grande Marian cumpliendo . Por falta de tiempo me perdí el día de ayer, estoy revisando la agenda de hoy y se ve interesante. Ya mismo estoy entrando, muchas gracias por el dato. Saludos! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#34",
                    "likes": "0",
                    "time": "12/08/2022-18:01:00",
                    "content": "En éste instante está comenzando a hablar @MarianoDP sobre comunicaciones en una DAO.  IMG_20220812_1500112581920×1437 100 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#35",
                    "likes": "2",
                    "time": "13/08/2022-13:00:40",
                    "content": "Para quienes no pudieron ver la exposición de Mariano DP de la tarde sobre ciertas problemáticas que plantea el sistema de organización de una DAO, con referencias claras sobre Maker, aquí pueden acceder a verla completa. Comienza a las 4 horas, 51 minutos. Muy pero muy recomendada.      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#36",
                    "likes": "4",
                    "time": "15/08/2022-17:14:05",
                    "content": "Bueno, ETH Latam concluyó, fue un gran evento, con charlas de primer nivel y la oportunidad de conocer gente de la comunidad y hacer networking para seguir afianzándola. Personalmente tuve el placer de conocer a @MarianoDP e intercambiar un par de palabras rápidas con él luego de su segunda exposición, y de conocer a @tobalgarcia y tener una larga charla full MakerDAO con él. Les cuento que TODO el evento ha sido transmitido vía streaming y ha quedado grabado para quien quiera ver o volver a ver alguna exposición. Éstos son los links: Stage 1: Day 1 Link: https://youtu.be/wfh0qbgi6Dw  Day 2 Link: https://youtu.be/m2hgU3WBDlU  Day 3 Link: https://youtu.be/qU8XSfWfEKE Stage 2: Day 1 Link: https://youtu.be/3Cdsll-zVUE Day 2 Link: https://youtu.be/E3jTarGisG0 Day 3 Link: https://youtu.be/AeBZ4dJKMzk La agenda completa para conocer los horarios y expositores está en la web: http://ethlatam.org/ ",
                    "links": [
                        "https://t.co/jPV0KzbkKv",
                        "https://t.co/sYVVpERzL2",
                        "https://t.co/LfLAzXBgge",
                        "https://t.co/7SnW8jmHTk",
                        "https://t.co/FrWANn1gtq",
                        "http://ethlatam.org/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#37",
                    "likes": "0",
                    "time": "15/08/2022-17:42:11",
                    "content": "@Marian Hay alguna sesion que recomiendes? Gracias por mantener a la comunidad al tanto del evento ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#38",
                    "likes": "1",
                    "time": "15/08/2022-18:05:47",
                    "content": "En lo que han sido las charlas generales, personalmente disfruté varias, por ejemplo la de Stani de Aaave, sobre el otro protocolo en el que está trabajando, Lens, una red social descentralizada (el Día 1 en el Stage 1 a las 10:30 hs., una de las primeras charlas del día). También disfruté mucho la charla de Camila Russo sobre la película que están por filmar sobre el libro The Infinite Machine Movie, el Día 3 en el Stage 1 a las 15:00 hs, seguida por Patricio Worthalter, fundador y CEO de POAP, el Día 3 a las 15: 30 hs. en el Stage 1 (fueron una de las últimas charlas del día). Me pareció excelente la charla de Mariano Conti sobre stablecoins y descentralización, incliuidas algunas criticas respetuosas a MakerDAO y el multi-coleteral DAI. Realmente excelente. El día 1 en el Stage 1 a las 16: 30 hs., la última charla de se día. Y mi charla preferida del evento, lejos la que mas disfruté, fue la de Mariano Di Pietrantonio contando su visión sobre MakerDAO y las DAO en general, sobre dinero, mercado, etc… Muy honesta realmente, sin corrección política. Me pareció excepcional, voy a volver a verla en breve. Fue el Día 2 en el Stage 2 a las 15 hs., una de las ultimas charlas de ese día. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.138888888888888
                }
            ]
        }
    ]
}