{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/on-the-priority-of-real-world-assets-where-do-we-stand/5424",
            "title": "On the priority of real world assets: Where do we stand? ",
            "index": 5424,
            "category": [
                "Governance"
            ],
            "tags": [
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#1",
                    "likes": "18",
                    "time": "01/12/2020-10:12:37",
                    "content": "The Maker community very clearly indicated that real world assets should be prioritized over other assets in the signal request (forum thread) of September 10th. This was a clear instruction to the Maker Domain Teams to prioritize this work. I’m very happy to say that with the Real World Asset Working group led by @SebVentures we have had the first two risk assessments come out for 6S and New Silver. And the risk work for our second asset originator that submitted a MIP, ConsolFreight is due shortly. Centrifuge has outlined in MIP13-SP5 its readiness to do any necessary work to help speed up this process. We have recruited former Maker core smart contracts developers to help with writing the spell and auditing the integration. And we are preparing to get ready for New Silver to mint their first DAI this year. However it seems like the Collateral Status Index by which other domain teams are prioritizing their work still does not reflect that MKR voters indicated a clear preference for RWA over other assets. Working with several Maker Mandated Actors we have gotten inconsistent feedback on whether the status index is what is used to prioritize RWAs as well or not. Several have said, and the RWA-Working Group had its separate priority. But we don’t see enough progress on the smart contracts and oracle teams. What else can MKR holders & Centrifuge do to make sure these assets get prioritized? ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-should-real-world-asset-collateral-onboarding-be-prioritised-in-the-short-term/4075",
                        "https://forum.makerdao.com/t/sixs-rwa-001-collateral-onboarding-risk-evaluation/5352",
                        "https://forum.makerdao.com/t/ns-drop-collateral-onboarding-risk-evaluation/5418",
                        "https://docs.google.com/spreadsheets/d/1IX9e2fyfz7djtDMKn5gMyGsyFxHoY75GncMbAjnSXrM/edit#gid=0",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-120-thursday-december-3-16-00-utc/5357/4",
                        "https://forum.makerdao.com/t/weekly-sourcecred-distribution-payout-increase/5546",
                        "https://forum.makerdao.com/t/maker-relay-ep-24-en-espanol/5574",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-121-thursday-december-10-16-00-utc/5468/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-24/5534"
                    ],
                    "GPT-summary": "The author of the post is explaining the progress made on prioritizing real world assets in the Maker community, but is also expressing concern about the lack of progress in prioritizing these assets. The post asks for feedback on how to ensure that these assets are prioritized and also asks questions about the prioritization process.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.640634365634366
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#2",
                    "likes": "8",
                    "time": "01/12/2020-11:13:02",
                    "content": "FWIW, Centrifuge RWA like New Silver are expected to quickly use up all of the debt ceiling that they are allocated, meaning that they have a strong effect on increasing DAI supply and impacting the peg, yet it seems they are ranked at “Medium” in those categories. I am also not sure why “Impact on peg” and “DAI supply” are separate categories there: seeing as the market price of DAI is determined by supply and demand I would expect those two things to be one and the same. In any case, I agree with @spin that the community has signaled decisively that RWA should be prioritised over other assets in the short-term, and that the domain teams should take this into account when prioritising their work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.305735930735931
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "8",
                    "time": "01/12/2020-11:30:09",
                    "content": "I would also add that the collateral index was with an emphasis on solving the peg. The PSM is solving that. But the collateral index doesn’t highlight something great of RWA, diversification of risk. All the crypto world is correlated, but RWA have almost no correlation. As discussed here, diversification is really what drives MKR reward/risk ratio. There is also something that is lost forever by delaying RWA: experience. If we want to scale RWA to be significant, we need a lot of experience. There is also a staffing issue. If we want RWA we need a team to work on it. If we delay (depends by how much), maybe we need to reduce the workforce. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#4",
                    "likes": "2",
                    "time": "01/12/2020-11:38:02",
                    "content": "We ranked them medium on DAI supply and peg impact since every one of Drop tokens had low estimated supply, at least initially. I do agree that long term these assets should have larger effect and maybe we should already assume that in the ranking itself. In any case, the community has given high priority to RWA and this table shouldn’t be the one limiting us. This was the view of @Risk-Core-Unit and that is why we weren’t distracted by these ranks and released two RWA assessments already and another one coming shortly. But you all also have to understand past month and next few weeks are pretty hectic for domain teams. I am not sure when was the last time when we had so many things released in a short time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.953333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#5",
                    "likes": "1",
                    "time": "01/12/2020-11:57:17",
                    "content": "I don’t want to get too much into hair splitting but let’s compare New Silver to one of the right now higher ranked collateral types on the sheet: UNI-V2-WBTC-ETH has a total liquidity on Uniswap of $220M. If we assume that Maker is able to capture a very aggressive 10% of the total supply of these tokens, that’s still only $22M collateral. WBTC has currently a collateralization ratio of 240%. That means from 10% which is $22M of the UNI WBTC-ETH pool we can get at the same collateralization ratio we can get 10M in DAI minted. New Silver originates ~$20M in loans per year and wants got get a $5M debt ceiling to start out with. But they intends to scale up the Maker originated portion of their portfolio to at least as much working with the community to ensure that this is done safely and they deliver on the portfolio they promised. The key difference as @equivrel mentioned:     equivrel:  Centrifuge RWA like New Silver are expected to quickly use up all of the debt ceiling that they are allocated,   So we know that by onboarding NS, we can generate 5M DAI quickly and with certainty. Shouldn’t this qualify as “Impact on Peg” and “Dai Supply” as high? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.720789059425423
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "9",
                    "time": "01/12/2020-12:40:05",
                    "content": "As much as I love and prob own most of the UNI-V2 Pairs–I don’t see why ALL of them have to have a higher priority score over RWA and both SIXS and NS-DROP. But, okay I get it–but how does tBTC get higher priority than any of the RWAs?  And yes, I know, I know, the Teams are neck deep in work–but I highly doubt much will change if we Add some of these Tokens over RWA. As an Example, I would have been the first one to Bet that GUSD was going to hit the DC within 1 week. Yet, its a ghost town. No help to the protocol, or DAI. As a community, we need to support the next chapter: RWA. The less we as a community participate, the longer RWAs become a Summer 2021 event–which would be demoralizing to many who have put in a lot of work into making this a reality. Is there any way we can guarantee that RWAs will be on Daistats.com by January 11, 2021? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.362820512820512
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#7",
                    "likes": "0",
                    "time": "01/12/2020-19:02:18",
                    "content": "I think what’s naturally happening here is a drift toward what is easier to accomplish. The unwavering amount of community support doesn’t change the fact that with the experience of the teams, on boarding new crypto assets is much easier than jump starting RWA. Perhaps it is an issue of incentives not being aligned? Is there a way we could economically prioritize a faster launch of RWA? I’ve no developer, but it’s pretty clear to me that if I were I’d be more willing to take on a faster easier project to get myself paid, even if I believe in the RWA model more. Are there obtainable bounties we could post to encourage our labor force to shift gears? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.168181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#8",
                    "likes": "0",
                    "time": "01/12/2020-19:07:32",
                    "content": "As far as I understand RWA are tokens. Sort of fake token. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "7",
                    "time": "02/12/2020-08:34:23",
                    "content": "To provide a bit of context, I had a call last evening to onboard new RWA. Those were already constructed pools between 10M and 200M of assets to refinance using a Maker vault. That could use both Centrifuge and a Trust. Now while I’m more than happy to work with small Debt Ceiling in the experimental framework that Maker Gov have decided, I don’t see how we can onboard 100M tomorrow without having much more experience. @flipflopflapdelegate RWA don’t make sense for the short term. There was also a DAI generation factor. We can hope that 100M+ of UNI token will be in our vault, but we know that New Silver will use the 5M facility. We are comparing hope with facts. RWA are also penalized because there two more risk columns. It’s really a strategic decision for Maker. It’s not about generating 50M DAI in the short term. It’s about extending the playground of Maker to the Real World. @alexis 6S token is a pure fake token to make the vault work. NS-DROP and CF-DROP are securities. Really two different beasts here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.805003819709702
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#10",
                    "likes": "7",
                    "time": "02/12/2020-10:19:52",
                    "content": "    SebVentures:  To provide a bit of context, I had a call last evening to onboard new RWA. Those were already constructed pools between 10M and 200M of assets to refinance using a Maker vault. That could use both Centrifuge and a Trust.   I think this is a key point: there are tons of high quality assets that bring stability fees and massive DAI supply out there in the real world. But convincing them when MakerDAOs track record is absolutely nothing on paper in the last two years doesn’t help. There are a few people crazy enough to still push on for this, 6S, New Silver, ConsolFreight, Seb, myself included. Most of the borrowers are encouraged by the progress we’ve made in recent weeks but still think waiting for someone else to do it first is the safer and easier thing to and betting on this already. Having 10M in DAI generated from RWA will open the flood-gates and prove that Maker can be a competitive lender. It will bring a whole new group of assets and the DAO will be able to go from struggling to bring RWAs onboard to having a choice and picking the best assets. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.742640692640693
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "3",
                    "time": "02/12/2020-10:35:10",
                    "content": "    spin:  Having 10M in DAI generated from RWA will open the flood-gates and prove that Maker can be a competitive lender. It will bring a whole new group of assets and the DAO will be able to go from struggling to bring RWAs onboard to having a choice and picking the best assets.   It looks like we will have the first 5-10m DAI from RWA by the end of the year, or early 2021. It is truly exciting to think at the growth opportunities in 2021/2022. A question that scares me is: are we ready for an exponential growth in RWA onboarding in 2021/2022? The DAO is objectively growing and developing quickly (just compare to the status 1 year ago) but I am scared with real-world businesses/RWA’s entering in contact with MakerDAO at this stage, where we are still basically just a bit more than an experiment run on a forum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.466540404040404
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#12",
                    "likes": "4",
                    "time": "02/12/2020-22:36:16",
                    "content": "    iammeeoh:  A question that scares me is: are we ready for an exponential growth in RWA onboarding in 2021/2022?   Very good question. I have no idea how it will work out. The best thing we can do is to learn at full speed and avoid death. Let’s walk, then run, then fly. Having worked for bank and insurance companies, I have no worry that we can do better. We will make mistakes as well that’s for sure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.042857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#13",
                    "likes": "5",
                    "time": "02/12/2020-23:17:57",
                    "content": "This was added to tomorrow’s agenda of the Governance and Risk meeting. I am looking forward to discussing this further on the call. Please do join! RWA Collateral Priority The prioritization spreadsheet does not seem to accurately reflect the priority of RWAs and perhaps should be revisited. It would be great to get feedback from the domain teams on this and come up with how we could use it better to reflect the focus on RWA as MKR holders voted to see prioritized. Proposing Centrifuge’s Spell to onboard New Silver We know that the resources of the smart contracts domain team are stretched thin. To help with that, Centrifuge has been working on a spell with along with tests against mainnet. I am happy to share a first draft with the community here: The spell deploys the a new collateral type. Using dapp --rpc we can then deploy this spell against the mainnet deployment of New Silver and Maker and test different scenarios. This takes the state of all relevant Maker contracts live on Ethereum Mainnet and allows us to test these changes against them in an environment that behaves identically to mainnet. With this we are able to show how New Silver will be able to borrow their first loans with DAI minted backed by NS DROP tokens and test other scenarios. We are expanding coverage of the tests still but the following key test cases are already present:  Generating DAI from New Silver Loans!   Repaying DAI MIP22 style soft liquidation & hard liquidation and getting liquidated through a liquidation spell by Maker Governance    github.com   centrifuge/tinlake-maker-lib/blob/master/src/spell.sol# // Copyright (C) 2020 Maker Ecosystem Growth Holdings, INC. // 2020 Lucas Vogelsang <[email protected]>, // 2020 Martin Lundfall <[email protected]> // // This program is free software: you can redistribute it and/or modify // it under the terms of the GNU Affero General Public License as published by // the Free Software Foundation, either version 3 of the License, or // (at your option) any later version. // // This program is distributed in the hope that it will be useful, // but WITHOUT ANY WARRANTY; without even the implied warranty of // MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the // GNU Affero General Public License for more details. // // You should have received a copy of the GNU Affero General Public License // along with this program.  If not, see <https://www.gnu.org/licenses/>.  pragma solidity >=0.5.12;  import \"lib/dss-interfaces/src/dapp/DSPauseAbstract.sol\";     This file has been truncated. show original      ",
                    "links": [
                        "https://github.com/centrifuge/tinlake-maker-lib/blob/master/src/spell.sol#",
                        "https://github.com/centrifuge/tinlake-maker-lib/blob/master/src/spell.sol#"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.896353646353646
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#14",
                    "likes": "0",
                    "time": "03/12/2020-09:18:11",
                    "content": "I don’t see what this spell proves. I am more than happy to let the contract team taking more time to check the overall contract orchestration especially as you are the first with this type of contract. And I personally don’t think it is at the other side to check the contracts. Here Maker takes the risk not centrifuge. And for Maker it is a big risk. But I appreciate that you have also checked on your side to decrease the risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#15",
                    "likes": "5",
                    "time": "03/12/2020-12:33:00",
                    "content": "To address your concerns, we are not proposing to push this spell through without audit but have been working on this in constant contact with the smart contracts domain team. In addition, our team has made tiny contributions to the core codebase of Maker and tools around it, I personally contributed to Chai (a fungible token that locks your Dai into the DSR) and we have worked on this goal as part of the Maker community for more than two years. In addition, Martin Lundfall (MrChico, 5th largest contributor to the DSS codebase: https://github.com/makerdao/dss/graphs/contributors) who has been developing the spell & adapter with us is one of the core contributors to the MakerDAO smart contracts design & develop this together with us. We will have an independent review done by other people experienced with the Maker codebase. Ultimately, the smart contracts domain team will of course review and write an assessment of the changes we’re proposing. I’m the last person to propose anything risky just to rush things. This would be very short sighted for what we all want to achieve: making Maker safer with diversified collateral and growing the supply of DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.699175824175824
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#16",
                    "likes": "1",
                    "time": "03/12/2020-18:28:34",
                    "content": "Really loved hearing what you had to say on the call today, even if we were a little pressed for time. Given the discussion today, are there any next steps community members (such as myself, plenty of passion not nearly as much technical know-how) could undertake to help continue the march toward this unique opportunity? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.739583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#17",
                    "likes": "7",
                    "time": "03/12/2020-20:15:08",
                    "content": "From a Community Pleb’s point of View: As Community member @juan pointed out during today’s G&R call–there are two subjects to consider here–the first is how Community Member @NikKunkel first priority is protecting MAKER. Totally love that–so, thank you Nik, Marc, and the rest of the Oracle Team. The second is the community has spoken about helping Centrifuge prioritizing RWA (I believe that’s what you said Juan) IMO–as a community, we should give Centrifuge & New Silver the benefit of the doubt and provide the 5M DC. I truly believe they both have good intentions, 5M Dai is not something any of us can retire with(ok maybe in El Salvador we could)–and honestly, I want to believe New Silver has bigger fish to fry. At worst–would starting with 2.5M DAI help us move forward? Let’s not forget that there was a successful Pilot conducted by the Foundation. And in the future, when we as a Governance community have to raise the RWA DC to $50M, $100M, $300M, $500M, $1B–we can explore RE analytic tools that will help us monitor the value of RE collaterals. However, these traditional RE Tools won’t help us avoid financial ruin. What will? A TRUST with a personal guarantee? An Audit Firm working on behalf of the community with 30 years of experience? ETH & MKR mooning so we avoid financial ruin? I don’t have the answers. At the end of the day we all have a passion to help replace the traditional banking system. And we can all agree that in order to accomplish such, we are going to have to take on Risk. But at the same token, it is in the best interest and our priority as Nik is doing–to protect Maker. IMO. ON the other hand–once we get the ball rolling with Centrifuge, and reach the DC–should we the community ask these “LendCo’s” to create a TRUST with a personal guarantee? Like 6S capital. Would the Community provide a 50M DC without a Trust in place? Who’s responsibility is it to ask New Silver & others/future RWAs to Create a Trust? So many questions–so little time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.855113636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#18",
                    "likes": "8",
                    "time": "03/12/2020-20:43:39",
                    "content": "If I summarize the discussion, there was 2 separated topics. Oracle Work: @NikKunkel pointed out that having Centrifuge setting the price of DROP is not good. I fully agree and the Risk team made the same decision regarding the underlying asset valuation (not saying that Centrifuge is not giving the good price, we just want to control our own destiny). A temporary fix suggested by @NikKunkel  is to use a DSValue (not sure the name). Basically, Maker Gov update the price manually. We can have the DROP price with a simple formula from Tinlake pool (like this one). Basically DROP start at 1 DAI and increase slowly (up to the DROP APR rate on the page). @spin agreed to that. Risk can take the duty to trigger an gov poll/executive each 2 weeks. Problem solved (even if we need to find a better solution for the long term). I want to add that it’s a credit facility. The Centrifuge SPV can use it or not (they can issue DROP to other investors). Our interest are aligned (as we want the business in order to generate fees). The issue was solved in 30s which shows how we will crush the traditional finance  Prioritization framework: Here the issue is that governance put a signal request to prioritize RWA that had strong participation. On the other hand we had a Collateral Prioritization sheet in which RWA are penalized. What should be done was left to interpretation. I think the signal request took precedence on the spreadsheet (that is far from perfect anyway) but other can think otherwise. Some have decided that RWA are a priority but only one RWA. At the end of the day, it’s an coordination issue. For me, the more logical choice would have been CF-DROP (which is the only one we didn’t published yet …) mainly because it’s already live and they are just waiting on us. 6S is way easier from an oracle and SC point of view (as almost everything is off chain), but is harder from a risk perspective (higher DC, concentration risk, moe legal stuff, …). I really think it would have made sense to do both NS/CF-DROP and 6S before a lot of other things. We could have done better (and me first in line). Hopefully, we are smart and we will progress. As a philosopher said: “To infinity… and beyond!” at full steam ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-should-real-world-asset-collateral-onboarding-be-prioritised-in-the-short-term/4075",
                        "https://forum.makerdao.com/t/collateral-status-index/2231"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.750101461038961
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#19",
                    "likes": "3",
                    "time": "03/12/2020-20:54:12",
                    "content": "    flipflopflapdelegate:  ON the other hand–once we get the ball rolling with Centrifuge, and reach the DC–should we the community ask these “LendCo’s” to create a TRUST with a personal guarantee? Like 6S capital. Would the Community provide a 50M DC without a Trust in place? Who’s responsibility is it to ask New Silver & others/future RWAs to Create a Trust?   Before the call I thought that the Trust model was better (but less on-chain). But I now disagree. For 6S we are trusting respectable trustees (but as you can see in the risk assessment, respectability and human behaviour is always tricky. For Centrifuge assets, the Trust is played by Centrifuge and more specifically the smart contract (that I didn’t read) at least for the issue discussed during the meeting. Who do you trust more? I never saw a smart contract take retirement in El Salvador. And remember we are already trusting Circle to have USD in their bank account (and the banks therefore) and BitGo to custody BTC. 0% risk doesn’t exist. Diversification, risk control and due diligence is the key. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6600958565244275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#20",
                    "likes": "0",
                    "time": "03/12/2020-21:16:51",
                    "content": "Yes I personally have full trust and faith in Lucas and Centrifuge. 100% agree. They mean well. Crossing 42nd Street on a busy day is a hazard and a Risk. Hence, I am pretty Sure BITGO and CIRCLE consortium have a Trust in place. And yes retiring in El Salvador is not recommended.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.739583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#21",
                    "likes": "1",
                    "time": "03/12/2020-21:32:53",
                    "content": "Did Centrifuge ever clarify why their model (for liquidations) doesn’t require registered broker dealers? These tokens are admittedly debt securities so why isn’t a registered broker dealer involved in their model? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Philinje",
                    "index": "#22",
                    "likes": "1",
                    "time": "04/12/2020-13:17:10",
                    "content": "This is a good question and the initial answer is that Centrifuge and their issuers use Securitize when selling tokens. This handles some of the legal issues. Lucas is supposed to publish some info about overall legal issues here on the forum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving information on legal issues related to proposal",
                        "3rd party answering a question related to proposal",
                        "None"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#23",
                    "likes": "1",
                    "time": "04/12/2020-14:59:30",
                    "content": "@Philinje & @Tosh9.0 the summary is: MIP22 liquidations doesn’t actually transfer the underlying DROP security tokens to any third party, they are always in posession of the Maker adapter and the DAO uses the Tinlake smart contracts to enforce a liquidation. There are no BDs needed to facilitate this transaction as the liquidation occurs by returning them to the issuer. I would refer you to the MIP22. As @juan mentioned in the call there are two topics that are somewhat related in this thread, the overall priority of RWA and specifically what to do about New Silver and ConsolFreight the two collateral types that use Centrifuge to get onboarded with Maker. @SebVentures has outlined some first ideas on how specifically we should move ahead with New Silver and I will start a new thread outlining a proposal. Let’s keep this thread to discuss the priority of RWAs overall. What should we do next here? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.396989374262101
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#24",
                    "likes": "0",
                    "time": "04/12/2020-15:18:26",
                    "content": "@spin this is probably a nutty idea–but how about Centrifuge puts up a collateral of say 500K DAI/$500K USD composed of 50% DOT and 50% RAD into a multi-sig Maker Community controlled Wallet? Again, prob a crazy idea… Would the Community be open to anything out of the ordinary since some are worried of a 5M DAI DC? Just thinking out loud–I might be pushing the envelope here… and not sure if that would move things forward… but something has to move us forward IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#25",
                    "likes": "4",
                    "time": "04/12/2020-16:00:26",
                    "content": "Words from the Wise–or Maybe I should  say battled tested: image548×521 73.2 KB ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#26",
                    "likes": "1",
                    "time": "04/12/2020-16:03:44",
                    "content": "@flipflopflapdelegate I started the 48 laws of power recently and this sounds similar. I agree that we need to focus on the root causes of onboarding RWAs in order to circumvent them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Philinje",
                    "index": "#27",
                    "likes": "2",
                    "time": "04/12/2020-16:34:13",
                    "content": "To add a bit to this comment, Centrifuge is providing a bridge between the off-chain assets and the on-chain world. It is a benefit to have the Centrifuge platform, because it makes it easier to integrate with the Maker vault and also to monitor the underlying portfolio. So in my opinion, projects that use Centrifuge have lower overall risk. It may not be possible to turn real world assets into entirely on-chain assets (though many are trying), and instead Centrifuge takes a practical approach to tokenizing debt related to those assets, as a bridge built on smart contracts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.653061224489796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#28",
                    "likes": "0",
                    "time": "04/12/2020-16:42:28",
                    "content": "Lucas, you may be able to technically ensure near-immediate liquidation of the securities that people have purchased with the MIP 22 design, but people are still buying securities from the DAO. You’ve stated multiple times that DROPs are debt securities, so you have to have a B/D involved no questions asked. If you disagree with that, can the DAO please see some analysis from your attorneys at Manatt explaining why you don’t need a BD? Since your team is trying to onboard regulated financial products to the DAO (a hot button topic), we need to see something that explains your setup’s legal/regulatory justification. @Philinje ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#29",
                    "likes": "0",
                    "time": "04/12/2020-16:47:00",
                    "content": "I’m not sure I understand what you are saying. What makes you think that “people” are buying securities? No keeper is bidding on these assets, we don’t have a regular liquidation where anyone bids on collateral. I think this is a misunderstanding of the functionality of MIP22. The MIP22 liquidation is only operated by the smart contracts maintained by the issuer of debt. The issuer is not asking anyone to participate in this liquidation and is merely relying on the smart contract the issuer has deployed to repay the vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.732142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#30",
                    "likes": "4",
                    "time": "04/12/2020-17:03:34",
                    "content": "Just to frame the problem, Centrifuge is the technological provider, not the asset originator. To compare that to cUSDC, Circle would be the asset originator and Compound the technological provider. For 6S, 6S Capital is the asset originator and the trustees (Wilmington Trust or others) are the technological providers (in that case humans using the paper and pen technology). Now if the community prefers to trust people from the banking industry than a smart contract, that would be a news !   Again, the DROP price issue can be solved by setting the price ourselves just like USDC and other stablecoins like GUSD. When we will get tired of updating the price manually, we will check how the smart contract set the price and decide to trust it or not. I must add that both Centrifuge and New Silver are invested in the pool, they both have skin in the game. So if they raise he price of DROP, they lose money. If they lower it, they will be sued by DROP co-investors. In the Risk RWA team we have decided to ask asset originators to have skin in the game. This was waived for 6S (but I had to agree that 6S, just like Centrifuge are spending a lot of money to make this work). I think the risk issue is solved for Oracles, the question is what is the priority to set the price feed controlled by Maker Governance. The New Silver pool is live and the first loan should be made this week or the next one. You can see the DROP price on the bottom right here. Currently it’s 1.0, and it will increase slowly by up to 5% a year. RWA could be reality end of this year, early next year. If there is a critical smart contract risk, let’s do nothing but otherwise let’s just find solutions. We fixed the oracle issue in exactly 30 seconds with the safest method possible. I keep hearing how Maker was always intended with RWA in the future. The day we lent to a Wawa or a house renovation this will no longer be the future, it will be done. Checked once for all. This day could have been next week. But we will be late. Let’s not get too late (like after Cresco and Aave) and celebrate this victory. ",
                    "links": [
                        "https://tinlake.centrifuge.io/pool/0x53b2d22d07E069a3b132BfeaaD275b10273d381E/new-silver-2",
                        "https://tinlake.centrifuge.io/pool/0x53b2d22d07E069a3b132BfeaaD275b10273d381E/new-silver-2/investments"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.974275724275724
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#31",
                    "likes": "3",
                    "time": "04/12/2020-17:36:16",
                    "content": "    SebVentures:  I keep hearing how Maker was always intended with RWA in the future. The day we lent to a Wawa or a house renovation this will no longer be the future, it will be done. Checked once for all. This day could have been next week. But we will be late. Let’s not get too late (like after Cresco and Aave) and celebrate this victory.   So true! And thank you for posting the New Silver Pool. I was thinking this morning of an interview with Real Estate Investor Sam Zell about his trails and tribulations of how hard it was to convince Traditional Institutions to Adapt Real Estate as an Asset Class. From the Tim Ferris Show: Sam Zell: In 1989, 80 percent of the institutions that I pitched to didn’t have real estate as an asset class. Peter Attia: Let me make sure I understand what you’re saying. You’re saying 30 years ago — Sam Zell: 30 years ago. Peter Attia: 80 percent of pensions and endowments didn’t have real estate in the book of business? Sam Zell: As an asset class, that’s correct. They owned stocks and they owned bonds, and that was it. Are we, the Maker Community going to be the “institution” that only cares about onboarding ETH, USDC, and __________? Or, are we going to rewrite the History books? “Those who do not learn history are doomed to repeat it.” –Santayana ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.32739898989899
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#32",
                    "likes": "3",
                    "time": "05/12/2020-13:28:49",
                    "content": "I will vote for you if you somehow run for office in Korean politics ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#33",
                    "likes": "2",
                    "time": "05/12/2020-16:10:19",
                    "content": " Vote for Centrifuge and @spin – we need the best of the best to see our Community and Maker grow exponentially. BTW,  Would love to visit Korea! One day. MakerCon S. Korea 2022??? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 9.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#34",
                    "likes": "1",
                    "time": "05/12/2020-21:46:50",
                    "content": "    SebVentures:  In the Risk RWA team we have decided to ask asset originators to have skin in the game. This was waived for 6S   I thought in Matt’s term sheet he is going to be maintaining a conservative debt/equity ratio? Is the equity not his “skin in the game”? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#35",
                    "likes": "0",
                    "time": "06/12/2020-00:15:38",
                    "content": "The equity is from a third party for 6S. As said, both Centrifuge (and NS and CF) and 6S have invested a lot of time an money to work on onboarding RWA. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#36",
                    "likes": "2",
                    "time": "06/12/2020-17:06:26",
                    "content": "To be clear, the money thus far spent (and about to be spent) for 6s’ related trust implementation is not coming from investors (nor will it be reimbursed). It is coming from the principals of 6s. It is the definition of gut risk equity. We are only raising external investor capital (pref equity) when it is time to marry debt and equity for a given transaction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#37",
                    "likes": "0",
                    "time": "06/12/2020-18:44:00",
                    "content": "I wanted to know if at some point, there is some chances to have somehow a proper S6 tokens inside the vault and somehow some liquidity for it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#38",
                    "likes": "8",
                    "time": "07/12/2020-18:51:32",
                    "content": "I wanted to share a quick update and some exciting positive news! New Silver has now received both the risk assessment and yesterday @cmooney published the smart contract domain team assessment. This means that two of the three necessary sign-offs have now happened. I’m super excited to see New Silver to be this close to the finish line! New Silver is excited by the prospect of onboarding their collateral type which is a huge milestone considering where we all as a community were over a year ago when New Silver financed a first transaction financed at the time with SAI(!): 2020-12-07-170022_2542x1114_scrot2542×1114 292 KB In summer we did a first pool financed by New Silver itself funding a portfolio of seven houses, including this one: newsilver_house1200×628 140 KB For those of you who missed the conversation that mostly went on in the #governance-and-risk channel on chat.makerdao.com, I wanted to briefly summarize the solution that was worked out and share a few of the relevant comments: @NikKunkel initially came forward with the proposal to simplify the oracle infrastructure greatly and at first rely on governance to set the price, like it is done for SIXS & stablecoins (like USDC):  I acknowledge that we’re doing something new and we have to start somewhere. That means more risk, but it doesn’t mean we should blindly accept risk. I suggested a short-term solution on the Governance & Risk call yesterday of a “manual” Oracle (DSValue owned by the DAO whose value could be changed through Maker Governance.  This is slightly less capital efficient but if updated at least monthly a completely acceptable solution for New Silver to start out with. @SebVentures also confirmed that the RWA-WG and risk team are happy with that proposal:  @cmooney @nik I agree that changing the contract is too much risk even if the risk is low. We don’t force the customer to take the loan. Our risk, our conditions. This compromise is fair to me. Centrifuge, New Silver and ConsolFreight were super easy to work with, we made many requests and they always responded quickly. I personally feel that we are not rewarding the work they have put in (neither the work of philinje and williamr). The fact is that Centrifuge would have been better off by putting a funny token in the vault (which I’m not happy with) than a token that actually represents something. We are penalizing the fact that they try to find an on-chain solution for an off-chain problem. Neither do I agree with the idea that a spreadsheet is more important than an on-chain decision by Maker Governance. Nevertheless, we need to move as a team. And within a team we don’t have to always agree as long as we are moving forward. At the end, the MKR way is the way. We have mandated actors to make the hard decisions for a reason.  Most of these conversations happened Thursday December 3rd after the Governance and Risk call and if you are interested in more context, feel free to head over to the channel to read up on it. With the oracle question resolved, the only component missing is the oracle assessment (a similar one was published for 6S). We are looking forward this exciting moment when we will have some of the first DAI minted with loans originated in the real world - Let’s look into 2021 with many more to come! ",
                    "links": [
                        "https://forum.makerdao.com/t/ns2drp-ns-drop-mip22-token-smart-contract-domain-team-assessment/5517",
                        "http://chat.makerdao.com",
                        "https://github.com/dapphub/ds-value/blob/master/src/value.sol",
                        "https://forum.makerdao.com/t/sixs-rwa-001-collateral-onboarding-oracle-assessment-mip10c3-sp18/5378",
                        "https://forum.makerdao.com/t/p1-drop-mip6-application-peoples-company-drop-us-agricultural-real-estate/5518/6",
                        "https://forum.makerdao.com/t/cf-drop-mip6-application-consolfreight-drop-tokenized-freight-shipping-invoices/2214/30",
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215",
                        "https://forum.makerdao.com/t/htc-drop-mip6-application-harbor-trade-credit-drop-short-term-trade-receivables/3502"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.989130986201299
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#39",
                    "likes": "0",
                    "time": "07/12/2020-19:51:54",
                    "content": "I don’t know much about oracles, but CrescoFin is going to use Chainlink as proof of reserves for their iCRES token. Would it be possible to partner with Chainlink to do something similar with tokenized RWAs? If so, it would make the whole thing more automated and less susceptible to a single-point of failure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.2976190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#40",
                    "likes": "2",
                    "time": "07/12/2020-20:41:29",
                    "content": "    spin:  In summer we did a first pool financed by New Silver itself funding a portfolio of seven houses, including this one:   Nice! Wow. A house in the suburbs/outside of New York City–that was impeccable timing–seems everyone is moving out of the City; they probably made a sweet profit with this portfolio. All in all this is excellent news–looking forward to New Silver joining the Maker Community in 2021! And I’m 150% sure the Oracle Assessment Team, a.k.a @NikKunkel  will drop it like it’s Hot  Always dropping assessments at the most odd hours of the night–hard work & dedication!  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.801864801864802
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#41",
                    "likes": "12",
                    "time": "18/01/2021-10:55:14",
                    "content": "I wanted to share a brief update on New Silver and the work involved in getting it onboarded as collateral. Assets & Originations New Silver is originating new loans on a weekly basis. They have slowly started to grow their pool but most loans had to be sold to traditional lenders (like yieldstreet) because of liquidity constraints. Nevertheless, investors have contributed over 500k in DAI to the pool and they’ve originated a total of 3 loans:  View on tinlake.centrifuge.io and an overview of the different assets:  View on tinlake.centrifuge.io Status:  Asset Originator is ready to scale up the vault Smart Contracts & Technical Integration We’ve continuously iterated on the adapter specified in MIP22. The first review and official approval was made by @cmooney on the 20th of December. Centrifuge has since made improvements to the adapter and addressed all requested changes. There is also a spell for kovan. This spell is ready to reviewed by the Smart Contracts team and can be executed on Kovan as soon as that’s done. Once that’s done, deploying on mainnet should be only require copy & pasting the Kovan spell but we are slated behind MIP21 right now so this might still take some time. An RPC Test shows the integration working properly. Status:  No major blockers on a technical level but a few other topics are holding up progress here. Oracles The RWA team & the risk team have proposed to use a fixed price provided by a DSValue for DROP identically to how USDC and other stablecoins. This solution was discussed on the governance call  December 3rd. A mandatory component of the Maker Governance is the official sign-off of by the Oracles Domain Team. This was discussed in the #governance-and-risk channel on RocketChat: 2021-01-18-103406_2191x1212_scrot2191×1212 391 KB We have since talked to several community members to review the proposed solution and have not found any technical issues. The Kovan spell referenced above already uses a DSValue for the price and provides all the technical work (there was no need to modify DSValue at all). Status:  Even though the work is minimal, until Oracles Assessment is published, NS2 is blocked from going live. Next Steps? New Silver first started working with Maker & the Maker Foundation in August 2019 and did a first successful pilot transaction. New Silver is on standby to start minting DAI as soon as they’re added to MCD. We are now on the home stretch to bring this live in production. I hope we can resolve these blockers soon and achieve on one the key milestones for MakerDAO: to diversify the collateral types into real world asset backed USD-stable collateral! ",
                    "links": [
                        "https://tinlake.centrifuge.io/pool/0x53b2d22d07E069a3b132BfeaaD275b10273d381E/new-silver-2",
                        "https://tinlake.centrifuge.io/pool/0x53b2d22d07E069a3b132BfeaaD275b10273d381E/new-silver-2/assets",
                        "https://tinlake.centrifuge.io/pool/0x53b2d22d07E069a3b132BfeaaD275b10273d381E/new-silver-2/assets",
                        "https://forum.makerdao.com/t/ns2drp-ns-drop-mip22-token-smart-contract-domain-team-assessment/5517",
                        "https://github.com/centrifuge/tinlake-maker-lib/commits/master",
                        "https://github.com/centrifuge/tinlake-maker-lib/pull/9",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-24th-2021-updated-payout-formula/6246",
                        "https://forum.makerdao.com/t/poll-rwa-risk-onboarding-sections-most-valuable-insights/6123"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3735215677179955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#42",
                    "likes": "5",
                    "time": "18/01/2021-17:24:42",
                    "content": "I believe during last weeks G&R call @NikKunkel said he was aiming/hoping to have it done by this past Sunday–perhaps we will get the Oracles Assessment in the next 48. I’ll get my Grandma’s  and put them to use  I think eventually with the success of DeFi protocols on Ethereum, once we are post-foundation, and Nik has his Core Team establish–he can look to onboard a full-time human that can do both Oracles Assessments and RWA Assessments (something of that nature). Not sure if there is an abundance of Talent out there–but his Team can use the extra hands and the RWA view. Totally stoked about that coming into fruition. For now I will be stoked just to get 1 RWA on the balance sheet. All in all – I must say that the Centrifuge Products are gaining traction. Every day that I lurk on their TG, all these humans are asking how to onboard themselves to the Centrifuge Platform. It’s none-stop! Word. Folks are thirsty for RWA products via the blockchain. “Let’s get it on” –Marvin Gaye ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#43",
                    "likes": "0",
                    "time": "18/01/2021-19:20:49",
                    "content": "Hey, Lucas. I love to see progress on this front. My 2 cents: maybe this type of post merits their own thread (compared to being dug in a related one). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#44",
                    "likes": "0",
                    "time": "20/01/2021-03:02:33",
                    "content": "Chico Crypto Just took RWA and Centrifuge to another level! The Centrifuge TG is on       Let’s get it Fam!      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#45",
                    "likes": "0",
                    "time": "21/04/2021-09:02:36",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}