{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-april-26-may-2-2022/14939",
            "title": "Weekly Relay | April 26 - May 2, 2022 ",
            "index": 14939,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "5",
                    "time": "03/05/2022-17:04:28",
                    "content": " 1727×390 307 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop-shop for MakerDAO updates.  Online flipbook version available here.   We have some new ideas for improvement and would appreciate your feedback to help make the Weekly Relay a more enjoyable publication.   Check this out!   SES and Julian are researching challenges and opportunities for Maker regarding environmental, social and governance (ESG). They are currently asking the community’s opinion to help identify topics with potential business relevance. Check out the survey here. For more information.   Current Events Developing an aggressive growth strategy for Maker has become a hot topic in recent weeks. The following three posts all touch on this theme from different angles: 1. Branding, marketing, and internal vision alignment; 2. Designing a more efficient balance sheet to maximize returns; and 3. Making use of different financial levers to boost organic demand for Dai. MakerDAO - intangibles for a better DAO @Mamun posted a follow-up to his previous post focused on the need for developing an internal alignment strategy among makerDAO contributors and Core Units, especially concerning branding and marketing/communications. In this early stage of their development, much of the attention surrounding DAOs have been on the technological and software side. @Mamun argues that “the messy nature of human interaction within DAOs” has not been addressed sufficiently. In a traditional organization, an organization’s brand and core values are defined from the top down. In DAOs, on the other hand, participants within independent structures such as Core Units may not always have a strong idea of the unified purpose and general overall goals of the DAO, which can lead to misalignment between contributors and Core Units. Since Core Units often need to work together and collaborate on tasks, this can create issues. The post goes on to argue that while proactivity and collaboration are two of the most important qualities to seek out in a DAO contributor, without a “common vision” and the structure and culture to support it, we won’t be able to grow and progress at the rate we would like to no matter how many productive members we have, even if they collaborate well. In short, the post argues that Maker suffers from a lack of mission and vision, visible in the relative independence of Core Units and what some see as their focus on operating according to their mandate, which “does get in the way of collaboration.” Knowing where we’re headed and defining relationships between Core Units can foster a more collaborative and coherent inter-CU working environment. The current state of CUs  An operational map focused on promoting collaboration and proactivity structure  This post has already generated many discussions. Join in here! A Balance Sheet approach to executing an Aggressive Growth Strategy - The road to 300M revenues Joining the ongoing forum discussion on developing and executing an aggressive growth strategy, @SubVentures shared his approach based on balance sheet design.  Our current balance sheet is slightly underinvested and leaves about 9-11M DAI in annual revenues on the table.  We explore short-term bonds and ETH investment, as these assets don’t depend on external factors. Both would increase profitability for MKR holders but will be constrained by the Surplus Buffer size     772×319 14 KB  The main exposure we have (62%) is stablecoins, which don’t need capital or bring revenues. The next item is crypto-backed loans, bringing 90% of revenues while only 35% of our exposure and 88% of the needed capital. DeFi Money Markets are far behind, as well as RWA. Option 1a: Optimize current activity by investing excess capital in short-term bonds. In short-term bonds, investing excess capital (current Surplus Buffer minus capital at risk of the previous model) would allow a 373M DAI investment. This investment would provide 9M DAI of additional revenues, push the RoE to 122%, and Price to Sales to 5.3%.  779×417 14.8 KB  Option 1b: Optimize current activity by investing excess capital in ETH. Allocating the current excess Surplus Buffer to ETH would only enable an investment of 13M to keep the CaR within the current Surplus Buffer. However, despite the small investment size, it would lead to an 11M Dai increase in annual revenue, though ETH RoA will be quite volatile compared to short-term bonds.  780×419 14.6 KB  The Strategic Finance Core Unit recommends a mixed allocation of short-term bonds and ETH. The community will determine the final allocation.  Trying to model the Aggressive Growth Strategy, we learn that a capital raise could be accretive and that scalable asset types are important  Even with a significant growth plan (+2B crypto-backed loans, +300M RWA, +1B crypto D3M), it is not enough to deploy all our asset base if we can’t rely on scalable asset types (e.g., short-term bonds, ETH). Assuming full deployment of our asset base (through the expected plan or with only short-term bonds), the capital raise (issuing MKR tokens) is accretive for MKR holders (i.e., it increases their earnings). Using a debt offering at 10% is accretive as well. The structure of the debt issuance is not discussed but is assumed to be equity-like (which might not be the case).A   Adopting a diversified and liquid balance sheet approach would increase 300M revenues.  This would give 304M annual revenues vs. the current 76M    A proposal by a team of several different members of different Core Units for raising capital and debt to finance an aggressive growth strategy suggested increasing exposure through the use of three primary levers:  Institutional Vaults: Tailored crypto vaults (ETH, WBTC) for institutions Real-world assets Multi-chain expansion: This is about deploying Maker MCD on L2 or a different L1 and/or providing D3M-style liquidity to crypto- lending platforms.   784×465 19 KB  An increase in exposure satisfying certain conditions will push the required Surplus Buffer to 157M Dai, meaning 87M Dai will be left to be raised. If we raised it 100% in equity, it would cost the protocol about 48K MKR (assuming the price stays the same), which corresponds to a 5.4% dilution for current MKR holders. Meeting these targets would increase revenues to 187M DAI annually. This represents a Sales to Price of 11%, whereas previous scenarios only achieved up to 5.4%. The Return over Equity is down to 119% and decreases as we rely less on high-RoE crypto-backed loans. This scenario could also be financed through debt, resulting in a lower RoE but higher Sales to Price. Option 2a: Extending exposure to short-term bonds is favorable even under a no-growth scenario  783×398 18.2 KB  Even using a worst-case model, in which we “invest in short term bonds and essentially limit ourselves to investing our excess float for our current debt capacity,” we would end up with a 2.8B exposure in short-term bonds, while the newly raised capital would still be fully used. Even in this worst-case scenario, the capital raise would be favorable for current MKR holders, with a Sales to Price of 9.6%. Option 2b: Adding ETH to the mix is even more favorable  776×485 20.2 KB  We use the following conditions in our model for adding ETH to the asset mix:  Increase of 2B DAI in crypto-backed loans through Institutional Vaults and L2 MCD deployments Increase of 1B DAI in DeFi Monet Markets with new D3M for Compound, Fuse, and others Increase of 300M DAI in RWA Investing 100M DAI in ETH Keeping a 15% buffer in stablecoins The remaining is invested in short-term bonds. The gap between the current surplus buffer and the Capital at Risk of this allocation is raised on the market at the current MKR price.  As demonstrated, adding 100M Dai worth of ETH increases the capital raise by 91M. Impact analysis of three environmental factors:  Diversifying and building stronger liquidity can further optimize the balance sheet and improve outcomes.  776×459 19.7 KB   We conclude that having a high-level model is good to focus the protocol on what kind of balance sheet it wants to target and how:  We should focus first on what mix of asset types we are targeting Then, focus on starting with asset items that are scalable so we can allocate the balance sheet quickly in a focused way Then optimize the mix by adding non-scalable assets   908×599 16.9 KB  Note: The full post is long and in-depth. Suppose you’re interested in a deeper investigation of these ideas, head over to the full post here. A North Star - DAI as the Destination In this post by @teej and a team of other contributors, increasing organic demand for Dai is put forward as a potential “single, core mission” for Maker. There is a key distinction between Dai as a means to an end—e.g., when a real-world asset manager opens a vault to swap Dai for fiat to achieve something off-chain, like developing real estate—and Dai as an end itself, or destination—e.g., when a crypto user opens a Dai vault to use Dai proceeds themselves to achieve something on-chain, like providing liquidity to an AMM. Why do we care about organic Dai? Because it’s stickier. The stickier the Dai is, the higher, longer-term, and potentially more profitable risks Maker can take on business products like D3Ms and RWAs. Since all outstanding Dai is a liability of the protocol, this is a critical issue. The goal is to establish a feedback loop in which increased revenue improves market sentiment about Dai, driving further organic Dai demand, thereby creating more revenue-generating opportunities, beginning the cycle anew. Here’s a look at how our Dai is doing on the means vs. destination front.     Is Dai the Destination?     Crypto-Loans   PSM   D3M   RWAs     Aggressive Growth - Framing the Fund Raise  The core of MakerDAO is its direct crypto loan business, which should remain “rigid, maximally decentralized, and permissionless.” The second layer, the PSM, should also remain somewhat rigid but have some flexibility at the same time. The D3M and RWA layers are where a larger surplus buffer has the potential to usher in a new era of growth. One of the keys to aggressive growth will be the pursuit of off-chain RWAs. In addition to bringing in revenue, partnerships fostered by the RWF Core Unit with known and respected organizations will improve the Maker brand, bringing on the increased organic demand for Dai we’re looking for. The authors believe that the present distinction we make between D3M and RWA will eventually dissolve as the lines between DeFi and TradFi blur (a trend that will increase as real-world financial rails and traditional assets move on-chain). They offer two new product ideas for consideration. Model 1: B2B DAI  There is no institutional, commercial lender for on-chain commerce. Unlike the traditional commercial lending market, the on-chain commercial lending market is nearly untouched, meaning growth potential in this direction is very high. Model 2: EZ DAI (DAI For Normies) Maker vaults can be useful products for the crypto-savvy but present a steep learning curve for the average individual crypto investor or institution. Two options for products more accessible to “normies” include:  Access Vaults: The Maker community has historically referred to these as Institutional Vaults (think Nexo and Celsius). These products could combine third-party custody, simple user interfaces, and other optimizations for everyday users to tap into a heretofore underreached market. Corporate Vaults: These would essentially be crypto-secured term loans to corporate clients. As large-cap cryptocurrencies like ETH and BTC grow in popularity as treasury assets, organizations using them will seek ways to borrow at decent rates against their holdings.    This Week in Governance  Maker Improvement Proposals (MIPs) Weekly MIPs Update #85 by @blimpa   1380×776 27.3 KB    The Formal Submission Window is now open. Eligible proposals have been confirmed and will have their Ratification Polls live on May 9 and run for two weeks until May 23. May’s Formal Submission Window closes on May 4. The latest date to post a proposal for June’s Governance Cycle is May 11.  Pre-MIP Discussions:  Anti-inflationary Proposal Auction-backed DAI IAM for Surplus Buffer Proposal Ideas on the Forum [Pre-MIP] Using Gyroscope to cut through Dai’s Gordian knot: its USDC dependency An RWA style solution to replace the PSM   Executive Vote(s) Core Unit Budget Distributions - April 29, 2022 This executive proposal passed, the following changes occurred within the Maker Protocol: Core Unit Budget Transfers As per multiple successful budget proposals, a total of 1,057,918 Dai was transferred to multiple Core Units:     Core Unit Transfer Amount Proposal     Protocol Engineering 800,000 DAI Proposal   Events 149,692 DAI Proposal   Governance Communications 73,226 DAI Proposal   Strategic Happiness 35,000 DAI Proposal     Core Unit Budget Streams As per multiple successful budget proposals, a total of 9,758,130 DAI was streamed to multiple Core Units:     Core Unit Stream Amount Proposal      Protocol Engineering) 7,590,000 DAI Proposal   Data Insights 1,083,000 DAI Proposal   Events 748,458 DAI Proposal   Governance Communications 336,672 DAI Proposal     DssVest and ESM Interaction: This section clarifies the need for the above vesting streams on a new DssVest contract.  The DssVest DAI contract was updated to prevent vat.suck calls from being possible in an emergency shutdown. This included checking to ensure that vat.suck only works when the system is live for all new vest contracts. The ESM was relied upon for existing contracts to allow keepers to remove pause proxy permissions if governance becomes malicious after shutdown. Note that this is relevant only after a shutdown occurs. All vest functionality remains the same as per the original contract. All existing streams remain the same, but new streams are from a new contract.    Active Governance Polls Please, check out the feedback survey mentioned at the head of this publication to help us improve Active Governance Polls. There are two active polls:     Poll Name Discussion     PPG - Open Market Committee Proposal Discussion   Investigate Implementation of a TrueFi D3M Discussion    Check out April 25th’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls Please, check out the feedback survey mentioned at the head of this publication to help us improve Community Greenlight Polls. There are two active community greenlight polls for the week of April 12 - April 18, 2022.     Greenlight Poll Current Vote Breakdown Begin Date End Date     ATDC (ATD Combustors)  2235×500 75.4 KB  May 2nd, 2022 at 16:00 UTC May 16th, 2022 at 16:00 UTC   IPCL (India Power Green Bonds)  2242×502 76.1 KB  May 2nd, 2022 at 16:00 UTC May 16th, 2022 at 16:00 UTC    Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests Restart The Burn @aburban90 presents his request in favor of reactivating the MKR burn. He states that shutting down the burn also shut down our only revenue distribution model and that we have yet to replace it with anything better. These actions have caused some OG stakeholders to lose faith in our ability to deliver. Our community and stakeholders are very important, and there is a possibility we may be risking their confidence in us if we continue not to burn MKR during times of such low prices. Andrew offers two options for achieving this proposal:  Restart the old burn mechanism immediately, with all inefficiencies intact, and accept the losses to slippage. Restart the burn slower; instead of a hard burn with high slippage, burn slower.  The vote will run until May 12th, 2022 Here are the current voting results:  1705×1152 268 KB   Deploy the balance sheet in ETH As expressed in Towards taking asset risk and A balance sheet approach to an Aggressive Growth Strategy, ETH seems like a sound investment for MakerDAO. Sebastian from Strategic Finance moves forward on the Balance Sheet Approach toward an Aggressive Growth Strategy by gauging community sentiment on whether we would like to begin working on allocating some of the MakerDAO balance sheets into ETH and/or ETH derivatives and, if so, how much. He presents the pros and cons of potentially implementing this investment into ETH: Pros:  MakerDAO is using Ethereum as its home base and is therefore linked to the success of ETH. ETH is a strategic asset for the operations of the DAO because it pays gas fees for on-chain transactions and oracles. Competitors like Celo, TribeDAO, and Angle are holding ETH on their balance sheet, and not holding ETH puts Maker at a distinct competitive disadvantage. The upcoming Merge will significantly reduce the issuance of new ETH and create a competitive market for balance sheets with a high degree of exposure to ETH. Post-Merge staking fees are currently estimated at 7-11%, doubling current staking yields overnight and making ETH a truly productive asset.  Cons:  ETH is a volatile asset whose ETH/DAI price can wildly fluctuate and occasionally go down over significant periods The Merge and L2 impacts can have unexpected long-term impacts on price.  Sebastian also notes that this Signal Request aims to understand whether there is a community desire to work on this topic. No priority is currently being attributed, and a formal implementation for such actions will have to go through the governance processes. The vote will run until May 12th, 2022 Here are the current voting results:  1700×797 173 KB   1700×1265 255 KB   Change lid Parameter on the Rate Limiter The passing and introduction of the Rate Limiting Flapper have been successful, but it only allows to kick off a new auction if the new auction does not increase the total-DAI-currently-in-auction above a certain threshold - the lid unless it’s at the same value as the bump. Currently, the value for the lid is set to 150k Dai, which can run five flap auctions at once. However, ultraschuppi believes there is no good reason to burn so much MKR and proposes setting the lid to the same value as bump - 30,000 Dai. Having a 1:1 ‘lid’ to ‘bump’ ratio will ensure that there is only one parallel flap auction running at any given time. What’s good about this is that in the case of a huge spike on the System Surplus causing spillage to the Surplus Buffer, the time spread of those resulting auctions will be 5x compared to the current setting thereby producing a more steady burn. However, we will limit the maximum MKR burnt per day from 7.2MM Dai to 1.44MM Dai in sacrifice. Vote will run until May 13, 2022. Here are the current voting results:  1705×552 93.4 KB     Community Deep Dai-ve  Tweet of the Week   twitter.com    D 🦇🔊 @EffortCapital  1/2  With D3M coming to @maplefinance  and @compoundfinance, institutions like @GenesisTrading (who leverage both platforms)  should be highly incentivized to borrow DAI for their operations, especially in a raising interest rate environment @MakerDAO   4:55 PM - 2 May 2022           6              Meetings and Events Last Week's Call Recordings  Governance and Risk | Ep. 188   Forum | Video    Focus On #11 | AMA with New Silver   Forum | Video    Issue Discussion Call # 6 | Collateral Onboarding   Forum | Video    Collateral Onboarding Call #41: Oasis Pro Markets MIP6s AMA   Forum | Video    Collateral Onboarding Call #40: StakeWise sETH2   Forum | Video      Upcoming Calls  MIP65 Asset Allocation Call #1: Baillie-Gifford Mandate  TBD   OffChain Collateral Management | Stakeholder Alignment 21   Join Link | Call Notes      Governance & Risk   Join Link | Agenda - Thursdays at 17:00 UTC   Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Real World Finance - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC     Useful Links  Open Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auction data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.    Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @nothsa @Artem_Gordon ",
                    "links": [
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://docs.google.com/forms/d/e/1FAIpQLSc0MsZv8qFQfoJh5w15atJHfC-UknCNChoEP-jU5UfDXMVewQ/viewform?usp=sf_link",
                        "https://youtu.be/V5bliF28cbM?t=2726",
                        "https://forum.makerdao.com/t/makerdao-intangibles-for-a-better-dao/14860",
                        "https://forum.makerdao.com/t/the-maker-brand-team-some-strategic-thoughts/14725",
                        "https://forum.makerdao.com/t/makerdao-intangibles-for-a-better-dao/14860/14",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://forum.makerdao.com/t/maker-growth-strategy-we-must-act-now/14501",
                        "https://forum.makerdao.com/t/a-balance-1",
                        "https://forum.makerdao.com/t/a-north-star-dai-as-the-destination/14838",
                        "https://forum.makerdao.com/t/weekly-mips-update-85/14914",
                        "https://forum.makerdao.com/t/anti-inflationary-proposal/13928",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-budget-distributions-april-29-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP7",
                        "https://vote.makerdao.com/polling/QmWphKJY#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP32",
                        "https://vote.makerdao.com/polling/QmSVzGcm#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP30",
                        "https://vote.makerdao.com/polling/QmWQBUi6#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP11",
                        "https://vote.makerdao.com/polling/QmVdxBE5#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP7",
                        "https://vote.makerdao.com/polling/QmWphKJY#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP31",
                        "https://vote.makerdao.com/polling/Qme3VaY4#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP32",
                        "https://vote.makerdao.com/polling/QmSVzGcm#poll-detail",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP30",
                        "https://vote.makerdao.com/polling/QmWQBUi6#poll-detail",
                        "https://vote.makerdao.com/polling/QmTmehbz#poll-detail",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-april-2022/14863",
                        "https://vote.makerdao.com/polling/QmaoZpA8#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-truefi/14563",
                        "https://forum.makerdao.com/t/weekly-relay-april-19-25-2022/14815",
                        "https://vote.makerdao.com/polling/QmRH6Bf6#poll-detail",
                        "https://vote.makerdao.com/polling/QmUQ7VDA#poll-detail",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn/14903",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688",
                        "https://twitter.com/EffortCapital/status/1521171557313392640",
                        "https://twitter.com/EffortCapital/status/1521171557313392640",
                        "https://twitter.com/EffortCapital/status/1521171557313392640",
                        "https://twitter.com/maplefinance",
                        "https://twitter.com/compoundfinance",
                        "https://twitter.com/GenesisTrading",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/EffortCapital/status/1521171557313392640",
                        "https://forum.makerdao.com/t/governance-and-risk-188-thursday-april-28-17-00-utc/14833",
                        "https://youtu.be/V5bliF28cbM",
                        "https://forum.makerdao.com/t/focus-on-11-navigating-real-estate-investment-markets-with-new-silver/14646",
                        "https://www.youtube.com/watch?v=P6Mw6xvBlZ0",
                        "https://forum.makerdao.com/t/issue-discussion-call-6-collateral-onboarding/14751/2",
                        "https://www.youtube.com/watch?v=NJsmZL6mRcc",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-41-oasis-pro-markets-mip6s-ama/14767/1",
                        "https://www.youtube.com/watch?v=xFryn0W5DXc",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-40-stakewise-seth2/14676",
                        "https://www.youtube.com/watch?v=FsaSbsYvKlg",
                        "https://us02web.zoom.us/j/89494848349?pwd=MHhsbEJFTCtCNUJ6VG5YT1E2OGRxdz09",
                        "https://docs.google.com/document/d/1xup8M3mp1Fe-yaf-EfqwZ9bOzkINZQmnEN8G4OU1YSg/edit?authuser=1&usp=meetingnotes&showmeetingnotespromo=true",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-abril-02-de-mayo-de-2022/14970",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-may-2022/15742"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.506461230268048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/05/2022-13:31:11",
                    "content": "    Artem_Gordon:  sentiment on whether we would like to begin working on allocating some of the MakerDAO balance sheets into ETH and/or ETH derivatives and, if so, how much. He presents the pros and cons of potentially implementing this investment into ETH: Pros:   In this there are certainly more pros than cons, I see a risky bet but even with SAI ETH was considered a very valuable asset. No doubt it can be a good idea to have a large amount of ETH which in turn generates returns for the protocol. Excelent work Artem  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.511904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "2",
                    "time": "05/05/2022-02:20:02",
                    "content": "A slow buy could work best to get a longer-term market avg. We also want to think about whether MKR/ETH will increase. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "19/05/2022-02:20:27",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}