{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/idea-additional-financial-incentive-to-get-people-to-participate-in-governance-voting/838",
            "title": "Idea: Additional financial incentive to get people to participate in governance voting ",
            "index": 838,
            "category": [
                "Governance"
            ],
            "tags": [
                "idea",
                "vote-participation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#1",
                    "likes": "2",
                    "time": "22/11/2019-00:25:46",
                    "content": "I’ve been thinking about how we can get more people involved in governance and the more I think about it, the more I end up with the conclusion that it needs to be an additional financial incentive on top of the potential price increase from the MKR burn. Currently anyone who just owns MKR benefits from a stable system, governed by the few, by the burning mechanism but it seems clear to me after a year, that that by itself is not enough incentive to get the majority of (small) MKR holders to participate in voting. So what’s the idea, increase the amount of MKR needed to pay off the stability fee when a CDP get’s closed by a little, like 1% or only burn 99% of the current fee and keep 1%) and instead of burning that 1% like the rest, immediately send it to a random address currently voting for the most recent governance poll  (nomatter what option they are voting for).   People will be incentivised to keep up with voting since the faster they are voting for it, the more chance they have to receive 1% MKR of a payed SF. (every payment of a SF would immediately reward a random current voter voting for the most recent governance poll)   Every extra amount of MKR matters to smaller holders so they should be extra motived to participate.   Reduces incentive to delegate your vote (which is a good thing IMO)   Yeah but whales will just spread their MKR over a 1000 addresses to increase their chance of getting extra MKR Technically they can, but who in their right mind would want to start voting from a 1000 different addresses?! Even assuming it would be possible to automate this in some way, they would still have to pay for gas for a 1000 voting transactions don’t they (? actual question) and I don’t think the amounts of potential MKR “profit” I’m talking about here makes it worth while to do this for anyone already owning more then 1000 MKR. (anyone holding +1000 MKR should already have enough financial incentive from a stable systems burn mechanism) There would obviously need to be  some conditions to reduce the benefit of such “spreading” behavior so I would suggest (just some ideas to start from):  only addresses voting with +1 MKR have a chance of receiving this “voting fee”. if the amount of (1% of the fee) MKR to randomly reward exceeds x.xx MKR, it gets split up and rewarded over multiple random voters (according to a formula to be defined).  Combine this idea with @mrabino1’s idea to have a weighted voting system and I think you will have a lot more smaller voters, who’s vote also actually moves the needle, if only a little. . Can’t wait to hear what loopholes I didn’t think of you greedy bastards  ",
                    "links": [],
                    "GPT-summary": "The author proposes an additional financial incentive to encourage more people to participate in governance voting. The proposal suggests that a small percentage of the stability fee paid by CDP owners be sent to a random address currently voting for the most recent governance poll. The author acknowledges potential issues with the proposal and suggests some conditions to reduce the benefit of spreading behavior. The post also invites feedback and criticism on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.290266106442577
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/11/2019-02:27:50",
                    "content": "I once ask on the Governance call about incentivising MKR holders to come out and vote and receiving some type of financial payout. And I think @cyrus would totally oppose your idea–can’t remember the reason why, but somewhere along the line of vote buying. But IMO your idea has been well thought out so it will be interesting to see what the rest of the community thinks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/11/2019-03:36:21",
                    "content": "Hmm, don’t remember the conversation exactly. I just know that incentivized voting is a tricky subject, and almost definitely out of my domain. But this is crypto, and our community has so many bright people. I’m confident people can cook up something super clever. I am optimistic that we can improve the voting system over time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.427083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#4",
                    "likes": "2",
                    "time": "22/11/2019-09:08:07",
                    "content": "Knowing the executive “ratifies” a poll… I do like a weighted voting system (RE interest rates). I get that people may pick more extremes to sway the vote; however, I believe the inclusive nature of knowing your vote counts (at least a little) has a large “selling” point and the easiest way to get more folks to vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.726785714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#5",
                    "likes": "2",
                    "time": "22/11/2019-09:28:28",
                    "content": "Why? The voting process is working right now, but with a very low percentage of total MKR voting. The system is working, but just not exactly as hoped for/imagined. Paying people to vote is concluding governance has failed and admitting to the general principle that people are not capable of acting in their own interest. Paying people to act in their own best interest is an oxymoron on multiple levels. Long before anything like this is tried the following should be attempted:  governance automation. Take people out of the loop using code. structural changes. Possibly there are elements that now is envisioned using voting that could be replaced with MKR staking. Collateral onboarding is one such example. structural simplification. Refusing non-fungible assets as collateral (just one example) would most likely greatly reduce governance overhead.  Right now however I am just enjoying this experiment and seeing my voting actually mattering for once. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.874188311688312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nrtxrmnd",
                    "index": "#6",
                    "likes": "0",
                    "time": "22/11/2019-09:48:35",
                    "content": "well I would vote if I could but the ethereum UX is awful. I’m using Gnosis Safe wallet that is still not supported on governance portal. Ethereum composability is broken ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#7",
                    "likes": "0",
                    "time": "22/11/2019-10:12:54",
                    "content": " Why? The voting process is working right now, but with a very low percentage of total MKR voting. The system is working, but just not exactly as hoped for/imagined.  Is it actually working if it’s not as hoped/imagined? My suggestion is about adding extra incentive to fix that “not as hoped” issue.  Paying people to vote is concluding governance has failed and admitting to the general principle that people are not capable of acting in their own interest.  I disagree with the fact that this is concluding that governance has failed but participation is just too low and an extra incentive might help.  Paying people to act in their own best interest is an oxymoron on multiple levels.  It’s not paying people, it’s adding a chance of receiving an extra reward for active participation and the more you participate, the more chance you have. Which is not the case in the current version, a shrimp has no influence in a vote and so no influence on the “value” of their MKR.  Long before anything like this is tried the following should be attempted:  governance automation. Take people out of the loop using code.   Not feasible in my opinion or certainly not in the next few years.   structural changes. Possibly there are elements that now is envisioned using voting that could be replaced with MKR staking. Collateral onboarding is one such example. structural simplification. Refusing non-fungible assets as collateral (just one example) would most likely greatly reduce governance overhead.   We will still need voting on Executive Governance polls, so this seems besides the point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4875372023809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "0",
                    "time": "22/11/2019-10:13:35",
                    "content": "So I’m going to dub this idea ‘vote-lottery’ as that seems like a vaguely appropriate label, and I think we’re going to need such labels as more idea like this get proposed and discussed.     kwadrax:  send it to a random address   True randomness on the blockchain is complicated, but I think it’s being worked on? I assume this will get solved by someone at some point (if it hasn’t already.)     kwadrax:  People will be incentivised to keep up with voting since the faster they are voting for it, the more chance they have to receive 1% MKR of a payed SF. (every payment of a SF would immediately reward a random current voter voting for the most recent governance poll)   This is cool, I like the way that it’s a constant stream of random wins.     kwadrax:  Yeah but whales will just spread their MKR over a 1000 addresses to increase their chance of getting extra MKR   Yep, Sybil safety is one of the biggest issues with this sort of reward mechanism. There are a couple of ‘solutions’ to the Sybil issue, but they all have pretty major tradeoffs:  Reward based on the staked/voted MKR (more MKR, higher rewards). Tradeoff is that you lose the incentive for smaller voters. Ensure that the gas cost of voting exceeds the reward. Tradeoff is that in reality this in no sort of reward at all, as the voting cost is now higher than the reward. Only reward above a fixed threshold. Tradeoff is that everyone below this threshold is disenfranchised, and it still doesn’t prevent Sybil action by larger holders.   I wrote down some thoughts about the topic in general in another post: Inclusion of a DAI Stability Index, to MKR holder risk profile ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.414990421455938
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/11/2019-10:32:17",
                    "content": "I have no problem with “vote-lottery”, that’s essentially what it boils down to. The idea was also inspired by things like pooltogether and shuffle token. I don’t think the Sybil safety will be a real issue if we have some conditions that make it not worth the trouble for large holders to even bother. What’s 1 MKR to a +1000 MKR Whale but it’s interesting for anyone with <100 MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.291950113378685
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "22/11/2019-10:45:45",
                    "content": "    kwadrax:  I don’t think the Sybil safety will be a real issue if we have some conditions that make it not worth the trouble for large holders to even bother.   I’m sorry, but I think this is just wrong. Sybil behaviour is always an issue. Even if it’s not worth the trouble for large holders (big if), it will be worth the trouble for medium holders. If it is worth the trouble for anyone then at some point someone will develop a bot that automates the process which can then be used by large holders. Like, it’s just axiomatically worth it. If: Chance of winning * reward > gas cost for entry, then it is worth it to Sybil attack*. But the reward is only a reward if the above is statement is true. It can’t be both a non-proportional reward and be Sybil safe. The fix is to make the reward proportional based on the amount of MKR you voted with, but this makes the system even more plutocratic. * Any one time cost to setup a bot would be quickly overcome by the continuous future reward. Furthermore, you are essentially excluding any medium holder from using the Sybil mechanism based on the technical expertise to setup an automation solution (which means one would eventually be published to resolve this unfair imbalance, and then be usable by large holders too). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.317323481116585
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kwadrax",
                    "index": "#11",
                    "likes": "1",
                    "time": "22/11/2019-10:55:49",
                    "content": "Ok, the Sybil safety is a fair point but:   Making such a system to automate +100 votes is not an easy task I would think, someone would have to put in a lot of time and effort to make this and whats the potential reward in comparison to the work? They are going to need a lot of “rewards” to break even on that work and recurring gas cost I think? (can a techy shime in and estimate how hard it would be to make something like this?)   Sharing that system would not be in the creators best interest   By the time it happens, you will have a much larger community of participating users who might still stick around and “just” stay for the potential appreciating MKR and come up with a solution to it when it happens   My conditions were just some ideas to kick-start a discussion, I’m sure people can come up with other conditions to improve on the idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.234848484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hocr22",
                    "index": "#12",
                    "likes": "1",
                    "time": "25/11/2019-11:40:35",
                    "content": "I don’t know about a financial incentive, but it seems to me like there should be pointers on the new Oasis platform to inform or remind users that they can vote. Perhaps something which displays the current executive vote and voting deadline on the system info cards on the right hand of the screen, or a tile on the Oasis Borrow overview page, and a link to the governance platform would help boost engagement somewhat ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.527597402597403
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bgits",
                    "index": "#13",
                    "likes": "1",
                    "time": "27/11/2019-16:23:37",
                    "content": "I agree with the spirit of this idea but not the implementation. I recently laid out a framework and reasoning for incentivized voting, full post here: https://ethresear.ch/t/incentivized-voting-a-theory-on-greater-network-engagement/6457 In short these mechanisms can be evaluated using modern rational voter theory where voter utility can be expressed as: U = qB − C + T Where q = the probability voter is pivotal B = Benefits if ballot wins C = cost of voting T = extra benefit of voting The reason larger voters turn out is because they have a high probability of being pivotal which outweighs the costs ( C ). This is not the case for small voters which for the same vote will have a negative expected utility. In those cases incentives can bring the utility back to positive. The utility to the voter and the accuracy of the votes can be further enhanced by introducing voter credits, where the voter has the option to claim their fee and accumulate their votes for a future poll which has a high benefit to them allowing them to increase their probability of being pivotal in such votes and not voting merely to collect fees and distort the collective sound judgement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.466798418972331
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#14",
                    "likes": "0",
                    "time": "28/11/2019-11:52:26",
                    "content": "This is paying MKR holders to move the mouse and left-click. Do you have any ideas that incentivizes them to think? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bgits",
                    "index": "#15",
                    "likes": "1",
                    "time": "28/11/2019-13:24:53",
                    "content": "You could try the same design but without the financial incentive where they still have to check in and decide if they want to defer and accumulate their votes or cast for a decision. This will make them stay active so they have a higher probability of being pivotal when there is a ballot of important consequences to them. To stay they are just being paid to move the mouse and click is oversimplified. The cost in terms of time and money in on-chain voting is significant for small holders. From acquiring MKR, to setting up the wallet for voting and then figuring out how to vote can be a significant investment of time and then the recurring gas costs of voting is a cost that impacts small holders more than large ones. incentivization probably would not even fully compensate them where it’s profitable to just show and vote but rather help offset those costs. At the end of the day we don’t expect our elected officials and corporate board members to do proper research and voting for free, but with on chain governance the expectation is that stakeholders show up week after week and pay for the privilege of voting? Again, I refer to the framework of modern voter theory to explore other ways to create positive utility value for voters. This also includes reduces costs through things like offchain vote aggregation which would eliminate gas fees for voters and not clog up Ethereum with everyone voting but rather just have anyone submit a merkle root of all the aggregated signatures and grieving period for anyone to submit a fraud proof. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.745340307840308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "0",
                    "time": "28/11/2019-15:38:23",
                    "content": "    bgits:  The utility to the voter and the accuracy of the votes can be further enhanced by introducing voter credits, where the voter has the option to claim their fee and accumulate their votes for a future poll which has a high benefit to them allowing them to increase their probability of being pivotal in such votes and not voting merely to collect fees and distort the collective sound judgement.   Very interested in this! Thank you for sharing. That said, I think I can see some issues. No matter how many credits you gain as a smaller holder, there is always the chance that a larger holder has stored up more of these credits than you have. Does it really increase probability of being pivotal in future votes? The assumption seems to be that smaller voters will gain credits, and that larger voters won’t? (Though I suppose it increases everyone’s chance at being pivotal in comparison to those that aren’t actively voting.) Your notes on engagement theory are interesting, and I agree that a small voting reward would probably help with engagement, which would hopefully lead to more active and informed participation. How exactly would you implement voting rewards in your proposed framework? Presumably in proportion to the amount of token (+voting credits?) used to vote. So in this case, a portion of stability fees divided between voters based on their stake? Have you given any thought to rewarding only voting credits, or does that nullify the incentives significantly? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.884182098765432
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bgits",
                    "index": "#17",
                    "likes": "2",
                    "time": "28/11/2019-18:30:30",
                    "content": "The utility with voter credits should be higher for all stakeholders and part of the reason why is that different stakeholders have different preferences and knowledge and now they can incorporate intensity of preference and knowledge. A more indepth exploration is outlined here: https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2003531&download=yes The same paper also introduces and attempts to provide proofs for quadratic voting, which also increases the probability of a voter being pivotal, however at this time quadratic voting is not sybil resistant without strong identity which is an unsolved problem, while voter credits are sybil resistant. Funding a pool for each vote and allowing each voter to claim a proportional amount of the funds in the pool Each voter would be able to receive a payout according to: POOL_SIZE X AMOUNT_VOTED / TOTAL_AMOUNT_VOTED I don’t have a strong opinion as to where the funds should come from (it could also come from a portion of MKR that the foundation has earmarked for network incentivization), but I think the compensation should be in MKR so the reward creates a feedback loop for participation that increases stakeholder stake in the network. I think rewarding based on voter credits cast instead of just showing up for each poll should from a rational behavior perspective be worth a bit less because of time value of money being received at a later date. However people don’t generally discount things using a pure utility model, see prospect theory (https://en.wikipedia.org/wiki/Prospect_theory) so they may end up discounting it more severely, it also might have the perverse effect of incentivizing people to vote sooner so they finally receive some compensation for their credits. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Prospect_theory"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.180672268907563
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#18",
                    "likes": "1",
                    "time": "30/11/2019-21:03:46",
                    "content": "I keep coming back to the same question(s). What is the actual goal?   Is it measurable? If the goal is more people - I don’t think we have an accurate means to measure ‘people’.   If the goal is more MKR voting.   Then I think that is measurable but I honestly am not sure this is the goal. The real issue here is the whole 1 MKR = 1 VOTE.   I liken this to 1USD =1VOTE.   The only system we get out of this is whales accumulating more votes because they have the financial ability to.    Trying to incentivize the people runs into the sybil or unique identity problems.    I’m skeptical of credits honestly. I think there is a real perception out here that whales basically control everything.   If you were a MKR whale would you feel more or less threatened/secure if either another MKR whale showed up, or whether this was a group of people with 50K + MKR that voted in unison.  Honestly if another MKR power group showed up would everyone else feel more or less satisfied with respect to governance vote participation? Where I think the rubber hits the road here is who has sufficient votes to carry a vote (how many are required) vs. sufficient votes to potentially signal a ES.    Anything below this has less power than those who have more than this. Also I still have not seen any sort of data regarding governance votes historically so I honestly don’t have a clue what has been going on voting wise vs. what is desired. When I was thinking about this I started looking up MKR holder distribution… I was thinking about the 100-500MKR crowd and that this group was the group to incentivize as they are large enough voting blocks to potentially make a difference in votes, and should be reasonably incentivized because they hold a fair amount of MKR etc. Until I see some measurable historical data, and see a presentation of a measurable goal I honestly don’t see how moving forward on this is possible. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1582341269841265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#19",
                    "likes": "0",
                    "time": "10/12/2019-10:09:12",
                    "content": "I just want to point out that in ancient Athens, those citizens accepting to go to the “Assembly” (https://en.wikipedia.org/wiki/Ecclesia_(ancient_Athens)) to vote were compensated for their effort, and would receive 1day worth of salary. So the idea of compensating active MKR holders is potentially good, imho, and does not necessarily leads to “buying votes” or other negative things. EDIT: quote from https://en.wikipedia.org/wiki/Athenian_democracy#Participation_and_exclusion  After the restoration of the democracy in 403 BC, pay for assembly attendance was introduced. This promoted a new enthusiasm for assembly meetings. Only the first 6,000 to arrive were admitted and paid, with the red rope now used to keep latecomers at bay.[31]  ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Athenian_democracy#Participation_and_exclusion",
                        "https://en.wikipedia.org/wiki/Athenian_democracy#cite_note-31"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.414015151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#20",
                    "likes": "0",
                    "time": "18/12/2019-09:13:09",
                    "content": "@kwadrax , Well like myself i like to vote just to help out here and contribute a little while i can. I don’t own any MKR. I have to agree,it would maybe help getting more into it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#21",
                    "likes": "2",
                    "time": "19/12/2019-02:22:49",
                    "content": "I vote consistently because I believe in having my say, and because I have skin in the game. Yet, my vote is minor–but just the fact that I voted makes me feel apart of this community. I also want Media Outlets to stop saying, well only 14 wallet addresses participated in the SF of blah blah blah. There are plenty of MKR and non-MKR holders that care about what we’re doing here with the guidance of the Maker Foundation, and some that oppose such–but still care and have passion for DAI/MKR. So all-in-all I really won’t change my voting habits based on incentives. Would I like to be rewarded 0.001 MKR per positive outcome, yes. Would I be okay with “Staking” my MKR to a respectful staking service bureau that has passion for MakerDAO? Yes. Here’s an interesting op-ed: https://www.washingtonpost.com/opinions/2019/04/04/how-do-we-get-people-vote-lets-try-financial-incentives/ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.110795454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#22",
                    "likes": "2",
                    "time": "19/12/2019-17:53:19",
                    "content": "How about punishing everyone who doesn’t vote? Later that could be improved to punish also those who deviate very much from the final results. There are many examples in real life where those who are inactive or lazy are punished by paying a bigger price, bigger tax, a fine… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4437500000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#23",
                    "likes": "0",
                    "time": "22/12/2019-14:15:44",
                    "content": "Notice in your example - the ‘people’ had to show up.    Also it wasn’t 1 gold coin for 1 vote. Two very distinct differences regarding ancient Athens and Token voting. The very real problem here is so far no-one has proposed any means to connect the person to voting…  Much less having such a proposal accepted by the community. Someone else posted below that we could punish people not voting.   I think any proposal regarding punishing MKR that doesn’t vote probably would be voted down.  I honestly can’t think of any reward system for voting that could not be gamed in some way for advantage by larger players. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.642361111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mark0",
                    "index": "#24",
                    "likes": "0",
                    "time": "02/01/2020-05:41:21",
                    "content": "What about paying interest for mkr tokens locked up in the voting contract. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ginworkflow",
                    "index": "#25",
                    "likes": "1",
                    "time": "03/01/2020-21:21:33",
                    "content": "When looking at other DAO projects/platforms it seems like a reputation system or lock up periods (or maybe a combination) is the way forward. However these approaches also appear to be very untested in practice so might take some time before an additional financial governance incentive could be implemented. Imho this should however be one of the features/improvements with the highest priority which doesn’t seem to be the case (I might be wrong on that however). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerWOW",
                    "index": "#26",
                    "likes": "0",
                    "time": "04/07/2022-22:10:03",
                    "content": "    MakerMan:  I think any proposal regarding punishing MKR that doesn’t vote probably would be voted down.   Apologies for resurrecting such an old topic, but I prefer building on previous discussions over introducing new threads, especially considering that I’m really new to the ecosystem and don’t feel ready yet to just start new posts as I like (for fear of increasing the noise-to-signal ratio)… Also especially considering the nature of the topic, and the real potential that this may be a naive suggestion, I’d rather just get a ‘temperature check’ on it… Anyway, @MakerMan have you heard about Ergo’s Storage Rent mechanism for… Well, I am reticent/loath to call it a punishment… But it’s a mechanism for charging a fee to older, potentially abandoned wallets, in order (among other things) to recoup ‘dust’ and also funds from ‘lost’ wallets, etc, and return that ERG into the ecosystem… My (again, potentially naive) proposal would be that Maker consider something like this for wallets that don’t vote… After a period of time (or x number of votes not participated in, etc) a small amount of MKR could be removed from the wallet and go somewhere where it will be useful to the protocol as a whole… I think the obvious hurdle in implementing this would be whether you can tracks funds across wallets… Otherwise, a simple transfer to a new wallet before the deadline for the fee to begin (or even once it has begun) would ‘reset the clock’… But I wonder: If someone is active enough to move wallets before the fee begins, couldn’t they also just participate enough to avoid the fee as well…? Also, this could be a way to attract more delegation instead of actual, individual voters… If funds are delegated then they’d be immune to the fee, since their MKR is de-facto actively being used in governance (by the person they’ve delegated to…) I also wonder how this would impact the locking of MKR into DeFi protocols, etc… I think depending on the time-scale of the fees beginning vs. the average DeFi lock-up period, this might also disincentivize MKR holders from locking their MKR up for too long to earn interest/yield, since after a certain point it would then also start getting hit by these inactivity fees… FWIW: It seems to me that locking your MKR into DeFi (especially for longer periods) is antithetical to the Maker ecosystem, so the added bonus of disincentivizing it is a good thing, but I could be wrong…? Ok, thank you for your time, to anyone who has read this… Feel free, you who may read this, to raise this to a larger/broader audience if you think it has any potential/merit… Also going to tag @0xdeniz @bit @JustinCase from this other thread – which is now locked (and so I cannot participate in it…) – as I think they might also be interested / can provide good feedback…     Improving governance participation rate at MakerDAO Governance       Deniz thank you for creating this write-up. Very much needed. From a Delegate point-of-view:   I think you make a very interesting point about reimbursing Delegates for gas fees–but I believe that with the new compensation structure, some Delegates should be able to afford their own gas fees. As you know, there are some VCs who want to delegate and are also providing a gas stipend. This is cool–perhaps what GovAlpha should do is provide a threshold of which delegates should be reimbursed.  As an…     ",
                    "links": [
                        "https://forum.makerdao.com/t/improving-governance-participation-rate-at-makerdao/11706/3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.562079264404845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#27",
                    "likes": "1",
                    "time": "04/07/2022-22:15:46",
                    "content": "Based on the potential upcoming model, non participants might see their MKR share diminish as there will be inflation. It’s a way to discourage inaction as you mentioned without forcing to reduce their MKR ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerWOW",
                    "index": "#28",
                    "likes": "0",
                    "time": "04/07/2022-22:21:11",
                    "content": "Thanks for this – Any chance you can you provide a link to the proposed upcoming inflation model? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#29",
                    "likes": "2",
                    "time": "04/07/2022-22:30:30",
                    "content": "There are few ways to understand it but you can see what MKR users and voters are able to earn here Endgame Summary - Part 2 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerWOW",
                    "index": "#30",
                    "likes": "0",
                    "time": "04/07/2022-22:43:23",
                    "content": "Perfect, thank you… I thought you might be referring to Endgame, but as I haven’t gotten to read it yet I wasn’t sure… It’s certainly an open tab here somewhere, for me to get to soon  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#31",
                    "likes": "0",
                    "time": "05/07/2022-19:12:27",
                    "content": "    MakerWOW:  My (again, potentially naive) proposal would be that Maker consider something like this for wallets that don’t vote… After a period of time (or x number of votes not participated in, etc) a small amount of MKR could be removed from the wallet and go somewhere where it will be useful to the protocol as a whole…   @MakerWOW I think you identified a very immediate problem. How would Maker be able to track wallets? In addition you either introduce the possibility of simply transfering from one wallet to another to reset the timer or we’d need some sort of system to track each MKR. Even if we managed to track them it would turn into a nightmare because it would make decentralize trade in the token almost impossible as you now would have to take into account how close each token is to “expire” unless used for voting. Having tokens disapear from users wallets is also almost guaranteed to be a public relations nightmare. Therefore I think positive incentives to vote is a better way to go. For actors inclined to vote I think delegation already offers some real value. Delegation cuts down on the time investment to get informed voting. It allows you to increase your voting power by aligning with others that share similar views. It ensures consistent voting without worrying about deadlines, and it is less costly regarding fees. So the real nut to crack is how to positively incentivise voting in such a way that it increases governance participation. In my view using your tokens for voting must at least produce a yield similar to what you’d get lending your MKR on other protocols. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.16833103764922
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerWOW",
                    "index": "#32",
                    "likes": "1",
                    "time": "05/07/2022-20:14:34",
                    "content": "Thank you for this reply. I wholly agree with the problem of tracking wallets or even individual tokens; I would not actually propose that and, again, I think that if someone were willing to be active enough to open a new wallet every X months (or whatever), then they could just as easily delegate their vote and check-in on their delegation every X months instead…  Having tokens disapear from users wallets is also almost guaranteed to be a public relations nightmare.  Implementing a mechanism like this would unavoidably be, to one degree or another, controversial… However, I personally think that A) We can never make decisions out of fear of how a vocal minority might respond, because there will always be someone out there ready and waiting to give you sh!t no matter what decisions you make / actions you take, and B) There’s a solid case to be made that the MKR token as a tool for governance has always been and always will be the only way the MakerDAO can remain a truly ‘decentralized and autonomous organization’, and that holding MKR has always been and will always be first and foremost about the power of governance it bestows the holder and not about the speculative value it has (value as leverage/collateral within the larger DeFi community, beyond its actual market value) Of course, I’m being way too optimistic here, but my point is that I’d like to think that the majority (of people who even follow Maker or who would care about this) would see an ‘inactivity fee’ as a way to protect Maker and ensure its continued ability to be self-sovereign, etc, and not as some horrible evil perpetrated upon unsuspecting holders… Basically – and I recognize this is a bit of a hard-line on my part – but if you’re holding MKR and you’re not living up to the responsibility that comes with it, then you’re doing it wrong… The ‘put my money where my mouth is’ example is that I’ve really wanted to accumulate MKR over the past few years (I could’ve bought at $250!!) but didn’t, explicitly because I didn’t feel it would be fair to hold it and not vote with it, and I knew that I didn’t have the time or energy to expend getting involved with the whole governance process… And I’m only finally holding some MKR now because I have some ability to participate, and especially because I now have the ability to delegate my vote to one or more delegates, which reduces the burden quite a bit (but does not eliminate it)…  So the real nut to crack is how to positively incentivise voting in such a way that it increases governance participation. In my view using your tokens for voting must at least produce a yield similar to what you’d get lending your MKR on other protocols.  I agree that a positive incentive is likely the way to go, and I’m not actually advocating in favor of an inactivity fee necessarily… I simply find that when I’m sitting in a conference room with my colleagues and we’re working-out a problem, I am often the one who can propose something ‘wild’ that either itself turns into a solution or (more often than not) at least kicks people out of the one mode / train of thought they were on and gives them some new perspective on the issue at hand… Also, FWIW, I disagree that rewards for voting/delegating “must at least produce a yield similar to what you’d get lending your MKR on other protocols”… My Cardano wallet, for example, has been staked since their Proof-of-Stake system launched (before that, even, during their Incentivized Testnet), and has earned an average of “only” 4.5% in that time… And I am very happy with this considering that staking (on Cardano) is a risk-free venture (there is no ‘slashing’ mechanism, etc)… I do not and will not chase a few more points in DeFi lending when the risks go up exponentially… And I feel very much the same about Maker governance rewards… I’m personally incentivized to do it with zero reward (beyond the fact that the core incentive is to ensure the continued existence and the general increase in value over time of my MKR)… However, I will say that some incentive (akin to Cardano’s) would make all the difference in making the choice much easier, and I would’ve made it much sooner as well… And I think anyone holding MKR and not lending it (at least) would, like me, be quite happy to get something (especially when it’s risk-free, presuming it would be) for spending a little time here and there participating in governance (likely by delegating)… I mean, a little something compounded is way better than nothing… Ok, that’s all… Thank you for reading, to anyone who made it this far… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.322097902097902
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#33",
                    "likes": "1",
                    "time": "05/07/2022-20:28:45",
                    "content": "    MakerWOW:  Basically – and I recognize this is a bit of a hard-line on my part – but if you’re holding MKR and you’re not living up to the responsibility that comes with it, then you’re doing it wrong… The ‘put my money where my mouth is’ example is that I’ve really wanted to accumulate MKR over the past few years (I could’ve bought at $250!!) but didn’t, explicitly because I didn’t feel it would be fair to hold it and not vote with it, and I knew that I didn’t have the time or energy to expend getting involved with the whole governance process… And I’m only finally holding some MKR now because I have some ability to participate, and especially because I now have the ability to delegate my vote to one or more delegates, which reduces the burden quite a bit (but does not eliminate it)   I’m curios if you feel the same way about holding stocks. Any stock gives a right to participate in that particular company’s governance, but the vast majority that owns stocks do it for the financial gain. In fact some stocks are split into different classes where some of them holds more voting power yet they usually trade pretty close to the price of the stocks that does not have elevated governance influence. This leads me to expect that the majority of token holders, not just in Maker but also in other protocols, also holds their tokens primarily for financial gain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.539257369614512
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerWOW",
                    "index": "#34",
                    "likes": "0",
                    "time": "05/07/2022-21:12:56",
                    "content": " I’m curios if you feel the same way about holding stocks.  I do, yes. I hold very few individual stocks (preferring instead index/mutual funds in the TradFi market) and I vote my shares for those I hold.  …the vast majority that owns stocks do it for the financial gain. In fact some stocks are split into different classes where some of them holds more voting power yet they usually trade pretty close to the price of the stocks that does not have elevated governance influence. This leads me to expect that the majority of token holders, not just in Maker but also in other protocols, also holds their tokens primarily for financial gain.  Oh, for sure, just like in the legacy financial system, ‘the crypto masses’ are mostly not (in my view) principled investors, and only care about their own gain, etc… And this is where I think the blockchain has a specifically unique advantage (which is, of course, not a novel viewpoint)… A protocol like Maker can expressly say in essence that “If you want to loan your money out, earn interest/yield, be your own bank, etc… That’s what DAI is for; But that is not what MKR is for. MKR’s purpose isn’t speculative, it’s for governance of the protocol and for keeping the ecosystem self-sovereign, etc, and we’re going to code that right into its DNA as a protection, so that there’s a (small or large) incentive whenever it’s clear it is being used this way, and/or possibly even a (small or large) penalty whenever it’s clear it is not.” Then, if some want to live in the ‘grey area’ between those two and speculate with it anyway (see: they will) that’s fine, but at least there’s a line in the sand for the majority to follow… IDK, I’m not feeling particularly strong about what I’ve written here – it’s more philosophical maybe – but I do feel very, very strongly about incentivizing participation in governance in order to get a strong and diverse majority involved, and I was very surprised (borderline shocked) to come into Maker and find such a low percentage of participation… Because I thought it was clear that that’s what holding MKR is all about, but I guess it was just me… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.558414502164503
                }
            ]
        }
    ]
}