{
    "poll_list": [
        {
            "title": "Nexo Institutional Vault Onboarding - October 11, 2021",
            "index": "10046",
            "option": "Yes",
            "supporting_mkr": "87,288",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-nexo-institutional-vault/10046",
            "title": "[Signal Request] Nexo Institutional Vault ",
            "index": 10046,
            "category": [
                "Governance",
                "Signal Requests"
            ],
            "tags": [
                "signaling",
                "sig-status-pending",
                "institutional-vaults"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "7",
                    "time": "27/08/2021-14:30:31",
                    "content": "Persuing the Institutional Vault offering, we want to continue with a signal request to understand the community’s preference regarding this subject. As we have mentioned in previous posts, @ Growth , @ Risk , @ Protocol Engineering, @ RWF and Nexo @Kiril_Nikolov  created a working group to bring a solution for institutions looking for a longer-term borrowing commitment to the Maker community. This discussion has brought to the DAO other possible solutions for the fix-term challenge, giving us many options when thinking about long-term vaults. Still, in the case of Institutional Vaults, although it includes a fix SF, we believe it is another category where we can commit with an Institution over some terms that will benefit both. This is the first ‘beta’ product offering, and for that reason, it took a lot of effort from different CUs and Nexo to get to an agreement, that as the community has pointed out, could be improved in different ways and we will continue working to develop a clear framework for the future institutions interested in this product. Meanwhile, we think it’s essential to launch the Nexo institutional vault, learn from it, and improve it. After the discussion about this kind of vault and its financial implications, we want to understand the community’s sentiment to proceed with the next steps: continuing with the presented terms that were built together with Nexo, continuing but adding what the community suggested (and wait for Nexo’s approval on those new terms) or wait for a better solution.    Do you think we should launch the Nexo Institutional Vault?  Yes, with the terms as presented  Yes, but modifying the performance rebate to 5 bps per 100M DAI (instead of 10 bps per 100M DAI as in the current terms) Yes, but modifying the terms for the subsequent 6month period. Instead of having an SF that can only be increased by a maximum of 1%, the Max SF = Average ETH-A change in period * ½ + current Institutional Vault SF - performance modifier *see example below* No, More discussion is needed / other Abstain     0 voters     **Example** Current IV SF = 1.5%, ETH-A change = 2%→6% in period.  Performance modifier = 0.3% from additional Dai minted.  Calculation = 4% * ½ + 1.5% - 0.3% = 3.2% (or change of 1.7%)  Poll will run for two weeks until September 10th. If success, and after Nexo’s commitment, an on-chain vote will be held to confirm the change followed by an executive with the change. ",
                    "links": [
                        "https://forum.makerdao.com/t/institutional-vaults-economics-terms/9989/1",
                        "https://forum.makerdao.com/t/institutional-and-long-term-vaults-proposal/9586#institutional-vaults-5",
                        "https://forum.makerdao.com/t/nexo-institutional-vault-collateral-onboarding-risk-evaluation/10524/4",
                        "https://forum.makerdao.com/t/mip39c2-sp23-adding-the-deco-fixed-rate-core-unit/10224/14",
                        "https://forum.makerdao.com/t/nexo-institutional-vault-collateral-onboarding-risk-evaluation/10524",
                        "https://forum.makerdao.com/t/maker-relay-ep-61-en-espanol/10376",
                        "https://forum.makerdao.com/t/maker-relay-ep-60-en-espanol/10375",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/51",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-3rd-9th/10241",
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214",
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517",
                        "https://forum.makerdao.com/t/growth-cu-weekly-update-august-27-september-2/10131",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-27th-september-2nd/10125",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-august-2021/10106",
                        "https://forum.makerdao.com/t/maker-relay-ep-60/10082",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-157-thursday-september-2-17-00-utc/10105/3",
                        "https://forum.makerdao.com/t/mip39c2-sp23-adding-the-deco-fixed-rate-core-unit/10224/64",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950"
                    ],
                    "GPT-summary": "The author of the post is seeking feedback from the community regarding the Nexo Institutional Vault offering. They explain the background of the proposal and the efforts put into it. They also provide options for modifying the terms of the proposal based on community feedback. The post includes an example calculation and a poll for community members to vote on the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.167227833894501
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/08/2021-14:46:07",
                    "content": "I voted for the “Yes, but…” However I think its just the least concerning option. I’m concerned that offering artificially fixed rates at the protocol level is marching a straight line towards the more likely scenario of Maker breaching its own terms. What Id like to see added is a provision that allows Maker to break the agreement if the Dai peg breaks, specifically in the downward direction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/08/2021-15:13:38",
                    "content": "I voted as “Presented” under the assumption that terms have been discussed/partly-negotiated by the Growth CU team. However, if I am wrong–I will switch to modifying the terms for the subsequent 6-month period. One thing I personally do not endorse is hashing out a deal and then modifying terms. I lost a few important deals in my life using this approach. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "3",
                    "time": "27/08/2021-15:59:17",
                    "content": "I have not voted yet.   My biggest issue with doing Institutional Vaults is this idea that basically the Institution will basically ride us while they get the best terms and then dump us when they don’t.   Put simply there is no reverse long term commitment from the borrower here.  I also have a real issue that locking rates longer term basically puts Maker square in the middle of being broken pretty much at the PEG btw via “Impossible Trinity”. Revolving credit lines charge a minimum rate on the total amount of the revolver whether the borrower executes or not.   This is kind of the deal when you want a longer term borrow facility with longer terms.  You have to satisfy a minimum performance metric and still have to pay some fee if you pull out. I have no clue on numbers for such a beast or term length.   I am also not sure how this is handled in a revolver (is there a deposit, etc.).   It was why I considered the idea of a slashable stake that basically is a minimum performance fee if our Institution pulls at some point.     flipflopflapdelegate:  I voted as “Presented” under the assumption that terms have been discussed/partly-negotiated by the Growth CU team. However, if I am wrong–I will switch to modifying the terms for the subsequent 6-month period. One thing I personally do not endorse is hashing out a deal and then modifying terms. I lost a few important deals in my life using this approach.   With respect to this.  While I understand this from a business perspective.   As a sole proprietor I could unilaterally negotiate.  I didn’t have a BOD looking over my shoulder and could negotiate deals with full authority.  Given MakerDAO has the full authority, any and all negotiations should either have preset terms that have already been approved by the DAO, or negotiations need to be made with the fact that the DAO may either reject any ‘deal’ or seek to ‘modify’ terms.    This literally is the nature of DAOs generally. Even in Intentional communities while positions were given that had authority and responsibility there were many things ‘off limits’ that a community head could negotiate but that had to be run by the community for a vote before they could be approved.  Yes this tied the hands of elected positions to do their jobs, but the details of what could and could not be negotiated were actually written into the IC incorporation papers so everyone knew up front where the elected positional authority ended and the DAO/community began. This was why ‘before negotiations’ even began the elected community rep would basically consult the community on intentions and made a presentation to the community for ‘preapproval’ before formal negotiations started.  BTW:  In most ICs I volunteered in, this wasn’t negotiable it was a straight up requirement of the elected member.   Such a person going rogue trying to make deals on behalf of the community was recalled and formally chastised for breaking community covenant(s).  Often times if there was a question/issue, and the community was trapped by an unsatisfactory agreement, incorporation bylaws were changed to pull back elected position authority. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#5",
                    "likes": "1",
                    "time": "02/09/2021-22:28:08",
                    "content": "Maybe @Nadia can add color here, but I would review the financial impact we presented and come to your own conclusions. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#6",
                    "likes": "3",
                    "time": "03/09/2021-00:58:54",
                    "content": "Institutional vaults give Maker an appealing product for Institutions (in this stage we understand for institutions large holders of crypto, mainly ETH and BTC with automated collateral management solutions). If the Nexo vault is approved, we will see Nexo’s current vault going from 400M DAI to 600M Dai in the next 30 days after the launch. We expect IV will attract other institutions to Maker to open a 200 DAI vault (minimum). If we check the current situation of the protocol, there are not vaults of this size, and in a moment where we are trying to find ways to increase other vaults utilization instead of the PSM, this could be part of the solution.     flipflopflapdelegate:  However, if I am wrong–I will switch to modifying the terms for the subsequent 6-month period. One thing I personally do not endorse is hashing out a deal and then modifying terms. I lost a few important deals in my life using this approach.   As we mentioned before, this is the first iteration of the product, and Nexo knows it as well, they also know we are a DAO and the terms, although suggested by various core units, could change following the community’s suggestions and that the final word is on the side of the Maker Holders. Of course, if we decide to change the terms, we will have to wait for Nexo’s feedback and their following approval.     MakerMan:  It was why I considered the idea of a slashable stake that basically is a minimum performance fee if our Institution pulls at some point.   When creating this poll, we tried to reflect all community’s suggestions. I think @MakerMan’s suggestions are super valuable and added a lot to the current proposal. We took the ones we think can be implemented without adding more complexity to the solution or additional work from the PE team. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.45578231292517
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "0",
                    "time": "03/09/2021-02:02:15",
                    "content": "    Nadia:      MakerMan:  It was why I considered the idea of a slashable stake that basically is a minimum performance fee if our Institution pulls at some point.   When creating this poll, we tried to reflect all community’s suggestions. I think @MakerMan’s suggestions are super valuable and added a lot to the current proposal. We took the ones we think can be implemented without adding more complexity to the solution or additional work from the PE team.   I appreciate this @Nadia I am going to try to compartmentalize my thinking here vs. trying to do CU work on this in a vacuum.  I really want to see a report of what our competition looks like.  This will help me/us get perspective as to the state of competition. My biggest issue here is DAI system management against various rate locking scenarios as pointed out in my other post.   The 50% SF rate change/6 months forward and trailing (up or down) I think is important.   The whole point here is if an institution wants us to commit to them, we need to find a way for them to commit to us. After some thought the best idea in this regards comes from revolver terms - shout out to @mrabino1 for helping me understand some of this and apologies if I get this wrong.    I am thinking a slashable stake based on terms requested.   Think of it this way.   A borrower comes to us wanting large vault and 6 months locked terms, and maybe some bonuses because we want them to perform.   Well how about a 20-25bps of max DC stake (refundable at end of term or can be carried over). Tossing this back at risk and growth with below ideas as food for thought to the CU teams and the Maker community.  So lets apply this to Nexo. Say they can swallow my 50% SF rate change + bonus as the maximum at 6 months and they want the bonus term on the 5bps/100M usage to run for up to 3 years on up to 1B. So lets have them put up a slashable stake (based on some deposit, DAI minted minimum performance terms) of (.0021B3yrs = 6M - 7.5M DAI (25bps)) that is deposited in a stake account.    There are different ways to do terms here…  One is by collateral deposited (say no more than a 50% drop from peak) another way is by DAI minted (not to go below 400M).   This is whole performance penalty is the  hardest part and I would be tossing the idea at Nexo and seeing what they could come up with.   Point here is any terms that run a length of time (bonus, rate change structure, whatever) should basically have a slashable stake that is related to a minimum performance commitment over the term of any of the terms of the deal. If Nexo goes - well we will take the terms with 6 month option for up to 1B with a new rate to be negotiated at end of term then sign them up and take a 2-2.5M performance/commitment stake…  Now if they want that 50% SF rate thing and bonus terms to extend out 3 years well then take a 6-7.5M stake that is slashable at any point during the 3 years if they fail to satisfy terms.  If they want up to 2B DC then double these numbers (see ideas below regarding upping them to 2B btw) The point here is ideally one wants to front load a performance/exit penalty that is refunded or refundable at end of term.  The size of this related to the term of the terms and some level of acceptable minimum performance over the term.   This is a kind of performance bond, refundable at end of term, not an upfront fee, it is a punishment for unsatisfactory performance or early exit. I think 200M is a good minimum size for IVs btw.   I think we should standardize bonus terms for all IVs at this point to this 5bps/100M up to a maximum of 500M for the time being.   As to what size of vault hell I’d give Nexo 2B out of the gate here with that 5bps/100M up to 500M and maybe another .25% or 5bps/200M on next 1B.  These terms give a nicely structure 200M-2B first tier IV size btw.   Anyone wants above 2B lets think about a 2B-20B IV tier. I have some other ideas these IV players might be interested in.  Nexo may or may not care but why not offer a Nexo Token vault and encourage them to build DeepLiquidity™ via offering them a vault for Nexo-DAI paired in Uniswap V2 contract?   Help encourage them to build one deep liquidity pool on uniswap v2 for trading, allow people supplying this liquidity to borrow DAI.   Give Nexo some bonus for filling this vault to the 200M level or beyond.   Encourage them to basically offer staking rewards in Nexo possibly matched with MKR for people taking this v2 Nexo-DAI vault LP and borrowing DAI. I want to do the same with Polygon btw.   I mean we just gave them a MATIC vault.   I think if they get to 200M we should consider offering them a similar IV deal, with same idea of a v2 MATIC-DAI LP vault so they can borrow DAI with MATIC and then pair it with MATIC in v2 LP (to provide price backstop and less slippage focused mainnet trading) and mint more DAI.  Deal contingent on MATIC v2 LP use to mint DAI in Maker. The point of these TOKEN-DAI V2 LP pairings is they have sqrt Token price volatility so it means a LR of 150 on a Token can be 125 on a Token-DAI v2 LP.   Means eeffective reasonably safe leverage on the v2 LP vault deposits to 2.5-3x depending.  All of this means tons more DAI out there supporting institutional token prices, backed by our ever loved and growing DAI on Uniswap DEX via v2 LP liquidity (which is fully democratic fee sharing, automatically compounded returns, and sqrt price volatility on LP value, with no trading restrictions (yet)) Additionally Maker could also offer in these deals to cross invest to build mutual cross investments in their IV players and these players to be invested in Maker directly as well.  Take some MKR and exchange it for Nexo Token, and Matic and then drop those permanently with DAI pulled form SB into the Uni V2 vaults and use the liquidity deposited into Maker to mint more DAI to provide liquidity and earn staking returns like everyone else.  Most of these Token-DAI v2’s btw have the potential to easily earn 10% or greater for LP holders just from the uni v2 trading fees.   In this way one basically doesn’t just give Institutions access to DAI via vaults, but also a way to access DAI using their own tokens, and an encouragement to build solid trading of their institutional tokens (if they have one) to DAI.   And everyone shares equally in all the trading fees, staking rewards, and terms to borrow.  Contrary to v3 or any other CES, v2 LP will not allow the price of any token-dai pair to drop to zero. Bring this kind of approach to institutional investors and we will have lots of institutions holding MKR and delegating it, they will have multiple reasons to not just stay with Maker but help us grow, and in the end everyone wins because DAI and Uniswap V2 LP becomes the defacto trading platform with the deepest liquidity reserves all built and designed against DAI and Maker with DAI the defacto standard of fully liquid, collateral value backed token unit How many other DeFI players can literally guarantee 100% liquidity on withdraws.  Only one I know of (and I don’t know that many sorry to say) is maybe Balancer, Sushi because it basically is a v2 clone, and Uniswap. Heap in smart contract changes so Token-DAI v2 LPs deposited into Maker can earn not just 1 staking reward from the relevant communities but more than 1, but heap some MKR into the mix as a vault reward against not just being in the contract but borrowing DAI against the LP value and you have a powerful driver not just for institutions to come here, but to bring everything they have and everyone else with them. I was calculating possible DAI growth from Nexo and Polygon alone with this approach at I figure at least 1-5B DAI alone could come from these players, and the deeply liquid Token-DAI v2 vaults would help provide key price support which would help mitigate against risk generally. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.790932447182447
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#8",
                    "likes": "2",
                    "time": "03/09/2021-09:31:32",
                    "content": "Just noting that I have changed my vote from Abstain to all three Yes answers. Every party here understands that this is a pilot project. Not moving forward as fast as safely possible towards a running first iteration makes no sense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/09/2021-14:12:32",
                    "content": "We agree, the best way to see its impact in real time is to make it work. My vote is in favour of activating it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "3",
                    "time": "08/09/2021-11:04:17",
                    "content": "Reminder that this closes in a few days and represents a change to how the Maker protocol has operated in the past. If you’ve not yet voted, please consider doing so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 3.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#11",
                    "likes": "1",
                    "time": "09/09/2021-18:01:47",
                    "content": "I felt free to vote No because everybody else voted Yes. I’m not really against the proposal, but I just think we should have a clear plan in place to transition Nexo to reusable deal components like Deco Protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#12",
                    "likes": "0",
                    "time": "10/09/2021-00:14:38",
                    "content": "That’s what democracies are all about, anyone can vote for the option that seems best for them, even if it may not be the right one. After all, the whole point of democracy is to set up and dismantle everything under the power of the vote. Perhaps certain aspects need to be worked on a little better, but I don’t see why we shouldn’t continue to move forward with this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.677083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#13",
                    "likes": "0",
                    "time": "16/09/2021-02:51:35",
                    "content": "Just wanted to update everyone that we will be polling for this once the Core Unit assessments for the vault type are posted, most likely going up on September 27th if all goes according to plan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "16/10/2021-21:51:08",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "0",
                    "time": "18/10/2021-14:15:00",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "0",
                    "time": "18/10/2021-14:21:39",
                    "content": "The on-chain poll for this signal was successful. This will be implemented in the near future and included in an executive as the Protocol Engineering Core Unit’s work schedule allows. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.416666666666666
                }
            ]
        }
    ],
    "group_index": "15"
}