{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589",
            "title": "GovAlpha (GOV-001) Quarterly Review - Q1 2022 ",
            "index": 15589,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "gov-001",
                "quarterly-review"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "15",
                    "time": "03/06/2022-15:43:44",
                    "content": " GovAlpha (GOV-001) Quarterly Review - Q1 2022  Executive Summary  Successes  Developing resources and tooling:  Impact Estimations Operational Manual Governance Tracker Forum Explorer SourceCred Explorer   Onboarding and expanding of Core Unit workforce. Remaining fiscally responsible, while increasing presence.   Failures  Delayed timelines and slow milestones. Cross Core Unit communication. Burnout within the Core Unit.   Spending  We came in 38,350.19 DAI under budget, underspending by approximately ~10% for this quarter (when the contingency request is removed). No major concerns from this quarter, we are trending toward more full utilization of our budget which speaks well toward our ability to follow through on planned spending. This will result in a return of 150,050.83 DAI in the next week. The combined figure represents the entirety of underspending from the last proposed budget, plus the closing out of project funding from last year.   Focuses for Q2 (Present Quarter)  Major Focus - Prioritization Voting Algorithm Minor Focuses  Formalizing Recognized Delegates Experimenting with Off-chain Incentives     Conclusions  There’s a lot to be proud of at GovAlpha, but we are grappling with some familiar foes. As the DAO scales, our role becomes more challenging. We noticed more time being devoted to Social Politics and MIPs Maintenance, both of which left us with room for improvement. Responding to feedback has resulted in several useful resources being developed that weren’t pictured when our Q4 + Q1 Budget was drafted. A net positive for the DAO, but we realized we needed to place a greater focus on our stated objectives so they wouldn’t be left behind when pursuing new community desires. GovAlpha continues to be a lean Core Unit. While this is a major positive for community sentiment and DAO spending, many stated failures could be addressed with either more tooling or more personnel.   Analysis  Last Quarter’s Focuses GovAlpha remains committed to fulfilling our initial mandate that was ratified by MKR holders. In pursuit of this, the Core Unit selects Quarterly Focuses that attempt to reinforce our broader mandate. Q1’s Focuses were admittedly broad, but we used the wide framing to allow wide exploration from our contributors.  Participation We presented Participation as a quarterly focus when drafting our budget in July of last year. While the days of chasing down VCs for votes are thankfully a distant memory, governance participation is a continuing struggle. Recent conversations and the Decentralized Voter Committee initiative highlight that the participation issue is far from solved. We entered Q1 2022 with 9 Recognized Delegates wielding approximately 77k MKR (December Delegate Round-Up). March ended with 12 Recognized Delegates wielding approximately 84k MKR (March Delegate Round-Up). While the increase in Recognized Delegates and the amount of MKR delegated to them was encouraging, it is worth noting that the amount of MKR staked and delegated to Maker Governance increased only slightly. This is likely due to the shifting of MKR between delegates, and from Shadow Delegates to Recognized ones.  1317×795 48.8 KB  Source: MakerDAO Governance Dashboard  Wins While a lot of GovAlpha’s day-to-day management can be seen as encouraging further governance participation, the following actions and initiatives were notable for our limited success in this focus:   Signaling the community to extend the delegate compensation trial, leading to continued funding of Recognized Delegates until the Compensation MIP was ratified. Adding delegation documentation to the Operational Manual (in English and Spanish), ensuring greater access to the program and allowing GovAlpha to share info with prospective delegates more effectively. Meeting in person with Recognized Delegates and a16z at ETHDenver to talk about Governance needs and encourage healthy dialogue between Delegates and delegators.   Misses We made other attempts to increase participation but saw limited to no return on the efforts. While these items may still be worth pursuing, a different approach will be needed if we wish to see a reasonable return on our investment of time and fiscal resources.   @LongForWisdom and @prose11 both attempted to contact funds and large holders and encourage more delegation via Telegram. These channels were vaguely reliable when facing difficulties passing executives last year, but proved ineffective without an urgent need behind them. We started exploring on-chain incentives with DUX-001, in part prompted by @PaperImperium’s Governance Mining Signal, but we ultimately deferred the effort due to bandwidth. Given the stated quarterly focus, we should have started this effort sooner. Another group we targeted for increased participation was Core Unit members, but with efforts largely limited to pitches in Mandated Actors meetings and a call to action on Discord it is unlikely these efforts moved the needle on CU members delegating. With CUs beginning to receive vesting rewards, revisiting this idea with a more coordinated effort could prove effective.   Exploration When drafting our previous budget, we had expected to complete a Game Theory Audit of Maker Governance in Q4 2021. Several factors, including the high cost of an audit and the potential shifting of priorities due to the Sagittarius Engine, we opted not to pursue this audit, as reported in our last quarterly report. As a result, the exploration of this quarter was focused on known issues and internal pain points within our domain. While there aren’t too many objective measurements of our exploration, we were able to publish several reports and push various tools and changes from our investigations. Many contributor hours were spent researching and while we believe better project management would have yielded faster results, the commitment to our stated focus proved rewarding. Exploring will always be a part of fulfilling the GovAlpha mandate, but Q1’s focus included many auxiliary benefits mainly in contributor onboarding and expansion of roles.  Wins  Talks about how to improve meaningful discourse and cut through forum noise led to the launch of Impact Estimations. While we have yet to build on this introduction, the classification of impacts on the forum and voting portal has great potential for bettering governance at Maker.  @TheExistence’s SourceCred Evaluation was foundational to the Off-chain Incentives change we presented in May. Community feedback stating how difficult it was to know what was coming up for vote led to our Governance Tracker being released in Q1. While GovAlpha tends to enjoy our spreadsheet coordination, this creation from @LongForWisdom led to @hernandoagf being able to utilize it as a source in his Governance Dashboard. In addition to some cosmetic changes to the Forum, we were able to install the Forum Explorer, a plug-in for improving Forum Navigability.   Misses  While we are quite happy with the recently released DeFi DAO Governance Report, the community likely expected it far sooner after being mentioned in our first weekly report of Q1. A myriad of factors contributed to the delay, but the ultimate reason for the long development time lies with subpar project management. More attention and reviews from me as a Facilitator of our team would have led to a much quicker release, and I will need to spend more energy on PM activities going forward. On a similar note, our work looking into the ESM Minimum Threshold failed to produce a scientific recommendation before we (and much of the community) felt the need to propose raising the ESM Minimum Threshold in May. While the difficulty of the task was the main culprit, we still intend to release our limited findings this quarter and regret that we did not devote enough resources to the problem in Q1. January saw the first Core Unit Offboarding and with it many lessons for the DAO. On the GovAlpha side, taking on the Content Production Post Mortem proved difficult and our posting of the report brought some additional drama. While GovAlpha didn’t cause this offboarding situation, it became clear that our Governance processes were not fully equipped to handle a Core Unit Offboarding. Being more proactive when the offboarding was presented likely would have led to a better experience for all involved.   Other Points While we have a lot to show for Q1, it is important to note that much of the work done was simply fulfilling our mandate and prior commitments to the Maker Community. We are quite proud of the team we have assembled and their wide range of talent. The Maker Community can look forward to our expanding efforts in this quarter and the quarters to come. Regarding leadership (both within GovAlpha and the wider DAO) there are two more areas where we came up short.  Cross Core Unit Communication The most noticeable example of this was the Fast Track RWA Signal. Feeling the pressure of mounting unease from RWA applicants, we put the question of unblocking the collaterals directly to the Maker Community. While this action was in fulfillment of our Mandate, the lack of a heads up to RWA Core Units and Incubees caused an unnecessary disruption that spilled over from Discord and the Forum into a public call. Somewhat similarly, during an earlier presentation of MIP65, several Core Units were upset and felt unclear about the since-removed mandated prioritization presented in the MIP. While this did not lead to any notable public conflicts with GovAlpha, much of our time was eaten up in calls and chats explaining the legitimacy of the proposal. Here too an effort to focus more on clear and accessible communication would have saved GovAlpha time and resources for the DAO.  Continued Burnout Struggle An unfortunate reoccurring motif within these reports is an acknowledgment that more could have been accomplished if not for feelings of burnout within the team. While particularly evident amongst facilitators, mental health was a periodic concern for the Core Unit as a whole. While some lessons from this last year as a Core Unit have helped (namely encouraging and facilitating more time off), there was a noticeable lack of cohesive action for preventing burnout throughout the Core Unit. We are quite fortunate to have such a supportive team on the interpersonal front, and I owe a great debt of gratitude for our team’s flexibility and kindness. However, at the facilitator level, we can be doing much more than creating weekly space for check-ins and I hope to start implementing more best practices for team-level support.  Spending Sources: GovAlpha CU Q4 2021 to Q1 2022 Budget GOV-001 Public Accounting Detailed Budget Breakdown by Quarter  Actuals versus Budget  Total Spending Comparison1212×738 70.1 KB   Spending by Category1550×992 93.1 KB   Spending Breakdown  974×908 60.3 KB   Spending Conclusions  Better estimation of General Budget Underspending on Programs and Travel Overspending on People  When proposing this budget, we decided to be more conservative and managed to estimate GovAlpha’s actual expenditure with better precision. Although we came slightly under budget, the unused funds represent a little less than 10% of the requested budget when the contingency is factored out. For Q3 2021 and Q4 2021, our unused funds were far greater, with over 25% of total funds returned, compared to ~15% for this quarter. The main category where we underspent was Programs. With SourceCred specifically, we spent 15% less than expected. We initially planned to raise the amount going to SourceCred, but ultimately we decided against going with that increase until we reevaluated our use of the program. With off-chain incentives being a focus for Q2 2022, we hope to introduce a new trail at no additional cost to what we were budgeting entirely for SourceCred. Additionally, the lack of “Exploration” program spending was notable, though at least partially accounted for in our contributor spending (spending internally vs externally). In contrast, we spent more than originally budgeted for our Status UI Program due to the development of the Cat-flip-like Parameters UI and MIPs Portal support and upgrades (both from DSpot). We are quite pleased by the work, despite under-budgeting for it. Travel was another category where we spent significantly less than our estimate. There was no budget spent on travel during Q4 2021 as noted in our last review, and only 5,000 DAI was spent of the allocated 10,000 DAI in Q1 2022. This was due to Prose being a local in Denver and not needing reimbursements for his ETHDenver attendance. The 5,000 DAI spent was in support of preparations for ETHAmsterdam and led to the more accurate labeling of the category as “Travel and Entertainment” in the most recent budget. We did go over budget on People, allocating 10% more than expected to our contributors. This overspending was directly linked to our technical hire @hernandoagf - we decided to overspend slightly to acquire a broader talent pool within the Core Unit. In our view, this was a rather ideal use of our contingency funds as the over-spending on labor resulted in many of the deliverables detailed in the first half of this report. In our current budget, we allocate more resources to People to avoid overspending and cover new realities. For instance, @Patrick_J started contributing full time, we will be soon proposing a new Facilitator, our technical contributors, etc. The unused funds of 38,350.19 DAI will be added to the previously unused funding amount of 111,700.64 DAI for a total return to the DAO of 150,050.83 DAI Note 26,322.50 DAI of this was reserved last year for on-chain SourceCred development which is no longer planned after our technical hire and takeover of SourceCred payments, adding to the total amount under-budgeted for Q4 2021 and Q1 2022.  Q2 Focuses  Major Focus: Prioritization Voting Algorithm This focus is all about creating a valuable feedback loop for MKR holders to express their prioritization sentiment to the Core Units and various DAO contributors. While this prioritization will not be binding in any way, it will provide valuable data and an informative starting point for better communication on focuses between Core Units and MKR holders. We are delivering the first iteration of this [LINK?] and hope to get some feedback for refining before the end of the quarter. Work will likely span into the next quarter, but we are proud to have something on the books and believe it to be consistent with the vision laid out in our 2022-2023 budget.  Minor Focuses:  Formalizing Recognised Delegates We initially leaned into the permissionless nature of the delegate set-up and chose not to codify Recognized Delegates with a MIP. After nearly a year of the program, we have learned much and improved our understanding of what factors are important for delegation. We intend to submit a MIP to the community to firmly define the program and its limitations.  Experimenting with Off-chain Incentives Off-chain incentives are important for creating a truly decentralized and accessible organization. With so much work to be done with formal proposals and community contributions, we require a robust system that rewards impactful efforts to improve aspects of the DAO/protocol. We just released our changes to improve Off-chain Incentivization in the Maker Community. This minor focus was a long time coming after making the decision not to increase SoureCred funding in Q4 2021.  Conclusions and Final Words The year is already flying by and we apologize for this report taking so long to put together. Between conferences, emergency executives, and an earnest push for this quarter’s objectives, this reflection was unintentionally deferred. We continue to find areas to improve while putting a strong foot forward in community Governance. The resounding support for our MKR Vesting Proposal was extremely encouraging and we are grateful for the community’s vote of confidence. With that said, we have plenty to reinforce and refine to make sure the community and MKR holders are getting their full value. As our team grows and evolves our appetite for solving problems and improving processes only grows. We believe we can accomplish quite a bit under this year’s budget and reaffirm its commitment to the broader community. ",
                    "links": [
                        "https://manual.makerdao.com/",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/introducing-forum-explorer/14384",
                        "https://observablehq.com/@hernandoagf/makerdao-sourcecred-stats",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP3#govalpha-s-mandate",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP29#participation",
                        "https://forum.makerdao.com/t/decentralized-voter-committee-on-tuesday-5pm-cest-all-mkr-holders-welcome/15166",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://www.makerdao-governance-dashboard.com/",
                        "https://forum.makerdao.com/t/signal-request-extend-the-delegate-compensation-trial/12686",
                        "https://mips.makerdao.com/mips/details/MIP61",
                        "https://manual.makerdao.com/governance/what-is-delegation",
                        "https://manual.makerdao.com/v/mom-spanish/gobernanza/que-es-delegacion",
                        "https://forum.makerdao.com/t/signal-request-implement-governance-mining-trial/13271",
                        "https://discord.com/channels/893112320329396265/899667119426371625/954127936162762792",
                        "https://forum.makerdao.com/t/sagittarius-engine/10852",
                        "https://forum.makerdao.com/t/govalpha-quarterly-review-q4-2021/12972",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267",
                        "https://forum.makerdao.com/t/off-chain-governance-list-of-options-and-recommendations/13373/1",
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-changes-sourcecred/15362",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://forum.makerdao.com/t/introducing-forum-explorer/14384",
                        "https://forum.makerdao.com/t/maker-defi-dao-governance-report-a-review-of-major-defi-dao-governance-systems-in-the-ethereum-ecosystem/15156",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-01-07/12523",
                        "https://forum.makerdao.com/t/signal-request-increase-the-esm-minimum-threshold/15006",
                        "https://forum.makerdao.com/t/content-production-core-unit-offboarding-post-mortem/13756",
                        "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563",
                        "https://mips.makerdao.com/mips/details/MIP65",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP29",
                        "https://docs.google.com/spreadsheets/d/1IhTFGRh3NGL3Kp6TXj035T-898zHBSc2epEZGOPAF2k/edit#gid=934247838",
                        "https://docs.google.com/spreadsheets/d/1o_IiwcBtN50o4rFH6Wbhhj7RDCKCNjDCHYX3WG4NGFU/edit#gid=1620670023",
                        "https://forum.makerdao.com/t/govalpha-q3-2021-quarterly-review/11516",
                        "https://forum.makerdao.com/t/govalpha-quarterly-review-q4-2021/12972#spending-breakdown-14",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP59",
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-changes-sourcecred/15362",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP60",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-06-03/15600",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.692310762024108
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "2",
                    "time": "03/06/2022-17:45:21",
                    "content": "    prose11:  The unused funds of 38,350.19 DAI will be added to the previous quarter’s unused funding amount of 111,700.64 DAI for a total return to the DAO of 150,050.83 DAI   The unused funds have now been returned to the Surplus Buffer using DssBlow. 150,050.83 DAI sent from GovAlpha multi-sig to DssBlow - transaction. Transaction calling blow to send DAI back to the surplus buffer - transaction Note, prior to GovAlpha’s funds being transferred 52,401 DAI that had been returned by the Data Insights Core Unit was in the DssBlow contract and this was also transferred to the Surplus Buffer at the same time. Therefore, in total 202,451.83 DAI was transferred to the Surplus Buffer. ",
                    "links": [
                        "https://etherscan.io/tx/0x8b839686cbe35f3235512a9e450559bc65a10fecd0b22846e30d6a376d5890bc",
                        "https://etherscan.io/tx/0x4784974b87d19a195612a05ec4acf825b65c8a16da6f1813216064106ed5d683"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.861111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "6",
                    "time": "03/06/2022-19:07:54",
                    "content": "    prose11:  We came in 38,350.19 DAI under budget, underspending by approximately ~10% for this quarter (when the contingency request is removed).   man, you guys are the best! Have a mega pint on me      prose11:   Another group we targeted for increased participation was Core Unit members, but with efforts largely limited to pitches in Mandated Actors meetings and a call to action on Discord it is unlikely these efforts moved the needle on CU members delegating. With CUs beginning to receive vesting rewards, revisiting this idea with a more coordinated effort could prove effective.    Ya, I always wonder why this is the case. Could it be for Tax reasons, need for liquidity, or afraid to use smart contracts  (no, seriously I know someone who’s afraid to use metamask).     prose11:  On a similar note, our work looking into the ESM Minimum Threshold failed to produce a scientific recommendation before we (and much of the community) felt the need to propose raising the ESM Minimum Threshold in May. While the difficulty of the task was the main culprit, we still intend to release our limited findings this quarter and regret that we did not devote enough resources to the problem in Q1.   I think you guys are being to hard on yourselves–this proposal made sense, and can even make more sense if we continue to see overall market weakness. Good and successful SR! Its a win.     prose11:  The most noticeable example of this was the Fast Track RWA Signal. Feeling the pressure of mounting unease from RWA applicants, we put the question of unblocking the collaterals directly to the Maker Community. While this action was in fulfillment of our Mandate, the lack of a heads up to RWA Core Units and Incubees caused an unnecessary disruption that spilled over from Discord and the Forum into a public call.   I believe you guys handled it well. There was never going to be a winner in a “Fast Track RWA SR”.     prose11:  Continued Burnout Struggle An unfortunate reoccurring motif within these reports is an acknowledgment that more could have been accomplished if not for feelings of burnout within the team. While particularly evident amongst facilitators, mental health was a periodic concern for the Core Unit as a whole. While some lessons from this last year as a Core Unit have helped (namely encouraging and facilitating more time off), there was a noticeable lack of cohesive action for preventing burnout throughout the Core Unit. We are quite fortunate to have such a supportive team on the interpersonal front, and I owe a great debt of gratitude for our team’s flexibility and kindness. However, at the facilitator level, we can be doing much more than creating weekly space for check-ins and I hope to start implementing more best practices for team-level support.   Yes, this is my biggest worry–that such a talented group of both Core Unit and Community members will burnout. Please try to remember that life goes beyond financial success. Our Mental Health is one that we must keep healthy–it’s important to take care of yourself and get the most from life. And always remember, work and money is not everything. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-increase-the-esm-minimum-threshold/15006",
                        "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.962320305480683
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#4",
                    "likes": "2",
                    "time": "10/06/2022-07:40:01",
                    "content": "As far as participation is concerned, are the votes not contentious enough to draw out more MKR holders? Are they often a shoo-in for approval? I’m not sure if/where there’s data on how unanimous the voting typically is or isn’t. Do voters not feel educated enough to make a decision, and thus leave the choice to others? Is the fear with low participation that a bad outcome could happen, or has? Is the desire for more participation coming from a risk management position, from a belief in the principal/ethos of the DAO, or from something else? Could apathy signal room for some kind of automation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#5",
                    "likes": "3",
                    "time": "10/06/2022-10:35:49",
                    "content": "Great questions!     ClausClowes:  are the votes not contentious enough to draw out more MKR holders?   There are multiple reasons people don’t participate in voting, these include, but are not necessarily limited to:  Gas fees - this mostly affects smaller holders. The DUX team are working on an implementation of gasless voting which sounds awesome, it’s not yet ready for deployment as it isn’t an easy thing to do, but they’re making progress. Incompatibility with custodial clients - some of the largest MKR holders don’t own their MKR directly but hold it through a custodian, some of these custodians’ systems are incompatible with the voting portal - this is also being worked on. Apathy - some people don’t want to govern the protocol and see MKR as an investment rather than a stake in the governance of the protocol. Yield farming - people lending out their MKR for yield on other platforms (Aave, Compound etc), or who have it in LPs on Uniswap are unable to use their MKR for voting.      ClausClowes:  Are they often a shoo-in for approval?   No. Many votes end in a negative result, example. Some votes that pass can be very close, example.     ClausClowes:  I’m not sure if/where there’s data on how unanimous the voting typically is or isn’t.   All previous votes can be seen on the voting portal, or on the governance tracker. I don’t think we have a tool that can extract results with voting weight, although it’s certainly a good suggestion (@tadeo does your team have something with this functionality that I’m unaware of?).     ClausClowes:  Do voters not feel educated enough to make a decision, and thus leave the choice to others?   Complexity can be a factor. We have delegates whom MKR holders can delegate their voting power if they don’t want to worry about keeping up with all of the ongoing proposals.     ClausClowes:  Is the fear with low participation that a bad outcome could happen, or has?   tl;dr yes. Any change to the Maker Protocol that requires a technical change, so new collaterals; vault parameter changes; deploying new modules, etc must be implemented in an Executive Vote. This also applies to removing funds from the Surplus Buffer or from the Protocol Treasury. Executive Votes work on a continuous approval voting system - this means that for any new Executive Vote to pass, it must have more votes in favour of it than any previous Executive Vote. People can move their votes between Executive Votes, and vote for more than one at any time. Anyone who is technically able may deploy the code for a new Executive Vote - it is completely decentralized. There is no multi-sig that is in control of any parts of the core protocol, it is all controlled by smart contracts. The only permissioned part of the process is listing an Executive Vote to the voting UI, but it is possible to vote for an Executive Vote without using the UI. Therefore, the system is only as secure as the amount of MKR supporting the hat (the Executive Vote with the most MKR supporting it). If there is low voter participation, particularly on Executive votes, any individual (or group) could pass their own Executive Vote to, for example, send themselves all 76 million DAI from the surplus buffer. The security of the entire Maker Protocol is therefore positively correlated to the amount of MKR participating in Executive Votes.     ClausClowes:  Could apathy signal room for some kind of automation?   We have already automated some things using structures like the Instant Access Module (IAM) and the Linear Interpolation Module (lerp), and the Token Streaming Module (vest). Once set up, parameter changes can be controlled in a permissionless and decentralized way without intervention from Governance - they still need votes to set them up and further votes if we want to change the parameters they are operating within, but these tools are able to reduce some of the governance overhead. ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmV3Lem7#vote-breakdown",
                        "https://tracker-gov.makerdao.network/",
                        "https://manual.makerdao.com/module-index/module-dciam",
                        "https://manual.makerdao.com/module-index/module-lerp",
                        "https://manual.makerdao.com/module-index/module-token-streaming"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.801672384219554
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#6",
                    "likes": "2",
                    "time": "14/06/2022-19:27:38",
                    "content": "I so appreciate your thorough response!     Patrick_J:  Complexity can be a factor. We have delegates whom MKR holders can delegate their voting power if they don’t want to worry about keeping up with all of the ongoing proposals.   Delegation sounds like a good area to grow as the protocol draws in more and more people. At the same time, maybe there could be some kind of Grand Central Station with all the useful links listed together with descriptions of what you’ll find there – like a main menu to all the assorted virtual dashboards. Maybe that exists already and I haven’t seen it; I’m finding out about new websites in the Maker data analysis universe every day! Would make the line from total newbie to Maker Chad a bit more straightforward, and one step closer to the future where all this data is organized together in one interface. Education/ease of knowledge is good regardless but could additionally contribute to general awareness/care for the subjects being voted on.     Patrick_J:  The security of the entire Maker Protocol is therefore positively correlated to the amount of MKR participating in Executive Votes.   Is it only the amount of MKR, or also the number of voters? What if it was 100% MKR participation but with only, say, 10 delegates, versus 20% MKR participation with 200 individual voters. Is one better than the other? I have a feeling it’s sort of in between the two. That said, apathy to me implies that it’s an issue with not having enough voices in the mix. So if the problem with Participation is Apathy, and the problem with Security is Participation, then Security is tied to the number of voices present in the votes. Either that, or apathy isn’t as major a threat to security (ie it really is solely the amount of MKR participating in the voting), and perhaps a structural change is the ticket to that end? Related, I’m wondering if there’s some way to artificially increase the amount of MKR involved in the voting. I’m not sure exactly how one would do this while still remaining principally decentralized, but maybe adding a slight but growing multiplier to the votes of those who have put in the most time voting/maintaining the system could be one solution. Not that they’d get more MKR out of it, rather a sort of seniority bonus or something, in the vote tallying. In lieu of convincing many individuals to individually cast their vote (as good as that is), giving more trust to those who have shown commitment to the protocol might be at least a partial solution as far as bolstering defenses? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.959550865800866
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#7",
                    "likes": "2",
                    "time": "14/06/2022-19:50:50",
                    "content": "    ClausClowes:  At the same time, maybe there could be some kind of Grand Central Station with all the useful links listed together with descriptions of what you’ll find there – like a main menu to all the assorted virtual dashboards   I’d like to think that’s what we started building last quarter with the Governance Tracker, the newest version is definitely more accessible that the spreadsheet we use for entering in the items:   makerdao-governance-dashboard.com   Governance Dashboard A dashboard containing Maker governance and delegation stats as well as proposals information          ClausClowes:  Is it only the amount of MKR, or also the number of voters? What if it was 100% MKR participation but with only, say, 10 delegates, versus 20% MKR participation with 200 individual voters.   In the practical sense, it’s the amount of MKR that matters. The risk is that with a low amount of MKR securing the hat (the most supported executive proposal), any external actor could come in and take control of the protocol. You still have this risk with the scenario you mentioned, but at least you know the 10 actors you have to be aware of for collusion. The more people involved the better in terms of decentralization, but that principle is worth little if you have a ton of people and an insecure hat.     ClausClowes:  Related, I’m wondering if there’s some way to artificially increase the amount of MKR involved in the voting. I’m not sure exactly how one would do this while still remaining principally decentralized, but maybe adding a slight but growing multiplier to the votes of those who have put in the most time voting/maintaining the system could be one solution   Have been tossing around some ideas for a while, we’re hoping to put something out regarding on-chain incentives in the next month. Might be helpful to take a read of MIP49: Staking Rewards. It was rejected by the community a little over a year ago, but the idea persists and has been brought up in some different forms (most recently in the form of a concrete proposal here IIRC [Signal Request] Implement Governance Mining Trial). Happy to get your thoughts on this  We also had a neat idea generated during the Global Governance Gathering in Amsterdam that @0xdeniz  presented:     ",
                    "links": [
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://forum.makerdao.com/t/mip49-staking-rewards/6331",
                        "https://forum.makerdao.com/t/signal-request-implement-governance-mining-trial/13271",
                        "https://www.youtube.com/watch?v=yt8OstQZYPI"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#8",
                    "likes": "1",
                    "time": "14/06/2022-20:35:11",
                    "content": "    prose11:  I’d like to think that’s what we started building last quarter with the Governance Tracker, the newest version is definitely more accessible that the spreadsheet we use for entering in the items:   I’m imagining in the future there would be a single tab that draws in live data from the Governance Tracker & Maker Burn & Block Analitica & the voting portal etc, maybe even that could be customized by each person according to the stats/info that are most important to their role / the current happenings. Like a Minority Report-style holotable combining all data sources into one easy UI (might have to wait for the holotable, but HTML5 could do until then  ). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.136634199134199
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "12/09/2022-20:35:18",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}