{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-thread-lets-lower-the-eth-liquidation-penalty-to-5-to-restore-the-peg/2535",
            "title": "Discussion thread: Let's lower the ETH liquidation penalty to 5% to restore the peg ",
            "index": 2535,
            "category": [
                "Governance"
            ],
            "tags": [
                "alignment",
                "liquidations"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#1",
                    "likes": "1",
                    "time": "16/05/2020-13:57:22",
                    "content": "People seem to have forgotten about one of the most potent levers of getting people to mint DAI now that SFs are at zero:  lowering the liquidation penalty.   Demand for DAI continues to exceed new supply even at 0%SF.   Arguably, one of the biggest reasons people don’t want to open CDPs is that other platforms do not charge a 13% liquidation penalty (e.g. compound) to borrow DAI.  13% is way in excess of what is needed to prevent dust attacks.  I suggest we lower it to what Compound charges (5%).   The 13% penalty is keeping Maker from being competitive with other platforms for people who want to borrow DAI and its time to lower it so that we can increase DAI supply and restore the peg. ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing to lower the liquidation penalty for DAI to increase its supply and restore the peg. The post explains the rationale behind the proposal and suggests lowering the penalty to 5% from the current 13%. The post also invites feedback and constructive criticism from the readers and raises questions about the effectiveness of the current penalty in preventing dust attacks.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.738636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "0",
                    "time": "16/05/2020-14:08:36",
                    "content": "How about adding a guarantee that their collateral won’t be sold for <95% of the market price? The potential losses would be absorbed by the MKR holders. What’s the point of the LP reduction if we sell their collateral for zero. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "2",
                    "time": "16/05/2020-14:44:47",
                    "content": "    bit:  How about adding a guarantee that their collateral won’t be sold for <95% of the market price?   If only there was some way to do this! No, I think the way forward is to add more collateral ASAP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#4",
                    "likes": "1",
                    "time": "16/05/2020-14:52:04",
                    "content": "You really don’t think the 13% penalty is keeping people from minting more DAI with their ETH?  Outside of ETH, USDC, and maybe USDT, there is really no other collateral type that is going to make a major difference right now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.925595238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Q_Q_GoAway",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/05/2020-17:36:51",
                    "content": "I’m little new to this new but has the 13% penalty ever been changed? Or, can it be changed? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.142045454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "2",
                    "time": "16/05/2020-21:17:19",
                    "content": "Liquidation penalty should be a moot point because Maker gives a guaranteed 1 hr margin call for vaults (via OSM delay). Nobody should be getting liquidated or paying liquidation penalty. Imo Maker already has the safest, most borrower friendly liquidation process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/05/2020-22:07:57",
                    "content": "Yea…LP is not the problem. Liquidation ratio would be a much more effective parameter to change to encourage DAI minting but I don’t think thats gonna happen since it greatly increases systemic risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#8",
                    "likes": "4",
                    "time": "16/05/2020-22:59:45",
                    "content": "Alternative: make the liquidation penalty 100% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "1",
                    "time": "16/05/2020-23:53:08",
                    "content": "To answer your question more directly. The 13% penalty has not been changed thus far, but it is a system parameter and can be changed by governance through an executive vote. And welcome to the forums  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#10",
                    "likes": "0",
                    "time": "17/05/2020-10:07:08",
                    "content": "Yes there is a way to do that - you just have to translate my sentence to solidity. If the condition is satisfied then cancel/delay the auction. It’s not like we didn’t have bad debt. How long are we going to push the method that doesn’t work? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#11",
                    "likes": "0",
                    "time": "17/05/2020-10:21:41",
                    "content": "    monet-supply:  because Maker gives a guaranteed 1 hr margin call for vaults (via OSM delay).   How can an ordinary user use that delay to get notified to his email when his collateral is about to get liquidated? Is it always an hour or sometimes less? Can we increase that delay to 2-4 hours? I can make a signal vote for that option. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#12",
                    "likes": "0",
                    "time": "17/05/2020-15:09:08",
                    "content": "What evidence support your view?  There is over 11m Dai borrowed on Compound despite a 1.4% APY vs. 0% on Maker.   The only reason people would keep their loans out on Compound at this higher borrow rate is due to the lower liquidation penalty ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#13",
                    "likes": "2",
                    "time": "17/05/2020-15:52:30",
                    "content": "I can imagine a possible answer to this question.  Compound offers collateral types against which they can borrow that Maker does not have.  Examples might be Tether, Augur and 0x.  I would guess Tether is a big one. I agree that Maker should be aggressive about adding collateral types.  With Aave, you also get Chainlink, Maker, TrueUSD, sUSD, Binance USD, ETHLend, Kyber, Decentraland and SNX.   The original plan was to add virtually any and all collateral types yet we are anguishing about every single addition.  I also think a BTC option like tBTC or renBTC will be huge. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.669642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#14",
                    "likes": "4",
                    "time": "17/05/2020-16:09:21",
                    "content": " Liquidation ratio (collateral factor) is lower on compound (125% vs 150% for ETH) Different tokens are available on compound that contribute to borrowing pool, thus increasing the DAI borrowing rate. (See @Tarpmaster answer) Markets are still inefficient. Even if yields are better somewhere, user habits/bias still play a factor in which platforms they decide to use. No access to liquid funds. Some people may be stuck in certain positions that don’t allow them to easily move between platforms to arbitrage rates.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5476190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#15",
                    "likes": "0",
                    "time": "17/05/2020-21:20:16",
                    "content": "Ok - I agree that these are likely to also contribute but the liquidation penalty directly affects whether you are likely to use one platform of another as it impacts the risk of using the platform.  13% penalty is a high number for someone who is worried that they about rapid change in price that could cause a liquidation and this could easily push them to Compound- do you really think this is not an important consideration? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.120833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#16",
                    "likes": "2",
                    "time": "17/05/2020-21:23:36",
                    "content": "I think its a consideration, but not as important as you seem to believe. When I’ve opened positions on Maker, Compound, or Aave, I’ve never once thought about the liquidation penalty in helping determine where I went. It was always borrowing rate, how much I can borrow (liquidation ratio), and types of collateral available. The last thing I want to happen is get liquidated regardless of the penalty percentage. You should always manage your risk accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#17",
                    "likes": "0",
                    "time": "17/05/2020-23:15:02",
                    "content": "In either case, I’d be happy to consider lowering the LR for ETH (although that entails much more risk to MKR holders than changing the LP) - but I think. we need to be tweaking these aspects of ETH CDPs as they could have a significant impact on new DAI creation in this time when we over the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.264204545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#18",
                    "likes": "4",
                    "time": "18/05/2020-00:29:13",
                    "content": "I really don’t think there’s any chance we can lower the liquidation penalty until we are achieving better return on collateral when vaults are liquidated. If we were successfully returning current collateral - 13% on these liquidations, this might be feasible. I think black Thursday showed though that currently the infrastructure we have built is not able to guarantee low enough slippage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5740740740740735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#19",
                    "likes": "1",
                    "time": "18/05/2020-01:04:07",
                    "content": "AAVE has the following advantages  Many types of tokens Deposit tokens have relative interest DAPP integrated liquidation function  The problem of MAKER is mainly to increase the supply of DAI. Simply using zero interest rates and reducing liquidation penalties will not solve the problem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#20",
                    "likes": "2",
                    "time": "18/05/2020-02:15:10",
                    "content": "If you want to deposit ETH and borrow Dai, its much cheaper to do that on MakerDao right now compared to AAVE.   Yes, AAVE gives you a tiny APR on your deposited ETH, but you would owe >6% on your DAI, whereas at Maker your DAI is free right now.  You would pay much more interest on your DAI at AAVE than you would earn from your ETH- making it a net loss for the borrow, ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving feedback on proposal",
                        "3rd party comparing proposal to alternative options"
                    ],
                    "Sentiment": 6.1938775510204085
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#21",
                    "likes": "2",
                    "time": "18/05/2020-07:34:47",
                    "content": "The problem of MAKER is mainly to increase the supply of DAI. Simply using zero interest rates and reducing liquidation penalties will not solve the problem. Maker can directly intervene in the Dai coin market. In open market operations, Maker can initially produce Dai without asset support, and then use it to buy assets such as MKR or ETH or USDC on the open market. Then use these purchased assets to support Dai (the system is still solvent at this time). At this time, the supply of Dai in the agreement will increase, and it is expected to exert downward pressure on Dai’s price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/puntium",
                    "index": "#22",
                    "likes": "1",
                    "time": "19/05/2020-18:03:15",
                    "content": "Is there any data that could suggest that changing the LP would have a significant effect? For example, if LP difference was really driving some demand to compound, I’d expect to see many more loans on compound who’s collateral ratio is closer to the limit compared to Maker. If this was the case then you could potentially argue that incrementally more friendly borrowing parameters would steal market share away from compound. Same goes for the collateral question… how much of dai borrowing on compound is actually backed by eth? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.325000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#23",
                    "likes": "1",
                    "time": "21/05/2020-16:48:07",
                    "content": "Yes. Allowing Dai to trade up to 10% above the peg for several weeks is not sustainable and significantly hampers the usefulness of Dai. We should consider asset purchase operations for the next time we encounter a liquidity crisis like March 12. It should be used with care, but peg will respond much faster and in a more predictable manner when compared to stability fee adjustments. Interestingly, signaling that we are willing to use this technique can help strengthen the peg even when the actual size of asset purchases is small or zero, as traders will be more confident in making a market above $1 when Maker governance has shown the will and ability to do so itself. It can also strengthen the value proposition of the MKR token by adding balance sheet assets. One other monetary policy tool that should be considered is the addition of a CDP type with limited debt ceiling and a low stability fee, fixed for several months. This will allow borrowers to feel more confident migrating/opening a position on Maker, as there will be less uncertainty about future monetary policy decisions forcing them to pay switching costs to another borrowing platform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.676501035196687
                }
            ]
        }
    ]
}