{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip42-anexo-de-compensacion-propuesto-para-contribuyentes-de-makerdao/7554",
            "title": "MIP42: Anexo de compensaci\\xc3\\xb3n propuesto para contribuyentes de MakerDAO ",
            "index": 7554,
            "category": [
                "Latin America"
            ],
            "tags": [
                "mips",
                "espa\\xc3\\xb1ol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#1",
                    "likes": "6",
                    "time": "18/04/2021-21:54:51",
                    "content": " MIP42: Anexo de Compensación Propuesto para Contribuyentes de MakerDAO  Preámbulo MIP#: 42 Título: Anexo de Compensación Propesto para Contribuyentes de MakerDAO Autor(es): @aburban90, @kevinwildenradt Colaboradores: n/a Tipo: En proceso Estado: RFC Fecha de propuesta: <2021-01-20> Fecha de ratificación: <yyyy-mm-dd> Dependencias: n/a Reemplaza: n/a    Sumario Abreviado MIP42: Propone pagarles parcialmente a los contribuyentes en MKR bloqueadas a plazo para incrementar el valor que les es regresado y alinear sus intereses con los de MakerDAO.  Sumario Extendido La MIP42 intenta asegurar que los incentivos de los contribuyentes estén alineados con los intereses del protocolo de MakerDAO para lograr así una mayor descentralización de la DAO. Busca lograr esto permitiendo que los contribuyentes reciban una parte de la compensación por su trabajo con MRK bloqueadas a plazo. El período de depósito da tiempo para que los esfuerzos del contribuyente puedan manifestarse y generar valor. Los contribuyentes tendrán todos los incentivos para continuar invirtiendo en el éxito del protocolo de MakerDAO a lo largo del plazo de adjudicación.  Sumario de Componentes MIP42c1: Situación de pago actual. MIP42c2: Solución propuesta. MIP42c3: Problemas. MIP42c4: Implementación alternativa. MIP42c5: Valor añadido. MIP42c6: Pensamientos finales.  Motivación No todos en DeFi son ballenas que colaboran con los proyectos por mera pasión. Muchos contribuyentes dependen de sus ingresos en DAI para costear sus gastos vitales y pagar sus facturas cotidianas. En particular, como pionera y líder en la industria del empleo descentralizado, MakerDAO se concentra en atraer nueva gente al espacio DeFi. Una forma de hacerlo es a través de un empleo remunerado, ofreciendo un sueldo y beneficios análogos a aquellos ofrecidos en el mundo tradicional. Muchos de los contribuyentes que se unen a MakerDAO también creen en el proyecto y su futuro, pero no pueden permitirse adquirir sus acciones. No pueden comprar MKR en el mercado y votar. No pueden permitirse tener una porción de su pago distribuido como MKR, el que tendrían que vender en el mercado para complementar sus ingresos. De todas formas, sus voces son importantes y deberían poder comprometerse con acciones en el futuro de Maker.  Especificación  MIP42c1: Situación Actual de Pagos Los contribuyentes, en particular los contribuyentes de Comm-Dev, están recibiendo actualmente un pago basado en salarios predeterminados y los presupuestos de los proyectos. Reciben DAI mediante el envío de una factura.  MIP42c2: Solución Propuesta Además de sus pagos estandarizados, los contribuyentes también deberían recibir pagos en MKR para incentivar la participación y recompensar sus aportes. Sugerimos un tentativo pero flexible bonus de 10% en sus facturas a ser pagados como veMKR.  Nota: El bonus no tiene que ser un valor fijo. Sería mejor determinarlo individualmente basado en las preferencias personales de cada colaborador y en el valor que aportan sus propuestas de trabajo.  El solo hecho de acuñar y distribuir nuevos MKR crea el potencial para la presión de venta sobre los MKR en el mercado. Tampoco incentiva la participación de los colaboradores necesariamente. Los veMKR serían MKR bloqueados a plazo, atribuidas durante un plazo determinado. Debería haber una discusión abierta para determinar cómo maximizar de la mejor manera su valor. Como los veCRV, los veMRK serían reclamables como MKR al final de su time-lock. Los tenedores de MKR bloqueados podrán participar tanto en las Encuestas de Gobernanza como en los Votos Ejecutivos. Sus veMKR no serán transferibles hasta que el bloqueo a plazo expire. Los veMKR no deberían ser acuñados por el protocolo de MakerDAO. En lugar de eso, los equipos de dominio ajustaran sus presupuestos para dar cuenta de un 10% (o el valor que sea acordado) para estas distribuciones de veMKR. Al momento en que una factura o pago sea acordado, el protocolo comprará MKR con DAI en el mercado abierto usando el presupuesto del equipo de dominio, convertirá los MKR en veMKR y los distribuirá entre los colaboradores como un adicional a su paga usual.  MIP42c3: Problemas Comprensiblemente, desarrollar veMKR como una nueva token de una forma cuidadosa y segura, y añadir un proceso de distribución, es una tarea de alta complejidad. Requerirá tiempo, energía y auditorías de parte de un equipo de desarrolladores ya sobrecargado.  MIP42c4: Implementación Alternativa Para evitar desarrollar algo complicado, como los veMKR, una implementación más simple sería comprar las MKR al momento en que una factura o pago es convenido. Las MRK serían retenidas en nombre del colaborador según el protocolo y serían distribuidos en una fecha posterior. Los permisos de voto podrían, potencialmente, ser delegados a la address elegida por el colaborador a través de un proxy.  MIP42c5: Valor Agregado En el corto plazo estas distribuciones aplicarán constantemente una presión de compra para los MKR en el mercado, pero es una presión de compra que se toma prestada de los MKR que hubieran sido quemados por el protocolo cuando el superávit del sistema fuera excedido. A largo plazo, cuando los veMKR sean desbloqueados, la presión de venta puede volver. En términos netos, esto significa que menos MKR serán compradas y quemadas. El valor de incentivar a los contribuyentes y su trabajo excede el costo de no quemar esos tokens MKR. El período de garantía da tiempo a que se manifiesten y generen valor los esfuerzos de los colaboradores. Idealmente, este valor será alcanzado mucho antes que sus veMKR sean desbloqueados. Sólo luego de esto el colaborador podrá cosechar los beneficios de su trabajo a través de la venta de MKR desbloqueados, si es lo que eligen. Esto les dará todos los incentivos para continuar asegurando el éxito del Protocolo Maker a través de su cronograma de adjudicaciones. Ejemplo: El contribuyente puede proponer proporciones relativas de veMRK y DAI, así como el período de pago o el cronograma de la adquisición de acciones para reflejar el riesgo que asume el protocolo al financiar el trabajo. Por ejemplo, las tareas con mayor valor agregado especulativo podrían ser pagadas mayormente en veMKR, y con períodos de garantía más largos.  MIP42c6: Pensamientos Finales A medida que las bases iniciales se disuelven y MakerDAO entra a su siguiente capítulo de descentralización, creemos que este cambio alineará aun más los incentivos para todos aquellos que contribuyen  con el ecosistema de MakerDAO. Esta propuesta incrementaría la descentralización de MakerDAO, recompensando a aquellos que contribuyan a su crecimiento a través de su inversión de tiempo y trabajo. Esta es una traducción libre del artículo original en inglés, gracias a @Sebix y @Lozadaluis12. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.286458333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#2",
                    "likes": "4",
                    "time": "18/04/2021-21:56:18",
                    "content": "¡ Gracias Sebas por ayudar al equipo con la tarea redactar la info en español ! Welcome ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                }
            ]
        }
    ]
}