{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/technical-report-b-protocol-liquidations-during-last-thursday/5389",
            "title": "Technical Report: B.Protocol liquidations during last Thursday ",
            "index": 5389,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "liquidation-system"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#1",
                    "likes": "20",
                    "time": "29/11/2020-09:11:51",
                    "content": "On Thursday 26/11, Ethereum market experienced a sharp price decline, from over $600 to $480 in about 12 hours. Around $10m were liquidated across the DeFi ecosystem (and in addition $90m on Compound, but there the collateral and debt were of the same token, hence it had no effect on the market), and CeFi liquidations nearly hit $2b. Though B.Protocol is still at early stage, managing around 115 Vaults, and around $7M in deposits, three of the ETH-A Vaults that were managed with B.Protocol interface, and had total debt of 70k DAI, got liquidated by B.Protocol backstop (as expected). The backstop transferred a sum of 9 ETH, 50% of its profits, into B.Protocol Jar, to be distributed to its users. This was the first live demonstration of the backstop system, and in this report we present how the liquidation process occurred, hoping to make it clearer to the reader that managing his Vault via B.Protocol could help MakerDAO stability. We first present the process of events, and then give a short summary of who was benefited by such a liquidation process. Liquidation Process The following occurred during Thursday 26/11 and all times are according to UTC(+0) timezone:   9:03 AM: MakerDAO price for the subsequent hour set to $484. This price would be set at 10:00 AM and would make Vaults 26, 50 and 69 (*) unsafe, unless the users would take action to save it (before 10 AM).  9:03 - 9:50 AM: The users did not take any action during this hour.  9:50 - 9:51 AM: One of our liquidators executed three transactions that partially repaid each of these Vaults debt.  9:51 - 10:00 AM: At this period Vault owners could still save their Vaults. If they would, the debt that was paid by the liquidator, would have been sent back to him.  10:00 AM: MakerDAO price was poked, and the Vaults became unsafe. If the liquidator did not pay part of the original debt, these Vaults would have been subject to liquidation by anyone trying to liquidate Vaults on MakerDAO.  10:01 AM - 10:30 AM: The backstop liquidated all 3 Vaults. The 70k DAI debt was repaid in return to 157.88 ETH, which is a 13% discount over the ETH/USD price feed at that time. Of which, 9.08 ETH were set to B.Protocol Jar, and will be shared with all the users who manage their MakerDAO Vaults with B.Protocol.  11:01 AM: users got back control on their remaining collateral.  * these numbers are according to B.Protocol smart contract and correspond to Vaults 0x55D1b191E7c18bc1e908651999043511c1FadC38, 0xcBE3d12322A9ec8895615C13528D8b9Bcf582F93, and 0xF97ab6F76F7Cb804D039Bd9565Ee6709A091c42d in the MakerDAO Vat system. The aftermath B.Protocol worked as expected, and demonstrated how it can remove some overload from MakerDAO keepers. At 10:00 AM eleven Vaults that are not managed by B.Protocol were also liquidated (by MakerDAO keepers). Comparing the two processes nicely demonstrates why the liquidation process in B.Protocol is more appealing to keepers:  The average gas price that was used in B.Protocol liquidations was 250 gwei, while on MakerDAO all 11 liquidations were done with a gas price of 630 gwei. B.Protocol keepers could liquidate in multiple chunks, allowing them some time to rebalance their position, and bring DAI from other DeFi venues they trade. Overall the liquidation process was spread over 30 minutes. MakerDAO keepers locked, for a 6 hour period, 94% of the needed DAI, already 54 seconds after the beginning of the hour.  The favorable conditions allow liquidators to commit to building a more robust trading system, and to share their profits with the users, rather than with the miners. ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-would-the-maker-community-want-to-onboard-a-new-collateral-e-g-wbtc-b-backed-by-b-protocol-that-has-lower-cr-with-the-same-sf/5652",
                        "https://forum.makerdao.com/t/mip13c3-sp11-onboarding-a-new-collateral-type-backed-by-b-protocol-v2-declaration-of-intent/8802",
                        "https://forum.makerdao.com/t/maker-relay-ep-23-en-espanol/5442",
                        "https://forum.makerdao.com/t/maker-relay-ep-23/5419",
                        "https://forum.makerdao.com/t/discussion-wbtc-b-collateral-type-backed-by-b-protocol-with-x10-leverage/5409",
                        "https://forum.makerdao.com/t/weekly-sourcecred-distribution-payout-increase/5546"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.574850394703335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "29/11/2020-16:01:25",
                    "content": "Thank you for the report @yaronvel ! It’s good to have you and the B.Protocol Team as Maker Community members. Looking forward to the development of BP! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.375
                }
            ]
        }
    ]
}