{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-yeth-vault-was-halted-due-to-the-broken-dai-peg-we-need-to-set-the-lr-of-usdc-to-near-100-to-avoid-losing-them-as-a-user/3984",
            "title": "The yETH vault was halted due to the broken Dai peg. We need to set the LR of USDC to near 100% to avoid losing them as a user ",
            "index": 3984,
            "category": [
                "Governance"
            ],
            "tags": [
                "usdc-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#1",
                    "likes": "3",
                    "time": "04/09/2020-21:14:20",
                    "content": "The yETH vault was halted because it couldn’t buy enough Dai to pay back its debt without huge losses due to the broken dai peg. This time, if we don’t fix it with a poor man’s PSM quickly, I think we are very likely to lose them as a user a permanently. And that will then lead to an even more broken dai peg since yETH was overall generating Dai, and lots of it. The executive vote today also adds PAX as functional collateral. PAX is like USDC, very legit and trustworthy. We should set USDC, PAX and TUSD all to an LR of 100-101% in order to diversify exposure across those 3 legal entities, and then set their debt ceilings to hundreds of millions (At least for USDC and PAX). If we lose the yETH vault that might be our last chance at fixing the peg and avoiding negative rates… ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining the issue with the yETH vault and proposing a solution to fix the broken Dai peg. The proposal involves setting the LR of USDC to near 100% and adding PAX as functional collateral. A 3rd party is giving constructive criticism by suggesting that the proposal should also include diversifying exposure across legal entities and setting debt ceilings to hundreds of millions. The post can also be categorized as auditing and reviewing the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.81140350877193
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/09/2020-07:15:28",
                    "content": "Why should we care about the yETH vault in particular? DAI is fluctuating a bit above $1 for the last 6 months and our risk team is handling the situation fine with proposals to add more collateral types, rasing the DCs and adjusting the rates between -8% and 0%. I don’t see the need to change the methods that are working (I bought DAI a few days ago for $1.0000) and introduce new risks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.728354978354978
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#3",
                    "likes": "2",
                    "time": "05/09/2020-07:52:17",
                    "content": "I think you’re being ironic. Just look at dai.stablecoin.science If yETH ends up having to move to a different protocol or shut down, it will be a massive setback for this project. It could have been the biggest driver of ETH collateral and Dai supply growth, and could maybe even have fixed the peg by itself. If we fail to deliver a working product that can be used which forces them to change the yETH vault to use something else than Maker and Dai, why should anyone else integrate with maker when the protocol can’t even handle it and you are forced to spend extra time shutting down and changing your integration again? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.549382716049383
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/09/2020-19:37:04",
                    "content": "The dai peg is pretty good actually. YETH had introduced a broken protocol that doesn’t allow them to exit. Don’t blame the other. Don’t test in prod and you will be fine. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.701388888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/09/2020-21:06:56",
                    "content": "There’s a signal request for this currently live for USDC-A: Signal Request: Should we reduce the USDC-A collateralization ratio? I’d suggest that if you want to see this happen you refer people to that. While I agree with you in general that this isn’t great for the yETH vault, it was somewhat predictable, they’re supplying DAI to an AMM at a time when DAI is trading higher than other stablecoins. It was obvious this would happen even if the ETH price remained constant. The yETH vault would fix the peg by selling DAI. It can’t both fix the peg and have that DAI available when it needs to de-lever. I agree that dropping the USDC-A LR would provide them with an alternative means of lowering the risk of the position if they needed to. That said, they can currently do that with the USDC-A vault as it is, it’s just not as capital efficient. It’s also worth noting that Maker does have advantages over other protocols (along with the downsides of dealing with DAI). Because it’s the primary issuer of DAI it should have lower fees than any of the secondary markets. It’s also not limited by the amount of stablecoins deposited by other users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.46783685064935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#6",
                    "likes": "0",
                    "time": "06/09/2020-17:26:23",
                    "content": "I do not really agree with the OP to essentially remove risk parameters for USDC, but I think the overall point is a good one. We need more flexibility in the system in order to allow larger players to function better. It is very risky to take a position that relies on DAI going to $1 if you are going to hit debt ceilings while taking that position. The DAI price could easily jump due to new, unforeseen demand and wreck you because now instead of owing $100m on your vault, you effectively own $110m due to DAI volatility. Add to this the fact that one of the scenarios is falling ETH price -> higher DAI demand -> higher DAI peg -> double whammy for vault owners. Once the debt ceilings are hit, you run out of options. If we open up major additional debt ceiling space across all the major assets, it will give larger players a lot more confidence to work in the system so they can have better flexibility in how they manage their vaults. If demand for DAI jumps, there needs to be ways to mint large amounts of it to offset. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.991083192170149
                }
            ]
        }
    ]
}