{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip117-rwa-master-participation-trust-to-onboard-loanstreet-as-loan-liquidator/19772",
            "title": "MIP117: RWA Master Participation Trust to Onboard LoanStreet as Loan Liquidator ",
            "index": 19772,
            "category": [
                "Maker Improvement Proposals",
                "RFC"
            ],
            "tags": [
                "mips",
                "rwa",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#1",
                    "likes": "2",
                    "time": "09/02/2023-21:10:28",
                    "content": " MIP117: RWA Master Participation Trust to Onboard LoanStreet as Loan Liquidator  Preamble MIP#: 117 Title:  RWA Master Participation Trust to Onboard LoanStreet as Loan Liquidator Authors: @maxglass  Contributors: Tags: RWA Type: General Status: RFC Date Proposed: 2023-02-09 Date Ratified: <yyyy-mm-dd> Forum URL: https://forum.makerdao.com/t/mip117-rwa-master-participation-trust-to-onboard-loanstreet-as-loan-liquidator/19772 Ratification Poll URL: Dependencies: MIP21 Replaces: N/A   References     MIP95: $100M of Cogent Bank Loan Participations Formal Submission   MIP95: $100M of Cogent Bank Loan Participations  Preamble MIP#: 95 Title:  $100M of Cogent Bank Loan Participations Authors: @maxglass and Kyle Feldman [email protected]  Contributors: Tags: RWA Type: Real World Asset Status: Formal Submission Date Proposed: 2023-01-06 Date Ratified: <yyyy-mm-dd> Forum URL: https://forum.makerdao.com/t/mip95-simple-to-onboard-rwa-100m-in-cogent-bank-loan-participations/19338 Ratification Poll URL: Dependencies: MIP21 Replaces: N/A   References  HVBank Col…    Sentence Summary To address concerns about liquidity for bank loan participations from HVBank (MIP6) and Cogent Bank (MIP95), I propose that RWA Master Participation Trust (“MakerTrustDE”) sign up for LoanStreet (“LIQUIDATOR”), a platform for liquidating bank loans and viewing comparable sales (data Maker can use to mark-to-market loans in RWA Master Participation Trust).  Paragraph Summary LoanStreet (“LIQUIDATOR”) is an online platform that streamlines the process of loan trading for banks. 1,300 institutions are registered on LoanStreet’s platform, which trades a significant dollar volume of loans per month. LoanStreet utilizes a single agreement across all trades that significantly reduces time spent negotiating contracts, allowing deals to close quickly. We propose that RWA Master Participation Trust sign up for LoanStreet (“LIQUIDATOR”) so that it can liquidate loans quickly if MRK voters want that. Moreover, with access to LoanStreet, RWA Master Participation Trust can view comparable sales data that is useful for mark-to-market of Maker’s loan assets.  Motivation Response to MIP95 has been supportive but most have pointed to the fact that Maker’s current meta includes a prioritization of daily liquidity for RWA. Putting aside my question about why monthly liquidity is not sufficient, I’ve posted this MIP as a solution to increase liquidity for the loan assets in RWA Master Participation Trust. I believe that bank loan participations should be part of a diversified portfolio of RWA, and that these loan assets have a liquid market, as evidenced by LoanStreet’s robust business.  Component Summary MIP117c1: About LoanStreet (“LIQUIDATOR”) Bank loan liquidation platform MIP117c2: LoanStreet’s Fee 15 bps (0.15%) of sales proceeds MIP117c3: Sign Up For LoanStreet (“LIQUIDATOR”) Free to sign up and get access to private market data MIP117c4: If Necessary, Update the Trust Agreement It may be required to updated the Trust Agreement for RWA Master Participation Trust to use LoanStreet MIP117c5: Use LoanStreet Data to Mark-to-Market Loan Assets Daily data about loan sales can be used by Maker to mark-to-market loan assets in the Trust MIP117c6: Disclaimer  Specification / Proposal Details  MIP117c1: About Loan Street (“LIQUIDATOR”) The secondary market for bank originated loans is hundreds of $Millions, if not $Billions, per month. One player in this enormous market is LoanStreet (“LIQUIDATOR”), an online platform that streamlines the process of loan trading for banks. 1,300 institutions are registered on LoanStreet’s platform, which trades a significant dollar volume of loans. LoanStreet utilizes a single agreement across all trades that significantly reduces time spent negotiating contracts, allowing deals to close quickly.  image923×1194 151 KB   MIP117c2: LoanStreet’s Fee LoanStreet charges the seller 15 bps (0.15%) of sales proceeds and 10 bps annually for reporting, though the reporting 10 bps are likely to be bourn by the originator of the loan not Maker.  MIP117c3: Sign Up For Loan Street (“LIQUIDATOR”) This MIP instructs the Trustee and Trust Sponsor of the RWA Master Participation Trust (and any other relevant parties) to sign the Trust up for LoanStreet. There is zero cost to sign up.  MIP117c4: If Necessary, Update the Trust Agreement If a change to the Trust Agreement is necessary for the Trust to use LoanStreet as LIQUIDATOR, MKR voters authorize such an update to the RWA Master Participation Trust Agreement.  MIP117c5: Use LoanStreet Data to Mark-to-Market Loan Assets Once the RWA Master Participation Trust has signed up for LoanStreet, the Trustee will have access to loan sales data. This data should be made available to relevant service providers, such as Ankura Trust, any RWA monitoring team/solution that is operating at that time, and to whatever core units or MetaDAOs have an RWA mandate. This market data is useful for marking loan assets in the Trust to market. Furthermore, the data can be useful if the DAO wants to build automated liquidation for RWA based on mark-to-market values.  MIP117c6: Disclaimer Except for statements of historical fact, certain information set forth in this presentation contain forward-looking information and forward-looking statements. These statements are not guarantees of future performance and undue reliance should not be placed on them. Such forward-looking statements necessarily involve known and unknown risks and uncertainties, which may cause actual performance and financial results in future periods to differ materially from any projections of future performance or result expressed or implied by such forward-looking statements. Although forward-looking statements contained in this presentation are based upon what management of the LoanStreet believes are reasonable assumptions, there can be no assurance that forward-looking statements will prove to be accurate, as actual results and future events could differ materially from those anticipated in such statements. LoanStreet undertakes no obligation to update forward-looking statements if circumstances or management’s estimates or opinions should change except as required by applicable securities laws. The reader is cautioned not to place undue reliance on forward-looking statements. The terms and conditions set forth herein are not intended to, and do not and shall not, constitute a binding agreement, nor an agreement by any party to enter into a binding agreement. Rather, such terms and conditions are intended to serve as the basis for due diligence, and the potential negotiating and drafting one or more definitive agreements on the terms and conditions stated herein (or as such terms may hereinafter be amended during further negotiations), as well as other terms and conditions to be determined. In addition, any terms and conditions of any definitive agreement(s) that may arise out of this proposal or the negotiations surrounding the same are subject to, among other things, the review and approval of LoanStreet’s Board of Directors, legal advisors, and other appropriate decision makers. Neither party can or shall rely on this proposal as binding on the other, and neither party will be bound unless and until one or more definitive agreement(s) have been fully executed by both parties. Until such time, neither party is bound to continue negotiations, and each party reserves the right to cease negotiations at any time, for any reason or no reason. The terms and conditions herein shall be governed by and construed in accordance with the laws of the State of New York, without regard to conflict of law principles. No owner, contractor, nor employee of MaxStability LLC holds an equity or debt position in LoanStreet ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
                        "https://forum.makerdao.com/t/mip95-100m-of-cogent-bank-loan-participations/19338",
                        "https://loan-street.com/about/",
                        "https://loan-street.com/about/",
                        "https://loan-street.com/about/",
                        "https://forum.makerdao.com/t/mip95-100m-of-cogent-bank-loan-participations/19338/17",
                        "https://forum.makerdao.com/t/weekly-mips-update-125/19812",
                        "https://forum.makerdao.com/t/weekly-mips-update-129/20172",
                        "https://forum.makerdao.com/t/weekly-mips-update-128/20070",
                        "https://forum.makerdao.com/t/weekly-mips-update-127/20001",
                        "https://forum.makerdao.com/t/weekly-mips-update-126/19881",
                        "https://forum.makerdao.com/t/weekly-mips-update-130/20226"
                    ],
                    "GPT-summary": "The post proposes that RWA Master Participation Trust sign up for LoanStreet, a platform for liquidating bank loans and viewing comparable sales data. The proposal aims to increase liquidity for the loan assets in RWA Master Participation Trust. The post explains the benefits of LoanStreet and provides details on the fees, sign-up process, and use of data for marking loan assets in the Trust. The post does not receive any feedback or questions from third parties, but it extends the proposal to relevant parties and includes a disclaimer.",
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Privacy, Security and risk management",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.55191713048856
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/02/2023-15:34:54",
                    "content": "    maxglass:  MIPXXc4: If Necessary, Update the Trust Agreement It may be required to updated the Trust Agreement for RWA Master Participation Trust to use LoanStreet   Extremely relevant to know what is the process and  necessary steps to make an update to the Trust Agreement. We believe without those details this is an opaque proposal.     maxglass:  MIPXXc5: Use LoanStreet Data to Mark-to-Market Loan Assets Daily data about loan sales can be used by Maker to mark-to-market loan assets in the Trust   How will the loan sales data be made available to relevant parties?     maxglass:  We propose that RWA Master Participation Trust sign up for LoanStreet (“LIQUIDATOR”) so that it can liquidate loans quickly if MRK voters want that.   As you know, bank loan markets can be volatile, and the values of loans can fluctuate quickly. If LoanStreet experiences a significant market downturn, it could affect the value of the loans. There is also  a risk of technical issues or downtime that could impact the ability to trade loans. Can you provide more details of past performance and the monitoring that’s being performed along with a walk through of the disaster recovery plan. Does LoanStreet provide clauses in contractual agreements that outline the consequences of technical issues or downtime? Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.961309523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/02/2023-14:41:44",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal MIP117: RWA Master Participation Trust to Onboard LoanStreet as Loan Liquidator ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/maxglass",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/02/2023-17:43:06",
                    "content": "    flipflopflapdelegate:  Extremely relevant to know what is the process and necessary steps to make an update to the Trust Agreement. We believe without those details this is an opaque proposal.    My reading of the Trust Agreement now is that it does not need to be updated to work with LoanStreet.  Update or modification of the Trust Agreement is a “Material Decision,” according to the Trust Agreement, that can only be made by vote of MKR holders. See a list of all Material Decisions below. Note Material Decision (xiii), “The Trust sells, assigns, or transfers a Participation Interest”  image870×1099 105 KB   Here is additional dicussion of the process for implementing a Material Decision:  image866×252 58.8 KB      flipflopflapdelegate:  How will the loan sales data be made available to relevant parties?    Quoting from the team at LoanStreet: \"Through a secure server and login credentials, parties have the ability to review analytics on loan performance on a monthly basis post-purchase throughout the life of the loans. As a note, our clients strongly rely on us for the monthly reporting of loans. We can be that reporting entity in this instance, using the monthly servicing tape from the seller to provide line-by-line data for the buyer(s).\"     flipflopflapdelegate:  As you know, bank loan markets can be volatile, and the values of loans can fluctuate quickly. If LoanStreet experiences a significant market downturn, it could affect the value of the loans. There is also a risk of technical issues or downtime that could impact the ability to trade loans. Can you provide more details of past performance and the monitoring that’s being performed along with a walk through of the disaster recovery plan.    Quoting from the team at LoanStreet: “LoanStreet does not operate on a bid/ask format. There is one price for all buyers - this transparency gives comfort to purchasers that they are paying the clearing price. Buyers will solely enter indications as to the amount they wish to purchase. In the event of any market downturn, the seller has the ability to adjust the price at which the pool is being offered.”     flipflopflapdelegate:  Does LoanStreet provide clauses in contractual agreements that outline the consequences of technical issues or downtime?    Quoting from the team at LoanStreet: “I think the above should resolve this question but let me know if otherwise. If there were to be any technical issues or downtime, it would have no effect on the execution of sale as the pool price is static and not actively changing.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.04656862745098
                }
            ]
        }
    ]
}