{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/actualizacion-encuestas-y-votaciones-ejecutivas-12-de-julio-de-2021/9396",
            "title": "Actualizaci\\xc3\\xb3n - Encuestas y Votaciones Ejecutivas - 12 de Julio de 2021 ",
            "index": 9396,
            "category": [
                "Latin America"
            ],
            "tags": [
                "update",
                "espa\\xc3\\xb1ol",
                "polls"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#1",
                    "likes": "2",
                    "time": "17/07/2021-01:04:57",
                    "content": "¡Hola a todos! Aquí les saluda Alejandro  , para traerles las más recientes novedades de la Comunidad MakerDAO sobre las encuestas. Esta semana estuvo bastante movida concretamente este 12 de Julio con diversas y nuevas encuestas, vamos a reseñar las más interesantes: Empezamos con la encuesta para añadir el colateral Matic/Polygon, esta red con bajas comisiones de bastante crecimiento ya es muy popular y no podía quedarse por fuera con un acuerdo donde se quiere agregar un nuevo tipo de vault bastante interesante. Por otro lado tenemos otra encuesta sobre los ajustes de los parámetros de las subasta FLAP, las subastas de excedentes del sistema del Protocolo Maker. Ahora pasamos a las encuestas de ratificación donde encontramos varias Core Unit: Core Unit de Comunicaciones de la Gobernanza, COM-001 La Core Unit de Comunicaciones de Gobernanza realiza un conjunto complementario de recursos y servicios que se centran en la accesibilidad informativa y las prácticas de comunicación de MakerDAO como organización pública. Core Unit de Comunicación Estratégica MakerDAO ha entrado en su siguiente fase de crecimiento. En seis meses, la circulación de DAI se ha cuadruplicado con creces hasta alcanzar los 4.700 millones, frente a los 1.000 millones de noviembre de 2020. El aumento tiene lugar mientras el mercado de stablecoin se expandió exponencialmente en el último año. Dado el ritmo de crecimiento en el entorno actual del mercado, la unidad cree que es un momento crucial para que MakerDAO aumente las iniciativas de marketing para impulsar el crecimiento, mantener el liderazgo de pensamiento y ganar cuota de mercado. Core Unit de marketing AmaZix El objetivo de este MIP es proponer a AmaZix como socio estratégico global de marketing para MakerDAO con el fin de ayudar a Dai a lograr un rápido crecimiento y una adopción masiva a través de la implementación de una estrategia de marketing altamente agresiva, dinámica y eficiente. Menciones Interesantes Encuesta de ratificación del presupuesto de la Core Unit de Crecimiento, GRO-001 Encuesta de ratificación para modificar el presupuesto de la Core Unit de producción de contenidos, MKT-001 Recuerda que puedes ver estas encuestas y todas las anteriores haciendo clic en este enlace     Notion    Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. A new tool that blends your everyday work apps into one. It's the all-in-one workspace for you and your team      ",
                    "links": [
                        "https://www.notion.so/Encuesta-Ajustar-los-par-metros-de-la-subasta-FLAP-12-de-Julio-de-2021-b1f36553711942ebac0dc8b43d316d7b",
                        "https://www.notion.so/Encuesta-de-ratificaci-n-de-la-Core-Unit-de-Comunicaciones-de-la-Gobernanza-COM-001-12-de-Julio-de--5f0d11e0e88f4b21814ca89948752f0b",
                        "https://www.notion.so/Encuesta-de-ratificaci-n-de-la-Core-Unit-de-Comunicaci-n-Estrat-gica-12-de-Julio-de-2021-2022786d67c14a5e98842b8d1117876e",
                        "https://www.notion.so/Encuesta-de-inclusi-n-para-a-adir-la-Core-Unit-de-marketing-AmaZix-12-de-Julio-de-2021-0a74368c53b743e3b4b2d829726cace6",
                        "https://www.notion.so/Encuesta-de-ratificaci-n-del-presupuesto-de-la-Core-Unit-de-Crecimiento-GRO-001-12-de-Julio-de-20-14c1ed1651f14d5c972e68bf96235f87",
                        "https://www.notion.so/Encuesta-de-ratificaci-n-para-modificar-el-presupuesto-de-la-Core-Unit-de-producci-n-de-contenidos--5b38cc7e62a741bab8f4c731833d9440",
                        "https://www.notion.so/Encuestas-12-de-Julio-de-2021-dd6fa2a3f3584807b3bf05019824cae9",
                        "https://www.notion.so/Encuestas-12-de-Julio-de-2021-dd6fa2a3f3584807b3bf05019824cae9"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.383116883116883
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/07/2021-17:27:51",
                    "content": "Brutal Ale!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 0.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "1",
                    "time": "18/07/2021-19:55:47",
                    "content": "Un placer como siempre traducir y postear contenido  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/actualizacion-encuestas-y-votaciones-ejecutivas-5-de-julio-de-2021/9210",
            "title": "Actualizaci\\xc3\\xb3n - Encuestas y Votaciones Ejecutivas - 5 de Julio de 2021 ",
            "index": 9210,
            "category": [
                "Latin America"
            ],
            "tags": [
                "update",
                "espa\\xc3\\xb1ol",
                "polls"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#1",
                    "likes": "4",
                    "time": "07/07/2021-00:48:51",
                    "content": "¡Hola a todos! Aquí les saluda Alejandro  , para traerles las más recientes novedades de la Comunidad MakerDAO sobre las encuestas. Empezamos la actualización con una sola encuesta, hoy hablaremos de Bitcoin, pero no cualquiera, en este caso creado desde un contrato inteligente en la red de Ethereum, concretamente este es totalmente descentralizado sin confianza, sin empresas detrás o cualquier otro ente, exactamente igual a la filosofía del Bitcoin original. Según afirma el creador del hilo sobre el colateral “Es el colateral ideal para respaldar a DAI es neutral, sin punto central de fallo y sin confianza, sin IOU, sin custodio, sin banco central, y con contratos inteligentes sin oráculos. Con esto en mente, 0xBitcoin es la garantía ideal para respaldar a DAI.” _@admazzola Es un planteamiento sin dudas muy interesante  Recuerda que puedes ver estas encuestas y todas las anteriores haciendo clic en este enlace     Notion    Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. A new tool that blends your everyday work apps into one. It's the all-in-one workspace for you and your team      ",
                    "links": [
                        "https://www.notion.so/Encuesta-del-Visto-Bueno-Comunitario-0xBTC-0xBitcoin-Token-de-Mineria-Neutral-5-de-Julio-de-20-f90786785e574025a79a0d9dd76c095d"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3196022727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#2",
                    "likes": "1",
                    "time": "07/07/2021-00:50:24",
                    "content": "Perfecto. ¡Muchas gracias por la actualización semanal, Ale! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#3",
                    "likes": "1",
                    "time": "07/07/2021-00:51:26",
                    "content": "De nada siempre aportando a la comunidad  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "2",
                    "time": "07/07/2021-19:23:59",
                    "content": "    Alefcripto:  Según afirma el creador del hilo sobre el colateral “Es el colateral ideal para respaldar a DAI es neutral, sin punto central de fallo y sin confianza, sin IOU, sin custodio, sin banco central, y con contratos inteligentes sin oráculos. Con esto en mente, 0xBitcoin es la garantía ideal para respaldar a DAI   Pero puede tener buena filosofia, pero sin mercado ni gente que lo respalde pues no creo que sea un buen colateral ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#5",
                    "likes": "0",
                    "time": "08/07/2021-02:05:32",
                    "content": "Claro eso coméntaselo al creador del hilo, yo solo informo sobre las encuestas  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/paulo",
                    "index": "#6",
                    "likes": "0",
                    "time": "08/07/2021-02:07:57",
                    "content": "Había oído hablar de 0xBitcoin antes, pero nunca le preste atención, cuando vi la propuesta me puse a hacer una investigación rápida, la idea es interesante a la vez que un despropósito, en un mundo girando a PoS, crear un token que se “mina” es cuanto menos curioso, el proyecto carece de tracción, su canal de Youtube apenas tiene 153 suscriptores, en Reddit no llegan a 2000, en Discord hay un poco mas de gente y están justamente hablando sobre la encuesta en Maker, eso fue hace dos días y ni siquiera hubo reacción a la noticia. Por ultimo viendo en Etherscan, el volumen de operaciones de la ultima semana no llega a 15 ETH. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#7",
                    "likes": "0",
                    "time": "08/07/2021-13:20:08",
                    "content": "igual, al final los Holders de MKR escogen que pasara o no. Y por ahora todo indica que es un rotundo F ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/actualizacion-encuestas-y-votaciones-ejecutivas-14-de-junio-de-2021/8800",
            "title": "Actualizaci\\xc3\\xb3n - Encuestas y Votaciones Ejecutivas - 14 de Junio de 2021 ",
            "index": 8800,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "polls"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#1",
                    "likes": "4",
                    "time": "16/06/2021-10:32:57",
                    "content": "¡Hola a todos!  Les traigo la actualización semanal de las Encuestas y Votaciones Ejecutivas de esta segunda semana de Junio para su regocijo. La información más pertinente a continuación: Sumario breve    Esta semana tenemos encuestas para la incorporación de 3 nuevos tipos de vault como colaterales (SLP-YFI-ETH, SLP-AAVE-ETH, SLP-ETH-LINK). Las mismas utilizarán SushiJoin Adapter, por lo que las recompensas de farmeo a través del contrato MasterChefV2 estarán disponibles .   También se han colocado en el sistema dos encuestas que buscan incrementar el parámetro ‘Dust’ (o Piso de Deuda) para la gran mayoría de tipo de vaults (con algunas excepciones, como: PSM-USDC-A, ETH-B, y ETH-C).   Por último, tenemos unas cuántas Encuestas de Ratificación, que buscan modifcar presupuestos y/o incorporar facilitadores para las CU de GovAlpha, Riesgo, Finanzas del Mundo Real y Escalado de Ecosistemas Sostenibles.   Todas las encuestas ya están subdas al Portal de Encuestas y pueden ser vistas aquí:   Notion    Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. A new tool that blends your everyday work apps into one. It's the all-in-one workspace for you and your team      ¡Un saludo a toda la comunidad MRK!  ",
                    "links": [
                        "https://www.notion.so/Encuestas-14-de-Junio-del-2021-207c16681b8442079993ac6c73cdc0b0"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1439393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "17/06/2021-01:34:33",
                    "content": "Excelente Sebix muy bueno el resumen  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/actualizacion-encuestas-y-votaciones-ejecutivas-28-de-junio-de-2021/9007",
            "title": "Actualizaci\\xc3\\xb3n - Encuestas y Votaciones Ejecutivas - 28 de Junio de 2021 ",
            "index": 9007,
            "category": [
                "Latin America"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#1",
                    "likes": "4",
                    "time": "28/06/2021-18:31:24",
                    "content": "¡Hola a todos!  Les traigo la actualización semanal de las Encuestas y Votaciones Ejecutivas para la última parte del mes. En este caso, tenemos sólo una encuesta: Sumario brevísimo   El Comité de Mercados Abiertos de MakerDAO ha propuesto cambios a las tarifas de estabilidad para las vaults listadas en la encuesta, con una disminución que oscila entre el 0,5% y hasta 3% dependiendo de la vault. La lista completa y la información pertinente en el siguiente link:     Notion    Notion – The all-in-one workspace for your notes, tasks, wikis, and databases. A new tool that blends your everyday work apps into one. It's the all-in-one workspace for you and your team      ¡Un saludo a toda la comunidad de Maker!  ",
                    "links": [
                        "https://www.notion.so/Encuestas-28-de-Junio-de-2021-3ef6afa964e84215af20523427213024"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.715909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "28/06/2021-21:50:49",
                    "content": "Gracias Sebas por el resumen  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "3799"
}