{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/just-for-fun-dai-holder-snapshot-polls/5043",
            "title": "Just for Fun: DAI Holder Snapshot Polls ",
            "index": 5043,
            "category": [
                "Governance"
            ],
            "tags": [
                "community",
                "polls"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "13",
                    "time": "07/11/2020-19:22:10",
                    "content": "Hi Maker community! I stumbled upon the Snapshot poll space for DAI this past week, and think it could offer some interesting opportunities to engage with DAI holders and gather user feedback. To test it out, I mirrored the current MKR executive vote as a snapshot poll for DAI holders: https://snapshot.page/#/dai/proposal/Qmbm8rWk85ShYyr3RQgYrvCfJMmPVgTNeoj1SpC8PQbg6b Let me know what you think! I’m hoping if nothing else this will get people more interest in Maker governance. ",
                    "links": [
                        "https://snapshot.page/#/dai/proposal/Qmbm8rWk85ShYyr3RQgYrvCfJMmPVgTNeoj1SpC8PQbg6b",
                        "https://forum.makerdao.com/t/week-23-dai-distributions-sourcecred-funding-mip13c3-sp6/5117",
                        "https://forum.makerdao.com/t/maker-relay-ep-20-en-espanol/5084",
                        "https://forum.makerdao.com/t/maker-relay-ep-20/5078"
                    ],
                    "GPT-summary": "The author of the post is sharing a snapshot poll for DAI holders and is asking for feedback from the Maker community. The author hopes that this will increase interest in Maker governance.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/11/2020-19:25:07",
                    "content": "This is a really smart addition. Nice job thinking of and implementing this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.035714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "1",
                    "time": "08/11/2020-10:29:06",
                    "content": "Nice idea! Also interesting: vault-debt of each voter  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/11/2020-17:20:57",
                    "content": "I think this is interesting.  Was tempted to connect a wallet and see if I have to post an on-chain transaction or not. I have long advocated that borrowers and/or DAI holders should have a voice in Maker. One idea in this regard was for Maker in conjunction with oasis vault access to add the following feature in oasis:  When a vault user is borrowing or paying back DAI,  optionally answer feedback questions in their on-chain transactions. I could see this as a useful feature in uniswap and other defi projects as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#5",
                    "likes": "1",
                    "time": "09/11/2020-08:29:51",
                    "content": "Thanks. This is very interesting. For those (like me) who didn’t know what Snapshot is: [from: https://docs.snapshot.page/] Snapshot is an off-chain gasless multi-governance client with easy to verify and hard to contest results.   Creating a proposal and voting is free no transactions   Proposals and votes are just signed messages, stored on IPFS   Signatures are easily verifiable online it uses the “eth_sign” format   We don’t have any token   It’s free to create a space it takes 5min   Spaces can have their custom domain name   Spaces can have their own skin   Fully open source with MIT license   We don’t use any tracking or ads in our site   EDIT: I am not sure if there is a system that prevents users to:  vote with some account A. move their DAI to account B. vote again using account B. iterate.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.829545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "1",
                    "time": "09/11/2020-16:05:43",
                    "content": "    iammeeoh:  EDIT: I am not sure if there is a system that prevents users to:  vote with some account A. move their DAI to account B. vote again using account B. iterate.    It takes a measurement of voting power at a particular block, so it shouldn’t be possible to vote twice with the same tokens. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.895833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "08/02/2021-22:05:46",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}