{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/pensamientos-sobre-la-estrategia-de-liquidez-multicadena-de-dai-traduccion/16415",
            "title": "Pensamientos sobre la Estrategia de Liquidez Multicadena de DAI [Traducci\\xc3\\xb3n] ",
            "index": 16415,
            "category": [
                "Latin America"
            ],
            "tags": [
                "liquidity-mining",
                "liquidity",
                "espa\\xc3\\xb1ol",
                "translate",
                "l2",
                "multichain"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#1",
                    "likes": "8",
                    "time": "07/07/2022-14:02:13",
                    "content": "Hola a todos, He estado repartiendo pequeñas cantidades de dólares entre varias cadenas alternativas / L2s durante el pasado año, y mientras creo que Ethereum seguirá siendo el rey, estoy igualmente convencido de que una cantidad creciente de actividad económica (particularmente entre los usuarios regulares) tendrá lugar en estos dominios externos. Escribí esto para compartir lo que estoy pensando acerca de los problemas y oportunidades que esto trae para MakerDAO y la adopción de DAI. Me gustaría reconocer el trabajo previo hecho por miembros y contribuidores de la comunidad para apoyar la liquidez multicadena, particularmente la Core Unit de Crecimiento (quien recientemente ha presentado una solicitud requerida para ser considerado para el sistema de incentivos para Propuestas Off-chain en Optimism) y aquellos involucrados en integraciones L2 próximas (PE y muchas otras).  Resúmen DAI tiene actualmente una gran liquidez en Ethereum L1, con amplias integraciones a las exchanges centralizadas, así como importantes fuentes de liquidez on chain. La liquidez se compone de ambos activos dirigidos por el protocolo (PSMs, D3M, Gelato Uniswap v3 vaults, etc) así como los activos suministrados por el usuario (Curve, mercados de prestamos, pares DEX volatiles, etc). La liquidez en dominios externos, incluyendo los L2s de Ethereum, cadenas EVM alternativas, y cadenas no EVM, es significativamente menor. Mientras que DAI ha logrado alcanzar una liquidez decente en muchas cadenas externas de EVM, a menudo va por detrás de USDC y USDT por un margen significativo. Y hay un número creciente de dominios externos importantes en los que DAI lucha por alcanzar incluso la liquidez mínima viable necesaria para permitir un uso regular. MakerDAO y miembros independientes de la comunidad podrían tomar un enfoque más proactivo para apoyar la liquidez en todos los dominios externos. Este hilo abarca consideraciones estratégicas e ideas de actuación a corto plazo para subsanar las deficiencias.  Motivación Recientemente, Maker ha estado luchando para desplegar productivamente nuestro balance debido a la relativamente débil demanda de préstamos de criptomonedas y a las pocas alternativas inmediatamente disponibles (ej. RWAs escalables, D3Ms, etc). Pero a largo plazo, es probable que el crecimiento de Maker se vea limitado en la dirección opuesta, con la disposición de los usuarios a mantener y realizar transacciones en DAI como nuestro factor limitante fundamental. El aumento de la liquidez del DAI en todos los dominios aportará los siguientes beneficios significativos a MakerDAO: DAI “rendimiento conveniente”: Si DAI tiene una mayor utilidad en el trading, bridging y comercio a través de dominios externos, los usuarios estarán dispuestos a mantenerla con un rendimiento base relativamente menor, lo que ayuda a apoyar el margen de interés neto de Maker. Crecimiento de la base de activos: Un mayor uso del DAI en dominios externos conducirá a un aumento de la cantidad de DAI en circulación, lo que permite a Maker una mayor flexibilidad para ampliar el uso de la vault y aumentar los ingresos. Exposición y adquisición de usuarios: Con Ethereum L1 que sigue enfrentándose a costes elevados, una parte cada vez mayor del crecimiento de los usuarios de DAI (distinto del volumen o del valor en USD) provendrá de dominios de menor coste, lo que supone una oportunidad para ampliar la base de usuarios reales y la actividad económica de DAI. En una base dólar por dólar, los usuarios más pequeños proporcionan más valor a largo plazo y adherencia frente a las grandes ballenas, ya que se requieren costes de cambio y coordinación relativamente mayores para sustituir DAI por una stablecoin alternativa. Conseguir integraciones fijas: Las integraciones clave pueden ayudar a apoyar el uso de DAI y los efectos de la red de forma sostenible, pero aumentando las oportunidades de uso orgánico y no incentivado. Ejemplos de integraciones de DAI de alto valor incluyen el uso como opción de pago en las plataformas de NFT o de subvenciones, o la integración en los mercados de préstamos agrupados. Estos protocolos integradores sólo añadirán soporte para DAI si esperan un uso significativo, lo que depende de que el dominio en cuestión tenga suficiente liquidez de DAI para que la gente lo utilice de forma eficiente.  Mecanismos de Soporte Actualmente, Maker apoya principalmente la liquidez en Ethereum L1 mediante el despliegue de activos de balance. Los PSM y las vaults de Gelato Uniswap v3 son ejemplos de ello: ambos mecanismos sirven para aumentar la liquidez de la DAI y garantizar una relación estrecha. Esto funciona especialmente bien en la posición actual de Maker, donde hay un exceso de demanda orgánica para holdear DAI vs mintear DAI de las vaults. Esto permite desplegar activos en estrategias de liquidez con poco coste directo. Los proyectos también pueden apoyar la liquidez ofreciendo incentivos en tokens a los usuarios. Mientras que los emisores con un déficit de demanda orgánica de stablecoins suelen favorecer esta opción (los incentivos ayudan a aumentar la demanda para equilibrar la oferta), también puede tener sentido para Maker en determinadas circunstancias limitadas. Por ejemplo, Maker se enfrenta a mayores riesgos de centralización y custodia para desplegar activos en dominios externos que no son L2 de Ethereum; esto se debe a la incapacidad de controlar estos activos de forma fiable a través de la gobernanza, siendo probable que se requieran multisigs para varias funciones. Esto significa que para algunos dominios externos puede tener más sentido que Maker logre los niveles de liquidez requeridos a través de incentivos específicos y asociaciones con protocolos de terceros, en lugar de desplegar activos de balance. Para generalizar:  En Ethereum L1, Maker debería centrarse en apoyar la liquidez mediante el despliegue de activos (ej. PSMs, D3Ms, vaults de tokens LP) ya que esto tiene el menor coste posible y puede incluso proporcionar oportunidades para obtener ingresos en activos que de otro modo estarían inactivos En las L2 esenciales de Ethereum en las que está previsto el despliegue de MCD, Maker puede en el futuro desplegar activos para acumular liquidez, pero puede tener sentido ofrecer incentivos limitados para apoyar la liquidez antes de que MCD esté disponible o para arrancar usos específicos (por ejemplo, los mercados DAI de Aave) que requieren un uso externo significativo antes de que Maker pueda aportar activos de forma segura En los L2 no esenciales y los L1 alternativos (en los que no está previsto desplegar el MCD de forma inminente), las necesidades de liquidez podrían satisfacerse con incentivos de arranque específicos y asociaciones con los dominios y/o las plataformas DeFi.   KPIs de Liquidez El desarrollo de indicadores clave de rendimiento (KPI) para evaluar la liquidez ayudará a Maker a respaldar la utilidad e integración de DAI en dominios externos. A continuación se describe un conjunto de KPI iniciales sugeridos. Volatilidad Histórica Esto indica lo ajustado que DAI mantiene el precio objetivo de 1 dólar. Una mayor volatilidad aumenta el riesgo para los usuarios de stablecoin, que pueden verse obligados a comprar por encima o vender por debajo de lo previsto.Los métodos de medición más importantes incluyen la volatilidad media diaria, la variación máxima con respecto al precio objetivo y el sesgo (diferencias entre la variación al alza y a la baja con respecto a la paridad). Mientras que esto no mide directamente la liquidez, en general las stablecoins más líquidas deberían mostrar una menor volatilidad a lo largo del tiempo (a través de una combinación de mayor eficiencia de arbitraje y menor impacto en el mercado para las operaciones). Variación teórica Este cálculo proporciona límites superiores e inferiores aproximados para el precio del DAI en un dominio externo, basándose en suposiciones sobre la eficiencia del arbitraje. Las transacciones de arbitraje a través de Ethereum L1 pueden implicar comisiones de bridge fijas o variables (tanto de entrada como de salida), así como costes de gas y comisiones de intercambio. Podemos utilizar estos factores para estimar los ingresos mínimos necesarios para que los arbitrajistas alcancen el punto de equilibrio y, a continuación, utilizar el valor de los ingresos para determinar la variación máxima de la paridad basada en la liquidez del dominio externo. Alternativamente, podemos establecer un objetivo de variación máxima y utilizarlo para calcular la liquidez mínima requerida para apoyar un arbitraje eficiente. Ejemplo de medición: Costes de arbitraje = comisión de salida del puente/gas + comisión de entrada del puente/gas + comisión de intercambio de la red principal/gas + comisión de intercambio de dominios externos/gas (estimación aproximada = 50-200 dólares) Beneficio esperado del guardián + costes de arbitraje = liquidez AMM hasta la paridad * prima media (descuento) El potencial de beneficios por arbitraje al mover los AMM de dominio externo de vuelta a la paridad depende de la curva específica de AMM utilizada ( ej. x*y=k para LPs volátiles,invariante Curve para LPs estables, etc.) así como de la profundidad de la liquidez. En el caso de los AMM xyk, como Uniswap v2, desplazar un precio un 1% fuera del mercado hasta el punto de referencia supondría un impacto en el mercado de aproximadamente el 0,5% (0,35% teniendo en cuenta las comisiones de los swaps), y equivaldría a un tamaño de operación del 0,25% del total del TVL del pool. Suponiendo que los costes de arbitraje y los beneficios de los holders asciendan a 200 dólares, se requerirían 23 millones de dólares de TVL del pool para mantener los límites de la desviación del 1% de la paridad mediante un arbitraje sin riesgo. (Obsérvese que los traders podrían arbitrar de forma mucho más eficiente que esto manteniendo el inventario en el dominio externo, por lo que se trata de una sobreestimación conservadora del TVL requerido. Pero la voluntad de los traders de asignar capital o atención depende del uso esperado / la oportunidad de obtener beneficios de arbitraje). Los cálculos son algo más complicados en el caso de las pools de stableswap debido a la amplificación / liquidez concentrada. En general, un menor deslizamiento requeriría una mayor TVL, mientras que los parámetros A más altos permitirían una TVL relativamente menor. Estimación aproximada: un pool con un parámetro A de 250 requeriría alrededor de 200-300.000 dólares en TVL para soportar una volatilidad máxima teórica del 1%, asumiendo los mismos costes de arbitraje de 200 dólares mencionados anteriormente. Impacto Relativo en el Mercado Se trata de una medida de la liquidez global del DAI en un dominio externo. En primer lugar, se calcula el deslizamiento en varios tamaños de comercio entre las principales stablecoins y el token nativo / token de gas de un dominio. Restando el desfase de la stablecoin con mejor rendimiento del desfase de DAI se obtiene el impacto relativo en el mercado. Esto debería medir la liquidez de DAI de una manera más uniforme a través de dominios con diferentes niveles de liquidez de tokens nativos, y también incorpora la liquidez disponible de stableswap. Esto diferencia entre el impacto de mercado atribuible a la falta de liquidez de DAI y la falta de liquidez general de los tokens nativos. Ejemplo de medición: Esto podría determinarse midiendo el impacto del mercado cotizado por el agregador en varios tamaños de operaciones a través de los principales pares de stablecoin - token nativo. Por ejemplo, en Arbitrum, podríamos utilizar 1 pulgada para medir el impacto del mercado en los pares DAI/ETH, USDC/ETH, USDT/ETH y MIM/ETH. El impacto de mercado relativo es equivalente al impacto de mercado de DAI/ETH menos el impacto de mercado del par de stablecoin más bajo. En los casos en los que DAI no se encuentre entre las principales stablecoins de un dominio, es probable que esto dependa principalmente de la liquidez del intercambio de stablecoins (las operaciones pasarían por DAI → otra stablecoin → token nativo).  Evaluación del dominio Los dominios varían mucho en cuanto a su proximidad a Ethereum L1 (que incorpora la custodia y los riesgos técnicos del bridging), el panorama de la integración y el potencial de crecimiento a largo plazo. Entender las características clave del dominio ayudará a Maker a priorizar y adaptar las estrategias de liquidez para maximizar el impacto mientras se minimizan los costes y los riesgos. Próximidad Ethereum L1 es la base de Maker, con un fuerte apoyo de liquidez a través de los intercambios centralizados y las plataformas DeFi. Los actores en L1 tienen acceso atómico a las principales fuentes de liquidez de DAI, y DAI está estrechamente vinculado a 1$USD a través de los PSM de Maker. Los Rollups y las plataformas L2 están relativamente cerca, con un plan a largo plazo para confiar plenamente en la seguridad de Ethereum y eliminar los elementos de bridging o custodia de confianza. En su estado actual, todas las plataformas L2 tienen cierto grado de centralización y riesgos técnicos, pero se espera que éstos disminuyan con el tiempo. Las L2 con seguridad compartida de Ethereum probablemente representarán un riesgo lo suficientemente bajo como para permitir a Maker desplegar activos ( ej. a través de minting nativa de DAI de L2, PSMs, vaults de pool de liquidez, etc). Las sidechains y las L1 alternativas tienen una menor “proximidad” debido a los riesgos de puente entre plataformas, así como al riesgo de mal comportamiento de los validadores. El despliegue de activos en estos dominios generalmente representa un peor rendimiento ajustado al riesgo que en Ethereum o L2s debido a estos problemas irreductibles entre cadenas. Para estos dominios relativamente más distantes, el apoyo a la liquidez podría centrarse en los incentivos a los usuarios (en los que los usuarios soportan el riesgo de fracaso de los puentes, pero no se enfrentan al riesgo de gobernanza de la cadena cruzada) y en las asociaciones, en lugar de en el despliegue directo de activos. Panorama de Integración Los dominios tienen distintos niveles de penetración de DeFi y de disponibilidad de las primitivas básicas (exchanges, préstamos, derivados, etc). Como mínimo, Maker necesita que los exchanges de AMM estén disponibles para empezar a ofrecer apoyo de liquidez. Las primitivas adicionales, como los AMM de stableswap y los pools de préstamos, ofrecen un valor adicional significativo. La apertura de los protocolos a las asociaciones de recompensa conjunta también es un factor positivo. En general, la liquidez de stableswap es la más eficiente, pero una liquidez significativa de xyk ofrece importantes beneficios de seguridad que pueden ser requeridos para la integración con los mercados de préstamos. Potencial de Crecimiento Esto puede ser difícil de medir objetivamente, ya que depende de múltiples factores que contribuyen, como la viabilidad técnica, el apoyo de los inversores institucionales, el marketing, la tracción de los usuarios existentes y la alineación filosófica. Los dominios con propuestas de valor únicas tienen una mayor probabilidad de éxito y relevancia a largo plazo frente a los clones de EVM sin relevancia. Con la atención y la liquidez siguiendo una especie de distribución de leyes de potencia, los líderes del mercado también tienen una ventaja significativa sobre los rezagados.  Liquidez Mínima Viable y Liquidez Superior Liquidez Mínima Viable A gran escala, la liquidez mínima viable (MVL) es la menor cantidad de liquidez requerida para que DAI sea una stablecoin utilizable en un dominio determinado. Si no se consigue, se garantiza que la demanda de stablecoins en el dominio en cuestión será satisfecha por otros emisores (lo que limita la adopción de DAI y la base de activos de Maker, mientras que implícitamente aumenta el coste de equilibrio del capital). Una vez que se alcanza el MVL, la actividad orgánica de los usuarios puede empezar a apoyar un ciclo virtuoso de financiación de la liquidez sostenible ( ej. los usuarios que pagan comisiones de negociación a los LPs para intercambiar entre DAI y otros activos) y el aumento de las integraciones pegajosas (como las plataformas NFT, o los mercados de préstamos agrupados que requieren suficiente liquidez como condición para cotizar). El MVL puede definirse como la cantidad de liquidez necesaria para soportar unos costes de negociación aceptables con un tamaño determinado. Para calcularlo debemos determinar:  ¿Qué nivel de costes de transacción es aceptable? (puede medirse como porcentaje del valor de la transacción) Más allá del impacto del mercado, ¿qué otros factores influyen en los costes totales de negociación? (normalmente, esto incluiría las comisiones de gas de dominio y las comisiones de intercambio, así como el coste implícito de la volatilidad de la stablecoin frente a la paridad) ¿A qué tamaño de operación debe destinarse el apoyo? (por lo general, un tamaño mayor requiere una mayor cantidad de liquidez para el apoyo) ¿Qué estilo de LP se utiliza? (stableswap “curve” vs xyk \"uni v2 vs concentrated liquidity “uni v3”)  A continuación se presenta un ejemplo de norma de liquidez mínima viable para los dominios externos.  Los usuarios deberían poder intercambiar entre 1.000 DAI y el token nativo del dominio (gas) con menos de un 1% de costes totales, incluidas las comisiones del gas, las comisiones de intercambio, el impacto relativo en el mercado y la variación del precio medio frente a la paridad.   DAI debería tener menos del 0,5% de volatilidad media diaria y menos del 0,3% de variación promedio frente al valor de 1 dólar.   DAI debería tener una volatilidad teóricamente limitada entre ∓2% de la paridad por las oportunidades de arbitraje contra las fuentes de liquidez de Ethereum L1.  Esto garantizaría que DAI es ampliamente utilizable para las transacciones minoristas de valor pequeño a moderado, y la convertiría en una opción aceptable de activo de precio estable dentro de los portafolios de los usuarios. Dependiendo de los costes del gas de dominio, de los tipos de AMM disponibles y de los mecanismos de bridging, este nivel de servicio podría alcanzarse probablemente con una liquidez total de entre 100.000 y 500.000 dólares. El concepto de “liquidez armónica” descrito por IndexCoop ofrece una forma útil de pensar en la orientación óptima de la liquidez. Tras definir un objetivo de coste total de transacción, podemos determinar en qué tamaño de transacción deberíamos centrarnos para los L2 y los L1 alternativos frente a los usuarios que son más propensos a realizar transacciones en Ethereum (y podrían soportar más fácilmente el coste de pasar de DAI a un dominio externo).  Fuente: IndexCoop Forum Liquidez Superior Para lograr una liquidez superior, DAI debería ser la stablecoin más líquida disponible en un dominio determinado, o ser capaz de realizar operaciones de alto valor con costes de ejecución casi equivalentes a los de las stablecoins alternativas. Un ejemplo de estándares de liquidez de primer nivel podría ser:  Los usuarios deberían poder intercambiar entre 100.000 DAI y el token nativo del dominio (gas) con menos del 1% de costes totales, incluidas las comisiones del gas, las comisiones de intercambio, el impacto relativo en el mercado y la variación media del precio frente a la paridad.   DAI debería tener menos del 0,3% de volatilidad media diaria, y menos del 0,2% de variación media frente al valor de $1 USD.   El DAI debería tener una volatilidad teóricamente limitada entre el ∓1% de la paridad por las oportunidades de arbitraje contra las fuentes de liquidez de Ethereum L1.  Proporcionar este nivel de servicio requeriría una cantidad mucho mayor de liquidez, probablemente entre $500,000 y $10,000,000 en TVL dependiendo de la disponibilidad de los intercambios de stablecoins y la liquidez de las stablecoins de la competencia.  Priorización Probablemente, Maker no pueda conseguir un apoyo de liquidez superior en todos los dominios externos principales a la vez (al menos a corto y medio plazo). Así que necesitamos un marco para priorizar entre los dominios y determinar dónde buscar apoyo de liquidez superior, dónde apoyar la liquidez mínima viable es suficiente, y dónde el apoyo de liquidez directa no vale la pena. Podría decirse que Arbitrum y Optimism presentan la mayor oportunidad de integración a corto plazo. Los lanzamientos de tokens nativos de estas plataformas deberían ayudar a impulsar la adopción del ecosistema. Si DAI puede mantener su posición como una de las principales stablecoins, Maker tendrá mayores oportunidades de desplegar activos para obtener rendimiento a través de vaults nativos de L2, estrategias de liquidez o D3Ms. Estos dominios tienen un rico panorama de integración (muchas aplicaciones de Ethereum se establecerán en L2), potencial de crecimiento (se espera que la mayor parte de la actividad minorista en Ethereum migre a L2), y una gran proximidad (en su estado final, L2 debería tener el menor riesgo posible de bridging y validador con respecto a Ethereum L1). La siguiente prioridad más alta podría darse a las principales plataformas L1 alternativas que aún no han alcanzado una liquidez mínima viable de DAI. Entre los ejemplos de esta categoría se encuentran las cadenas del ecosistema Cosmos, Solana, ciertas cadenas EVM, así como las L2 de Ethereum menos adoptadas, como Boba Network. Mientras que estas plataformas no presentan una oportunidad inmediata para desplegar el balance, el aumento de la usabilidad de DAI en todos los dominios seguirá mejorando la adquisición de usuarios y aumentando la base de activos disponibles de Maker. Más allá de estos dominios principales, Maker podría apoyar la liquidez en L2 emergentes como zkSync y Starkware a medida que se vayan completando. Y Maker también puede buscar asociaciones de incentivos para ayudar a mejorar la usabilidad y alcanzar o mantener la posición de DAI como una stablecoin principal en dominios de alto impacto que ya han alcanzado una liquidez decente (ejemplos aquí incluyen Avalanche, Polygon, etc.) Puede que no merezca la pena considerar la integración o el apoyo a la liquidez de ciertas plataformas con importantes vientos en contra y un potencial limitado. Si es necesario, podría desarrollarse un marco formal de priorización para garantizar que cualquier acción esté debidamente alineada con los objetivos y la estrategia de la DAO.  Ideas para la Acción A continuación se presentan algunas ideas sobre cómo Maker podría mejorar la liquidez multichain de DAI y los efectos de la red. Incentivos de Liquidez Por lo general, Maker evita los planes de incentivos abiertos para los LPs o los holders de DAI, ya que existe el riesgo de que se conviertan en un pozo de dinero y, a corto plazo, una mayor oferta de DAI no ayuda a aumentar los ingresos. Sin embargo, podría tener sentido buscar incentivos de alcance limitado para impulsar la liquidez de DAI en dominios externos y llegar al punto en que los mercados de DAI se vuelvan autosostenibles a través del uso orgánico. Los planes de incentivos deberían incluir objetivos y KPI explícitos, así como estimaciones del valor potencial a largo plazo comparando los gastos previstos con los ingresos marginales esperados de una mayor oferta de DAI. Por ejemplo, la liquidez de stablecoin en la DEX Crescent del ecosistema Cosmos es muy baja en este momento. Si Maker ofreciera, por ejemplo, 100.000 DAI para ser distribuidos a los LPs de DAI/bCRE (token nativo) a lo largo de 3 meses, esto podría catapultar a DAI al primer lugar entre los emparejamientos de liquidez de stablecoin (aproximadamente 400.000 $ TVL a un rendimiento esperado del 100% APR). Esto podría desencadenar efectos positivos de segundo orden en los que los usuarios favorezcan a DAI como su activo estable, y la tasa de comercio orgánico APY puede apoyar la profundidad de liquidez necesaria a largo plazo.  Fuente: Crescent DEX Alianzas De la mano de los incentivos autofinanciados, Maker puede asociarse con protocolos externos para apoyar la liquidez de DAI y la integración dentro de su aplicación. Por ejemplo, Osmosis DEX está ofreciendo incentivos de casi el 100% de la APR en el pool DAI-OSMO para ayudar a apoyar la liquidez general de la plataforma y la usabilidad. Mientras que Osmosis estaba dispuesto a apoyar a DAI sin ninguna reciprocidad preacordada, muchos otros protocolos parecen estar usando por defecto sólo USDC, USDT o FRAX. Mostrar la voluntad de arrancar las integraciones iniciales de DAI con incentivos a corto plazo podría ayudarnos a crear alianzas con protocolos DeFi externos, que luego asumirán el coste (probablemente mucho mayor) de los incentivos a largo plazo para mantener la usabilidad. La mejora de las alianzas y de las integraciones podría convertir los incentivos a corto plazo en una forma muy eficaz de apoyar la adopción de DAI en todas las cadenas (por ejemplo, 100.000 dólares en incentivos proporcionados por Maker podrían dar lugar a 1 millón de dólares o más en incentivos de terceros a largo plazo). Visibilidad de la Comunidad Los miembros independientes de la comunidad y/o las ballenas MKR podrían desempeñar un papel importante en la mejora de la liquidez de DAI en dominios externos. Debido a que estos usuarios pueden mantener su esquema de custodia existente (por ejemplo, utilizando una billetera de hardware o estableciendo un multisig), no se enfrentan a los mismos riesgos de gobernanza y custodia que el propio MakerDAO al desplegar activos a través de la cadena. Compartir estas oportunidades de una manera más accesible (sin hacer recomendaciones, ya que los individuos deben evaluar el riesgo de cada protocolo de forma independiente) podría ayudar a aumentar la adopción de DAI sin costes directos para la DAO.  Fuente: Frax  Fuente: QiDAO Frax y QiDAO hacen un buen trabajo a la hora de mostrar lugares para utilizar sus activos en plataformas externas. Además de ayudar a los usuarios a encontrar oportunidades para desplegar sus activos, también aumenta el valor ofrecido a los protocolos subyacentes como socio (ayudando a estos protocolos de terceros con el descubrimiento y la adquisición de usuarios).  Conclusiones Maker tiene una oportunidad única para superar a otras stablecoins y lograr amplios efectos de red a medida que el espacio de las criptomonedas crece en dominios externos. En comparación con los emisores centralizados de stablecoins, Maker tiene una mayor flexibilidad para utilizar los activos del protocolo, los ingresos y las reservas para impulsar proactivamente el uso. Dicho esto, actualmente nos estamos quedando atrás en muchos dominios externos en comparación con los competidores. USDC está emergiendo como la stablecoin número 1 de facto con crecientes efectos de red, e incluso stablecoins de riesgo relativamente más alto como FRAX tienen integraciones de cadena cruzada mucho más amplias que DAI. Creo que esta es un área en la que las inversiones limitadas y específicas del enfoque de los contribuyentes y los recursos financieros pueden traer beneficios significativos a largo plazo para el protocolo. E igualmente importante, una estrategia proactiva para la liquidez en dominios externos mostrará a los protocolos de terceros (que son clave para mantener la liquidez de DAI) que Maker es un socio fuerte que aporta algo a la mesa.  Esta es una traducción libre del topic Thoughts on Multichain DAI Liquidity Strategy de @monet-supply Créditos: Traducción @Brigith238 - Revisión @nahueth ",
                    "links": [
                        "https://gov.indexcoop.com/t/liquidity-pod-our-product-liquidity-vision-harmonic-liquidity/3734",
                        "https://app.crescent.network/farm",
                        "https://app.frax.finance/staking/overview",
                        "https://app.mai.finance/farm",
                        "https://forum.makerdao.com/t/thoughts-on-multichain-dai-liquidity-strategy/16071"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.7265625
                }
            ]
        }
    ]
}