{
    "poll_list": [
        {
            "title": "Should we replace the weekly DSR Rate governance poll with a weekly DSR Spread governance poll?",
            "index": "969",
            "option": "Yes",
            "supporting_mkr": "3,729",
            "highest_fraction": 0.99
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-should-we-replace-the-weekly-dsr-governance-poll-with-a-dsr-spread-governance-poll/969",
            "title": "Signal Request: Should we replace the weekly DSR governance poll with a DSR Spread governance poll? ",
            "index": 969,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "rates",
                "dsr",
                "dsr-spread"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "4",
                    "time": "17/12/2019-15:50:31",
                    "content": "Background The idea is to replace the current DSR Rate governance poll with a new poll that asks for the DSR Spread instead. The DSR Spread governance poll gives us the DSR Rate by taking the weekly MCD Global SF Rate and subtracting the DSR Spread. MCD Global SF Rate - DSR Spread = DSR Some examples: MCD SF voted as 4% DSR Spread voted as 1% DSR will be 3% MCD SF voted as 10% DSR Spread voted as 3% DSR will be 7% See this thread for a full discussion: Request for Adjustment to DSR Phrasing I will summarize the pros/cons below: The Negatives of Switching to a DSR Spread  Increased Cognitive Complexity  If you want to think in terms of absolute rates then it makes sense to keep things the way they are.   Adding Low Volatility Assets  If we end up something like SAI as a collateral type, then we will likely not be able to impose the global stability fee on those assets. Example) Borrowing DAI from SAI makes no sense on any rate other than 0%. Note: This could be countered by setting a negative vault fee that follows the exact negative of the global SF.  EDIT apparently we can’t do this according to the dev team.    The Positives of Switching to a DSR Spread  Reduction of Weekly Votes  By switching to a DSR Spread vote we will only need to vote on the MCD Global SF Rate every week to affect peg stability (+ SAI SF Rate before migration ends). This is because the DSR and Global SF Rate perform analogous actions in terms of peg stability. One increases DAI demand whilst the other decreases DAI supply. DSR Spread will likely only need to be voted on every few months as it does not affect peg stability.   Simplification of What Each Vote Means  Currently raising the DSR and the Global SF do the same thing for peg stability. It is not clear what the community thinks when these numbers are both changing week to week. Is the peg off of $1? Do we want to incentivize more users with a higher DSR? Answering these questions is currently not clear. By switching to DSR Spread we use the Global SF to manage peg stability and the DSR Spread to manage system growth speed vs profit taking to MKR holders.   Remove the Possibility of a DSR mistakenly being higher than the Global SF.  So even though it’s not entirely clear whether this situation is desirable or not, there are some weird incentives that come up when we run the DSR > Global SF. As vault creators can earn an interest rate with their collateral from this scenario. This would be similar to running the SCD SF rate at a negative value. By making the DSR Spread >= 0% as a limit (same as we do with the rates), we can remove this from accidentally getting added to the executive.    Proposed New Poll Option The poll would use the exact same rate stepping as the current DSR poll except it will be used to determine the DSR Spread instead of the DSR with an optional lower bound of 0%. The DSR will be calculated as: DSR = max(Global SF - DSR Spread, 0) (the max() prevents the case where the DSR is negative) Note: This wasn’t explicitly stated when I originally wrote this post, but currently the MCD Global SF is 0% during migration and we are emulating it via the ETH-A, BAT-A vault fees. It is my assumption that we will begin using the Global SF instead of the vault fees once migration is over, but perhaps that wasn’t clear to everyone. This is not a mission critical change for migration, so I think we can wait until migration is done to proceed with the vote.     Yes, switch DSR voting format to a DSR Spread with a lower bound of 0% Yes, switch DSR voting format to a DSR Spread without a lower bound of 0% No, keep the current DSR absolute rate vote Abstain (I want to see results) Abstain (I have no opinion) Abstain (I don’t feel I am knowledgable on the subject) Abstain (I disagree with the poll options) Abstain (I have a different objection)     0 voters     This is a multiple choice poll, vote for  everything  you are willing to vote for in an on-chain vote. Poll results will be reviewed on  January 7th, 2020  ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-january-9-9am-pst-5-00-pm-utc/1084/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-january-9-9am-pst-5-00-pm-utc/1084/4",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-january-23-9am-pst-5-00-pm-utc/1165/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-december-19-9am-pst-5-00-pm-utc/981/3",
                        "https://forum.makerdao.com/t/a-governance-model-for-maker/1056",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-january-16-9am-pst-5-00-pm-utc/1126/2",
                        "https://forum.makerdao.com/t/weekly-maker-recap-pilot/1137/4"
                    ],
                    "GPT-summary": "The author proposes to replace the current DSR Rate governance poll with a new poll that asks for the DSR Spread instead. The post explains the pros and cons of switching to a DSR Spread vote and proposes a new poll option. The post also invites feedback and criticism from the community and sets a date for reviewing the poll results.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Smart contract updates",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.118844696969696
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "4",
                    "time": "17/12/2019-18:26:14",
                    "content": "I voted for no lower bound, but I think the choices for negative rates should be clearly marked in bold like !NEGATIVE RATE! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.802083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#3",
                    "likes": "4",
                    "time": "18/12/2019-02:08:50",
                    "content": "Completely agree that this is the way to go. There needs to be more emphasis on the DSR as a relative spread parameter modulating growth/profit, rather than an absolute parameter used for stability. Leaving the DSR poll as an absolute, in combination with the SF poll, makes for awkward voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#4",
                    "likes": "3",
                    "time": "18/12/2019-21:32:35",
                    "content": "This makes sense now while BAT and ETH are tied to a uniform rate, but what happens when that is no longer the case? Do you think that as we come to vote on a larger number of SFs that are no longer uniform, voting on DSR through this kind of framework would becomes overly complex? What would it look like? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#5",
                    "likes": "2",
                    "time": "18/12/2019-21:34:48",
                    "content": "After migration we should not be using vault fees for stability, and instead we should be using the global stability fee. We should use vault fees to capture risk premiums. EDIT: To elaborate a bit. This is related to the negative point about “Adding Low Volatility Assets”. If we end up adding a SAI-like collateral type such as US Treasury Bonds or something we run into issues where the overall stability fee may price that collateral type out. As an example: Why would you borrow against SAI at any rate other than 0%? I’m personally still thinking on this point, but I don’t think it is a problem for now as it is still hypothetical. EDIT 2 I think I am starting to understand the objections. It is my view that for DAI peg stability we should not care what the total fees are for individual collateral/vault types. There are only two things we should care about for peg stability: dai demand (DSR) and overall collateral pool supply (global sf). If you treat all collateral types as a homogeneous pool which backs supply then by raising and lowering the global sf you raise and lower that supply without caring which collateral types go up and down the most. Right now we have ETH fee = BAT fee = 4% and SAI = 0% but once we get SAI out it should look like global sf = 4%, ETH fee = ETH risk premium and total ETH SF = Global SF + Vault risk premium. You can think of it like a central bank interest rate to encourage/discourage economic growth. They set it across the board instead of setting it for every asset. Does this clear things up? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.201031746031745
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "1",
                    "time": "19/12/2019-11:31:25",
                    "content": "I think it makes sense to set this spread based on the Global SF value. But it’s worth mentioning that for the time being the global SF value is 0% (due to the need to keep Sai at 0%) This creates the slightly strange outcome that the voting system will change and the voted DSR option will need to change from 4% to -4% in order to keep the current status quo. DSR Rate = max(Global SF - DSR Spread, 0) 4% = max( 0% - -4%, 0) Perhaps we should vote to delay putting this into operation until after the migration has ended? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#7",
                    "likes": "2",
                    "time": "19/12/2019-12:40:15",
                    "content": "If we add USDC or TrueUSD or similar as collateral then the global SF is never going to deviate much from zero, ever. Perhaps the weighted average SF is a better reference point when thinking about the DSR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "1",
                    "time": "19/12/2019-12:43:37",
                    "content": "Yeah, this occurred to me too. I wonder whether it is possible to ‘fix’ that problem by having negative vault fee values for those collateral types? So fee for USDC could be: Global Fee (4%) + Vault Fee (-3%) = Stability Fee (1%) ? DSR would be 4% (with a 0% spread.) As crazy as this sounds, it actually makes some sense because in this situation MKR holders would effectively be subsidising USDC (at 100% DSR utilisation). Having a negative vault fee makes that super obvious. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.851851851851851
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#9",
                    "likes": "2",
                    "time": "19/12/2019-15:30:05",
                    "content": "    LongForWisdom:  Perhaps we should vote to delay putting this into operation until after the migration has ended?   I’m okay with waiting. It’s not a migration critical piece, and we are jam packed with migration-specific stuff right now.     psychonaut:  If we add USDC or TrueUSD or similar as collateral then the global SF is never going to deviate much from zero, ever. Perhaps the weighted average SF is a better reference point when thinking about the DSR.   I’ve given this some more thought, and come up with four points:   Is low volatility collateral (TrueUSD, USDC, etc) even something we want in the collateral pool? What is the user base for this collateral type? I’m not convinced there is one for USD-analogues. There is perhaps one for something like US Treasury Bonds which is very stable, but not pegged to $1 USD. How big is the demand for something like that though?   If we do want to add a low volatility collateral type we are going to have to make a choice of whether we want to subsidize the collateral or if we are okay with pricing it out when the global sf is increasing. Why would we want to subsidize more borrowing behaviour during a bull market (when SF is increasing)?     For example if we are in the depths of a bear market and the global sf is 0.5%. It may make sense to suddenly enable borrowing against some relatively stable, non-correlated asset such as US Treasury Bonds which only makes sense to borrow against at these rates. Once we start reaching another bull market and the global sf starts increasing again we want to discourage those borrowers. That’s the point of the stability fee raise. Maybe we don’t want any low volatility assets being borrowed at that point.   If you look at the overall goal of encouraging/discouraging borrowing in aggregate for peg stability, it may end up being okay if we price out these low volatility assets during bull market behaviour.     As LFW said, we can always make these the exception to the rule and subsidize them via the DSR by running a negative vault fee. EDIT apparently we can’t do this according to the dev team.   This low volatility collateral argument has pros/cons to both absolute DSR and relative DSR spread. I believe it is a discussion worth having, but I believe it is a separate issue to this vote. If for whatever reason low volatility assets start becoming a big part of the collateral pool and it makes sense to switch back to an absolute DSR then we can always reverse this decision. For right here right now though I firmly believe the DSR Spread is a better voting parameter for the current pool allocation.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.524086378737541
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "19/12/2019-15:57:42",
                    "content": "    hexonaut:  Is low volatility collateral (TrueUSD, USDC, etc) even something we want in the collateral pool?   Rune wrote a bit about this here. Tl;dt is that market maker could make good use of it to arb the dai peg and increase stability.     hexonaut:  If we do want to add a low volatility collateral type we are going to have to make a choice of whether we want to subsidize the collateral or if we are okay with pricing it out when the global sf is increasing.   Yep.     hexonaut:  As LFW said, we can always make these the exception to the rule and subsidize them via the DSR by running a negative vault fee.   Actually I just asked about this in the dev channel on rocketchat. Unless I’m misunderstanding the smart-contract it isn’t possible.     hexonaut:  For right here right now though I firmly believe the DSR Spread is a better voting parameter for the current pool allocation.   I agree, but I’d also like to have a system that works consistently regardless of what is in the pool. I think I’m more on the fence about the change now than previously. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.735863095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#11",
                    "likes": "0",
                    "time": "19/12/2019-16:05:45",
                    "content": "    LongForWisdom:  Rune wrote a bit about this here. Tl;dt is that market maker could make good use of it to arb the dai peg and increase stability.   Will give this a read. Thanks.     LongForWisdom:  Actually I just asked about this in the dev channel on rocketchat. Unless I’m misunderstanding the smart-contract it isn’t possible.   Oh that’s good to know. I’ll update the post. Regarding the inability to subsidize low volatility (LV) assets during times of a high Global SF, I’m still wondering why we would want to be subsidizing borrowing during times of excessive borrowing. It makes more sense to be pricing these assets out to do the exact opposite. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.941666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#12",
                    "likes": "0",
                    "time": "19/12/2019-17:57:14",
                    "content": "    hexonaut:  Is low volatility collateral (TrueUSD, USDC, etc) even something we want in the collateral pool? What is the user base for this collateral type?   If you read Rune’s post, you’ll find that he suggests an extreme liquidation ratio like 100.5%. So it seems feasible to charge a 4% SF on stable assets like USDC or TrueUSD or Treasury bonds if we invite people to leverage 100:1.     psychonaut:  If we add USDC or TrueUSD or similar as collateral then the global SF is never going to deviate much from zero, ever. Perhaps the weighted average SF is a better reference point when thinking about the DSR.   I guess we need to think about asset volatility through the lens of the per asset liquidation ratio. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.765625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#13",
                    "likes": "1",
                    "time": "20/12/2019-13:30:37",
                    "content": "    psychonaut:  If you read Rune’s post, you’ll find that he suggests an extreme liquidation ratio like 100.5%. So it seems feasible to charge a 4% SF on stable assets like USDC or TrueUSD or Treasury bonds if we invite people to leverage 100:1.   On further thought, this can’t work either. The SF would be okay, but if we generate DAI with 100:1 leverage then the DSR would be forced toward zero.     hexonaut:  Is low volatility collateral (TrueUSD, USDC, etc) even something we want in the collateral pool?   I think the answer is “no” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.074999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#14",
                    "likes": "0",
                    "time": "21/12/2019-15:28:26",
                    "content": "    psychonaut:   If you read Rune’s post, you’ll find that he suggests an extreme liquidation ratio like 100.5%. So it seems feasible to charge a 4% SF on stable assets like USDC or TrueUSD or Treasury bonds if we invite people to leverage 100:1.  On further thought, this can’t work either. The SF would be okay, but if we generate DAI with 100:1 leverage then the DSR would be forced toward zero.   No wait, this can still work if we set a huge SF for stable collateral. Consider the following transaction flow:  Random wealthy woman Alice wants to transfer $1 million USD to DAI Market maker Bob opens a Vault using $10k TrueUSD and creates $1 million DAI (1:100 leverage). The $1 million DAI are sent to Alice (on chain) in exchange for $1 million USD (off chain). Maybe there is an escrow account inbetween. There is a 400% SF on the TrueUSD Vault, not because there is much risk of liquidation, but to cover the potential cost of a 4% DSR on 1 million DAI. (We probably don’t even need a price feed for DAI/TrueUSD. We can just assume it is 1.0 always with an emergency switch to liquidate all Vaults.) Bob is incentivized to close the Vault ASAP and places a 1 million DAI limit buy order on Oasis. As the order is filled, Bob pays down the debt on the Vault. Once the Vault is fully repaid then Bob’s $10k TrueUSD capital is free for the next trade.  It’s a risk transfer:  Alice transfers $1 million USD to 1 million DAI with pre-agreed slippage/fee paid to Bob. Bob needs to estimate how long it will take to buy 1 million DAI on Oasis and the corresponding SF liability.  There is probably a similar transaction sequence to go from DAI back to fiat USD, but I haven’t worked it out yet. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.408179012345679
                },
                {
                    "author_link": "https://forum.makerdao.com/u/compvioz",
                    "index": "#19",
                    "likes": "0",
                    "time": "28/12/2019-12:00:12",
                    "content": "I would prefer lower bounds > 0%, just to always ensure the “insurance fund” increases with time. Especially if MCD supply ever increases. Also instead of DSR = SF - DSR Spread, we should use DSR = SF * (1 - DSR Spread).  I think it’s more adaptive and fewer changes would be needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#20",
                    "likes": "2",
                    "time": "28/12/2019-17:31:01",
                    "content": "Great points. With insurance we can encode that into the vault fees as opposed to the global stability fee. This will keep us in break even territory at dsr spread = 0%. DSR Spread as a percentage of the Global SF is not something I thought of when putting up this poll, but I agree it actually may end up being more stable if we run the DSR at a fixed proportion to the Global SF instead of a delta. IE DSR should be 80% of the Global SF instead of 1% away for a global sf of 5%. DSR = Global SF * 80% vs DSR = Global SF - 1% ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.636363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#21",
                    "likes": "0",
                    "time": "30/12/2019-13:01:26",
                    "content": "Setting DSR as a percentage of Global SF creates issues as well. Consider: a large Vault whale wants to hedge her Risk Premium (with the planned expansions into more traditional asset classes this will be very common). She finds an insurer who is willing to bet the risk profile of her collateral won’t change. However this insurer wants nothing to do with the DSR. If the insurer takes on the Risk Premium risk they will then be forced to be betting on the DSR as well. Likely, this insurer will want nothing to do with the DSR as its value is a function of a wide variety of volatile factors (if you are unconvinced about the potential volatility in the DSR just consider the recent instability in the US Repo market and FEDs massive intervention) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.205102040816326
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#22",
                    "likes": "1",
                    "time": "30/12/2019-16:22:27",
                    "content": "Can you elaborate on your example? I’m not quite following.     Akiva:  If the insurer takes on the Risk Premium risk they will then be forced to be betting on the DSR as well.   What do you mean by Risk Premium? Are you referring to only the portion of the fees devoted to RP excluding the Stability Fee? If so, I’m confused about the mechanism of insuring only the RP as you need to pay all fees RP + SF to open a vault. Also, are you saying this is an overall problem with the DSR Spread or with treating the DSR as a percentage of the Global SF? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.74375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#23",
                    "likes": "0",
                    "time": "31/12/2019-11:11:43",
                    "content": "My understanding is that DSR + RP = SF. So DSR is portion paid from Vault to DAI, and RP is component paid from Vault to MKR. There may a global RP for all collateral types, as well as collateral specific RPs. Both are included in “RP.” I think there has been some laxness in the community with terms… but this is my understanding of it. A Vault user might say: “Wow Vaults are so attractive, but I’m scared of the interest rate volatility” so they say “I will enter into an FRA/SWAP with a DAI user so my DSR stays flat” But then they need to take care of RP. So they find an insurer. The insurer says “I think the risk profile will not change so I can insure this vault user’s RP” But then they say “I want nothing to do with the DSR! Its too volatile!” Now if we say that DSR is a percentage of SF, the insurer can’t offer this policy to the Vault user because the RP fluctuates with respect to the DSR So the DSR spread makes sense (very much so I should add!), but DSR as a percentage of SF not as much because it interlocks DSR and RP and they become dependant variables. This makes it more difficult for insurers to offer policies for RP. It is best to keep the various components separate to make them easier to hedge. Its harder to hedge when two components are mixed together. Side note: if you want more explanation of this “FRA/SWAP with a DAI user so my DSR stays flat” See the attached file [Where OC stands for Over-collateralized Vault.] It represents a hybrid between FRAs and IRSwaps that Vault and DAI users can use to bring their DSR exposure to exactly neutral cFRA750×500 61.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.221153846153847
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#24",
                    "likes": "1",
                    "time": "31/12/2019-14:32:57",
                    "content": "So I think we are operating under slightly different terminology. For me the term “Stability Fee” refers to the fees collected purely to curb DAI supply and keep the peg in line. “Risk Premium” refers to the portion of the fees that are collected cover bad debt to MKR holders. It is my view that we should encode RP entirely into the vault fees and use the global fee as the only fee for peg stability. In summary: Vault Fee (What the Vault owner pays) = Global SF + Vault RP The DSR is paid as some fraction of the Global SF. If DSR Spread = 0, then MKR holders take no profit. If DSR Spread = Global SF then MKR holders take all profit. I like this model for a few reasons, but one of the main advantages is that it completely separates risk (Vault Fee) from peg stability (DSR / Global SF). I made a presentation for Thursday which will hopefully clear up some of these terminology differences. Happy to hear alternative models as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.160317460317461
                },
                {
                    "author_link": "https://forum.makerdao.com/u/compvioz",
                    "index": "#25",
                    "likes": "1",
                    "time": "31/12/2019-18:05:38",
                    "content": "This is my thinking, feel free to correct me. DSR doesn’t matter much to vault holders (or insurers) unless there also Dai holders, but even then the Dai would probably be invested else where.  Who would take out a 4% loan just to put it in a 3% savings account, long term. DSR would not be link to risk of individual vaults but to the GSF, which is the baseline risk of all collateral. With reasonable debt limits a sudden spike in demand to mint and sell a Dai shouldn’t happen. A general outflow of liquidity from the all crypto markets would increase the interest rates and spreads of all stable coins. A FRA would be useful in this situation and we wouldn’t need to increase each individual vault fee (or even the DSR spread), we would just raise the GSF with raises the DSR, which would be cover by an FRA on either rate. What I think your example is: Person A) Vault owner has 100 ETH wants to take out a 5000 Dai loan at 4% (3% GSF + 1% VF) to buy a 6% corporate bond maturing in one year Person B) A Dai holder wants to lock in DSR at 2.85% for one year Since DSR is link to GSF, any increase in GSF would in increase DSR. Making a FRA for DSR somewhat interchangable with a FRA for GSF. So person A makes FRA for DSR with Person B for one year. Person A has GSF is locked in but not VF. Person A could find someone else to enter into a FRA for only VF. However since VF rate is calculated based on the risk nature of the asset (volatility, liquidity, average collateralization) this shouldn’t change much compared to other similar assets. A put option or a leveraged short position on ETH, could cover ETH price drops. If person A was not mildly bullish on ETH (and there for the stability of ETH VF), they may be better off to just sell ETH, buy the bond, collect a clean 6%, and buy back the ETH after a year. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.482954545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#26",
                    "likes": "0",
                    "time": "01/01/2020-09:35:24",
                    "content": "Yes my only concern is from your previous post where you introduce the multiplication and where hexonaut mentioned the percentages. It would make it a lot harder to lock in terms for general (global) SF ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.783333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#28",
                    "likes": "2",
                    "time": "07/01/2020-12:57:40",
                    "content": "The poll has now closed with a 58% majority support for “Yes, switch DSR voting format to a DSR Spread with a lower bound of 0%”. This seems like enough evidence to move to an on-chain governance vote. Following @LongForWisdom’s format here, I’ll write up a description for @rich.brown to add to the voting portal.  Title: Should we replace the weekly DSR Rate governance poll with a weekly DSR Spread governance poll? Description: If passed, the weekly “Dai Savings Rate Adjustment” governance poll will be replaced with a weekly “Dai Savings Rate Spread Adjustment” governance poll. The “Dai Savings Rate Spread Adjustment” poll will use the same exponential rate stepping options as the other governance polls with a lower bound of 0%. The Dai Savings Rate Spread will determine the Dai Savings Rate by using the following formula: Dai Savings Rate = max(Dai Stability Fee - Dai Savings Rate Spread, 0) (the max() prevents the case where the Dai Savings Rate is negative) Background and discussion: Signal Request: Should we replace the weekly DSR Rate governance poll with a DSR Spread governance poll? Options: Yes/No ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-should-we-replace-the-weekly-dsr-rate-governance-poll-with-a-dsr-spread-governance-poll/969"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#29",
                    "likes": "0",
                    "time": "09/01/2020-09:30:48",
                    "content": "We need to support DSR>SF for a limited amount of time to increase DAI in circulation and to encourage liquidity and stabilize the peg. I agree that voting for both DSR and SF does not make sense. We should vote for the spread occasionally and for the SF weekly until we have a bigger system ($1B) which will not require such often “hacking”. I think we will have to set DSR below 3.5% to get DAI back to $1. Unless we want to kill adoption with very high SF, the SF will also have to go below 3.5%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.113809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#30",
                    "likes": "1",
                    "time": "14/01/2020-15:53:00",
                    "content": "Vote is up! https://vote.makerdao.com/polling-proposal/qmb8yjdhskb6zxv1fcylyk6gqpeygvargip4mspbbenxl1 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#31",
                    "likes": "0",
                    "time": "21/01/2020-08:10:08",
                    "content": "There is no 0 option?? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#32",
                    "likes": "2",
                    "time": "21/01/2020-08:18:44",
                    "content": "Mistake. There will 0 option when next polling round starts (next week). I believe that all people that voiced their opinion (in the chat)  were against invalidating poll since it would create unnecessary complications, since 0.25p is small enough value to be good proxy for 0. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.892857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#33",
                    "likes": "0",
                    "time": "21/01/2020-08:22:33",
                    "content": "OK, thanks. Maybe someone else will wonder also so it might be good to publish that info to reddit/forum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#34",
                    "likes": "3",
                    "time": "01/02/2020-02:04:10",
                    "content": "Now that the Spread voting is working well. I would suggest that the frequency of the spread vote should be reduced. It is not required to maintain the DAI peg, it is a toggle for growth/profit of MKR holders. I would prefer a Spread vote every 4 weeks so that their is less voter apathy. However, maybe it is worth continuing a weekly Spread vote for the first few weeks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#35",
                    "likes": "2",
                    "time": "01/02/2020-02:15:51",
                    "content": "My thoughts exactly. I’ll put up a poll on here next week and get the process started, but 4 weeks sounds about right to me too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#36",
                    "likes": "0",
                    "time": "02/02/2020-10:12:59",
                    "content": "Not sure how this remark fits into discussion, but It is puzzeling that in this Spread poll participation was 6419 MKR while DAI SR had 15915 MKR and Debt Ceiling 29907 In other words participation in this poll is exceptionally low. I wonder what that means. It is same UI MKR holders need to access in order to vote. And win on current value was really tight ~900 MKR that is less than 0,1% of total supply. I think freuency of vote repetition should be derived from that margin. If it is low (as now) it should be repeated oftenly. Once it gets higher it should be repeated with smaller frequency. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.1374007936507935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#37",
                    "likes": "0",
                    "time": "14/02/2020-16:45:33",
                    "content": "This proposal has passed an on-chain vote: https://vote.makerdao.com/polling-proposal/qmb8yjdhskb6zxv1fcylyk6gqpeygvargip4mspbbenxl1 Results: 3,718.81 MKR approving (98.77%) Closing this thread due to inactivity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#38",
                    "likes": "0",
                    "time": "14/02/2020-16:47:29",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "3978"
}