{
    "poll_list": [
        {
            "title": "MIP9 Community Greenlight Poll - Pando (Pando Investment Grade Climate Assets) - August 1, 2022",
            "index": "16394",
            "option": "No (Defer)",
            "supporting_mkr": "54,042",
            "highest_fraction": 0.45
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/collateral-onboarding-call-46-pando-investment-grade-climate-assets/16639",
            "title": "Collateral Onboarding Call #46 | Pando Investment Grade Climate Assets ",
            "index": 16639,
            "category": [
                "Collateral Onboarding",
                "Collateral Meetings"
            ],
            "tags": [
                "public-call",
                "pubcall-:-collateral"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "4",
                    "time": "15/07/2022-22:49:42",
                    "content": " Collateral Onboarding Call #46 | Pando Investment Grade Climate Assets       Slide Deck available here.  Application Summary Pando Climate Co. has published a MIP6 application to introduce rated solar loans from Mosaic Solar, Inc as collateral in the Maker Protocol. This application is initially requesting a $220 million debt ceiling. Pando is built to unleash financing for the age of climate solutions, by tokenizing real world climate assets and offers them as investments. Pando in turn enables protocols and DAO’s to invest in climate solutions, while also stabilizing and growing their treasuries with real-world assets. The MIP6 application is targeted to start its Greenlight polling on 25-July.  Join us Join us 2022-07-19T14:30:00Z as we host: Dori Rutkevitz @Dori - CEO Peter O’Rourke @Peter_Pando - Chief Investment Officer Morgan Wright @MorganPando - CFO If you’re unable to attend this call but have questions: submit any questions for the AMA on this forum post and our hosts will have them addressed during the session.  Agenda    Intro by @juan & @retro  Presentation by the Pando Team Community Q&A   [MIP6]Pando Investment Grade Climate Assets Collateral Onboarding    These rated assets are investment grade that provide the stability and risk profile that the Maker community has signaled a preference for in the past. This Transaction establishes Maker as a peer among blue-chip financial institutions that currently lend to the same type of assets from the same Originator. These institutions include BNP Paribas, New York Life, Royal Bank of Canada, TIAA, PIMCO, Credit Suisse and Deutsche Bank, among others. The Pando team is uniquely qualified to invest in, structure, and manage these assets for Maker, and collectively Pando has more than seventy years of experience in energy project finance across more than $70B of projects. This Transaction will enable Maker to diversify its reserves from non-yielding assets to cash flow generating rated assets. Pando and Maker are as aligned as any lender-borrower can be, in that both Pando and Maker’s returns are based on asset performance. Pando did not structure our income as guaranteed fees, which is more typical for this type of transaction. Instead, our return is subordinate to Maker and 100% at risk. Said another way, Pando will not receive its full return unless Maker receives 100% of its return. In that way, Pando is highly motivated to ensure Maker is protected and their loan is fully serviced.    When Time in your local-timezone format: 2022-07-19T14:30:00Z Mark it on your Google Calendar!  Where Crowdcast Call   crowdcast    Collateral Onboarding Call #46 | Pando Investment Grade Climate Assets Register now for Collateral Onboarding Call #46 | Pando Investment Grade Climate Assets on crowdcast, scheduled to go live on July 19, 2022, 09:30 AM CDT.       Attn: @SES-Core-Unit, @gov-comms-core-unit, @GovAlpha-Core-Unit, @Growth-Core-Unit, @daif-core-unit, @Protocol-Engineering, @Oracles-Core-Unit, @Risk-Core-Unit, @Real-World-Finance, @Recognized-Delegates, @collateral-core-unit, @data-insights-cu, @strat-fin-core-unit ",
                    "links": [
                        "https://drive.google.com/file/d/1U6DKbHatLye4dJIQx6LWEo-nLY5slr46/view?usp=sharing",
                        "https://www.pandoclimate.co/",
                        "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394",
                        "https://www.pandoclimate.co/",
                        "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672",
                        "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=MnMwbjU1aGduZDUzdXF0ZW5lczRjZ2hrYWIgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://www.crowdcast.io/c/collateral-call-46",
                        "https://www.crowdcast.io/c/collateral-call-46",
                        "https://www.crowdcast.io/c/collateral-call-46",
                        "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394/23",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-14-20-de-julio-del-2022/16911"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Collateral Onboarding",
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6529106858054226
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kunfu-po",
                    "index": "#3",
                    "likes": "0",
                    "time": "05/08/2022-02:06:37",
                    "content": " Collateral Onboarding Call #46 - Summary July 20th, 2022  Agenda   00:00: Intro with Retro  01:00: Pando Investment Grade Climate Assets with Morgan Wright, Dori Rutkevitz, and Peter O’Rourke  00:00: Q&A and Discussion about Pando Investment Grade Climate Assets   Video https://youtu.be/USaXjAQMdCc  Introduction  Retro  Agenda and Preamble 00:00  Hello, MakerDAO community. Thank you for joining the 46th Collateral Onboarding Community Call. Today, we are joined by three team members from Pando presenting Investment Grade Climate Assets for onboarding to the MakerDAO system. We are joined by Morgan Wright, CFO, Dori Rutkevitz, CEO, and Peter O’Rourke, the chief investment officer. Discussions about collateral happen in the Forum.    Pando Investment Grade Climate Assets  MIP6: Pando Investment Grade Climate Assets Collateral Onboarding   Peter O’Rourke  Presentation 01:00  Pando1918×1077 127 KB   Executive Summary1632×925 247 KB   Who is Pando?1630×927 242 KB   Mosaic1629×928 183 KB   Proposed Solar Investment Structure1630×926 156 KB   Proposed Solar Investment Structure, cont&#39;d1631×926 202 KB   Structure Summary1627×927 186 KB   Benefits to Maker1629×929 160 KB   FAQ&#39;s - How does it compare to treasuries?1630×925 256 KB   FAQ&#39;s - How does pricing compare to Bonds?1630×927 209 KB   FAQ&#39;s - How does pricing compare to Bonds, con&#39;t?1628×927 236 KB   FAQ&#39;s - Is Maker the only capital in the Transaction (e.g. jr. capital)?1630×928 249 KB   FAQ&#39;s - Are these assets liquid?1631×928 208 KB   FAQ&#39;s - How is Pando Aligned with Maker?1630×933 192 KB   DRAFT/Flows1628×926 185 KB   Roles &amp; Approval Authority1630×930 217 KB   DRAFT/Approvals1630×928 123 KB   Pando Underwriting Model1634×930 188 KB   Pando Team1632×928 141 KB   Discussion 18:50 - Someone: What is the yield discrepancy between the Pando loan and the treasury? 19:15 - Raphael: Would the yield be less for shorter duration bonds? 22:40 - Connor Popik: Cannot we recreate the cashflows of the Pando loan with treasuries? 25:41 - Kianga Daverington: Why would we want to exit performing loans? 26:11 - David Krett: Would any of these other Mosaic lenders be interested in taking a piece of the proposed Maker Loan upfront? 29:14 - Teej: In the case that a recently traded solar bond (e.g., GoodLeap 2022-3 bond, senior priced at 5%) is not a relevant comparison to the subject illiquid project finance loan. What a particular comparison might be for this loan? 31:32 - Teej: Is that the argument that Mosaic is inherently structurally a more powerful and better issuer? 35:58 - Someone: Let us say the proposal follows through, and in a couple of years, the worst-case scenario of the US government crackdown on DeFi and/or stablecoins materializes, Maker, being one of the primary targets, what is your playbook? 37:40 - Eric Rapp: There have been over $8B of consumer loan debt financings in the public market since 2020. Your prices imply that these deals could have been done 6%-12% cheaper in this project finance market, implying that these originators could have financed this $8B of assets at 480 to 960 million cheaper using your approach. Why did they not do this? 51:17 - David Krett: Does Mosaic have syndicated and participated loans? If so, what terms and what is the pricing on these? 52:15 - Tim Black: Will you provide this deck to the forums? Or is it already there? 55:38 - Someone: I understand that the whole loan/securitization markets are intimately intertwined. Is that right? 57:09 - David Krett: What is the minimum amount using this transaction structure?  Closing Comment  Retro  Outro 59:08  Thank you, Peter, Dori, and Morgan, for the engaging discussion and everyone for joining. We will see you around.   Credits  Kunfu-po produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/USaXjAQMdCc?t=60",
                        "https://youtu.be/USaXjAQMdCc",
                        "https://youtu.be/USaXjAQMdCc",
                        "https://forum.makerdao.com/c/risk/collateral-meetings/23",
                        "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394",
                        "https://youtu.be/USaXjAQMdCc?t=60",
                        "https://youtu.be/USaXjAQMdCc?t=1130",
                        "https://youtu.be/USaXjAQMdCc?t=1155",
                        "https://youtu.be/USaXjAQMdCc?t=1360",
                        "https://youtu.be/USaXjAQMdCc?t=1541",
                        "https://youtu.be/USaXjAQMdCc?t=1571",
                        "https://youtu.be/USaXjAQMdCc?t=1754",
                        "https://youtu.be/USaXjAQMdCc?t=1892",
                        "https://youtu.be/USaXjAQMdCc?t=2158",
                        "https://youtu.be/USaXjAQMdCc?t=2260",
                        "https://youtu.be/USaXjAQMdCc?t=3077",
                        "https://youtu.be/USaXjAQMdCc?t=3135",
                        "https://youtu.be/USaXjAQMdCc?t=3338",
                        "https://youtu.be/USaXjAQMdCc?t=3429",
                        "https://youtu.be/USaXjAQMdCc?t=3548"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.62562656641604
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/11/2022-08:07:31",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394",
            "title": "MIP6: Pando Investment Grade Climate Assets Collateral Onboarding ",
            "index": 16394,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "rfc"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Dori",
                    "index": "#1",
                    "likes": "4",
                    "time": "06/07/2022-22:28:06",
                    "content": " Summary of Terms: (All numbers in brackets refer to sections of the Collateral Application Template] MIP6#: Title: Pando Investment Grade Climate Assets Collateral Onboarding Transaction: Loan to Pando Solar 1 (SPV) to lend against a pool of rated solar loans from Mosaic Solar, Inc. Author(s): Pando Climate Inc. (http://www.pandoclimate.co), a firm of highly experienced energy investors and operators that enables protocols like Maker to benefit from real-world climate assets. Contributors: Dan Rosen, Dori Rutkevitz, Peter O’Rourke, Morgan Wright Type: Proposal Initial Debt Ceiling: ~$220 Million 12 month goal: >$1 Billion Transaction Terms* [31]:  image1282×559 75.4 KB  Status: Date Proposed: <2022-07-06> Forum URL: […]  References  Mosaic Surpasses $6 Billion in Loans Project Real World Sandbox MIP67: Methodology and Review Process for Structured Finance Transactions Methodology for Review of MIP6 Structured Finance Transactions KBRA Global Rating Methodology KBRA Structured Finance Counterparty Methodology KBRA ESG Global Rating Methodology SES Project Real-World Sandbox IPCC Sixth Assessment Report   Executive Summary [2]  767×432 680 KB  MIP6: Pando Climate Inc. (“Pando”) is offering Investment Grade solar assets to MakerDAO (“Maker”). This will enable Maker to earn stable, risk-adjusted financial returns, in a market currently dominated by top-tier global institutions, all while backing climate-positive collateral that prevents greenhouse gas emissions. Some climate investments make dubious claims regarding their financial returns, their climate impact (e.g., some carbon credits have controversy surrounding the quality of their verification standards) or both. This first transaction represents rooftop solar systems on U.S. homes: these systems provide contracted cash flows from customers, and prevent greenhouse gas emissions, often helping homeowners save money every month while meaningfully changing their relationship with their own energy generation. Pando believes there is a profound opportunity to use DeFi to accelerate climate solutions while providing stable risk-adjusted returns to investors. This transaction does not subsidize climate, rather enters Maker into an existing marketplace that currently is dominated by top-tier TradFi investors. These investors lend to Mosaic because of the stable, investment-grade cashflows, the diversification provided against other stable investments (e.g., Treasuries), and attractive risk-adjusted returns. The high demand also means there typically are ready buyers for these loans should Maker need to unwind and liquidate its position. Asset [6, 7]: The first opportunity that Pando is offering to Maker is to lend~$220M against a ~$250M pool of rated solar loans (the “Transaction”). The assets supporting the Maker loan are contracted cash flows from PV Solar installations on residential rooftops. The Transaction is highly structured, and the pool of solar loans will be rated Investment Grade by a US Credit Rating agency (Kroll Bond Rating Agency, or KBRA). As a result of this Transaction, the company originating the loans will be able to increase its deployment of solar. Also, the Transaction provides Maker with an opportunity to earn yield from assets that are uncorrelated with the rest of the crypto market, while demonstrating how cryptocurrencies can pioneer innovative, cost-competitive financing structures in clean energy. Maker will be in the senior secured position, providing significant protection in any downside scenarios. Maker will fund the ~$220m as part of a single Tranche at closing for the Transaction (e.g., a static Pool). Unlike some bond offerings (e.g., US Treasuries) that only return principal at maturity, both principal and interest payments for the Transaction will commence directly after closing. This Transaction will not tokenize the solar loans, and as a result Pando will coordinate with the Real World Assets Team on a MIP21.  Treasuries vs. Loans In some Forum posts, we have noted that the Community is debating investing in Treasuries vs. in real-world assets.  While an Investment Grade transaction like this presents minimal risk similar to Treasuries, most investors diversify their portfolio by having a mix of investments that include both investment grade rated assets as well as Treasuries.  While there are several reasons to diversify investments, a primary reason to invest in instruments other than Treasuries is Treasuries pay interest only until the maturity of the note, meaning all principal on a ten year note is outstanding for the full ten years. Conversely, private loans return Principal and Interest immediately, offering investors more flexibility and liquidity with their capital.  Below please find a simple representation of cumulative Principal & Interest payments for the Pando Transaction vs a ten year UST. For example, the Pando Transaction will return $133M by the end of year five (including $115M of returned principal) versus only $30M in interest payments from the UST (with no principal).  854×568 13.4 KB   Market Pricing Also, at Maker RWA CU’s request, we confirmed with two investment banks (Royal Bank of Canada & Citibank) that the pricing offered by Mosaic is consistent with currently priced solar bonds in the market.  While the proposed Pando assets are not solar bonds, the CUs requested that we use these assets as a comparable, since solar loans are not publicly traded.  Both RBC and Citi confirmed that the pricing offered by Mosaic is indeed either at par or higher than what they would expect to see currently in the market. This MIP6 also details strict conditions for the setup of the underlying legal and governance structure and attestation requirements. This proposal contemplates the use of a Delaware Statutory Trust and the creation of bankruptcy-remote SPVs to provide the necessary legal protections for all participants. Other items to note include:  These rated assets are investment grade that provide the stability and risk profile that the Maker community has signaled a preference for in the past. This Transaction establishes Maker as a peer among blue-chip financial institutions that currently lend to the same type of assets from the same Originator. These institutions include BNP Paribas, New York Life, Royal Bank of Canada, TIAA, PIMCO, Credit Suisse and Deutsche Bank, among others. The Pando team is uniquely qualified to invest in, structure, and manage these assets for Maker, and collectively Pando has more than seventy years of experience in energy project finance across more than $70B of projects. This Transaction will enable Maker to diversify its reserves from non-yielding assets to cash flow generating rated assets. Pando and Maker are as aligned as any lender-borrower can be, in that both Pando and Maker’s returns are based on asset performance. Pando did not structure our income as guaranteed fees, which is more typical for this type of transaction. Instead, our return is subordinate to Maker and 100% at risk. Said another way, Pando will not receive its full return unless Maker receives 100% of its return. In that way, Pando is highly motivated to ensure Maker is protected and their loan is fully serviced. Maker may benefit from the increasing regulatory pressure from the White House, SEC, the UN, and others to dramatically advance the clean energy economy.  “President Biden knows that we need to move even faster to combat climate change…reaching 100% carbon pollution-free electricity by 2035 ”  White House, February 28, 2022   “The SEC Will Regulate Climate”  Bloomberg News, March 22, 2022       Answers to criteria areas provided by RWF CU. [1, 3, 4, 5, 8, 9, 12, 13, 17, 22-27, 30 34: Not applicable]  Background of Asset Manager (Pando) & Key Member’s Historical Performance Demand for solar energy has been increasing exponentially as the cost to install solar continues to drop. According to a recent UN study, we need to deploy $2 trillion annually to meet climate targets by the end of the decade. While climate technology has been proven to work and the demand is there, traditional financial institutions are not responsive enough to keep up with the growing demand. Pando believes MakerDAO and other crypto protocols can be a critical player in accelerating the adoption of climate solutions globally while earning a stable return. Pando was created in early 2022 by the founder and former-CEO of Solar Mosaic, Inc. (Mosaic) and the former product lead at Mosaic, which has financed more than $7B of solar loans and issued several billion (USD) in rated solar debt instruments. Pando’s four principals have decades of combined experience in energy finance and have collectively structured or participated in more than $70B of energy projects. Highlights of Pando’s Principals include:  Founding team of Mosaic, Navajo Power  Senior leadership at US Department of Energy’s Loan Programs Office  $60B in total energy loans across wind, solar, geothermal, EVs, and nuclear $465M loan to Tesla, the catalyst for the Model S $2.6B distributed generation project, first ever for Bank of America and a leading Real Estate Investment Trust   Created, deployed, and managed a ~$500M, SEC-registered solar tax equity Investment Advisory firm Senior leadership at New Energy Nexus, Core Capital, Sparkfund, and other leading energy/finance companies  [36] The Pando principals are supported by world class Advisors, including KPMG (tax), as well as Perkins Coie, and Morrison & Foerster (legal). Pando’s mission is to radically accelerate the flow of capital into climate solutions by bringing high-quality climate assets to crypto protocols. Pando’s Role in Transaction: Briefly below is a high-level description of Pando’s role, which is based on our decades of experience in this sort of transaction. Pando’s net yield is low compared to what a typical borrower and sponsor would expect for this sort of transaction, in particular as it is structured as an at-risk Yield vs. a guaranteed Fee. Pando accepts this lower return given the competitive nature of the transaction does not leave much room for a larger return, and Pando hopes this to be the first of many Maker transactions.  Structuring the project and managing all pre-close activities, including but not limited to: Kroll rating, SocGen structuring, Mosaic tranche verification, and Pando credit underwriting. Pando (via a specially established Borrower entity) will be the borrower counterparty to Maker. That same borrower will also be the Lender to Mosaic. Pando (the parent company) will be responsible for the following activities:  Managing all 3rd party servicer providers, including managing the Servicer to ensure principal & interest payments and all fee balances are flowing appropriately to the Payment Agent. Managing the Payment Agent to ensure principal & interest payments and all fees are properly distributed, in accordance with the Loan Agreement (including the cash Waterfall). Coordinating with Maker’s Trustee (US) to ensure all payments are received from Payment Agent, and then all principal and interest payments are distributed to Maker’s overseas Trust. As requested by Maker, coordinate with Marker’s overseas Trustee to ensure it has all relevant information so that it can ensure all distributions to Maker are handled appropriately. (Note: Both Maker Trustees will not be directed by Pando, rather Pando is solely a supporting party.) Monitoring portfolio performance and addressing actual and potential risks to the portfolio performance. Reporting on portfolio performance to Maker. Exercising any and all remedies articulated in the Mosaic-Pando Loan Agreement in the event of default and/or any other event that is addressed in the Loan Agreement.    Conflicts of Interest:  Pando is unaware of any real or potential conflicts of interest with Maker or any Maker-related affiliate.  Pando hereby discloses that Dan Rosen, co-Founder of Pando, currently is Chairman of the Mosaic Board of Directors. Process for Changing Investment Guidelines & Policies:  Importantly, as this Transaction is a single, one-time transaction, any subsequent changes to Pando’s or Maker’s Investment Guidelines and Policies would not affect this Transaction.  If Maker chooses to continue with additional capital allocations to transactions with similar terms (e.g., increasing the debt ceiling past the initial Transaction), Pando will provide Maker with clear indications of any changes to its investment processes, guidelines, and policies when proposing debt ceiling increases. Process for Transitioning to Another Asset Manager: If Pando ceases to exist or otherwise exits this transaction, Maker is protected via the terms and structure of the Loan Agreement that will be entered into between the parties.  Using a traditional, common structure for project or ABS transactions, Maker would be able to take over the Pando borrowing entity (“Pando SPV”), a bankruptcy-remote special purpose vehicle.  This SPV structure allows Maker and/or any affiliate to ensure the cash flows coming from the loan to Pando continue to perform and are serviced, with little to no interruption. Asset Manager’s Business Model: Pando principals are experienced as lenders, including managing project finance loans that require an active lender.  While this initial Transaction proposed to Maker is more simple, it still requires a lender who is actively monitoring project performance on a monthly basis and is willing to take the liabilities, representations, covenants, and credit obligations for this transaction.  Also, in distress situations, an active lender is required to step in to evaluate and exercise all rights and remedies. Pando performs this role as lender, as it is not the purpose of a DST to be a direct lender.  Wilmington Trust or any other similar entity is not experienced or staffed to serve in this role, nor do we presume they would take on this role.  There are obligations and liabilities, including credit obligations, that are counter to the legal requirements and obligations of a Trust participating as an impartial collateral agent. We believe there is no bankruptcy risk to the Pando SPV in the proposed structure.  Our structure is a well-established, traditional project finance structure, specifically designed to manage parent company/holdco risks.  The Pando SPV will be a bankruptcy-remote entity that is established for the sole purpose of lending to Mosaic. Maker’s capital is not at risk even if Pando Climate Inc., disappears. If Pando were to disappear, the Pando SPV would continue to operate, but could be taken over by Maker, who then would coordinate with another provider to manage the remaining term of the loan. This hypothetical situation may create operational issues for the DST, but it does not jeopardize Maker’s capital or yield. Similarly, the Mosaic-Pando Loan Agreement will be between Pando SPV & Mosaic SPV, so that if Mosaic disappears, Pando would be able to take over that Mosaic SPV and ensure the loans continue to perform and be serviced. Pando & Mosaic Risk Mitigation Processes: Rating Agency and Asset Manager Underwriting [32, 33] Both Mosaic and Pando have best-in-class underwriting processes. For example, Mosaic spent years establishing a public rating methodology with Kroll Bond Rating Agency. An Investment Grade rating signifies the risk of default in the underlying assets is extremely unlikely. Also, Pando utilizes a Risk Underwriting Model against which the Principals have developed and deployed billions of dollars. The Pando model has been reviewed by public accounting firms and institutional investors - all of whom have declared it best-in-class. KBRA will analyze the pool of solar loans in the Transaction using the General Global Rating Methodology for Asset-Backed Securities and the Consumer Loan ABS Global Rating Methodology, as well as its Global Structured Finance Counterparty Methodology and ESG Global Rating Methodology. The Transaction falls within the “Category 1 – Financial Assets” categorization noted within the Global General Rating Methodology for Asset-Backed Securities, which typically relates to transactions that are backed by pools of consumer or commercial financial obligations owed by diverse obligors. In applying these methodologies, KBRA analyzes the Transaction’s data and the underlying collateral pool and analyzes the capital structure using stressed cash flow assumptions. Pando and its legal counsel also will review operative agreements and legal opinions prior to closing. The following table provides a summary description of the underwriting criteria that Pando uses to evaluate distributed generation assets like the Transaction.  Each category has multiple subcategories and percentage valuations, and scores are assigned for each subcategory in order to comprehensively evaluate the creditworthiness of the project.  1280×596 28.7 KB  [35] For this Transaction, Pando’s underwriting process is secondary to Kroll’s rating process. A KBRA rating is sufficient for most lenders, and the Pando principals have relied on similar ratings for other transactions. However, as a matter of practice, Pando will always run projects through our underwriting process as a matter of good internal governance. Background of the Originator (Mosaic) [21]  741×432 399 KB  The pool of solar loans that comprise the Transaction are originated by Mosaic, one of the most respected climate finance companies in the world. Mosaic has originated more than $7 billion in loans since June 2014. It is a California-based specialist finance company that enables homeowners to go solar by providing them a loan to cover the cost of solar installation. Often, homeowners save money because their monthly solar loan payments are cheaper than their previous utility bills. This Investment Grade Solar Transaction represents a diversified portfolio of loans (across thousands of U.S. homeowners), all enabling decentralized renewable energy generation. If this proposal is approved, this capital will allow Mosaic to deploy even more residential solar in the U.S. Mosaic originates loans to mostly prime credit quality homeowners through its partnerships with more than 700 approved solar system installers/dealers. Mosaic disburses funds directly to installers, equal to the system cost minus installer discounts. This discount depends on the loan term and dealer agreements and is generally netted out proportionately with each disbursement to the installer/dealer. Mosaic directly originates loans in 48 states and the District of Columbia through its state lending licenses where required, and across all 50 states and the District of Columbia through lending partnerships with financial institutions. The following bullets detail additional information about Mosaic:  Mosaic has issued loans to partners like Tesla, SunRun and SunPower. Current loan purchasers are publicly traded financial institutions (e.g., BNP Paribas, New York Life, Royal Bank of Canada, TIAA, PIMCO, Credit Suisse, Deutsche Bank, etc.). Pando & Maker will lend similarly to these institutions. Homeowner owns/maintains the system and makes payments against the loan. Mosaic pools loans into a ‘warehouse’ facility; those pools are then formed into tranches that receive a Kroll rating based on an established underwriting methodology Mosaic bundles and sells solar loans to financial institutions. This method represents an efficient, cost-effective way to capitalize Mosaic. Selling to these institutions allows Mosaic to deploy even more solar.  Reporting [34] The Asset Manager will rely on Mosaic’s existing reporting systems, methods, and technologies to update Maker on the performance of the underlying pool of assets. Reporting will be provided monthly and will include:  Account reconciliations, including the Reserve account, Collections account, and Capitalized Interest account; Pool Information, including average coupon, remaining term, aggregate principal balance, and number of loans active; Collections, distributions, and fees paid in period; Delinquency Rates; Cumulative default history; Cumulative Net losses; Recoveries against defaults; and Prepayment Information.   Transaction Structure [15, 15, 16] The proposed structure is a private, rated back-to-back loan, not a public bond purchase with different tiers of risk priced differently (the latter being Mosaic’s typical bond financing structure). First, Mosaic will work with Soc Gen and Kroll to combine a group of loans that together have a weighted average FICO score of 700 or greater and a combined default risk consistent with a BBB+ rating. Kroll will issue a private rating of BBB+ on that pool of loans. Not every loan within the pool will carry that rating, as the rating is on the blended pool. Then, Pando proposes that Maker lends capital in one tranche to a Pando SPV whose sole purpose is to lend against the cash flows from that entire contemplated pool of loans from Mosaic. Every dollar that is lent to the Pando SPV from Maker will be used to complete the Transaction. The Pando SPV will be the counterparty to Maker on one side, and the Pando SPV will be the counterparty to Mosaic on the other side. The loan from the Pando SPV to Mosaic will be secured by all of the underlying loans in the rated pool of assets. For the loan from Maker to Pando, the security interest will be in the Pando SPV – with all of the Pando SPV’s rights extending to Maker via the Pando-Maker Loan Agreement. The structure is similar to how lending institutions operate today, borrowing from the Fed at the Cost of Funds and then lending to customers at a higher rate. Similarly, we propose borrowing from Maker and behaving as many similar financial institutions do so today. The weighted average interest rate on the aforementioned A-D tranches of the 2022-1 Mosaic offering was 2.91%. Mosaic and Kroll present IRR as yield, which will be higher than the interest rate as some prepayments push up the IRR calculation on the portfolio from the paid interest rate. Similarly, the IRR Maker will receive will be higher than the interest rate offered (currently 2.00%).  Full or partial pre-payments typically are seen as a result of homeowners receiving the ITC (Federal tax credit for solar) or when a homeowner sells their house (and the new owner chooses not to assume the loan). If a homeowner were to refinance their mortgage, they have the option of prepaying the solar loan in its entirety or continuing with the original amortization schedule; extension of the loan is not an option for homeowners. We have negotiated with Mosaic for the proposed Transaction to be priced above the interest rate (~2.90%) of the entire 2022-1 Mosaic transaction. They have agreed to a yield of 4.25%, which brings the underlying interest rate closer to 3.45%, depending on prepayment activity. Any difference between estimated and actual fees paid to the Collateral Agent and Mosaic as Servicer can also flow to Maker, and we are willing to discuss ways to include additional reserves and/or refining some of the ongoing cost assumptions. The following bullets provide some of the benefits that will accrue to Maker from the Transaction.  The Transaction will generate a stable return to Maker from climate-focused, highly-structured, rated cash flowing assets. These assets are not correlated to the crypto market. Unlike a purchase of Treasury Bills, this Transaction will have a scheduled payment of principal and interest to Maker on either a monthly or quarterly basis. The technology used for the solar systems is commercial grade with substantial warranties for design, workmanship, and installation. The Transaction poses no technology risk for Maker. The structure of the Transaction is repeatable, and significant demand exists for similar transactions. The Pando principals are confident they can structure several billions in similar transactions once the template is complete with this Transaction. While the Transaction will have a private rating of Investment Grade, there may be an ability to increase the returns from projects with different risk profiles in future transactions. The Pando team is deeply experienced in sourcing, diligencing, structuring, and managing similar assets to the Transaction. The Transaction is novel as it will be the first funded by a cryptocurrency, solidifying MakerDAO as the pioneer of a new financing structure for renewable energy. This structure allows DAI to be backed by “clean”, stable cash flows from renewable assets.   Legal and Approval Structure Verification [10, 11, 29] This proposal is based on the precedents set by the 6S Trust structure approved by the community in MIP13c3-SP4, as well MIP21, which has been active for more than six months. Pando will cover Maker’s legal costs (with a mutually agreed cap) to execute on the Pando-Maker loan agreement, the Kroll rating, setting up the DST, and other agreed upon expenses. Pando has a signed term sheet with Mosaic, and we have been waiting for initial indications from Maker to proceed with the Mosaic-Pando Loan Agreement. That agreement will be based on Mosaic’s precedent loan agreements, meaning there will be limited initial drafting.  We are able to start that loan agreement negotiation with Mosaic at any point.  Our plan is to create a reasonably final draft, and then coordinate with Maker & Maker’s Counsel to ensure that major terms are agreeable to Maker.  That process will allow for significant coordination and will ensure that the back-to-back loans are agreeable to all parties. The legal structure is designed to include these characteristics:  This is a single Transaction, not a series of transactions. Therefore, there is no ability to change the terms once the Transaction is complete. Principal (the borrowed amount) and interest will be paid to Maker on a monthly basis. Interest will be paid to the Maker Protocol surplus buffer, while Principal will be returned to the Maker vault. Third parties will not have access to the funds or be able to change the terms or legal structure. It should not be possible for a third party to block Maker Governance’s ability to make decisions or modify the structure. There must be no ability for funds to be misappropriated or get stuck. Details on how to deal with an Emergency Shutdown will be developed and incorporated during the development process of this proposal.  This established structure requires a relationship with a regulated crypto broker, and an immutable ETH address must be emitted that can be used to construct the smart contracts necessary to complete the technical step of the onboarding process specified in MIP6XX. The following slides demonstrate the detailed flow of funds (DAI and USD), as well as the legal entities and approvals.  Pando will work with the Real World Asset Team to ensure the Transaction remains consistent with the 6S Trust Structure, and that the protections for Maker are clear and strong. A high level summary of the transaction is below.  800×450 200 KB  The following section summarizes the responsibilities of the primary parties to the Transaction:  800×450 198 KB  Maker Trustee  Delaware (DE) Statutory Trust - (for example, Wilmington Trust) Independent, 3rd party Ensures all capital flows are approved and accurate The Maker Trustee confirms that the Transaction meets all requirements and that all Conditions Precedent (CPs) have been satisfied prior to execution. The Maker Trustee also provides irrevocable instructions to Pando on whether and when to fund the Transaction.  Maker Foundation Company:  Entity that will be the conduit for funds from Maker Vault through to the Delaware Statutory Trust. Exact entity structure (e.g., Trust, or Foundation, etc.) will be confirmed and established in conversation with the Maker Real World Assets Team.  Pando  Serves as Lender to Mosaic Structures, approves, and manages the Transaction. Confirms all Conditions Precedent have been met prior to funding Mosaic loan. Manages the Servicer, oversees all loans, and remedies any issues. Ensures the entire structure is compliant with tax and accounting regulations.   Capital Flows:  Maker(Cayman Trust) - Maker (DST): We presume these flows will operate similar to any other trust contribution where assets are placed into trust.  Mechanically, the Cayman Trustee would presumably set up a wallet it controls (either exclusively or with some form of multi-signature for security purposes) that is not commingled with any other digital assets.  Maker’s Cayman Trust agreement would dictate that any tokens placed into that specific wallet from time to time are to be held in trust, so that the blockchain transfer into that specific wallet would be the operative evidence of the formal change in record title to the tokens as assets held in trust.  At that point, the Trustee under Maker’s Cayman Trust would be the record title holder of the tokens in the wallet and Maker would be the beneficial owner. We also assume that the transfer from Maker’s Cayman Trust to Maker’s DST would be the same type of contribution of assets into a trust as the first, only there will not be a blockchain / wallet structure to evidence that transfer of dollars.  Instead, we presume Maker’s DST would set up a dollar bank account for this purpose (again, not commingled). Under the terms of the trust agreement for Maker’s DST, Maker’s Cayman Trust (the sig block would say it’s the Cayman trustee signing on behalf of the Cayman Trust) would be the grantor, Maker would be the beneficiary and the trustee would be whomever Maker assigns to this role.  Presumably, the trust agreement between Maker and Maker’s Cayman Trust would give the Cayman trustee the authority to sell the tokens for dollars and contribute those dollars into Maker’s DST. Controls & Security Interests The Pando SPV bank account will have typical controls.  That said, depending on the ultimate structure, we likely would have customer payments initially be sent to an account set up solely for the financing.  These are assets of the Mosaic SPV, but the Mosaic SPV will not have access to these funds; only the collateral agent (Wilmington Trust) for the deal will have access.  On a monthly basis, the collateral agent will withdraw funds from the account to pay debt service on the financing and any fees and other amounts owed under the structure (e.g., 3rd party servicers).  Once those amounts are paid, any remaining funds are paid over to Pando.  Pando and DST will confirm these flows of funds are accurate.  The Pando-Maker Loan Agreement will give Maker (via the DST) security interests in all of Pando SPV’s assets and rights. How Pando’s Transaction Differs from Other Fixed Income Instruments Pando is offering a rated private loan to Maker that will be repaid from the cash flows generated by solar loans to mostly creditworthy homeowners. This Transaction is unique to other private loans in that Pando is ensuring the facility will be rated Investment Grade (typically private sales are not rated). Investment Grade means a third-party rating agency believes the inherent risk of default of the Transaction is incredibly low (in this case, less than 0.3% annually). This independent assessment of risk typically results in a lower interest rate for borrowed capital because the inherent risk to the return is lower. Our transaction is effectively a hybrid of other available fixed income products: we are rating the asset pool akin to a bond offering, but we are using a loan structure that is comparable to a forward flow offering for structure and pricing. The following table provides a comparison of the Pando Transaction to other fixed income instruments.  image1169×1637 94.1 KB  In summary, while our Transaction shares many similarities with other fixed income instruments, it compares favorably in almost every category compared to these other instruments. It carries an Investment Grade rating (very low default risk), does not carry the Issuer risk of a corporate loan, returns capital significantly quicker than zero coupon or coupon bonds, and has the same bankruptcy remote benefits as ABS/CDO securities through an identical SPV structure. Finally, the return offered is appropriate given the merits and risks of this asset pool.  The Transaction and Transaction Restriction Verification As outlined in the legal structure and flow of funds above, Pando will enter into a Loan Agreement with the Maker Delaware Statutory Trust that restricts Pando’s use of Maker funds to the uses described in this Transaction, specifically only for Pando’s acquisition of Mosaic Solar Loans. Pando proposes borrowing DAI from MakerDAO to acquire ~$220M of Solar Loans from Mosaic. The following bullets provide details on the Transaction:   The Transaction is collateralized by real world climate assets, specifically loans for PV Solar installations on residential rooftops. These solar assets generate electricity, reducing demand from the grid and greenhouse gas emissions.   Mosaic will pool the solar loans into one tranche that is highly structured and rated by a US Credit Rating agency, KBRA. The solar loans are packaged and structured so that the total pool of loans when taken together will be rated as Investment Grade.   The Transaction will represent 6,000-7,000 US residences, and the homeowners will have a weighted average FICO score of 700 or greater.  Given the assets are Investment Grade, the Transaction yield will typically be [2.90]% with ROIs ranging from [1.12x-1.15x], depending on the underlying tenor of the loans. The following table provides indicative information on a summary pool of loans for the Transaction:  image856×622 48.8 KB   *Choice loans offer the borrower the ability to structure a lower payment amount in exchange for using their ITC to prepay a portion of their loan prior to month 18.     Mosaic will service the loans, and Pando will direct/manage Mosaic as the Administrative Agent. In the event Mosaic is unable to perform, there is a contracted back-up servicer that can seamlessly step into their role.   Pando is lending against contracted cash flows from residential loans, not against the installed solar equipment.  As Pando’s senior and only lender, Maker has the most senior credit position in the waterfall against those cash flows. Additional credit enhancements include:  Maker is in a senior, over-collateralized position. Maker is entitled to approximately 90% of the cash flows from the Transaction, ahead of Pando’s junior position within the waterfall. In addition, a reserve account - sized and funded at closing - will cover any potential consumer defaults.  Historically, Investment Grade rated entities default at an annual rate of 0.03%-0.3%. The Transaction’s base case underwriting model will assume a 1% annual and cumulative 7.5% default rate. Historically Mosaic has achieved recoveries on default of 20-30%, and it is assumed that Kroll will make a similar assumption for this Transaction. CPR (conditional prepayment rate) is assumed at 12% annually for the first eighteen months and then 10% annually thereafter.   If the reserve account is depleted and Mosaic’s position is depleted, then Pando’s junior cash flows will be used to service Maker debt.   In the event of a homeowner default, the Servicer will access the Reserve Account to ensure timely payments of Principal and Interest.  A sample Solar Loan is $45,000, with an annual payment of $2,250. The Debt Service Reserve Account is sized at 1% of the initial Transaction value.  The Servicer would attempt to get the homeowner paying again, and if they are unable they will recover an average of 20-30% of the system cost.   However, if we assume $0 in recovered capital from defaulted homeowners, more than 900 homeowners (out of approximately 5,000) would need to simultaneously default to deplete the entire Debt Service Reserve Account.  As a reminder, Investment Grade assets typically default at 0.03%-0.3% annually, or up to 20 homeowner defaults annually.   In addition, Maker will stand in front of the residual cash flow, Pando, and any affiliated service providers in any downside scenario, meaning the Reserve Account is not the only protection available to Maker. Setting aside the residual, if the entire Reserve Account is depleted, it would take another 300-400 simultaneous homeowner defaults to occur before Maker’s Interest payments would be impacted. In total, 1,200-1,300 homeowners would need to default to impact interest payments to Maker. However, it is important to note that in the event Maker’s interest payments are compromised from homeowner defaults, any unpaid interest will be accrued and paid from future cash flows. In other words, substantial, unforeseen homeowner defaults could delay, but will not erase Maker’s return.    In summary, for Maker’s interest payments to be delayed, homeowners would need to default at a rate to completely erode the residual and then simultaneously default at 30x-40x the typical Investment Grade annual default rate.  The following chart provides a summary of cash distributions by year for the Transaction*:  854×568 13.5 KB  *Terms will not be finalized until the pool of Solar Loans is final. The following table provides summary terms for the Transaction*:  image1288×500 61.2 KB  ",
                    "links": [
                        "http://www.pandoclimate.co",
                        "https://www.prnewswire.com/news-releases/mosaic-surpasses-6-billion-in-loans-funded-for-residential-solar-and-sustainable-home-improvements-301433308.html",
                        "https://drive.google.com/file/d/1LQp55V26UabzanzR5hFefw-EdfbraC1U/view",
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://www.kbra.com/documents/report/184/abs-general-global-rating-methodology-for-asset-backed-securities",
                        "https://www.kbra.com/documents/report/9141/structured-finance-global-structured-finance-counterparty-methodology",
                        "https://www.kbra.com/documents/report/47746/esg-global-rating-methodology",
                        "https://forum.makerdao.com/t/ses-project-real-world-sandbox/10910",
                        "https://www.ipcc.ch/report/ar6/wg2/",
                        "https://www.kbra.com/",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697?",
                        "https://www.ipcc.ch/assessment-report/ar6/",
                        "https://joinmosaic.com/",
                        "https://www.pandoclimate.co/",
                        "https://navajopower.com/",
                        "https://www.energy.gov/lpo/loan-programs-office",
                        "https://www.energy.gov/lpo/tesla",
                        "https://www.energy.gov/articles/energy-department-finalizes-loan-guarantee-transformational-rooftop-solar-project",
                        "https://www.kbra.com/documents/report/184/abs-general-global-rating-methodology-for-asset-backed-securities",
                        "https://www.kbra.com/documents/report/6363/abs-consumer-loan-abs-global-rating-methodology",
                        "https://www.kbra.com/documents/report/9141/structured-finance-global-structured-finance-counterparty-methodology",
                        "https://www.kbra.com/documents/report/47746/esg-global-rating-methodology",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-46-pando-investment-grade-climate-assets/16639",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-14-20-de-julio-del-2022/16911",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/12",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/93",
                        "https://forum.makerdao.com/t/the-schuppi-elpro-makerdao-delegate-happy-hour-featuring-raphael-as-co-host-of-episode-5/17231",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/40",
                        "https://forum.makerdao.com/t/blockchain-columbia-delegate-platform/15202/18",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-46-pando-investment-grade-climate-assets/16639/3",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-1-de-agosto-del-2022/16975",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/99"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.444788671887909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "2",
                    "time": "06/07/2022-23:43:53",
                    "content": "In the current market, the interest difference between a 1 year treasury and a 10 year treasury is small. If we look at 1 year treasuries instead, then your arguments on flexibility and liquidity end up favoring the treasury. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "9",
                    "time": "07/07/2022-06:24:26",
                    "content": "The effective yield for a BBB corporate bonds is currently 4.99% (above 4.5% for 2 months now). I recognize this is BBB+ (but A is 4.24%). I would suggest all private credit proposal to show the spread with a comparable public liquid instrument. All things being equals, the lack of a significant illiquidity/complexity premium over such a comparable is not worth the effort. In the current case, it is even a 150bps discount (105bps assuming all costs are purely Maker related). I recognize it has the benefits of being in the Clean Money initiative that the community approved. ",
                    "links": [
                        "https://fred.stlouisfed.org/series/BAMLC0A3CAEY"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.540750915750916
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#4",
                    "likes": "1",
                    "time": "07/07/2022-08:35:25",
                    "content": "imo, it should be considered not only from purely financial perspective, but from the publicity perspective as well. Maker needs to promote its brand, name recognition, differentiate itself on the market. By funding tangible projects it might move towards that target. By simply buying bonds – not so much. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#5",
                    "likes": "0",
                    "time": "07/07/2022-16:20:02",
                    "content": "@SebVentures, Thank you for the comment.  Part of the challenge with private loans is that there aren’t publicly available comparables.  But, we do not believe corporate bonds are a very good comp, for a few reasons.  Primarily, corp bonds and corp debt aren’t analogous to our proposal, which is senior secured project debt.  There are several reasons, but foremost is that both corp debt and corp bonds are tied to the viability of the corporation.  If the corp has a bad year or disappears, then that debt is at risk. On the contrary, project debt is most often utilized outside of the parent corporation, through bankruptcy remote entities. So, if the corporation goes away, it doesn’t disrupt the debt service of the project (there are implications if the corp goes away, but the project cashflows are protected).  As our proposal is investment grade, publicly rated project debt (which is not common for energy loans), that makes this proposed investment even more secure for Maker.  But, we do recognize that it’s hard to find a public comp.  Most banks compare them to other loans they issue - risks, tenor, counterparty, etc., which provides a good metric for evaluation. We are happy to engage further on this if of interest.  Thanks again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.878985507246377
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#6",
                    "likes": "8",
                    "time": "08/07/2022-03:14:21",
                    "content": "Hey Seb asking in a personal capacity - whether @strat-fin-core-unit has a view on the compatibility of this asset from an asset liability management perspective. As a former trad-fi bank executive I think if we are adding a deal to the Dao’s balance sheet which has a  duration (average term) of 6 years and a term to maturity of 14 years ,  it would be critical to have an understanding  what impact investing $220 million - $1 billion in a transaction such as this, would have on the DAO, specifically from a risk perspective under different market scenarios. Noting that 3ACs and other recent failures have been probably caused to a large extent on poor ALM. Also, given that many RWA deals are being presented to the DAO, many with different terms, I think it would be extremely useful to determine from an ALM perspective what tenor of deals we should be targeting and any constraints in this regard. Looking forward to hearing @strat-fin-core-unit’s views on this as I think it would be important information and will allow potential RWA borrowers to structure and present those deals accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.364495798319328
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#7",
                    "likes": "4",
                    "time": "08/07/2022-08:58:27",
                    "content": "There is no recorded history of any DAI being in circulation for more than 6 years as DAI itself is not that old. Therefore it is uncharted territory. According to my point made here, all assets that can’t be sell in a short period of time (I said 1-month but 3-month is probably fine as well) should be limited to the equity (Surplus Buffer). The expected discount when selling should (for the others) be integrated in the Capital At Risk metric which will decrease the profitability of the asset. This is consistent with my ask that private credit provides a spread against public alternative of the same credit quality. The asked illiquidity premium is needed to compensate the increase of Capital At Risk due to the discount that will be needed to sell the asset (as the market is not liquid if it exists at all). @Peter_Pando is right nonetheless that having a different risk profile could add diversification benefits. You can have an asset that is less interesting than an alternative if taken in isolation but more interesting if you take in account the diversification benefits that it adds to a portfolio. But it is not that we have a portfolio of RWA to start with (40M exposure is nothing regarding the 200M+ size of the proposal) and I will not extrapolate the situation in 1-year. One can defend the fact of investing 1B in long maturity illiquid credit by saying that if MakerDAO doesn’t have at least 1B DAI outstanding we are dead anyway. I could make sense if there is no alternative and the protocol is slowly dying. TL;DR: It’s a very big ask from an ALM standpoint that will most likely push the protocol outside of the safe bounds for both liquidity and solvency… ",
                    "links": [
                        "https://forum.makerdao.com/t/mip73-pando-investment-grade-climate-assets-collateral-onboarding/14484/12"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5998677248677255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#8",
                    "likes": "1",
                    "time": "08/07/2022-19:56:44",
                    "content": "@SebVentures We agree that our proposed assets would not be very useful in the event of an immediate (e.g., 1 day) need to liquidate. As we understand your modeling dai maturity post, there does appear to be value in adding stable, cash-flowing assets that are uncorrelated to the crypto market. Specifically, these assets (really the cashflows) provide creditworthy principal and interest payments that should provide some stability in downtimes (other than full/immediate liquidation). Yet with regards to liquidity, there are a number of factors to our transaction that, despite the longer tenor, we believe largely mitigate illiquidity risk: -There are more than two dozen active lenders to Mosaic (mostly tier 1 institutions). Many/most would be very interested in the pool we are proposing to Maker. Should we need to, we do believe there will be an open market to sell down our position over the near term (e.g., 3 months). -Keep in mind that while the tenor of the loan should be about ~14 years, the Weighted Average Life for the loan is less than six years and your total returns would be greater than your invested principal well ahead of maturity.  (there’s an image in the MIP6 that shows this well). -But perhaps most important, we feel that we can liquidate our loan in a reasonable timeframe (~3 months) at a price that would allow us to return Maker’s principal – depending on when that liquidation even occurs. At the time of liquidating, we will have performing cashflows and the discount rate applied to the future cash flows should be consistent with an Investment Grade pool of assets. However, even if we assume a significant premium to that discount rate, the discounted value of the remaining cash flows would be sufficient to ensure coverage of Maker’s remaining principal. We’re happy to walk through this calculation if helpful. There is some nuance to all of this, so if possible we would enjoy discussing with you directly to make sure we’re not missing something you’re solving for or we haven’t addressed risks you’re thinking through.  We could post the summary of that conversation here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041431510875955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#9",
                    "likes": "3",
                    "time": "09/07/2022-01:32:25",
                    "content": "    SebVentures:  TL;DR: It’s a very big ask from an ALM standpoint that will most likely push the protocol outside of the safe bounds for both liquidity and solvency…   I think there is a common ground here where we all agree. It is very clear that illiquid and long maturity RWAs as a class cannot build up too far and too quickly relative to the Total Committed Exposure of the protocol. With the addition of SocGen and HVB, if approved by governance, illiquid RWAs will make up ~200M exposure compared to a 8.7B collateral base with varying degrees of liquidity. So, it is very clear that the progression and velocity of the RWAs exposure will need to happen in lock-step with more liquid assets, either crypto based (e.g. ETH and BTC) or tradFi based (e.g. short term government bonds). That risk of illiquidity based on a LCR basis will not be significant in the short term even if we use safe/conservative LCR metrics. But it is certainly a consideration we cannot ignore in the medium to long term. We’ll need to model  and monitor that as part of the ALM framework, no doubt. Equally, we’ll need to define commonly agreed safe ratios of how much illiquid RWAs the DAO will be comfortable with relative to the DAO total exposure. That wasn’t a key consideration up until now given the share of RWAs to TCE. But with the market shift and the increase in illiquid demand, this will become an important theme. Another key consideration will be the share of large exposures to a counter-party relative to the DAO Tier 1 Capital. There are some historical data and safe limits we can use for this too, as the book is built up. Here syndications could help mitigate such risks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.465231092436975
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#10",
                    "likes": "0",
                    "time": "12/07/2022-15:24:47",
                    "content": "    williamr:  we’ll need to define commonly agreed safe ratios of how much illiquid RWAs the DAO will be comfortable with relative to the DAO total exposure.   I’d like to encourage that we have this conversation immediately. I cannot vote in favor of RWA proposals until I see a firm (and codified) commitment from the DAO that it will cap RWA at a certain % of total collateral. Until that commitment is made, the risk is too high that RWA collateral will continue to grow unchecked. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.487142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#11",
                    "likes": "2",
                    "time": "13/07/2022-00:04:35",
                    "content": "@ChrisBlec Understood. I think this conversation has already started, to an extent, with the ALM framework. There are certainly more granular definitions of what those safe limits would look like in practice that need further analysis from RWF and SF when it comes to the types of funding RWAs Maker/RWF is involved in at this stage, which excludes HQLAs. I believe at the moment the DAO is involved in two key initiatives when it comes to real-world assets: HQLAs and RWA funding. SF is focusing its attention on the former, RWF is focused on the latter. I believe both of those credit strategies have a room in the DAO in the long run. There might just be different levels of understanding in how much of that will be in the Core DAO vs Metadaos. All in all, I don’t think we’ll need to reinvent the wheel here though. There are some well prescribed benchmarks with lots of historical data we can use for defining what safe ratios could look like. ",
                    "links": [
                        "https://www.bis.org/basel_framework/chapter/LCR/30.htm"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#12",
                    "likes": "2",
                    "time": "13/07/2022-14:29:18",
                    "content": "Thank you. The key categories are:  On-chain decentralized crypto vaults (i.e. ETH) On-chain centralized crypto vaults (i.e. USDC, WBTC) Off-chain vaults (all RWA, bonds, etc)  We should have a % cap for number 2 & 3. 1 should remain unlimited. 2 & 3 can grow as 1 grows. Before I vote on SocGen, if possible I’d like to get some indication of whether other CUs (particualrly RWF, SF) would be willing to engage in this conversation in good faith with me and other interested MKR holders. If we can agree to engage in that conversation, I’ll likely Abstain on this vote. However, if the idea is that 2 and 3 should remain uncapped and there should only be caps on the categories outlined in the ALM framework, then I’ll need to continue to vote No on RWF proposals until we can reach some sort of compromise. ",
                    "links": [
                        "https://forum.makerdao.com/t/chris-blec-delegate-platform/15544/23"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.527777777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#13",
                    "likes": "6",
                    "time": "13/07/2022-15:16:33",
                    "content": "The idea was never for 3 to remain uncapped. To take such an approach would A) fail to understand the nature of our liabilities and B) exhibit intellectual arrogance wrt to how landscapes change Of course we’re prepared to engage in good faith…that’s why we’re here. To look out ahead, understand where the snares are, and build an adaptive product that Maker is uniquely equipped to ship. In fact, I think we are entering a new era for the frame in which RWAs can be considered, from back foot to front foot. For a while now, RWF has been defending the protocol against adverse selection. When constantly fending off attacks, it is impossible to think, plan, and execute a long-term plan. A long-term plan is of course critical in any endeavor, but in crypto is it doubly advantageous. Maker’s edge is in its providence. Here, now, the balance of power is shifting. HVB and SocGen welcome a new era. Capital markets are weak and interest rates are rising. We finally have the opportunity to go on offense. We finally have the opportunity to craft a Real World Asset Protocol that embeds RWAs with the transparency and determinism that we’ve all grown so fond of. Maker will not only benefit from the tokenization of non-crypto assets, but it will unlock this process. To fail to recognize the instrumental role of RWAs in Maker’s trajectory is provincial and dogmatic. Equally, to fail to recognize the existential risk of doing RWAs the wrong way is blase and short-sighted. Let’s put our heads together, come to consensus on a vision for RWAs, and let this North star dictate our implementation on a month to month basis. Ready when you are ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.955922865013774
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#14",
                    "likes": "2",
                    "time": "13/07/2022-15:35:58",
                    "content": "Disagree with the categorisation. It’s simplistic and unreflective of underlying reality. HQLAs as suggested by @williamr should be proxies of money market instruments like crypto stables - just better. This is not an opinion, it’s an educated fact. I agree that a clear framework should be put in place sooner than later before we grow long-dated / less-liquid assets that (also) bear non-negligible credit risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#15",
                    "likes": "3",
                    "time": "13/07/2022-15:38:01",
                    "content": "    teej:  provincial and dogmatic   Poor risk management in any of these three groups can create existential risk to Maker.  As such all three groups should have well thought out limits based on their underlying risks.  Maker’s current lack of a reasonable (or any) risk policy is arguably gross negligence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#16",
                    "likes": "0",
                    "time": "13/07/2022-20:33:31",
                    "content": "    luca_pro:  HQLAs as suggested by @williamr should be proxies of money market instruments like crypto stables - just better. This is not an opinion, it’s an educated fact.   @luca_pro that was precisely the point I was making on the naturally “capped” nature of the types of RWAs that RWF reviews. I think we agree here that there is both credit and liquidity risks we need to be mindful of and manage on the rump up stage. Our activity is for the most part not dealing with asset types 1 under the HQLA definition of “unencumbered” assets. There might be instances where we work with type 2 assets for which SocGen covered bonds are an example. But even those should have a % allocation relative to the Tier 1 Capital and HQLAs. Generally speaking however, we are dealing with less liquid, longer dated (that is, longer than St treasuries) and “encumbered” assets so we need to be careful on the rumping up of exposure. It’s just good prudential practice. @ChrisBlec to your ask. Absolutely, happy to engage in a thoughtful discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.446969696969696
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#17",
                    "likes": "8",
                    "time": "14/07/2022-19:09:52",
                    "content": "RWF issues the following review of the Pando MIP6 proposal.  This proposed transaction has both notable strengths and concerns which are listed below for the benefit of both MKR holders, delegates and broader Community. Please keep in mind that this only my opinion. STRENGTHS:   The assets in this proposed financing are good green assets:  they are mainly 25 year consumer solar loans that promote cleaner household energy consumption.   Mosaic is an established consumer solar loan originator and servicer   The Mosaic consumer loan borrowers are solid prime credits (average FICO ~740)   Mosaic’s consumer solar loans have good historical performance since their first securitization in 2017   The proposed senior secured financing will be low risk:  Pando expects that the proposed loan will receive a BBB+ (investment grade) rating from Kroll Bond Rating Associates   There is an established financing market for consumer solar loans such as the collateral in this proposal with established structures and pricing.  Over $4 billion of this type of collateral was financed last year in the ABS market   The proposed structure emphasizes decentralization   CONCERNS:   This proposed asset financing has very long duration assets:  the asset pool is composed mainly of 25 year consumer solar loans.  The weighted average life of the proposed loan is expected to be 6 years with final cashflows being return in approximately 15 years.  This should be balanced against Maker liabilities - here being DAI which can be exchanged at will in the PSM.  @SebVentures and @Aes in Strategic Finance can speak on this asset liability issue in more detail, but the DAI liabilities are most likely significantly shorter than 5 years   This proposal offers Maker an estimated 2.9%-3.0% yield for a senior secured (BBB+ rated) loan backed by a pool of consumer solar loans.  A competitor to Mosaic, GoodLeap, issued a senior secured (A rated) bond (Goodyear 2022-3, A bond) backed by a pool of consumer solar loans that are quite similar to the pool proposed by Pando/Mosaic.  This bond was priced in the last week to yield 5.01% which is approximately 2% higher than the proposed Pando loan.  This is a significantly off-market yield for very similar risk.    We quantify this impact as follows:  assuming the Pando loan has a 6 year duration and its priced 2% below market, this implies that Maker would be financing this loan at approximately 12% below market terms.  If Maker makes the $210 million loan to Pando, this would be an approximately $25 million (12% x 210MM) off market cost to Maker.  If Maker did 4 such facilities on similar terms, Maker would be technically insolvent (4 x 25MM = 100MM which is current surplus).  If DAI had a liquidity run and Maker needed to sell such a loan to raise liquidity, this could present existential risk to DAI   The Bloomberg screen below summarizes the GoodLeap 2022-3 transaction pricing:  image1631×698 102 KB    Pando is not putting any of their own capital into this proposed transaction, lowering their alignment with Maker   Pando has proposed a %.75-.80% annual fee for themselves which would likely total over $10 million in total fees over the proposed transaction’s life.  This proposed fee appears high by market standards and we have not seen any empirical support for this fee level.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4066287878787875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#18",
                    "likes": "3",
                    "time": "14/07/2022-19:22:55",
                    "content": "Given the ratings of the GL 2022-3 tranches, wouldn’t the 5% comp even be conservative? More likely comp to be in the I-CRV + 300 or 6% range? The bond with a 5% yield is rated A by Kroll. We are considering a KBRA BBB+, which would land somewhere between the A (A/A) and B (BBB/BBB) bonds of GL 2022-3. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#19",
                    "likes": "0",
                    "time": "14/07/2022-20:09:14",
                    "content": "    ChrisBlec:  2 & 3 can grow as 1 grows.   Are you saying that the growth of USDC should be restrained by the size of crypto-loans? How would you achieve this, negative rates? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#20",
                    "likes": "2",
                    "time": "16/07/2022-14:03:16",
                    "content": "We have reviewed the concerns posted above, and we would like to highlight two high-level things before we address the specific concerns.  First, these concerns were shared with us prior to our posting the MIP6, and we provided detailed, written replies.  Pando asked for comments back, but unfortunately we did not receive any comment or acknowledgment to our replies.  As a result, Pando believes the Concerns shared above include factual inaccuracies in the understanding of the transaction (we will highlight those again below). Second, regarding pricing specifically, Mr. Rapp stated that he would speak to his contacts in the market about Solar Loans (not Bonds) to get a sense of comparable pricing.  We collectively agreed that comparables for Loans are difficult, as they are not publicly reported or traded - but he felt he could find some.  He also agreed to share his learnings with us ahead of posting his thoughts, so that RWF and Pando could come to mutual understanding and spare the broader Maker community unnecessary back-and-forth. Pando posted that agreement in Discord on July 6. Unfortunately, that agreement wasn’t followed, and as a result the assessment provided to the Community above includes some meaningful inaccuracies.  Foremost, pointing to a different asset type (Bond vs. Loan) without providing context that these are different asset types has created a confused message that we had all hoped to avoid.     Eumenes:  This proposed asset financing has very long duration assets: the asset pool is composed mainly of 25 year consumer solar loans. The weighted average life of the proposed loan is expected to be 6 years with final cashflows being return in approximately 15 years. This should be balanced against Maker liabilities - here being DAI which can be exchanged at will in the PSM. @SebVentures and @Aes in Strategic Finance can speak on this asset liability issue in more detail, but the DAI liabilities are most likely significantly shorter than 5 years   PANDO REPLY: While the Mosaic solar loans have tenors ranging from 5-30 years, the Pando loan from Maker will have a duration of ~14 years.  The shorter tenor loans and significant prepayment from ITC proceeds demonstrate the strong cash flows of the Mosaic loans, and instead of being a negative should be considered a positive aspect of this Transaction.  We understand and agree that Maker should balance its revenue opportunities with its balance sheet needs.  As far as a real world asset goes, this Pando transaction provides exceptionally strong cash flows against an admittedly longer tenor than Maker has previously entered into.  We addressed Seb’s liquidity concerns above, and he seemed to agree that our assets are ‘liquid’ from a RWA perspective - the reasons for which we address in detail further below.     Eumenes:  This proposal offers Maker an estimated 2.9%-3.0% yield for a senior secured (BBB+ rated) loan backed by a pool of consumer solar loans. A competitor to Mosaic, GoodLeap, issued a senior secured (A rated) bond (Goodyear 2022-3, A bond) backed by a pool of consumer solar loans that are quite similar to the pool proposed by Pando/Mosaic. This bond was priced in the last week to yield 5.01% which is approximately 2% higher than the proposed Pando loan. This is a significantly off-market yield for very similar risk. We quantify this impact as follows: assuming the Pando loan has a 6 year duration and its priced 2% below market, this implies that Maker would be financing this loan at approximately 12% below market terms. If Maker makes the $210 million loan to Pando, this would be an approximately $25 million (12% x 210MM) off market cost to Maker. If Maker did 4 such facilities on similar terms, Maker would be technically insolvent (4 x 25MM = 100MM which is current surplus). If DAI had a liquidity run and Maker needed to sell such a loan to raise liquidity, this could present existential risk to DAI   PANDO REPLY: * Had RWF previewed this comment with us, we could have explained that Mosaic’s Bonds typically price well below the Goodleap Bonds (please see below):  706×390 65.9 KB   Mosaic’s stability of performance, high credit quality, consistency of vintages, and longer history in the market, all contribute to a better reputation in the market than GoodLeap and other competitors. In addition, their collections and recognition of defaults policies are much more conservative than their peers (e.g., Mosaic charges off at 120 days in accordance with FFIEC regulations, whereas Goodleap uses off-market re-aging and charges off at 180 days (i.e., outside of regulatory preferences)). The Kroll ratings also speak to Goodleap experiencing servicing issues. Mosaic is the only solar issuer to have ever had a senior tranche rated AA- by a big three credit rating agency. They are differentiated from the broader marketplace, similar to the way that JPM prices better than Discover. The statement that this pricing is “off-market” is demonstrably incorrect. Pando will restate what has been told to RWF over a dozen times - it is not useful to conflate asset types (i.e., loans are meaningfully different than bonds). Loans are not traded like a bond - this is incredibly important. Since the private loan we are offering is not a public instrument, it will not trade. Maker principal begins to be returned immediately, greatly reducing Maker’s exposure over time. Here is why that is important: in the event Maker requires an early exit from the loan, a buyer will look at the remaining cash flows (not to a public comp) to determine an appropriate price to step into the remaining payment stream. This is almost exclusively done via the Discounted Cash Flow method (again, not by using a public bond comparable). Importantly, because of the early return of principal, Pando should be able to return all of Maker’s remaining principal even if the discount rate is significantly higher than the underlying blended rate of the loans. As an example, the proceeds from selling the remaining cash flows at the end of year five would be greater than the remaining Maker principal even at a discount rate of 14%-18%. Maker’s risk of insolvency from this transaction is insignificant given the structure of a potential loan sale.      Eumenes:  Pando is not putting any of their own capital into this proposed transaction, lowering their alignment with Maker   PANDO REPLY: Pando is not being paid a guaranteed, fixed fee (which RWF is aware of, as we have mentioned this several times). That is, our return is structured as a yield, not a fee, which is intentionally designed to add further protection to Maker.  Our return is entirely dependent on Maker receiving its return, which strongly aligns our interests.  We are substantially junior to Maker in the cash waterfall.  If Maker doesn’t get its return in any period, then multiple protections are available to keep Maker’s return on track. These include cash otherwise available to Pando, a debt service reserve account, and cash available to the junior debt position. Fees normally are paid ahead of debt service, but the Pando yield will not be. Pando does not get our return if Maker does not get its.  With that, Pando respectfully believes our interests are fully aligned.     Eumenes:  Pando has proposed a %.75-.80% annual fee for themselves which would likely total over $10 million in total fees over the proposed transaction’s life. This proposed fee appears high by market standards and we have not seen any empirical support for this fee level.   PANDO REPLY:  As noted above, and as told to RWF on several occasions, Pando is not receiving a fee.  There is a real and meaningful difference between a fee and an at-risk return.  Also, RWF asked us to document the work that Pando will undertake before and after the loan is issued to justify our return, which we did.  We did not receive any comments or concerns about those roles. Pando is confused as to why this continues to be called a “fee”, which is almost never at risk.  Said another way, Pando is willing to do the work to ensure this loan fully performs for the benefit of Maker, potentially putting our entire return at risk. That is a very different concept than a fee, and arguably makes our yield below market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.477151229273871
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#21",
                    "likes": "5",
                    "time": "17/07/2022-19:36:41",
                    "content": "    Dori:  Both RBC and Citi confirmed that the pricing offered by Mosaic is indeed either at par or higher than what they would expect to see currently in the market.   I was reading one of the Deloitte reports for Solar Mosaic LLC from earlier this year (2022) and they provided Deloitte a solar asset listing with 5,9992 solar assets, and Deloitte randomly selected ONLY 150 solar assets to inspect. There was another batch of 5,721 solar assets provided by Mosaic in another instance, and Deloitte only inspected six (6). What can MKR token owners expect differently from Pando/KBRA as an Arranger? Is “sample” testing of assets the norm in this industry? With the above  in mind, what other characteristic will Pando look for when performing due dilly on Mosaic? Will you also look at original loan amounts, monthly payments, repayment/settlement amounts, Choice target date, INSTALLER, Estimated annual production (kWh), remaining term, etc. – can you please provide more colour into your originator process? I see you posted a screeshot with the basics–lets dig in deeper.     Dori:  The Transaction falls within the “Category 1 – Financial Assets” categorization noted within the Global General Rating Methodology for Asset-Backed Securities   Will Mosaic need to file an ABS-15G with the SEC? (Asset-Backed Securitizer filling). Seems like Mosaic has filled quite a few in the last 5 years.     Peter_Pando:  Mosaic is the only solar issuer to have ever had a senior tranche rated AA- by a big three credit rating agency.   I believe Sunnova has also issued a AA- as well, but only by Kroll Bond Ratings  Can you please provide a link to support your claim ( I couldn’t find the Mosaic AA- by 3 credit agencies.)  image2856×544 108 KB  EDIT: just to make sure I understand Mosaic’s business model—these are TPOs, correct? Or are these loans securitized by leases/PPAs? Sorry about that. Can you provide data as to how big are lease/PPAs versus loans? Also, what percentage of the Pool will include borrowers with FICO scores above 700? Does Mosaic also include down to 650 FICO scores in the pool? And last but not least, MakerDAO is included in a senior tranche (Class A) and, one or more subordinated tranches (Class B, C, etc.), correct? Also, the Subordinated tranches receive interest only payments until principal for the Class A is amortized, correct? (Please provide the priority of payments). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.20496632996633
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#22",
                    "likes": "3",
                    "time": "18/07/2022-19:53:30",
                    "content": "@flipflopflapdelegate, these are really excellent questions, and we are excited to dig in with you. Please let us know if you have any follow-up questions to our replies. Thank you.     flipflopflapdelegate:  I was reading one of the Deloitte reports for Solar Mosaic LLC from earlier this year (2022) and they provided Deloitte a solar asset listing with 5,9992 solar assets, and Deloitte randomly selected ONLY 150 solar assets to inspect. There was another batch of 5,721 solar assets provided by Mosaic in another instance, and Deloitte only inspected six (6). What can MKR token owners expect differently from Pando/KBRA as an Arranger? Is “sample” testing of assets the norm in this industry? With the above  in mind, what other characteristic will Pando look for when performing due dilly on Mosaic? Will you also look at original loan amounts, monthly payments, repayment/settlement amounts, Choice target date, INSTALLER, Estimated annual production (kWh), remaining term, etc. – can you please provide more colour into your originator process? I see you posted a screeshot with the basics–lets dig in deeper.   PANDO REPLY:  There are two types of risk with this sort of transaction.  One is straightforward to manage, the other requires us to perform meaningful diligence. First, mitigating Mosaic corporate risk is quite simple given our use of a project finance structure. Pando will lend to a Mosaic Special Purpose Vehicle (SPV) borrower, which is bankruptcy remote from the Mosaic Parent.  Pando will have a security interest in that SPV and its assets and contracts.  Should Mosaic (Parent) disappear, Pando will step in to control the borrower, and customer payments/debt service will not be interrupted.  While Pando is comfortable with the long term prospects for Mosaic, this transaction is structured to protect both Pando and Maker should that prove otherwise. The more detailed diligence involves, among other things: understanding the customer cash flows against the project financial model; installation risk (including installer quality, performance guarantees, warranties, solar isolation, etc.); every customer’s FICO score, servicer and back-up servicer agreements, and collection policies, etc. In addition, Pando conducts a stress test of variables in the project model to understand the impact of delays or if expected actions don’t occur. Finally, we assess Mosaic’s ability to provide complete and timely reports on the performance of the portfolio and loan, including details on collections, the reserve account, payments of fees, prepayments, delinquencies, and more. Pando’s underwriting model provides a detailed understanding and evaluation of more than fifty project-specific topics across eleven categories, using a weighted output from “Strong” to “Materially Deficient”.  We would be happy to host a call with you and others to walk folks through in detail how our underwriting model works. Regarding the installers/contractors that Mosaic uses, Pando has reviewed the Mosaic underwriting policy for those parties.  We are comfortable that the policy is strong and in our experience exceeds others in the industry. For the Kroll rating, KBRA will issue its rating based on all of the loans that are in the pool (including reviewing the FICO score for every loan in the pool), with a representation from Mosaic that the loans in that pool are consistent with the loan agreement(s) that Kroll has reviewed. The Deloitte report you mentioned we believe is tied to a prior ABS-15G filing, not the associated Kroll rating.     flipflopflapdelegate:  Will Mosaic need to file an ABS-15G with the SEC? (Asset-Backed Securitizer filling). Seems like Mosaic has filled quite a few in the last 5 years.   PANDO REPLY: As the transaction proposed by Pando is a loan, not a bond, Mosaic will not file an ABS-15G.     flipflopflapdelegate:  I believe Sunnova has also issued a AA- as well, but only by Kroll Bond Ratings  Can you please provide a link to support your claim ( I couldn’t find the Mosaic AA- by 3 credit agencies.)   PANDO REPLY: As you rightly point out, Sunnova’s AA- was from Kroll (not a ‘big three’ rating firm). The Mosaic AA- rating was from Fitch for their 2022-1 offering, which was posted on March 10, 2022 (https://www.fitchratings.com/research/structured-finance/fitch-assigns-final-ratings-to-mosaic-2022-1-class-a-notes-17-03-2022).     flipflopflapdelegate:  just to make sure I understand Mosaic’s business model—these are TPOs, correct? Or are these loans securitized by leases/PPAs? Sorry about that. Can you provide data as to how big are lease/PPAs versus loans?   PANDO REPLY:  Mosaic’s solar model is focused only on customers loans, not leases or PPA’s.  There are multiple reasons for this, but foremost is that by sticking with loans then Mosaic does not need to find a tax equity investor.  When a customer enters into a loan agreement with Mosaic, that customer is able to take the Investment Tax Credit.  Whereas under a lease or PPA, the originator must use the credit themselves or needs to find a 3rd party tax equity investor. Very few originators have the capacity to absorb the tax credits themselves, and the market for 3rd party tax equity remains relatively constrained.  Another benefit to Pando/Maker in the loan-only structure is that the homeowner is responsible for ongoing maintenance of the solar equipment.     flipflopflapdelegate:  Also, what percentage of the Pool will include borrowers with FICO scores above 700? Does Mosaic also include down to 650 FICO scores in the pool?   PANDO REPLY: Among the many eligibility criteria for the Pando/Maker facility is a weighted average FICO score of 700 across the pool of homeowners. Any individual homeowner must have a FICO score of 600 or greater. We will have a better sense of the FICO distribution once we have the BBB+ rating from KBRA, but it is likely that only a small percentage of borrowers will be below 650 given the overall Investment Grade rating.     flipflopflapdelegate:  And last but not least, MakerDAO is included in a senior tranche (Class A) and, one or more subordinated tranches (Class B, C, etc.), correct? Also, the Subordinated tranches receive interest only payments until principal for the Class A is amortized, correct? (Please provide the priority of payments).   PANDO REPLY: Keep in mind this is a loan, not a bond, therefore there is not a Class A or B in the structure. Rather, we will be the Senior lender in the capital structure for the loan. There is a Junior piece, which is subordinated. Principal and interest for the Senior lender are paid before the Junior (residual) layer. Please see a detailed waterfall below:  Payment Agent Fee (Wilmington Trust)  0.05%-0.10%   Servicing Fee (Mosaic)  0.35%   Interest on Mosaic-to-Pando Note, including any accrued interest  Interest on Pando-to-Maker Loan, including any accrued interest, paid directly to Maker from Pando SPV by Wilmington Trust (Maker-owed interest is #3 in Waterfall).   Principal on Mosaic-to-Pando Note (amount necessary to get remaining balance to scheduled amount)  Principal on Pando-to-Maker Loan (amount necessary to get remaining balance to scheduled amount), paid directly to Maker from Pando SPV by Wilmington Trust (Maker-owed Principal payments are #4 in Waterfall)   Reserve Account top-up (if necessary) Accrued but unpaid Payment Agent Fees (if any) Pando expense reimbursements (if any, likely associated with an exercise of Lender remedies) Accrued but unpaid Servicer Fees (if any) Payments to Pando (net from interest paid on Mosaic-to-Pando Note after all other steps in waterfall) Remainder to Junior (Residual) Holder from entire Pool cash flows (either Maker, Pando, or 3rd party)  That Junior piece of the transaction is open to Maker, if you would like to increase your return on part of the transaction by also taking the first loss position. However, as that piece is not rated, we had assumed Maker might not be interested in that piece. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.595961199294532
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dori",
                    "index": "#23",
                    "likes": "0",
                    "time": "18/07/2022-19:55:41",
                    "content": "Hi all, Thanks for the good conversation so far. We are hosting a Community Call to provide more time for a dialogue with the community and hopefully to give you a chance to learn more about this proposal. Info on the call here:     Collateral Onboarding Call #46 | Pando Investment Grade Climate Assets Collateral Meetings   Collateral Onboarding Call #46 | Pando Investment Grade Climate Assets  Application Summary Pando Climate Co. has published a MIP6 application to introduce rated solar loans from Mosaic Solar, Inc as collateral in the Maker Protocol. This application is initially requesting a $220 million debt ceiling.  Pando is built to unleash financing for the age of climate solutions, by tokenizing real world climate assets and offers them as investments. Pando in turn enables protocols and DAO’s to invest …     ",
                    "links": [
                        "https://www.pandoclimate.co/",
                        "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394",
                        "https://www.pandoclimate.co/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#24",
                    "likes": "1",
                    "time": "18/07/2022-21:39:11",
                    "content": "    Peter_Pando:  Mosaic’s solar model is focused only on customers loans, not leases or PPA’s. There are multiple reasons for this, but foremost is that by sticking with loans then Mosaic does not need to find a tax equity investor. When a customer enters into a loan agreement with Mosaic, that customer is able to take the Investment Tax Credit. Whereas under a lease or PPA, the originator must use the credit themselves or needs to find a 3rd party tax equity investor. Very few originators have the capacity to absorb the tax credits themselves, and the market for 3rd party tax equity remains relatively constrained. Another benefit to Pando/Maker in the loan-only structure is that the homeowner is responsible for ongoing maintenance of the solar equipment.   Thank you for providing the answers to my questions. For sure, this is an interesting securitization market for distributed solar assets that also has quite the dedicated community as we recently saw a big turnout at the Mosaic conference in Arizona. Looked like a lot of fun and a dedicated community. With regards to the “Tax Equity” structures—I was reading that they can be fairly complex but usually rely on a structures such as a “partnership flip” where as the sponsor receives the majority of the cash flows. If I understood your explanation above, Mosaic is not doing “partnership flips”, correct? And what type of ITC extension do you see happening after 2023? If any. Hopefully someone is doing some lobbying up in DC  Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.386111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#25",
                    "likes": "1",
                    "time": "18/07/2022-22:05:26",
                    "content": "Correct, Partnership Flip is probably the most common tax equity structure, but outside tax equity is only used when a solar system is not owned by the end customer.  The other common structures are a Sale-Lease-Back and an Inverted Lease.  The Flip is more simple and presents the least scrutiny from an IRS perspective.  About 10 years ago, @MorganPando and I (along with two other partners) raised one of the only tax equity funds for non-traditional tax equity investors.  Was a really fun experience - and if you ever need help sleeping, ask Morgan to walk you through HLBV accounting for tax equity!  Fortunately, with this transaction, the homeowner simply claims the ITC on their individual tax return, so none of the above structures are used.  This greatly simplifies the transaction. And yes, I have complete confidence that Solar Energy Industry Association is very busy for another ITC extension!  Thanks again, and keep the questions coming! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.484375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#26",
                    "likes": "3",
                    "time": "18/07/2022-22:13:41",
                    "content": "As I have stated multiple times before I think Pando and the general idea of using overcollateralized solar loans as Dai collateral is a huge opportunity to pay off on clean money and showcase the reason why the mainstream and regulators should see blockchain and defi as something that’s useful to them. Compared to something like HVB, which recently passed with lots of support and momentum, I think there is much stronger argument for why we should do a deal like this that provides us unique and significant intangible value, rather than just use government bonds only which are superior RWA collateral for a stablecoin in all aspects. The duration risk of this deal is obviously important to keep in mind, but it is something we would always have to accept, at least for now, if we want to actually fund clean finance projects. At this point I think the main issue that needs to be cleared up is the pricing. My understanding is that major institutions already buy these bonds, which to me sounds like the claim around pricing being off is that mosaic should be specifically pricing a bond for us in a way that is unfair, and on terms that are worse than they offer to any other buyers. If that’s not the case, why would any other institutions then buy these bonds? Would be interesting if Pando could comment on this. @BlockTower told me they had some input and concerns regarding the pricing, which they would be willing to share in public. I think it will be useful to just have as much discussion as possible and get as much information as possible up front. Would also be interested in geting input from any other potential or active arrangers as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5688131313131315
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#27",
                    "likes": "6",
                    "time": "19/07/2022-02:25:22",
                    "content": "@rune this is not a bond deal but a structured loan deal - generally loans are priced at higher credit spreads than the bond markets - due to their lower liquidity - and usually for bank participated project/structured finance loans there are also upfront fees paid to the lender. Market pricing for these types of loans would generally be available from proprietary databases that require a subscription. As a former tradfi lender, speaking generally - re Clean Money financings, I would think it would be a lot more preferable to do these long duration deals alongside a project finance bank/lender (ie. as a participant a la HVB) who has an aligned interest and real skin in the game. I am sure with the appropriate sourcing strategy by RWF we could identify numerous well structured deal opportunities - with the comfort of knowing there is liquidity.  I think this approach should be seriously considered as the ongoing monitoring of these transactions and potential specialized decision making that is required are just not scalable. I appreciate that the intention is to brand Maker as doing “Clean Money” deals but we need to be careful that the intended consequences are not negative. This article may be a worth whilst read  as to the consequences of cheap financing and tax incentives for solar power The Dark Side of Solar Power.  TLDR; Solar panels in the US are likely to create a major garbage/landfill crisis. With respect to this transaction it will be good to hear  @Peter_Pando views on how they are addressing the potential recycling/landfill crisis detailed in the article ? As I wont be able to make the call tomorrow, clarification of the following would be helpful     Dori:  Conflicts of Interest: Pando is unaware of any real or potential conflicts of interest with Maker or any Maker-related affiliate. Pando hereby discloses that Dan Rosen, co-Founder of Pando, currently is Chairman of the Mosaic Board of Directors.   Wondering why we should not be concerned about this conflict - presumably there may be times where the Servicer (Mosaic) may not have their objectives aligned with Pando SPV … I would also be useful to have some clarity as to what the Pando SPV will have as direct security - as you refer to Mosaic SPV and it is unclear from the description what assets will be included there, ie security interest in a pool or a security interest in each loan/receivable. It would be helpful if the term sheet for the Pando SPV - referred to below could be made available - so we can have a clearer view of the transaction and the collateral.     Dori:  Pando has a signed term sheet with Mosaic, and we have been waiting for initial indications from Maker to proceed with the Mosaic-Pando Loan Agreement.   Also, some clarity about the proposed funding of the $220mm being requested against loans of $250 mm - will the Pando SPV be funded with the remaining $30 million is that the junior cover ?  perhaps you have a source and use of funds cash flow for the funding of the SPV ? and term sheet for the junior cover ? Just to make it clear, I am asking these questions from the perspective of a Maker Token holder who happens to have prior experience lender to the energy sector and not in my capacity as a CES core contributor. ",
                    "links": [
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/40"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.675986842105263
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#28",
                    "likes": "3",
                    "time": "19/07/2022-06:14:36",
                    "content": "    dbkcan:  TLDR; Solar panels in the US are likely to create a major garbage/landfill crisis.   To be fair—it’s a worldwide event that is being looked at by many across the globe — not just a problem for the United States. There are orgs trying to help — and there are Gov agencies aware of the problem. Here’s a good read published 72 hours ago: https://www.latimes.com/business/story/2022-07-14/california-rooftop-solar-pv-panels-recycling-danger?_amp=true ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#29",
                    "likes": "2",
                    "time": "19/07/2022-07:14:43",
                    "content": "    Peter_Pando:  We addressed Seb’s liquidity concerns above, and he seemed to agree that our assets are ‘liquid’ from a RWA perspective - the reasons for which we address in detail further below.   I recognize that if you can sell the asset when MakerDAO need to, it reduces/removes the maturity mismatch and would be a key feature for this deal (against other that are more illiquid). Evaluating such possibility and estimating the selling discount would be a RWF task as I don’t know anything about those kind of assets (the ALM view remains high-level). The interest rate risk remains but would be taken in account in the Capital at Risk (also defined by RWF). This risk could maybe be hedged but unclear what the cost and/risk would be (would be great to have a on-chain market for interest rate swaps). A high Capital at Risk combined with a low Return over Asset will lead to a low Return of Equity. But obviously financial metrics don’t take in account Clean Money initiative and it is up to MKR holder to decide. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.88525641025641
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#30",
                    "likes": "7",
                    "time": "19/07/2022-09:26:55",
                    "content": "Many, within the community, have asked for my opinion regarding Pando’s MIP6 for Investment Grade Climate Assets Collateral Onboarding submitted by @Dori. Without any intention to make of this a comprehensive overview (I am neither tasked nor compensated to provide such a deal review) I would like to stress a few points based on my professional experience. Those represent uniquely my personal opinions as member of the community. I would like to focus on the bond vs. loan pricing point that has been debated at length. I have read many comments on pricing coming from qualified community members - including @Eumenes, @teej, and @dbkcan - I am giving more weight to those coming from Eric and TJ given their direct mandate as members of RWF. Those comments stress the need to benchmark Pando’s proposed deal with available comparables in the public market. Although relevant, I do not think that those public comps are the most relevant decision making levers for MKR holders. When assessing a loan and its pricing, a bank’s Credit Committee typically analyses the opportunity through internal metrics of return. Although external benchmarks are useful, it is ultimately the projected (e.g.) Return on Equity for the lender that is the most relevant data point for decision making. The projected Return on Equity is achieved using as inputs the agreed pricing, but also internal estimates about cost and risk items. As an example, those parameters would include: i) expected loss on the underlying collateral, ii) cost of liquidity, iii) risk capital absorption, iv) cost of capital, v) infrastructural costs and overheads. Without a holistic overview of what is the projected net return for Maker, discussions on pricing and spreads are not entirely relevant. Especially considering the totally different characteristics of the two instruments. To stress the point further, also considering @Eumenes’ concerns on mark-to-market and Maker’s de facto insolvency vs. the existing Surplus Buffer, I would like to confirm that in bank accounting, while a bond might be typically booked as an Available For Sale security (with mark-to-market hitting a dedicated equity reserve that is indeed deducted from regulatory capital), a loan would be simply part of the loan book and would not be impaired unless significant credit quality events happen. A loan, in addition, benefits from completely different accounting and regulatory treatments. This is why not necessarily a loan would trade at discount vs. a bond because of its illiquid nature. Obviously, in the case the loans/ collaterals would need to be sold for liquidity purposes, Maker should expect to receive a significant haircut on the book. It is, however, absolutely not prudent to engage in such a long-dated transaction considering the possibility to sell the book outright a central scenario. This should be solely an emergency and ALM/ Strategic Finance/ @SebVentures should provide comfort on size and duration without considering a normal scenario that of collateral disposal. This is an illiquid position, and as such it should be treated. Ultimately, as a Maker community member, I would expect to receive at least the following information to help me take a decision:  Guidance on available size for duration buckets for those RWF deals - most probabily coming from SF Guidance on required / target Return on Equity on those transactions - I guess under SF’s leadership Framework that would allow RWF and SF to achieve an estimate of the Return on Equity for each deal - including the most relevant components Estimate of the Return on Equity of a single deal based on the current proposed pricing Detail on cash flows and other characteristics provided by the counterparty  Although I am generally in agreement that Pando’s proposal might not be optimal for Maker, I do not think that Maker’s Core Units are providing the necessary frameworks at this stage to help MKR holders assess the opportunity. Personally, it is the lack of junior capital that is my main concern - given that foregone interests in case of bad performance resemble more the cost of a call option rather than junior equity in a deal, but this is a different conversation. For the avoidance of the doubt, I am not in disagreement with what has been pointed out by the CU members, but I believe that the lack of framework to assess opportunities one against the other is making impossible for MKR holders to take an informed decision on this (and other) MIPs. As @rune suggested, I would be extremely interested in listening to @BlockTower’s opinion; the perspective of a private credit investor should resemble that of a private lender. I am abstaining from providing feedback on any other characteristic of the collateral but wanted to share my view on the bond vs. loan pricing point that has been debated at length so far. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.412579957356077
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#31",
                    "likes": "0",
                    "time": "19/07/2022-14:10:04",
                    "content": "@luca_pro, thank you for the post, and we agree with your differentiation between loans and bonds. Regarding your concern about Junior (first-loss) capital in this transaction, there indeed is a junior position in the transaction.  We have described that above, but are happy to provide further detail if interested. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#33",
                    "likes": "2",
                    "time": "19/07/2022-14:53:18",
                    "content": "Is there an amortization schedule for this? Apologies if we missed the link above! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MorganPando",
                    "index": "#34",
                    "likes": "1",
                    "time": "19/07/2022-18:25:25",
                    "content": "Hi @GFXlabs - we had shared an indicative (it won’t be final before we know the actual pool of solar loans that make up the transaction) amortization earlier, but here is a link to an annual summary for your review. Please let us know if you have any questions or would like to talk through it.  docs.google.com    Pando Summary Amortization Sheet1   SUMMARY AMORTIZATION TABLE FOR PANDO INVESTMENT GRADE CLIMATE ASSETS (MOSAIC) INDICATIVE: Terms will not be finalized until the pool of Solar Loans is...      ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1TqMh0G5MvavNifCaCBr7D1S3ly12KLyrtSNfefm8zEg/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1TqMh0G5MvavNifCaCBr7D1S3ly12KLyrtSNfefm8zEg/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#35",
                    "likes": "1",
                    "time": "19/07/2022-19:33:09",
                    "content": "Am I correct in interpreting that Pando net is the 75-80bps fee reference below?     Dori:     Is this fee of 75-80bps calc’d off the original face value of the loan or off the principal outstanding? The implied yield looks light (2.39% to Maker) compared to the 2.9% discussed above–was this updated? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JackintheBlox",
                    "index": "#36",
                    "likes": "8",
                    "time": "19/07/2022-20:50:30",
                    "content": "Thank you for the thoughtful MIP6, Pando! It’s great to see a team with such deep experience working to partner with Maker and onboard high-quality assets. Below, I have listed a set of Merits and Concerns that we (BlockTower, collectively) have compiled after reviewing this investment. Merits High quality solar loans – Mosaic has a deep underwriting history with studied performance data across a host of market conditions. In addition, Mosaic targets a high-quality segment of the consumer credit universe. Borrowers are homeowners with FICO scores deep in the 700s. Available pricing data – Mosaic’s utilization of the securitization market has, amongst other benefits, introduced a moderate level of pricing transparency to this space and increased broader familiarity to the asset class. Pricing transparency is helpful for underwriting the merits of this investment and broader familiarity helps to facilitate liquidity in the space. BBB+ Kroll Rating – Self-explanatory, an investment grade rating is representative of a pool that is likely to meet interest and principal payments. Reliable Servicing – Mosaic is a mature business with deep industry experience. The corporate entity is unlikely to default and thus likely to be able to service these loans through maturity. In addition, there are capable backup servicers available should Mosaic default. Concerns Long Duration – This investment has a term maturity of 14 years and a WAL of 6 years (to assumed prepayment assumptions). Should underlying credit performance deteriorate, there is no imminent solution available to unwind the structure. Additionally, all else equal, long duration assets take greater mark-to-market losses in periods of volatility than do short duration assets. If a liquidation is necessary, we need to consider the likelihood that the catalyst for liquidation will correspond to a broader credit sell-off that impairs Maker’s ultimate recovery. Lack of Junior Capital – While we understand that Pando is placing its fees below Maker in this structure, we do not believe this is a true substitute for traditional first loss capital. If the Maker position takes a loss, Pando will simply lose out on future fee income. A true first loss capital provider will lose out on future earnings as well as investment capital put at risk. Additionally, in the event of a liquidation, a first loss capital provider has a clear incentive to maximize recovery on the underlying pool; a first loss capital provider will be seeking to maximize recovery for both itself and for Maker. It’s unclear what Pando’s incentive is to maximize recovery in a liquidation scenario. Pando team, I have listed a few questions below. We would greatly appreciate your thoughts and considerations here. Questions Is it possible to add in performance triggers that will allow Maker to initiate a liquidation or acceleration? [This is particularly important with the lack of junior capital, given there is no junior noteholder to initiate a liquidation on behalf of Maker]. Perhaps some form of cumulative net-loss trigger that is tripped when realized losses escalate? In the event of a liquidation, would Pando sell the underlying loans outright or would Pando seek to sell just Maker’s senior loan? In other words, would Pando’s fees and Mosaic’s residual interest survive a liquidation? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.687209302325581
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JackintheBlox",
                    "index": "#37",
                    "likes": "5",
                    "time": "19/07/2022-22:33:10",
                    "content": "Additionally, to address concerns around pricing directly, it is our opinion that the securitization/whole loan markets are the best available proxy for pricing. There are many market participants (banks, asset managers, credit unions, etc.) who buy whole loans via forward flow arrangements with the intention of securitizing once loans reach a critical mass. As a rule, whole loans trade at a discount to ABS securitizations because they are less liquid and do not have locked in term financing. Based on an ongoing dialogue with Citi’s ABS and whole loan desks, solar loans generically trade at a 5% yield today. Pando’s proposal indicates that the yield on the Mosaic note will be roughly 3%. Clearly this is off market for whole loans. Thus, it is worth thinking about whether the added subordination that Pando is proposing justifies that 2% gap vs. whole loan pricing. In our opinion, it is tough to justify this gap when the most senior piece of solar securitizations, which has more downside protection, yields 5%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.201388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MorganPando",
                    "index": "#38",
                    "likes": "2",
                    "time": "19/07/2022-22:56:38",
                    "content": "@pipko Thanks for pointing out the discrepancy. Given the indicative nature of the model, the allocations and flows are still being settled. Having said that, we are offering a [2.9%] yield to Maker and we will ensure that the final pool from Mosaic/Kroll generates that return. To reflect that understanding I’ve updated the amortization table to better show the cash flows. Please note that the underlying model is monthly, which does add about 25bps to the yield from what can be calculated from this annual summary. For ease, here’s a link to the summary amortization again:   docs.google.com    Pando Summary Amortization Sheet1   SUMMARY AMORTIZATION TABLE FOR PANDO INVESTMENT GRADE CLIMATE ASSETS (MOSAIC) INDICATIVE: Terms will not be finalized until the pool of Solar Loans is final TOTALS,$66,589,393,$6,416,746,$56,600,983,$40,548,058,$15,052,925,$20,837,876 YIELD...      ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1TqMh0G5MvavNifCaCBr7D1S3ly12KLyrtSNfefm8zEg/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1TqMh0G5MvavNifCaCBr7D1S3ly12KLyrtSNfefm8zEg/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#39",
                    "likes": "0",
                    "time": "20/07/2022-08:07:34",
                    "content": "@Peter_Pando Thank you for your comments on the various questions raised by the RWF and other members of the community. I won’t dwell on the same points under discussion namely duration, junior capital and pricing. A couple of questions on commentary provided:     Peter_Pando:  Mosaic’s stability of performance, high credit quality, consistency of vintages, and longer history in the market, all contribute to a better reputation in the market than GoodLeap and other competitors.   What procedures will be used to subject the facility to asset quality tests on an ongoing basis? In case of asset quality deterioration, which procedures (if any) would Pando be able to undertake to protect Maker’s loan exposure? Could you please share results of stress tests or sensitivity analysis done on the facility?     Peter_Pando:  PANDO REPLY: While the Mosaic solar loans have tenors ranging from 5-30 years, the Pando loan from Maker will have a duration of ~14 years   To limit exposure and maturity risks, would the structure consider the use of tools such as clean-up call options to repurchase or extinguish the position at pre-defined levels/parameters?     Dori:  Mosaic will pool the solar loans into one tranche that is highly structured and rated by a US Credit Rating agency, KBRA. The solar loans are packaged and structured so that the total pool of loans when taken together will be rated as Investment Grade.   Can you provide a view of the applicable calculation in risk-weights in the single-tranche securitisation exposure and how you expect weights to be affected by underlying exposure maturities within the tranche? Along the same lines, if the underlying collateral pool has different risk-weights could you provide the distribution of weights across the pool?     Peter_Pando:  We will have a better sense of the FICO distribution once we have the BBB+ rating from KBRA, but it is likely that only a small percentage of borrowers will be below 650 given the overall Investment Grade rating.   Assuming ratings assumptions on the pool will be done at pool inception. How is Pando/Mosaic planning to navigate loss and cash-flow analysis as well as sensitivity of ratings to changes in the underlying ratings assumptions on an ongoing basis? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.320370370370371
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#40",
                    "likes": "0",
                    "time": "21/07/2022-17:37:09",
                    "content": "@JackintheBlox Thank you very much for the comments and questions.  We have replies below, and we look forward to continuing the dialogue.     JackintheBlox:  Long Duration – This investment has a term maturity of 14 years and a WAL of 6 years (to assumed prepayment assumptions). Should underlying credit performance deteriorate, there is no imminent solution available to unwind the structure. Additionally, all else equal, long duration assets take greater mark-to-market losses in periods of volatility than do short duration assets. If a liquidation is necessary, we need to consider the likelihood that the catalyst for liquidation will correspond to a broader credit sell-off that impairs Maker’s ultimate recovery.   We fully understand and appreciate that 14 years is a longer tenor than Maker has typically undertaken, but believe that a performing asset (like our proposed solar loans) will not be judged as critically in a broader credit downturn. In fact, we often see a flight to quality, and we believe our assets would be attractive in such a scenario. The primary factor in an effort to sell down the loan will be the timeframe in which we have to operate - within reason, the quicker the sale, the more likely we will need to accept a lower price.     JackintheBlox:  Lack of Junior Capital – While we understand that Pando is placing its fees below Maker in this structure, we do not believe this is a true substitute for traditional first loss capital. If the Maker position takes a loss, Pando will simply lose out on future fee income. A true first loss capital provider will lose out on future earnings as well as investment capital put at risk. Additionally, in the event of a liquidation, a first loss capital provider has a clear incentive to maximize recovery on the underlying pool; a first loss capital provider will be seeking to maximize recovery for both itself and for Maker. It’s unclear what Pando’s incentive is to maximize recovery in a liquidation scenario   We believe there has been a misunderstanding on our MIP6 and perhaps we haven’t communicated this well in the past: there is a substantial junior position in the asset pool, in addition to a pre-funded Debt Service Reserve Account of 1% of the pool (~$2.5M). This transaction will include a first loss capital provider (whose incentive will be to maximize recovery on the entire pool of cash flows, including Maker’s senior position) for the balance of capital necessary to finance the entire Pool of assets (approximately $37M; this position is typically sold at a discount). And, Pando’s net yield is available to service Maker’s payments in the event the junior position is eroded. To put this into perspective, Kroll typically triples the number of defaults for a rating as part of their modeling; in this case, BBB+ asset pools typically default at a rate of 14 customers annually, and Kroll models 50 defaults annually. This proposal’s junior/first-loss (residual) layer and Pando’s net yield combined can absorb more than 1,200 concurrent customer defaults. The DSRA can absorb an additional ~750 defaults. All from an asset pool of approximately 5,000 homeowner loans. Further, Pando will be legally bound to act on behalf of Maker’s best interests through our obligations under the terms of the loan agreement and ancillary agreements - something we take seriously and have performed professionally for decades. This obligation includes any and all liquidation or remedy scenarios. And, obviously, Pando is highly incentivized to make certain the pool continues to perform in order to protect our net yield.     JackintheBlox:  Is it possible to add in performance triggers that will allow Maker to initiate a liquidation or acceleration? [This is particularly important with the lack of junior capital, given there is no junior noteholder to initiate a liquidation on behalf of Maker]. Perhaps some form of cumulative net-loss trigger that is tripped when realized losses escalate?   Yes, we are conceptually open to this structure. The pool pays monthly so we will have good and real time insight into any abnormal disruptions to portfolio performance. Given the protections available to Maker, we would want to ensure that the triggers are reasonable to avoid an unnecessary acceleration or EOD. One way to accomplish this might be to structure an event of default that is tied to concurrent defaults well over and above Kroll’s base case that also considers Mosaic’s recovery ability on defaulted assets.     JackintheBlox:  In the event of a liquidation, would Pando sell the underlying loans outright or would Pando seek to sell just Maker’s senior loan? In other words, would Pando’s fees and Mosaic’s residual interest survive a liquidation?   While this is likely somewhat scenario-dependent, our assumption is that we would sell Pando’s note to ensure there is enough proceeds to pay off the entirety of Maker’s remaining principal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.449510168650794
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#41",
                    "likes": "0",
                    "time": "21/07/2022-17:38:55",
                    "content": "@JackintheBlox thanks also for this comment. Regarding pricing, we have spoken with Citi as well, a Director of Global Markets who has insight into the whole loan desk.  We would be very open to speaking directly with Blocktower about this topic (and we can jointly share feedback with the community). That said, our view, and as we have said to RWF, is that the pricing conversation continues to feel really premature (especially given the wild swings in Treasuries and FOMC activities).  We have purposefully kept our pricing bracketed, as we really don’t know the best pricing until we know the asset pool and market conditions at the time.  We are fine to keep talking about pricing, but that topic feels far more relevant the closer we get to finalizing the pool and closing the transaction.  Nothing about pricing will change our proposed structure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.220238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#42",
                    "likes": "2",
                    "time": "21/07/2022-17:53:12",
                    "content": "Thank you, @williamr  Replies below.     williamr:  What procedures will be used to subject the facility to asset quality tests on an ongoing basis?   The best performance test will be a detailed review of the monthly service reports provided by Mosaic.  The reports include data on the payment waterfall, collections, delinquencies, principal repayment, reserve account, prepayments, etc. Examining variations from plan in the monthly cash flows provides the clearest indication of any potentially negative trends.  Receiving this data monthly is much more useful than quarterly or longer.     williamr:  In case of asset quality deterioration, which procedures (if any) would Pando be able to undertake to protect Maker’s loan exposure?   As we have noted, Maker is protected using very common project finance structures. Ongoing  “asset quality” in this instance is measured against customer cash flows (the ‘asset’ against which Maker is lending).  The main protections for Maker’s debt service (from deteriorating cash flows) are the very significant protections in the cash waterfall.  There is a substantial junior position (representing the cash flows from more than $37M of installed assets) in the asset pool, in addition to a pre-funded Debt Service Reserve Account of 1% of the pool (~$2.5M). Finally, Pando’s net yield is available to service Maker’s payments in the event the junior position is eroded. To put this into perspective, Kroll typically triples the number of defaults for a rating as part of their modeling; in this case, BBB+ asset pools typically default at a rate of 14 customers annually and Kroll models 50 defaults annually. The junior (residual) layer and Pando’s net yield combined can absorb more than 1,200 concurrent customer defaults. The reserve account can absorb an additional ~750 defaults. All from an asset pool of approximately 5,000 homeowner loans. Pando is highly incentivized to make certain the pool continues to perform in order to protect our net yield.  Further, Pando will be legally bound to act on behalf of Maker’s best interests through our obligations under the terms of the loan agreement and ancillary agreements - something we take seriously and have performed professionally for decades. This includes any and all liquidation or remedy scenarios.     williamr:  Could you please share results of stress tests or sensitivity analysis done on the facility?   As the customer contracts for the facility are not yet in place, the stress test will be conducted later.  Downside scenarios will be evaluated by Kroll, Pando, and Mosaic.     williamr:  To limit exposure and maturity risks, would the structure consider the use of tools such as clean-up call options to repurchase or extinguish the position at pre-defined levels/parameters?   We are happy to discuss options, but we do not see value to Maker in artificially capping your return.     williamr:  Can you provide a view of the applicable calculation in risk-weights in the single-tranche securitisation exposure and how you expect weights to be affected by underlying exposure maturities within the tranche?   We can look at Mosaic’s recent bond offerings for an indication of the various risk weightings in our pool (e.g., geography, tenor, FICO, etc.), but we of course won’t know specifically what we have until we have the exact pool of assets we’re lending against. Importantly, the criteria and limits will be within well established parameters for the resi solar industry.     williamr:  Along the same lines, if the underlying collateral pool has different risk-weights could you provide the distribution of weights across the pool?   As mentioned, weighting information will be available once we are further along in the process and the actual customer contracts comprising the loan pool are selected. Ratings are point-in-time, and are not ongoing.  Refreshing a rating would be functionally prohibitive and is not the industry standard.  Rather, Mosaic (as servicer) and Pando (as lender/borrower) are incentivized to monitor customer performance on a monthly basis to identify negative trends.  Given regular reporting and the robust cash protections for Maker as Senior Lender, Pando is very confident that any negative trends will become evident well in advance of any impact to Maker. We’re hoping it’s helpful, but we wanted to provide some general thoughts/feedback at this time. Our request regarding the greenlight vote is for Maker to view our proposal in its entirety - we have proposed a transaction that meets all of the criteria laid out in RWF’s investment grade methodology: publicly rated, investment grade assets; junior (first loss) capital, established counterparties; no technology risk; strong cash flows; very robust protections for Maker, etc. Pricing is always a negotiation, and we emphasize again that given market volatility and the likely timing to close this transaction that we address that among Maker, Pando, and Mosaic (and 3rd parties as helpful) nearer to when we close the transaction.  We appreciate the thoughtful replies and back/forth - and we look forward to continuing the dialogue with the Community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.717132034632035
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dori",
                    "index": "#43",
                    "likes": "3",
                    "time": "29/07/2022-21:30:04",
                    "content": "Maker Community, As this proposal moves toward a Greenlight vote, we wanted to share a high-level summary of the proposal and summarize replies to previously mentioned concerns. Our understanding is that a Greenlight vote is an expression of interest from the community; we know that after a positive Greenlight vote there will still be details to work out and final terms to negotiate. We remain available to answer any new or previously raised concerns prior to or during the Greenlight vote.   The proposed project is to lend against~$210M in residential solar rooftop installations, representing approximately 5,000 homes, out of a pool of approximately $250M of solar installations.   Pando has structured the project to address the key points within the RWF investment grade methodology, including:     There is significant junior (First Loss) capital in the project, in addition to very strong cash protections for Maker’s debt. Between the First Loss capital, a reserve account and Pando’s yield, a total of 1,900 homeowners (~38%) would need to default to impact Maker’s return.   The loan will receive an Investment Grade rating (BBB+) from a leading Rating Agency.     The project provides Maker with stable, predictable cash flows immediately.   Maker will invest in assets that leading institutions also invest in – including BNP Paribas, New York Life, Royal Bank of Canada, TIAA, PIMCO, Credit Suisse, and Deutsche Bank.   The technology is proven, meaning there is no technology risk.   The solar loan originator (Mosaic Solar) is exceptionally high quality and has a long track record.   Pando’s team has a combined seventy years experience in energy finance, having structured over $70B in projects. Pando’s team also is a highly experienced borrower.   These assets are longer duration than Maker has done in the past, but they are highly liquid assets from a traditional finance perspective. Pando can liquidate Maker’s position in a reasonable period of time, likely returning 100% of Maker’s principal.   Pricing is still an open topic of discussion. Maker RWF has requested that we use a public comparable to determine pricing. As a result, it makes sense to wait to price this transaction closer to financial close, given the current market volatility and that it may take months to close. Any agreement on pricing today would need to adjust based on future market conditions.   We thank the Maker community for the time and effort you’ve put in to understand and evaluate our proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3374999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tylermeanswell",
                    "index": "#44",
                    "likes": "1",
                    "time": "30/07/2022-16:01:13",
                    "content": "I agree with you as well, perhaps some mechanism we could implement that helps us determine the seniority of these RWA assets compared to a US-backed treasury beyond a KBRA rating? With such a long-time horizon for maturity I worry about a Puerto Rico-style black swan event (earthquake, wildfires, etc.), where there were a lot of companies that had made certain decisions using a narrative of sustainability and (a very truthful) on-the-ground decision to support necessities for citizens’ over their subordinate creditors… but with the end result being the value of US treasury investors’ being used to recomp. their investments when settling that event did occur. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.87202380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Peter_Pando",
                    "index": "#45",
                    "likes": "1",
                    "time": "31/07/2022-19:40:40",
                    "content": "@tylermeanswell, Thank you for the comment.  We understand the concern regarding a Hurricane Maria-type event.  However, given the geographic diversity of our proposed project, we don’t see any possible black swan scenario that would cause the necessary 1,900 homeowners to be impacted by any one single event (or even multiple events over the term of the loan).  The loan agreement with Mosaic will have specific concentration limits that will provide sufficient diversity to protect Pando/Maker as lenders (these are concepts that are very established in distributed energy finance).  If you would like to dig in more on this, please do let us know. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.288690476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#46",
                    "likes": "3",
                    "time": "04/08/2022-22:57:26",
                    "content": "I have reviewed the exhaustive comments and have recurring concerns regarding the extreme duration risk coupled with the low risk premium for a growing but fragile ecosystem like MakerDao.The downside is too high. In the end,despite being a huge fan of EndGame and ESG,this opportunity stretches the boundaries of acceptance for me.I will be voting no. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.435
                }
            ]
        }
    ],
    "group_index": "1382"
}