{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdaos-timeline-for-launching-dai-on-arbitrum-one/10100",
            "title": "MakerDAO's Timeline for Launching DAI on Arbitrum One ",
            "index": 10100,
            "category": [
                "Updates",
                "Integrations"
            ],
            "tags": [
                "layer-2",
                "protocol-engineering"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#1",
                    "likes": "32",
                    "time": "01/09/2021-09:56:56",
                    "content": "Hi all, After months of development we are excited to see the Arbitrum team make their Layer 2 solution, Arbitrum One, available publicly on mainnet. This Optimistic rollup will facilitate the mass scaling of Ethereum and EVM compatible smart contracts by reducing transaction costs and latency. Optimistic rollups make this possible by minimising the amount of on-chain data by rolling up data into a cryptographically hashed transaction to reduce the required computation on base layer Ethereum. Similarly to our previous work done with Optimism, The MakerDAO Protocol Engineering Core Unit have been busy working alongside Arbitrum and now that Arbitrum is launched on mainnet, we will conduct a final internal audit of the Custom DAI Gateway before officially launching on Arbitrum mainnet. From the risk perspective Arbitrum One is fundamentally very similar to Optimism’s rollup. Even though the architecture warrants a similar approach, there are some implementation-level differences regarding L1→L2 message passing, the fraud proof system, etc, that require this final review. Why Custom DAI Gateway ? Many DeFi projects, upon launch, will use a Standard Arbitrum Gateway to move their tokens to L2. As explained in the MakerDAO Multichain Strategy we consider this approach to be somewhat limited if we want to then allow direct minting of DAI on L2 and make this minted DAI fungible with DAI bridged from L1. Having this long-term goal in mind, similarly to Optimism we have decided to opt out from using a Standard Arbitrum Gateway and are developing a simple Custom DAI Gateway. This way MakerDAO governance will be the only authority that will be allowed to upgrade this Gateway in the future to both enable fast withdrawal schemes and DAI minted on L2. The Protocol Engineering Core Unit is expecting to launch our Custom DAI Bridge within the coming weeks as soon as we are finished with all internal audits of our code and external audits of Arbitrum code upon which the gateway is built are ready for public review. This is critical to ensure the custom gateway is safe and secure for DAI users. ",
                    "links": [
                        "https://forum.makerdao.com/t/official-dai-bridge-on-optimism/9329",
                        "https://forum.makerdao.com/t/a-multichain-strategy-and-roadmap-for-maker/8380",
                        "https://forum.makerdao.com/t/official-dai-token-bridge-now-live-on-arbitrum-one/10438",
                        "https://forum.makerdao.com/t/mip41c4-sp20-facilitator-onboarding-for-starknet-engineering-core-unit-sne-001/9782/2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-3rd-9th/10241",
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-27th-september-2nd/10125",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-159-thursday-september-16-17-00-utc/10335/3",
                        "https://forum.makerdao.com/t/layer-2-roadmap-history-and-future/17310",
                        "https://forum.makerdao.com/t/permissionless-bridge-deployment-arbitrum-nova/16956",
                        "https://forum.makerdao.com/t/minimum-debt-on-makerdao/11086/3",
                        "https://forum.makerdao.com/t/ruta-de-layer-2-historia-y-futuro-traduccion/17387",
                        "https://forum.makerdao.com/t/maker-relay-ep-61-en-espanol/10376"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.314708141321045
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/09/2021-10:33:42",
                    "content": "Good stuff Bartek—thank you for the update. The only request I have is that adding the Network/RPC is automatically offered to the end-users. In Optimism I enter it manually and typed in the wrong block explorer haha — so, you can imagine how hard it would be for newbs  BTW I’m seeing all the “bridges” across crypto offer this “Add/Switch to ______ Network” option to the end user. Which is super cool EDIT: it’s also hard for me to trust Metamask when it comes to allowing/granting permissions — hence, some might want to type in the bridge details… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Phil_Ur_Hearts",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/09/2021-03:07:02",
                    "content": "Thank you for the update Bartek. Really excited to see layer 2’s finally hitting mainnet and Ethereum hit significant milestones in it’s roadmap. It’s hard not to be optimistic when we have a working layer 2 solution and EIP 1559 being executed (negative issuance rate?!). Next is sharding and solving the state channel issue. Is anyone reaching out from Maker to the team at Defisaver to port over to Arbitrum or Optimism? @Davidutro ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.069444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FomoDan",
                    "index": "#4",
                    "likes": "0",
                    "time": "13/09/2021-17:59:43",
                    "content": "That`s fantastic news! So we will be able to generate DAI and also pay DAI back on Arbitrum? Also, is there already any update on the roadmap? Probably still a few weeks to go? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "1",
                    "time": "13/09/2021-18:08:02",
                    "content": "    FomoDan:  So we will be able to generate DAI and also pay DAI back on Arbitrum?   Not yet, soon™ With regards to Arbi roadmap—see Arbitrum Custom Dai Bridge design work ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FomoDan",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/09/2021-19:22:09",
                    "content": "Thanks for the feedback. Just for clarification, will we be able to generate and pay back DAI on Arbitrum based of our vaults which are still on L1 Ethereum? That would to totally useful! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "2",
                    "time": "14/09/2021-11:15:42",
                    "content": "    FomoDan:  Just for clarification, will we be able to generate and pay back DAI on Arbitrum based of our vaults which are still on L1 Ethereum?   Not in the near future. The first release will allow DAI to move between Arbitrum One from Ethereum.     bartek:  This way MakerDAO governance will be the only authority that will be allowed to upgrade this Gateway in the future to both enable fast withdrawal schemes and DAI minted on L2.   Fast withdrawal and vaults on L2 will come later. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#8",
                    "likes": "2",
                    "time": "15/09/2021-10:39:20",
                    "content": "Confirming LongForWisdom’s response above, correct, in the first instance, the official DAI bridge will allow for DAI transfer between Arbitrum and Ethereum. Future phases will consider vaults on L2 as this is a more complex proposition that requires oracle and liquidations infrastructure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#9",
                    "likes": "3",
                    "time": "16/09/2021-19:01:29",
                    "content": "Great work PE team  Really impressed by the speed of which you are responding to the developments happening in L2 land. Would love to explore moving governance to L2 at one point. Let’s talk when the time is right  cc: @bainpm @Derek ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.232142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#10",
                    "likes": "0",
                    "time": "17/09/2021-13:48:46",
                    "content": "What would be the advantage besides reducing high gas tariffs? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#11",
                    "likes": "0",
                    "time": "18/09/2021-13:02:52",
                    "content": "Incredible news, Arbitrum achieved a very solid liquidity, amazing for Dai too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#12",
                    "likes": "0",
                    "time": "21/09/2021-13:51:06",
                    "content": "I think the main advantages require some second-order thinking  In the case of governance, I expect that we’ll see an increase in the governance participation rate of smaller MKR holders, caused by the drastic reduction of gas fees for actions such as voting, delegating, etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#13",
                    "likes": "0",
                    "time": "22/09/2021-14:36:25",
                    "content": "That’s the expected effect, maybe it’s a new step for Maker to explore the possibility of migrating a small part of the L2 protocol and maybe even sidechains, this will be an interesting pilot. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357954545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#14",
                    "likes": "3",
                    "time": "22/09/2021-15:02:09",
                    "content": "    Official DAI Token Bridge now live on Arbitrum One Integrations   Official DAI Token Bridge now live on Arbitrum One Following the highly anticipated optimistic rollup launch of Arbitrum on mainnet earlier this month, MakerDAO’s Protocol Engineering Core Unit is today launching the official DAI Token Bridge.  This means that users are now able to trade, lend, provide liquidity and yield farm with DAI on Arbitrum One. The deployment and integration of a custom DAI token bridge on Arbitrum is an important milestone to facilitate DAI usage across a growing Arbit…     ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdaos-timeline-for-launching-dai-on-arbitrum-one/10100"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.951948051948052
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "23/10/2021-01:02:19",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}