{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-move-to-percentage-iam/6607",
            "title": "[Signal Request] Move to Percentage IAM ",
            "index": 6607,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "3",
                    "time": "17/02/2021-09:56:21",
                    "content": "Hi Everyone, Before the Instant Access Module (IAM) we had a constant barrage of Debt Ceiling (DC) work in the form of signal requests and governance polls. With IAM this governance workload is much reduced, but now we are discussing the IAM gap - how much the DC should increase per write to smart contract. The issue is that the number of collateral types covered by IAM will grow strongly, so before too much bandwidth is occupied by this maybe we should automate? As-is: fixed DC increase per write to contract. Example - presently DAI 30 million for ETH-A for example. Suggested: percentage DC increase per write. Possibly 1%-10% per write - exact figure to be decided by Risk recommendation and voting. Pros Less governance work More DAI minted Cons Less precise control over DC Next steps if the signal passes: A MIP to this purpose reviewed by relevant parties prior to presentation. EDIT: revised per comments by @LongForWisdom    Should we move to percentage increases in the Instant Access Module?  Yes No Abstain Other (please comment below)     0 voters     The poll is open until Thursday 25 February 2021 but will move on-chain on the following Monday only if there is a majority for moving to a percentage DC calculation for IAM. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-129-thursday-february-18-17-00-utc/6506/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/governance-at-a-glance-feb-12-18-2021/6644"
                    ],
                    "GPT-summary": "The author of the post is proposing a change to the Instant Access Module (IAM) in order to reduce governance workload. The proposal suggests moving from a fixed Debt Ceiling (DC) increase per write to a percentage DC increase per write. The author is asking for feedback and has provided a poll for the community to vote on the proposal. Some community members have provided constructive criticism and asked questions about the proposal. The proposal may be audited and reviewed by relevant parties before presentation.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.351934523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/02/2021-10:48:26",
                    "content": "Good idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#3",
                    "likes": "1",
                    "time": "17/02/2021-11:08:15",
                    "content": "Would that mean deploying a new IAM contract? If it is the case can we think at something a bit more elaborate than just percentage Vs gap for a V2. Which is mainly the same thing. Something a bit more automatic. aomething that sort of auto adjust and close the vault when there is a high drop - which is the issue case. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.031581439393939
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#4",
                    "likes": "1",
                    "time": "17/02/2021-11:12:49",
                    "content": "I am recommending No as it is easy to lose the granularity with specific numbers when we use percentages. Yes, we can all do the math to figure the number; however, it is quite easy to get lost in the, “it is just 3%” thinking. My $0.02 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.444444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "1",
                    "time": "17/02/2021-12:07:48",
                    "content": "@Planet_X could you add a ‘next steps’ sentence or something at the end of the post? I’d also appreciate it if you linked to the docs here. This helps provide background information for newer readers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#6",
                    "likes": "5",
                    "time": "17/02/2021-13:25:45",
                    "content": "Some background context…when Gonzalo and I were discussing the original DC-IAM design, we chose an absolute number for increasing the DC over a percentage because there was an expectation that IAMs would be added for all onboarded collateral types, and when collateral types are onboarded they have zero supply, so, naturally an absolute number was ideal (because alternatively % change * 0 supply = 0). The other reason was that it felt easier to see what changes would be occurring in absolute terms. So, the absolute number was born.  In summary, there were always two options:  absolute number percentage increase where the IAM would need to have a minimum debt ceiling (otherwise % increases could take a long time to recover in the event of a sudden supply fall).  I’m leaning towards an absolute number for simplicity but can see the argument for a %-based model if people think what we have now is too restrictive. Tangential to this discussion… a parallel improvement could be to include proxy actions in interfaces such as Oasis Borrow/DeFi Saver etc allowing users to make DC-IAM changes when generating or repaying Dai. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.884615384615385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/02/2021-14:50:34",
                    "content": "    Planet_X:  Next steps if the signal passes: A MIP to this purpose reviewed by relevant parties prior to presentation.   This wasn’t quite what I meant. I was more asking about when this poll would close and when you planned for it to move on-chain for a vote. If you don’t think this needs to go on-chain and you’d rather just get some feedback before proposing a MIP, maybe change this to an informal poll? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#8",
                    "likes": "3",
                    "time": "25/02/2021-16:11:19",
                    "content": "Ok. This did not reach a majority Yes and so will not be pursued further right now. Thanks to all that participated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.80952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "28/03/2021-02:11:54",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}