{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp19-facilitator-onboarding-development-and-ux-core-unit-dux-001/9779",
            "title": "MIP41c4-SP19: Facilitator Onboarding, Development and UX Core Unit - DUX-001 ",
            "index": 9779,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "cu-facilitator",
                "dux-001",
                "mip"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bainpm",
                    "index": "#1",
                    "likes": "10",
                    "time": "10/08/2021-17:59:33",
                    "content": " MIP41c4-SP#: Facilitator Onboarding, Development and User Experience Core Unit  Preamble MIP41c4-SP#: 19 Author(s): Philip Bain Contributors: Status: Formal Submission Date Applied: 2021-08-11 Date Ratified: yyyy-mm-dd   Sentence Summary MIP41c4-SP19 onboards Philip Bain as Facilitator for the Development and User Experience Core Unit.  Specification  Core Unit ID DUX-001  Core Unit Name Development and User Experience  Motivation I am motivated by championing decentralized systems and alternatives to existing power structures. Maker is leading the way in this field and I am grateful for the opportunity to work with the community to contribute to the vision. As a former member of the Maker Foundation, I remember the moment when I recognized how big the governance community had grown, and how much passion and enthusiasm there was for taking on the responsibility of managing this protocol. I am inspired by watching the protocol grow and attract more like-minded people. I am also motivated by the talented team we have at DUX, and I look forward to helping showcase the concepts and features that we want to introduce. Innovations to governance systems enabled by blockchain technology are a fertile new field, and I am excited for the opportunity to represent the team as leaders in the space. The experiences and relationships I’ve had during my career at Maker have shaped me in a positive way. During times of crisis I looked to my colleagues and I saw helpers coming together to solve problems and mitigate disaster. In moments like these I have jumped into ad hoc teams without hesitation in an effort to strengthen and protect the protocol. Being a part of these teams that worked tirelessly to secure something that we all shared love for was inspiring. It solidified my commitment and dedication to supporting this community and the protocol. I’m proud to have a role on this new team where I can make an impact by contributing my efforts towards something positive. I believe the DUX team will enhance the value of the protocol by optimizing the decision-making process, ensuring protocol security, and will bring the state of the industry forward.  Facilitator Commitment My commitment as the DUX team facilitator is to:   Serve as a point of contact between the Development and UX Core Unit, the Governance community and other facilitators to ensure a cohesive understanding of team deliverables and progress   Represent the Core Unit to the community by:  Engaging with the community and synthesizing feedback for the team to help iterate on our ideas Communicating team updates, roadmap, and releases to the community Demonstrating to stakeholders how our contributions bring value to the protocol Acting under principles of transparency Attending relevant meetings and delivering status updates    Work with DUX Team Lead to:  Define Core Unit management framework and team OKRs Set up legal structure of the Core Unit Draft and deliver required MIPs    Help fulfill our team mission by continuing to act in a technical capacity as an engineer    Facilitator Name and Information  Name: Philip Bain Forum: @bainpm  Discord: @bainpm  Rocket Chat: @philip    Facilitator Credentials  Experience at Maker  Joined the JavaScript development team in September 2018 as a developer Created Dai.js Governance plugin for use with the v1 Governance Portal Contributed to the Governance v1.5 Polling features Helped launch the Oasis Borrow and Save portal for MCD Integrated the frontend testing framework (QA Dashboard, Testchain Client) with Staxx testchain infrastructure backend Helped coordinate response team to deploy emergency Flop Auctions frontend in the wake of March 12th 2020 events Co-created the Developer Experience team in 2020 Helped develop the current design system and associated tooling, facilitated meetings to evangelize adoption by frontend teams Helped develop the Liquidations 2.0 frontend and plugin library   Experience prior to Maker  Team lead for SaaS startup in Healthcare Tech field Masters in Emergent Digital Practices Team lead for classroom technology support at University of Denver Brewer at Rock Bottom Brewery in Denver  ",
                    "links": [
                        "https://github.com/makerdao/governance-portal",
                        "https://github.com/makerdao/mcd-cdp-portal",
                        "https://github.com/makerdao/testchain-client",
                        "https://github.com/makerdao/staxx",
                        "https://github.com/makerdao/auctions-ui",
                        "https://github.com/makerdao/dai-ui",
                        "https://github.com/makerdao/liquidations-portal",
                        "https://forum.makerdao.com/t/mip39c2-sp18-adding-development-ux-core-unit-dux-001/9770"
                    ],
                    "GPT-summary": "The post is a formal submission of MIP41c4-SP19, which onboards Philip Bain as Facilitator for the Development and User Experience Core Unit. The author explains his motivation and commitment to the role, as well as his credentials and experience at Maker. A 3rd party is not giving feedback, but rather the post is a proposal and there is some information about the Core Unit and its management framework.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Identity and reputation systems",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.214015151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/08/2021-21:22:01",
                    "content": "    bainpm:  Brewer at Rock Bottom Brewery in Denver   Niiice!! When DUX Core Unit Trappist & IPA beers?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bainpm",
                    "index": "#3",
                    "likes": "2",
                    "time": "10/08/2021-21:40:42",
                    "content": "We might have to adjust our mission and vision statement!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/11/2021-21:40:43",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}