{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp9-facilitator-onboarding-cpm-001/7191",
            "title": "MIP41c4-SP9: Facilitator Onboarding, CPM-001 ",
            "index": 7191,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "cpm-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#1",
                    "likes": "8",
                    "time": "25/03/2021-10:14:53",
                    "content": " Preamble MIP40c2-SP#: 9 Author: Kathleen Chu Contributors:   Status: Rejected Date Applied: 2021-03-25 Date Ratified: <yyyy-mm-dd>   Specification  Motivation  Individuals’ lives can be improved immensely when they have access to open finance and unbiased, stable currency. That is what MakerDAO and Dai offer, and that is also why I am applying to become a Facilitator. As someone passionate about equality, I want to utilize my expertise in marketing and decades of experience as a former Bloomberg journalist to promote and share MakerDAO and Dai’s benefits.   Core Unit ID  Core Unit ID: CPM-001 Strategic Marcomms Core Unit   Facilitator name and information  Kathleen and Kathleen_Chu on Maker Forum  @kathleen on Rocket Chat 0x21401CCa9b3E237E6c5De9cD227CEC690d566A60   Facilitator Commitment   My commitment to MakerDAO is to fulfill the mandate, engage in discussions regarding Maker governance, and collaborate with other facilitators and units to contribute to the success of MakerDAO.   My unit’s structure is relatively flat, with experts covering the key markets. They will be in charge of executing their strategy and deliver results. My role is to find the right people for the rest of the roles and ensure they get the help and resources they need. I will also make sure their efforts are coordinated, and their achievements are highlighted.   We plan to use OKR to set a clear direction for the unit and utilize KPI to gauge our performance. I plan to share quarterly updates to ensure the transparency of our progress.   Retaining and hiring talents can pose a challenge. I plan to focus on finding the right people and getting the team up and running in the first couple of months.   In the second quarter, we plan to activate several outreach programs we have listed in our business plan. I expect the speed of budget spending to increase in the second half of the year once the team is in place and gaining momentum.    Facilitator credentials  Former Bloomberg journalist with decades of experience in covering finance and real estate and hedge funds. Co-Founder of a popular DeFi community called Yasashi (easy) DeFi in Japan, and a founding member of Japan DeFi Alliance, an advocacy group Built several communities, including women’s community and the working family community at Bloomberg Tokyo, as well as Japan’s DeFi community Years of experience in PR, content, and marketing in the blockchain space Ran a series of marketing campaigns that boosted the traffic to Maker’s homepage and blog in H2 2020 by more than 80 percent Established connections needed to foster collaboration with entities such as BGIN, a blockchain group supported by some regulators, and invited to speak at major government-hosted events such as Finsum  Strategic Marcomms Core Unit & Budget ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-strategic-marcomms-core-unit/7189/2",
                        "https://forum.makerdao.com/t/mip40c2-spx-strategic-marcomms-core-unit-budget-framework/7190",
                        "https://forum.makerdao.com/t/weekly-mips-update-31/7232",
                        "https://forum.makerdao.com/t/maker-relay-ep-44/7974",
                        "https://forum.makerdao.com/t/who-does-routine-due-diligence/7886/9",
                        "https://forum.makerdao.com/t/mip40c3-sp9-modify-core-unit-budget-cpm-001/7190",
                        "https://forum.makerdao.com/t/weekly-mips-update-33/7573",
                        "https://forum.makerdao.com/t/makerdao-people-at-a-glance/7503",
                        "https://forum.makerdao.com/t/weekly-mips-update-32/7464",
                        "https://forum.makerdao.com/t/mip39c2-sp9-strategic-marcomms-core-unit/7189",
                        "https://forum.makerdao.com/t/maker-relay-ep-38/7249",
                        "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-strategic-marcomms-core-unit-mip-set-may-10-2021/7951/33",
                        "https://forum.makerdao.com/t/are-we-having-a-loud-minority-problem/7972/7"
                    ],
                    "GPT-summary": "The post is a proposal by Kathleen Chu to become a Facilitator for MakerDAO. She explains her motivation, credentials, and commitment to the role, as well as the structure and plans for her proposed Core Unit. The post does not contain any requests for feedback, criticism, or collaboration, but a third party could potentially extend to the proposal or collaborate with the proposed Core Unit.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.605883699633699
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#2",
                    "likes": "3",
                    "time": "06/04/2021-04:52:25",
                    "content": "    Kathleen:  Ran a series of marketing campaigns that boosted the traffic to Maker’s homepage and blog in H2 2020 by more than 80 percent   Can you provide more details of these campaigns? How did you drive the traffic? What was your cost per click? You say traffic increased by 80%. Ie Did it increase from 1000 to 1800 or 1000000 - 1800000? Magnitude matters when giving figures like these. How much did you spend on these campaigns? Does your quoted figure include organic growth? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#3",
                    "likes": "4",
                    "time": "04/05/2021-03:43:01",
                    "content": "Formally submitting this MIP set for the May Governance Cycle ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-35/7962"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}