{
    "poll_list": [
        {
            "title": "Ratification Poll for CoinShares Active Treasury Management (MIP86) - November 14, 2022",
            "index": "17900",
            "option": "No",
            "supporting_mkr": "56,740",
            "highest_fraction": 0.72
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip86-coinshares-active-treasury-management/17900",
            "title": "MIP86: CoinShares Active Treasury Management ",
            "index": 17900,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#1",
                    "likes": "11",
                    "time": "14/09/2022-09:32:33",
                    "content": " MIP86: CoinShares Active Treasury Management  Preamble MIP#: 86 Title: CoinShares USDC Institutional Rewards Author(s): @CoinSharesCo Contributors: @jmmognetti Tags: PSM Type: General Status: Rejected Date Proposed: 2022-09-13 Date Ratified: Dependencies: MIP13c3-SP12 Forum URL: https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900 Ratification Poll URL: https://vote.makerdao.com/polling/QmXpRmAP   Sentence Summary In MIP86 CoinShares proposes a portfolio management strategy for a portion of MakerDAO’s PSM following the RWA pivot made by the community. CoinShares could deploy this investment strategy for capital ranging from $100 million to $500 million. It is important to ignore the amount of money invested for the vote, we believe that this should be decided and voted on at a later stage by the community. We would propose that the exact amount of the program (100m-500m) will be sized in accordance with MakerDao’s ALM strategy prior to execution of this MIP through a signal request that factors in the optimal amount of the program based on MakerDAO’s ALM strategy at the time we are ready for execution.  Paragraph Summary Under MIP86, a portion (from $100M to $500M) of the PSM’s USDCs will be managed by CoinShares, which will invest on behalf of MakerDAO the funds in various traditional financial assets according to MIP13c3-SP12 3. CoinShares aims to provide a variable APY above the SOFR interest rate (3.01% as of October 26, 2022) in the community’s preferred currency (DAI, USDC, USD…) to MakerDAO and that can be withdrawn on-chain. This MIP describes the architecture of the project.  Motivation This MIP is based on the ratified Declaration of Intent to Invest in Short-Term Bonds (MIP13c3-SP12 3) whereby MakerDAO notes that approximately 60% of MakerDAO’s balance sheet is in a stablecoin that does not provide revenue while maintaining counterparty risk on Circle. MIP13c3-SP12 3 details high standards that are consistent with CoinShares’ well-established position in the institutional space (partnering up with top financial institutions like Nomura and Invesco, or a significant investor in one of the most advanced and innovative trading Swiss Banks based in Geneva and Zurich: FlowBank) as well as offering a mature legal and custody structure that allows secure access to many traditional financial assets. Our motivation is reinforced by the fact that since 2022, traditional financial assets have offered a higher APY than DeFi on the USD, which should create an innovative collaboration between, for example, MakerDAO and CoinShares, to generate interest on MakerDAO’s balance sheet. MakerDAO has paved the way for the institutionalisation of DeFi through the professionalism of its teams and the governance of the DAO and above all by promoting collaboration with financial institutions through the RWA program. CoinShares, as a historical player in the digital asset industry and an asset manager since 1998 (formerly Global Advisors), is probably one of the most capable financial institutions to collaborate with DAOs by playing this bridging role between TradFi and DeFi. CoinShares has also developed strong relationships with DeFi protocols. As one of the most DeFi-friendly financial institutions, it is only a natural step for us to offer our services to MakerDAO, the institutional-grade DeFi protocol by excellence.  Resources Know Your MIP #14 | MIP86 | CoinShares Treasury Investment Proposal 10/22 - MIP86 - CoinShares Proposal CoinShares MIP86 - Interests model FAQ - MIP86  Component Summary MIP86c1: Presentation of CoinShares In this section, we present CoinShares business activities. MIP86c2: The opportunity – A word of our investment manager Our investment manager will explain to the MakerDAO community why investing in bonds right now is an amazing opportunity. MIP86c3: Investment Program In this section, we explain more thoroughly what is our portfolio strategy for MakerDAO. MIP86c4: Terms for Adding and Withdrawing Liquidity We describe the structure of the collaboration and what would be the process and ways of working. MIP86c5: Transparency and Monitoring We describe how we would like to maximise transparency and ease of use for the MakerDAO community through TrustExplorer and regular AMA and reports. MIP86c6: Proposed Legal Structure We describe a low intermediary, smart-contract enabled, bankruptcy remote structuring for our partnership. MIP86c7: Custody We explain what Komainu is, our regulated custody solution, a joint venture with CoinShares, Ledger & Nomura, to custody digital assets. MIP86c8: Internal Organisation We describe the team that would manage MakerDAO’s assets, with a dedicated part about our investment manager. MIP86c9: Legal Structure & Collateral Onboarding We explain how CoinShares will actively participate in the Legal Structure & Collateral Onboarding Verification and Assessment process, in total cooperation with the relevant Core Units or community members. MIP86c10: What makes us different from the other MIPs to manage MakerDAO’s PSM? It’s a summary of the benefits of our proposal compared to the other recent MIPs made to the MakerDAO community.  Specification  MIP86c1: Presentation of CoinShares CoinShares is a leading full-service digital asset investment and trading group that delivers a broad range of financial services across investment management, trading, securities, and consumer products to a wide array of clients that includes corporations, financial institutions, and individuals. Pivoting towards crypto in 2013, the firm is headquartered in Jersey, with offices in London, Paris, and New York. CoinShares is regulated in Jersey by the Jersey Financial Services Commission, in France by the Autorité des Marchés Financiers, and in the US by the Financial Industry Regulatory Authority. CoinShares is publicly listed on the Nasdaq First North Growth Market under the ticker CS and the OTCQX under the ticker CNSRF and preparing for an up-listing to the Nasdaq Sweden Main Market by the end of the year. CoinShares is Europe’s largest and leading digital asset investment and trading group, managing billions of assets on behalf of a global client base. Our mission is to expand investment into digital assets with our trusted, regulated, best-in-class product suite that provides investors with trust and transparency when accessing cryptocurrencies. In 2018, CoinShares built — along with Nomura and Ledger — Komainu, one of the leading European institutional-grade digital asset custodians. Komainu is leveraging Ledger Enterprise Solutions to custody digital assets. Komainu was established to fill a gap in the marketplace and provide institutions with a secure and compliant custody service for investment in digital assets. Launched in June 2020, Komainu currently holds several billions of dollars in assets under custody from asset managers, financial institutions, corporations, governments, and agencies.  MIP86c2: The Opportunity The macro backdrop remains challenging. However, the bond market has already priced in much of this news and possibly too much. As a result, we are currently at some of the widest levels we have seen in a decade. This is even though financial issuers remain in a strong position, as reflected by their capital and excess capital. Moreover, asset quality remains solid as non-performing loan ratios of European banks are currently extremely low at 1.8%. Despite the negative performance of significant bond markets year-to-date, our outlook is positive for the next 24 months as credit quality, especially within the solution we have constructed, remains strong. This ensures visibility of the path to high income with yields often double-digit. For example, Swiss Re 4% has a yield to the next call in 2024 of c.13%; the bond is A-rated, while the parent company is rated AA- (very strong). Overall, the strategy portfolio has a yield-to-maturity of 6.77%, utilising national champions that are imperative to their national economies, for example, Bank of America is 6.25% in 2024, which is trading at 97.76%, meaning that as the bond matures at par (100%), it will appreciate 2.16% in capital and an additional 12.5% in coupon payments (2023 and 2024) creating a positive cash flow of 14.6% over the next two years. This represents an exceptional opportunity to deploy capital into such names. We blend this approach by investing in government-related issuers (36% of the portfolio) that typically avoid ‘hot money’ flows and are less volatile than traditional government bonds. For example, we prefer the 'AA-rated’ UAE government-backed Mubadala Investment Company (MDGH). The UAE is a wealthy nation with little external debt and retains a net foreign asset position of c. 250%. Net Foreign Assets (NFA) refer to the net amount of foreign assets a country owns or the total value of a country’s foreign assets minus the total value of assets within a country that foreigners own. They indicate whether a country is a net creditor or a net debtor. We prefer creditor nations. Using the same method as previously stated, the MDGH 2.5% 2024 provides investors with the potential to achieve a return of 10% over the next two years. The strategy maintains a low duration of just over a year, meaning it actively manages interest rate risk. Indeed many of the instruments in the strategy can actively benefit as rates rise; we currently have c.50% exposure to floating and variable rate notes; these reset to the underlying reference rate and the coupon is adjusted to reflect any increase in rates. An excellent example is A-rated HSBC 2024; the bond currently has a floating coupon of 5.98%. If rates continue to rise, then the coupon will increase. Our approach reduces risk as we invest c. 50% in fixed-rate bonds, meaning they will ‘pull-to-par’ over the coming couple of years; these issues are trading at heavy discounts and will benefit holders as they mature. At the same time, the remaining element is invested in issuers that will benefit from higher rates. If the prospects of rate hikes diminish, we reallocate capital to bonds that reflect the prevailing conditions of the market. Global authorities are on a tightrope. They need to signal they are willing to fight inflation with higher rates, but at the same time, they need to protect households and businesses as such significant rises from this juncture are somewhat muted. This creates a great opportunity for MakerDAO as a bond investor.  MIP86c3: Investment Program  Benchmark The investment objective is to generate income and capital growth over the short term by investing primarily in quality corporate bonds and to yield an annual return in excess of the SOFR, capitalised daily over the investment period. The SOFR (Secured Overnight Financing Rate) is a dynamic reference rate for the US dollar (USD) interbank market. It is calculated by the New York Federal Reserve.  1417×1000 64.9 KB  Source: Bloomberg, as of October 18, 2022  Objective To capture a high and steady income by investing in bonds from strong issuers The primary aim is to preserve capital whilst providing returns that are 2.25% in excess of SOFR on a rolling 36-month basis Currently, the positive yield differential is 3.79%.  Philosophy A predominately buy-and-hold and bottom-up driven investment approach that is actively managed through tactical tilts. Invest in national champions and government-backed issuers  Solution The portfolio recognises and attempts to capture the current dislocation in global bond markets. The portfolio actively seeks out highly creditworthy bonds with limited interest rate sensitivity (low duration) that are trading below par (91% of the portfolio). This approach enables the portfolio to benefit from ‘pull to par’ as it invests in government-backed issuers or national champions representing little credit risk over the next 36 months. The salient features of the portfolio are as follows:  700×69 16.4 KB  Given the dislocation in bond markets, the net cash flow is a useful tool to help assess what your client can expect to receive over the two years. Net cash flow is the collection of income and net proceeds of bonds purchased at discounted less any management fees.  Approach Over the course of 2022, the macroeconomic climate has been very challenging. This challenging outlook has already been priced into many bonds which have sold off this year. We are of the view that the damage has been done and there is little downside remaining especially with assets that are due to mature or be called in the next couple of years. The bond market is currently offering compelling opportunities. We feel that these can be exploited to the benefit of the community using a low-risk approach. The portfolio invests in highly creditworthy issuers from national champions and government-backed issuers. We actively seek out dislocations in the bond market to provide attractive total returns from income and capital. In addition, we invest in a range of instruments across the bond market to protect and grow capital in a reasonably simple way. Fixed-rate bonds represent c.50% of the portfolio. We actively seek out names that are trading below par or that have an attractive coupon, thus providing a solid income for the next couple of years. All of the fixed-rate bonds are trading below par, an average of 94.5thus providing the opportunity for capital appreciation over two years or more. Floating and variable rate bonds represent c. 50% of the portfolio; their coupons reset quarterly to reflect changes in LIBOR /SOFR coupled with a spread, e.g. +0.2%. This protects the portfolio in the event of further increases in interest rates. Rather than hold cash deposits, floating rate notes offer a secure way of benefiting from increasing rates.  Process Research-intensive investment approach to select issuers, debt securities, construct the portfolio, and manage risks. Investment policy  The portfolio recognises and attempts to capture the current dislocation in global bond markets. The portfolio actively seeks out highly credit-worthy bonds with limited interest rate sensitivity trading below par. Strong credit quality: Minimum of 70% of issuers are Investment Grade rated. Low sensitivity to interest rates: More than 50% of securities will be fixed-to-floaters & floating-rate-notes. Credit risk: Government-backed names reduce credit risk. Financial debt instruments will be included to benefit from higher interest rates. Liquidity is a key consideration for this solution although this isn’t cash; we are aiming to provide similar core characteristics. One of them is the ability to add funds or withdraw them easily and quickly. Withdrawals can be made within 7 working days under normal market conditions. We are able to enable this as we focus only on bonds with large issue sizes with high demand and deep markets that are widely covered by brokers. The acquisition or disposal of bonds or debt securities is based on an analysis of the issuer’s credit risk.  Constraints Portfolio construction proposed constraints are aligned with typical institutional portfolio allocation:  Weighting range between 0.75 and 3%. No more than 5% to a single issue (corporate). No more than 5% of any outstanding issue (fairly unlikely). Government-backed debt you can have up to 10% per issue (we didn’t in the case of our portfolio use such a high concentration). Average rating must be at least ‘A’. Average duration no more than 3 years (our portfolio is currently 1.5%). No more than 50% to one sector (unless government).  Example portfolio - CoinShares Alpha Liquidity  754×455 48.2 KB  Portfolio construction focused on gradual allocation to build Trust and Transparency  Performance of the CoinShares Alpha Liquidity Strategy since 2014   1068×500 23.5 KB   Fees   932×519 36.7 KB  It is important for CoinShares to be aligned with the community. That’s why we offer performance-based compensation only. While maintaining the quality of the portfolio and keeping the risk/return ratio consistent with the management objective, CoinShares will receive 66% of the portfolio’s outperformance against its benchmark, and 50% of the income received by CoinShares will then be used to purchase the MKR token, which CoinShares will hold for at least 2 years from the date of purchase in a totally transparent way and will be used so as CoinShares can be involved in the stewardship of the protocol along with the other delegates.  Why this compensation model?  CoinShares wants to align with Maker’s interests and make a long-term commitment to governance, both for the operation’s success and for Maker’s potential to be a pioneer in the collaboration between DeFi and TradFi. You can see the theoretical results of the investment in the shared document CoinShares MIP86 - Interests model. You can play with the document if you wish.   MIP86c4: Terms for Adding and Withdrawing Liquidity We propose to implement a set of smart contracts accessible only by authorised persons at MakerDAO, which will simplify the process and eliminate possible intermediaries and fees between CoinShares and MakerDAO. This set of smart contracts will be used to perform fund transfers between MakerDAO and CoinShares, as well as transfer the interest to MakerDAO. The smart contract architecture is currently being developed and tested. Later, it will be shared with the community and audited. With regard to the transfer of interests, CoinShares will automatically convert the proceeds of its management (100% up to SOFR and 33% above SOFR) into stablecoins of MakerDAO’s choice, which will be deposited in the smart contract. This smart contract will be executable by MakerDAO, which will be able to recover the necessary amounts on demand. Here is our summary of the implementation of the different steps, from the USDC PSM vault to the investment by CoinShares.  849×371 68.2 KB   MIP86c5: Transparency and Monitoring Although originally from the traditional financial industry, CoinShares decided in 2013 to devote fully to digital assets because those new protocols allow for unparalleled transparency in transactions, contracts, and operation of protocols. With this in mind, CoinShares has partnered with Armanino LLP to provide investors with real-time transparency of CoinShares’ XBT Provider assets under management, and CoinShares Digital Asset Securities through Trust Explorer Real Time Asset 1. We want to be able to report back to the MakerDAO community in real-time through a similar setup by giving in real-time the value of assets invested. In addition, similar to what we provide to our investors, we propose to provide the community with a quarterly report on the status of the volume of assets managed by CoinShares. Finally, because we are convinced that regular communication is the key to such a partnership, we suggest creating a dedicated channel where you can regularly ask questions to our Asset Management team.  MIP86c6: Proposed Legal Structure  Low intermediation of service and structuring  Unlike other proposals and previous programmes, we propose to concentrate nearly every service at CoinShares, MakerDAO’s direct counterparty, with the exception of asset custody, which must be external. We believe that MakerDAO’s RWA strategy should not be at the expense of disintermediation driven by the digital asset revolution. It seems to us that our proposal is the only one that presents a certain level of disintermediation.  Creation of a dedicated smart contract to limit the use of intermediaries  This desire for disintermediation and a direct relationship between the Community and CoinShares is also reflected in the establishment of a smart contract serving as a receptacle for funds and the ability for MakerDAO to recover its on-chain funds.  Bankruptcy remote scheme  MakerDAO Assets will be segregated from CoinShares’ proprietary account in a Sub-Account held at our Custodian Komainu and/or at one of our traditional prime brokers in a way to isolate financial risk (SPV or segregated account).  Fiat/Stablecoin conversion  All conversions from fiat to stablecoins and USDC stablecoins to fiat will be ensured by CoinShares Capital Markets (Jersey) Limited following our Best Execution Policy.  1566×638 128 KB   MIP86c7: Custody Komainu as a joint venture between CoinShares, Nomura, and Ledger is an excellent custodian using military-grade security. Komainu is leveraging Ledger Vault which is the most secure solution in the industry thanks to hardware security. Ledger Vault mixes the most advanced security features through its Personal Security Device (a Ledger Nano X upgrade), a dedicated Hardware Security Module, and Ledger proprietary software. Ledger Vault is SOC 2 Type 2 certified. MakerDAO Governance will vote and approve CoinShares with custody provided by Komainu Jersey Limited regulated by the Jersey Financial Services Commission as a Custodian under Fund Service Business and registered as Virtual Asset Service Provider under schedule 2. Komainu’s principal shareholder is Nomura Holdings International, followed by Ledger, CoinShares, Alan Howard, Galaxy Digital, and Nomura Research Institute. Komainu has been audited by government bodies such as the UK NPCC Cybercrime Program. With regards to the custody and securities held on behalf of MakerDAO, they will be under the custody of Tier 1 Financial Services Institutions.  MIP86c8: Internal Organisation CoinShares aims to be a bridge between TradFi, CeFi, and DeFi.This is where our proposal differs fundamentally from the other ones. We want to participate in Maker’s asset exposure strategies to Real World Assets while trying to keep as much as possible on-chain infrastructure. The investment will be carried out by the CoinShares team and infrastructure that benefit from experienced traders & portfolio managers bringing knowledge from traditional finance. Our Fixed Income strategist who would oversee MakerDAO’s assets currently oversees $450M (outside CoinShares - he is in the process of joining the team full-time to help us accelerate our in-house treasury management solutions. His contribution to our treasury management has been significant, spread over several fixed-income strategies. He has been an expert in fixed income for 20 years with particular expertise in macroeconomics, bonds, and alternatives. The core business activities are built on our proprietary trading platform, Galata, built by the Capital Markets team. Galata acts as an Operating System for the whole company. Galata is a bridge between traditional finance and decentralised finance. It enables the proper execution of orders, our investment strategies, and our product distribution. It links different exchange platforms and services that are today crucial to the success of our business.  The current DeFi infrastructure does not allow strong bridges between DeFi and TradFi, but CoinShares remains open to discussions in this regard.  MIP86c9: Legal Structure & Collateral Onboarding  Legal Structure  CoinShares will put in place a legal trust structure, and governance framework, with the necessary contractual relationships and legal protections to protect the interests of MakerDAO and CoinShares. CoinShares has an experienced team that will be able to provide direct discussion with MakerDAO relevant Core Units. This includes, but is not limited to:   The establishment of an Investment Management Agreement (“IMA”) highlighting CoinShares’ fiduciary duty to manage the portfolio in the primary interest of MakerDAO. The IMA will include restrictions to ensure that the portfolio is managed in accordance with the MIP and within a framework that mitigates risk.   No ability by third parties to the IMA to access the funds or change the terms of the legal structure;   No ability for third parties to the IMA to block the ability of MakerDAO to make decisions or modify the structure;   There must be no apparent weak links or edge cases that allow funds to get misappropriated or stuck;   The correct segregation of the portfolio of CoinShares’ balance sheet assets;   MakerDAO will have the ability to trigger subscriptions and redemptions through a smart contract;   This above-established structure will set up a relationship with CoinShares Capital Markets (Jersey) Ltd which is a regulated crypto broker, and a dedicated Ethereum address (multi-signature) will be used to interact with the deployed smart contract in relation with MIP86c4.   Collateral Onboarding: Assessments   As part of our commitment to full transparency and cooperation with the MarkerDAO Community and Cores Units, CoinShares will create a dedicated page (that could be named “MIP86: Documentation & Assessments Repository”) on the MakerDAO Forum (“Collateral Onboarding” section) which will contain the Risk, Compliance and Legal assessments as well as the Legal and Regulatory documentation on CoinShares and the MIP86. Our teams will fully cooperate and provide MarkerDAO community members with all the necessary information to carry out their own independent assessments on the followings topics:  Legal Assessment Counterparties Assessment Compliance Assessment Technical Assessment  CoinShares is committed to engaging all relevant internal teams to enable due diligence by the Community and Core Units to be completed and this Active Treasury Management program to be effectively deployed within a very short timeframe while maintaining the trust and control of the MakerDAO community members.  Collateral Onboarding: Legal & Governance Verification  At least one community member, with legal credentials, must, through a public forum post, validated by at least one Facilitator, verify the legal and governance structure appropriateness for holding a large amount of low-risk real-world asset collateral for Maker, actively managed by CoinShares.  Collateral Onboarding: Investment Program Verification  The Strategic Finance Core Unit facilitator/member must, also through a public forum post, verify, with regard to MIP86c3: Investment Program, that the tools put in place by CoinShares ensure solid guarantees on low-risk real assets and the quality of the management service, actively managed by CoinShares for MakerDAO As stated in the MIP, CoinShares is available to the MakerDAO teams and the community to build and provide relevant and timely portfolio data.  Collateral Onboarding: Technical Verification  The Collateral Engineering Services Core Unit facilitator must, again through a public forum post, provide a Verification of the technical appropriateness in relation to MIP86c5. A test transaction will take place to ensure the receiving address is correct prior to any release of funds. If the Collateral Engineering Services Core Unit facilitator is not satisfied with the security of the assets transfer, the deal would be halted until these concerns were rectified.  MIP86c10: What makes us different from the other MIPs to manage MakerDAO’s PSM? Discretionary, Independent, Active & Professional portfolio management Discretionary: Unlike other proposals and previous programmes, CoinShares will be the manager of the PSM/MakerDAO AND the entity in charge of managing the portfolio. Independent: The portfolio management will be discretionary in the sense that the management will not use (i) intermediaries or (ii) third-party delegates to manage the portfolio, and this is the only proposal ever presented at MakerDAO. Active: Unlike other proposals and previous programmes, our proposition is based on active portfolio management in order to provide a (i) personalised service (ii) free from the passive management of ETFs without added value. Professional: CoinShares is the most regulated group in the crypto ecosystem with :  Its holding company listed on Nasdaq First North Growth Market. Two of its entities licensed as regulated Asset Management Companies (in Jersey by the JFSC & in France by the AMF). One entity registered as Digital Asset Services Providers (in Jersey by the JFSC) and one in the process of registration (France). One Appointed Representative (United Kingdom) entity. Products listed on the main European marketplaces (SIX, Xetra, Euronext, etc.).  Licences that can be obtained on request, especially on the European continent, reflect human, technological and control resources that are evaluated and monitored by regulators. Low intermediation of service and structuring: Unlike other proposals and previous programmes, we propose to concentrate nearly every service at CoinShares, MakerDAO’s direct counterparty, with the exception of asset custody, which must be external. We believe that MakerDAO’s RWA strategy should not be at the expense of disintermediation driven by the digital asset revolution. It seems to us that our proposal is the only one that presents a certain level of disintermediation. CoinShares will be your service provider, your counterpart, and your portfolio manager. It differentiates us from other highly intermediated and outsourced MIPs and seems, to us, to be a good compromise between the use of RWAs and the need to remain decentralised. Finally, CoinShares has a decade of experience in regulatory and legal issues when it comes to financial and crypto projects. We created the first regulated Bitcoin fund, and we assist many foundations in their regulatory issues. Therefore, our experienced legal team is ready to assist MakerDAO with the legal set-up and the establishment of the corporate structure. We are well aware of the difficulties that DAOs or Foundations have in organising themselves and setting up projects of this magnitude. CoinShares is ready to help you, acting as an advisor to the Core Strategic Unit. You are receiving more and more MIPs and it is imperative that you put in place proper due diligence. We would be delighted to assist you in this regard, in the most neutral way possible, of course. Please feel free to ask any questions you may have. The CoinShares Team   References  https://coinshares.com/  https://mips.makerdao.com/mips/details/MIP13c3SP12 Investing our liquidity in short-term ETF, managing PSMs exposures TrustExplorer by Armanino: Real-Time Attest for CoinShares Physical TrustExplorer by Armanino: Real-Time Attest for CoinShares XBT Provider Komainu to Support UK Law Enforcement in the Fight Against Crime Involving Digital Assets FlowBank’s investor CoinShares increases its stake Invesco enters crypto ETP space with bitcoin launch Secured Overnight Financing Rate Data - FEDERAL RESERVE BANK of NEW YORK   Legal Disclaimer: The information contained in this document is for general information only. Nothing in this document should be interpreted as constituting an offer of (or any solicitation in connection with) any investment products or services by any member of the CoinShares Group where it may be illegal to do so. Access to any investment products or services of the CoinShares Group is in all cases subject to the applicable laws and regulations relating thereto. Although produced with reasonable care and skill, no representation should be taken as having been given that this document is an exhaustive analysis of all of the considerations which its subject matter may give rise to. This document fairly represents the opinions and sentiments of CoinShares as of the date of its issuance, but it should be noted that such opinions and sentiments may be revised from time to time, for example in light of experience and further developments, and this document may not necessarily be updated to reflect the same. The information presented in this document has been developed internally and/or obtained from sources believed to be reliable; however, CoinShares does not guarantee the accuracy, adequacy, or completeness of such information. Predictions, opinions, and other information contained in this document are subject to change continually and without notice of any kind and may no longer be true after the date indicated. Third-party data providers make no warranties or representation of any kind in relation to the use of any of their data in this document. CoinShares does not accept any liability whatsoever for any direct, indirect, or consequential loss arising from any use of this document or its contents. Any forward-looking statements speak only as of the date they are made, and CoinShares assumes no duty to update forward-looking statements and does not undertake any. Forward-looking statements are subject to numerous assumptions, risks, and uncertainties, which change over time. Nothing within this document constitutes (or should be construed as being) investment, legal, tax, or other advice. This document should not be used as the basis for any investment decision(s) that a reader thereof may be considering. Any potential investor in digital assets, even if experienced and affluent, is strongly recommended to seek independent financial advice upon the merits of the same in the context of their own unique circumstances. This content is not directed at nor intended for use by the MakerDAO community (“MakerDAO”), and may not under any circumstances be relied upon when making an investment decision. The digital assets referenced herein currently face an uncertain regulatory landscape in not only the United States but also in many foreign jurisdictions, including but not limited to the UK, European Union, Singapore, Korea, Japan, and China. For guidance regarding the possibility of said risks, one should consult with his or her own appropriate legal and/or regulatory counsel. Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any decision. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others. The proposed service is subject to risks, including the risk of capital loss, discretionary management risk, credit risk, counterparty risk, currency risk, and liquidity risk. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP13c3SP12",
                        "https://mips.makerdao.com/mips/details/MIP13c3SP12",
                        "https://www.youtube.com/watch?v=2rTpyLEq6yg",
                        "https://docs.google.com/presentation/d/1dQih700zoCmv3G_KrlYVt0IsZxGFMq92IH2V29-UwDk/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1Tp1r8wfgQW1_LXqfzg4jFumafgUjdF11-XSgEiqRIw8/edit?usp=sharing",
                        "https://docs.google.com/document/d/1UTGMh_CpLiIg04x_XcvKn72etp6tTew2pU0GfQhKu-c/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1Tp1r8wfgQW1_LXqfzg4jFumafgUjdF11-XSgEiqRIw8/edit?usp=sharing",
                        "https://www.armaninollp.com/press-releases/armanino-provides-real-time-attest-digital-asset-investment-firm-coinshares/",
                        "https://www.prnewswire.co.uk/news-releases/komainu-to-support-uk-law-enforcement-in-the-fight-against-crime-involving-digital-assets-803987511.html",
                        "https://coinshares.com/",
                        "https://mips.makerdao.com/mips/details/MIP13c3SP12#context-and-motivation",
                        "https://forum.makerdao.com/t/investing-our-liquidity-in-short-term-etf-managing-psms-exposures/10891",
                        "https://real-time-attest.trustexplorer.io/coinshares/physical",
                        "https://real-time-attest.trustexplorer.io/coinshares/xbt-provider",
                        "https://www.prnewswire.co.uk/news-releases/komainu-to-support-uk-law-enforcement-in-the-fight-against-crime-involving-digital-assets-803987511.html",
                        "https://www.flowbank.com/en/pr/flowbanks-investor-coinshares-increases-its-stake",
                        "https://www.etfstream.com/news/invesco-enters-crypto-etp-space-with-bitcoin-launch",
                        "https://www.newyorkfed.org/markets/reference-rates/sofr",
                        "https://forum.makerdao.com/t/know-your-mip-14-coinshares-treasury-investment-program/18335",
                        "https://forum.makerdao.com/t/mip87-ousd-decentralized-rewards/18216",
                        "https://forum.makerdao.com/t/growth-cu-update-north-america-nov-2022/18762",
                        "https://forum.makerdao.com/t/weekly-mips-update-112/18708",
                        "https://forum.makerdao.com/t/actualizacion-mensual-de-la-cu-de-growth-septiembre-del-2022-traduccion/18691",
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407/6",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-september-2022/18686",
                        "https://forum.makerdao.com/t/weekly-mips-update-111/18610",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/31",
                        "https://forum.makerdao.com/t/mip87-ousd-decentralized-rewards/18216/15",
                        "https://forum.makerdao.com/t/weekly-mips-update-110/18493",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/137",
                        "https://forum.makerdao.com/t/weekly-mips-update-109/18404",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/33",
                        "https://forum.makerdao.com/t/weekly-mips-update-108/18310",
                        "https://forum.makerdao.com/t/weekly-mips-update-107/18199",
                        "https://forum.makerdao.com/t/weekly-mip-update-106/18103",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022/42",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/112",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/9",
                        "https://forum.makerdao.com/t/growth-cu-end-of-2022-review/19194",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/31",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/29",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/42",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/24"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.532878048992508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#2",
                    "likes": "3",
                    "time": "14/09/2022-10:06:29",
                    "content": "Great to see another compelling proposal. We are well on our way to managing our PSM much more productively. Diversified jurisdictions and counterparties go a long way in removing idiosyncratic exposure. We need to start thinking about how to structure these proposals in as automated a way as possible, as well as knock-on effects on Dai as a product to remain competitive as a stablecoin. Look forward to community questions and feedback.  image1469×752 112 KB  Edit: changed the MIP number thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#3",
                    "likes": "1",
                    "time": "14/09/2022-10:08:28",
                    "content": "Hi, Thanks for your quick reply. I think our MIP is 86 and not 84. Best ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "2",
                    "time": "14/09/2022-10:26:50",
                    "content": "    CoinSharesCo:  The portfolio’s outperformance (hypothetical and non-binding) against SOFR capitalised daily over the investment period, will be divided as follows: 1/3 for Maker, 1/3 for CoinShares, and the last 1/3 for CoinShares to acquire Maker tokens exclusively. CoinShares wants to align with Maker’s interests and make a long-term commitment to governance, both for the success of the operation and for Maker’s potential to be a pioneer in the collaboration between DeFi and TradFi. Based on these statements, our projections below would generate, at the end of 2025:  36,151,111$ to MakerDAO 4,611,111$ to CoinShares 6,495 MKR tokens (worth 4,611,111$ as of 09/13/22) to CoinShares    Thank you for putting together this MIP and welcome to the MakerDAO community. I must say, it provides a lot more information compared to MIP81 “Coinbase Institutional Rewards”   With regards to the above  example of the possible Portfolio Returns — I think you need to make it more clear that MakerDAO gets 100% of the SOFR (currently 2.28%) and then you divide the outer-performance hypothesis of 100 basis points by 1/3, 1/3, and 1/3. Is that right, or am I misunderstanding the “Portfolio Estimated Returns Example”?     CoinSharesCo:  The investment will allow for being unwound within seven (7) business hours under normal market circumstances (following a MakerDAO executive vote).   Is it 7 hours because you price to Market/calculate NAV at Market close? Trying to understand why 7 hours and not 2 (as an example). And last but not least you’re going to liquidate USDC and acquire short-term bonds? And then if need be liquidate those bonds and return the proceeds/original funds in DAI, USDC, stakedETH, etc. (as examples) back to MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.864661654135338
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#5",
                    "likes": "0",
                    "time": "14/09/2022-11:54:05",
                    "content": "The “pay ~0.6% of your total equity aka at current prices ~12% of expected profits for parking the assets at SOFR” part lost me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#6",
                    "likes": "0",
                    "time": "14/09/2022-12:38:12",
                    "content": "    flipflopflapdelegate:  Is it 7 hours because you price to Market/calculate NAV at Market close? Trying to understand why 7 hours and not 2 (as an example).   I was wondering the same thing and figured it might have something to do with the typical 7 hour work day but in this space that just might not be applicable. I would also like to know what we mean by “normal market conditions” and whether the “market” is the crypto market or something else. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.588541666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#7",
                    "likes": "4",
                    "time": "14/09/2022-12:56:03",
                    "content": "Thank you for all your comments, we will come back to you regularly (once or twice a week) with full answers to your questions. It is easier for us to summarise them and answer them in one go. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/09/2022-13:32:06",
                    "content": "Couldnt agree more! Good to see this kind of proposal in the forum. Quick question, in the graph I noticed that the bucket allocation is 10% allocation for 1block to days durarion. Would that be in reference to all of DAI or just the USDC/PSM? What would 10% represent? Since this proposal is for 500M DAI how does that fit into DAI’s forecasted liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.658333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "2",
                    "time": "14/09/2022-19:28:05",
                    "content": "    TRUEMAKER:  Quick question, in the graph I noticed that the bucket allocation is 10% allocation for 1block to days durarion   This is coming from the DAI maturity profile. Under this model, we need to keep 20% of DAI liquid within a day and 10% within a week. It’s a percentage of circulating DAI. MIP86 would be in the bottom bucket as probably not good as a first or second line of defense of the peg, but more to provide strong revenues. As precised in the MIP, it could be redeem quickly but with a possible loss. The differents MIPs on th bottom part of the chart provides alternatives for Governance to decide. Better to diversify counterparties? Better to focus on one? What risk/reward cursor to chose? That Governance to decide. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#10",
                    "likes": "0",
                    "time": "14/09/2022-21:21:55",
                    "content": "@CoinSharesCo: How will you respond if OFAC sanctioned parties are found to be be using DAI, and Maker is unable to do anything about it because DAI cannot be blacklisted or censored? What will you do if that happens? This is a serious question so please give it a serious answer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.055555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#11",
                    "likes": "0",
                    "time": "14/09/2022-23:25:17",
                    "content": "Why would CoinShares care about DAI? The investment program is for Maker’s USDC.     CoinSharesCo:  MIP86 will establish a secured and flexible first collaboration between CoinShares and MakerDAO to deploy USDC 500m (13%) of PSM’s with CoinShares.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#12",
                    "likes": "1",
                    "time": "15/09/2022-05:33:48",
                    "content": "excellent proposal, superior to Coinbase’s. Nontheless i have questions:  You are a regulated entity, are your audited financial statements available to us? This a request from all lenders part and parcel for KYC and risk assessment. Are you a going concern? SO your strategy is arbitrage on safe investments such as Tbonds, any assurance the investment strategy will not go awry?  Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#13",
                    "likes": "2",
                    "time": "15/09/2022-07:36:55",
                    "content": "CoinShares is a tenth the size of Coinbase in valuation.  Similar questions on what happens in bankruptcy should be addressed.  However, they seem to operate pretty efficiently and has had positive cash flows with only an exception last quarter due to Terra resulting in a small loss.  Being able to stay profitable even through huge cuts in crypto prices makes me more confident that bankruptcy risks are also low here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.834280303030304
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#14",
                    "likes": "0",
                    "time": "15/09/2022-13:46:42",
                    "content": "    TRUEMAKER:  Why would CoinShares care about DAI? The investment program is for Maker’s USDC.   Custodying the USDC that’s backing the DAI that’s being used to violate sanctions could be construed as enabling the violation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#15",
                    "likes": "3",
                    "time": "15/09/2022-18:10:23",
                    "content": "Thanks for this proposal @CoinSharesCo, appreciate the time and effort put in. My question relates to the following (emphasis added):     CoinSharesCo:  The portfolio’s outperformance (hypothetical and non-binding) against SOFR capitalised daily over the investment period, will be divided as follows: 1/3 for Maker, 1/3 for CoinShares, and the last 1/3 for CoinShares to acquire Maker tokens exclusively.   Could I request some more detail on this outperformance distribution:  By “exclusive”, I assume you mean that that proportion (1/3) of portfolio outperformance will be used exclusively to acquire Maker tokens, rather than that CoinShares gets some kind of exclusive right to acquire MKR? The language is a little unclear, so wanted to check. The latter reading would be unworkable. What do you propose specifically as the acquisition process for this MKR, and who is it being acquired from? Alternatively, is this provision instead intended to be a commitment to use those outperformance funds to market buy MKR?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.542857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#16",
                    "likes": "3",
                    "time": "15/09/2022-18:21:04",
                    "content": "    fumoffuXx:  excellent proposal, superior to Coinbase’s.   Its difficult to compare given that the proposals have different duration, liquidity, investments and counterparty risks. Both investment programs are beneficial to Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#17",
                    "likes": "0",
                    "time": "15/09/2022-23:07:57",
                    "content": "Yea, I think all details are necessary before making such a judgment. I feel like it’s comparing apples to oranges but I’m pleased to see these MIPs being put out there and look forward to keeping the discussions going. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#18",
                    "likes": "2",
                    "time": "21/09/2022-08:50:51",
                    "content": "Dear MakerDAO community, thank you for your insightful comments and questions, please find below our weekly review of your questions. –     MIP86: CoinShares USDC Institutional Rewards RFC       Thank you for putting together this MIP and welcome to the MakerDAO community. I must say, it provides a lot more information compared to MIP81 “Coinbase Institutional Rewards”    With regards to the above  example of the possible Portfolio Returns — I think you need to make it more clear that MakerDAO gets 100% of the SOFR (currently 2.28%) and then you divide the outer-performance hypothesis of 100 basis points by 1/3, 1/3, and 1/3. Is that right, or am I misund…      SOFR out-performance This is the correct assumption. We’ve edited our proposal to make it clear. Unwinding of investment We edited our post. We meant 7 business “days” not 7 business “hours”. It is a conservative assumption to liquidate the portfolio in normal market and liquidity periods in order to protect the DAO’s assets. USDC conversion At first, we will swap MakerDAO’s USDC for USD or any other FIAT currency we deem appropriate in order to implement the investment policy. Any income from the holding of assets (e.g. coupons) will be in FIAT currency. The which will then be converted into USDC and sent back to MakerDAO.  –     MIP86: CoinShares USDC Institutional Rewards RFC       I was wondering the same thing and figured it might have something to do with the typical 7 hour work day but in this space that just might not be applicable.  I would also like to know what we mean by “normal market conditions” and whether the “market” is the crypto market or something else.      There is no regulatory definition or even regulators’ doctrine on the notion of “normal” or “abnormal” market conditions. It is up to each asset manager, as part of its fiduciary duty to act in the best interests of its clients at all times, to define the risk management framework for identifying the different risk and liquidity regimes of the portfolios under management. To this end, CoinShares has a Risk Management Policy that addresses the monitoring of liquidity of assets, including bonds. Without being able to divulge too much about the details of this liquidity risk monitoring system, the following is an outline of the system:  Large issue size: Simply speaking the larger the issue the more liquid a bond is likely to be meaning there is a larger, deeper, broader market and the more easily tradable it is. Bloomberg pricing service (BVAL) score: Drawing on real-time observations from an array of contributors Bloomberg Liquidity Assessment (LQA) score: LQA leverages Bloomberg’s robust financial data sets to provide data-driven quantitative evaluation of market liquidity.  –     MIP86: CoinShares USDC Institutional Rewards RFC       The “pay ~0.6% of your total equity aka at current prices ~12% of expected profits for parking the assets at SOFR” part lost me.      We don’t think you should take CoinShares’ valuation as a point of reference. Our income is much more interesting. In 2021 CoinShares’ total comprehensive income was £113,443,438. According to our assumptions (1% of over performance of SOFR) the first year CoinShares will earn $2.5M, meaning approximately 2% of 2021 income. –     MIP86: CoinShares USDC Institutional Rewards RFC   @CoinSharesCo:  How will you respond if OFAC sanctioned parties are found to be be using DAI, and Maker is unable to do anything about it because DAI cannot be blacklisted or censored?  What will you do if that happens?  This is a serious question so please give it a serious answer.      CoinShares will be the manager to whom the management of part of the assets will be delegated. CoinShares, as a regulated group, will have to verify the legal and non-risky origin of the USDC that will be entrusted to the management. This initial due diligence will be performed by both Komainu, as the custodian, and CoinShares, as the investment manager with first-class “Know Your Transactions” tools. Beyond this mandatory due diligence, CoinShares does not consider itself to be at risk with respect to the DAI and the potential uses to which it may be put. In no case shall the lawful collateral (of an asset) be incriminated by the asset it collateralises, unless the initial collusion of the parties is proven. –    MIP86: CoinShares USDC Institutional Rewards RFC       Custodying the USDC that’s backing the DAI that’s being used to violate sanctions could be construed as enabling the violation.      In no case shall the lawful collateral (of an asset be incriminated by the asset it collateralises, unless the initial collusion of the parties is proven. –     MIP86: CoinShares USDC Institutional Rewards RFC       excellent proposal, superior to Coinbase’s. Nontheless i have questions:   You are a regulated entity, are your audited financial statements available to us? This a request from all lenders part and parcel for KYC and risk assessment. Are you a going concern? SO your strategy is arbitrage on safe investments such as Tbonds, any assurance the investment strategy will not go awry?  Thanks.      Regulation As you all know, CoinShares is a public company listed in Nasdaq First North Growth Market (ticket : CS) .Therefore, everything is public on our Investor Relations website :   Investor Relations Annual Reports — CoinShares September 2022 - BTIG CoinShares Equity Research  Management team CoinShares was formerly Global Advisors International which was founded in 1999. With a 16 year track record of managing client funds as a regulated investment manager originally in the commodity markets. Global Advisors became CoinShares in 2013. Since 2013, CoinShares has offered digital asset exposure and undertaken digital asset trading activities. Over the course of the past eight years, the Company has grown to become Europe’s largest full-service digital asset investment and trading group, launched a range of products and funds referencing digital assets, and provided exposure to digital assets to a global investor base.   Investment Strategy CoinShares has put in place, through the experience of its teams and its various regulated statutes, an organisation and a risk management system that allows it to stand before you confident in its ability to deliver the management objective on behalf of MakerDAO. However, we would like to remind you that investment and portfolio management always involves a certain number of risks, including the risk of capital loss. Any person or entity that would be able to promote the absence of a problem or risk should not otherwise be trusted blindly. Investing always involves risk, it is a matter of identifying and quantifying the risk one is prepared to take  –    MIP86: CoinShares USDC Institutional Rewards RFC       CoinShares is a tenth the size of Coinbase in valuation.  Similar questions on what happens in bankruptcy should be addressed.  However, they seem to operate pretty efficiently and has had positive cash flows with only an exception last quarter due to Terra resulting in a small loss.  Being able to stay profitable even through huge cuts in crypto prices makes me more confident that bankruptcy risks are also low here.      The planned structuring will aim to protect against any risk of bankruptcy and continuity of the assets entrusted by MarkerDAO. We are considering a bankruptcy-remote structuring for the assets entrusted by MarkerDAO by segregating these assets from CoinShares. This has been a long-standing practice of CoinShares in connection with the management of the XBT Provider and CoinShares Physical ETPs. The technical and legal details of this segregation will be discussed with MakerDAO. –    MIP86: CoinShares USDC Institutional Rewards RFC       Thanks for this proposal @CoinSharesCo, appreciate the time and effort put in. My question relates to the following (emphasis added):   Could I request some more detail on this outperformance distribution:   By “exclusive”, I assume you mean that that proportion (1/3) of portfolio outperformance will be used exclusively to acquire Maker tokens, rather than that CoinShares gets some kind of exclusive right to acquire MKR? The language is a little unclear, so wanted to check. The latter reading wo…       Outperformance 100% of the SOFR annualised performance will be distributed to MakerDAO in USDC. In case of outperformance: ⅓ of this outperformance will be distributed to MakerDAO in USDC; ⅓ of this outperformance will be distributed to CoinShares in USDC who may make free use of it; ⅓ of this outperformance will be distributed to CoinShares in USDC to acquire $MKR tokens.   MKR Acquisition MKR token will directly acquire from liquid markets (centralised and decentralised exchanges). The provision is indeed a commitment to market-buy MKR.   –    MIP86: CoinShares USDC Institutional Rewards RFC       Its difficult to compare given that the proposals have different duration, liquidity, investments and counterparty risks. Both investment programs are beneficial to Maker.      Indeed, the two proposals cannot and should not be fully compared. – Thank you all for your interest. Let’s continue the discussion with these additional clarifications. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/6",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/5",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/10",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/14",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/12",
                        "https://coinshares.com/investor-relations",
                        "https://coinshares.com/investor-relations/reports-portal/annual-reports#2021-annual-report",
                        "https://coinshares.com/assets/documents/2937eeb5_11fc_4307_b5ad_50a147f1650c.pdf",
                        "https://coinshares.com/investor-relations",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/13",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/15",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/16"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.556296914095079
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#19",
                    "likes": "0",
                    "time": "21/09/2022-10:39:59",
                    "content": "    CoinSharesCo:  We don’t think you should take CoinShares’ valuation as a point of reference. Our income is much more interesting. In 2021 CoinShares’ total comprehensive income was £113,443,438. According to our assumptions (1% of over performance of SOFR) the first year CoinShares will earn $2.5M, meaning approximately 2% of 2021 income.   Rereading your proposal, I see that I misunderstood and that you are proposing to 1) pocket 2/3 of the outperformance against SOFR and 2) commit to use 1/2 of that to buy MKR tokens on the open market. Is that correct? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#20",
                    "likes": "0",
                    "time": "21/09/2022-11:45:17",
                    "content": "    CoinSharesCo:  It is up to each asset manager, as part of its fiduciary duty to act in the best interests of its clients at all times, to define the risk management framework for identifying the different risk and liquidity regimes of the portfolios under management.   Thank you so much for the responses, they are very helpful. I just want to make sure I understand something. The asset manager would be CoinShares or someone from CoinShares ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#21",
                    "likes": "0",
                    "time": "21/09/2022-12:21:02",
                    "content": "Yes It is. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#22",
                    "likes": "0",
                    "time": "21/09/2022-12:25:33",
                    "content": "CoinShares would be the AM, we don’t plan to outsource it. Our team would be in charge of managing MakerDAO’s assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#23",
                    "likes": "0",
                    "time": "21/09/2022-17:54:00",
                    "content": "    CoinSharesCo:  USDC conversion At first, we will swap MakerDAO’s USDC for USD or any other FIAT currency we deem appropriate in order to implement the investment policy. Any income from the holding of assets (e.g. coupons) will be in FIAT currency. The which will then be converted into USDC and sent back to MakerDAO.   Who is assuming the conversion costs (i.e. USDC to Fiat and vice versa)? Are they split between MKR and Coinshares or taken out the net return? Gas fees and exchange rates are lower today but they might eat up a portion of the returns if market conditions change. Lastly, its interesting that the return is paid back to MKR in USDC and not DAI? Wouldnt we prefer it in DAI so that it gets added to the surplus buffer? @strat-fin-core-unit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.703125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#24",
                    "likes": "0",
                    "time": "21/09/2022-18:12:29",
                    "content": "Makes little difference if they swap the USDC for DAI in the PSM or we do ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#25",
                    "likes": "0",
                    "time": "21/09/2022-23:56:23",
                    "content": "Thanks. If I’m missing this please forgive me but is there a specific jurisdiction that will be governing the presumed agreement between Maker and CoinShares ? Is it Jersey or maybe something else? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#26",
                    "likes": "0",
                    "time": "22/09/2022-21:55:06",
                    "content": "    CoinSharesCo:  CoinShares Capital Markets   Thank you for answering my question above. With regards to the CoinShares Capital Markets team, per your 2021 annual report this team was responsible for the $17M loss courtesy of the TerraLuna debacle. What changes have been made internally, and what is the Parent company doing to make sure this does not occur again? Also, in your annual report you don’t mention MakerDAO in your views of DeFi’s potentials — what has changed—why the sudden interest in this protocol?  You also seem to be lagging in gaining market share for Eth Staking, has the focus of CoinShares shifted away from other L1s like Solana, Tezos, etc? You also hold liabilities of $3B++, and have Earnings Per Share of Negative $36++ (No bueno) and exposure to custodial services of tokens from XRP to ETC. How would the failure of any of these custodial tokens effect the overall health of CoinShares? How will MakerDAO’s assets survive a default, hack(like Wintermute just suffered), or CoinShars inability to stay solvent? Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.079166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#27",
                    "likes": "0",
                    "time": "22/09/2022-22:16:12",
                    "content": "    CoinSharesCo:  In no case shall the lawful collateral (of an asset be incriminated by the asset it collateralises, unless the initial collusion of the parties is proven.   Thank you for the response. Can you please share the legal basis for this statement? Are you quoting a statute, are you referring to some other sort of legal precedent, or are you just stating Coinshare’s opinion on the matter? Thanks again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.395833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#28",
                    "likes": "2",
                    "time": "22/09/2022-22:57:37",
                    "content": "    CoinSharesCo:  CoinShares, as a regulated group, will have to verify the legal and non-risky origin of the USDC that will be entrusted to the management.   Thank you for your proposal and these responses. The PSM is entirely permissionless and transparent, so we would like to hear more about what kind of verification of the existing risks you can perform and share during this RFC process. And further specify what CoinShares requires to have comfort that the USDC has a legal and non-risky origin. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PositiveGamma",
                    "index": "#29",
                    "likes": "1",
                    "time": "23/09/2022-16:56:56",
                    "content": "Thank you for a detailed proposal. SOFR is a benchmark for Secured Overnight Financing where the counterparty is giving Treasury securities in return. The proposed investment is in a basket of securities that have varying degrees of market risk, credit risk & liquidity risk. So, there is a substantial difference between the risk of the benchmark and the portfolio - and measuring/rewarding outperformance is not prudent. Will it be appropriate to choose a benchmark that reflects the risk being taken - Eg. Something from the Bloomberg family of indices that reflects the maturity & risk profile of the assets you are proposing? ",
                    "links": [
                        "https://www.bloomberg.com/professional/product/indices/bloomberg-fixed-income-indices/#/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#30",
                    "likes": "0",
                    "time": "30/09/2022-09:13:55",
                    "content": "Dear MakerDAO community, thank you for your new round of comments and questions, please find below our weekly review of your questions.     MIP86: CoinShares USDC Institutional Rewards RFC       Rereading your proposal, I see that I misunderstood and that you are proposing to 1) pocket 2/3 of the outperformance against SOFR and 2) commit to use 1/2 of that to buy MKR tokens on the open market. Is that correct?     Correct.     MIP86: CoinShares USDC Institutional Rewards RFC       Thank you so much for the responses, they are very helpful. I just want to make sure I understand something. The asset manager would be CoinShares or someone from CoinShares ?     The asset manager will be an entity of the CoinShares Group habilited, with his team, by a regulator to provide investment services.     MIP86: CoinShares USDC Institutional Rewards RFC       Who is assuming the conversion costs (i.e. USDC to Fiat and vice versa)? Are they split between MKR and Coinshares or taken out the net return? Gas fees and exchange rates are lower today but they might eat up a portion of the returns if market conditions change.  Lastly, its interesting that the return is paid back to MKR in USDC and not DAI? Wouldnt we prefer it in DAI so that it gets added to the surplus buffer? @strat-fin-core-unit   The portfolio will be charged for the conversion costs, performance being computed net of fees (including execution costs). It should also be noted that CoinShares, as a regulated investment company, has implemented, enforces and monitors the application of its Best Execution Policy. In doing so, it is CoinShares’ duty to execute all transactions (including conversions) in the best interests of its clients. Our unit of account being USDC we therefore plan to redistribute the returns  in USDC. If the community prefers a pay-back in DAI, we could consider it.     MIP86: CoinShares USDC Institutional Rewards RFC       Thanks. If I’m missing this please forgive me but is there a specific jurisdiction that will be governing the presumed agreement between Maker and CoinShares ? Is it Jersey or maybe something else?     This is a typical legal stage question. In general CoinShares’ agreements are governed under Jersey or U.K. Laws.     MIP86: CoinShares USDC Institutional Rewards RFC       Thank you for answering my question above. With regards to the CoinShares Capital Markets team, per your 2021 annual report this team was responsible for the $17M loss courtesy of the TerraLuna debacle. What changes have been made internally, and what is the Parent company doing to make sure this does not occur again?  Also, in your annual report you don’t mention MakerDAO in your views of DeFi’s potentials — what has changed—why the sudden interest in this protocol?  You also seem to be laggin…       Just, to remind you this loss was among our own DeFi lending book (approx. $400M) and we had a position of $100M UST. Thanks to our Capital Markets team, technology stack and Risk Management team we managed to redeem our position early enough to limit our losses to £17.7M. We never invested or traded LUNA tokens. Regarding the PSM, we would like to emphasise that the asset under CoinShares’ management will be totally segregated from our balance sheet (including our DeFi/Capital Market books).   CoinShares is extremely involved in DeFi with our Research team, a dedicated Solidity team, plus we historically interacted with DAI from time to time in our various DeFi activities. We are not lagging in gaining market shares in ETH Staking for our Asset Management products. We are constrained in offering them by the lock-up on stETH which are contradictory to our daily subscriptions/redemptions requirements as stated in our Products’ Offerings Documents & Prospectus. However, to make you perfectly comfortable we have been long time holders of stETH on Lido.   The vast majority of the liabilities held by the Group represent amounts due to holders of the Group’s ETPs, issued by two Group entities, CSDS and XBT. These liabilities are fully collateralised and hedged with digital asset holdings to match what is being referenced by the body of ETPs. Therefore, largely speaking our assets move in conjunction with our liabilities, ensuring digital asset price fluctuations do not impact the solvency of the Group. In respect of “failure of tokens”, from custodial services, we will assume you are talking here about assets on our balance sheet being misappropriated, which could be for a number of reasons. We hold our assets on a range of exchanges, with regulated custodians and a portion ourselves. There is an inherent risk in the industry, of which everyone is aware, of hacks/bad actors/external events (such as a de-pegging) which can, broadly speaking impact any location/method of storage. At CoinShares we are reliant upon our internal controls and tech stack to constantly monitor our assets and our counterparties to mitigate these risks to the extent possible. While no risk is ever reduced to zero, we have been operating for (in digital asset industry terms) a long time and never had an issue regarding the hedging & collateralising of our liabilities, nor our solvency, and continue to ensure our tech stack and trading and operations teams develop alongside the wider market in order to do everything in our power to reduce any risks that arise. The negative EPS is a bit of a red herring. EPS under IFRS is calculated using Profit After Tax, and we are obliged to present this way in the preparation of our audited financials. This means the calculation is performed PRIOR to taking into account any increase in the value of digital assets we hold (due to their classification as intangible assets). We also include (please see p.72 of our annual report) an alternative statement of comprehensive income which calculates adjusted EPS, taking into account our significant gains on digital asset holdings, which is  1.70 per share, or 1.62 per share on a diluted basis.       MIP86: CoinShares USDC Institutional Rewards RFC       Thank you for the response. Can you please share the legal basis for this statement? Are you quoting a statute, are you referring to some other sort of legal precedent, or are you just stating Coinshare’s opinion on the matter? Thanks again.     Of course this is CoinShares’ opinion supported by our Legal & Compliance expertise and technical knowledge in this field. As a reminder, CoinShares will never take full ownership of MakerDAO’s assets. If this situation were to happen, it should be managed by MakerDAO, CoinShares only acting as a service provider for MakerDAO.     MIP86: CoinShares USDC Institutional Rewards RFC       Thank you for your proposal and these responses. The PSM is entirely permissionless and transparent, so we would like to hear more about what kind of verification of the existing risks you can perform and share during this RFC process. And further specify what CoinShares requires to have comfort that the USDC has a legal and non-risky origin.     Our compliance and AML risk management framework will lead CoinShares to perform mandatory due diligence (KYC) on the counterparty to the management contract. Although the PSM is permissionless and transparent, a legal entity will in all cases be required to enter into an investment agreement with us. We will also perform due diligence on the wallet(s) that will send us the assets to be managed (KYT) using the most advanced solutions on the market today that cross-reference thousands of historical transaction data with a risk score related to several dozen factors.     MIP86: CoinShares USDC Institutional Rewards RFC       Thank you for a detailed proposal.  SOFR is a benchmark for Secured Overnight Financing where the counterparty is giving Treasury securities in return. The proposed investment is in a basket of securities that have varying degrees of market risk, credit risk & liquidity risk. So, there is a substantial difference between the risk of the benchmark and the portfolio - and measuring/rewarding outperformance is not prudent.  Will it be appropriate to choose a benchmark that reflects the risk being t…     We understand in MakerDAO’s MIP13c3-SP12: Declaration of Intent - Invest in Short-Term Bonds that the investment objective is to “target yield to maturity (…) between 2-year treasuries before structural costs and at least 50bps (3-month t-bills) after all structural costs”. In our opinion this is perfectly reflected by our proposed SOFR benchmark which is also accounting for a dynamic FED Policy. We also understand that the investment strategy is supposed to be “Safe”, “Flexible” and “Cost effective” for MakerDAO and its assets. Thank you ",
                    "links": [
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/20",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/23",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/25",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/26",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/27",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/28",
                        "https://forum.makerdao.com/t/mip86-coinshares-usdc-institutional-rewards/17900/29",
                        "https://www.newyorkfed.org/markets/reference-rates/sofr"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.638207817087127
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#31",
                    "likes": "2",
                    "time": "05/10/2022-09:09:21",
                    "content": "Dear MakerDAO community, We will be holding a live call to address any outstanding questions with our CEO and CFO by the second half of October. In this regard, please submit your questions below so that we have time to properly prepare the answer. The call will be facilitated by a key contributor to governance, namely GFX Labs. The link will be shared here at a later date. Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3354978354978355
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#33",
                    "likes": "1",
                    "time": "10/10/2022-18:03:21",
                    "content": "It would be very helpful to see the key differentiators between this proposal and the other safe, liquid asset proposals are getting(MIP65, MIP81, MIP82, Gemini, etc). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nonstopTheo",
                    "index": "#34",
                    "likes": "0",
                    "time": "17/10/2022-17:17:00",
                    "content": "Coinshares charging a 33% promote over the SOFR is way too high! Hedge Funds charge - what - 20% over a hurdle rate (which is definitely higher than the SOFR). @Coinshares: You need to justify these fees. MakerDAO would be massively overpaying. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#35",
                    "likes": "0",
                    "time": "17/10/2022-17:24:17",
                    "content": "Do hedge funds provide weekly liquidity? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nonstopTheo",
                    "index": "#36",
                    "likes": "0",
                    "time": "17/10/2022-17:29:50",
                    "content": "Depends on the HF but that’s not the issue. It’s the service that comes at a certain cost. The CoinShares promote just looks very high esp as their hurdle rate (ie performance benchmark) is incredibly low. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.703809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nonstopTheo",
                    "index": "#37",
                    "likes": "1",
                    "time": "17/10/2022-17:48:26",
                    "content": "One thing that requires more explanation:  The 2yrs USTreasuries yield ~4.5% CoinShares models 2.28% SOFR +1% Outperformance = 3.38% Why would MakerDAO accept such performance discrepancy? Surely, 2yr USTs must be as liquid (or even more) than IG Corp Bonds.  Given this investment mandate assumes bonds with credit risks that are higher than the US govt, CoinShares needs to have stronger incentives to outperform the 2yr UST. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#39",
                    "likes": "2",
                    "time": "18/10/2022-14:42:53",
                    "content": "First of all, our proposal is based on the assumption (verified) that we are professional investors and know how to invest and trade fixed income instruments. Our fee model is based on the simple process that if we don’t perform, we don’t get paid. To define performance, we offered the replacement of LIBOR i.e SOFR. LIBOR and SOFR are dynamic so in a volatile interest rate environment, not locking the benchmark at 3% for instance allows MakerDAO to benefit from the upside of an aggressive rate hiking policy and avoid MakerDAO making discrete speculation about the direction of travel of the FOMC. There is merit in being indexed on their decision from a MakerDAO perspective. Now - refreshing our numbers from the presentation - SOFR is 3.04% (and could continue to follow the rise in rates), and our current portfolio, as presented, could give an annualised return of around 6.75%. Please note we are explicitly transparent about that. Assuming, all things being equal, it would mean that MakerDAO could receive 3.04%+((6.75%-3.04%)*1/3) = 4.28%. This could leave 2.47% for CoinShares (these are assumptions). Out of this 2.47%, 1.235% would be re-invested in MakerDAO and locked in a visible and transparent manner for 2 years to:  highlight our commitment to MakerDAO project align our incentive with the community provide stewardship and governance support by becoming an active member of the governance.  Side note, the duration risk of our portfolio is 1.2 years, with around 50% of the portfolio planned to be invested in floating and variable rate bonds to provide protection against the potential for further rate hikes. Whilst CoinShares agrees that holding the US 2 years Treasury is a sensible way of locking in 4.5%, this is far from being a risk-managed approach in the current volatile rate environment we are living. Our solution allows MakerDAO not to cap the upside whilst having similar volatility characteristics as the US 2 years Treasury. In that sense, we believe it is a superior solution for the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.51593137254902
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#40",
                    "likes": "3",
                    "time": "18/10/2022-18:26:59",
                    "content": "This is our presentation at Know your MIP #14. If some of you missed the presentation, here is the video:      Thanks again for your time, we look forward to answering any questions you may have. ",
                    "links": [
                        "https://www.youtube.com/watch?v=2rTpyLEq6yg"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#41",
                    "likes": "3",
                    "time": "19/10/2022-08:27:59",
                    "content": "Thank you for your presentation yesterday, which I enjoyed. I have a few more questions:   How much AUM do you have in your bond management today?   How many years did your bond management outperform SOFR, and by how much did it surpass that benchmark?   Which year of your bond management program had the biggest drawdown and how much was that?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#42",
                    "likes": "0",
                    "time": "25/10/2022-20:16:37",
                    "content": "1/ Our Fixed Income strategist currently oversees $450M (outside CoinShares - he is in the process of joining the team full time to help us accelerate our inhouse treasury management solutions. His contribution to our own treasury management has been significant), spread over several fixed-income strategies. He has been an expert in fixed income for 20 years with particular expertise in macroeconomics, bonds, and alternatives. 2/ Our Alpha Liquidity Strategy outperformed the main and most relevant benchmarks since 2014. Over the last three years the portfolio has achieved an annualised return of +1.27%, which is ahead of short-dated treasuries, and cash like investments. As you can imagine this has been achieved in extraordinary market conditions in 2022… It should be noted that the current rise in interest rates, coupled with the very short duration of our strategy, should mechanically lead to a significantly higher result over the coming months if our bond-picking strategy is successful.  803×568 41.7 KB  3/ The largest drawdown period was during C-19 in which the strategy declined c. 10% and then recovered within 3 months to return +5.67% over the calendar year. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1365740740740735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#43",
                    "likes": "4",
                    "time": "28/10/2022-13:49:37",
                    "content": "    CoinSharesCo:   02/01/2023: $25m aggregated value $25m 06/02/2023: $50m aggregated value $75m 06/03/2023: $100m aggregated value $175m 03/04/2023: $150m aggregated value $325m 02/05/2023: S175m aggregated value $500m    There is only an extremely small chance that Maker can actually commit to following this schedule due to the nature of our smart contract system. In fact, given they are all Mondays (assuming these dates are dd/mm/yyyy, I would prefer dates formatted yyyy-mm-dd for clarity), it might be even more difficult to guarantee. I hope the authors will accept some flexibility here if this MIP is passed by Governance. A note to anyone reviewing or voting on this proposal. There is no provision within the text for a legal assessment or technical assessment on behalf of MakerDAO. This means that if approved the terms within the MIP will be carried out. (@Recognized-Delegates). I would strongly advise the author to include assessments of this nature on behalf of MakerDAO within the proposal prior to it being put to a vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.196924603174603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#45",
                    "likes": "1",
                    "time": "28/10/2022-16:30:57",
                    "content": "Hard to beat a risk-free rate of return like a CD.  Screen Shot 2022-10-28 at 9.22.37 AM1354×1626 348 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.270833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#46",
                    "likes": "2",
                    "time": "28/10/2022-18:09:25",
                    "content": "    CoinSharesCo:  The investment would —with a high degree of likelihood— be unwidable under stressed market situations within fourteen (14) business days — this scenario may generate losses for MakerDAO.       CoinSharesCo:  CoinShares plans to allow full transparency of investments made with MakerDAO USDC’s through dedicated tools accessible to everyone. Although originally from the traditional financial industry, CoinShares decided in 2013 to devote fully to digital assets because those new protocols allow for unparalleled transparency in transactions, contracts, and operation of protocols. With this in mind, CoinShares has partnered with Armanino LLP to provide investors with real-time transparency of CoinShares’ XBT Provider assets under management, and CoinShares Digital Asset Securities through Trust Explorer Real Time Asset .   Speaking personally and not on behalf of the CES CU. I think this is a great well thought out and professional proposal with a performance based fee that incentivizes everyone in the right direction. Some of my questions relate to the quoted points above and are as follows:   In terms of the investment strategies you utilize should Maker want to wind the investment down over a 14 day period what would be the “penalty” or potential downside to Maker for such an early termination - given the your investment horizon/policy seems to based on the next 36 months and the portfolio duration is 1.2 years  could you simulate the potential losses Maker would realize in terms of %?   I like the transparency aspect - in the info provided for Trust Explorer, they indicate that they run an oracle service that could write back to the blockchain is this what you have in mind ? and didnt see the info there but I assume we would have access to a Trust Explorer API?   Finally how flexible is the $500 million amount ie. is this the minimum that Coinshares would consider in terms of economies of scale? Asking this question as given the large number of investment options for MIP-13 and other RWAs and the differing terms and conditions, underlying duration of investments etc … I think it is imperative that MakerDao start conducting active ALM management and looking at these investments holistically? as opposed to assessing each MIP13 proposal independently …   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.496754582865694
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#47",
                    "likes": "0",
                    "time": "29/10/2022-13:37:38",
                    "content": "Hi, thank you for your feedback. We will come back on Monday with a finalized MIP without a schedule, this was just an example for the proposal. We think this schedule should be discussed after the vote and should be handled by MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#48",
                    "likes": "2",
                    "time": "30/10/2022-16:53:27",
                    "content": "1- MakerDAO could reduce its investment, or complete the contract before the maturity of the bonds, nevertheless this could have several negative consequences for the expected strategy results. In our view, the main challenge remains mark-to-market. As you know the price of the assets will fluctuate up and down sideways, consequently depending on the date MakerDAO wants to wind down its investment, we will have a MTM move either positive or negative. You should take into consideration that with this investment strategy, time is MakerDAO’s friend. Every single day that passes every single minute every single second MakerDAO would accrue income from national champion corporates and quasi-sovereign government bonds. However, the earlier investors exit the solution the bigger the risk that they will take a measurable hit because there is potential for the mark-to-market to go against them. To simplify the further the investor is away from the bond maturing the riskier it is. Let’s say MakerDAO wants to withdraw some of the investment, CoinShares would always take the most secure assets and utilize that as cash, for example, floaters or the shorter duration names. Because 5-10% of the portfolio is made of the most liquid and highly secure bonds our strategy can provide liquidity easily. We will provide on Tuesday some Delta modeling at certain times and provide an example of what MakerDAO might get if It decided to sell the entire portfolio down at 6 months, 1 year months and 18 months.  Back of envelope and to be confirmed later, we are talking basis points territory not points. 2 - TrustExplorer connects directly to our prime broker account through an API and will give to the MakerDAO community an instant view of the assets managed by CoinShares. We saw you used Dune Analytics for another MIP, we could easily implement such a solution nevertheless the big benefit of TrustExplorer is that assets are audited by an independent third-party US based Accounting and Audit firm: Armanino. 3 - This is an excellent question, and we definitely understand your point. Some of the bond sizes trade at a minimum of $100,000 consequently as mentioned in question one, the more assets we manage the less MakerDAO would be subject to mark-to-market and spread issues. We think this investment strategy is meaningful or MakerDAO if the minimum investment is $200M. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.507047216349542
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#49",
                    "likes": "0",
                    "time": "30/10/2022-17:30:10",
                    "content": "Hi all, I just wanted to inform you we updated CoinShares MIP86 before It is locked. We have tried to specify some points and to clarify the opportunity and the proposed investment strategy. I hope this will help you to better understand why we think such a strategy might be appropriate for MakerDAO. Thanks again for all your feedbacks and comments, It enabled us to drastically improve the MIP. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#50",
                    "likes": "0",
                    "time": "30/10/2022-18:45:36",
                    "content": "Thank you for your response - this is really useful information and I look forward to seeing the Delta modelling - because I think this information would be useful in ensuring the community is aware of the potential impact of early liquidation. And will facilitate the communities understanding as to why this investment is sized right from a holistic MakerDao global ALM perspective. One final confirmation - with respect to the underlying portfolio investment and their custody - will their be any rehypothecation of the underlying investments? or any income generated from securities lending on the portfolio? … ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.772321428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#51",
                    "likes": "2",
                    "time": "31/10/2022-15:55:36",
                    "content": "1/ “One final confirmation - with respect to the underlying portfolio investment and their custody - will their be any rehypothecation of the underlying investments? or any income generated from securities lending on the portfolio? …” CoinShares will not use what are called ‘efficient portfolio management techniques’. This means that we will not carry out securities lending operations, as well as repurchase agreements, reverse repurchase agreement transactions and collateral re-use/re-hypothecation. 2/ Regarding the delta modeling and your very first question: “Should Maker want to unwind the investment down over a 14-day period what would be the ‘penalty’ or potential downside risk to Marker for an early termination – your investment horizon seems to be based on the next 36 month and portfolio duration is 1.2 yrs. Can you stimulate potential losses?” Summary: We estimate that taking into consideration some rather severe haircuts to allow for the potential of the following:  Continued market volatility Not our base case The pull to par dragging The bond will price with limited upward pull to par price movement in the first 12 months. Bid-offer spread widening Given the large size of most issues, there is a limited bid-offer spread in the names in the portfolio. However, we have increased the potential here to demonstrate liquidity stress.  This provides us with almost a 'worst-case scenario over the next 12 months of the following return stream:  We will expand on this response. The portfolio is designed to provide returns of +2.25% over SOFR over a 36-month rolling period. The portfolio can be liquidated readily in normal market conditions. However, to commence collecting capital from income and mark-market movements (MTM), the optimal holding period should be for the least 6-months, thus negating fees, costs and impact of the bid-offer spread. Given the question requires us to investigate the future somewhat, we can establish what we know now: Credit   The portfolio has a parent credit rating of AA-. The portfolio primarily invests in national champion corporate issuers that are imperative to their national or regional economy. These are blended with government agency bonds (36%). We seek out those nations with solid balance sheets that can provide investors with value, income, and security.   This approach minimised credit risk. We have stress-tested the portfolio against ten of the most severe events in 20 years, and the portfolio would not have suffered a default. This, combined with the high credit quality and government backing, reduced credit risk as a primary concern.   Income   If invested today, we know the portfolio has a running yield of 3.34%, meaning each quarter, the portfolio accrues 0.85% in income or 0.0093% per day.   Regardless of the price movement of the underlying instruments, income will always be accrued.   Capital   Throughout 2022, the macroeconomic climate has been very challenging. This challenging outlook has already been priced into many bonds which have sold off this year. This sell-off means that at present c. 91% is currently trading below par (100).   Given the limited credit risk in the portfolio, we expect that all bonds will mature or be called at par (100). This means the portfolio will benefit from pull to par. Pull to par is a bond’s price movement toward its face value (100) as it approaches its maturity date. Currently, 91% of the bonds in the portfolio are trading at a discount, which is lower than par. Meaning as they get close to maturity, their value will increase.   For example, Sumitomo 0.85% 2024 is currently priced at $93.48 it will mature at $100 in March 2024. As a result, this bond will experience a pull to a par of 6.52%.   Even if the price is volatile between now and the bond’s maturity date, given the high credit quality nature of the holdings, they are likely to pull to par. As such, the portfolio will achieve a capital uplift.   The longer the holding period, the more confident the uplift in the capital.   At present, the average discount on the bonds in the portfolio is 4.26%. Thus reflecting the average price of bonds in the portfolio of $95.74.   Given the maturity and duration profile of the portfolio in which bonds do not mature for c. 12 months, investors will not receive the full benefit of the pull to par if they exit the strategy.   Reflecting these factors, the weighted annual pull to par is c.3.1%. However, this will be discounted more heavily in our calculations if investors exit the strategy earlier than 6 months.   Our assessment is the sell-off in bond markets has been overdone, and there is little downside remaining, especially with assets that are due to mature or be called in the next couple of years.   Mark-to-Market movements and volatility   We focus on large issue sizes with high demand and deep markets that are widely covered.   At the time of writing, under normal market circumstances, a minimum of c90% of positions can be sold off instantly, the remainder in T+5. BVAL (value out of 10) and LQA (%) are critical, independent measures of market, valuation, demand and trading volumes. Securities with higher BVAL scores have more market makers providing prices. Typically, the higher the BVAL score, the higher likelihood of finding liquidity for those securities. Therefore, the portfolio focuses on those securities with BVAL’s over 8 / 10.   We calculate the bid-offer spread at c. 0.07%. This is a snapshot in time. We based this on modelling treasuries and corporate bonds. This figure is not cumulative in our calculations.   Volatility in the market has dampened dramatically recently. Our model has 5-year annualised volatility levels of 3.11%, adjusting slightly for lower volatility over the coming 12 months. The annualised volatility is changed (mainly because of the pull-to-par effect. At the same time, our calculation will only demonstrate a downside standard deviation. This presents a worse possible scenario that we should envisage due to the stabilisation of the market.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.355035664054651
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#52",
                    "likes": "0",
                    "time": "01/11/2022-05:18:04",
                    "content": "i think this should be revisited when the US stop rising interest rates, should the rates keep increasing, the bonds will not be as liquid as you deem them to be and hence preventing any emergency offboarding and may even result to a greater loss. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#53",
                    "likes": "3",
                    "time": "01/11/2022-14:12:40",
                    "content": "Dear community, We are very pleased to announce we are submitting this to the November Governance Cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#54",
                    "likes": "4",
                    "time": "03/11/2022-13:26:05",
                    "content": "Just a note that some further edits were made to this MIP before the deadline for November submission in case anyone wishes to review them. I have allowed a very small clarification edit after the frozen period began to correct a mathematical error. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.458333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#55",
                    "likes": "3",
                    "time": "08/11/2022-17:27:35",
                    "content": "This is a summary of the contents of this proposal and its impact, from GovAlpha’s perspective:  This is a proposal for CoinShares to invest up to 500M USDC from MakerDAO’s USDC PSM into various government and corporate bonds in line with MIP13c3-SP12. The precise amount of USDC to be invested will be determined by a Signal Request if the MIP is approved. If the portfolio outperforms the Secured Overnight Financing Rate (SOFR), then CoinShares will pay MakerDAO this interest rate every month on chain. Any profits above the SOFR will be divided as follows: 1/3 for MakerDAO, 1/3 for CoinShares, and the last 1/3 for CoinShares to acquire MKR. The acquired MKR will be held for at least two years by CoinShares. If directed to do so by an Executive Vote, CoinShares aims to be able to unwind the investment within seven business days under normal market circumstances. Under stressed market conditions, withdrawal may take longer and may generate losses for MakerDAO. MIP86-c6, c7, c8, and c9 detail the legal and custodial solutions proposed for the USDC assets and bond assets. An illustration of the flow of funds from PSM to investment is provided within the MIP. CoinShares is regulated in Jersey by the Jersey Financial Services Commission and the agreement would be governed under Jersey or United Kingdom laws. This proposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2022-11-08 ",
                    "links": [
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.479166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#56",
                    "likes": "0",
                    "time": "15/11/2022-20:35:46",
                    "content": "This proposal is currently being voted on. Its Ratification Poll will run from 2022-11-14 to 2022-11-28. Please vote here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#57",
                    "likes": "2",
                    "time": "16/11/2022-14:54:36",
                    "content": "Can you share more about this: And if this article is correct, “Mognetti said that the firm’s net asset value as of the end of September was roughly $279.8 million”, this would mean around 10% of the asset is currently stuck in the FTX exchange. Is this correct?    Decrypt – 10 Nov 22    CoinShares Confirms $30.3 Million Exposure to FTX - Decrypt CoinShares revealed it has a hefty amount of Bitcoin and Ethereum trapped on the exchange but has no exposure to Alameda Research.      ",
                    "links": [
                        "https://decrypt.co/114105/coinshares-confirms-30-3-million-exposure-ftx"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.776785714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#58",
                    "likes": "1",
                    "time": "16/11/2022-15:47:47",
                    "content": "Hi, Thank you for your fair question. As per our Q3 earnings:The Net Asset Value of the Group as at 30 September 2022 is £240.6 million. The Total Assets Held by the Group as at 30 September 2022 is £1,875.4 million. Exposure to FTX is £26.6 million. If we assume the amount to be 100% irrecoverable, this will:  reduce the net asset position of the group by approximately 11%, to £214.0 million reduce the total asset position of the group by approximately 1.4% to £1,848.8 million  Hope this helps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.928571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CoinSharesCo",
                    "index": "#59",
                    "likes": "0",
                    "time": "18/11/2022-08:00:24",
                    "content": " Capture d’écran 2022-11-18 à 08.59.551097×773 61.6 KB  From October 1 until close of business, November 17 2022 the portfolio has returned 0.78%; while short, dated US Treasuries and cash returned 0.41% and a leading dollar money market fund return, 0.47%. Core drivers for the portfolio over the period has been  credit selection with marginally longer duration name is posting returns in excess of 1%. This has largely been driven by US inflation, marginally slowing  to 7.7% and the prospect of further aggressive rate hikes diminishing. As such our floating-rate exposure over the period has been largely flat. We think it is prudent to retain a flexible outlook and not be committed to a binary outcome as such we continue to blend instrument types and geography is from a global universe. The portfolio currently is yielding 6.51%, with an average credit rating of AA and low duration of 1.16 years, implying minimal, sensitivity to ongoing rhetoric surrounding  interest rates. While as an added, layer of comfort, 36% of the portfolio is backed by government institutions. The strategy is continues  high quality instruments that provide an attractive yield above cash. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.321173469387755
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rtree",
                    "index": "#60",
                    "likes": "0",
                    "time": "25/11/2022-15:58:01",
                    "content": "Good proposal, but considering current situation that money supply is shrinking, I guess investment to fixed income is just providing liquidity with little return. We need to acquire some kind of ownership of an entity that need money from bond, if we are trying to invest. (although I guess such entity rarely meet risk requirement of MakerDAO.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.080357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#61",
                    "likes": "0",
                    "time": "23/02/2023-15:58:28",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1735"
}