{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/paid-survey-introducing-cryptosurvey-earn-xdai-tokens-for-answering-surveys/7949",
            "title": "[Paid Survey] Introducing Cryptosurvey - Earn xDai tokens for answering surveys ",
            "index": 7949,
            "category": [
                "Updates",
                "Integrations"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Shreyas_Adiyodi",
                    "index": "#1",
                    "likes": "7",
                    "time": "10/05/2021-16:26:57",
                    "content": "Hello Everyone, I am excited to share with you a Dapp I have been working on. It’s a crypto-based survey app that lets survey creators pay their responders xDai tokens for answering survey questions. This Dapp is powered by xdaichain Here’s a survey I created using this app. You will earn xDai tokens for answering it! https://respond.cryptosurvey.market/surveys/QmSWyqCq47uPYaeEWmePg1MfTP7nrupmMTxafKm8AUR4RN Note: The survey can only be answered on desktop and not mobile for now. Looking forward to your feedback! PS: I am also looking for any community managers at MakerDAO who might be interested in creating surveys such as above? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/05/2021-16:36:13",
                    "content": "Hi! Nice seeing these usecases emerging!  I just have one lame (sorry) feedback. I wanted to check out your app but:  it says that I need to enable cookies. It’s strange, with Brave shields up clicking the “login” button does nothing, even if Brave does not report anything being blocked. → Not nice, but ok.  Anyway, after disabling Brave shields, I am asked to register using “Portis”. Meh, I never heard about it. Not great, but ok.  Portis asks me to enter my email. game stopper, since I didn’t even had the opportunity to read what the survey you linked was about.  At this point I quitted. My suggestion:  you should allow people to view the survey even if they are not registered (they will register if they think it’s worth answering). You should just use metamask and no 3rd party services asking emails and who knows what else.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.821428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "0",
                    "time": "10/05/2021-16:39:19",
                    "content": "Support to metamask? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Shreyas_Adiyodi",
                    "index": "#4",
                    "likes": "1",
                    "time": "10/05/2021-16:40:15",
                    "content": "Hi @iammeeoh This is great feedback. And indeed I agree with all of the above. I am going to integrate metamask soon. I added portis integration mainly so that the app is accessible to non-crypto people as well (for eg people who don’t know about metamask). But certainly, it makes sense to add metamask for people who know what they are doing. Stay tuned. Also if possible do try out the survey! Maybe you can give more insights after that too! Looking forward to hearing from you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.669430272108844
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Shreyas_Adiyodi",
                    "index": "#5",
                    "likes": "1",
                    "time": "10/05/2021-16:41:26",
                    "content": "Will add metamask support soon. But do try out the survey! You can maybe transfer the amount from portis wallet to metamask later. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#6",
                    "likes": "1",
                    "time": "10/05/2021-19:39:33",
                    "content": "I love xDai and I also like to see it in a use case, really keep up the good work, the site looks great. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Shreyas_Adiyodi",
                    "index": "#7",
                    "likes": "1",
                    "time": "20/05/2021-17:24:30",
                    "content": "@Alefcripto @iammeeoh @Saludiego_201 After listening to your feedback, I have made a couple of changes to the survey. Although I have not integrated Metamask yet, I would still like to know what you guys think. Here’s the link to the survey I created: Cryptosurvey - Earn cryptocurrencies by responding to surveys Looking forward to your feedback! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#8",
                    "likes": "1",
                    "time": "20/05/2021-20:20:42",
                    "content": "I found the experience quite smooth, the truth is I don’t know the right answer for the payouts of each survey, but without a doubt if you do x amount of surveys per day and you more or less exceed the dollar, I think many people would be interested in the platform. Pd: Thanks for the xdai cents  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.406462585034014
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Shreyas_Adiyodi",
                    "index": "#9",
                    "likes": "1",
                    "time": "21/05/2021-03:33:03",
                    "content": "@Alefcripto yeah I agree with you here. Earning a dollar a day for answering a reasonable number of surveys would definitely attract users. Thanks for answering the survey! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "20/06/2021-13:33:18",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}