{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/6s-roadmap-financial-covenants/12342",
            "title": "6s - Roadmap - Financial Covenants ",
            "index": 12342,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "sixs",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "7",
                    "time": "22/12/2021-15:43:34",
                    "content": "Many folks have asked about the RWA001-A vault status and the roadmap for expanded usage. The credit agreement (link) has certain covenants (financial & other) that 6s Capital Partners LLC, Series A must always comply with, or else be in breach of the agreement which causes a liquidation. One of the covenants to which 6s must comply is the equity component. That is to say that there must be equity in Series A prior to any credit being extended pursuant to that credit agreement. It is a chicken before the egg situation. There must be equity before debt (credit from the credit agreement) can be used. When standing up an operating business that focuses on lending, equity has to move >> first << . That said, equity documents require a risk description to which the credit agreement has to come first. As you can tell, there is a significant amount of coordination that has to happen to ensure 6s is NEVER in breach of the Credit Agreement. The financial covenants that were included in the credit agreement are explicitly there to protect the senior secured creditor (e.g. RWA Senior Lending Trust… a legal embodiment of MakerDAO). So, let’s pull this close to home with the current roadmap. At present, 6s has some equity and is about to become significantly more capitalized in the next week (way more than the current capital needs of 6s as a lender). This is a wonderfully annoying “bump” in the road. The community wants 6s to deploy capital faster and also wants 6s to be capitalized. This challenge is exacerbated when the equity is small and is negligible when at scale. However, today, the equity raised is outpacing the lending. As a result, less the desire to demonstrate to the community 6s is using the credit agreement and can deploy capital at scale, there isn’t a direct “need” to do so until we expend the entirety of our equity capital. That will change in the next ~60 days as new transactions are scheduled to close that utilize the equity first and then transactions after that are all about keeping that ratio in focus, and NEVER breaching. Take the following scenario as an example: A Debt Ceiling of 100MM… and loans outstanding are 20MM and equity raised is 75MM. Does it make sense to use the credit facility when you have to pay the equity holders as well? Some will argue that you could contract the credit from 100MM down. This is precisely the wrong direction given the risk profile. Risk being that the entity is exceptionally well (even overly) capitalized. This is basically the ideal outcome for Maker as the LendCo has “dry-powder” and can enter into transactions knowing execution is certain. From a risk-perspective, if you add enough equity, you remove virtually all risk to the senior secured lenders. The challenge is finding the right balance, especially when standing up new operations. Summary: Our lack of utilization is not an issue; far from it. Having capitalized LendCOs (well or even overly capitalized), is a wonderful challenge. Lenders thrive on optimizing their WACC (weighted average cost of capital) and deploying that aggregated capital for more than their cost (i.e. running at a profit). For those wondering when we’ll begin utilizing the credit agreement and earning stability fees for MakerDAO? Give us about 60 days to expend our equity capital. As a sidenote, I hope that this all goes to show the tremendous amount of behind the scenes coordination and planning that is part of being a “real-world” LendCo in MakerDAO. LendCos and Arrangers moving forward need a level of certainty and sufficient runway to do their job properly. 6s is gearing up to deploy its debt ceiling relatively quickly once our equity is out the door. In terms of “crawl, walk, run,” we’re about to get on our feet. After this, we plan to petition the DAO to let us run. Go big or go home! ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-dec-16-2021-jan-6-2022/12507"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.627460010438734
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/12/2021-16:55:47",
                    "content": "So what you are telling us is that 6s finds itself in a position of being over capitalized via investors and that should it get to the point that borrowing needs are not satisfied by current investor capital - there will be a significant amount of well backed collateral to use to borrow. This is good and bad. Good in that when 6s finally grows its business beyond investor appetite it will have a lot of collateral to throw at borrowing. Bad in that investors are piling in faster than expected. Two questions arise because of this.   Sounding like 6s investors are pretty much throwing money at it faster than 6s can deploy such capital.   Right now your lead time on deploying is what 2-3 months minimum.   Should this capital get deployed (or investors capital dry up) what is the capital ramp going to look like? 5-10M/month or higher?    I know this is hard to gauge and potentially reveals your loan booking gross.   I just want to make sure Maker is ready to move 6s DC here so 6s doesn’t end up capital thin, but also with some care that if we ramp too hard to fast as some point this may put up some PEG downside pressure.   Any optics you can give here I think would be helpful. I think my general concern here is that I think Central Banks are pretty much caught between a rock and a hard place.   The Rock is skyrocketing inflation and supply issues, the hard place is that if they raise to much to compensate for inflation they pretty much start strangling government budgets (borrowing costs get high) and a possible inverted yield curve.   The long market betting that the short term rate moves won’t be sustainable.   Thing is that we have already seen some hints of markets balking at even the idea of CBs increasing rates. My point here is that given the massively low return environment and loose CB monetary policiies I expect that money is going to be looking for better returns and hence I expect as long as rates are low for 6s to find itself 2-4 months from now in the same position as reported above.   This leads me to my last question. Is there any possibility to take even a few percent of your loan portfolio and float it over to Maker?  Meaning say once 6s gets to like 50M, float a 1-2M loan in our direction.   This only shaves off 1-2% of your equity client return and primes the pump a bit.   Think of it as a borrowing modulation.  Instead of working 100% of your loan portfolio for investors, you start to shift this a bit so if your investor funding shuts off you don’t have to come beating the table at Maker to ramp up DC as fast.     The whole point is that such an approach is good for all parties because it while is reduces a small amount what your investors get as return, it improves the smoothness of ramping DC via Maker.   There is a small cost here but the long term benefit to your investors of having both Maker and them as lenders basically means 6s has strong continuity of business and returns.  Though maybe your investors don’t care about that… I think my main point here is that I am dissappointed that Maker as a lender getting a back seat to investors here isn’t something we want to hear.    Your team controls how much investment liquidity you get and unless you are paying out a rate that is less than what you would pay Maker it seems counter productive.  Which begs another question. Is the rate you are paying your investors lower than the effective SF of the vault we are offering 6s? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.296084000745019
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "2",
                    "time": "27/12/2021-02:43:07",
                    "content": "    MakerMan:  So what you are telling us is that 6s finds itself in a position of being over capitalized via investors and that should it get to the point that borrowing needs are not satisfied by current investor capital - there will be a significant amount of well backed collateral to use to borrow. This is good and bad.   From my lens, a capitalized LendCo is only a good thing. The  perceived trade-off here is really profitability (as the super senior lender) vs. risk for the profit generated. In this context, the more equity the LendCo has, the risk geometrically drops for the super senior secured. To that end, is the angle to maximize the profit for a collateral or minimize the risk? In my eyes, it is a combination of the two.     MakerMan:  Two questions arise because of this.  Sounding like 6s investors are pretty much throwing money at it faster than 6s can deploy such capital. Right now your lead time on deploying is what 2-3 months minimum.    We are about to start refinancing projects to the facility to fully utilize the equity and then proxy have a larger collateral for the facility (so closer to 30-60 days).     MakerMan:  Should this capital get deployed (or investors capital dry up) what is the capital ramp going to look like? 5-10M/month or higher? I know this is hard to gauge and potentially reveals your loan booking gross. I just want to make sure Maker is ready to move 6s DC here so 6s doesn’t end up capital thin, but also with some care that if we ramp too hard to fast as some point this may put up some PEG downside pressure.   The CTL deal pipeline (check the top of the 6s - State of the Business thread) is accurate based on the executed leases in hand but massively understated compared to transactions we are working on for 2022, we should hit >100MM of deals outstanding.     MakerMan:  Is there any possibility to take even a few percent of your loan portfolio and float it over to Maker?   6s will be utilizing the credit facility well before we have 50MM in loans outstanding (and should be well before the end of Q1).     MakerMan:  I think my main point here is that I am dissappointed that Maker as a lender getting a back seat to investors   This is a classical challenge of being a creditor. From a 6s perspective, it must manage its cost of capital (WACC) across its equity and debt. Unlike its debt source, the equity doesn’t come in nice linear slugs when it needs it. Investors basically have the leverage to say we want to deploy 5MM only, take it or leave it (example only). Even if 6s only needs 2MM, it doesn’t have the luxury unless its equity sources also agree. Thus given then option, it will opt to raise equity when needed (hence the need to deploy that capital and then utilize the credit facility but never be in breach of the financial ratios).     MakerMan:  Is the rate you are paying your investors lower than the effective SF of the vault we are offering 6s?   No. It is higher. It is the first-loss equity buffer. There is more risk; it has to be higher. For a LendCo with a first-loss equity buffer, it is ALL about managing the WACC and then deploying capital higher than the WACC.  These are all excellent topics / questions. When discussing aspects of our equity, there is an aspect that cannot be put in the public forum (as it is not a public offering). To that end, I look forward to answering questions folks have (re the equity) during the 6s office hours (or directly). Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861637512147716
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "1",
                    "time": "27/12/2021-09:43:51",
                    "content": "    mrabino1:  No. It is higher. It is the first-loss equity buffer. There is more risk; it has to be higher. For a LendCo with a first-loss equity buffer, it is ALL about managing the WACC and then deploying capital higher than the WACC. These are all excellent topics / questions. When discussing aspects of our equity, there is an aspect that cannot be put in the public forum (as it is not a public offering). To that end, I look forward to answering questions folks have (re the equity) during the 6s office hours (or directly). Thank you.   Thank you for a bit of optics on this.   I think my main concern is making sure we don’t end up having to ramp your DC hard and fast but given the comments in your reply looks like you will have this decently managed.  Capital is fickle and can dry up quickly. Sounds like 6s is taking opportunity to expand using the investor capital.   If I am reading this right it builds a better base for future expansion (even if investor capital starts drying up) since there is a certain amount of capitalization required before you can float collateral over to Maker. I guess I hoped to start seeing some of 6s financing to be coming over to our books.  Mostly to get a decent track of how this might start moving.     mrabino1:  6s will be utilizing the credit facility well before we have 50MM in loans outstanding (and should be well before the end of Q1).   Sounds about right given your lead (1-2 months) and probable state of capital influx.   I think we waited a year for 6s to get all of the structural stuff out of the way, a quarter of wait while 6s now focuses on growing out isn’t out of whack.   I think a lot of people were hoping to see 6s start pulling DC sooner.   It is my hope once 6s ducks are lined up you can start building out in our direction. I think given your loan lifetime of 12-24 months and the loan sizes it is going to be interesting to see how fast 6s grows here.   Literally every collateral asset floated against DAI loaned is going to close and have to be replaced in 12-24 months.  Some of these actually turn faster.  I don’t envy you your work. Thanks again for the additional clarity Matt! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.064413265306122
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "27/03/2022-09:43:56",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}