{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-compensation-bridge-for-delegation-contract-migration/11719",
            "title": "[Signal Request] Compensation Bridge for Delegation Contract Migration ",
            "index": 11719,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "delegation",
                "sig-status-rejected",
                "compensation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "1",
                    "time": "18/11/2021-19:16:16",
                    "content": "@PaperImperium is transitioning to @GFXlabs. Mirroring this transition, at the time of writing, the old delegation contract still has 8,506.43 MKR delegated while the new delegation contract only as 5.02 MKR. This transition alerted me to a shortcoming in the proposed delegate compensation MIP, but the problem will affect all delegates, not just @PaperImperium. Currently, delegate contracts expire after one year. Delegates will need to create new delegate contracts and ask delegated MKR to migrate. This migration will cause volatility in delegate compensation. GovAlpha has clarified that delegates shall be compensated without reference to other delegates, even in this case when there is a clear intent to migrate. I propose that a component be added to MIP61 to accommodate delegate contract migration:  In the event that a Recognized Delegate intends to migrate from one delegate contract to another, a special procedure is available to reduce unpredictable compensation. The delegate must inform governance 7 days in advance of the migration effective date and which contracts are affected. The new delegate contract cannot already be involved in a migration (e.g., two delegates merging into one). During a 15 day interim period, the old and new delegate contracts are regarded, for the purpose of compensation, as referring to the same entity and compensation calculated using stats from both the old and new contracts. For example, MKR weight will be obtained by the sum of the MKR weight of the old and new contracts. Participation and communication stats will register the most favorable stats considering both the old and new contracts.     Amend MIP61 to allow for a migration period between delegate contracts  Yes No Abstain     0 voters     This poll shall be active for two weeks, closing on Dec 02. If ‘Yes’ has more votes than ‘No’ then MIP61 shall be so amended. ",
                    "links": [
                        "https://vote.makerdao.com/address/0xad2fda5f6ce305d2ced380fdfa791b6a26e7f281?network=mainnet",
                        "https://vote.makerdao.com/address/0xf60d7a62c98f65480725255e831de531efe3fe14?network=mainnet",
                        "https://forum.makerdao.com/t/mip61-delegate-compensation/10640",
                        "https://forum.makerdao.com/t/paperimperium-delegate-platform/8992/44",
                        "https://forum.makerdao.com/t/paperimperium-delegate-platform/8992/45",
                        "https://forum.makerdao.com/t/mip61-delegate-compensation/10640/26"
                    ],
                    "GPT-summary": "The author proposes an amendment to MIP61 to accommodate delegate contract migration. The proposal suggests a special procedure to reduce unpredictable compensation in the event that a Recognized Delegate intends to migrate from one delegate contract to another. The proposal is open for voting for two weeks, and the post also includes a poll for the community to vote.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.547337662337663
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "0",
                    "time": "18/11/2021-19:27:08",
                    "content": "Something similar needs to be done on the rollover after one year when a delegate contract needs to get replaced. I don’t think in this specific case it is necessary though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/11/2021-19:59:12",
                    "content": "    ultraschuppi:  Something similar needs to be done on the rollover after one year when a delegate contract needs to get replaced.   Huh, how would this not apply to the 1 year rollover? Why did you vote No?     ultraschuppi:  I don’t think in this specific case it is necessary though.   You mean the current GFX transition? This signal request won’t help the GFX transition because the signal request won’t even have a result for two weeks and that’s more than 15 days after the GFX migration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#4",
                    "likes": "1",
                    "time": "18/11/2021-20:02:03",
                    "content": "Uh well… Short sighted. Good that polls run for some time. Thanks. I actually believe the rollover period should be longer. Most delegators are not able to react within 15 days. Maybe a month? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/11/2021-20:08:39",
                    "content": "    ultraschuppi:  Maybe a month?   I am okay with 30 days. Can a GovAlpha team member weigh in? @Patrick_J ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#6",
                    "likes": "2",
                    "time": "18/11/2021-20:22:44",
                    "content": "I think this is an important issue, but I voted no because I think this is too complicated and moves us towards more human involvement by core units in controlling the delegates. IMO the delegates need to be separated as much as possible from the core units and their compensation and other characteristics should be automated as much as possible. I’d rather just remove the 1 year time limit and think about other solutions that can deal with problem the 1 year limit was created for. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#7",
                    "likes": "1",
                    "time": "18/11/2021-20:31:20",
                    "content": "@Patrick_J is writing to address this signal as a whole, but I wanted to add some insight to Rune’s comment in the meantime.     rune:  I’d rather just remove the 1 year time limit and think about other solutions that can deal with problem the 1 year limit was created for.   So the one year limit  was quite intentional. Since it’s a permissionless system, there’s a good chance that we might lose touch with either the delegates or the person delegating in a year;s time. By having the expiration date, it helps close the gap and make sure that people who delegate are reevaluating their decision at least once a year. Not having an expiration date could lead to a situation where there is a large amount of MKR stuck on a hat with no way to move it. It helps mitigate the “bus risk” of a delegate not being able to move the vote themselves, without being too burdensome on the delegate or the people delegating. This time frame could be adjusted, but I would causion against getting rid of it completely. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.118303571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#8",
                    "likes": "1",
                    "time": "18/11/2021-20:43:28",
                    "content": "@psychonaut there are a couple of points here I would like to address. MIP61 remains in RFC and as such does not require a Signal Request to change, this is what the RFC period is for! You can insert that component into MIP61 now if you like without a Signal Request. The suggestion to start a Signal Request in the previous thread was to cover a one-off payment to GFXlabs for the specific instance of PaperImperium moving from one Delegate Platform to another. It is still possible for a Signal Request to take place to allow this. I’m happy to assist in writing it if you would find that helpful. The 12-month expiration on delegate contracts has been addressed by @prose11 in his post. As I have previously stated I do think that is a different situation to this and should be explicitly covered in MIP61. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "1",
                    "time": "18/11/2021-21:37:22",
                    "content": "    Patrick_J:  The suggestion to start a Signal Request in the previous thread was to cover a one-off payment to GFXlabs for the specific instance of PaperImperium moving from one Delegate Platform to another. It is still possible for a Signal Request to take place to allow this. I’m happy to assist in writing it if you would find that helpful.   Oh, let GFX care about that if they want. I’m just trying to address the general issue. I’m closing the Signal Request. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.683333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "19/12/2021-07:38:08",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}