{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/amazix-the-marketing-firm-with-the-worst-track-record-in-the-ico-era/9387",
            "title": "Amazix, the Marketing firm with the worst track record in the ICO era ",
            "index": 9387,
            "category": [
                "Core Units"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NotAnAnonAccount",
                    "index": "#1",
                    "likes": "6",
                    "time": "16/07/2021-16:30:19",
                    "content": "Exposing Amazix (Bitcointalk) Amazix = SCAM (Bitcointalk) Blockchain startups RepuX and JoyToken pull exit scam after raising $8M in ICOs. Both projects were represented by AmaZix (thenextweb) Amazix has desperately been trying to cover its traces but hey, the damage was so big that it’s near impossible. I am sorry to have to share this anonymously, but hey, I think it’s fair play considering their attempt to cash grab a $1.1 million from a high profile DeFi project ! Really ? are you f***ing serious ? There is a LOT to be said about this rather disguting company. I let you do your research on Reddit, Bitcointalk and other popular ICO forums from 2017-2018. Just ask anyone who was in the space back then and you will hear rather appalling stories. I hope this thread along with the others will make Amazix and its staff look at themselves in the mirror and never come back again. ",
                    "links": [
                        "https://bitcointalk.org/index.php?topic=4905927.20",
                        "https://thenextweb.com/news/repux-joytoken-ico-exit-scam-8m",
                        "https://forum.makerdao.com/t/mip40c3-sp20-adding-budget-to-amazix-marketing-core-unit-amzx-001/8649",
                        "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-amazix-marketing-core-unit-mip-set-july-12-2021/9302/19",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-151-thursday-july-22-17-00-utc/9423/2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-15-22/9486"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.723214285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "17/07/2021-01:12:44",
                    "content": "Thank you for sharing this information, with evidence and testimonials you have a broader vision, this certainly does not change my position that NO is the option  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "2",
                    "time": "18/07/2021-17:34:51",
                    "content": "This alone justifies my position to vote NO. We cannot think of projects that want to take advantage of our DAO for their own benefit, and not for community benefit. Thank you very much for your info and for your research. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/oldpaul",
                    "index": "#4",
                    "likes": "3",
                    "time": "20/07/2021-11:39:24",
                    "content": "Thanks for your opinion. It is important. However, here are the facts, and if you read any of the articles covering the news you are referring to, it clearly stated that Amazix pulled away from the project. In fact, Amazix resigned the accounts in May 2018, a year well before the “exit scam” took place in May 2019. “AmaZix had originally been coordinating the efforts of individual ICO promoters (bounty hunters) but severed ties with RepuX and JoyToken after disagreeing over how the promoters should be compensated for their efforts. The ICO teams claimed it was changing how much bounty hunters would be paid because the token sales performed worse than expected.” Please note that when we pulled away, it was over some general mismanagement about how the bounty hunters community was going to be treated: at that point in time, in fact, there were no signals of what was going to happen one year later. Still, Amazix values very seriously any commitment the projects make to the blockchain and token holder communities: if these projects break their promises, in this example, to bounty hunters, we decided that RepuX and JoyToken couldn’t be held liable for other commitments. And, so we resigned the accounts giving a public announcement. In general, our history shows how much we aim to protect the community from any fraud. The following are just a few examples of that: AmaZix Assessments From the very beginning, all our potential customers went through a rigorous, multi-stage assessment and due diligence process, called “AmaZix Assessment”. With our deep experience of the crypto space, our team of analysts has completed deep dives across hundreds of crypto projects. This process is mandatory, we publicly provided a broad overview of such a process in this blog post: medium.com/amazix/amazix-assessments-ee35fb463e85 AmaZix Bot In July 2019, we decided to offer for free to any telegram community the standard version of our AmaZix Bot, which we created to add a protection layer against all of the spammers, scammers, fake links and dangerous files putting at risk our clients’ communities. A fully customizable version was also made available for a small premium, for those groups that were not yet ready to have our top-notch 24/7h moderation team taking care of their community.    The Cryptonomist – 3 Jul 19    AmaZix, the blacklist bot for Telegram - The Cryptonomist AmaZix has launched a free service to reduce the risk of scams on Telegram.This is a bot that includes on its blacklist 54,000 users      Certik partnership We recently announced a strategic partnership with Certik, a leading blockchain and smart contract verification platform. Founded in 2017 by top formal verification professors from Yale and Columbia Universities, CertiK has since audited hundreds of blockchain and DeFi projects. Through a joint offering, AmaZix will be providing projects with community management, CertiK’s end-to-end security, marketing, and legal advisory. A perfect match for a safety net of DeFi projects.    certik.org    AmaZix x CertiK Announcement | CertiK Foundation Blog CertiK is proud to announce a strategic partnership with AmaZix, a leader in blockchain community management.      From the very beginning, we always valued our role as a fraud prevention company, as stated also by our past partnership with Brandshield back in 2018. Integrity and trust are the core values for which Amazix operates. ",
                    "links": [
                        "https://t.me/amazix/18376",
                        "https://medium.com/amazix/amazix-assessments-ee35fb463e85",
                        "https://www.amazix.com/bot",
                        "https://en.cryptonomist.ch/2019/07/03/amazix-bot-telegram/amp/",
                        "https://en.cryptonomist.ch/2019/07/03/amazix-bot-telegram/amp/",
                        "https://www.certik.org/blog/amazix-x-certik-announcement",
                        "https://www.certik.org/blog/amazix-x-certik-announcement",
                        "https://cryptonewsreview.com/brandshield-and-amazix-are-teaming-up-to-fight-crypto-fraud/",
                        "https://forum.makerdao.com/t/campaigning-vote-no-on-inclusion-poll-for-amazix-marketing-core-unit-mip-set-july-12-2021/9302/25"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.452050264550264
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GuyB",
                    "index": "#5",
                    "likes": "7",
                    "time": "20/07/2021-14:26:58",
                    "content": "I recently found myself in a situation where a piece of inaccurate and poorly-informed opinion was given as a justification for a voting decision. I was frankly disappointed that more people who knew the reality first hand didn’t also speak up. There’s a saying that in a democracy [DAO], people get the government [Core Units] they deserve. So I also have to say that this is a pretty uncharitable, selective, and disingenuous attempt at a hatchet job on AmaZix. Whether or not they’re the right choice for marketing MakerDAO, this is not the way to go about making the argument, and not something I want to see as part of Maker’s governance process. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.446428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "18/10/2021-14:27:24",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}