{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/institutional-and-long-term-vaults-proposal/9586",
            "title": "Institutional and Long Term Vaults Proposal ",
            "index": 9586,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "gro-001",
                "institutional-vaults"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "25",
                    "time": "29/07/2021-17:09:25",
                    "content": " Institutional and Long Term Vaults Proposal This post merges recent discussions between @ Growth , @ Risk , @ Protocol Engineering and Nexo to propose an institutional vault offering. We are putting forward this proposal to gather community feedback and sentiment on an initiative that we believe will lead to sustainable longer term ecosystem growth.  Goals This proposal seeks to grow the MakerDAO ecosystem, specifically regarding:  Boosting DAI Supply Generating greater revenue for MakerDAO and our partners Enhancing capital efficiency for our partners Incentivising longer term borrowing commitment Introducing a level of borrowing rate-predictability   Mechanisms to Achieve This New vault mechanisms are introduced to promote this growth, including:  Origination fee: will be applied to all DAI at the time of minting. This is not restricted and is open to change via Governance (specifically the Parameter Changes Proposal group). Meaning that any partner will have a lead time of 2-3 weeks before any changes are implemented. Stability fee: is determined upfront and fixed for a period of time. This fixed rate can be reduced as additional collateral is added. Vault starting size: to ensure that such vaults will mint a minimum amount of DAI in order to gain favourable rates.   Proposal This proposal puts forward two new products from Maker:  Institutional Vaults Long Term Vaults  These products are intended to be created for ETH and wBTC. In the future, if successful we see this being extended to support vaults for LINK, UNI and Staked ETH depending on partner requests and risk/profit analysis.  Institutional Vaults Permissioned Institutional Vaults are agreed upon with our partners. In this case, Nexo is our institutional counterpart. The proposed terms of our agreement are as follows:     Institutional Vault Type Permissioned ETH and wBTC Vaults     Qualifying Vault size: 400m   Debt Ceiling 1-1.5B   Origination fee: 1% of DAI minted (not including capital migrated from an existing vault )   Origination fee behaviour: Origination fee is not restricted and can be changed through Governance via a Parameter Changes Proposal. Typically this will mean that Nexo has a 2-3 week lead-time to any Origination fee rate change.   Origination fee future commitments Maker and Nexo will work together to propose reductions to the origination fee if the vault size grows significantly.   Stability fee: 1.5%   Stability fee behavior: Fixed for 6 months. An additional 100m DAI minted will reduce the stability fee by 10 basis points (per vault) to a minimum of 0.5% for 6 months. Stability fee reduction will be manual via an executive vote. After 6 months, open community dialogue facilitated by the Growth CU will determine ongoing stability fees. Note that these can only be increased by a maximum of 1% for each subsequent 6month period.   Collateral Ratio: 200%   Collateral Ratio Behavior: Failure to maintain 200% CR over the majority of any 7 day period will result in increasing the SF to 5% and increasing the LR to 150%. The 7 day period would be calculated by ensuring that 95% of the OSM updates show that the CR is equal to or greater than 200%.   Liquidation Ratio: 120%     Transparency, Intention and Discussion with Nexo To spotlight the scale and opportunity this product presents, it is worth mentioning the following as part of our recent discussions with Nexo:   Nexo’s intention is to migrate their existing 400m vault to this institutional vault. With the above conditions they commit to mint a further 100-200m DAI targeting an initial 600m DAI. Over time, pending market conditions we can expect this to reach a billion DAI.   Nexo is improving its operations and collateral management automation to ensure monitoring 24/7, meaning that they will keep a collateralization ratio above 200% (currently and historically this has typically been above 300%).   To foster aggressive growth, Nexo and MakerDAO will explore reductions to the origination fee as the vault size grows. This additional flexibility will help align incentives over the longer term.    Process & Meeting Cadence As described above, stability fees are fixed for 6 months. In the 4-6 weeks leading up to the 6month stability fee maturity date, the Growth Core Unit will engage with Governance and Nexo to facilitate discussion and decision making to set the stability fee for the following 6 months. Note that the maximum increase possible at the time will be 1%. These discussions will be pre-scheduled meetings to ensure cadence is managed and there is ongoing visibility to all involved. This will then proceed to a poll and/or executive vote as per standard governance processes.  Long Term Vaults Long term vaults promote permissionless borrowing for long term lenders and allow users to lock in a more stable rate upfront than is otherwise possible. This vault type differs from permissioned vaults by not offering bespoke collateral ratios or stability fee reductions seen above.     Long Term Vault Type Permissionless ETH and wBTC Vaults     Qualifying Vault size: TBD by Governance   Origination fee: 1% of DAI minted   Origination fee behavior: Governance can make changes to future origination fees   Stability fee: 1.5% to start   Stability fee behavior: Stability Fee can only be adjusted by a maximum of 1% every 6 months   Liquidation Ratio: Equivalent to ETH-A and WBTC-A    These two products will boost DAI supply and MakerDAO revenue by incentivising longer term borrowing and predictability. We look forward to hearing community feedback and comments. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-nexo-institutional-vault/10046",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-20-26/10032",
                        "https://forum.makerdao.com/t/mip59-dsscharter/10028",
                        "https://forum.makerdao.com/t/institutional-vaults-economics-terms/9989",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948",
                        "https://forum.makerdao.com/t/growth-cu-weekly-update-august-6-12/9824",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-56-en-espanol/9812",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/fixed-rate-vaults-proposal-with-deco-protocol/9707/15",
                        "https://forum.makerdao.com/t/maker-governance-review-july-2021/9758",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-30th-august-5th/9708",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/3",
                        "https://forum.makerdao.com/t/protocol-engineering-month-in-review-july-2021/9663",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-august-1st-2021/9657",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/45",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-60-en-espanol/10375",
                        "https://forum.makerdao.com/t/protocol-engineering-month-in-review-august-2021/10293",
                        "https://forum.makerdao.com/t/fixed-rate-vaults-proposal-with-deco-protocol/9707/36",
                        "https://forum.makerdao.com/t/maker-governance-review-august-2021/10139"
                    ],
                    "GPT-summary": "The post proposes the creation of Institutional and Long Term Vaults for ETH and wBTC to boost DAI supply, generate greater revenue for MakerDAO and partners, enhance capital efficiency, incentivize longer-term borrowing commitment, and introduce borrowing rate-predictability. The proposal includes new vault mechanisms, such as origination fees and stability fees, and outlines the terms of the agreement with institutional counterpart Nexo. The post seeks community feedback and comments on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.228522727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "2",
                    "time": "29/07/2021-17:39:54",
                    "content": "Is it possible to have a Multisig with Institutional Vaults? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "9",
                    "time": "29/07/2021-17:52:42",
                    "content": "Yes, it is. In the above case, Nexo are updating their infrastructure to use Fireblocks which can allow multiple entities to deposit into a vault - this will enhance their ability to have 24/7 monitoring coverage. I’m sure Nexo will be happy to comment further regarding their infrastructure. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/07/2021-22:07:04",
                    "content": "    Derek:  |Debt Ceiling|1-1.5B   Who defined that value? Wouldn’t it be better at 100 or 500 Million and up? So more Institutions have an incentive to participate and use our hard and censorship resistant money. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.180555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#5",
                    "likes": "3",
                    "time": "30/07/2021-00:23:41",
                    "content": "They are already participating actively (putting hundreds of millions in DeFi protocol also shows a lot of faith in the system). In addition, the Maker community is advocating for reducing reliance on USDC which requires large amount of Dai coming elsewhere ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2023809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "1",
                    "time": "31/07/2021-17:57:40",
                    "content": "    Derek:  The 7 day period would be calculated by ensuring that 95% of the OSM updates show that the CR is equal to or greater than 200%.   This is an absolute ratio or weighted by debt load or some other metric? No opinions on my end, just clarification.     Derek:  Failure to maintain 200% CR over the majority of any 7 day period will result in increasing the SF to 5% and increasing the LR to 150%   Is this manual or automatic? If the former, is there a way to make it automatic?     Derek:  To foster aggressive growth, Nexo and MakerDAO will explore reductions to the origination fee as the vault size grows. This additional flexibility will help align incentives over the longer term.   I know there’s no commitment yet, but is this intended to be tiered origination fees at different levels, or a flat rate that would adjust down manually from time to time?     Derek:  Note that the maximum increase possible at the time will be 1%   Is this going to be hard coded into the vault contract or a parameter that can be renegotiated in 2 or 3 years (up or down) if we want it to be? Same question on the long term vaults. I think this is definitely the right direction to go, though I haven’t worked through all the revenue implications yet. Presumably the idea is to use Nexo as a proof of principle and then offer similar options to other institutions, and not just a one-off with Nexo? Excited to see a way to generate more growth while still producing fees. Capital inflows to DAI have been quite large and organic demand hasn’t kept up. A commitment from Nexo to increase their minting is excellent news. I also think this kind of product is a way to further differentiate ourselves from vanilla financing, which is ultimately a commodity business where we will have little control over stability fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.431356837606838
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "2",
                    "time": "31/07/2021-22:47:09",
                    "content": "Very cool. I really like the origination fee as part of this deal. @Risk-Core-Unit  any thoughts on the risk associated by bringing a centralized asset administer by Bitgo/Galaxy Digital into the mix? Was there a moment when only ETH was considered, or is wBTC a preferable/required asset for Nexo? Thanks in advanced. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.045833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#8",
                    "likes": "2",
                    "time": "01/08/2021-01:42:21",
                    "content": "Is the 1-1.5B DC per user or for the aggregate? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#9",
                    "likes": "0",
                    "time": "01/08/2021-18:35:32",
                    "content": "It says there that for boveda 400 million, so the overall debit is 1.5 billion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#10",
                    "likes": "13",
                    "time": "01/08/2021-19:53:20",
                    "content": "I’ll try to shed some light on this proposal and what kind of community feedback we are looking for here. Institutional vaults Institutional vault proposal is based on discussions with Nexo. The qualifying vault size of 400m is based on the fact that Nexo already has about 400m of ETH and WBTC collateral debt exposure which will be refinanced and increased afterwards because of the conditions offered. Because the origination fee will not be charged for refinanced exposure (as proposed) and stability fee is fixed at 1.5% with a cap, Maker will earn less than it does now. If bull market kicks back in, opportunity revenue lost will only increase. If we are in the bear market they can still leave for better opportunities (because origination fee was not paid for refinanced amount), but this is probably less likely since the terms are already very appealing. Community needs to evaluate these pros and cons. Definitely our proposal pursues boosting DAI supply and long term commitment as the main two goals, but we are aware that revenues might hurt. The other main question is also what kind of qualifying size are we looking for with other potential institutional clients? What if next potential client wants same conditions, can we set qualifying vault size below 400m? In such case should we charge origination fee for the initial amount? Long term vaults Long term vaults have pretty much same discussion topic in relation to revenue impact. But here the opportunity lost revenue impact could be much stronger if we don’t limit debt ceiling properly and all current Maker’s ETH-A and WBTC-A starts migrating to these vaults. This is why we left qualifying vault size as “TBD by governance” and feedback is appreciated here. Long term vaults should be in my opinion really seen as some sort of predictable lower and stable rates marketing campaign to boost DAI supply with limited size in order to attract more minting and long term commitment. Long term commitment enabled by OF and capped SF should be seen as positive considering growing competition. OF also instantly boosts surplus buffer which hedges Maker better from increased risks of potential boost in DAI debt from volatile collateral. Overall these proposals are in line with $3bn+ lending capacity ammunition Maker currently has (stablecoin backing) and many others DeFi platforms don’t have (well they almost do, but rates aren’t as predictable plus they are paying a high price for subsidizing it). It’s isn’t however excluded that a potential downside shock to DAI demand could have adverse impacts on (hindsight) generous conditions offered with these proposals. This is why I personally still advice to limit wisely DC of these potential vaults. Maybe sizes of such vaults should be related to the amounts of USDC in Maker’s portfolio so that we don’t potentially overshoot. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.501389838231944
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#11",
                    "likes": "5",
                    "time": "01/08/2021-21:09:45",
                    "content": "    PaperImperium:      Derek:  The 7 day period would be calculated by ensuring that 95% of the OSM updates show that the CR is equal to or greater than 200%.   This is an absolute ratio or weighted by debt load or some other metric? No opinions on my end, just clarification.   It would be per collateral/vault type where only one exposure exists.     PaperImperium:      Derek:  Failure to maintain 200% CR over the majority of any 7 day period will result in increasing the SF to 5% and increasing the LR to 150%   Is this manual or automatic? If the former, is there a way to make it automatic?   I believe that initially Risk core unit would monitor this and propose to governance to react. But PE should have a better answer if this could be automized. I agree that we would want to have it automized ideally, especially the increased LR penalty.     flipflopflapdelegate:  Was there a moment when only ETH was considered, or is wBTC a preferable/required asset for Nexo?   I am sure someone from Nexo will comment in here soon to explain what their plans are, but I think they are interested in both ETH and WBTC vaults for further minting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.538690476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#12",
                    "likes": "1",
                    "time": "02/08/2021-22:48:16",
                    "content": "@Risk-Core-Unit How are we pricing these exposures? What is the rationale behind the terms (SF, LR, CR, DC) ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#13",
                    "likes": "1",
                    "time": "05/08/2021-07:56:38",
                    "content": "For long term vaults, ETH and WBTC products are from risk perspective same as the current ETH-A and WBTC-A vault types, difference is only in fee predictability. As said, DC is to be decided by governance, probably a signal poll follows soon. From risk perspective, we have enough of DC buffer left on both ETH-A and WBTC-A considering drop in DAI debt in last few months, so these products can be seen as adding additional exposure to ETH-A and WBTC-A. The fees of 1% OF and 1.5% SF can be seen as 2.5% effective fee for 12m, which is 25% above the current fees offered, but is much more stable due to terms stated. For Institutional vaults, we got feedback that institutions prefer capital efficiency and lower LR was therefore proposed with a soft rule to maintain above 200% CR. I believe PE team is also thinking of adding potential constraint to not be able to mint below 150% or similar CR ratio so that Maker is additionally hedged. As for institutional fees, they have similar behaviour as long term vaults fees, with an important difference to incentivize more minting. Again, DC limits are important for both products, because Maker will be more limited to how high risk compensation can be in the future (less flexibility in rates) and because of increased duration risks (harder to manipulate supply when committing to limited rate changes). I believe @Aes is working on some scenario analysis. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.470912698412699
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#14",
                    "likes": "1",
                    "time": "05/08/2021-19:02:47",
                    "content": "@Primoz thanks for this. I think this gives the general rationale in long form. How does this logic translate in an explicit math equation for pricing? e.g. SF     Primoz:  lower LR was therefore proposed with a soft rule to maintain above 200% CR   On institutional vaults, the lower LR supposedly increases the credit risk, right? Have we estimated mathematically the capacity of debt to be absorbed/recouped from Liq2.0 keepers? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.4183673469387745
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#15",
                    "likes": "4",
                    "time": "05/08/2021-19:48:15",
                    "content": "@williamr you’ll be able to get some answers here regarding the pricing of similar vaults https://simulation.blockanalitica.com/     williamr:  On institutional vaults, the lower LR supposedly increases the credit risk, right?   Yes and not, because we have a soft 200% CR rule and potential inability to mint below 150%. We’ll address all of this in the risk assessment.     williamr:  Have we estimated mathematically the capacity of debt to be absorbed/recouped from Liq2.0 keepers?   Yes, please see my Liq 2.0 parameter posts where on-chain liquidity is addressed when defining auction’s throughput, defined by ilk.hole parameter. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.738095238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#16",
                    "likes": "3",
                    "time": "05/08/2021-20:00:42",
                    "content": "    Primoz:  Yes and not, because we have a soft 200% CR rule and potential inability to mint below 150%.   I guess this mitigates some credit risk from the revolving vault. But there remains the “aging” maturity risk of debt generated prior to hitting the CR rule. Anyways, thanks. Looking forward to the assessment. Good work. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#17",
                    "likes": "0",
                    "time": "09/08/2021-22:14:23",
                    "content": "What is the purpose of the origination fee? If it’s a floating-to-fixed interest rate swap then it needs an expiration date and should be renewed periodically. Perhaps Fixed Rate Vaults Proposal With Deco Protocol - #15 by Joshua_Pritikin would be a less bespoke way to accomplish the same effect? ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-13th-19th/9936"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.888888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#18",
                    "likes": "0",
                    "time": "10/08/2021-02:23:16",
                    "content": "Thinking n something @PaperImperium  mentions I like this proposal, mostly to protect us from the controversial blacklists of USDC, PAX or USDT… Today we have the FED talking positively about us, but let’s remember that we came to this market to be disruptive and a power like theirs I don’t think they want to lose. Although WBTC is also a centralized asset… I don’t know if it has a freeze function… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.128787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kiril_Nikolov",
                    "index": "#19",
                    "likes": "11",
                    "time": "17/08/2021-15:07:42",
                    "content": "Although I am joining late in the discussion, I would like to reiterate Nexo Commitment to remain both a large token holder and the single largest borrower on the platform. With the funds we have available on Maker, we have put a long-term vote of confidence into the ability of the protocol and it’s community & team to deliver a competitive solution and keep our funds safe. For the purposes of the Nexo vault, we are expanding Defi access to multiple teams & team members and expanding the access for rebalancing purposes  to cover 20+ hours via the Nexo proffesional lending/trading desk. Initially, it is our intention to keep collateral above 200% as we have always done and with time to automate away any manual rebalancing in conjunction with Nexo trading, liquidation & lending infrastructure as we become more capital efficient. In addition, most importantly, we are already working out the internal systems necessary to conduct on-chain automated collateral management and rebalancing procedures (e.g if collateral <180% - deposit additional ETH). We realize  there is no way to sign legal agreements with the protocol. Nevertheless, as part of our commitment to warrant the development of institutional vaults we can provide official statements through Signed Letter of Intent & Term sheets. In this platform terms, durations & other important parameters will be available and although not enforceable by law, Nexo would incur reputational penalty upon reneging on such an agreement. To address an earlier comment, considering wBTC & ETH as collateral, there is strong preference for BTC collateralization whenever possible. Due to the wrapped nature of BTC, we would eventually reach a limit in our wBTC allocation, which would mean that in the end ETH would remain the collateral of choice. When it comes to collateral options, We would like to very strongly advocate for stETH (Lido), as well as additional assets available to us, incl. NEXO native token, UNI, LINK, etc. Finally, to address changes in vault parameters, as far as I understand maximum increases will not be heart coded and dialogue with protocol teams will be at the heart of any parameter change discussions moving forward, taking into account market conditions, our own needs, balance sheet and other details.  Through the power of open dialogue we should both be able to optimize different policy objectives, such as DAI minting, revenue for the protocol, etc. Hopefully I have managed to address most concerns, but happy to elaborate on any other issues raised by the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.909057271557272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#20",
                    "likes": "0",
                    "time": "17/08/2021-15:57:17",
                    "content": "    Kiril_Nikolov:  We realize there is no way to sign legal agreements with the protocol. Nevertheless, as part of our commitment to warrant the development of institutional vaults we can provide official statements through Signed Letter of Intent & Term sheets.   I really like that idea, although it would be signed by both parties? Who would sign for MakerDAO?     Kiril_Nikolov:  Initially, it is our intention to keep collateral above 200% as we have always done and with time to automate away any manual rebalancing in conjunction with Nexo trading, liquidation & lending infrastructure as we become more capital efficient.   Sounds perfect to me, it builds a lot of trust, how would they deal with a crash or black swan event? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.238095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kiril_Nikolov",
                    "index": "#21",
                    "likes": "2",
                    "time": "17/08/2021-16:27:39",
                    "content": "There is no opportunity to sign the deal on behalf of Maker for now, therefore it could be unilaterally signed from Nexo Management. Automated collateral management should be able to initiate a simple sequence of automated actions:  IF collateral ratio is below 150% → Initiate sequence Withdraw ETH from Binance/hot wallet to Defi wallet Deposit ETH as additional collateral  This automated sequence of actions should cover 99.999% of collateral rebalance cases, with manual backstops in case of catastrophic failures & other black swan events. One such backstop could be an automated collateral deposit address created by the Maker team, which does not rely on Defi accessibility and can be send in an emergency from any address without having to be the vault owner. Hope this helps address your questions, Diego. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.756944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#22",
                    "likes": "1",
                    "time": "17/08/2021-16:53:12",
                    "content": "    Kiril_Nikolov:   Withdraw ETH from Binance/hot wallet to Defi wallet    Why Binance? if FTX is superior in many aspects? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kiril_Nikolov",
                    "index": "#23",
                    "likes": "4",
                    "time": "18/08/2021-08:34:26",
                    "content": "Read as “Withdraw from CEX”, we are on all major exchanges and keep balances there. To expand on previous post, I would also like to indicate the interest of Nexo to commit to a further increase of $100 - $200m of our current oustanding debt ($400M). The proposed parameters were developed in direct dialogue with our team to optimize both sides’ objectives. The only parameter we believe to not be final is a potential structure to decrease origination fee with the increase of the vault size. In other words,  final figure for a vault increase would be between 100 and 200M DAI, depending on the timeline of the implementation.  Also given a clear structure to reduce origination fee with the vault size, we would potentially be able to commit to a 200M DAI increase right away and within a short timeframe of launching the Institutional vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.285515873015873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#24",
                    "likes": "10",
                    "time": "18/08/2021-22:38:20",
                    "content": "Hi Kiril, thank you for your response and Nexo’s commitment to increasing DAI usage. Firstly, I am very keen to see the assessment from @aes as mentioned by @primoz above. I expect this will provide the community with scenario analysis data to confirm the competitive parameters of this proposal. In the interim however, and in response to the above discussion; PE, Risk and Growth would like to put forward our recommendation that the origination fee remain at the stated 1%. We consider this to be a competitive arrangement and would only recommend the community consider reducing this fee if the amount of DAI generated begins to approach or exceed 1B. Similarly, we would like to see 200M as the initial/additional commitment on top of Nexo’s existing exposure. We see this as mutually beneficial when combined with the gradual reduction of the stability fee - something no other vaults are getting. Any amount less than 200M reduces the benefit to Maker relative to existing vault parameters. As always, MKR voters will be the ultimate deciders and we welcome alternative views and perspectives on the above. With regards to the timeline - the code is written and we can have this product available almost immediately pending Governance and Community approval. The above proposal has also sparked discussion with other DeFi ecosystem entities who are in discussions with the Growth Team, so it is positive news that although we are finding our feet while negotiating on behalf of a DAO (something that has rarely/if ever been done before in this context), it is getting the attention of others in this industry and is being seen as a favourable solution, which is great! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.85238413547237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#26",
                    "likes": "0",
                    "time": "25/08/2021-16:10:28",
                    "content": "Thank you very much for your answers, they clarified my doubts, with nothing more to say, I hope for the best news for this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.933333333333334
                }
            ]
        }
    ]
}