{
    "poll_list": [
        {
            "title": "Whitelist Kyber on ETHUSD Medianizer Oracle (MIP10c9-SP11) - September 21, 2020",
            "index": "4193",
            "option": "Yes",
            "supporting_mkr": "23,088",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c9-sp11-whitelist-kybers-promo-token-pricing-contract-on-ethusd-oracle/4193",
            "title": "MIP10c9 - SP11: Whitelist Kyber's Promo Token Pricing Contract on ETHUSD Oracle ",
            "index": 4193,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-whitelist-sp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Anyhowclick",
                    "index": "#1",
                    "likes": "2",
                    "time": "16/09/2020-08:37:38",
                    "content": "MIP10c9: Subproposal to whitelist Kyber’s PT pricing contract for ETH/USD Oracle Access Preamble MIP10c9-SP#: 11 Author(s): Desmond Ho, Anton Buenavista Contributors: Desmond Ho, Anton Buenavista Status: Formal Submission Date Proposed: 2020-09-16 Date Ratified: <yyyy-mm-dd>  Disclaimer MIP10 is meant to handle all of the Oracle related actions. Unfortunately MIP10 has inconsistencies and doesn’t conform to the monthly governance cadence that the Maker Improvement Proposal framework is built around. This has generated a backlog of Oracle proposals. While MIP10 is refactored to conform to the regular MIP process, Oracle proposals such as this one will utilize the more liberal weekly governance cycle. While strictly speaking this makes them not subproposals, they are included in the subproposal archive as a point of provenance to serve as a paper trail. Specification Introduction KyberSwap has a Promo Token, facilitated by Kyber Network, that is used at hackathons and conferences to promote usage of its platform. 1 PT token is pegged to approximately 1 USD, and is priced against ETH. Hence, the v1 medianizer suited its purpose well and was used. Oracle Name ETH/USD Customer(s) Kyber Network - [email protected] Whitelist PT Pricing Contract - 0xe1bdeb1f71b1cd855b95d4ec2d1bfdc092e00e4f - MedianETHUSD (0x64DE91F5A373Cd4c28de3600cB34C7C6cE410C85) Requirements For each customer address to be whitelisted:  Is the contract source code verified on etherscan? yes Is the Oracle data used in a permissioned manner that would prevent parasitic behavior? yes Is Oracle data written to storage? no If Oracle data is stored, is it stored in a private variable? no If Oracle data is stored, is the value accessible on-chain exclusively by the protocol? no  Fee In accordance with the Responsible Oracle Migration Proposal, fees are waived for the first year and determined by MKR Governance after that. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-13-pt-br-portugues/4328",
                        "https://forum.makerdao.com/t/maker-relay-ep-13-en-espanol/4313"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1477272727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "16/12/2020-14:37:41",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2719"
}