{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/feed-back-regarding-sourcecred-to-drive-the-future-of-maker-rewards-for-community-effort/3970",
            "title": "Feed back regarding sourceCRED to drive the future of Maker rewards for community effort ",
            "index": 3970,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "4",
                    "time": "03/09/2020-16:44:05",
                    "content": "I know that the sourceCRED initiative is being extended and that people like myself are being solicited for feedback.     SourceCred Pilot Extension Governance       With the initial trial nearing completion, the success metrics are looking good (final report coming soon). However, to determine if SourceCred is suitable for paying contributors from the protocol, more data is needed. As a result, the Maker-SourceCred working group has decided to extend the trial for another three months using funding provided by the Maker Foundation.  At the end of this three month extension, barring overt gaming or strong opposition from the community, the working group plan…     It seemed logical now that we have been doing this for 3 months to provide communal feed back to each other and to help visualize the future of sourceCRED as a tool to incentivize work across the Maker community space both pro and con. I am opening up this thread for input in this regard and will put mine in below. ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback on the SourceCred initiative, which is being extended for another three months. The author is seeking input to help visualize the future of SourceCred as a tool to incentivize work across the Maker community space. The post also mentions that more data is needed to determine if SourceCred is suitable for paying contributors from the protocol.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 6.003205128205128
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "3",
                    "time": "03/09/2020-16:45:46",
                    "content": "With regards to above I am posting my feed back to sourceCRED as I feel this is my best commentary as feed back I really want the community to see and factor into their own views. But I also want YOU to think about this yourself, honestly, and decide whether you also want to let the rest of us know what you are thinking because part of community is communication.  I am posting my survey info as public because I feel my replies there are most appropriate for community discussion on this topic.   Do not feel obligated to post yours!    On another topic   How familiar are you with how SourceCred works (parameters, how to earn Cred, etc)? 1 = “not at all” and 10 = “very familiar”   7 - pretty familar but not in complete detail.    On another topic   How satisfied are you with the Cred scores assigned to contributions and contributors on the forum? 1 = “scores were terrible” and 10 = “very satisfied”   7 - for the most part the scores look pretty good as the rewards seem to correspond in my subjective view to the amount of participation.   I have more on this in another question below.    On another topic   On a scale of 1-10, how positive an impact has SourceCred had on the Maker Community? 1 = “no positive impact” and 10 = “very positive impact”   5-6  I am not entirely sure if SourceCRED is the reason Maker is seeing an uptick in participation but I think having rewards for contributions inherently are good.   It would be nice to include survey results as the subjective/objective metric about what people feel in terms of positive impact.   I think the reason I don’t grade this higher is I don’t really have a good objective metric of why people are doing what except through direct feedback mechanisms.   Giving rewards for people to provide this feed back on a somewhat regular basis might be a good way to get a subjective view of the community on objective aspects (more and better contribution because of rewards or simply becaue other people are being more active).   Really hard to quantify this here but the idea of implementing a rewardable feed back mechanism to get an objective view on subjective measures might be something to contemplate.    On another topic   How would you feel about expanding the use of SourceCred within Maker to other platforms such as Github and Maker Chat? 1 = “terrible idea” and 10 = “great idea”   9-10   And let me add.   Lets add sourceCRED for people who get MIPs written as well as passed (though we already have mechanics like likes etc.).   The whole point of governance is to get things done and we really need one additional reward mechanic and that is related to success of proposals.  One thing that should be included is a grade of ‘ease’.   For example if the compensation group ever gets anything implemented I would consider this project one of the hardest for Maker - it cost a lot of man hours to get done.  Where as adding LINK as a collateral type is pretty much cookie cutter in terms of effort so would rank lower in terms of a completion grade and hence compensation. I think github work is important,  chat less so but also probably important for support and development.  I want to know will code be worked on through github before going on-chain?  If so we definitely need to add github because development and testing I consider to be another high reward item.  Documentation and website development also important.   It would be nice if we could also include stuff like twitter, reddit, telegram etc. because PR and social communication platforms are an important aspect of PR communications.    On another topic    Do you, or would you prefer to receive MKR through SourceCred rather than DAI? Place an (X) in your preferred choice.    ( ) MKR ( ) DAI ( ) No preference either way    Personally I would like to see users being able to choose on this.   At a minimum I think rewards should be divided into 50:50 DAI:MKR as people get cash that doesn’t change in value as well as MKR to participate in governance.   Might as well add ETH because this also powers ability to move any of this stuff as well.   Example as a new user trying to remain anonymous I might at first want my reward to be in DAI and ETH - ETH so I can use my DAI and later to use my MKR in governance…  So it might be nice to have ETH-DAI-MKR as the key choices an individual can set at their leisure.  I know this make for more tx fees but should be contemplated generally given high tx fees lately.    On another topic   Do you have any additional feedback about the SourceCred trial or ideas to improve SourceCred generally?   I have not really had time to contemplate this.  What I really want to see is a set of sourceCRED introductory guides designed to be ELI15 type with links to more in-depth detail for what I see are the basic users of sourceCRED.  Users that just want to optimize their sourceCRED rewards. Users that want to learn about the system and participate (in the sourceCRED initiative - so in this way every sourceCRED implementation becomes a source of new users and contributors to sourceCRED generally. Users who want to install an implementation of sourceCRED     On another topic   Did you opt in to participating in the trial? If no, why not?   Yep right out of the gate or pretty early because based on my experience - free labor runs out pretty quick if there are no rewards or no possibility of rewards.   Rewards even if minimal can help increase contributions and general participation.  They don’t ‘need’ to be at the level to sustain work (though that is an ideal) but only need to be enough to keep people engauged and reward them at some level.  Optimization of what the community gets vs. what it gives is a real difficult issue to ‘measure’ and then to ‘optimize’.    On another topic   On a scale of 1 to 5, How was your onboarding process for receiving DAI through SourceCred? 1 = very difficult and 5 = very easy   4 - only a slight hitch with the e-mail I had to send to what user here.   I think this should be a one button click after filling out some basic info.  Needs to be dead pan easy.  If I am a souceCRED manager I might also like some contact info (e-mail address to go with a nickname) so sourceCRED staff actually gets a list of contacts for all the people who are using sourceCRED so they can push out informational updates, news, you know all the basic PR for business.    On another topic   Did the amount of money you received cause you to contribute more to the Maker forums?   Initially no but as this amount increases it actually does.  It would be nice if someone could get amount of rewards that correspond to something like 1/4, 1/2, or even a full time job because some of this work is exactly that 1/4, 1/2 or full time jobs.    On another topic   Do you feel the time you spend on Maker Governance is adequately rewarded through SourceCred?   I am really mixed on this.  My first reaction is ‘no’ it doesn’t.  But when I look at what I actually get done I am like ‘probably yes’.   Personally I’d like to see the rewards go up one more notch because I think this would be more like appropriate compensation for people who are doing a lot of heavy lifting in this space (some of these people are experts who could easily command $100K/yr salaries based on technical or educational histories) ",
                    "links": [
                        "https://forum.makerdao.com/t/3941/1",
                        "https://makerdao.sourcecred.io/#/explorer",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/sourcecred-trial-final-report/4569"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9607999639249645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#3",
                    "likes": "3",
                    "time": "03/09/2020-20:09:10",
                    "content": "   On another topic   How familiar are you with how SourceCred works (parameters, how to earn Cred, etc)? 1 = “not at all” and 10 = “very familiar”   3 - i only understand general idea, but did not really look at its internals.    On another topic   How satisfied are you with the Cred scores assigned to contributions and contributors on the forum? 1 = “scores were terrible” and 10 = “very satisfied”   I feel my score is too high - relative to MM, for example. Longer posts, with more complex language should be weighted more?    On another topic   On a scale of 1-10, how positive an impact has SourceCred had on the Maker Community? 1 = “no positive impact” and 10 = “very positive impact”   7 - i think it’s great idea and it feels good to be compensated for many hours spending following/participating in the project. Voting costs also went up (for small holders) and it’s a great way to compensate them indirectly. On the other hand, incentivizing human behavior can be quite complicated, quite likely people will study the weights etc… to extract as much value as possible.    On another topic   How would you feel about expanding the use of SourceCred within Maker to other platforms such as Github and Maker Chat? 1 = “terrible idea” and 10 = “great idea”   2 I think it’s too early to expand to other platforms. Afaik, all active members also participate in this forum. I believe it makes more sense to reward MIPs, compensation group etc… outside of this mechanism.    On another topic   Do you, or would you prefer to receive MKR through SourceCred rather than DAI? Place an (X) in your preferred choice.   I think MKR makes more sense: then users are invested in the success of the project vs “just” doing work. Still, probably MM’s 50:50 makes even more sense.    On another topic   Do you have any additional feedback about the SourceCred trial or ideas to improve SourceCred generally?   Not really. Maybe that this should not be advertised too much, in a sense, that regular users will notice it anyway. It would be useful to see what are the reasons that some people did not opt-in? (conflict of interests, potential legal, tax etc. reasons?)    On another topic   On a scale of 1 to 5, How was your onboarding process for receiving DAI through SourceCred? 1 = very difficult and 5 = very easy   5 Very easy, just provided my ENS address…    On another topic   Did the amount of money you received cause you to contribute more to the Maker forums?   Probably. Likely. Especially for posts like this one     On another topic   Do you feel the time you spend on Maker Governance is adequately rewarded through SourceCred?   Hard to answer… how to measure my contribution? Plus, it’s kind of weird since it does not matter where you live (living costs).  So, it basically depends on your location. ",
                    "links": [
                        "https://forum.makerdao.com/t/3941/1",
                        "https://makerdao.sourcecred.io/#/explorer",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1",
                        "https://forum.makerdao.com/t/3941/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.77090017825312
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#4",
                    "likes": "3",
                    "time": "03/09/2020-20:41:55",
                    "content": "My responses were fairly similar to @MakerMan’s.  I just want to expand on the DAI/MKR payout. I really like the idea of taking MKR out of the hands of speculators and putting it in the hands of governors (who speculate).  I think minting MKR to use for SourceCred will be a hard sell to voters, but I think using surplus DAI to buy MKR on the market and then distributing via SourceCred AND holders who actively vote would be appropriate ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2749999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#5",
                    "likes": "3",
                    "time": "03/09/2020-21:36:27",
                    "content": "@MakerMan, thanks for posting this! Was planning on putting the survey out to the wider community somehow, but wasn’t sure the best way to do it, and also just got super busy tbh. A community member posting this is great. For reference, below is the survey that the Maker-SourceCred working group sent out to those that opted into the trial. Any and all feedback is appreciated! It will definitely be looked at, and be reflected in the final report we’ll be putting out on the first phase of the trial. If you would prefer not to post publicly, you can also DM your answers to @sourcecred-trial-adm.  SourceCred trial survey Below is a short survey on the SoureCred trial, would love your input! Per the trial proposal, this survey is to gauge the subjective user experience of Maker contributors during the trial. It will be used to help the Foundation and community at large evaluate the success of the trial, as well as provide an opportunity for contributors to provide feedback to the the Maker-SourceCred working group on what is working, and where we need to improve as we move into the next phase of the trial. Contributor Survey  How familiar are you with how SourceCred works (parameters, how to earn Cred, etc)? 1 = “not at all” and 10 = “very familiar”   How satisfied are you with the Cred scores assigned to contributions and contributors on the forum? 1 = “scores were terrible” and 10 = “very satisfied”   On a scale of 1-10, how positive an impact has SourceCred had on the Maker Community? 1 = “no positive impact” and 10 = “very positive impact”   How would you feel about expanding the use of SourceCred within Maker to other platforms such as Github and Maker Chat? 1 = “terrible idea” and 10 = “great idea”   Do you, or would you prefer to receive MKR through SourceCred rather than DAI? Place an (X) in your preferred choice.    ( ) MKR (  ) DAI (  ) No preference either way      Do you have any additional feedback about the SourceCred trial or ideas to improve SourceCred generally?    Did you opt in to participating in the trial? If no, why not?    (Optional) Would you like to opt into the trial? If so, please see instructions at the bottom of the survey. If yes, for details see Opting in to Sourcecred/Wth is SourceCred?.  The below questions are for trial participants only   On a scale of 1 to 5, How was your onboarding process for receiving DAI through SourceCred? 1 = very difficult and 5 = very easy    Did the amount of money you received cause you to contribute more to the Maker forums?    Do you feel the time you spend on Maker Governance is adequately rewarded through SourceCred?   ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-pilot-extension/3892",
                        "https://makerdao.sourcecred.io/#/explorer",
                        "https://forum.makerdao.com/t/opting-in-to-sourcecred-wth-is-sourcecred/3913",
                        "https://forum.makerdao.com/t/maker-relay-ep-11/4041",
                        "https://forum.makerdao.com/t/sourcecred-trial-final-report/4569"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.181224809673086
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#6",
                    "likes": "0",
                    "time": "04/09/2020-00:41:15",
                    "content": "    jernejml:  I feel my score is too high - relative to MM, for example. Longer posts, with more complex language should be weighted more?   I disagree. Too many of MakerMan’s posts drive me crazy. He takes way too many words when less would suffice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.607407407407408
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "1",
                    "time": "04/09/2020-01:35:02",
                    "content": "    psychonaut:  I disagree. Too many of MakerMan’s posts drive me crazy. He takes way too many words when less would suffice.   I would agree.   Often times I don’t have time to edit for brevity.  So my apologies.   If there is a choice between posting something or not because I need to edit it for brevity which would you prefer? What annoys me are single line posts that basically ignores the topic and doesn’t add much to a discussion.   Being around the web for quite some time I tend to forgive a lot of things because everyone has their own ways, means and abilities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.687074829931973
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "4",
                    "time": "04/09/2020-08:38:56",
                    "content": "Here is mine.  How familiar are you with how SourceCred works (parameters, how to earn Cred, etc)?  1 = “not at all” and 10 = “very familiar”   5, I understand the big lines, I’ve opted in. Don’t get  How satisfied are you with the Cred scores assigned to contributions and contributors on the forum?  1 = “scores were terrible” and 10 = “very satisfied”   6, nothing is perfect. I don’t think it’s gamed yet so good for me. You are incentivized to add a MIP6 for a collateral owned by a lot of people. It seems that more technical post and non mainstream thoughts are less incentivized by such system.  On a scale of 1-10, how positive an impact has SourceCred had on the Maker Community?  1 = “no positive impact” and 10 = “very positive impact”   3, I would say it’s too early, but I lack data to make a judgement.  How would you feel about expanding the use of SourceCred within Maker to other platforms such as Github and Maker Chat?  1 = “terrible idea” and 10 = “great idea”   5, I don’t think the chat makes sense. Github should. Can we do something for social networks and support as well? No idea how to do it, just that Maker is not very present on social networks. I can think of this twitter post that was poorly handled.  Do you, or would you prefer to receive MKR through SourceCred rather than DAI?  Place an (X) in your preferred choice.   I like the idea of 50/50. No one want to mint MKR for that, so it should be bought on the market (with strategic reserves for instance).  Do you have any additional feedback about the SourceCred trial or ideas to improve SourceCred generally?  It’s growing nicely. You are doing great, just continue.  Did you opt in to participating in the trial? If no, why not?  Yes I did  On a scale of 1 to 5, How was your onboarding process for receiving DAI through SourceCred?  1 = very difficult and 5 = very easy   4, very good but lacking a UX (not sure it is important yet).  Did the amount of money you received cause you to contribute more to the Maker forums?  Didn’t get anything yet, so no. But it probably will.  Do you feel the time you spend on Maker Governance is adequately rewarded through SourceCred?  The time spend is not currently related to rewards. But obviously, my participation is low priority but that can change with SourceCred. ",
                    "links": [
                        "https://twitter.com/tylerwinklevoss/status/1300484831667683328",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.013825757575757
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#9",
                    "likes": "1",
                    "time": "04/09/2020-10:57:58",
                    "content": "    MakerMan:  I would agree. Often times I don’t have time to edit for brevity. So my apologies. If there is a choice between posting something or not because I need to edit it for brevity which would you prefer?   If you want hearts from me then edit for brevity.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#10",
                    "likes": "1",
                    "time": "04/09/2020-13:32:56",
                    "content": "well for everyone I will make extra effort.  often after I launch a post I go back and get rid of the unnecessary blah, blah and som horrific grammar errers.  probably after you read it.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 3.25
                }
            ]
        }
    ]
}