{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/solar-x-preliminary-risk-assessment-disbursement-and-loan-terms/9110",
            "title": "Solar X: Preliminary Risk Assessment - Disbursement and Loan Terms ",
            "index": 9110,
            "category": [
                "Resources",
                "Research"
            ],
            "tags": [
                "solarx",
                "risk-assessment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#1",
                    "likes": "3",
                    "time": "02/07/2021-22:59:33",
                    "content": " Solar X: Preliminary Risk Assessment The Real World Finance Core Unit (the “Core Unit”) recommends that the MakerDao review and provide preliminary feedback (for or against) on the terms and conditions for the proposed Solar X construction financing of a 10 MW solar farm in Suffolk County, New York. The Core Unit has separately made a proposal to MakerDao for its consideration of the Cayman Islands FoundationCo and Delaware LLC entities for Real World Asset financings. It is envisioned that FoundationCo and the Delaware LLC will be used for the Solar X financing. For purposes of this Preliminary Risk Assessment, the lending entity (Delaware LLC) shall be referred to as “LendCo”. The Core Unit will proceed to finalize the documentation for the Solar X financing if there is support for the terms and conditions set forth in this Preliminary Risk Assessment. The Core Unit will still submit a complete Risk Assessment and subject the Solar X financing to the standard governance process. Project Loan Terms As a construction loan for a 10 MW solar farm, the financing terms are more similar to a project finance loan, in that, the borrower (“Project Co”) will receive loan proceeds during the construction process and the loan will be secured by Project Co’s assets. Solar X anticipates a 9 month project schedule. Project Co will undertake various preparatory activities during months 0 to 3. Physical construction will commence in month 4 upon the issuance of the notice to proceed to the EPC contractor (AECOM). Project Co will only sign it’s long-term offtake agreement with PSEG Long Island (a wholly-owned subsidiary of Public Service Enterprise Group (NYSE: PEG) BBB/Baa1) in month 4. Solar X anticipates commencement of commercial operation at the end of month 9. Draw and Disbursement Schedule Solar X proposes the following draw and disbursement schedule.   Draw on the Loan Agreement at its execution and fund $21,000,000 into escrow. The escrow agent to be determined. This amount will accrue interest upon deposit into the escrow account. The $21,000,000 includes a budgeted 12 months of principal and interest (“Debt Service Funds”) that will be used to pay principal and interest on a monthly basis during the construction period.   Escrow will release funds in accordance with the following schedule (subject to other conditions precedent to be negotiated with Solar X):   Month 0 - $3,285,000 to finance a portion of (1) Month 0-3 pre-development expenses (see aggregate breakdown below) and (2) acquisition of the site for the Solar X project ($3,000,000 acquisition cost). LendCo will have security over existing Project Co assets, which will principally consist of the site (value of $3,000,000).   Month 4 - 50% of remaining funds in escrow (excluding the remaining Debt Service Funds) upon execution of the Power Purchase Agreement and issuance of the Notice to Proceed to the EPC contractor.   About Month 6/7 - 25% of remaining funds in escrow excluding the remaining Debt Service Funds) for outstanding construction costs.   Project Completion - 25% of the remaining funds in escrow (excluding the remaining Debt Service Funds).   If Maker cannot accept funding Month 0-3 (as proposed), Solar X will suggest a lower interest rate (currently 5.80% → SFOR + 550 basis points).  Use of Proceeds 2b4452×2174 136 KB   Loan Terms 1b4452×2174 343 KB   Loan Terms 2b4452×2174 249 KB      For Against Abstain     0 voters     (edit by @SebVentures to have a more standard poll, @PaperImperium I think you had already voted) ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-149-thursday-july-8-17-00-utc/9227/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.370006887052342
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "02/07/2021-23:04:17",
                    "content": "I will dig through details later, but I see little reason not to finance the early stage of the project as long as the appropriate protections are in place for loan service in the face of delays, etc etc. I know there may be some who balk at the “money-first” financing, so I want to go ahead and say that in principle, this is “Paper friendly” as long as the borrower’s credit profile or collateral support the terms. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-149-thursday-july-8-17-00-utc/9227/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.491071428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#3",
                    "likes": "1",
                    "time": "03/07/2021-12:31:49",
                    "content": "    christiancdpetersen:  and the loan will be secured by Project Co’s assets.   What are those?  What is their FMV?  What lien position? How will it be secured? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#4",
                    "likes": "2",
                    "time": "03/07/2021-12:35:37",
                    "content": "What is Solar X’s track record, if any, or its owners?  Any prior similar projects?  Any income/loss?  Is it already in debt? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/07/2021-12:46:35",
                    "content": "    omahalawyer:  What is Solar X’s track record, if any, or its owners?   I believe the originator is UPRETS and this would be a new REIT, but may be wrong ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.090909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#6",
                    "likes": "1",
                    "time": "03/07/2021-12:57:05",
                    "content": "Will we be the sole lender, or will there be others at our seniority level participating (as the Centrifuge-based ones are structured), and who and to what extent?  How much equity investment are we requiring by Solar X? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "2",
                    "time": "03/07/2021-13:50:58",
                    "content": "Given that the AO has to pay a 14% coupon on the bonds it issued this year, could we get a little more background on the financial aspect of this proposal? Thank you for the walkthrough of the legal framework! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.703125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#8",
                    "likes": "0",
                    "time": "03/07/2021-14:33:42",
                    "content": "Upon project completion at month 9, Project Co will own and operate the 10MW solar farm. The solar farm assets will include the underlying land, the solar panels, balance of plant, contracts (power purchase agreement, EPC contract, interconnection agreement, insurance proceeds, among others). During months 0 to 3, Project Co will principally own the underlying land and, to the extent signed, any contracts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/07/2021-14:39:59",
                    "content": "Maker will be the sole lender to Project Co. To date, we have not landed on Solar X’s final equity position in the project. Most solar farm projects have equity financing that seeks to benefit from the federal investment tax credit (federal) and any state tax credits. We understand from Solar X that it will target businesses, family offices and wealthy individuals as potential equity investors as such persons will want to benefit from the investment tax credit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "1",
                    "time": "03/07/2021-15:42:14",
                    "content": "How confident are we that SolarX will be completely unaffected by a bankruptcy of the AO? Assuming their financial statements are correct and up to date, Xinyuan Real Estate looks like it is heading for a default if they can’t keep rolling their $800+ million in USD debt. They also owe significant RMB debt through the Singapore and Shanghai markets. Would that expose SolarX loans (the collateral) to being liquidated if the AO experienced a negative shock — in particular if any equity is held by the AO? Also, would that affect operations of SolarX either before or after construction is complete? I like the general idea here, but the AO has an enormous debt burden and overhang from underperforming projects it hasn’t been able to exit from yet. ETA: To make sure I understand it correctly, UPRETS (a subsidiary of XIN) would be the borrower? And the loan it gives to SolarX is the collateral? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.092948717948719
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#11",
                    "likes": "3",
                    "time": "03/07/2021-19:03:54",
                    "content": "@omahalawyer and @paperimperium Thank you for the questions on the Solar X preliminary risk assessment. For the preliminary risk assessment, my intention was to assess MakerDao’s appetite for a construction loan and the proposed disbursement schedule – specifically lending to a project during the pre-feasibility study phase and then its construction phase. I did not anticipate each of these helpful questions for the preliminary risk assessment, so my apologies for its incompleteness.  We will more fully respond to each of your questions in the more comprehensive risk assessment (Comprehensive Risk Assessment), where we will describe the transaction timing, ownership structure, overall project budget, project schedule, project risks and mitigants and counterparty risk in greater detail. However, to provide further context for the Solar X transaction: The borrower (Project Co) will be owned directly or indirectly by third party tax investors and Solar X. As noted in an earlier response, we will discuss with Solar X their expected equity percentage in Project Co. For reference, the debt-to-equity ratio will be 75:25. We do not expect either Solar X or Project Co to be a Xinyuan Real Estate (Xinyuan) or UPRETS corporate entity. Typically, we will legally confirm this separation via (1) representations and warranties in the loan agreement, and (2) viewing of Project Co and Solar X’s cap table. If our assumption is incorrect, we will review whether there may be any acceptable mitigants to Xinyuan’s credit risk. We will clarify this point in the Comprehensive Risk Assessment. We had inquired as to whether UPRETS could (or would) make a loan to Solar X or Project Co in connection with the property acquisition. The answer we received was “No” because of UPRETS higher cost of capital. It is for this reason Solar X sought initial financing from MakerDao to acquire the underlying land and fund pre-feasibility costs (Months 0-3). As we structure the actual transaction documents, we will assess whether or not there will be any impact from Xinyuan’s debt situation. One way to address the risk is to fully keep the loan (as an asset) off UPRETS books. We will discuss this further with UPRETS, Solar X and external counsel. We will address more completely in the Comprehensive Risk Assessment. In terms of the overall financing, we envision that, as the sole lender to ProjectCo, MakerDao (indirectly through Delaware LLC and FoundationCo) will have a first priority security interest over all of Project Co’s assets (including its shares). The exact form of security interest will depend on the underlying asset. But at a minimum, there will be a mortgage over the underlying land and related fixtures. We would also envision a security interest over contract rights. External counsel will undertake appropriate lien searches to ensure that the property is unencumbered, and that Project Co and Solar X do not have any existing liens over any other assets. To the extent that due diligence discloses any existing liens, such liens will have to be removed prior to any funding. The loan agreement will include appropriate representations, warranties and covenants in respect of liens. The fair market value of the secured assets will increase over time as the solar farm is developed. At a minimum, the land will have a fair market value equal to its acquisition price ($3,000,000). Solar panels, equipment, etc. will also have an independent fair market value. Solar X anticipates that, typical with other solar projects as evidenced in third party studies, the completed Solar farm will have a value of $32 million as of the commercial start date. For a third-party valuation model, see EPC Phase: Market Valuation Model - Regression analysis of 279 solar farm transactions (globally) by Deloitte. https://www2.deloitte.com/content/dam/Deloitte/dk/Documents/pardot-downloads/Deloitte_Valuing_Solar_PV_Farm_Assets_Global_Mar2018.pdf For this proposed transaction, Solar X does not propose to utilize the REIT structure set forth in its original MIP6 application. In terms of background, Solar X management includes: Andy Strott - Founder/Managing Partner: Andy has 25 years’ experience in finance, including as senior executive with top-tier investment managers, Blackrock, Alliance Bernstein and MFS Investment Management. He has worked on the European continent, with responsibility to lead new initiatives. Andy has a strong and diverse background in real estate having structured real estate funds and joint venture opportunities as well as performing underwriting for investment in new development, multi-family development, net lease investment, non-performing loans, bridge and mezzanine financing. Andy holds an MBA from Columbia Business School. John Cuneo - Founder/Managing Partner: John is a 30 year professional in real estate capital markets and lending markets. As well as extensive construction managerial and supervisory experience. He has brod efficiency in real estate acquisition and development financing, holding senior management positions at: JPMorgan Chase, where he was the Real Estate Department Head, Barclays Bank, where he was the Commercial Real Estate Lending Team Leader. John holds a Master of Science in Real Estate Finance from New York University, and a Master of Public Administration from Fairfield University. Michaela Dibernardo - Managing Partner: Michaela has more than 20 years experience as a senior executive in institutional finance and investment. With an in-depth understanding of investment strategies, as well as brokerage and capital markets, she has worked with some of the largest mutual funds, pension funds, and hedge funds in the US and Canada. As a licensed professional at Alliance Bernstein and on the NYSE, Michaela followed banks, energy, biotech and fintech. She holds a B.A. from Rutgers University. She also holds a pending patent related to a residential renewable investment strategy. Chris Koch, P.E. - Managing Partner: Chris is Principal Engineer and owner of Koch Engineering, P.C., which provides construction management engineering, construction support services and construction oversight for clients in the NYC metropolitan area. With more than 30 years of engineering experience, his areas of practice include: Plan & Cost Review, Construction Estimates, Construction Schedule Review, Scope of Work Development and Review, Construction Monitoring, Construction Budget Assessment, Construction Requisition Review and Project Equity Rebalance. He is a graduate of Manhattan College. Finally, UPRETS’ role, to date, has been more to facilitate the transaction. It has, for instance, engaged external legal counsel to prepare the underlying loan agreements and been responsible for the day-to-day schedule management. So far, I have been satisfied with external legal counsel. Claymore K. Hardman | GilmoreBell External legal counsel is preparing the documents from a lender perspective, and they continue to interact with me in that process. Please let me know if there are any further questions. ",
                    "links": [
                        "https://www.gilmorebell.com/project/claymore-k-hardman/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.744096812278631
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "4",
                    "time": "07/07/2021-16:01:24",
                    "content": "    christiancdpetersen:  If Maker cannot accept funding Month 0-3 (as proposed), Solar X will suggest a lower interest rate (currently 5.80% → SFOR + 550 basis points).   Wondering–shouldn’t construction loan rates be north of 10%++? Taking on a lot of risk for such a small return…But maybe I’m wrong. Need to ask around. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "05/10/2021-16:01:43",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}