{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-i-will-vote-no-on-the-ratification-poll-for-strategic-marcomms-core-unit/9335",
            "title": "[Delegate] I will vote NO on the ratification poll for Strategic Marcomms Core Unit ",
            "index": 9335,
            "category": [
                "Governance"
            ],
            "tags": [
                "campaigning"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "2",
                    "time": "14/07/2021-17:22:38",
                    "content": "Strategic Marcomms has relaunched their bid for being Maker’s Core Unit for marketing. As a future delegate, I feel the unit does not have what it takes and will use an illustrative example. In April 2021 the Maker community onboarded the first use of a Real World Asset (RWA) as stablecoin collateral. While the immediate effects are merely local, the wider and long-term implications are enormous.  The potential amount of collateral available for Vaults increasing by a conservative estimate of 61000, with profound long-term implications for the whole of crypto. The event was in other words what you would call noteworthy. This is what a typical real-world marketing department would have done:  planned the event, coordinated with relevant groups official press release splashed it on mainstream and social media across all platforms used hyperbolic language for maximum pump and exposure  Here is what an understated, facts-only marketing department could have done:  planned it - it was months in the making  official blog post as an absolute minimum. It is crypto history unfolding. signaled the event on social media. It is reality, not hype. condensed and packaged information and consequences about the event for their industry and potential users.  Here is what the proposed Strategic Marcomms unit did:  I can find no trace of their activities.  Nothing on twitter Nothing on reddit Nothing on the blog Nothing on Youtube around the time of the event Only a few third-party sites even picked up on the event in the aftermath and they quote Centrifuge as the source. Coindesk published it 22.04 and they used @SebVentures’ tweet as source. For the function of strategic marketing and communications at Maker, the community should ask for and expect a higher level of initiative and proactiveness, especially with this group already being on the foundation payroll for 2 years. I will vote “No” on the MarComms application. ",
                    "links": [
                        "https://blog.makerdao.com/governance-polls-september-21-2020/",
                        "https://twitter.com/MakerDAO?",
                        "https://www.reddit.com/r/MakerDAO/",
                        "https://blog.makerdao.com/",
                        "https://www.youtube.com/results?search_query=makerdao+real+world+assets",
                        "https://thedefiant.io/makerdao-will-soon-hold-real-world-assets-as-collateral/?utm_source=rss&utm_medium=rss&utm_campaign=makerdao-will-soon-hold-real-world-assets-as-collateral",
                        "https://medium.com/centrifuge/defi-2-0-first-real-world-loan-is-financed-on-maker-fbe24675428f",
                        "https://www.coindesk.com/maker-price-makerdao-real-world-assets-defi",
                        "https://twitter.com/SebVentures/status/1384947049012006913",
                        "https://forum.makerdao.com/t/reflections-on-marketing-and-governance-from-the-marcomms-core-unit-vote/9523",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-151-thursday-july-22-17-00-utc/9423/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-150-thursday-july-15-17-00-utc/9331/4",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/42",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-15-22/9486"
                    ],
                    "GPT-summary": "The post is a critique of the Strategic Marcomms Core Unit's marketing efforts. The author explains how a typical marketing department would have handled a recent event, and contrasts it with the lack of activity from the proposed Strategic Marcomms unit. The author concludes that the unit does not have what it takes to be Maker's Core Unit for marketing and will vote \"No\" on the ratification poll.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.192460317460318
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GuyB",
                    "index": "#2",
                    "likes": "3",
                    "time": "14/07/2021-19:55:18",
                    "content": "I’ve reached out to you in a DM since this is an example of something the DAO can do that the Foundation simply could not. Needless to say, RWA is something we’d be shouting from the rooftops in the DAO. Same with Delegates. Same with the Optimism Bridge just launched. If we get the chance. If we don’t, so be it - but this isn’t the example that proves unworthiness. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "4",
                    "time": "14/07/2021-20:08:50",
                    "content": "Thank you for the input Planet X. Understood.     Planet_X:  especially with this group already being on the foundation payroll for 2 years.   I believe the Team was handcuffed by the Maker Foundation, not allowing them to fly like a bird. Now that they seek freedom:  Also, a few of them ( I can’t remember his name but he is super talented) currently work for other protocols at the moment–they will leave the current protocol to work for MakerDAO once MKR token holders approve the CU. As you might know, Talent these days is in demand. Truthfully I hope you reconsider your vote and have a one on one talk with @Kathleen – but for sure I understand your position. understood sir. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.254166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GuyB",
                    "index": "#4",
                    "likes": "3",
                    "time": "14/07/2021-20:13:34",
                    "content": "    flipflopflapdelegate:  I believe the Team was handcuffed by the Maker Foundation   It’s worth saying that it was for extremely good reason, and in the long-term interests of MakerDAO, but yes: the Foundation was necessarily limited in what it could do. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.5476190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#5",
                    "likes": "6",
                    "time": "15/07/2021-00:59:25",
                    "content": "Hi @Planet_X Thanks for sharing your views. I appreciate the opportunity to address the issues you’ve raised, and I hope it won’t be too late to change your mind. The ratification poll is for a new team. It consists of me and Guy, who have both worked for the foundation, and six other outstanding and experienced professionals. The team members are formed and finalized in May. To me, judging this unit based on the foundation’s marketing activities would be like using the past performance of team A to gauge how well team B will do. At the same time, I do understand a lack of information from the foundation hasn’t helped. That is why the Strategic Marcomms CU has provided  a shared public drive where anyone from the community can examine our plan for promotion. We have also presented our strategy in detail. We have listed types of content we plan to write, including a sample calendar. By sharing our plans in detail, we hope it provides a clear picture to the community of what we are ready to do. It is all part of our preparation to execute once we have the mandate. The issues you have highlighted are precisely the reasons why this unit is needed. Without the mandate given by the Maker governance community, we won’t be able to act on any of our plans. I hope this post provides more information about our unit and I sincerely ask you to reconsider your vote. ",
                    "links": [
                        "https://drive.google.com/drive/u/1/folders/1xCys_FwCEv5oQ-GX3EMzXfdNkB7KTApK",
                        "https://docs.google.com/spreadsheets/d/18P6LV2pV3OsfoZzGGEP2z8qO9lOkiwHqXCVF_zPmyuo/edit#gid=0",
                        "https://docs.google.com/document/d/1AJ9oGwZhIwcaE0fyRR1fokf2ThDstuHXRPTATnwlsx4/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1yhwHbcCyH0kitezA51I8MbJlBddAv6j4dhAgBKYw7YQ/edit#gid=2090831013",
                        "https://forum.makerdao.com/t/marketing-for-makerdao/9497/5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.053787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NH98",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/07/2021-01:27:11",
                    "content": "Maybe I’ll take this opportunity to ask a question for @Kathleen ! When reading the strategy documents it occurred to me that nearly everything seems to be of “high priority” in terms of locations or target markets. Is there a reason why the team doesn’t want to focus its effort on some specific demographics? (or maybe I’m missing something lol) Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#7",
                    "likes": "4",
                    "time": "15/07/2021-07:03:13",
                    "content": "Hi NH98! Welcome to the community! We appreciate the chance to address any questions and feedback to help the community understand our plan better, so please ask away.  You probably have seen this slide which highlights the target audience on the left.  1432×726 205 KB  And you probably have seen the slide in the strategy document about the markets where we identify as mature and developed vs. high growth. You’ve rightfully pointed out that a number of markets are indicated as high priority. One way to look at it is markets where we identify different sets of opportunities* for MakerDAO. Having identifying the key markets, focusing on specific demographics or audiences will come in nearly every decision we make, including ads we run, campaigns we conduct, budgets we allocate, and partners we collaborate. As importantly, we hope that once we have the mandate, we will gain access to the data from the foundation. That’d help us confirm our analysis and approach and enable us to execute our strategy effectively. @HBJ, a marketing expert in charge of our strategy, will share more details on our approach. *Note: We have put together a document that goes more in detail on the analysis and approaches for opportunities in some major regions. That is important because the approach for high-growth markets would be drastically different from that of a more mature market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.295625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Francesco_Alberti",
                    "index": "#8",
                    "likes": "3",
                    "time": "15/07/2021-07:31:18",
                    "content": "Dear @Planet_X thank you for your comments. I am a member of the team that has worked on the action plan to set up the Strategic Marcomms CU and would like to take a moment to reply to the issues you have addressed. This is a new team that did not exist before and that we felt was needed in the MakerDAO universe, exactly for the reasons you mentioned. This team is made up of people who have worked for the Foundation and other experienced professionals. One thing that I would like to stress is that we are not a re-engineering of the Foundation’s marketing team nor an iteration. You rightly pointed out that when something epochal such as the Maker community use of a Real World Asset (RWA) as stablecoin collateral in April 2021, a first of its kind, there was little hype around it. That can be explained because a) there was not a PR/Marketing team b) there were legal constraints in what the Foundation could announce. You cannot really put fault on a group that did not exist for what was not done. In order to overcome these problems we have proposed a team, the Strategic Marcomms CU, that can take advantage of these and other opportunities (such as the Optimism Bridge) to promote the MakerDAO ecosystem. The world of crypto is still in its infancy and the legal framework in which it operates is still very patchy and uncertain and that put some constraints on what the Foundation could do, or announce. As we will not be part of the Foundation, we will have more operating freedom. As for your assertion that the team has been on the foundation payroll for two years, I would like to differ. Some individuals were part of, or working with, the Foundation in different roles with different mandates, but the team as a whole is mostly made up of external people, such as myself, who were not on the Foundation’s payroll. I hope that in the light of this new information you will reconsider your position and change your vote to a “yes.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.907873376623377
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sahabia",
                    "index": "#9",
                    "likes": "2",
                    "time": "15/07/2021-09:40:40",
                    "content": "Hi @Planet_X. I think enough has been said in this thread by other team members (@Kathleen @GuyB and @Francesco_Alberti) of this awesome proposed CU. I want to reiterate that our proposed CU is determined to become the marketing unit for MakerDAO because we keenly feel the need to market important happenings of the community such as the RWA. That is why we decided to spend several months working on this proposal and building our team. Every team member at the Strategic Marcomms CU reflects MakerDAO’s values of marketing, innovation and resourcefulness. We love to see the entire cryptocurrency community grow to become stronger. We want MakerDAO to play a key role. Many of us have been ardently supporting MakerDAO for several years, our efforts have been driven by industry-wide passion to see MakerDAO succeed. Having this CU as part of the community will only energize and usher us into exhibiting the best we can to better achieve our vision for MakerDAO. Moreover, looking at our strategy will only make you realize the good plans we have pen down to offer the most succulent promotion needed for MakerDAO growth. Voting us in, is the fuel to spark this engine of zealous marketing the community expects to see. The DAO marketing unit can aggrandize marketing for MakerDAO that the foundation simply couldn’t because of legal constraints. Ever since we started working on this proposal, we have never taken the community’s contributions for granted, not for one minute. Our team takes the community seriously, as a way of coming together across lines of difference to confront and solve problems, build ideas, and expand opportunity. We expect a lot, too. It will be a tremendous honor to work to live up to it when we have the mandate. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.1311616161616165
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HBJ",
                    "index": "#10",
                    "likes": "3",
                    "time": "15/07/2021-16:14:58",
                    "content": "Hello @NH98, great to meet you! Just add on to Kathleen’s response, we have a diverse team across regions to help tackle the different priorities. For example, in Africa, we will focus more on the grassroot community outreach through our ambassador program. Whereas in a more mature market like the US, our marketing efforts will be more sophisticated—PR, paid media, co-marketing campaigns, event sponsorships and thought leadership activities. And regardless of the market, the specific demographics or target audience will factor in our marketing approach as they are important. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HBJ",
                    "index": "#11",
                    "likes": "2",
                    "time": "15/07/2021-16:54:50",
                    "content": "Hello Planet X, I can understand your frustrations. The gaps which you have highlighted on what marketing could and should do more are exactly what our Strategic Marcomms Core Unit are set up to address. I wouldn’t elaborate more about the limitations faced by the previous team within the foundation environment which my teammates have explained in the above responses. (And just to clarify, I’m not from the foundation.) I like to highlight a slide from our proposal which will give you an insight into our approach on amplifying any new development or deal done by the Maker community or CU. For your reference:  Screenshot 2021-07-16 at 12.25.27 AM1634×968 157 KB  As seen in the above screenshot example, we have put in place a framework which is designed to amplify and create maximum awareness and exposure for Maker. Depending on the announcements or the deals, the specific details in each step will change but the overall logic flow will remain. I hope that gives you a clearer view of our team’s thinking towards marketing. Last but not least, I just want to say that within this proposed Strategic Marcomms CU, we have a team of highly experienced, well-qualified, dedicated and passionate professionals who are raring to take Maker to the next level. I sincerely hope you will reconsider your vote and change it to a 'YES\". ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.974905303030304
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#12",
                    "likes": "0",
                    "time": "16/07/2021-05:14:49",
                    "content": "    flipflopflapdelegate:  I believe the Team was handcuffed by the Maker Foundation   Lets all be careful here. Handcuffs come in different shapes, sizes, and colors. We only exchange the handcuffs we know for the ones we don’t. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "15/10/2021-11:15:22",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}