{
    "poll_list": [
        {
            "title": "Ratification Poll for Collateral Engineering Services Core Unit, CES-001 - September 13, 2021",
            "index": "9809",
            "option": "Yes",
            "supporting_mkr": "100,355",
            "highest_fraction": 0.76
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c2-sp20-adding-collateral-engineering-services-core-unit-ces-001/9809",
            "title": "MIP39c2-SP20: Adding Collateral Engineering Services Core Unit (CES-001) ",
            "index": 9809,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "collateral-onboard",
                "core-unit",
                "ces-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "3",
                    "time": "11/08/2021-22:26:44",
                    "content": " MIP39c2-SP20: Adding Collateral Engineering Services Core Unit  Preamble MIP39c2-SP#: 20 Author(s): Robert Jordan (@monkey.irish) Contributors: Tags: core-unit, cu-ces-001, mandate Status: Accepted Date Applied: 2021-08-11 Date Ratified: 2021-09-27   Sentence Summary MIP39c2-SP20 adds Collateral Engineering Services Core Unit, CES-001. For more information about the history of this MIP, please see:  MIP39c2-SP12: Adding Collateral Engineering Services Core Unit Collateral Onboarding Core Unit Update Collateral Onboarding Core Unit Launch Pod Session Collateral Engineering Services Core Unit Ask Maker Anything   Specification  Motivation Scaling Dai and decentralized collateral management are the biggest motivators for the Collateral Engineering Services (CES) Core Unit. The Maker protocol and community has an understanding and strong consensus that collateral is our top priority. We have done a great job since the Multi-collateral Dai launch in November 2019. Since then and using the resources available to us, we have designed and iterated on a collateral onboarding process that has served us well. Now, it is time to greatly improve upon our capabilities to reach one trillion Dai and beyond. Today, it is clear we work with two different collateral classes or types: crypto native and real world assets. While crypto native is well known, real world assets are a newcomer to the protocol and it is great to see the community experimenting with a variety of approaches. Overall, the future growth and long-term success of the protocol is dependent upon the inclusion of a wide range of off-chain assets. Given what is known with crypto native assets and the systems we have created, it is time to operationalize crypto collateral management to enable anyone to onboard collateral. This will also be true of real world assets once we determine the collateral classes or types and build better systems and processes around them.  Core Unit ID CES-001  Core Unit Name Collateral Engineering Services Core Unit  Proposed Core Unit Facilitator Robert Jordan (@monkey.irish)  Core Unit Mandate  Mission Scale the Dai supply by enabling anyone to onboard collateral.  Vision To operationalize collateral management within the Maker Protocol allowing anyone to onboard collateral while ensuring the stability and security of the ecosystem. Operationalizing our collateral:   Realizes the vision of decentralization by placing the power in the hands of the community. This has the benefit of greatly reducing bottlenecks.   Aligns an appropriate incentive model for the risk/reward ratio of onboarding new collateral. Not only can we enable the community to onboard collateral, we can give them incentives to attract them into the Maker ecosystem. This also has the side benefit of filtering out collaterals that would not support the generation of a large amount of Dai.   Encourages a higher level of experimentation with lesser known collateral types/classes due to transparency of the process. Incentives direct behavior. If the rewards are transparent, people will be more motivated to put time in and experiment.   Provides an opportunity for DAO Core Unit optimization by creating space and focus to take on the most innovative features of collateral management and leaving the basics to the community.    Strategy Operationalizing collateral management means focusing on the people, process, and technology to enable anyone to propose and onboard collateral.  People The first part is people. Our audience is anyone capable of working with the processes and technology we define for onboarding collateral. Those processes will include, for example, the types or classes of collateral we support or the autonomy someone might have given the collateral type that is being proposed. We really want to open this up to as wide of an audience as possible.  Process Since this is all about enablement, there is a constant cycle of adaptation. The first iterations will have constraints and necessary manual intervention. We will rapidly move towards automation keeping stability and security as top priorities. The goal is to employ a system where we Learn, Optimize, and Enable others to help Maker greatly scale the Dai supply.   Technology Once we understand the People and Process part, it is then possible to address the technology we will need to provide the enablement and necessary guardrails for people to work within. Some of the technology exists today while other pieces will need to be developed. Even if we automate 50% of the functions to onboard collateral, it is a big step forward from the manual processes we use today.  Summary The goal of this initial MIP iteration is to provide a high-level overview of the CES Core Unit. Simply put, our focus is to enable anyone to onboard collateral. We will work with the People, Process, and Technology aspects to fulfill this vision. This is also a highly collaborative effort between the Core Units. We will be taking all of the best practices today and bundling them together for the initial product release. The “Product” in this case are the current and future tools, technology, and documentation that begin to fulfill our vision. Until Formal Submission on Sep 8, we will be adding to this forum post and others to provide the specific details on the CES Product Plan. Please reach out if you have any questions. The goal for us is to be clear, concise, and transparent on the CES Core Unit responsibilities and deliverables.  Related Documents Collateral Engineering Services Product Plan MIP40c3-SP30 Collateral Engineering Services Core Unit Budget Proposal MIP41c4-SP21: Facilitator Onboarding, Collateral Engineering Services Core Unit ",
                    "links": [
                        "https://forum.makerdao.com/t/collateral-onboarding-core-cob-unit-update/8657",
                        "https://www.youtube.com/watch?v=Q6xNOLPcw2Y",
                        "https://www.youtube.com/watch?v=QTWc0q46lXs",
                        "https://forum.makerdao.com/t/collateral-engineering-services-product-plan/9887",
                        "https://forum.makerdao.com/t/collateral-engineering-services-product-plan/9887",
                        "https://forum.makerdao.com/t/mip40c3-sp30-modify-core-unit-budget-collateral-engineering-services-ces-001/9810/6",
                        "https://forum.makerdao.com/t/mip41c4-sp21-facilitator-onboarding-collateral-engineering-services-core-unit-ces-001/9811/2",
                        "https://forum.makerdao.com/t/collateral-engineering-services-product-plan/9887",
                        "https://forum.makerdao.com/t/mip40c3-sp30-modify-core-unit-budget-collateral-engineering-services-ces-001/9810",
                        "https://forum.makerdao.com/t/maker-relay-ep-63-en-espanol/10443",
                        "https://forum.makerdao.com/t/maker-relay-ep-63/10400",
                        "https://forum.makerdao.com/t/maker-relay-ep-62-en-espanol/10399",
                        "https://forum.makerdao.com/t/maker-relay-ep-62/10311",
                        "https://forum.makerdao.com/t/mip41c4-sp21-facilitator-onboarding-collateral-engineering-services-core-unit-ces-001/9811",
                        "https://forum.makerdao.com/t/request-for-definitive-description-of-collateral-onboarding-process/14330/10",
                        "https://forum.makerdao.com/t/mip6c3-sp2-modify-the-collateral-application-form/13787/9",
                        "https://forum.makerdao.com/t/mip68-monetalis-vault-v2/13789/4",
                        "https://forum.makerdao.com/t/collateral-management-lifecycle-cml/12751",
                        "https://forum.makerdao.com/t/maker-governance-review-september-2021/10645",
                        "https://forum.makerdao.com/t/maker-relay-ep-64-en-espanol/10548",
                        "https://forum.makerdao.com/t/maker-relay-ep-64/10540"
                    ],
                    "GPT-summary": "The post is a proposal for adding a Collateral Engineering Services Core Unit (CES-001) to the Maker Protocol. The proposal explains the motivation, vision, and strategy of the Core Unit, which is to enable anyone to onboard collateral and scale the Dai supply. The post also provides related documents and invites questions. The post matches the topics of explaining the proposal, positive feedback, constructive criticism, collaboration, and advertising.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.122279182805499
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/08/2021-22:35:27",
                    "content": "@blimpa Please add MIP39 for RFC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#3",
                    "likes": "2",
                    "time": "06/09/2021-22:27:18",
                    "content": "@blimpa Please add MIP39, 40 & 41 for Formal Submission. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#4",
                    "likes": "3",
                    "time": "18/09/2021-15:58:08",
                    "content": "Point of clarification - Upon ratification, a legal entity (LLC) will be formed off-chain for the Collateral Engineering Services Core Unit. As the legal and regulatory environment gains more clarity, it may necessitate moving to a different legal structure to provide greater protection for the core unit and the Maker protocol. CES will work with appropriate legal counsel to form the initial structure and review the entity on an ongoing basis to determine if modifications need to be made. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 6.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/12/2021-15:58:15",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#6",
                    "likes": "1",
                    "time": "10/03/2022-15:28:44",
                    "content": "@blimpa Does this need to be updated to reflect it’s been ratified? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                }
            ]
        }
    ],
    "group_index": "4017"
}