{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/techops-core-unit-updates-january-2023/20163",
            "title": "TechOps Core Unit updates - January 2023 ",
            "index": 20163,
            "category": [
                "Core Units",
                "TechOps"
            ],
            "tags": [
                "cu-update",
                "tech-001",
                "monthly-cu-updates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/dumitru",
                    "index": "#1",
                    "likes": "0",
                    "time": "13/03/2023-14:06:40",
                    "content": "TechOps Core Unit mandate is still valid and remains unchanged. We are here to support critical Maker infrastructure, maintaining its stability and operability with a 24/7/365 schedule. We continue to run infrastructure, services and monitoring to ensure ecosystem stability and health. The team is based in different regions to ensure global coverage. Incidents overview for January 2023 As usual, we start with the overview of the incidents that were opened and we’ve been working on in January 2022. We are monitoring 41 different services. Below are the services that had incidents in January:  Analytics dashboard - 1 incidents AWS infrastructure - 15 incidents EC2 - 20 incidents Etherscan integration - 18 incidents Forum - 1 incidents Governance App - 3 incidents Nodes - 35 incidents Oracles and Feeds - 1 incident Oracle Security Module - 7 incidents Vulcanize DB - 1 incident  TOTAL - 102 incidents Incidents have one of three priorities, where P1 is the highest priority requiring immediate attention and P3 is the lowest priority that doesn’t require quick response. Internal Community tickets There is a channel (#techops-requests) on the Community Discord server that has been created for Community to give requests to TechOps Core Unit. In January there were 20 tickets created using that channel. Community tasks & Cross-core unit collaboration  Community  Whitelisting executive spells Discord - adding/removing users, blacklisting “help” in usernames from registering (Community) Offboard Artem, David, and GovComms CU Upgrading forum to version 3.0.0 Fix letter-avatar issue with avatars being inaccessible on Production Forum Checking why discourse-discord integration doesn’t pick some thew threads   PECU  Updates to Chief keeper, adding extensive monitoring   Dai Foundation  GitHub - adding/removing users, creating repos Adding GovComms to makerdao GitHub org New email user for the Dai Foundation Reporting and shutting down scam website   Starknet Engineering  Fix datasources for Grafana’s Bridge graph Run starknet keeper every 10 minutes for Goerli Deploy Starknet Mainnet teleport-monitor Handover of starknet bridge monitoring Deploy Mainnet Teleport Monitor   GovAlpha  Configuring access and populating webpage for endgame-docs repo Adding GovAlpha bot to Discord server and configuring it   Oracles CU  Investigate Oracles Feeds monitoring Checking Megapoker issues when it’s not poking transactions   DUX  Updates to gasless gov-polling-db Setting up account for PollingDB Investigate Vercel usage increase API monitoring improvements and various changes Migrate SAI database and GraphQL nodes to DUX’s own cloud provider account Additional logging for gov-polling-db firewall Moving gov-portal to new DNS provider and improving its firewall    Internal tasks  Investigating VDB P1 alert Migrated geth1 node to an improved VM configuration Upgrade internal erigon Node Fixed Ticket bot to correctly parse new line characters Fixed extracting ticket from the message Improved ticket integration to use common shared sub-scenario Fix issues with arbitrum1.goerli certificate renewal Investigate erigon1 metrics to see why it has dropped in 3 hours Provision one more Arbitrum and one more Optimism nodes Lambda functions improvements Checked relayers that report pending transactions  Reminder that every last Friday of the month at 14:30 UTC TechOps Core Unit will be hosting open office hours for Maker Community . ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.382680976430977
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/techops-core-unit-updates-february-2023/20164",
            "title": "TechOps Core Unit updates - February 2023 ",
            "index": 20164,
            "category": [
                "Core Units",
                "TechOps"
            ],
            "tags": [
                "cu-update",
                "tech-001",
                "monthly-cu-updates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/dumitru",
                    "index": "#1",
                    "likes": "0",
                    "time": "13/03/2023-14:10:46",
                    "content": "TechOps Core Unit mandate is still valid and remains unchanged. We are here to support critical Maker infrastructure, maintaining its stability and operability with a 24/7/365 schedule. We continue to run infrastructure, services and monitoring to ensure ecosystem stability and health. The team is based in different regions to ensure global coverage. Incidents overview for February 2023 As usual, we start with the overview of the incidents that were opened and we’ve been working on in February 2022. We are monitoring 42 different services. Below are the services that had incidents in February:  Analytics Dashboard - 1 incident AWS infrastructure - 10 incidents EC2 - 13 incidents Etherscan integration - 10 incidents Forum - 2 incidents Governance App - 2 incidents MongoDB - 7 incidents Nodes - 27 incidents On-Chain Governance - 9 incidents Oracles and Feeds - 2 incidents Poke Keeper - 4 incidents Test templates - 2 incidents  TOTAL 89 incidents Incidents have one of three priorities, where P1 is the highest priority requiring immediate attention and P3 is the lowest priority that doesn’t require quick response. Internal Community tickets There is a channel (#techops-requests) on the Community Discord server that has been created for Community to give requests to TechOps Core Unit. In February there were 17 tickets created using that channel. Community tasks & Cross-core unit collaboration  Community  Making Forum work with Tor browser Update GitHub authorizations Test Discourse hosted service Whitelist executive spells Fix Forum 403 issues Add monitoring for Arbitrum2 nodes Scaling up the disk for one of the Arbitrum nodes Help with updating Delegate information on Governance portal Add roles to a Discord user Add Google Sheets embed to forums Add reliable disaster recovery solution to the forum Add DNS record for endgame.makerdao.com to point repo through GitBook Enable API access on chainlog.makerdao.com  Research and improve forum high availability   Dai Foundation  Fix broken link on makerdao ecosystem page Arrange with GovComms transfer of Makerdao.world to DF Reporting and taking down websites Remove the menu options for Donations Intangible assets change request Creating a way to easy get and list outside collaborators for Makerdao github org using GitHub Actions   CES  Cost estimate for hosting CeS project   Starknet Engineering  Setup new accounts for keeper   Protocol Engineering CU  New maker keeper Improve maker keeper exceptions handling   Oracles CU  Tolerance for pending Txs on relayers   DUX  Working on failing governance portal API calls Grant read access to the rest of the schemas on the staging environment to Hernando Review issues with allCups query Improvements to monitoring tests Improve security for governance portal Expose GraphQL schema of new spock DB Updates to Discord webhooks for DUX alerts Update tests+monitoring for updated spock    Internal  Running VulcanizeDB backfill storage  Reminder that every last Friday at 14:30 UTC TechOps Core Unit will be hosting open office hours for Maker Community  ",
                    "links": [
                        "http://endgame.makerdao.com",
                        "http://chainlog.makerdao.com",
                        "https://forum.makerdao.com/t/techops-office-hours-last-friday-of-the-month-2-30pm-utc/19510"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.139526847421584
                }
            ]
        }
    ],
    "group_index": "2264"
}