{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/forum-at-a-glance-may-28-june-3/8525",
            "title": "Forum at a Glance: May 28 - June 3 ",
            "index": 8525,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "forum-at-a-glance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#1",
                    "likes": "2",
                    "time": "03/06/2021-16:37:18",
                    "content": " Forum at a Glance! The one stop shop for finding out what’s being discussed by governance right now. Links reflect my view of the most noteworthy activities in the governance, risk and oracles categories right now. Disagree? Think something should be added? Leave a reply or a pm.  Three Point Summary ‘What do I need to know as an MKR Holder this week?’  There’s currently 4,7B DAI in circulation. System Surplus Buffer is at 39,6MM DAI. Total Value Locked in Maker is $9,1B.    ICYMI - Announcements  Two new posts are up on the Foundation blog, one on Smart Contract Wallets and another on Community Development.    Active Discussions  ‘What’s going on? You think what?! You’re 100% wrong, and here’s why…’ Governance-Focused Documentation - New - @LongForWisdom starts a discussion around existing and/or needed governance-related documentation. Need for Data Insights Core Unit - New - @tmierzwa points out the need for a Data Insights Core Unit to aggregate and present on-chain data for the improvement of the Maker ecosystem. A Multichain Strategy and Roadmap for Maker - New - @Derek presents a bird’s eye view of the Layer 2 ecosystem and the various opportunities for Maker.   Seeking Consensus  ‘Yo, do you even signal?’ [Signal Request] Burn the 84k Foundation MKR  - @Aaron_Bartsch is running a poll to burn the 84,000 MKR recently transferred from the Maker Foundation. [Signal Request] Should we add new PSMs? - Another Signal Request by Aaron is looking to add Price Stability Modules for new stablecoins. [Signal Request] Lower the UNIV2DAIUSDC-A Liquidation Ratio - @hexonaut is seeking consensus on adjusting parameters of one of the Uniswap LP vaults. [Signal Request] Adjusting Dust Parameter (2021-3) - Next up, @monet-supply  is suggesting adjusting the dust parameter to account for various recent developments. Parameter Changes Proposal - PPG-OMC-001 - 1 June 2021 - Last but not least, the Parameter Proposal Group has put forward a set of parameter changes for various Vaults.   Ongoing Initiatives  ‘Oh my god, this is taking ages, why can’t things be simple?’  Collateral Calls - Calling all Projects!  @juan sets up a signup thread for projects wishing to present on the bi-weekly collateral call. Know any potential collateral partners that want to present? Refer them here. Collateral Status Index - Confused about the current status of the various collateral types that have been discussed recently? Check out this post to find out the status and current position of each within the onboarding process. Weekly MIPs Updates - @Davidutro and @charlesstlouis bring the latest updates in the world of MIPs. MakerDAO Standard Governance Processes - @LongForWisdom writes a brief overview of the currently operating governance processes in the Maker community. Confused between Signals, Declarations and MIPs? Look no further. The Official Welcome Thread - A welcome and introductions thread. Not strictly speaking governance, but if anyone new or old wants to introduce themselves, now is your chance!   Help Wanted  ‘Oh %#$?, we need a doodad, and we need it now.’ Wanted: Risk Domain Monitoring Tools  - @Primoz puts out a call for additional support to produce monitoring tools for the risk team. Grants are available. Wanted: Join the Summary Team - @Davidutro asks for anyone interested in producing call summaries get in touch. Grants available. We could always use help reviewing MIPs in the Request for Comment phase ",
                    "links": [
                        "https://blog.makerdao.com/the-maker-communitys-next-call-to-adventure/",
                        "https://forum.makerdao.com/latest",
                        "https://forum.makerdao.com/t/governance-focused-documentation/8504",
                        "https://forum.makerdao.com/t/need-for-data-insights-core-unit/8450",
                        "https://forum.makerdao.com/t/a-multichain-strategy-and-roadmap-for-maker/8380",
                        "https://forum.makerdao.com/tag/active-signal",
                        "https://forum.makerdao.com/t/signal-request-burn-the-84k-foundation-mkr/8338",
                        "https://forum.makerdao.com/t/signal-request-should-we-add-new-psms/8337",
                        "https://forum.makerdao.com/t/signal-request-lower-the-univ2daiusdc-a-liquidation-ratio/8487",
                        "https://forum.makerdao.com/t/signal-request-adjusting-dust-parameter-2021-3/8315",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-1-june-2021/8476",
                        "https://forum.makerdao.com/t/governance-initiatives/1347",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/tag/mips-update",
                        "https://forum.makerdao.com/t/makerdao-standard-governance-processes/4298",
                        "https://forum.makerdao.com/t/the-official-welcome-thread/771/4",
                        "https://forum.makerdao.com/c/comm-dev/help-wanted",
                        "https://forum.makerdao.com/t/wanted-risk-domain-monitoring-tools/4168",
                        "https://forum.makerdao.com/t/wanted-join-the-summary-team/4318",
                        "https://forum.makerdao.com/tag/rfc",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/4",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/34",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-144-thursday-june-3-17-00-utc/8459/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.480825334086203
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/06/2021-16:38:15",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}