{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-november-2021/12082",
            "title": "Delegate Round-up - November 2021 ",
            "index": 12082,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "13",
                    "time": "08/12/2021-15:11:09",
                    "content": " Introduction Apologies for the delay in getting this posted this month. I will try and make sure it’s up in a more timely fashion moving forwards. Welcome to the second edition of The Delegate Round-up. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. The Delegate Round-up is a new initiative from GovAlpha. If there is anything else you would like to see added, please send me a message or leave a comment below. November has seen some changes within the Recognized Delegate landscape. We welcomed three new Recognized Delegates in @ultraschuppi, @GFXLabs and @JustinCase. We also saw Field Technologies, Inc. end their time as a Recognized Delegate within the Maker Protocol. Gauntlet (@inkymaze) received their first delegated MKR - becoming active as a Recognized Delegate. We also saw some redistributions of previously delegated MKR. November saw the first time that a Recognized Delegate opposed a MakerDAO executive vote when @MakerMan opposed the 5th of November Executive Vote. The rationale for this decision can be seen here. For clarity, GovAlpha supports the right of Recognized Delegates to oppose Executive Votes. For delegate tracking, this was counted as participating in this Executive Vote. November was also the first month included in the Delegate Compensation Trial - a separate post covering the DAI distributions related to the Delegate Compensation Trial has been posted here.  Recognized Delegates At the end of November, we had eight active Recognized Delegates. In descending order of MKR delegated on the 30th of November, these were:     Delegate Delegated MKR Monthly Change     Flip Flop Flap Delegate LLC 32,860.61 +8,957.38   ultraschuppi 20,283.58 +20,283.58   Feedblack Loops LLC 10,102.26 No change   MakerMan 5,071.15 +9.40   monetsupply 5,039.34 -100.00   Gauntlet 3000 +3,000.00   JustinCase 34.26 +34.26   GFX Labs 5.02 +5.02     Recognized Delegates Visualized   pie chart showing relative vote weight of Recognized Delegates697×430 19.7 KB   Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been. The metrics currently tracked for Recognized Delegates center on Participation in on-chain voting and communication by Recognized Delegates regarding their voting choices. These metrics can be seen on the delegate cards on the voting portal. In addition, a further breakdown of the participation metric is available for each delegate on their pages on the voting portal - here is a link to Flip Flop Flap Delegate LLC’s metric page as an example.  Participation For Participation, a score of 100% would mean that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Polls separately and a combined overall participation rating. As of the end of November, the Delegate Metrics for Participation were as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     Flip Flop Flap Delegate LLC 100% 100% 100%   ultraschuppi 100% 100% 100%   Feedblack Loops LLC 88.76% 100% 90.10%   MakerMan 91.36% 72.73% 89.13%   monetsupply 74.42% 50.00% 71.43%   Gauntlet 0.00% 0.00% 0.00%   JustinCase 100% No Data 100%   GFX Labs 100% 100% 100%     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their voting decisions. Recognized Delegates are rewarded with a higher score for providing reasoning for their voting decisions. For example, a score of 100% would mean a Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the end of November, the Delegate Metrics for Communication are as follows:     Delegate Name Overall Communication     Flip Flop Flap Delegate LLC 100%   ultraschuppi 100%   Feedblack Loops LLC 98.35%   MakerMan 92.07%   monetsupply 77.14%   Gauntlet No Data   JustinCase 100%   GFX Labs 100%     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. We have already covered that one of the Recognized Delegates opposed an Executive Vote this month. In November, the Governance Facilitators posted four Executive Votes to the voting portal. All four of these votes passed successfully.     Executive Vote Date Posted Date Passed Duration (Days)     Parameter Changes, Core Unit Budget Distribution 2021-11-05 2021-11-08 3*   Parameter Changes, Return Unused Budget to the Surplus Buffer 2021-11-12 2021-11-14 2   Onboarding WBTC-B, Increasing WBTC-A Stability Fee, Change of Covenants for P1-DROP, Offboarding Collaterals 2021-11-19 2021-11-20 1   Onboarding New Vault Types, Parameter Changes, and Core Unit Budget Distributions 2021-11-26 2021-11-26 0    * This vote was opposed by one of the Recognized Delegates.  Delegate On-boarding At the time of writing, GovAlpha has received one new application to become a Recognized Delegate: @ACREinvest have thrown their hat into the ring, and their delegate platform can be found here. There will be a Meet Your Delegate call with AcreInvest hosted by @prose11 on 2021-12-08 at 15:30 UTC if anyone would like to hear from our newest Recognized Delegate. If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate requirements, please see this forum post. cc: @GovAlpha-Core-Unit @gov-comms-core-unit @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/delegate-compensation-breakdown-november-2021/11979",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://vote.makerdao.com/delegates?network=mainnet",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b?network=mainnet#metrics",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://forum.makerdao.com/t/meet-your-delegate-8/11995",
                        "https://forum.makerdao.com/t/recognised-delegate-requirements/9421",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/under-construction/12274/16",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630",
                        "https://forum.makerdao.com/t/forum-at-a-glance-december-2-9-2021/12119",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570"
                    ],
                    "GPT-summary": "The post provides an overview of the Recognized Delegates operating within Maker Governance, including changes in the landscape, metrics for delegate performance, and executive votes. The post also mentions a new initiative from GovAlpha and an application from a new Recognized Delegate. The post is an explanation of the Recognized Delegates and their performance, with some auditing and reviewing of their activities.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.751812770562771
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Katie",
                    "index": "#2",
                    "likes": "1",
                    "time": "08/12/2021-21:53:49",
                    "content": "Great initiative! Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
            "title": "Delegate Round-up - December 2021 ",
            "index": 12509,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "7",
                    "time": "06/01/2022-18:30:43",
                    "content": " Introduction Welcome to the December 2021 edition of The Delegate Round-up. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. The Delegate Round-up is a new initiative from GovAlpha. If there is anything else you would like to see added, please send me a message or leave a comment below. In December, we welcomed @ACREinvest as a new Recognized Delegate within the Maker Protocol. We also saw a further 1186.81 MKR delegated to the Recognized Delegates, an increase of 1.55% on November. December is the second month included in the Delegate Compensation Trial, a break-down of payments to Recognized Delegates for December is available here. Due to the pausing of the Monthly Governance Cycle in December, there were fewer polls in December, and only two executive votes were held during this month. There are currently a large number of polls planned for the 10th of January, so there will likely be significant changes in the metrics listed below.  Recognized Delegates At the end of December, nine Recognized Delegates were active in the Maker Protocol. In descending order of MKR delegated on the 31st of December, these were:     Delegate Delegated MKR Monthly Change Monthly Percentage Change     Flip Flop Flap Delegate LLC 32,879.61 19.00 0.06%   schuppi 20,244.67 -38.92 -0.19%   Feedblack Loops LLC 10,102.26 0.00 0.00%   MakerMan 5,231.02 159.87 3.15%   monetsupply 5,043.67 4.33 0.09%   Gauntlet 3,000.00 0.00 0.00%   ACREinvest 1,000.00 1,000.00 -   JustinCase 54.04 19.79 57.76%   GFX Labs 27.77 22.75 453.10%   Total 77,583.04 1,186.81 1.55%     Recognized Delegates Visualized Please note for this month, based on feedback, I have changed the colours being used in these graphs to be more accessible to people with impaired colour vision. Let me know if there are any issues with this.  bar chart showing MKR delegated to each Recognized Delegate900×553 4.91 KB   pie chart showing relative vote weight of Recognized Delegates886×546 35.2 KB   Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been. The metrics currently tracked for Recognized Delegates center on Participation in on-chain voting and communication by Recognized Delegates regarding their voting choices. These metrics can be seen on the delegate cards on the voting portal. In addition, a further breakdown of the participation metric is available for each delegate on their pages on the voting portal - here is a link to Flip Flop Flap Delegate LLC’s metric page as an example.  Participation For Participation, a score of 100% would mean that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Polls separately and a combined overall participation rating. As of the end of December, the Delegate Metrics for Participation were as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     Flip Flop Flap Delegate LLC 100% 100% 100%   ultraschuppi 100% 100% 100%   Feedblack Loops LLC 89.58% 100% 90.91%   MakerMan 92.05% 76.92% 90.10%   monetsupply 76.92% 57.14% 73.83%   Gauntlet 38.89% 0.00% 33.33%   ACREinvest 100% No Data 100%   JustinCase 100% 100% 100%   GFX Labs 100% 100% 100%     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their voting decisions. Recognized Delegates are rewarded with a higher score for providing reasoning for their voting decisions. For example, a score of 100% would mean a Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the end of December, the Delegate Metrics for Communication were as follows:     Delegate Name Overall Communication     Flip Flop Flap Delegate LLC 100%   ultraschuppi 100%   Feedblack Loops LLC 98.5%   MakerMan 92.86%   monetsupply 79.75%   Gauntlet 100%   ACREinvest 100%   JustinCase 100%   GFX Labs 100%     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. In December, the Governance Facilitators and Protocol Engineering Core Unit posted two Executive Votes to the voting portal. Both of these votes passed successfully. None of the Recognized Delegates opposed either of the Executive Votes in December.     Executive Vote Date Posted Date Passed Duration (Days)     Parameter Changes, Core Unit Budget Distribution 2021-12-06 2021-12-07 1   Parameter Changes, Delegate Compensation, Vault Onboarding 2021-12-10 2021-12-11 1     Delegate On-boarding At the time of writing, GovAlpha has not received any further applications to become a Recognized Delegate: If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate requirements, please see this forum post.  Previous Delegate Round-ups  November 2021 October 2021  cc: @GovAlpha-Core-Unit @gov-comms-core-unit @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556",
                        "https://vote.makerdao.com/delegates?network=mainnet",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b?network=mainnet#metrics",
                        "https://forum.makerdao.com/t/recognised-delegate-requirements/9421",
                        "https://forum.makerdao.com/t/delegate-round-up-november-2021/12082",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2021/11336",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-01-07/12523",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785"
                    ],
                    "GPT-summary": "The post provides an overview of the Recognized Delegates operating within Maker Governance, including their metrics and performance. It also introduces the Delegate Round-up, a new initiative from GovAlpha. The post extends an invitation to anyone interested in becoming a Recognized Delegate and provides links to previous Delegate Round-ups.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.641084956709957
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/delegate-round-up-october-2021/11336",
            "title": "Delegate Round-up - October 2021 ",
            "index": 11336,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#1",
                    "likes": "15",
                    "time": "01/11/2021-14:46:34",
                    "content": " Introduction Welcome to the first edition of The Delegate Round-up, a new monthly update from GovAlpha. The Delegate Round-up aims to provide an overview of the Recognized Delegates operating within Maker Governance. It also serves as a one-stop forum post where members of the Maker Community can monitor how Recognized Delegates are performing. The Delegate Round-up is a new initiative from GovAlpha. If there is anything else you would like to see added, please send me a message or leave a comment below. October was a turbulent month for the Recognized Delegates. There was a large re-distribution of delegated MKR towards the end of the month, as well as our first Recognized Delegate stepping down from their duties. GovAlpha would like to thank @Planet_x for his time and effort as a Recognized Delegate and wish him all the best for the future.  Recognized Delegates At the time of writing, we have five active Recognized Delegates. In descending order of MKR delegated, these are:     Delegate Delegate Platform Delegated MKR     FlipFlopFlap Delegate LLC https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106 23903.23   Feedblack Loops LLC https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366 10102.26   Field Technologies Inc. https://forum.makerdao.com/t/paperimperium-delegate-platform/8992 8511.07   monetsupply https://forum.makerdao.com/t/monetsupply-delegate-platform/9545 5139.34   MakerMan https://forum.makerdao.com/t/makerman-delegate-platform/9891 5061.75    This table will also track monthly changes in MKR amounts delegated to the Recognized Delegates in future months.  Recognized Delegates Visualized    Delegate Metrics GovAlpha tracks metrics that monitor Recognized Delegate performance. These are useful to both current and prospective delegators in gauging how active Recognized Delegates have been. The metrics currently tracked for Recognized Delegates center on Participation in on-chain voting and communication by Recognized Delegates regarding their voting choices.  Participation For Participation, a score of 100% would mean that a Delegate has voted in all possible polls since they started their role as a Recognized Delegate. GovAlpha tracks Participation in Governance Polls and Executive Polls separately and as a combined overall participation rating. At the time of writing, the Delegate Metrics for Participation are as follows:     Delegate Name Poll Participation Executive Participation Overall Participation     FlipFlopFlap Delegate LLC 100% 100% 100%   Feedblack Loops LLC 86% 100% 87.72%   Field Technologies Inc. 98.04% 100% 98.25%   monetsupply 83.67% 50% 80%   MakerMan 84.09% 40% 79.59%     Communication For Communication, GovAlpha tracks how Recognized Delegates have communicated their voting decisions. Recognized Delegates are rewarded with a higher score for providing reasoning for their voting decisions. For example, a score of 100% would mean a Delegate communicated all of their voting decisions AND gave reasons for reaching these decisions. On the other hand, a score of 50% would indicate a Delegate communicated their decisions but did not provide any reasoning for these decisions. Their scores for each vote are combined to give an overall communication rating. At the time of writing, the Delegate Metrics for Communication are as follows:     Delegate Name Overall Communication     FlipFlopFlap Delegate LLC 100%   Feedblack Loops LLC 80%   Field Technologies Inc. 90.57%   monetsupply 73.17%   MakerMan 89.74%     Executive Votes By looking at how long it takes for an Executive Vote to pass, we can infer whether or not the Recognized Delegates are helping streamline the Governance Process. In October, the Governance Facilitators posted four Executive Votes to the voting portal. All four of these votes passed successfully.     Executive Vote Date Posted Date Passed Duration (Days)     Offboarding USDT Collateral, Core Unit Budget Distributions 2021-10-01 2021-10-02 1   Offboarding Vaults, MKR Vesting, and Core Unit Budget Distribution 2021-10-08 2021-10-09 1   Parameter Changes, WSTETH-A Onboarding 2021-10-22 2021-10-26 4   Aave D3M Onboarding and Core Unit Budget Transfers 2021-10-29 2021-10-31 2     Delegate On-boarding In October, GovAlpha has received one new application to become a Recognized Delegate: @ultraschuppi has thrown his hat into the ring, and his delegate platform can be found here. There will be a Meet Your Delegate call with ultraschuppi hosted by @prose11 on 2021-11-03 at 17:00 UTC if anyone would like to hear from our newest Recognized Delegate. If anyone else wants to hear more about becoming a Recognized Delegate or has any questions, please reach out to one of the GovAlpha team. We will be happy to help. To review the Recognized Delegate requirements, please see this forum post. cc: @GovAlpha-Core-Unit @gov-comms-core-unit @Recognized-Delegates ",
                    "links": [
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform/9366",
                        "https://forum.makerdao.com/t/paperimperium-delegate-platform/8992",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193?u=mkrorbkr",
                        "https://forum.makerdao.com/t/meet-your-delegate-5/11238",
                        "https://forum.makerdao.com/t/recognised-delegate-requirements/9421",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517",
                        "https://forum.makerdao.com/t/delegate-round-up-june-2022/16570",
                        "https://forum.makerdao.com/t/delegate-round-up-may-2022/15630",
                        "https://forum.makerdao.com/t/delegate-round-up-april-2022/15139",
                        "https://forum.makerdao.com/t/delegate-round-up-march-2022/14586",
                        "https://forum.makerdao.com/t/delegate-round-up-february-2022/13657",
                        "https://forum.makerdao.com/t/delegate-round-up-january-2022/13006",
                        "https://forum.makerdao.com/t/delegate-round-up-december-2021/12509",
                        "https://forum.makerdao.com/t/delegate-round-up-october-2022/18785",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-28th-november-4th/11441",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439"
                    ],
                    "GPT-summary": "The post is an update from GovAlpha about the Recognized Delegates operating within Maker Governance. It provides information on the active Recognized Delegates, their metrics, and their performance. The post also includes information on a new application to become a Recognized Delegate and a Meet Your Delegate call. The post explains the purpose of the Delegate Round-up and invites feedback from the Maker Community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.757992875180376
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/11/2021-15:13:29",
                    "content": "Awesome! Graphics, pretty please?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#3",
                    "likes": "3",
                    "time": "01/11/2021-15:17:21",
                    "content": "Will see what I can do for the next one  Edit: @juan added some graphs because you asked so nicely, will do more for the next one ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                }
            ]
        }
    ],
    "group_index": "278"
}