{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/call-for-proposal-grants/7166",
            "title": "Call for Proposal: Grants ",
            "index": 7166,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "cfp"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#1",
                    "likes": "11",
                    "time": "23/03/2021-16:17:23",
                    "content": "Brief Summary What would a grants program in MakerDAO look like? Using this framework, individuals can explore if and how the DAO may need or want a grants program, and how your approach might fit in the context of the Core Unit framework. How might they support MakerDAO’s needs (like those stated here) or Governance Paradigm Problem Space? Summary In order to bootstrap this need arising from the MakerDAO community, Community Development has decided to give a limited number of micro-grants for proposals (150 Dai, only one entry per applicant), available for proposals until April 30th, 2021. Propose a “case study” for a MakerDAO grants program, (Written Doc or Presentation) outlining your thoughts on:  Vision for a grants program Goals in the first 3 months and expected results (how it would be measured) Approximate program budget Overview of operational setup (how it would be managed) Challenges the program may face  Other Notes  The proposal should for a grants program, not a request for a grant (see Maker Foundation grants, Uniswap grants or Compound Grants) Communicate the journey from problem to solution. The proposal should be written as if you were embedded as part of the MakerDAO community and its teams. This is an opportunity to start from scratch. You are encouraged to reach out to other community members. You should keep an eye for feedback or questions from the community that may arise from your proposal.  What Happens Next Keep in mind, this is an experimental decentralized process!  Interested candidates will submit their proposal to this post thread. Feedback from other community members is highly encouraged.  @amy.jung, the interim coordinator, will do an initial review to ensure proposals fulfill the requirements. She will then set up an open call on April 30th to deep dive into proposals.   REF: See description of Call for Proposals as a format ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP1/mip1.md#mip1c2-the-initial-problem-space",
                        "https://grants.makerdao.com/",
                        "https://airtable.com/shrEXXxXB1humz7VS",
                        "https://compoundgrants.org/72a37fa77b2b4423a97602d6a70fb5f5",
                        "https://forum.makerdao.com/t/call-for-proposals-cfps/7164",
                        "https://forum.makerdao.com/t/community-call-grants-april-6-16-00-utc/7340",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-22-24-2021/7192",
                        "https://forum.makerdao.com/t/operational-support-weekly-update-march-25-30-2021/7275",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-134-thursday-march-25-17-00-utc/7095/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-38/7249",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/23",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-134-thursday-march-25-17-00-utc/7095/5",
                        "https://forum.makerdao.com/t/governance-at-a-glance-march-19-25/7199"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.177380952380952
                }
            ]
        }
    ]
}