{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/calling-all-large-scale-secured-off-chain-lenders-e-g-future-competitors/7860",
            "title": "Calling all large scale secured off-chain lenders (e.g. future \"competitors\") ",
            "index": 7860,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "sixs",
                "rwa-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "17",
                    "time": "05/05/2021-10:48:02",
                    "content": "TL;DR The Community needs other LendCOs. 6s will continue to push forward and will give time and effort to the community to help establish other Lenders to diversify and expand the off-chain lender ecosystem. There is plenty to go around.  Scaled real world assets with a secured structure are at the door for the MakerDAO protocol. One day I may live to regret calling for the creation of competitors, but that day is not today. MakerDAO needs more than one LendCo to provide scaled secured loans to credit worthy capital sinks. The market opportunity is staggering and frankly so overwhelming the first impression for many is easily, meh, someone else can & will do it. The community needs other LendCOs. We need ten more! We need twenty! With credit tenant leases alone, 6s can push for and justify a few hundred million of debt ceiling requests over the coming years. While great, as credit tenant leases offer decent diversity, there is still more that my team and I can do. Way more. During the course of 2021 & 2022 (and beyond) my team and I will be bringing to the community new expanded non-crypto uncorrelated capital sinks to help further diversify the collateral pool and expand DAI. The amounts we will be requesting are as large as our ambitions. The market for credit is, put simply, massive. Regardless of how large the market is or how much it would help MakerDAO to skip this important step, 6s takes the position that ALL DAI loans (not even for 10 minutes) must be done with a secured structure. Period. Without that, this cannot scale to anywhere near its full capability. Unsecured lenders have a place, but it is but only a fraction of the addressable credit market. No matter how big the community would allow 6s’ LendCo to get, the size of any one LendCo will initially will be disproportionate to other senior position LendCOs (as there aren’t any !); however in the future one can easily imagine LendCo’s size being constrained by its relative size compared to the aggregate of the off-chain lender market.  At the beginning, there is a need for getting DAI off-chain urgently and thus a RWA-DAI concentration in LendCo will inevitably exist. This is the trade-off given the USDC stablecoin situation puts MakerDAO in with one would-be secured LendCo. This DAI concentration issue however will dissipate as new secured lenders are brought on. For clarity, a secured Lender in this context means that the custody of the DAI (or its subsequently exchanged USD) remains in the hands of a smart contract OR regulated entities until such time as a transaction occurs whereby the USD goes directly to the “seller” in exchange for collateral. LendCo should NOT be able to touch the DAI / USD. Running a secured LendCo may sound like fun. In the end, it is a tough business where collateral security and diligence run the daily routine. Margins are always tight. Structuring to be senior in all outcomes comes with experience and scars. While scale is your friend, running a LendCO has all of the requirements of running a publicly traded company less the interaction with the securities exchange. Annual financial audit covenants and in a seemingly endless fundraising cycle is the “norm”. Regardless, many will view that the structure is what is important to get “through” governance. While it is important to have the right structure to scale, running a LendCo is really 99% execution and 1% structure. (It is a painful and expensive lesson for those that do not follow that previous sentence). If we want to change the world, the community needs new market participants (either from within the community or new all together). We need new LendCOs. Period. I have put together the document Roadmap (6s - RWA001-A - Document Roadmap) for anyone to follow. In the spirit of transparency, those documents are being shared with the community with the express interest of showing the path for others to follow. They have been painstakingly constructed (with more legal review than I ever expected) to be collaborative / interactive with the DAO. Please contact me to start the discussion if you are interested. Let’s GO !! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14482",
                        "https://forum.makerdao.com/t/addendum-for-mip72-delegated-collateral-attachment-rwa-arranger-application-6s-capital/14481",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684/29",
                        "https://forum.makerdao.com/t/mip40c3-sp10-modify-core-unit-budget-ses-001/7369/24"
                    ],
                    "GPT-summary": "The author of the post is calling for the creation of more LendCOs to diversify and expand the off-chain lender ecosystem. The post explains the need for more LendCOs and the benefits they would bring to the MakerDAO protocol. The author provides a roadmap for interested parties to follow and invites collaboration and discussion. The post also acknowledges the challenges of running a LendCO and emphasizes the importance of a secured structure for all DAI loans. A 3rd party could give constructive criticism, extend to the proposal, want to collaborate, or advertise the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.6914881867327525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/05/2021-18:04:12",
                    "content": "    mrabino1:  (It is a painful and expensive lesson for those that do not follow that previous sentence).   Matt can you please provide the community as to what the Cost will be to setup a LendCo? If possible. Ballpark. And what types of LendCo’s do you believe can work in this environment? Besides Real Estate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.4027777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/05/2021-08:36:56",
                    "content": "The public answer is … “It depends”. It really depends how seasoned the team is and which counsel is selected.  It is most certainly not “cheap”. Setting up a LendCo is one thing. Running it is another. Let me DM you to go over the specifics. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.842857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "10/08/2021-14:37:26",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/08/2021-12:50:24",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}