{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-temporary-freeze-of-rwf-001-operational-wallet/17995",
            "title": "[Signal Request] Temporary Freeze of RWF-001 Operational Wallet ",
            "index": 17995,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-withdrawn"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#1",
                    "likes": "2",
                    "time": "19/09/2022-17:24:48",
                    "content": "Overview A proposal has been put forward to offboard the Real World Finance (RWF-001) Core Unit. Since early August, the facilitator has been moving to divest the core unit of its responsibilities under various MIPs and oversight frameworks. The RWF-001 Operational Wallet still holds 575,875 DAI, and the co-signers of the multi-sig lack the explicit authority to halt the disbursement of funds. Since the conclusion of known work in July, two monthly disbursements totaling around 227,281 DAI have been sent off-chain through the service Accountable (or similar). Previous core unit offboarding precedent suggests all funds in the operational wallet are available to the core unit until offboarding. Therefore, additional guidance from governance would be needed to block use of remaining funds in the RWF Operational Wallet. Proposed Actions Given the intervening time since the last known work of this core unit and the unknown levels of its current staffing, this signal request proposes to instruct all signers of the RWF Operational Wallet (0xD1505ee500791490DE8642353BA6A5b92e3550F7) to cease all transactions until the author of the current RWF-001 offboarding proposal communicates an intent to withdraw, or the end of the October monthly governance cycle – whichever occurs first. Any legitimate winding down or accrued expenses are recommended to be submitted via signal request, accompanied by the appropriate documentation. Pros Prevents the possible misuse of up to 575,875 DAI Cons May disrupt payment of legitimate winding down or previously accrued expenses    Temporarily Freeze RWF-001 Operational Wallet?  Yes No Abstain     0 voters     This poll will close on 2022-09-26T00:00:00Z Next Steps If successful, a poll will be presented on-chain for approval by MKR holders. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-liquid-bond-strategy-execution/13148/112",
                        "https://forum.makerdao.com/t/mip55c3-sp6-legal-domain-work-on-greenlit-collateral-bibta-special-purpose-fund/17166",
                        "https://forum.makerdao.com/t/mip55c3-sp8-legal-work-on-mip65-special-purpose-fund/17280",
                        "https://etherscan.io/address/0xd1505ee500791490de8642353ba6a5b92e3550f7#tokentxns",
                        "https://etherscan.io/tx/0x9eb84d5163853607f514ee731b8ee155a55ae0fc90b1cd0ceb478b3d744e2304",
                        "https://etherscan.io/tx/0x3aea3b34f6970a4962945cb78b2a4104a4668f162f49268e8d3ba64cc2579de6",
                        "https://forum.makerdao.com/t/content-production-core-unit-offboarding-post-mortem/13756",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-14/18039",
                        "https://forum.makerdao.com/t/sucesos-quincenales-del-sourcecred-14-traduccion/18059"
                    ],
                    "GPT-summary": "The post is an explanation of a proposal to temporarily freeze the RWF-001 Operational Wallet due to the lack of explicit authority to halt the disbursement of funds. The proposal suggests instructing all signers of the wallet to cease all transactions until the author of the current RWF-001 offboarding proposal communicates an intent to withdraw or the end of the October monthly governance cycle. The post also includes a poll for voting on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.185672514619883
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "1",
                    "time": "19/09/2022-17:25:40",
                    "content": " [SIGNAL REQUEST] Temporary Freeze of RWF-001 Operational Wallet This is a summary of the governance impacts of this Signal Request from GovAlpha’s perspective:  This is a valid Signal Request. This SR gauges community sentiment towards temporarily freezing RWF-001 Operational Wallet. It is a binary poll with voting options: Yes, No, and Abstain. Specifically, the passing of this Signal Request will result in an on-chain poll which upon passing will “instruct all signers of the RWF Operational Wallet (0xD1505ee500791490DE8642353BA6A5b92e3550F7) to cease all transactions until the author of the current RWF-001 offboarding proposal communicates an intent to withdraw, or the end of the October monthly governance cycle – whichever occurs first.” Given the potential urgency of this signal, GovAlpha approved an expedited duration of one week instead of two. For further info, please refer to @prose11’s comment  This Signal Request will run until September 25, 2022 at 23:59 UTC. If more than 50% of non-abstaining votes are in favor of this proposal, it will go on-chain as a poll on September 26, 2022. Should this proposal pass on-chain polling, signers of the multisig will be informed of its passage and will be required not to sign further transactions until the end of the October monthly cycle, or the stepping down of the RWF-001 Facilitator @williamr. This SR has been assigned High-Impact based on the methodology listed here.  Updated Sept. 19th. Thanks @blimpa and @Gala ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-temporary-freeze-of-rwf-001-operational-wallet/17995/3",
                        "https://forum.makerdao.com/t/introducing-impact-estimations/14267"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "0",
                    "time": "19/09/2022-17:33:28",
                    "content": "Since it will take us a little bit of time to post a summary, I wanted to post that the 1 week duration (minus a few hours so we can process poll if it passes) has been approved by GovAlpha. Given the potential urgency of this signal, I felt it was appropriate to use only 1 week instead of our standard 2. This determination should have no bearing on the voting for this poll, as it was made off of the proposal author’s intention, not a GovAlpha determination of importance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving information about proposal to voters",
                        "3rd party giving positive feedback on proposal"
                    ],
                    "Sentiment": 5.008928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#4",
                    "likes": "6",
                    "time": "19/09/2022-18:03:44",
                    "content": "As a signer on the RWF-001 Operational Wallet, I will wait for the resolution of this SR and corresponding on-chain poll, if applicable, before signing additional transactions. cc: @williamr ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#5",
                    "likes": "4",
                    "time": "19/09/2022-18:10:54",
                    "content": "    monkey.irish:  I will wait for the resolution of this SR and corresponding on-chain poll, if applicable, before signing additional transactions.   same as Robert,  I will wait for the resolution of this before signing additional transactions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#6",
                    "likes": "0",
                    "time": "19/09/2022-18:48:05",
                    "content": "Up until this moment, I have been fully cooperative with the wind down process of the RWF-001 core unit. The wind down activities are already in course and will be completed by the time the core unit will be wound down within the ratification timeframes. In the meantime, there are ongoing financial commitments to contributors of the core unit involved in the wind down process. I trust the DAO does not expect me to pay for all remaining wind down activities out of my own pocket. I’ve got contractual obligations that I need to honour. And honestly those contractual obligations were already reviewed at the time that the MIP process was announced, way before the time the community has heard about it. @GFXlabs this post puts unnecessary uncertainty into an already willingly wind down process. Therefore this is pure harassment. Shall I amend my contractual obligations for payments to contractors so they go after @GFXlabs for their money for work provided? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.137896825396825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#7",
                    "likes": "8",
                    "time": "19/09/2022-19:02:15",
                    "content": "    williamr:  The wind down activities are already in course and will be completed by the time the core unit will be wound down within the ratification timeframes. In the meantime, there are ongoing financial commitments to contributors of the core unit involved in the wind down process.   If you provide documentation and amounts, we are willing to collaborate to craft parallel signals to ensure those expenses are met through authorized disbursements. Given the large amount of funds in the RWF Operational Wallet, continued cash burn of more than 100,000 DAI per month by RWF-001, and the challenging budget environment in MakerDAO, it is simply prudent to require additional oversight. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party wanting to collaborate on proposal",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.498809523809523
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#8",
                    "likes": "0",
                    "time": "19/09/2022-19:22:23",
                    "content": "    GFXlabs:  If you provide documentation and amounts, we are willing to collaborate to craft parallel signals to ensure those expenses are met through authorized disbursements.   Please be accurate and explicit in your statements. I’ve already amended contractors contracts to fit unilaterally made up decisions with regards to the future of RWF-001, i.e. its wind down. It has already costed dearly in time and headache, without further drama to the community. Now you’re making a process supposed to finish in literally 30 days (less than 23 working days) even more painful. This is harassment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.012626262626263
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#9",
                    "likes": "5",
                    "time": "19/09/2022-19:33:45",
                    "content": "Would you please be transparent about where exactly these payments are going? How much and to whom? I think this is a very fair ask in a DAO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.266666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#10",
                    "likes": "1",
                    "time": "19/09/2022-19:37:29",
                    "content": "    williamr:  Please be accurate and explicit in your statements.   Let’s get a few delegates and/or community members together to help you review any back expenses and ongoing expenses related to work done for MakerDAO, and we can help you draft a signal request to authorize those payments. Alternatively, you are encouraged to submit a signal for those payments yourself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#11",
                    "likes": "1",
                    "time": "19/09/2022-19:39:22",
                    "content": "There are 6x headcount working in the wind down activities for the core unit. We are doing a full self-audit of each of the collaterals in the system along with reporting to provide handover and wrap up of what has been done to date. By 23 October the core unit closes its activities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving information related to proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.486111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#12",
                    "likes": "2",
                    "time": "19/09/2022-20:11:24",
                    "content": "^^^ this is why you don’t trust people with lots of money in multisigs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#13",
                    "likes": "0",
                    "time": "19/09/2022-20:18:07",
                    "content": "Please count for me the number of core units who have ever returned more than 50% of their budgets to the protocol and I’ll tell you who is trustworthy? Better. Count for me how many core units have ever returned ANY cent to the protocol. Let me help you. It won’t take a full hand. RWF is part of a select minority. See for yourself → makerburn.com ",
                    "links": [
                        "https://makerburn.com/#/expenses/accounting"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#14",
                    "likes": "4",
                    "time": "19/09/2022-20:39:00",
                    "content": "Polled for “No” — doubt 99% of the community even understands what it takes to unwind a business entity. More importantly, Will Remor is a committed recognized community member dedicated to this DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#15",
                    "likes": "0",
                    "time": "19/09/2022-20:40:31",
                    "content": "Yes, you’re making my point for me. I don’t blame you. I blame the DAO for making irresponsible trust assumptions. Not just pertaining to the RWA multisig but all multisigs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#16",
                    "likes": "1",
                    "time": "19/09/2022-21:01:26",
                    "content": "I voted “Yes”, only due to lack of communication from this CU and not because I think its the most efficient use of everyone’s time. Would revert to “No” if a simple explanation and short communication is provided by CU. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#17",
                    "likes": "2",
                    "time": "20/09/2022-00:03:19",
                    "content": "I also voted yes due to the large amount of funds and lack of communication. If the CU facilitator provides a funding request with a breakdown of unwinding costs, I would be inclined to vote on that too. Notably, this entire unwinding process(while a good idea) is outside the scope of the CUs mandate and has not received any governance vote. I understand not wanting to wait a month for a MIP39c3 vote, but an SR from the facilitator seeking approval and allocating an unwinding budget would be a good step. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.420918367346938
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#18",
                    "likes": "4",
                    "time": "20/09/2022-01:16:31",
                    "content": "Here is some background information regarding CES’s involvement with RWF. On Sept 8th, CES and RWF met to discuss transition activities. Will reviewed his plan to provide documentation around the deals that RWF completed. We agreed that at the end of Sept CES would get a first look at the documentation and final delivery on or about Oct 24th. Given the scope of the work presented by Will, my opinion is that the work looks to be very useful for ongoing collateral management of the RWAs and supports the work CES is currently doing. I support paying people for their work. It’s highly unlikely Will is doing anything lacking integrity with RWF funds. Sure, the communications could have been better. We can debate on what things costs or decisions people make but a facilitator is such until he/she isn’t. Will shared he had a new team on his RWF office hours and made it clear that he was no longer interested in being a facilitator. If there was grave concern at that time, the community had every right to post a SR immediately. Educating the community is a key part of any transition. As a suggestion, maybe @williamr can post a short transition plan/costs over the past few months so everyone can understand the details. This is about communication. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.45689935064935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#19",
                    "likes": "9",
                    "time": "20/09/2022-10:14:23",
                    "content": "It may not matter much anymore since our entire operating model may be about to change if the endgame proposal passes, but I do believe this poll sets a really bad precedent within the current model.  The Maker DAO itself cannot make binding legal agreements, and The RWF core unit and others may have to engage in longer-term commitments in order to properly operate (or at least, in practice, this was the model so far)  The relative safety of the operational wallets is the buffer that allows core unit facilitators to take a certain degree of risk in the face of a very unpredictable Maker governance. With the introduction of external signers, or by putting the protocol as the beneficiary, this safety is already undermined to a degree. For Maker governance to interfere now and cast doubt over the coverage of the winddown costs is to send a clear message to future participants that Maker cannot be relied on and that, indeed, a core unit should be strictly operated as if all funding can be withdrawn on a very short notice. Maybe this should be the case anyway for prudent operations… it is probably a good rule of thumb. But this poll will make it more difficult to find people who are willing to stick their neck out for Maker or take risks based on their belief in the project. A call for greater transparency and more communication would, in my view, be more appropriate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.553830227743272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#20",
                    "likes": "7",
                    "time": "20/09/2022-10:44:59",
                    "content": "One final time, we will reiterate that we are happy to assist with and encourage the creation of a parallel signal to exempt some funds from this freeze (if approved). Given the offboarding request is the dominant MKR holder in most votes and the clear intention of the facilitator to accept the offboarding, it is simply bad business to continue to entrust 575k DAI to a core unit that has been given effective notice of termination. This signal is meant to align MakerDAO with basic best practices in business, and will be repeated for any outgoing core unit that has such large sums of funds.     williamr:  There are 6x headcount   This is news. If you have this many staff, we encourage you to include their salaries in a signal to exempt funds from this freeze. If community members choose to defeat this signal for a temporary freeze (requiring DAO approval to make further withdrawals) then that is the community’s right. GFX will not actively campaign for this, and brought the signal because it is a common sense, typical business practice and the financial strain of even half of these funds being spent on a core unit that has already pushed legal expenses onto another core unit is material. Governance is free to disregard basic business practices, however. Thank you in advance to everyone who has or will vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.702898550724638
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#21",
                    "likes": "5",
                    "time": "20/09/2022-13:14:08",
                    "content": "I’m concerned about the precedent this action is setting and the immediate reactions taken by the auditor wallet signers before the signal even went through just the forum voting phase. Keep in mind auditor wallets are already checked by the independent signers to ensure the money isn’t embezzled etc. Orderly and peaceful unwinding of a Core Unit isn’t a given, and we need to be very careful in setting the expectation that outgoing core units can be hounded on the way out. It could create unpredictable risk around future offboardings or CU changes. Keep in mind the offboarding vote hasn’t even happened, RWF is an active core unit right now. That being said I think it is important we minimize the expenses we pay to RWF beyond what’s legally required by Will and his company and then the standard 3 month severance proposed for all the offboardings ive made. If RWF is doing any active work right now we need to ensure it is done only based on some kind of demand or need somewhere else in the workforce. There is zero reason to spend budget just for the sake of spending it obviously - but this signal request is not a good way to deal with this problem ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.35532212885154
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#22",
                    "likes": "1",
                    "time": "20/09/2022-13:38:52",
                    "content": "    rune:  Keep in mind auditor wallets are already checked by the independent signers to ensure the money isn’t embezzled etc.   This is not the Auditor Wallet, this is the Operational Wallet, the co-signers of which are coworkers, not auditors. Audits have never been produced publicly or to delegates for any core units as far as we are aware, either. The current cash burn and apparent headcount are documented upthread, so will not be remarked upon further here. If you would prefer that GFX withdraw this Signal Request, we will do so if you can confirm that is your wish. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#23",
                    "likes": "0",
                    "time": "20/09/2022-14:11:35",
                    "content": "    GFXlabs:  This is not the Auditor Wallet, this is the Operational Wallet, the co-signers of which are coworkers   @GFXlabs Please just read the basic setup of this wallet. This SR is building a case and significant uncertainty on very poor understanding of the basic setup and checks in place of this multisig or how the Ops wallet works in relation to the Auditor wallet.  → RWF-001 Auditor Flow ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.81875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#24",
                    "likes": "3",
                    "time": "20/09/2022-14:34:49",
                    "content": "    williamr:  This SR is building a case and significant uncertainty on very poor understanding of the basic setup and checks in place of this multisig or how the Ops wallet works in relation to the Auditor wallet. → RWF-001 Auditor Flow   No Monthly Budget Statements have been made since the June statement. As as been communicated privately and publicly, GFX is more than willing to assist in making sure that expenses are met, but documentation of expenses has halted and headcount has apparently grown to an all-time high. If this core unit has 6 staff and is performing work for MakerDAO, please document those facts. We will be happy to find a carve out, exemption, or other compromise (such as returning a large portion of the funds in this wallet in exchange for less direct oversight by governance). A week ago, nearly 125k DAI were sent to an offramp, which is only 20k DAI less than the draw in August to pay for work done in July. Alternatively, this Signal Request is close and you can appeal to voters that close oversight of funds is not a priority. If @rune confirms that he is comfortable with this core unit’s continued spending, then we are also willing to withdraw the signal out of respect for that request (since he is the author of the offboarding proposal for RWF-001). ",
                    "links": [
                        "https://github.com/makerdao-rwf001/transparency-reporting/tree/main/monthly-budget-statements"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.647845804988663
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#25",
                    "likes": "2",
                    "time": "20/09/2022-15:10:08",
                    "content": "    GFXlabs:  If @rune confirms that he is comfortable with this core unit’s continued spending, then we are also willing to withdraw the signal out of respect for that request (since he is the author of the offboarding proposal for RWF-001).   Pardon me? Why does Rune get to decide whether this signal goes forward? Please… let’s all try to be a DAO as long as possible where and when we can. Rune is not the author of the RWF offboarding proposal by the way, but that hardly matters.    MIP41c5-SP12: Facilitator Offboarding (RWF-001) RFC   MIP41c5-SP12: Facilitator Offboarding (RWF-001)  Preamble MIP41c5-SP#: 12 Author(s): @ultraschuppi, @JustinCase  Contributors: @GFXlabs  Tags: core-unit, cu-rfw-001, facilitator, personnel-xboarding Status: RFC Date Applied: 2022-08-18 Date Ratified: Forum URL: https://forum.makerdao.com/t/mip41c5-sp10-facilitator-offboarding-rwf-001/17332 Ratification Poll URL:   Sentence Summary This subproposal offboards the current Facilitator of the Real World Finance Core Unit (RWF-001).   Specification T…     The accountability needs to start somewhere regarding the horrific mismanagement of this Core Unit. Let’s set a precedent for that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.692708333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#26",
                    "likes": "3",
                    "time": "20/09/2022-15:20:57",
                    "content": "    rune:  Keep in mind the offboarding vote hasn’t even happened, RWF is an active core unit right now.   That is the issue. There has been no vote to unwind or shut down RWF. Technically, the facilitator is acting outside his mandate by unwinding the CU, with minimal oversight or reporting. As for actions taken by auditor wallet signers, isn’t the purpose of signers to make sure that funds are being used in line with the core units mandate? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2480158730158735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#27",
                    "likes": "6",
                    "time": "20/09/2022-16:23:13",
                    "content": "I have spoken to Will and learned that they were working on some new output and spending about 100k per month. Unfortunately a lot of this spend has already been committed to, but if the work is stopped now that will salvage us the 75k projected spend for the 3 weeks of October. To me it is clear that we want to focus on saving money in this situation. As a result I will modify the RWF offboarding MIP to the make the golden parachute contingent on not spending any additional funds beyond the minimum required to close out legal costs, saving us the 75k, and contingent on handing over all critical internal RWF documents to Strategic Finance and Growth, so that they can keep them safe and hand them over to future RWA teams. I am currently working on the final edits to the various MIPs in RFC and as a part of that process will also put these changes in place. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.191558441558442
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#28",
                    "likes": "1",
                    "time": "20/09/2022-21:56:41",
                    "content": "    ACREinvest:  Rune is not the author of the RWF offboarding proposal   can som1 from @GovAlpha-Core-Unit show this @Recognized-Delegates how look for proposal in RFC maybe som quiz to pass be4 compensation for delegate also you claim respect and strike 2 but u no conduct in respect in twttr  twitter.com    kianga.eth 🌍 1000 ACRE DAOs in 1000 Days @fhomoney  TFW I’m a Delegate for a “DAO” that’s centrally controlled by the Founder with weak optics of community decentralization and people want to say I’m responsible for Management. https://t.co/OBqgI4Jtot         4:00 PM - 20 Sep 2022           3            ",
                    "links": [
                        "https://twitter.com/fhomoney/status/1572254319969456132",
                        "https://twitter.com/fhomoney/status/1572254319969456132",
                        "https://t.co/OBqgI4Jtot",
                        "https://twitter.com/fhomoney/status/1572254319969456132"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#29",
                    "likes": "2",
                    "time": "21/09/2022-13:51:38",
                    "content": "Thanks for following Kianga’s personal Twitter account and shilling it here. I’m sure she will appreciate the publicity! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#30",
                    "likes": "0",
                    "time": "21/09/2022-16:28:33",
                    "content": "    rune:  As a result I will modify the RWF offboarding MIP to the make the golden parachute contingent on not spending any additional funds beyond the minimum required to close out legal costs, saving us the 75k, and contingent on handing over all critical internal RWF documents to Strategic Finance and Growth, so that they can keep them safe and hand them over to future RWA teams.   This seems like a good compromise that will require less active monitoring, and GFX will withdraw this signal once the edits are in place. Thank you to everyone who weighed in on this important topic, and the high level of engagement demonstrates how important financial oversight and best practices are to MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.9875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#31",
                    "likes": "4",
                    "time": "21/09/2022-17:38:49",
                    "content": "Let me share some thoughts with the community on what I think works and not. It’s important for the community to provide feedback and even take actions like SRs in specific situations where there is ambiguity or concern for the protocol. For this particular situation, the issue was, what is the RWF CU spending their budget on in the past few months? There was confirmation on the signers of the ops wallet as several delegates reached out to me (and @Nadia). As a signer on the wallet, if suspected anything out of the norm, I would not have signed @williamr transactions. What works is for the community to ask for specific answers to the questions on the work being performed by the RWF CU. In a prior comment on this post, I thought I was clear on the value of the work the RWF CU was providing. While it’s not my responsibility to defend the work Will is providing, I think my opinion as the facilitator of CES should be weighed heavily. Now @rune steps in and this entire exercise turns into a clear example of micro-management. There are 100’s of details that are managed with our collateral at this very moment. I do not expect anyone to understand most of them. There are a lot of plates in the air at any one time and we (just not CES) do a great job keeping things running. What doesn’t work is to get quarterbacked by people who aren’t aware of the down/cross stream impacts by saying, let’s stop work or send what you have over here or there. Delegation is only powerful when you put competent people in place and trust the work is getting done. Let me give you one very small example. Some of the work we completed with the RWA deals is under NDA. By sending critical documents to groups without a signed NDA is a violation of the agreement. It’s a detail that is quite important and one that someone not involved with the day to day details might not be aware of. As a reminder to the community, CES is providing business continuity by managing collateral details that will be transitioned at the appropriate time when the governance process is certain. For example, if the end game MIP set passes, we will work with the interested parties to develop a transition plan which would include the process behind vault adoption. It’s highly likely that a proposed vault adoption MIP would give the directive for the vault adoption. We would still need to work through the 100’s of details to make that happen since we’ve never done this before…or any of the things we are setting up with the end game. It would be easy to underestimate the level of work with this exercise. So, is it work 75k to finish the work? What Will presented to CES seemed very valuable. I would ask @williamr to share the work with the broader community so a decision can be made. As a community, if we choose to micro-manage work at this level, it will be hard to get anything done in the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.46933621933622
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#32",
                    "likes": "0",
                    "time": "21/09/2022-20:12:48",
                    "content": "    monkey.irish:  So, is it work 75k to finish the work? What Will presented to CES seemed very valuable. I would ask @williamr to share the work with the broader community so a decision can be made. As a community, if we choose to micro-manage work at this level, it will be hard to get anything done in the DAO   @monkey.irish I appreciate your input and feedback on the work we have been doing. However as expressed here above by Rune, a decision has been made. If someone does not appreciate Risk Management, there is little more that I can do from here. To date, there is no clear and explicit guarantees Sept, and still less so Oct, will be paid by Maker. Words I’ve had plenty. With this SR we stopped activity as we can no longer consider Maker as a reliable payer. Therefore I am taking payment risk for my contractors on behalf of Maker. My contractors will be paid, regardless, as they have already produced work for Sept. Should Maker default on payment, which right now is on the table, I’ll need to consider the options available. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.383267195767196
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#33",
                    "likes": "6",
                    "time": "21/09/2022-21:21:35",
                    "content": "We are withdrawing this signal request as per earlier communication. Thank you to everyone who voted. CC: @GovAlpha-Core-Unit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#34",
                    "likes": "1",
                    "time": "21/09/2022-22:04:23",
                    "content": "This SR has been withdrawn by its author. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#35",
                    "likes": "0",
                    "time": "27/09/2022-21:09:28",
                    "content": "With this SR withdrawn, if transactions are presented by @williamr for work already completed, I plan to sign them. cc: @Nadia It appears that @rune will make modifications to the RWF offboarding MIP     rune:  As a result I will modify the RWF offboarding MIP to the make the golden parachute contingent…   to take care of the other matters. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#36",
                    "likes": "0",
                    "time": "28/10/2022-07:10:00",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}