{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/a16z-endgame-thoughts/18412",
            "title": "A16z Endgame Thoughts ",
            "index": 18412,
            "category": [
                "Governance"
            ],
            "tags": [
                "longform",
                "endgame",
                "endgame-v3"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Porter_Smith",
                    "index": "#1",
                    "likes": "31",
                    "time": "18/10/2022-14:29:22",
                    "content": "Overview In the spirit of @LongForWisdom’s thorough Endgame Commentary, we wanted to publicly clarify our thinking surrounding the overall strategic direction for MakerDAO, and the Endgame Plan’s role in it going forward. As many others have pointed out, the Endgame Plan contains a number of innovative ideas, but the proposals are complex and involve interlocking concepts that will dramatically change MakerDAO moving forward. We deeply appreciate all of @Rune’s efforts to this point, and in response, wanted to lay out an alternative mental framework for the community before voting has ended on the Endgame MIPs. The Endgame Plan is addressing the need, in part based on regulatory and legal uncertainties specifically surrounding stablecoin projects, for (a) an optimal organizational design, (b) long-term growth strategy, and (c) framework to incentivize innovation and vibrancy within the MakerDAO ecosystem. We believe these debates all funnel into one fundamental question: How can we increase MakerDAO’s decentralization while best optimizing long-term growth? Given that DAI’s most valuable characteristic is its decentralization, we believe that putting MakerDAO on a long-term path to legal, technical, and economic decentralization through the workforce (legal), the customer (technical), and the product (economic) will provide a strategic direction that can help frame other operational decisions by the community. In this vein, another core question is whether MakerDAO should be viewed as a decentralized repository that uses DAI as a bridge asset to access its lower cost of capital, or an immutable decentralized currency in itself. In other words, should the long-term focus be on growth, resiliency, or a coordinated mix of both? The community’s answer to this question will drive different paths to legal, technical, and economic decentralization, resulting in separate analysis for each part of the Endgame Plan. It also has follow-on implications for floating DAI off the $1 hard-peg (which is only enabled by the PSM). Growth prioritizes a $1 hard-peg for predictability for external markets. Alternatively, prioritizing resiliency insinuates a move to the originally intended “soft-peg” for DAI by removing, or at least limiting, the amount of centralized stablecoins held on MakerDAO’s balance sheet through the PSM. Decentralization (a) Legal: MakerDAO Core Units Legal decentralization requires reducing the possibility of potential information asymmetries while eliminating any ongoing reliance from stakeholders involving critical “managerial efforts” of others. The Core Unit structure is arguably already legally decentralized; many are individually wrapped in their own LLC and none are directed by the managerial efforts of others. The possibility for information asymmetries is also dramatically reduced through MakerDAO’s open governance process. Introducing MetaDAOs likely does not change this analysis, nor lead to more organizational resiliency from a strictly legal perspective. Per @LongForWisdom’s comments, we agree that it is very difficult to bootstrap live communities, and that the political, organizational, and economic effects of doing so are complicated. If we want to change how the Core Units are functioning to improve their performance, however, then we should use specific procedures to alter their behavior. In other words, do we need to externally restructure how Core Units work, per the Endgame Plan, or implement community-driven internal changes to improve accountability, efficiency, and output? @Juan’s Project-based budgeting is a great example of a ready-to-implement solution that could be used to increase the performance of the Core Units without introducing the organizational risk inherent in radically redesigning the foundation of MakerDAO’s full time contributor base. (b) Technical: Minting DAI MakerDAO’s open-source smart contract protocol is also already decentralized from a technical lens. However, technical decentralization could be increased if more clients were deployed, perhaps by governance incentivizing greater use cases for DAI across the DeFi ecosystem. @psychonaut’s recent post on the topic echoes this sentiment. For MakerDAO, more technical decentralization practically means “who can enable users access to DAI after depositing collateral?” Or, “how can we incentivize as many access points to DAI generation as possible?” Currently, there are such frontends, however incentivizing more could lead to more resilient technical decentralization. This dovetails with the Endgame Plan’s desire to innovate and expand how others can build on top of MakerDAO. The tension with this approach lies in the importance of governance retaining ultimate authority in underwriting the collateral that backs DAI; every $1 of DAI outstanding needs to have at least $1 of external collateral backing it within MakerDAO’s smart contracts. So while many different frontends can conceivably access MakerDAO’s smart contracts, there could become a commoditization effect to what each offers — access to DAI. Like many other DeFi protocols, it’s illogical to allow any frontend to determine its own rules for generating DAI, as doing so would result in a race to the bottom, where frontends would accept the riskiest collateral to mint DAI. So full technical decentralization through a variety of frontends should be incentivized to the extent possible while recognizing that decentralizing DAI’s backing (more below) is the crux of the issue. Incentivization of frontends could be achieved by providing commissions on the amount of DAI minted through such frontends, similar to how Liquity.org works. Ideally, such incentivization schemes would be sufficient to cause developers to develop frontends that also offer utility for the deployment of DAI, such as through Yearn-like trustless strategies. (c) Economic: What backs DAI? Economic decentralization entails holding collateral that cannot be seized, frozen, or otherwise made unreachable. The debates involving MakerDAO’s USDC exposure and real-world asset program are directly related to this question. This is fundamentally about risk allocation. Collateral sits on a spectrum of decentralization, and centralized collateral has inherent risks because it can be frozen or blacklisted by another party. If MakerDAO issues 1B DAI against collateral that is subsequently blacklisted, the system is now insolvent, which is an existential risk to the long-term continuity of the project. Below are three possible ways to address this concern, which somewhat map to Rune’s Phoenix, Eagle, and Pigeon stances. (1) Beginning immediately, only accept “sufficiently decentralized” collateral types, such as Ethereum and certain derivative products. (2) Continue to accept a certain amount of collateral types with centralization risks (USDC, wBTC, etc.), and decrease their usage over time. (3) Embrace that MakerDAO will have to accept some centralized collateral and put caps on it. Over time, any collateral that meets this criteria would have to be accordingly backed by the same amount of DAI in the Surplus Buffer. As Rune points out in his post on free-floating DAI, economic decentralization (the percentage of DAI backing that cannot be frozen, blacklisted, or seized) is difficult to accomplish without accepting a soft peg; incorporating a hard 1:1 exchange module with centralized stablecoins is one of the few tools that has successfully kept a hard peg throughout volatile market conditions. If MakerDAO seeks to fully decentralize on an economic basis, we agree with Rune’s analysis regarding the need for a predictable timeline. We would add that beginning immediately, any centralized collateral (USDC, RWA, etc.) should be proportionally backed by the Surplus Buffer at a programmatic level (for example, 5%). If a certain collateral type doesn’t meet this threshold by a community-determined deadline, a hard cap could be established that offboards the collateral until the system is in balance. Over time, this percentage could increase until 100% of centralized collateral (or an agreed-upon percentage by the community) on MakerDAO’s balance sheet is backed by Surplus Buffer funds. In Conclusion The Endgame Plan incorporates different innovations designed to drive MakerDAO forward; we will deliberately evaluate each piece separately through the lenses proposed above. We will support MIPs that we believe will contribute to the decentralization of the protocol. We will vote against MIPs that do not meet this threshold in their current form. We also support experimentation through smaller, self-contained proposals to get a baseline for how proposed changes might work (or not) in practice. The community can then iterate on these smaller proposals before implementing wholesale changes that affect the entire system. As always we are available here on the forums, or on Twitter @_portersmith and @milesjennings for further thoughts. Best, Porter and Miles ",
                    "links": [
                        "https://forum.makerdao.com/t/lfws-endgame-commentary/17907",
                        "https://forum.makerdao.com/t/project-based-budgeting/17121",
                        "https://forum.makerdao.com/t/toward-decentralized-front-end-hosting/18265",
                        "http://Liquity.org",
                        "https://forum.makerdao.com/t/endgame-plan-timeline-to-free-floating-dai/17529",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-octubre-2022/18516",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-15/18478",
                        "https://forum.makerdao.com/t/governance-and-risk-212-thursday-october-20-at-17-00-utc/18427/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/26",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/21",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/74"
                    ],
                    "GPT-summary": "The post explains the Endgame Plan for MakerDAO and its role in the strategic direction of the organization. The plan aims to increase MakerDAO's decentralization while optimizing long-term growth. The post discusses legal, technical, and economic decentralization and proposes different ways to achieve them. The authors will evaluate each piece of the plan separately and support MIPs that contribute to the decentralization of the protocol. They also encourage experimentation through smaller proposals before implementing wholesale changes.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.582160136781985
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "6",
                    "time": "18/10/2022-17:16:54",
                    "content": "    Porter_Smith:  The Core Unit structure is arguably already legally decentralized; many are individually wrapped in their own LLC and none are directed by the managerial efforts of others. The possibility for information asymmetries is also dramatically reduced through MakerDAO’s open governance process. Introducing MetaDAOs likely does not change this analysis, nor lead to more organizational resiliency from a strictly legal perspective. Per @LongForWisdom’s comments, we agree that it is very difficult to bootstrap live communities, and that the political, organizational, and economic effects of doing so are complicated.   While I agree that information asymmetry via the Endgame might not improve (TBD) and the current Core Unit structure is arguably already decentralized, the current monolithic business structure of Core Units leads to an orthodoxy about strategy, customers, and technology. These tightly integrated “entities” and their monocultures make any DAO vulnerable to unconventional competitors and blind to new kinds of opportunities (see what happened w/RFW CU, some say getting a budget is the only motivation for CUs to exist). As David Weinberger explained it in his book “small pieces loosely joined”, similar to how the web is diverse, but yet coherent—the Endgame will create an organizational model that mimics the architecture of Decentralized Autonomous Organizations—and MetaDAOs will be free to form and evolve via the “primary scopes” and “supporting scopes” and they will all share the same approach to target setting, internal contracting, and “cross-unit”coordination. I can also tell you that after attending the DAOist in Bogota, Colombia—the ecosystem of DAOs (9000++ and counting) that I encountered at this conference is already thinking about how to further decentralize via “sub-DAOs” of a DAO. These communities understand that bureaucracies are insular, tied-down in a closed system that doesn’t adapt—it atrophies. And how do we disrupt organizational structures that are bureaucratic—by going from monolithic businesses to MetaDAOs that build their own ecosystems. And I don’t have the right answers, but this is how I’m thinking about it. Surely but slowly, I believe communities will emerge. Otherwise—thank you both for sharing your thoughts with the greater MakerDAO community. ",
                    "links": [
                        "https://en.m.wikipedia.org/wiki/Small_Pieces_Loosely_Joined"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.356507129234402
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Porter_Smith",
                    "index": "#3",
                    "likes": "7",
                    "time": "18/10/2022-17:22:59",
                    "content": "Thanks for the thoughts @flipflopflapdelegate, makes sense. The status quo needs to evolve, I think the question is “how.” Maybe experimenting with one MetaDAO (or one per type), iterating, and then rolling out an organizational change with real data and live experience could strike the balance here. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.893939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#4",
                    "likes": "4",
                    "time": "18/10/2022-19:23:12",
                    "content": "Thanks for this post, it’s great that you’re actively engaging in governance and I think the questions and ideas being raised here can also be very helpful in highlighting the context behind the Endgame design. Overall I would argue this post presents/reaffirms what I call the classic “we’ll take it as it comes” approach to decentralized governance. Basically, the idea is to have MKR continuously grow and evolve the protocol by approving or rejecting ad hoc proposals and pieces of complexity, and it is well symbolized by the quote:     Porter_Smith:  How can we increase MakerDAO’s decentralization while best optimizing long-term growth?   That is, a continuous process where MKR holders keep evolving the direction and the scope of the protocol by continuously inviting proposals that answer the open question above. This supports an infinite evolution of the Maker Protocol over time and means that there is no limit to the level of technical or political complexity that Maker will obtain. I also call this an open-ended implicit complexity paradigm, and unfortunately I consider it to be entirely unviable because of the nature of the complexity spiral it creates. Since the main allure of this approach is that it is “simple”, it favors implicit complexity over explicit complexity. As more “simple” solutions are added without explicit definitions for how they interact with each other, the system grows increasingly complex and opaque. As a result, it becomes even easier to add more implicit complexity, and those who already have momentum in adding and operating the existing implicit complexity are at a major advantage when it comes to adding more of it. This leads to some problematic and contradictory incentives over time. The Endgame Plan tries to fundamentally deal with this problem starting at the root, which is voter apathy and structural inertia. One way to try to illustrate the difference of approach is that the Endgame Plan attempts to answer the question:  How can we construct an immutable incentive framework for a self-organizing governance equilibrium that reliably acts to increase MakerDAO’s decentralization(resilience) while best optimizing long-term growth?  On the surface this question seems more complicated than the one above, but the major difference is that you have to answer it only once (in practice you can’t get it exactly right the first time, and likely must fine tune it slightly over a few iterations). The other advantage is time, we can answer this question today, when there is still a greater probability that most actors involved in Maker are trustworthy and committed to the ideals of the project rather than their own benefit. If we do it right, we can almost entirely eliminate the possibility of infinite complexity growth regardless of how far we extrapolate into the future. When thinking about how to answer this question, the place to start is to first consider how to decisively deal with voter apathy, and holistically build all other elements as an extension of that. Considering individual pieces of complexity in isolation without directly connecting them to the critical, holistic question of voter apathy/voter incentivization, and explicitly defining how they connect to all other elements of complexity is taking a step in the wrong direction, as it becomes yet another element that adds implicit complexity which helps reinforce the complexity spiral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.61797619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#5",
                    "likes": "2",
                    "time": "19/10/2022-17:54:02",
                    "content": "    Porter_Smith:  The tension with this approach lies in the importance of governance retaining ultimate authority in underwriting the collateral that backs DAI;   Very interesting post, Porter. Underwriting RWAs is a key challenge for Maker at both the centralized and decentralized level and will likely continue to be its Achilles Heel. Maker’s ultimate underwriting decision process currently relies on voting by MKR holders and delegates.  Both of these groups (at least to date) lack adequate underwriting skills/experience to make reasonable RWA underwriting decisions.  There are some notable exceptions here, but they are a relatively small minority. Will the same group of MKR holders and delegates be able to structure and oversee RWA metaDAOs that perform reasonable RWA underwriting? Given these folks weakness in RWA underwriting, it is certainly doubtful and this key area will likely remain an achilles heel for Maker. The best course of action for Maker, in my view, is investing in only the highest quality short duration assets such as US treasuries, where there is almost no credit, interest rate or liquidity risk.  This plays more to Maker’s strengths and avoids one of its biggest (and a very dangerous) weaknesses. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.386111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#6",
                    "likes": "1",
                    "time": "19/10/2022-21:38:53",
                    "content": "    Eumenes:  Will the same group of MKR holders and delegates be able to structure and oversee RWA metaDAOs that perform reasonable RWA underwriting? Given these folks weakness in RWA underwriting, it is certainly doubtful and this key area will likely remain an achilles heel for Maker.   In the end game plan, RWA metaDAOs expose their surplus buffer (the source of their salaries and backing for their governance token and incentives) as the junior capital for the deals the mDAO gets into. Do you think this is too little, too much or the wrong incentive for RWA mDAOs to bring good deals aligned with Maker Core? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.869318181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#7",
                    "likes": "4",
                    "time": "19/10/2022-21:44:11",
                    "content": "Excellent question If a RWA metaDAO gets say $1 billion in DAI from Maker, what will be the size of its own investment that is 1st loss capital under Maker?  The 1st loss capital should be sized based on the underlying risk of the metaDAOs investments.  For private credit it would usually be at least 20%. Part of structuring a reasonable RWA metaDAO would require sizing the 1st loss capital based on the riskiness of the RWA assets it holds.  If the Maker isnt sizing the 1st loss capital for the RWA metaDAO in this manner, it looks very reckless (DAI holders should flee) and consistent with my point that Maker lacks the underwriting skills to invest in RWA… Hope this helps. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.392857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#8",
                    "likes": "0",
                    "time": "19/10/2022-21:49:49",
                    "content": "Writing as a community member, not an official ISCU communication.     Eumenes:  The 1st loss capital should be sized based on the underlying risk of the metaDAOs investments.   There is a bootstrap problem here too. On today’s DVC call, Rune seemed to admit that core Maker will need to advance the 1st loss capital to the MetaDAOs because MetaDAOs will not start with any of their own capital. Happy to be corrected if I misunderstood. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#9",
                    "likes": "0",
                    "time": "19/10/2022-21:52:10",
                    "content": "Thanks. This ties back to the definition of the Centralized collateral Scope framework MIP which needs to be written where this criteria needs to be considered. Also, as far as I can tell, mDAOs would have a debt ceiling (250M for RWA mDAOs) which is reviewed quarterly based on the framework criteria, so they need to operate during that time with limited deployment of capital up to their debt ceiling. Not sure this is a solution to the problem you raise. I do see that frameworks and the quarterly review of debt ceiling would imply scaling facilities is done progressively. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.978571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#10",
                    "likes": "3",
                    "time": "19/10/2022-22:35:19",
                    "content": "No 1st loss capital at metaDAOs would be a disaster waiting to happen unless they only invest in stuff like short term treasuries. And big misalignment with the metaDAOs. If this is true, the RWA metaDAOs have likely been fundamentally, and potentially fatally, mis-structured.  And would go back to my point that Maker seriously lacks the underwriting skills to invest in RWAs.  Maker desperately needs RWA underwriting experts who are also well aligned with Maker and not having a variety of serious conflicts on interest. Hence my recommendation that Maker only invest in super high quality, liquid short duration assets like Treasuries. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.848809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#11",
                    "likes": "2",
                    "time": "19/10/2022-22:37:09",
                    "content": "In TradFi this approach would be considered reckless and misaligned and just crazy. And thus never done. Basically a good way to lose money… In TradFi if folks were designing a metaDAO type structure, they would put a great deal of effort early on into sizing reasonable 1st loss capital for both risk management and alignment of interest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#12",
                    "likes": "0",
                    "time": "19/10/2022-23:37:39",
                    "content": "Great point. An investment will go bad at some point and without a buffer or first loss capital how would they be solvent? I imagine that MetaDaos can tap into the Surplus buffer until they are able to be a stand alone MetaDao? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.062500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#13",
                    "likes": "2",
                    "time": "19/10/2022-23:46:52",
                    "content": "If this is true and passes, folks should warn DAI holders to dump their DAI.  I dont think stable coins holders sign up for this type of ‘underwriting’ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#14",
                    "likes": "0",
                    "time": "20/10/2022-00:06:35",
                    "content": "    Eumenes:  In TradFi this approach would be considered reckless and misaligned and just crazy. And thus never done.   I believe Goldman Sachs trading desk for Commodities did revenue of $2 billion++ in 2021–are you sure TradFi does not have an appetite for “reckless and misaligned” risk?  Can we honestly say TradFi credit flow desks don’t have an appetite for risk when they’re flipping ABS, credit default swaps, interest rate swaps, and equity derivatives?  BTW, Protector MetaDAOs will take first loss with all of their assets. I believe the Endgame model for RWAs has three benefits. First, it discourages mediocrity. Protectors that don’t deliver high levels of debt service will lose their internal revenue streams. Second, it unites everyone in a particular MetaDAO around the goal of creating great customer results driven by successful experiences. And third, it maximizes flexibility: Mkt-facing Protectors will be free to reconfigure & plug & play their network of service providers (borrowers), as new opportunities emerge and market cycles occur. Hence, today’s Mkt is not tomorrows market. Anyhow—it’s the NBA season opener for the NY Knicks —back to thinking in bets! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.082373737373738
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#15",
                    "likes": "0",
                    "time": "20/10/2022-00:12:55",
                    "content": "You havent really addressed the core issues we are discussing…not sure what to say ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#16",
                    "likes": "3",
                    "time": "20/10/2022-00:42:57",
                    "content": "    flipflopflapdelegate:  BTW, Protector MetaDAOs will take first loss with all of their assets.   Without first loss capital, all those assets would be given to them by Maker.  If a MetaDAO does something risky and it pays off, they get a bunch of money and praise. If it doesn’t, they only lose stuff that MakerDAO gave them. That is a very asymmetric equation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#17",
                    "likes": "5",
                    "time": "20/10/2022-07:20:29",
                    "content": "    Porter_Smith:  If MakerDAO seeks to fully decentralize on an economic basis, we agree with Rune’s analysis regarding the need for a predictable timeline. We would add that beginning immediately, any centralized collateral (USDC, RWA, etc.) should be proportionally backed by the Surplus Buffer at a programmatic level (for example, 5%). If a certain collateral type doesn’t meet this threshold by a community-determined deadline, a hard cap could be established that offboards the collateral until the system is in balance. Over time, this percentage could increase until 100% of centralized collateral (or an agreed-upon percentage by the community) on MakerDAO’s balance sheet is backed by Surplus Buffer funds.   After reading this is quite a serious statement that could, I guess, be expanded so people understand clearly where you stand. The 5% SB for any centralized asset would limit DAI issuance to 2.7B, i.e. lead to a 50% reduction which would increase the price of DAI until people are willing to sell and use another stablecoin. Difficult to predict, but that would make a significant loss for MakerDAO. The 100% SB goal makes, by construction, centralized assets unable to create any DAI. They become therefore irrelevant in regard to DAI. $-denominated decentralized assets (ETH-backed loans) in DeFi are what? $2-3B? Maybe a few more if we count CeFi conversion to DeFi? If that’s the size of our market, what would be the impact on the economic value of MKR? On the other hand, eurodollars is a >$13,000B market, stablecoins are >$100B market. It feels to me that this passage makes quite a strong statement for implications aren’t easy to understand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.016456582633053
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#18",
                    "likes": "0",
                    "time": "20/10/2022-14:34:55",
                    "content": "    flipflopflapdelegate:  I believe Goldman Sachs trading desk for Commodities did revenue of $2 billion++ in 2021–are you sure TradFi does not have an appetite for “reckless and misaligned” risk?  Can we honestly say TradFi credit flow desks don’t have an appetite for risk when they’re flipping ABS, credit default swaps, interest rate swaps, and equity derivatives?    Sorry, wut? I was a VP in Goldman’s Fixed Income Derivatives Legal group in my youth and worked for J. Aron on a diverse range of commodities, FX, credit derivatives, and energy trading activity and deals, both financial and physical. Before that I was a drafter of the very first industry standard documentation for credit derivatives at the inception of that market in the late 1990s - it was a long-form confirmation published by ISDA for whom I worked as outside counsel at Cravath, Swaine & Moore. Not to flex, but this kind of cavalier attitude toward the activity and responsibilities MakerDAO is assuming really needs some push back. Take this entire a16z post to heart and you will have had a dose of wisdom sprinkled in with your morning coffee. Take @Eumenes seriously and humbly acknowledge there may not be the expertise here to do what Goldman Sachs does, which I can assure you from informed personal experience is neither reckless or misaligned. ~ Kianga ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.331018518518519
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#19",
                    "likes": "2",
                    "time": "20/10/2022-18:05:53",
                    "content": "I think we are all in agreement about the very high level best practice for RWA assets learned through the lessons over the years.  Keep a large amount of collateral in fully liquid stablecoins Keep most of the assets in low duration and very safe assets such as short term government bonds, 3) A smaller amount of collateral can also be put in illiquid, high yield and high impact assets (flagship collateral) as long as there is adequate junior capital and proper review by legal and credit experts or consultants, to ensure alignment of interest and proper risk management.  There seems to be the misconception that Protectors would replace these best practices and just do whatever they want, but the opposite is true, the Protectors would be a way to simplify the implementation of these rules for Maker Core, allowing Maker to just spell out the big picture framework and then retroactively modify debt ceilings to the Protector based on the results shown on the ground without having to get in the weeds and micromanage. Abuse of the capital provided to the Protectors can also be directly vetoed by MKR holders at the Maker Core level. The junior capital of the the Protectors would act as an additional buffer, on top of the junior capital that’s already required for Flagship RWA, and that arrangers are already required to bring to the table. While the junior capital at the arranger level is about aligning the interest of the arranger and securing all the real world legal structures, the junior capital at the protector level is about aligning the interest of the MetaDAO governance participants and the deal teams that get rewarded in MetaDAO tokens and thus have direct exposure to the quality of their advice (something that isn’t true in the way RWA is done today) Longer term, the Protector junior capital can also help protect against the risk of physical threats to RWA collateral, since Protectors can only use fully decentralized assets such as staked ETH or Elixir as junior capital. This will of course only happen after years of successful income generation helps build up the reserves of the Protectors. The Phoenix Staking mechanism, similar to the old junior capital module proposed at the beginning of this year but based on ETH, will be a mechanism to attract ETH depositors to take first loss exposure alongside the MetaDAOs own junior capital, will also help decrease the potential worst case scenario losses from a physical attack. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.90468671679198
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xbocaJ",
                    "index": "#20",
                    "likes": "1",
                    "time": "20/10/2022-18:34:22",
                    "content": "@rune , maybe I haven’t been tracking the End Game plan well enough. When you talk about the “junior capital of Protectors,” are the proposed Protector metaDAOs actually bringing their own capital to the table as part of the proposal? So if I want to propose a Hypergenesis Protector metaDAO with a $100million D3M as one of the launch metaDAOs, the proposed group is expected to put up $5 million (or some other factor) of its own assets as junior capital? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.410714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#21",
                    "likes": "3",
                    "time": "20/10/2022-21:06:24",
                    "content": "So all MetaDAOs in the long run start with some incubation elixir provided by Maker, likely in the range of 5000 MKR worth each, with more if the frequency is lower than one incubation per year. The launch MetaDAOs, however, don’t receive. The launch Creators start with basically no junior capital at all, just enough dai in their surplus buffers (donated from the Maker surplus buffer) to boostrap and provide job security for their teams. Right now the plan is that the Protectors will be an exception, and will receive a one time donation of 5 million Dai each from the Maker surplus buffer + the other necessary assets for funding their teams and providing job security. This would then give some starting junior capital, though at the same time it wouldn’t change anything from the perspective of Maker since the junior capital is just being shuffled around (the main upside is that there is more clear skin in the game /aligned incentives when it comes to avoiding small disasters or turning large disasters into small disasters) In addition to this starting capital, the MetaDAOs will obviously increase their junior capital through their various income streams, but they will also have specific tokenomics both temporary and permanent that increase their capital base. The first is the treasury bootstrap mechanism It is 200 million MetaDAO tokens for each MetaDAO that are algorithmically sold for Dai over the first two years. This mechanism is mainly in place to fund workforce expenses and provide job security for the launch team of a new MetaDAO as they learn the ropes and have a chance to get to profitability. It’s described here in the endgame plan complete overview: MetaDAO treasury funding account The second is the anti-reflexivity mechanic This is a system where a MetaDAO starts to issue and sell new tokens if it’s valuation is increasing. Up to 2 billion tokens are sold based on a near linear function starting at a valuation of around 20 million and continuing until a valuation of around 450 million is reached. It both acts as a brake on irrational market behaviour or pump and dump attempts, and it also captures market price increases of the MetaDAO tokens and converts it into junior capital. This mechanism strictly provides junior capital for the MetaDAO since it accumulates elixir directly, it doesn’t provide cash to the surplus buffer that can be used for workforce expenses. Link to description in the Endgame Overview: Anti Reflexivity Mechanic The final mechanism is the Drizzle Engine Unlike the two temporary mechanisms above, the Drizzle Engine is permanent. Very simply it can be seen as a milder, permanent version of the anti reflexivity mechanic that aims to smoothen irrational price behaviour and capture price increases into Elixir accumulation. It works based on the MetaDAO emitting up to 3% of its total token supply each year into the Drizzle Engine (unless the Drizzle Engine already contains more than 10% of the total token supply). The MetaDAO tokens contained in the Drizzle Engine are then sold and converted to Elixir if the MetaDAO token price rises above a predefined valuation model that could for instance be based on targeting a particular P/E or P/S ratio (this will be determined by Maker Governance through the Ecosystem Scope) There isn’t a great complete write up if it yet but it is shown in this Endgame Metanomics diagram alongside the MetaDAO NFT staking engine which it also interacts with. The MetaDAO internal Metanomics These mechanics, and particularly the parameters and numbers are of course still subject to discussion and change, since we need to make sure we carefully tune it for a successful and stable launch of the MetaDAOs. ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-plan-v3-complete-overview/17427/2#anti-reflexivity-mechanic-at-metadao-genesis-27",
                        "https://forum.makerdao.com/t/endgame-metanomics-diagrams/17870#the-metadao-internal-metanomics-15"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.432054924242424
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#22",
                    "likes": "0",
                    "time": "21/10/2022-06:41:29",
                    "content": "It may be helpful to think about junior or risk capital in two “layers”/“dimensions” for Protector MetaDAO’s: a) Economic Loss Risk Capital This is the layer of junior capital that is standard in TradFi if you follow market standard “rules of the game” for being a senior/low-risk type investor. I.e. if you buy AAA structured credit positions they would have 15%+ of junior capital from other parties attached to them on the ultimate end-loans etc. So when a Proctector MetaDAO work with an Arrange, this type of junior/risk capital is required. Such that through external junior/risk capital the Protector MetaDAO should be well protected against economic loss. Adding a layer to this from the MetaDAO Surplus Buffer may make sense in the long-run as credit situations or asset gets more complex, but generally the vast majority junior/risk capital for economic loss should come from structures with external risk/junior capital. At least at the inception very limited economic loss capital should be considered to arrive from Surplus Buffer and the portfolios of the Protector MetaDAO constructed accordingly. b) Emergency Liquidation Loss Risk Capital Then we have the “bank run” situation. Basically the MetaDAO have to liquidate assets/credit positions immediately. Depending upon how the MetaDAO portfolio is setup there could be emergency liquidation losses (from market stress, market value variability, asset being semi-illiquid etc etc). This is where the MetaDAO Surplus Buffers principal role kicks in - it has to cover these liquidation losses. I am probably less worried about the economic loss risk capital: it is a reasonably well-known construct and concern - and there exists many people and institutions with many years of experience managing this appropriately that Protector MetaDAO can access and work with. It is the Emergency Liquidation Loss capital that deserves attention. But - I think you will see that the Protector MetaDAO clusters are well-aware of this and are deliberately developing portfolios to match the state of the Protector MetaDAO’s Surplus Buffer - and with path for rebalancing portfolios as the Surplus Buffers strengthens. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.492494824016562
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#23",
                    "likes": "1",
                    "time": "21/10/2022-15:04:29",
                    "content": "Given the limited funds in the surplus buffer and the funding required for Protectors of 5M DAI each. How will Maker prioritize Protectors applications? It shouldnt be first come first serve.     rune:  Right now the plan is that the Protectors will be an exception, and will receive a one time donation of 5 million Dai each from the Maker surplus buffer + the other necessary assets for funding their teams and providing job security   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.491071428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#24",
                    "likes": "2",
                    "time": "21/10/2022-15:22:41",
                    "content": "A KEY question for Maker regarding the RWA metaDAOs:  what junior capital will be provided by the RWA metaDAO to protect Maker from losses.  Specifically  1.  How big will the junior capital be, how will it be sized versus specific deal and overall portfolio risk?  2.  What is the source of this junior capital?  (if its from Maker, it is not junior capital)  a credible RWA metaDAO proposal (and structure) would thoughtfully address this KEY issue and several others.  Without this information a RWA metaDAO proposal is more a wish list than a serious proposal ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.483333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#25",
                    "likes": "0",
                    "time": "21/10/2022-15:37:36",
                    "content": "Applications? what? There are 2 launch protectors. There are no applications… The governance tokens of these will be permissionlessly farmed and holders of those will vote for who runs those. Clusters are already forming to vie for those votes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#26",
                    "likes": "0",
                    "time": "20/01/2023-21:38:07",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}