{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - SolarX (Uprets/SolarX REIT) - March 15, 2021",
            "index": "6718",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "11,300",
            "highest_fraction": 0.79
        },
        {
            "title": "Add RWA007 (SolarX) as a new RWA Vault Type - August 30, 2021",
            "index": "6718",
            "option": "Yes",
            "supporting_mkr": "60,581",
            "highest_fraction": 0.98
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/solarx-mip6-application-uprets-solarx-industrial-real-estate-backed-loans/6718",
            "title": "[SolarX] MIP6 Application: Uprets/SolarX: Industrial Real Estate-Backed Loans ",
            "index": 6718,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "mips",
                "real-world-finance",
                "solarx"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/UPRETS_Real_Estate",
                    "index": "#1",
                    "likes": "11",
                    "time": "25/02/2021-03:01:25",
                    "content": "This is a MIP6 Proposal for UPRETS to deposit newly originated industrial real estate-backed loans to MakerDAO. UPRETS originates, underwrites and sells the asset for DAI to MakerDAO via trust structure (described below). Tokenization of the underlying assets is not required in this case.  屏幕快照 2021-02-25 上午10.28.54898×321 518 KB   1. Who is the interested party for this collateral application?  Loan Originator: UPRETS Borrower: SolarX REIT Lender: MakerDao Trust: [US Bank or another trust company to be approved by MakerDao governance] Escrow/Closing Agent: [US Bank or another company to be approved by MakerDao governance] Loan Servicer: [Berkadia or another trust company to be approved by MakerDao governance] The main contacts for this application are David Dai ([email protected]), Ran Wei ([email protected]), Wesley Ma ([email protected]) and Nil Larom ([email protected])  2. Provide a brief high-level overview of the project.  UPRETS will originate, underwrite and deposit 1st lien mortgage loans backed by land and solar farm facilities located on Long Island, New York, which are developed and owned by the borrower, to a trust which MakerDao will be assigned as Trustee. The underlying mortgage loan assets will be used as vault collateral to add diversification to DAI collateral pool and support value of DAI/USD. MakerDao will mint DAI with equal face value of the mortgage loan and deposit newly minted DAI into the escrow account. UPRETS will deliver the loan note and related loan documents into the escrow. At the settlement date, UPRETS will close the loan with SolarX. Simultaneously, MakerDao will instruct the escrow to purchase the loan note with DAI deposited at escrow and escrow will deliver loan note to the trust and later on the purchased RWA will be deposited into MakerDao collateral pool. A specialized and reputable 3rd party commercial real estate servicer will be engaged to service the loan on behalf of MakerDao. UPRETS seeks to enter into a Purchase Agreement with Maker to deliver a series of RWAs that meet Maker’s credit standard and is approved by Maker Risk Assessment team to Maker over the term of such agreement. The total purchase amount is anticipated to be up to 100M DAI. These assets have the following characteristics: ●\tCollateral: Senior acquisition/construction loans ●\tUnderlying Assets: US-Based solar farm plants ●\tAverage Loan Size: $ 10,000,000 ●\tAverage Underlying Property Value: $18,000,000 ●\tMaturity: 2-5 Years ●\tInterest rate charged to Borrowers: 4.50%-7.00% per annum ●\tLien position: 1st lien  Legal Setup  It is anticipated that a Trust (tentatively, US Bank, or another trust company to be approved by MakerDao governance) will be established and Maker will be pointed as Trustee. This Trust will be acting on behalf of Maker in this transaction and entering into the Purchase Agreement with UPRETS. An Escrow/Settlement Agent (tentatively, US Bank, or another bank subject to approval by MakerDAO) will be engaged and facilitate the closing procedures, per the Escrow Agreement. The trust agreement will include provisions stating that:  Trust agreement cannot be changed without a vote from MakerDAO governance with notice of the vote delivered to the trustee. Trust agreement cannot cause a liquidation without getting direction from MakerDAO from etherscan.io or vote.MakerDAO.com.  Servicer will be handling all payment and reporting activities. Monthly principal and interest payments and any other payments described in the Servicing Agreement will be sent to the Trust. Trust will then pass through remaining cashflow after deducting trust fee and any other expenses if applicable to the Trustee. In any credit event, the Servicer will be handling all remedy efforts including foreclosure, liquidation and other credit remedies descripted in the Servicing Agreement, on behalf of the Trustee.  Compliance includes, but is not limited to:   Annual audited financial statements of SolarX REIT Quarterly Independently reviewed financial statements of SolarX REIT Operation Report Servicer Report Trust Report    3. Provide a brief history of the project  SolarX REIT is the developer and owner of the 10 solar farms proposed in this application. SolarX will acquire land, construct the facilities and lease the solar farm plants to a 3rd party specialized operator via a long-term triple-net lease. The lease will be secured by a 20-year Power Purchase Agreement with a fixed electricity price, through a collaboration with Long Island Power Authority (LIPA) and the Department of Energy. The 1st lien on such solar farm plants will be held by the lender (to be delivered to the Trust where MakerDao will be the trustee). SolarX has extensive commercial and industrial real estate investment and development experience and solar farm development expertise. The SolarX management team has performed thorough diligence process and ensured all identified and proposed properties are meeting preset investment criteria and within acceptable risk parameters. SolarX also contracted with 3rd party appraiser and construction consulting companies to determine the value and cost of development. UPRETS, as the originator and underwriter of the mortgage, will perform individual and full cashflow-based underwriting upon origination and the mortgage will only be funded upon credit approval.  graph12428×1284 409 KB   graph22322×1300 395 KB   graph32334×1200 142 KB   graph42218×1248 678 KB   About UPRETS  UPRETS is a DeFi CRE lender. Backed by a real estate conglomerate and publicly traded company - Xing Yuan Real Estate Development (NYSE: XIN), UPRETS is a wholly owned subsidiary and a platform focused on simplifying investment in real estate using Blockchain. UPRETS as lender will work with SolarX as borrower on their acquisition/construction financing needs. Upon closing, UPRETS, via escrow closing agent, will deliver the loan note, along with other loan documents, to the Trust where MakerDao will be the trustee, pursuant to the proposed mortgage purchase agreement between UPRETS and MakerDao. UPRETS has 3 major product lines: 1)Digital Securities Issuance; 2)CRE Lending; 3)Tech Infrastructure. 1) Digital Securities Issuance: UPRETS successfully issued the world’s first real estate digital securities listed for trading on the secondary market, called OST([OST] MIP6: Collateral Onboarding Application by UPRETS Real-Estate Backed Digital Security). In March 2020, it completed the primary market fundraising (RegS) of the Oosten project in New York, in 2020. In June, we completed the technical issuance of digital securities (OST, applicable to mainstream protocols such as Xbolt, ETH and BTC Omni) and traded them in the secondary market-Seychelles’s licensed securities exchange MERJ. At the same time, we will continue to serve Xinyuan International’s own real estate projects worth hundreds of millions of dollars, and externally cooperate on projects worth billions of dollars； 2) Commercial Real Estate Lending : UPRETS is a specialized DeFi asset-backed lender and focusing on commercial real estate market and high quality CRE assets in the United States. With a combined over 30 years of CRE experience, the UPRETS CRE Lending team has being the pioneer and providing innovative lending products to reputable borrowers since 2019. We work closely with the MakerDAO community, and became a member of the RWA (real world assets) working group. We are also working closely with more public chain ecosystems, such as Binance Smart Chain, Ontology, NEO, Polkadot,etc. We have developed our own DeFi platform FAN(http://fan.finance) .  屏幕快照 2021-02-25 上午10.40.28719×377 87.2 KB  3) Technical Infrastructure: Price capture of physical assets(FAN), Oracle(FAN) and Cross-chain solutions. We are also working with financial institutions such as UBS, Freddie Mac, Blackstone, AMTD and etc. and law firms such as OMM, Baker McKenzie, Dahui, etc., having had in-depth communication and explored a series of solutions including loan stratification and trust structure.  Introduction to SolarX REIT and Resolute  SolarX REIT is one of the first REITs to invest in land across the United States for state-of-the-art, low-impact solar farm development. The parent company of SolarX – Resolute.Fund, Inc. https://resolute.fund/ is a real estate investment management firm with a focus on renewable energy solar projects. Resolute combines extensive experience in real estate land development, finance and utility-scale solar development to pioneer the most innovative renewable energy solutions in the U.S. Resolute’s team consists of professionals with more than 25 years in real estate investment, development and construction management. Over the past six years, Resolute have developed more than 1000 acres of solar farms in the Northeastern United States, both in urban and rural environments. Our experience includes small and large-scale residential and multifamily as well as commercial installations and development. We have a deep longstanding network to source attractive properties for solar farm development and strong relationships with local utilities. We also hold a patent-pending investment strategy that accelerates the conversion to renewable energy through the acquisition and renovation of rental homes with the most advanced technologies on the market.  屏幕快照 2021-02-25 上午10.47.25930×452 73.6 KB   屏幕快照 2021-02-25 上午10.48.22953×464 85.5 KB   4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  Not applicable. No tokenization is needed for this transaction.  5. Link any available audits of the project. Both procedural and smart contract focused audits.  Not applicable. No tokenization is needed for this transaction.  6. Link to any active communities relating to your project.  RWA working group, UPRETS social medias, Asia MakerDAO community. Here is the video of our roadshow about SolarX project on Bilibili: https://www.bilibili.com/video/BV1hN41197o8 Reference: [MIP13c3-SP4 Declaration of Intent & Commercial Points - Off-Chain Asset Backed Lender to onboard Real World Assets as Collateral for a DAI loan Archive] [OST] MIP6: Collateral Onboarding Application by UPRETS Real-Estate Backed Digital Security [NS-DROP] MIP6 Application: New Silver DROP: Real Estate-Backed Loans [P1-DROP] MIP6 Application: Peoples Company DROP: US Agricultural Real Estate  7. How is the applying collateral type currently used?  The underlying assets are used as solar farms for wholesale electricity generation in Long Island, NY.  8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in?  The Trust will be purchasing and holding 1st liens on these mortgage loans, and the Trust will be in the 1st position to receive monthly payments from SolarX, via a 3rd party servicer. Each month, the servicer will collect monthly P&I payments, along with other payments such as prepayment premium or late fee if any, and remit the payments to the Trust. The monthly debt service payments are secured by lease and rent payments from the operator. SolarX will be obligated to pay debt service to the Trust before making any equity distribution. In any credit event, the Trust will have the right to foreclose the facilities and also be in the 1st position to receive remedies. The borrower will form a SPE in the state of Delaware binding to Delaware laws.  9. Where does exchange for the asset occur?  Collateral loan funding and loan purchase will occur simultaneously at the settlement date. Capital Flow  MKR Mints new DAI and deposits it with Escrow Escrow to purchase mortgage asset per instruction provided by Trust   Escrow to send DAI to UPRETS Simultaneously, UPRETS to send USD to SolarX to close the loan with SolarX and to deliver loan   note and loan documents to Escrow Escrow to deliver loan note and loan documents to Trust Trust to deposit the purchase asset to MKR vault(optional)   3rd party Servicer engaged by the Trust to handle all future payments including but not limited to:   Monthly P&I Prepayment if applicable Other fees if applicable  Time Horizon It is proposed that the transaction will be closed in June 2021.  10. (Determined by Legal Domain Team) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review.  Not applicable. No tokenization is needed for this transaction.  11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  Not applicable. No tokenization is needed for this transaction.  12. (Optional) List any possible oracle data sources for the proposed Collateral type.  Not applicable. No tokenization is needed for this transaction.  13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type.  If MakerDao decides to liquidate the collateral before loan maturity date, UPRETS and/or other placement agent can be engaged to sell the collateral to other investors such as Fortress, Apollo, Ares. Thanks to @mrabino1 @SebVentures @Philinje @Chao.Pan @williamr @_LS @Jason for the  suggestions and supports. ",
                    "links": [
                        "http://vote.MakerDAO.com",
                        "https://forum.makerdao.com/t/ost-mip6-collateral-onboarding-application-by-UPRETS-real-estate-backed-digital-security/4438",
                        "http://fan.finance",
                        "https://www.fan.finance/#/oracle/homeValues",
                        "https://www.fan.finance/#/oracle/oracle",
                        "https://resolute.fund/",
                        "https://www.bilibili.com/video/BV1hN41197o8",
                        "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914?page=2",
                        "https://forum.makerdao.com/t/ost-mip6-collateral-onboarding-application-by-uprets-real-estate-backed-digital-security/4438",
                        "https://forum.makerdao.com/t/ns-drop-mip6-application-new-silver-drop-real-estate-backed-loans/3477",
                        "https://forum.makerdao.com/t/p1-drop-mip6-application-peoples-company-drop-us-agricultural-real-estate/5518",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-130-thursday-february-25-17-00-utc/6651/5",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/19",
                        "https://forum.makerdao.com/t/maker-relay-ep-37-en-espanol/7168",
                        "https://forum.makerdao.com/t/maker-relay-ep-38/7249",
                        "https://forum.makerdao.com/t/real-world-assets-strategy-for-2021/7570",
                        "https://forum.makerdao.com/t/real-world-assets-report-2021-04/7850",
                        "https://forum.makerdao.com/t/rwa007-solarx-mip21-token-protocol-engineering-domain-team-assessment/10016",
                        "https://forum.makerdao.com/t/rwa-007-solarx-collateral-onboarding-oracle-assessment-mip10c3-sp40/10070",
                        "https://forum.makerdao.com/t/maker-relay-ep-60/10082",
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053",
                        "https://forum.makerdao.com/t/maker-relay-ep-36/7039",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-131-thursday-march-4-17-00-utc/6737/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-60-en-espanol/10375",
                        "https://forum.makerdao.com/t/ns-drop-and-sixs-implementation/6822/6",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/maker-relay-ep-61-en-espanol/10376",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-stable-us-treasury-securities-up-to-12-months-duration/12503",
                        "https://forum.makerdao.com/t/maker-relay-ep-37/7154",
                        "https://forum.makerdao.com/t/mip6-collateral-onboarding-application-stable-us-treasury-securities-between-2-and-10-years-duration/12505"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Board composition",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.378562644065891
                },
                {
                    "author_link": "https://forum.makerdao.com/u/WesleyMa",
                    "index": "#2",
                    "likes": "4",
                    "time": "26/02/2021-08:10:10",
                    "content": "Good project with nice vision and thorough description. I would vote yes for this collateral! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "2",
                    "time": "26/02/2021-11:59:55",
                    "content": "    UPRETS_Real_Estate:  The main contact for this application is David Dai   Super cool. Its also a lucky sign that you have a Team Member with the mane DAI  Just a few quick question from me–seems like you’re using the same Trust structure as 6S, is that right?  Can you please provide the approximate incurred revenue for Resolute in 2019, and 2020? Also, the link you provided for the Resolute website is broken/page not found. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.667989417989419
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daviddai",
                    "index": "#4",
                    "likes": "1",
                    "time": "26/02/2021-18:00:21",
                    "content": "Thank you for your reply! And sorry about the invalid link. Looks like “)” was erroneously included in the link. Our team will fix it ASAP. Please use this link: https://resolute.fund ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#5",
                    "likes": "8",
                    "time": "01/03/2021-00:32:08",
                    "content": "This seems an interesting opportunity, but there are a few areas that may justify clarification:   The REIT will only be the lessor of the land to the project developer. The REIT itself does not develop the solar project or otherwise benefit from the sale of electricity.   How does Solar X determine (a) the actual properties to be acquired, and (b) the project developer to develop the project?   What is the timing between acquisition of a property, selection of the project developer, and construction of the solar facility. This will impact the timing of the rent payments made to the REIT? What is the typical permitting and construction process in NY for solar farms?   What exactly is UPRETS doing? The first sentence under Transaction Structure states: “Uprets will source, originate, underwrite and deposit 1st lien mortgage loans backed by land and solar farm facilities located on Long Island, New York, which are developed and owned by the borrower to a trust to be created by Maker that acts on behalf of MakerDAO.” The phrase “mortgage loans backed by land and solar farm facilities” suggests existing facilities or facilities at least in development.   Why does UPRETS have a mortgage over the solar facilities? Did it provide financing to the developer for the design, engineering, procurement and installation of the solar farm?   What priority (if any) does the Trust have to revenues of the solar developer for the payment of lease payments? Presumably, the Trust has first priority as an operating expense and before the return of any equity?   Thank you for your consideration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.32070707070707
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daviddai",
                    "index": "#6",
                    "likes": "6",
                    "time": "01/03/2021-19:48:31",
                    "content": "Hi Christian, Thank you for your questions! Please see our response below.  The REIT will only be the lessor of the land to the project developer. The REIT itself does not develop the solar project or otherwise benefit from the sale of electricity.  SolarX REIT is the developer and owner of the 10 solar farms proposed in this application. SolarX will acquire lands, construct the facilities and lease the solar farm plants to a 3rd party specialized operator via a long-term triple-net lease. The lease will be secured by a 20-year Power Purchase Agreement with a fixed electricity price, through a collaboration with Long Island Power Authority (LIPA) and the Department of Energy. The 1st lien on such solar farm plants will be held by the lender (to be delivered to the Trust where MakerDao will be the trustee).  How does Solar X determine (a) the actual properties to be acquired, and (b) the project developer to develop the project?  Since SolarX has extensive commercial and industrial real estate investment and development experience and solar farm development expertise, the SolarX management team has performed through diligence process and ensured all identified and proposed properties are meeting preset investment criteria and within acceptable risk parameters. SolarX also contracted with 3rd party appraiser and construction consulting companies to determine the value and cost of development. Uprets, as the originator and underwriter of the mortgage, will perform individual and full cashflow-based underwriting upon origination and the mortgage will only be funded upon credit approval.  What is the timing between acquisition of a property, selection of the project developer, and construction of the solar facility. This will impact the timing of the rent payments made to the REIT? What is the typical permitting and construction process in NY for solar farms?  6-8 months from land acquisition to production start. During acquisition/construction period, a debt service reserve will be required by Uprets and will be fully funded at loan closing to ensure the borrower have sufficient fund to pay monthly P&I payments. Once the construction is completed, the facility will be rented to a 3rd party operator and start collecting rent. Suffolk County government has a streamlined and fast track permit application process. It is a simple application process and fast approval timeline as long as project meet the criteria. SolarX project meets every criteria in the checklist and expect to follow the same process as previous projects. Please see below application requirement from Long Island Power Authority of Suffolk County Government: https://www.suffolkcountyny.gov/portals/0/formsdocs/planning/Publications/SCPCLIPAEnergyr.pdf  What exactly is UPRETS doing? The first sentence under Transaction Structure states: “Uprets will source, originate, underwrite and deposit 1st lien mortgage loans backed by land and solar farm facilities located on Long Island, New York, which are developed and owned by the borrower to a trust to be created by Maker that acts on behalf of MakerDAO.” The phrase “mortgage loans backed by land and solar farm facilities” suggests existing facilities or facilities at least in development.  Uprets is a DeFi CRE lender. Uprets as lender will work with SolarX as borrower on their acquisition/construction financing need. Upon closing, Uprets, via escrow closing agent, will deliver loan note, along with other loan documents, to the Trust where MakerDao will be the trustee, pursuant to the proposed mortgage purchase agreement between Uprets and MakerDao. SolarX has identified all 10 facilities and has started developing the 1st facilities with their own equity. Upon closing of the proposed mortgage financing, SolarX will continue acquiring and developing remaining proposed facilities.  Why does UPRETS have a mortgage over the solar facilities? Did it provide financing to the developer for the design, engineering, procurement and installation of the solar farm?  As explained in question #4, Uprets is the originator and lender of SolarX’s Loan Island project. The mortgage will be secured with 1st lien over the solar facilities.  What priority (if any) does the Trust have to revenues of the solar developer for the payment of lease payments? Presumably, the Trust has first priority as an operating expense and before the return of any equity?  Since the Trust will be purchasing and holding 1st liens on these mortgage loans, the Trust will be in the 1st position to receive monthly payments from SolarX, via 3rd party servicer. Each month, the servicer will collect monthly P&I payments, along with other payments such as prepayment premium or late fee if any, and remit the payments to the Trust. The monthly debt service payments are secured by lease and rent payments from the operator. SolarX will be obligated to pay debt service to the Trust before making any equity distribution. In any credit event, the Trust will have the right to foreclose the facilities and also be in the 1st position to receive remedies. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.207938457938458
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#7",
                    "likes": "3",
                    "time": "03/03/2021-11:21:18",
                    "content": "Thank you for clarifying. The proposed structure is much clearer for me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "1",
                    "time": "08/03/2021-10:28:52",
                    "content": "I’m seeing a large amount of spam / brigading on this post. Not sure if someone organised this, or if it’s a random quirk of fate. Regardless, please stop. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.107142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KID",
                    "index": "#13",
                    "likes": "1",
                    "time": "08/03/2021-10:37:24",
                    "content": "Nice project, but trust mode under the chain like this still needs participation of the third party legal entity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daviddai",
                    "index": "#14",
                    "likes": "1",
                    "time": "08/03/2021-19:53:32",
                    "content": "Thanks for pointing this out. Looks like we have some new members interested in this project which is definitely a good thing and a positive feedback of our recent marketing effort. We hosted a virtual roadshow on Bilibili via livestream two weeks ago (please see below link for the replay) and had a lot of interest in the Bilibili/Dorahaks communities. We did mention that we welcome people come to take a look at this project and leave questions and/or comments under this forum. https://www.bilibili.com/video/BV1hN41197o8 As a community member, I appreciate the governance have this gatekeeping feature which keep the discussion in the community meaningful and trustworthy. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.836647727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daviddai",
                    "index": "#15",
                    "likes": "0",
                    "time": "08/03/2021-19:58:10",
                    "content": "Thanks for your interest in this project and we appreciate the comment. And yes, I fully agree with you. We are in discussion with trust companies regarding legal setup and wrapping up the final structure. We believe we find a solution of this issue. We will get back to the community with more detail. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "1",
                    "time": "09/03/2021-12:21:39",
                    "content": "    Daviddai:  Thanks for your interest in this project and we appreciate the comment.   Hey man–you got an answer for this question, or you’re going to skip it?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#17",
                    "likes": "5",
                    "time": "09/03/2021-21:41:32",
                    "content": "    flipflopflapdelegate:  Can you please provide the approximate incurred revenue for Resolute in 2019, and 2020?   UPRETS came to us on that one. The company is private and doesn’t feel like publishing those data. The analysis of their financials will be part of the risk assessment under an NDA with the RWF team should the community decide to move forward on this collateral. If the financials are bad, you probably won’t see a risk assessment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.1666666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Philinje",
                    "index": "#18",
                    "likes": "4",
                    "time": "10/03/2021-00:20:58",
                    "content": "From above:     Daviddai:  Please use this link: https://resolute.fund   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/kkfromearth",
                    "index": "#19",
                    "likes": "5",
                    "time": "10/03/2021-08:23:49",
                    "content": "Love this idea to enable carbon neutrality from crypto world! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/WesleyMa",
                    "index": "#20",
                    "likes": "2",
                    "time": "11/03/2021-01:00:43",
                    "content": "me too, love this. instead of multifamily and single family homes, solar facility is more stable in terms of return and valuation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5476190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rick",
                    "index": "#21",
                    "likes": "1",
                    "time": "19/03/2021-17:10:44",
                    "content": "Great idea!  This proposal provides an opportunity to link the Cryptos to real world assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rick",
                    "index": "#22",
                    "likes": "2",
                    "time": "19/03/2021-17:12:54",
                    "content": "Although there can be some hurdles/challenges from the legal/regulatory perspective, it is worth exploring.  I hope more legal experts will join and more creative ideas will come out of this process. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daviddai",
                    "index": "#23",
                    "likes": "3",
                    "time": "19/03/2021-17:30:06",
                    "content": "Thank you Rick! This is something new so we are expecting legal/regulatory and technical hurdles and have been working with legal counsels to address those challenges. So far the legal working group has made significant progress and we believe we will have a smooth execution and a scalable platform to link the cyprto and real world assets upon greenlighted by the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0071022727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rick",
                    "index": "#24",
                    "likes": "0",
                    "time": "20/03/2021-02:48:18",
                    "content": "Excellent.  Looking forward to further update/good news. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#25",
                    "likes": "2",
                    "time": "30/04/2021-19:44:25",
                    "content": "    Daviddai:  6-8 months from land acquisition to production start.   Does this mean any regulatory reviews (NEPA, Section 106, etc etc) are already underway? If so, are they presenting any unexpected delays in your timeline? Apologies if the RWF team has already been given the answers to these. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy.SolarX",
                    "index": "#26",
                    "likes": "0",
                    "time": "04/05/2021-17:09:05",
                    "content": "Thank you for your question. We have not yet acquired the land so these reviews are not yet in process. We will advise when we close on the land and subsequent steps. We do not foresee any unexpected delays regarding the land or the development. We select land where local approvals are in place or expected and solar development is look upon favorably. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#27",
                    "likes": "2",
                    "time": "04/05/2021-17:33:12",
                    "content": "How are you planning to convert the DAI to USD? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#28",
                    "likes": "0",
                    "time": "04/05/2021-22:28:46",
                    "content": "    Andy.SolarX:  We do not foresee any unexpected delays regarding the land or the development. We select land where local approvals are in place or expected and solar development is look upon favorably.   Well yes, but what happens if you find a protected environmental or cultural resource on a parcel where impact can’t be avoided? If human remains or an endangered species have to be relocated or impact mitigated, will that impact cash flows in a way that makes it hard to service the debt? Edited to add: Is this a federal undertaking, defined by use of federal funds, land, transmission lines, permits, etc? Usually permits are the one that is hard to avoid. If it’s not a federal undertaking, then a lot of my questions wouldn’t likely come into play, though I am unfamiliar with what state and local level environmental/cultural resource review is required. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.633333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy.SolarX",
                    "index": "#29",
                    "likes": "1",
                    "time": "05/05/2021-15:45:03",
                    "content": "This is a private undertaking. To your first question:  we cover these items in due diligence prior to land acquisition. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy.SolarX",
                    "index": "#30",
                    "likes": "2",
                    "time": "05/05/2021-15:46:45",
                    "content": "We are discussing this with UPRETS and the MakerDao team. One option is to convert DAI to USDC to USD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#31",
                    "likes": "1",
                    "time": "05/05/2021-15:50:43",
                    "content": "sure… but who has custody of the DAI or USDC? how does it get to the seller? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#32",
                    "likes": "1",
                    "time": "05/05/2021-15:53:43",
                    "content": "    Andy.SolarX:  This is a private undertaking   Thanks for the clarification. That’s not easy to do with a project of this scale. I’m sure it wasn’t easy to avoid needing some kind of federal permit or utilizing federal resources! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#33",
                    "likes": "0",
                    "time": "05/05/2021-15:58:32",
                    "content": "More than likely you’ll need to setup a Trust that will be acting on behalf of Maker. You could use a Broker (Coinbase, Gemini, etc., or even Avanti Bank & Trust) to swap DAI to USD, IMO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy.SolarX",
                    "index": "#34",
                    "likes": "1",
                    "time": "05/05/2021-21:06:14",
                    "content": "we are in discussions with UPRETS, Maker and our counsel about full structure for the transaction as we speak. We will share complete details as soon as we can. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy.SolarX",
                    "index": "#35",
                    "likes": "1",
                    "time": "05/05/2021-21:07:48",
                    "content": "Thanks for the suggestion. We have 3 possible structures under consideration at the moment, including a Trust. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#36",
                    "likes": "1",
                    "time": "07/06/2021-15:16:12",
                    "content": "An update here. We have been working significantly with @Daviddai , @UPRETS_Real_Estate @Andy.SolarX, and others to find the best legal structure for this project (and likely for a lot of MakerDAO RWA collaterals going forward). So far we are settling on a Cayman STAR Trust and a Delaware LLC (thanks @christiancdpetersen for the work on this), but this will have to be worked on by law firms (something we should be able to achieve in June). As known since the beginning, the first closing date is expected for the end of June/July (the financing itself will take more time but they need a guarantee to start the process). Per the community comments on the RWA Strateg, the RWF CU is ready to push this project forward to do whatever it takes to achieve this goal and close the deal (assuming everything is fine to our standards and timely on the other side). It’s an ESG project, but the first project will cost $25M of which $20M is expected from MakerDAO (Loan to cost 75%, SF around 5.5%). This is no small amount for a single loan. It remains quite small compared to MakerDAO balance sheet (<0.5%) but this can be one point where people can be uncomfortable. The project will have a 20-year purchase agreement with PSEG ($50B in total assets), Baa1/BBB credit rating, and publicly listed (the MakerDAO credit facility itself would be for 5-7 years). I would say that we are faced mainly with construction risks (and some technological risks). So I wanted to do sentiment polling. This is obviously not the governance poll (for which we need a proper risk assessment). The outcome is informative only but will let us decide whether we should focus on that and deliver or be respectful of our partners and let them know that we pass and that they should work on another financing plan.    Should we finance the SolarX project?  yes no abstain     0 voters     Feel free to comment as well. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Public_Service_Enterprise_Group",
                        "https://forum.makerdao.com/t/mipxx-rwa-foundations/9680/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.747574955908289
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#37",
                    "likes": "1",
                    "time": "07/06/2021-15:21:28",
                    "content": "If you want to make an omelette, you have to break some eggs. I think that the lessons learned will be worth the upside/downside of the investment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#38",
                    "likes": "2",
                    "time": "07/06/2021-15:38:36",
                    "content": "    SebVentures:  $25M of which $20M is expected from MakerDAO   Isn’t this an 80% LTC? Regarding whether we should do this, my opinion is “of course we should!” … BUT the structure needs to be very good for exposure of this size. I am willing to compromise on a lot of things, but proper structuring and recourse is not one of them. That being said, it looks like there’s a lot of work being done to structure this appropriately, so I’m looking forward to seeing this progress. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#39",
                    "likes": "0",
                    "time": "07/06/2021-15:46:00",
                    "content": "It’s a good rate for Baa1/BBB — lower than historical, but good for the current rate environment. My one question is what the plan is if there are unforeseen delays. I don’t know how likely that is — maybe these don’t take much to set up from a construction standpoint — but they expect to be cash flow positive in 6 months. Just curious what their plan is if that takes longer. In general, this is the kind of deal we should want to be doing, as long as the technical aspects are correct ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.969696969696969
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#40",
                    "likes": "3",
                    "time": "07/06/2021-15:55:56",
                    "content": "We are currently assessing the risk profile associated with the construction of a solar farm, including the time required for permitting solar farms in NY and any typical construction risks (equipment delays, weather delays, and the like). We envision that we will provide a response to the community on these types of issues. Similarly, we will assess the typical operational risks associated with power production from a PV solar farm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#41",
                    "likes": "0",
                    "time": "07/06/2021-16:01:28",
                    "content": "By the way, have you considered placing a Delaware Trust above the Delaware LLC? I think this adds a lot of comfort especially for a facility of this size. Also, will this be structured as a loan with a senior lien? Or is it an investment in a security, like in the Centrifuge model? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#42",
                    "likes": "0",
                    "time": "07/06/2021-16:08:18",
                    "content": "Yes, we have considered the Delaware trust as part of the overall going forward model for RWA. Happy to discuss the Delaware trust vs Delaware LLC details with you offline. You can DM me and we can schedule a time. And, yes, the loan will be secured by the project assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mr.dorf",
                    "index": "#43",
                    "likes": "0",
                    "time": "07/06/2021-17:19:14",
                    "content": "Another strong use case for Dai. Invaluable opportunity to add another pro/con experience against the centrifuge/securitization model. Looking forward to the risk assessment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/roollie",
                    "index": "#44",
                    "likes": "3",
                    "time": "07/06/2021-17:24:46",
                    "content": "I would love to be included in the discussion between Delaware Trust and Delaware LLC! A couple of comments:  Agreed on this being a good rate for Baa1/BBB: let’s say yield spread over UST10 is 175 bps for BBB. UST10 is 1.6% now…so a comparable Baa1/BBB rate should be 3.35%. Obviously that’s using PSEG’s credit rating A quick google search turned this up: https://www.utilitydive.com/news/with-solar-sale-pseg-doubles-down-on-offshore-wind-and-nuclear/600181/ Does this mean PSEG is not interested in doing Solar itself, and is instead working with others in the space instead (presumably good), or just generally not interested in Solar (presumably bad)?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.608796296296297
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#45",
                    "likes": "0",
                    "time": "07/06/2021-18:32:49",
                    "content": "    roollie:  UST10 is 1.6% now…so a comparable Baa1/BBB rate should be 3.35%   That seems more the rate for seasoned debt. What we’re being offered is a good, solid rate, but not that drastic of a spread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#46",
                    "likes": "0",
                    "time": "08/06/2021-02:17:42",
                    "content": "I cannot speak to Roolie’s comment in respect of PSEG’s interest in solar with any specific insight. However, NY is pushing aggressively into renewable energy, including solar. https://www.nyserda.ny.gov/all-programs/programs/ny-sun If I was to guess, I assume that PSEG concluded that other persons could develop and operate solar farms (which are not technically challenging vs offshore wind) and PSEG Long Island will simply buy the power. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/YinghaoJia",
                    "index": "#47",
                    "likes": "0",
                    "time": "08/06/2021-02:40:57",
                    "content": "Strongly support! It will open another door for MKR and Defi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KCH",
                    "index": "#48",
                    "likes": "0",
                    "time": "08/06/2021-10:28:14",
                    "content": "Strongly support! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.708333333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/deepinsand",
                    "index": "#49",
                    "likes": "0",
                    "time": "04/08/2021-11:13:04",
                    "content": "Re: PSEG not interested in doing solar itself: NY is a deregulated electricity market, which means that all power plants compete equally, whether owned by PSEG or a third-party.  From https://callmepower.com/ny/market-liberalization:  To combat Vertical Monopolies, where utilities hold unfair advantage by controlling both the transmission and the generation of energy, COC required local utilities to deliver proposals on how they would cede some of their market power. For a lot of utility companies, this included divesting from energy generation facilities.  Currently LIPA doesn’t own any generation: Long Island Power Authority - Wikipedia Adding my own observations: Solar PV Plants are a much more fragmented industry than traditional power plants, which required massive investments.  Large utilities don’t want to deal with hundreds of permitting processes and construction projects.  By signing a PPA with a third-party, they can avoid the messy parts of the process. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Long_Island_Power_Authority#Facilities"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.399725274725275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy.SolarX",
                    "index": "#50",
                    "likes": "5",
                    "time": "07/04/2022-15:52:28",
                    "content": "Hello, all, We have decided to withdraw our current application to MakerDao due to an update in our strategic growth plan. As part of our continued strategy to build a renewable energy and blockchain driven infrastructure platform, we have entered into a joint venture with a U.S.-based bitcoin mining company to develop an initial 100 Megawatts of zero-carbon bitcoin mining capacity. The partnership will draw upon the strengths of both companies as we collaborate to bridge the potential of clean energy and digital infrastructure assets. We will be sure to keep you updated and hope to reengage with MakerDao in the near future. Andy ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.467592592592593
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#51",
                    "likes": "0",
                    "time": "08/04/2022-07:56:56",
                    "content": "CC: @collateral-core-unit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "3314"
}