{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/arrest-of-suspected-developer-of-tornado-cash-in-amsterdam/17214",
            "title": "Arrest of suspected developer of Tornado Cash in Amsterdam ",
            "index": 17214,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "legal",
                "regulation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "4",
                    "time": "12/08/2022-12:20:16",
                    "content": "This is a major development and if anyone wishes to flag this as “off topic” please identify yourself. If people do not wish to see what is going on in this space and how things are heating up that is OK. But please do not punish others who wish to learn and protect themselves. The Netherlands FIOD arrested a 29-year-old man in Amsterdam “suspected of involvement in concealing criminal financial flows and facilitating money laundering through the mixing of cryptocurrencies through the decentralised Ethereum mixing service Tornado Cash.” Further, they said more arrests might be coming.   FIOD – 12 Aug 22    Arrest of suspected developer of Tornado Cash On Wednesday 10 August, the FIOD arrested a 29-year-old man in Amsterdam. He is suspected of involvement in concealing criminal financial flows and facilitating money laundering through the mixing of cryptocurrencies through the decentralised...      ",
                    "links": [
                        "https://www.fiod.nl/arrest-of-suspected-developer-of-tornado-cash/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.118055555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/08/2022-15:14:34",
                    "content": "Hey Matt, Wanted to give some public clarity why this flag was accepted. We’ve talked before about how reposting of articles is best suited for the Discord instead of the forum. If you want to site an article in a forum post that’s awesome! But people have twitter and news feeds and all sorts of other things for getting links to news articles. If you wanted to make this a successful forum post I would suggest adding some “meat.” What could this mean for Maker devs? For any one working on the community? Are there legal protections for us in place, or are we just as vulnerable to this type of action? Writing a post like that takes effort and spurs discussion, reposting and quoting from a news article takes a few seconds and is likely to garner little attention as it’s not bringing anything to discuss to the table.  Happy for the community to decide if this is the type of content they want in their forum feed. Based on my comments if it’s flagged again in its current state I will accept the flag. Adding more detail or moving this information over to the Discord would be my recommended course of action. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9765625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#3",
                    "likes": "0",
                    "time": "12/08/2022-15:31:48",
                    "content": "Not sure this is really relevant to MakerDAO operations ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/08/2022-15:34:52",
                    "content": "So the position is some stuff is OK to post on the transparent Maker forum but others stuff is more appropriate for discord. Glad that is clear. The purpose of my post is to let people know what is going on with this highly relevant topic and if people think this issue does not impact Maker I have nothing else to say. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#5",
                    "likes": "1",
                    "time": "12/08/2022-15:36:23",
                    "content": "You don’t think the ongoing saga related to the Tornado issue is relevant. Noted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "0",
                    "time": "12/08/2022-15:44:41",
                    "content": "Kinda feel like we’re still not on the same page  Low effort posts that most people won’t engage with is pretty much the definition of spam. So you either have to up the effort or up the potential for engagement for it to be relevant on the forums. This is where all our official announcements and governance proposals go to be seen and discussed. Having spam cluttering the feed makes people less willing to wade through and find the valuable threads for engaging. This is why I say reposts of articles make a much better fit in Discord. You’re also much more likely to get some engagement there, so if you truly feel this is highly relevant but you shouldn’t have to explain why, it makes a lot of sense to post it in Discord instead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.211111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#7",
                    "likes": "3",
                    "time": "12/08/2022-15:49:43",
                    "content": "Well as you know I’m not going to be giving legal advice of any sort here but if a reader cannot infer how this developing situation impacts others that’s really it. And this is all good stuff about the forum and how it is supposed to be used. Glad to know in order to be kept in the know I need to use other third party apps to see what really goes on. I wasn’t aware that the forum was reserved as stated above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.069444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#8",
                    "likes": "0",
                    "time": "12/08/2022-17:42:41",
                    "content": "I always support all the content you make, but my dear @prose11 more than moving yo discord it would be great if you gave your point as you did before, and create questions for the community to answer, and start the feedback, for example, what impacts me , it is as always the crypto enthusiasts contradict the regulators and as the increase in the TVL in the Tornado Cash Dapp was seen in recent days, making USDC and DAI more exposed.  IMG_20220812_133709976×868 71.5 KB   IMG_20220812_133653991×887 81.6 KB  And after they grab a member of the group crucial as is the protramador come the witch hunt. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/10"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.799999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#9",
                    "likes": "0",
                    "time": "12/08/2022-17:50:23",
                    "content": "Thanks! The press release for itself and I cannot opine as to the legal issues involved. Talking about tokenomics is very important and I greatly appreciate it, but that was not the point of my post. To all of those people who do not use discord, twitter (and other third-party apps) at all or not regularly, and come to the official Maker forum for imminently developing issues they just need to wait it out I guess. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.370833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#10",
                    "likes": "2",
                    "time": "12/08/2022-19:17:09",
                    "content": "@MFeinberg I don’t know how to sway you since you seem to be pretty up in arms about this, but to give my personal experience : I already have trouble keeping up with this forum. I had already seen this news in many places. This post feels like spam to me. Of course the news is very significant but it lowers my experience to see duplicate content here. Anyone impacted by this should not rely on this forum only to get the pulse of the crypto world, which will broadly always impact Maker. Actually try to take this to its logical conclusion : if every news maybe impactful for Maker is reposted here in a feed-like fashion, people will start to need a new place that focuses only on governance discussions. And we’ll be back to square one. I’d rather keep the current equilibrium. If you create a newsletter I’ll happily subscribe to it  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.816558441558442
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#11",
                    "likes": "0",
                    "time": "12/08/2022-20:14:09",
                    "content": "This forum has tags and sections that allow posts to be categorized. If the official Maker forum is managed, controlled and reserved for select commentary that’s fine. I wasn’t aware of that. I don’t consider warning people spam but clearly I’m missing something so I’ll be sure to proceed accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#12",
                    "likes": "0",
                    "time": "14/08/2022-14:30:08",
                    "content": "   blog.makerdao.com    » Why the MakerDAO Forum Is the Heart of the Maker Community      Probably should update this to be specific and to clarify what is and is not forum worthy   ",
                    "links": [
                        "https://blog.makerdao.com/why-the-makerdao-forum-is-the-heart-of-the-maker-community/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                }
            ]
        }
    ]
}