{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-valuation-report/9710",
            "title": "MakerDAO valuation Report ",
            "index": 9710,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#1",
                    "likes": "16",
                    "time": "05/08/2021-15:25:49",
                    "content": "Hello Maker community Please take a look at the Messari report related to MKR Valuation. This is something that we have been working on since Growth CU birth, we firmly believe that creating this type of material helps us to reach a broader public and define a message around MKR Token. We plan to make communications around this report (and others to come) repetitively, and we hope the community aligns with this and use the same strategy. Let us know your thoughts please.  MG - Logo938×152 5.35 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/growth-cu-weekly-update-july-30-august-5/9706",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/47"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.55
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "5",
                    "time": "05/08/2021-15:58:17",
                    "content": "Very nice. Investor Relations is a budding topic. I actually just had a call with @Real-World-Finance’s Seb & Mark to discuss what it would look like at MakerDAO and how our teams could work together. Third-party reports are pretty cool  It will be nice once we are able to produce some great quarterly or annual reports of our own. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.211111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "3",
                    "time": "05/08/2021-17:00:53",
                    "content": "    Davidutro:  It will be nice once we are able to produce some great quarterly or annual reports of our own.   Happy to help you. Raw content is here. The Messari report is itself leveraging charts from the RWF CU. We also have a valuation model that uses the same tool (finding around the same value, which is great). Excited that @gov-comms-core-unit will put this content to the next level. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.929195804195805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NH98",
                    "index": "#4",
                    "likes": "3",
                    "time": "05/08/2021-18:02:40",
                    "content": "François-Xavier (the writer) is actually one of my great friends from University! If there is anything I could do I’d be glad to help. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FXLord",
                    "index": "#5",
                    "likes": "11",
                    "time": "05/08/2021-18:22:01",
                    "content": "Hello guys, hope that you appreciate the report. I had a great time making it and I am beyond impressed with the progress of Maker over the last years. Looking forward to your feedback. Cheers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "16",
                    "time": "05/08/2021-18:55:21",
                    "content": "DAO mandated actors making communications about the MKR token can be risky. If we position MKR as a passive investment where people can expect profit solely based on the efforts of others (eg. DAO mandated actors), this will fit the definition of a security in many jurisdictions. In turn this might make our debt recapitalization auctions illegal unless we register the the token and become a brokerdealer. Please seek legal advice before pursuing this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#7",
                    "likes": "1",
                    "time": "05/08/2021-21:19:10",
                    "content": "Monet is correct. Given Chairman Gensler’s recent comments on crypto and views on the wide berth of SEC jurisdiction here,  the Growth team should be quite careful regarding messaging around MKR. Better to focus on expanding the supply of and demand for Dai–if y’all do that well,  the MKR component will take care of itself. @MarianoDP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#8",
                    "likes": "1",
                    "time": "05/08/2021-21:37:31",
                    "content": "No one from growth said anything about investments opportunities or passive income, we collab on this report that was written by Messari. When we say “communications”, and “repetitively” we are talking about the MKR token as a whole, including the mechanism of it which is described in the report, and how it works in the protocol, something that not many people know. We did not create any messaging around MKR and what is posted here is a call to action to align the community under the same type of message, mostly related to Research Materials like this, not related to investments. We also think that our strategy related to DAI is deeply intertwined with MKR token and collaborating on these assets made by 3rd parties is a net positive thing for the protocol. @Tosh9.0 @monet-supply ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.011363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#9",
                    "likes": "1",
                    "time": "06/08/2021-02:38:34",
                    "content": "All those things are fine and good, Mariano, though it’s a thin line when we talk about research reports written for passive purchasers and “investor relations,” as David references above. My point is – and I believe Monet agrees – is that the language we (Core Units especially but also MakerDAO community members) use to discuss MKR and its role in governance should be precise and muted, especially when compared to others in our space. Exercising that prudence now may benefit us ten-fold vis-a-vis other projects later. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.550925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#10",
                    "likes": "4",
                    "time": "06/08/2021-12:35:39",
                    "content": "Yes @Tosh9.0 , I agree that we should be cautious with communications, but so far is nothing that hasn’t been said before by a 3rd party, even things like token-terminal control panels and indicators, or @SebVentures amazing dune dashboards. Anyway, I understand that the current situation around crypto in the US has everybody a bit worried, but we need to keep working at full speed for the entire world. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#11",
                    "likes": "7",
                    "time": "07/08/2021-00:51:20",
                    "content": "I finally got a chance to read the report.    Seems like a reasonable first go. Notably missing are the following key points I think people need to be aware of.  60% of DAI is minted by USDC 28.8% is minted by ETH-A 12% by everything else.  Average return is assumed to be 3% on all DAI in the models Looking at the ‘growth’ projections one has to make a conjecture not mentioned (or I missed this in my quick read of the report) that the projected DAI growth is supported by:  More USDC (which only pays the PSM spread).  At a minimum it has to grow comparatively. ETH.   At 28.8%.   If (1) doesn’t grow then we are left with ETH-A or ETH as the primary asset class that needs to grow in (a) Marketshare (unlikely based on my own projections) (b) in price - the more likely scenario.   But at 28.8% of all DAI minted even if (1) keeps up the rate needed to be paid here to sustain this 3% return on all DAI minted would have to be more like 10% - I don’t think this is a likely outcome.  Even if ETH 5x’s from here we are only going to see at most 2-4B DAI minted not 6B.  While possible not the best scenario for growth and collateral diversification. That the 12% of all remaining potential collateral grows dramatically.   This is what I think a lot of people are hoping for (RWA come onnnn DOWNnnn!).   But to see this even grow to 20% while the whole protocol grows from even 6 to 12B in the next 1 year seems unlikely given current pace of RWA growth.  My point is the same one I have made almost a year ago now.   Maker is basically a 1 collateral pony here, risk is lumped massively in ETH,  USDC since it only pays a PSM fee is not going to be a huge money maker.  Worse if for some reason there is a run on DAI, PSM USDC could be exhausted pretty rapidly shrinking the DAI supply massively and jeopardizing the PEG to the downside.  I consider this unlikely, but possible.   Which unless this other 12% of potential collateral picks up the slack is likely to cause a general contraction of outstanding DAI in this case. I think a major takeaway from this report is that Maker either needs to start taking more market share in ETH (and wBTC) or other large MC coins, or the more likely option to gear up hard and fast on being the dominant RWA player in the space.   Literally focus on growing this 12% to a well diversified RWA portfolio that dwarfs both ETH and USDC.    There is an additional potential bonus with a focus on RWA here in that it might be a good way to get a large chunk of USDC off the books as the RWA players will borrow DAI and likely want to swap it for USDC to USD for their borrowing mostly due to exchange liquidity issues.   Which would be helped by a large DAI-USDC LP facility btw.  Given the growth in USDC while this might be concerning to Circle (in terms of RWA players extinguishing USDC in exchange for USD causing a USD liquidity crunch there) should be tolerable especially if some communication is established between Maker and Circle so this can be cooperatively managed. To me what I point out above and this report does not focus on is the strong need for Maker to grow collateral beyond limited ETH, and wBTC primaries and work as hard as possible to mitigate or manage the risk associated with USDC.   I agree with a report conclusion while not optimal, USDC on the books to manage the PEG and grow the DAI supply is basically a necessary negative.   Maker could not have gotten where it is without doing this imo. I also agree with some other posts that Maker collateral backing and surplus being fully transparent is a key point that no other stablecoin issuer has.   In talks with regulators I think this needs to be highlighted. I am also a firm believer that regulators will feel much better if we targeted the DAI surplus to be more like 3-5% of all DAI as a formal backstop condition to runs on the system.   Right now we are not even at 1% and banks I believe have higher liquidity backstop requirements.  I also believe it would be prudent to really consider surplus diversification via RWA or some other stablecoins via the stablecoin players Maker will be partnering with.   I would urge someone contact Circle and try to strike up at least some discussion regarding USDC in the Maker protocol. I want to be clear here.    From my seat and data collection Maker needs to drive even more resources into getting together not 1 but 2 RWA teams that work independently, solicit the RWA players to become cross analysts for the protocol as a requirement for borrow facilities/engagement.  I want Matt Rabinowitz team with 6s and New Silver teams on board with cross checking all other RWAs and helping to analyze what we will bring on next and the two independant RWA teams as the additional RWA analytic, business support/liason backbones. If someone thinks that Optimism, Arbitrum, or some other crypto collateral is going to bring the next $6B I want to hear how that is going to happen and what the collateral structures are going to look like to do that.   If someone else thinks that RWA simply can’t or won’t be able to play I’d like to hear that as well. One thing that is a concern is that Maker and DAI under performs competitors and starts losing marketshare in terms of % all ETH deposited, and/or RWA growth in the space.   I am happy to see some forward looking approaches to communication with regulators and lawmakers is really important @PaperImperium etc.   I think it is going to be a fine edge playing with the powers that be to get large scale RWA collateral into the system to make them feel comfortable but not give up on some core tenets, decentralization, to fight off overreaching legislation or law that kills Maker business models. My own personal analysis suggests that Maker may be going the way of a larger bank that will likely end up only loaning to other larger 3rd party lendors and having to give up on being the Bank for the bankless simply because legislative restrictions coming won’t allow it.    There are going to be some hard choices to be made here soon and these may be ones that force Maker to give up on some core tenants just to survive.  A discussion of these potential choices for Maker likely to come in the future also notably omitted from the report which I see coming up rapidly (next 6-24 months possibly earlier).   So I would also urge that some preliminary discussions of what Maker future might look like in the face of legislation and how to adapt to that.   Do we need two Makers - one that is completely decentralized that deals with the little guys and one that is far more centralized that deals with RWA players, banks, large 3rd party players, doing KYC/AML etc. whatever. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.481375485147036
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "2",
                    "time": "07/08/2021-11:42:14",
                    "content": "    MakerMan:  would urge someone contact Circle and try to strike up at least some discussion regarding USDC in the Maker protocol.   Sir, this is already being tackled by the @Growth-Core-Unit — and they are also working tirelessly with institutional vaults to diversify/mitigate the USDC risk.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#13",
                    "likes": "1",
                    "time": "07/08/2021-11:50:01",
                    "content": "Thanks! News to me since I have not heard about anyone making contact with Circle up to this point (possible I missed some comment or something in a call).  I did see comments regarding discussions with PAX.   I would like to hear what Circle thinks about all the USDC in the Maker protocol.  As well as if there would be any issues if largish chunks (say 20-100M at a time) would be redeemed for USD in succession (for any of these).   I consider this unlikely but I would think stablecoin-USD liquidity should be a topic of discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#14",
                    "likes": "3",
                    "time": "07/08/2021-11:52:47",
                    "content": "    MakerMan:  As well as if there would be any issues if largish chunks (say 20-100M at a time) would be redeemed for USD in succession (for any of these)   I’ve spoken with them (about a completely unrelated topic from the PSM), and they assured me they can handle that amount, and also retain 0 fees of any size. So from a cost structure perspective, they are a really good option for going from on-chain to real world because there’s no slippage and almost no fees. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#15",
                    "likes": "1",
                    "time": "07/08/2021-11:59:44",
                    "content": "Thanks for the quick reply @PaperImperium …  0 fees of any size.   Interesting statement to make.   Sounds like they are ready to be the cross player between Maker and RWA with USDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2333333333333325
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#16",
                    "likes": "1",
                    "time": "07/08/2021-12:40:27",
                    "content": "That’s the standard deal I think. Some minor fee or two related to just doing wire transfers. But no % or anything. They do charge to use their APIs, so if you’re doing payments and not just manually moving money, I guess there’s some overhead. But yes, it’s an attractive cost structure to redeem USDC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#17",
                    "likes": "2",
                    "time": "07/08/2021-13:06:36",
                    "content": "@PaperImperium @MakerMan , if you have in mind a specific product or feature that is needed for MakerDAO regarding USDC please let me know, we can talk to them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#18",
                    "likes": "2",
                    "time": "07/08/2021-13:29:28",
                    "content": "@MarianoDP I was just trying to find the cheapest way to move large amounts from on-chain to off. Between USDC and the coming Paxos PSM, those are both significantly cheaper than other options I found (for anyone else looking into it). It was part of research on lowest cost structure for a trust to purchase bonds for Maker. That proposal is currently paused while I focus on delegation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.580357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#19",
                    "likes": "0",
                    "time": "05/11/2021-13:30:11",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}