{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/a-better-prioritization-system-for-makerdao/18949",
            "title": "A Better Prioritization System for MakerDAO ",
            "index": 18949,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "voting"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "21",
                    "time": "28/11/2022-14:49:42",
                    "content": " TL;DR  We’ve struggled with prioritizing work within MakerDAO in the past, both at a DAO and Core Unit level. Approval Voting is a good way to measure support for multiple options. However, Approval Voting does not capture priority well. There are many options to better determine priority. Some form of positional voting is probably best for our use cases. The combination of these methods allows us to measure the support for an option separately from the priority of an option. Measuring these separately will better inform working priorities, and highlight consensus and contention in the DAO in a more explicit manner. Approval-Priority Voting is a proposed implementation that would allow us to collect both an Approval signal and a Priority signal for a set of options using a single poll. We could use this in MakerDAO today to determine work priorities in certain areas. Specifically, in technical work and collateral onboarding. Theoretically, we could use this structure to determine longer-term objectives and strategies in a decentralized manner. DUX made a cool mockup of what this could look like. We believe this system could be used in an Endgame context in a few areas: To prioritize work on scopes, within DVCs, and within MetaDAOs. In order for this to be implemented and adopted, we need to see support from some combination of delegates, large MKR token holders, and MetaDAO clusters.   Motivation The flow of information from governance to Core Units (and any other agents it chooses to employ, now or in the future) is currently not very efficient. We do not use votes as part of the consensus-building process around priorities. While other factors are also present, this lack of structured information flow is partially to blame for the divergence of what governance wants to be worked on, versus what is being worked on. Allowing governance to speak with a single quantifiable voice via non-binding vote should help to address the paradigm where the loudest or most persistent voices overly influence Core Unit priorities. The existing voting algorithms that we use at Maker are designed for single-winner elections rather than multi-winner elections. The use of mechanisms like IRV for ranked output is workable, but it is not optimal as it disregards voters’ secondary preferences in many cases. Recently, MakerDAO has had multiple contentious topics to consider, and in some cases vote on. In this situation, it becomes even more important that the DAO has mechanisms that promote consensus over winner-takes-all. Without a focus on consensus-building mechanisms, I believe MakerDAO will likely become more polarized over time. It is unlikely that a new voting mechanism alone will change this, but it may provide a focus for discussion and contribute to improvement. Further, with the introduction of the Endgame plan and the creation of MetaDAOs, DVCs and scope councils/tribunals, there is an opportunity to allow these new structures to take advantage of more powerful governance tools from the start.  Approval Voting Approval Voting has recently been implemented by DUX for on-chain polls and it is starting to be used in appropriate governance situations. It is the mechanism that underlies the MakerDAO executive vote system and it is the mechanism that MakerDAO used to run the off-chain portion of signal polls on the discourse forum software. As a voting system, approval voting is often agreed to be fairly strong in single-winner elections. Further, and unlike some other voting systems, I believe its strengths generalize well to ranked elections. Importantly, it favors consensus-building and ‘least-worst’ option selection over a plurality-but-divisive outcome.  So why not just use Approval Voting? The biggest downside of Approval Voting in isolation is that it does not allow a single voter to express more nuanced preferences than a yes/no for each option. This makes it less suitable for ranking options in terms of priority, as it fails to collect potentially useful information from each voter. In an ideal world, we could measure both which options a voter wants, and how much they want each option relative to the others.  Positional Voting Our suggestion for solving this is a form of positional voting. Positional Voting is a system in which options receive points based on their rank position in a ballot. Positional voting systems capture non-primary preferences without imposing too much cost on the voter. This is in contrast to forms of scored voting, in which voters must distribute a fixed amount of points across a selection of options. The progression of points across ranks in a positional system is important and varies across implementations. Often point progressions are based on mathematical sequences which can be modeled on a curve. Sequences can result in either a very flat curve (ie, spreading voting power nearly equally across selected options), or a very steep curve (ie using most voting power on options ranked highly.) The choice of progression used will affect whether outcomes lean more towards consensus options (flat curve) or polarizing options (steep curves.) Given that Approval Voting highlights consensus options, the chosen curve for priority voting should not lean too much in favor of consensus outcomes. The progression we suggest is called the harmonic progression, shown (normalized) in the graph below.  image917×584 62.3 KB  This progression assigns a ‘score’ to each option based on its rank according to the formula:  This is shown in the table below:    Rank     Score       1     1       2     0.5       3     0.33333       4     0.25       5     0.2        To maintain a constant MKR weight, this is then normalized, such that the total weight for a voter ranking all options is equal to their MKR weight. Harmonic progression was chosen because it gives a more reasonable weight-decay when compared to a geometric progression, while still allowing for strong preferences in the first few positions. We suspect this more accurately reflects human behavior: people tend to have a few strong relative preferences for options they care about, and then less relative preference between less-favored items.  Approval-Priority Voting Approval-Priority Voting is a bespoke system that hopefully combines the strength of both Approval Voting and Positional Voting methods.  Separating two signals from a single input The key to this system is being able to collect both an approval signal and a positional signal from a single optional preference vote. An optional preference vote is one in which a voter ranks as many options as they wish, in any order they wish. If this sounds familiar, it should! It is the same input method we use currently for Instant Runoff Voting. The way we would count MKR weights under this system is as follows: **Approval: **Any option a voter ranks is one they approve, and their full MKR weight is applied to the approval signal for that option. **Priority: **Any option a voter ranks gives priority to that option relative to others according to the positional scoring system. A part of their MKR weight is applied to the priority signal for that option, depending on where they ranked it. Unranked options contribute no MKR weight to the priority score. In terms of how voters would interact with this poll, the instructions may look something like the following, depending on the context.  Rank each option that you would like to see actioned, in the order you would like it to be actioned. Rank each objective you would like to see adopted, in order of importance to you.   Why is this useful? Ambiguous Signals Are Bad Firstly, this allows voters to more explicitly communicate their preferences. Previously, there hasn’t been a systemic quantitative way for voters to communicate support for an option separately to supporting the swift implementation of an option. To illustrate this issue, imagine you are a voter, and an item comes up for a vote that you support, but do not want Core Units to spend time on in the near future. Traditionally, you have two choices:  Support the proposal Reject the proposal  If you support the proposal, core units and others in governance may assume that you want it implemented immediately. It may be implemented ahead of something else that you more urgently wanted. If you reject the proposal, core units and others in governance may assume that you don’t want it at all, and it may never come up for a vote again in the future. This lack of nuance contributes to disagreement and a mismatch of expectations within MakerDAO. Contention is Highlighted Secondly, this system will highlight governance contention very explicitly. The combination of separate signals gives everyone a better understanding of whether contention is present, and the nature of that contention when compared to binary polls. Specifically, the combination of a high priority score and a low approval score indicates that there may be deeply held disagreement between voters in relation to the voted option. Some assumptions that may be made when looking at approval-priority results are displayed in the diagram below.  image750×737 114 KB   Use Cases in MakerDAO This system could be useful in MakerDAO at varying levels of abstraction. At a high level, this system could be used to vote on values, objectives, and strategies for MakerDAO, something that has been raised at several points as a weakness of governance as it exists today. At a low level, this system could be used to direct Core Unit resources. Some examples:  Communicating an ordered list of desired technical tasks for Protocol Engineering from governance. Communicating an ordered list of collaterals for core units to onboard or evaluate. Communicating desired features for various front-ends funded by core units.  The DUX core unit has been kind enough to produce a (non-functional) mockup of a summary page that would summarize the current state of DAO goals and strategies. Such a page could help members of MakerDAO and the wider crypto ecosystem understand what the current goals of MakerDAO are, and how we are looking to achieve them.  image1085×884 119 KB  Source (Note, approval and priority values in the mockup above have been made-up purely for demonstrative purposes.) You can imagine a similar page for high-traffic core units like PE or CES which could be used by the facilitators of those core units as an input into their roadmaps.  Use Cases in Endgame Context With the Endgame plan being de-facto approved with the recent passing of the initial set of end-game changes, I include here some examples of how this system could be used in an Endgame context.  Scope Prioritization Scope Councils and Tribunals will manage scopes in MakerCore as part of the endgame plan. I believe most decisions regarding scopes are planned to be made internally by these councils and tribunals. However, the ability to gather non-binding priority information from MKR Holders on-chain may still be useful. A couple of possible uses are listed below:  Determining the order in which to implement Endgame Products. Breaking deadlocks in cases of disagreement among members.   Within DVCs With DVCs becoming more and more of a structure in their own right, internal governance systems may prove beneficial to resolve questions of contention. An approval-priority system would allow DVCs to do more quantifiable decision-making in a more nuanced manner than would be possible with simple binary voting.  Within MetaDAOs The examples above that refer to MakerDAO could also apply directly to MetaDAOs. MetaDAOs will benefit from determining their explicit values and objectives early on, and in a clear, easily communicable way. Further, at a lower level, MetaDAOs will initially have limited resources and will need to prioritize work items in order to achieve success. Such a voting system could give MetaDAO token holders an explicit and detailed say in those priorities, as opposed to being presented with a roadmap and being required to approve or reject it as a whole. Those who understand Endgame more deeply are encouraged to share other potential uses for such a voting system in the comments below.  Adoption in MakerDAO Due to the complexity of Endgame, and the work required to move it into a working state, this system is not currently planned to move to the implementation stage. If you would like to see this system implemented in some form, please communicate your support clearly and publicly. Specifically:   Cluster Members: If you feel this might be valuable to you if you are voted into a MetaDAO.  Recognized Delegates: If you can see a use-case for this system in MakerDAO prior to endgame implementation.  Endgame Folks: If this system can solve any open implementation problems in the areas of Scopes, DVCs, or MetaDAOs.  Core Units: If this system would be useful prior to the restructuring of MakerDAO into MetaDAOs.  ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Optional_preferential_voting",
                        "https://www.figma.com/file/aDKXFoNslidBCewHrTKnB2/Approval-Priority-Voting?node-id=0%3A1&t=eGGtfOOdg7eBPuEz-0",
                        "https://forum.makerdao.com/t/governance-and-risk-217-thursday-december-01-at-17-00-utc/18969/2",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/34",
                        "https://forum.makerdao.com/t/weekly-relay-recaps-of-current-events-at-makerdao/16382/28",
                        "https://forum.makerdao.com/t/governance-and-risk-218-thursday-december-08-at-17-00-utc/19062"
                    ],
                    "GPT-summary": "The author proposes a new voting system called Approval-Priority Voting that combines Approval Voting and Positional Voting to better determine priority and measure support for an option separately from its priority. The proposed system could be used to prioritize work on scopes, within DVCs, and within MetaDAOs. The author believes that this system could help promote consensus-building mechanisms and highlight governance contention more explicitly. The author also provides use cases for the proposed system in MakerDAO and Endgame context. The author invites support from delegates, large MKR token holders, and MetaDAO clusters to implement the proposed system.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.609387305255949
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "1",
                    "time": "28/11/2022-21:43:20",
                    "content": "The issues with prioritization are   Voting is public and done primarily by politicians(delegates), who may signal support for things they don’t care much about for political reasons.  And those public positions can change rapidly with the political winds.   Stakeholders can(and often do) DM a large MKR holder about issues and prioritize that instead. So your signal board will often be misleading and not particularly helpful for setting priorities.   Prioritization often doesn’t impact project speed at all. And voters will have little idea how much impact designating something as top priority even has.   In general, I don’t think such a system is helpful when so much is decided behind the scenes by a few key players. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.262780112044818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rtree",
                    "index": "#3",
                    "likes": "2",
                    "time": "04/12/2022-05:47:14",
                    "content": "To be well equilibrium productivity and governance, it is better to leave each CUs to decide what is prioritized and what is not, because prioritization is in between requirements from MKR holders and professional judge and we will face deadlock if prioritization is too strict. For example, engineering team counteracts system failure or large exploit event and I believe in such case we will not engineers to ask us to poll to prioritize. And I believe we naturally do not think this is not ideal for decision making structure. This indicates proceeding tasks with priorities is controlled and given under professionals. Or I think this kind of granular task control well suites optimistic prioritization. Each CU define schedule or next sprint for a period, disclose it’s work breakdown structure or kanban etc, it will be proceeded as proposed automatically when there is not sufficient against is voted. I think this is useful if CUs are facing periodic interventions behind scenes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.226190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#4",
                    "likes": "2",
                    "time": "04/12/2022-12:26:08",
                    "content": "    rtree:  For example, engineering team counteracts system failure or large exploit event and I believe in such case we will not engineers to ask us to poll to prioritize.   No one is suggesting this. We have expedited processes to deal with these kinds of events. Think of this as a way for an engineering CU to say “we have 5 projects we could be working on, but only have resources to complete 2 in the next 3 months, what would Governance like us to prioritize?” That way the CUs can suggest the tasks, and Governance can feedback how they would like them to spend their time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.9980158730158735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rtree",
                    "index": "#5",
                    "likes": "0",
                    "time": "04/12/2022-14:21:59",
                    "content": "    Patrick_J:  an engineering CU to say “we have 5 projects we could be working on, but only have resources to complete 2 in the next 3 months, what would Governance like us to prioritize?”   Thanks for the reply. I did not know we have proper expedit process. Now I have got your point. I am FOR on Approval-Priority Voting. Let’s try and see Priority decrease struggle on proceeding tasks and enable better work environment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smartcontracts",
                    "index": "#6",
                    "likes": "1",
                    "time": "04/12/2022-15:52:02",
                    "content": "I’ve been involved with MKR for over 4 years, and it’s changed more in the last few months than anytime in its history. Everytime MakerDAO engages with CeFi (Coinbase) or RWA (Monetalis), an entirely new dimension of monitoring, compliance, and risks arises - the basic voting model works when Maker can adapt to conditions on its own terms, but it appears that that ship has sailed. We need to consider voting to appoint teams to run individual projects and engagements unilaterally - second-guessing and killing projects after the fact are Ok, but micro-management will paralyze everything. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.575757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#7",
                    "likes": "2",
                    "time": "04/12/2022-21:05:34",
                    "content": "Really interesting proposal and much needed. Totally support it. I had been thinking in these lines in the early days at CES when struggling with CSI prioritization. Adding color/nuances/qual data to polls is for sure useful and very much needed. I see use cases where we would use such a new system: Use Case 1. For collateral onboarding specifically, the market situation and regulatory concerns impact the priorities. An example can be, Coinbase institutional rewards initial yield offering, subsequent GUSD proposal and new coinbase yield increase offering. These new data points all might impact the priorities on a proposal like the initial Coinbase institutional rewards. Sometimes these changes leave CUs wondering what the next step should be after a news has been made public. A new poll would be interesting to check on priorities. Use Case 2. For wider MakerDAO relevant topics checking the pulse on governance priorities is interesting: imagine checking several times a year on DSR levels, existencial exposures , regulatory concerns in regards to RWAs, diversification on RWAs (jurisdictional, asset type, etc) Use Case 1 is very case specific and I think your system fully delivers on it, where use case 2 is a generic set of dimensions that can be polled constantly through out years. Use case 2 would require identifying the dimensions that need to polled. These dimensions are very long-term concerns for the DAO and will evolve through time but remain relevant for many months or years . Some type of evolution to conviction voting / continuous polling on these would be good. It would help inform a north star on these wider/abstract dimensions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.000940438871474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "06/03/2023-03:05:50",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}