{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-grace-period-between-when-scd-shutdown-spell-is-scheduled-and-actual-shutdown/1992",
            "title": "Signal Request: Grace period between when SCD shutdown spell is scheduled and actual shutdown ",
            "index": 1992,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "scd-shutdown"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "1",
                    "time": "15/04/2020-20:56:49",
                    "content": "Prerequisite reading:  Sequential Process for SCD Shutdown Signal Thread: SCD Shutdown Poll: Should we initiate the shutdown of the SCD system through an executive vote on April 24th, 2020?  The vote to initiate shutdown of SCD on April 24th, 2020 concluded on Monday, April 6th with 61.54% voting in favor of the proposal. The purpose of this signal request is to gather sentiment on an appropriate grace period between the time the SCD shutdown spell is scheduled and the time the system is irreversibly shutdown (in Maker parlance, “caged.”) In referring to the Sequential Process for SCD Shutdown, Step A Executive Spell 1 was completed when the SAI debt ceiling was set to 0 in MCD via this spell. The options suggested below are the times between the successful scheduling of Step B Executive Spell 2 and the action of calling cage on the SCD system. As of calling cage, Step C begins and Sai owners can claim their collateral. Step D cannot begin until the post-cage cooldown period has ended. Such a grace period should take into account the greater timeline highlighted above, as well as the needs and timeframes of all stakeholders and integration partners. Should you feel a longer time is warranted, please select “Other” and provide your rationale in the thread. Options: 6 pm CET / 4pm UCT on:     Friday, May 1st Friday, May 8th Friday, May 15th Friday, May 22nd Other     0 voters     Thank you for your attention. Following feedback I have updated poll parameters and created a new poll below in the comments  ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-thread-scd-shutdown/1673/78",
                        "https://vote.makerdao.com/polling-proposal/qmb8d1use4uzsgpjf3tbmnqfnvq1bf1mcifzlabnp58cjw",
                        "https://vote.makerdao.com/polling-proposal/qmb8d1use4uzsgpjf3tbmnqfnvq1bf1mcifzlabnp58cjw",
                        "https://forum.makerdao.com/t/sequential-process-for-scd-shutdown/1823",
                        "https://etherscan.io/address/0x91e556E3Cb1E2842a0A3626a768B7E67199F7589#code",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-16-9am-pst-4-00-pm-utc/1996/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-23-9am-pst-4-00-pm-utc/2145/2"
                    ],
                    "GPT-summary": "The author of the post is requesting feedback on an appropriate grace period between the time the SCD shutdown spell is scheduled and the time the system is irreversibly shutdown. The post includes a poll with suggested options and invites readers to provide their rationale in the thread if they feel a longer time is warranted. The post also mentions that the author has updated poll parameters and created a new poll based on feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 5.789256198347108
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#2",
                    "likes": "6",
                    "time": "15/04/2020-21:19:55",
                    "content": "I had to be “that guy” and pick “Other”. I’d recommend a Tuesday morning for the cutover instead of a Friday. That gives external devs a Monday to do any final tests on their post-SCD solutions and then the rest of the week to resolve any issues with their integration. Plus I think Tuesday’s are fairly common “patch days” in enterprise for similar reasons. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/04/2020-21:40:23",
                    "content": "Good point Brian - thanks! I’m also keen to hear from partners and teams dealing with integrations if there are any favourable times. @lollike ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/marcandu",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/04/2020-12:25:53",
                    "content": "+1 on the suggestion of not picking a Friday, a day generally frowned upon for deployments or major changes. A Tuesday or Wednesday would be a better choice. The delay between the spell and the cage doesn’t have to be very long, 5-12 days is plenty, what partners/ecosystem partipants really need a determined date and time: that allow them to schedule a UI update, quickly run post-cage tests and make sure they have their eyes on the transition. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.129166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/04/2020-15:42:57",
                    "content": "Welcome @marcandu and thanks @brianmcmichael , good comments - Tuesday is more appropriate. With the ‘Other’ being so widely chosen I hope people won’t mind if I override the above with a new poll, including above options already selected as well as Tuesdays.  Options828×1192 191 KB      Tuesday, April 28th Friday, May 1st Tuesday, May 5th Friday, May 8th Tuesday, May 12th Friday, May 15th Tuesday, May 19th Friday, May 22nd Tuesday, May 26th Other     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/sequential-process-for-scd-shutdown/1823"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.305681818181819
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#6",
                    "likes": "0",
                    "time": "17/04/2020-18:31:29",
                    "content": "When were you thinking about closing this poll Derek? I didn’t see a date, but maybe Wednesday the 22nd would be good for wrapping this up? Its about a week from when you posted it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#7",
                    "likes": "1",
                    "time": "17/04/2020-20:34:18",
                    "content": "Thanks @mitote great suggestion, yes, let’s end this poll on Wednesday. This will let us discuss on the Thursday Governance call and take into account for the Executive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "0",
                    "time": "20/04/2020-16:15:53",
                    "content": "I know people will see this after they vote but wanted to put some color on my vote.    At this point given state of the system and that CDP 3088 woke up I am for a longer rather than short time frame here.  I also like idea of doing this on Tuesday as being a operations guy we had a rule on major system changes (not on Mondays or particularly Fridays).   So Tuesdays sound good and because I want this delay longer than shorter to give time to deal with issues on this I picked May 26 and Other (meaning longer).   Looks like a lot of people want this done in much shorter time frame. SCD is at 13.3M and falling and really would like to see the SCD DC go down to $14M.   I am honestly back on the fence about having to hammer this down so fast as it seems to be winding down naturally as the SF is increased and time goes on.  Literally 3-5% drop in SCD SAI outstanding a week.  In 4 weeks we could be at $12, another 4 weeks $10M with nothing left but CDP 3088.  Note here with CDP 3088 at 8+M of that 13.3 the 'other’s are closing at a rate of 10% week. Literally only person that gets hosed significantly here if something odd happens with SCD being open is CDP 3088 the rest totals 5.3M and falling. I think the threatening of the SCD closure has gotten people off their butts to close if they don’t want to be in the GS there though so maybe setting a date with a reasonable time frame (like a month) with an announcement is a good idea to light fires under peoples butts.    I would have loved to get CDP 3088 to close as we would have seen some MKR burn in that case (like 3-3.5K) but we do what we can and move on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.863715277777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#9",
                    "likes": "2",
                    "time": "22/04/2020-14:32:49",
                    "content": "Closing this poll today as it has been open for a week. The winning vote for actual SCD shutdown is Tuesday May the 12th assuming the community votes in this week’s Governance Spell for shutdown. Please view the Sequential Process for SCD shutdown to see how this fits with the overall process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "22/04/2020-16:11:36",
                    "content": "Will there be a governance poll to confirm this on-chain? Or do we deem that not to be necessary given the other on-chain polls around shutdown? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#11",
                    "likes": "1",
                    "time": "23/04/2020-11:26:45",
                    "content": "With tomorrow’s executive spell and the above signal thread I think there is agreement that the two week grace period is sufficient. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#12",
                    "likes": "3",
                    "time": "23/04/2020-14:02:20",
                    "content": "I am having mixed feelings about May 12th and I am sorry for addressing this a bit late. According to the poll shutdown is happening almost 3 weeks from now. Imagine a situation where migration contract gets drained in few days, because fees are effectively already forgiven with MKR oracle shut down (this is how I understood) and every rational CDP should migrate. In such case the only remaining SAI liquidity (primarily only in migration contract, other markets are very shallow) is wiped and CDPs can not deleverage in a ETH crash scenario and protect from liquidations. SAI liquidity can be though sourced from MM opening new CDPs in SCD, but I rather not count on them too much. This is why I believe 3 weeks is too long period. We are primarily doing this to drain migration contract, but I believe it should be drained very quickly if CDPs are aware of fee forgiveness? The good news is that CDPs are now very well collateralized in SCD - if ETH drops to $100 we see 2% of debt or “only” $270k debt liquidated. Majority of liquidations happen at $60-$70 eth range. Maybe this isn’t a huge problem after all but I just wanted to address this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.38895202020202
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#13",
                    "likes": "0",
                    "time": "28/04/2020-16:38:07",
                    "content": "This is a great point! And you were right.  Additionally, since the final settlement day is already set and published, and it will also give so much rooms for those who can manipulate the market for their own financial gains.  Understood that the shutdown will be 16:00 UTC on May the 12th, but at what period is the final settlement price will be based on? This is extremely critical, the longer the period, the harder to manipulate.  I’ve read that price will be on the 12th, is it the 24-hour average price at 16:00 UTC?   Can you please provide some clarity on this please? @Derek  Thank you so much! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.948051948051948
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#14",
                    "likes": "0",
                    "time": "28/04/2020-16:59:39",
                    "content": "Coincidentally, May 12th will be also the expecting Bitcoin Halving date, and it may cause some extra volatilities to the market, and it’s very bad for the CDP holders to bear the extra risks. Since the CDP > MCD migration is no longer available now, Is there any way for the MakerDAO team to work with SAI liquidity providers to add more SAI to the migration contract, so CDP holders can still manage to migrate to MCD and continue to support MakerDAO as they did when they first opened CDPs couple years ago? @Derek. @brianmcmichael Thank you for your time!  Best wishes to you and families!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.930357142857144
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#15",
                    "likes": "0",
                    "time": "28/04/2020-17:39:14",
                    "content": "Hi @1bit yeah, I agree with you and Primoz that the grace period was a little too long, although I understand the community rationale behind trying to do the right thing by giving people more than enough time and warning to migrate. Unfortunately a large CDP soaked up the Sai migration contract liquidity. As a Sai holder or CDP owner, we have two options - either (1) payback Sai to close out the CDP, or (2) wait for shutdown and reclaim the underlying collateral. Q1) The price of Sai will be determined at the time of shutdown by referencing the ETHUSD Oracle feed, where 1unit of Sai will equal $1 of ETH. This oracle is critical to the DeFi ecosystem so cannot be changed and will not be able to average the price over any period of time. Q2) Unfortunately I’m not aware of any teams supplying Sai to the migration contract now that it has been drained, meaning that its necessary to maintain any CDPs until shutdown and redeem for ETH. The CDP owner does of course have the benefit that all stability fees will be forgiven. I think the bitcoin halvening date will beat the time of shutdown, but it certainly will be interesting to see if there are any broader market effects as a result. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.250558035714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#16",
                    "likes": "0",
                    "time": "28/04/2020-17:49:53",
                    "content": "Hey Derek, thanks for your quick response! is Stability Fee forgiven if payback SAI to close out the CDP now (before shutdown)?  Thanks! Btw, the price method at shutdown is just way too risky.  And we are talking about over $10M equivalent here.  This is just a wide open for the whales…and it will add more reputation risks to the Maker team.  Please reconsider.  Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.159722222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "0",
                    "time": "28/04/2020-17:50:33",
                    "content": "    Derek:  Unfortunately I’m not aware of any teams supplying Sai to the migration contract now that it has been drained   Is this still possible due to the reduction of the migration debt ceiling to zero? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#18",
                    "likes": "1",
                    "time": "28/04/2020-21:32:18",
                    "content": "@1bit yes, if you are able to source Sai to pay off your debt now, you will be able to close your CDP without paying the stability fees. @LongForWisdom thank you for your correction! You’re right, it’s no longer possible to generate Sai from Dai or, Dai from Sai with the Sai debt ceiling at 0 and the migration contract at 0. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.763392857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#19",
                    "likes": "2",
                    "time": "29/04/2020-13:32:54",
                    "content": "Hi 1bit, unfortunately most of Maker’s partner liquidity providers upgraded their Sai via the migration contract, which empty now. I’m not sure how large your vault is, but it looks like you can still source Sai on the market pretty reasonably. I’d recommend a dex aggregator like dex.ag or 1inch to get the best prices. I just checked dex.ag and it looks like you can currently buy 10,000 Sai for 9,942 Dai via Kyber. So if you do want to close out your vault now it looks like you can get Sai at a discount, but I don’t know how long that will last. At this point the amount of Sai is diminishing as people close out their vaults, but you can always wait until shutdown and get the excess collateral in your vault back that way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving advice on how to source Sai",
                        "3rd party giving information on the current state of Sai availability",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.8019480519480515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#20",
                    "likes": "0",
                    "time": "30/04/2020-05:41:31",
                    "content": "Thank you! Will explore.  Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#21",
                    "likes": "0",
                    "time": "01/05/2020-03:17:39",
                    "content": "The markups on those platforms are insanely high (ranging from 30% to over 100%) on the top of the security concerns on those new less known platforms.  This is definitely not a good option for CDP holders with more than 50K SAI debt. Can you please work with the Maker’s SAI liquidity providers to help out these loyal early supporters of the MakerDAO project?  Adding more SAI back to the migration contract is ideal, if not, then at least other safer and more liquid options.  Thanks!  Stay safe and well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.0743844696969695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#22",
                    "likes": "1",
                    "time": "07/05/2020-14:57:41",
                    "content": "Concluding this signal post for future reference. The Maker Governance Poll which ended on Monday the 6th of April, signalled support for an Executive Vote that was subsequently past on April 24th 2020. This proposal confirmed that SCD will be shutting down on the 12th of May at 16:00 UTC. Further detail is available in our Guide to SCD Shutdown Blog as well as in our Sequential Process for SCD Shutdown Post. For further information about collateral redemption after shutdown, please visit here. ",
                    "links": [
                        "https://blog.makerdao.com/executive-vote-april-24-2020/",
                        "https://blog.makerdao.com/a-guide-to-single-collateral-dai-sai-shutdown/",
                        "https://forum.makerdao.com/t/sequential-process-for-scd-shutdown/1823",
                        "https://forum.makerdao.com/t/migration-portal-redemption-after-scd-shutdown-may-12th-2020/2253"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.281746031746032
                },
                {
                    "author_link": "https://forum.makerdao.com/u/1bit",
                    "index": "#23",
                    "likes": "0",
                    "time": "08/05/2020-05:12:24",
                    "content": "Hi All, any reasons for not having the SAI/DAI trading pair available on Oasis Trade?  I’ve noticed that there are some SAI trading activities on the Oasis Trade contract here, is this owned by the MakerDAO team? It will be great if the team can help out providing more liquidities to support the SCD owners to “migrate”.  Cheers!  Thanks!! Be safe and well.  @Derek. @brianmcmichael ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.6375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#24",
                    "likes": "0",
                    "time": "15/05/2020-05:12:26",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}