{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-foundation-funding-call-for-financial-transparency/4282",
            "title": "Makerdao Foundation Funding: Call for Financial Transparency ",
            "index": 4282,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#1",
                    "likes": "18",
                    "time": "20/09/2020-16:40:58",
                    "content": "Now that we are starting to have discussions about spending the Dai surplus on protocol development activities (instead of MKR burns), we should also have an open discussion about the foundation’s finances and what its role is going to be in supporting these activities going forward. Up to now, the foundation has supported all Maker protocol development presumably through spending the funds stored in the Maker multisig, which currently has ~$50m remaining.   I am assuming that these funds are earmarked to support the existing, announced activities (e.g. auctions 2.0, voting contract redesign, real world assets).  Its not clear, however,  what the runway is for when the community is supposed to take over from these funds or if all funds in the maker multisig are planned to be spent on development activities. Obviously, if the foundation was out of funds, we would need to urgently divert stability fee income into paying for ongoing protocol development activities.  At this point, it seems like the foundation is still able to function effectively and do great work, but we should start planning and setting expectations for when the community will need to take over financially and what types of activities need to be supported now by the community if they are going to move forward.  If we pay for activities out of the Dai surplus, does this mean that less MKR will be sold from the multisig account?  If so, we need to start having some accounting transparency so that the community can evaluate these tradeoffs effectively. ",
                    "links": [],
                    "GPT-summary": "The author of the post is calling for financial transparency from the Makerdao Foundation regarding their role in supporting protocol development activities. The post raises questions about the foundation's finances and the community's role in taking over financially. The post also suggests the need for accounting transparency to evaluate tradeoffs effectively. The post is an explanation of the proposal and asks for constructive criticism, questions, and auditing/reviewing of the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.725260416666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "11",
                    "time": "20/09/2020-20:22:39",
                    "content": "I completely agree. I absolutely don’t want to sound polemic. But I frankly don’t see on what ground we can ask MKR holders to mint new MKR and/or to use the SF to fund the project, when it’s not clear:  how much money the Foundation still has, how much it as earned in the past selling MKR, what portion of that income went to dev and what instead was cashed out, etc.  Also, there are big players in the DAO (e.g., a16z). I have raised this point many times in the chat, but when the partnership with a16z was announced (MKR was sold at a discount), it was claimed that they would bring great intellectual value and ‘contacts’. Is it too much to ask what these contact are? And ask a16z to help the DAO to build the community, to help us hiring a good team of smart-contract coders, etc? I personally never had the pleasure to chat (in the official Maker chat) directly with any representative of a16z. Have you? Do they even vote? But a16z is just one of several investment groups who bought MKR in the past. What are they doing? Are they free to dump their MKR? If not, for how long they need to hold? Etc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.909090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/09/2020-02:50:38",
                    "content": "@LongForWisdom is there anyone from the foundation that can respond to this? I think its a reasonable request to have some dialog.  The Ethereum Foundation is very open about these issues, for example. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#4",
                    "likes": "1",
                    "time": "22/09/2020-04:15:13",
                    "content": "I also want to know. Hope there is a detailed answer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "4",
                    "time": "22/09/2020-09:05:36",
                    "content": "    latetot:  @LongForWisdom is there anyone from the foundation that can respond to this?   I’m not part of the Maker Foundation. If they want to respond to it, they will, I can’t force them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#6",
                    "likes": "1",
                    "time": "22/09/2020-10:13:40",
                    "content": "    iammeeoh:  Also, there are big players in the DAO (e.g., a16z). I have raised this point many times in the chat, but when the partnership with a16z was announced ( MKR was sold at a discount ), it was claimed that they would bring great intellectual value and ‘contacts’.   “Big players” are not needed for defi development.  It’s just a risk management technique to have potentially less hostile regulators.  At least that is my interpretation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#7",
                    "likes": "1",
                    "time": "22/09/2020-10:51:49",
                    "content": " “Big players” are not needed for defi development. It’s just a risk management technique to have potentially less hostile regulators. At least that is my interpretation.  I am sure there must be a reason to embark them with discounted MKR. It would be nice to know once and for all. If we read the origina blog post:    Maker Blog – 26 Sep 18    a16z crypto purchases 6% of MKR, backing Stablecoin Vanguard MakerDAO - Maker... Signaling their support of MakerDAO’s Dai stablecoin, investment fund a16z crypto has purchased 6% of the total MKR token supply for $15 million USD.      we can read:  As part of this partnership, MakerDAO will receive operating capital through the next growth stage, 3 years of support for the MakerDAO community, and most importantly, full operational support from the 80+ person Andreessen Horowitz a16z team. Specifically, Dai Stablecoin adoption and regulatory support are two of the first priorities. Andreessen Horowitz and a16z crypto are opening up their expertise and network in areas ranging from sales and business development (including partnerships), marketing, technical talent, HR operations, and more. We look forward to being able to utilize a16z’s vast array of resources and knowledge to help guide and build Maker for years to come.  More than 2 years have passed. And we (i.e., MakerDAO community cited in the blog post), as opposed to the Foundation (which is not cited even once, also bacause it did not exist at the time), have no idea of what a16z has concretely done, nor how the 15m USD have been spent (it’s quite a bit of money). ",
                    "links": [
                        "https://blog.makerdao.com/part-2-a-primer-on-dai/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.026041666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "5",
                    "time": "22/09/2020-15:35:56",
                    "content": "I don’t know man–but I hope, and like to believe that the Maker Foundation is taking care of it’s employees/people. When I hear rumors that the Ethereum Foundation Devs are overworked and underpaid ( not to forget under pressure to deliver Eth 2.0) – I pray that the Maker Foundation is not making the same mistakes–because I  this community and I could care less what has been done with the A16Z money–or what A16Z does for MakerDAO – as long as the investment has been put to GOOD use–(like taking care of the Community and Foundation Employees). And IMO–I think it has. Here’s an excerpt from Anthony Sassano on the Trials and Tribulations that Eth Foundation Devs go thru: \"  the number 1 reason seems to be core developer burn out. The core developers are the people who are making sure the critical infrastructure such as the Ethereum node clients are running smoothly and without issue. This is a thankless job as almost no one in the ecosystem actually sees what work these developers do - from low-level protocol and node software optimizations to putting out fires that you didn’t even know were there. These people are under an incredible amount of stress to ensure that the network keeps running smoothly so this has led to some burn out which is totally understandable. There is also a lack of clear public communication from the parties involved in the core development process of Ethereum (and I don’t think it’s necessarily their fault). I bet most of you haven’t even heard of the Ethereum Cat Herders who actually do put out regular updates and have been for a while! I believe the problem here is that there is no one “leading” marketing/public relations for the “Ethereum project” itself - not even the Ethereum foundation - which leads to a “bystander effect” of sorts. What I mean by this is that for Ethereum marketing/PR updates, we pretty much have a situation where there is no “leader” to tell someone to put out these updates so everyone just assumes that someone else will do it. What ends up happening is the community tries to fill the void as best they can but this leaves much to be desired.\" –Anthony Sassano I believe that “We the Community”-- will do a kick-ass job in making sure this MakerDAO/DAI will survive and change the World for the better, with the help of You & every single community member. I also believe that 99% of people in this ecosystem are Good people. You compare that to other industries and it can be 60-40, 50-50, or worse. All in all I believe that 99.9% of our community is genuine. And at the end of the day–that’s all that matters, IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9716781874039935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#9",
                    "likes": "3",
                    "time": "22/09/2020-15:48:33",
                    "content": "Fully agree with your comments.  I just want to get some idea of when the community will need to take over fully with funding of protocol development so that we can plan a smooth transition.  So far all protocol development work has come from the foundation and none from the community.  This is not sustainable indefinitely but it will take a lot of planning to make sure the transition can succeed.  It would help to understand more who controls the MKR multisig and how they intend to spend it over time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#10",
                    "likes": "2",
                    "time": "22/09/2020-19:58:14",
                    "content": "@flipflopflapdelegate I completely agree. In fact, I even would consider OK/natural/good if the early developers and founders cashed out for themselves a significant amount of the proves of MKR sells. The deserved it! All I’d like to hear is a detailed (as much as possible) account of what happened, what is happening and what will happen. This layer of secrecy is not pleasant and, as @latetot says, it’s not helpful in moving towards a sustainable system. For example: how much are the current developers paid? We need to have an idea of this figure if we plan to use the SF to sustain development, right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.734523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#11",
                    "likes": "4",
                    "time": "23/09/2020-15:57:17",
                    "content": "I have been politely requesting at least an operational run rate estimate for a while now just to get an idea of how much DAI will be needed once the Foundation steps aside.    I would have liked to see a breakdown so that the community could look at what things could be taken off the Foundations back as well. Given the lack of any response on this topic my expecation is as follows:    As domain teams come on line, EPCs, Oracle Team, smart contracts, etc. we should start to get some idea of costs. My biggest problem here is that as far as I can tell the DAO itself doesn’t really have a clean mechanic yet for:  Provisions for MakerDAO Treasury (i.e. MIP14 or the like) Connecting (1) to people to manage old and new initiatives using such a Treasury.  I want to link to what @amyjung  etc.are doing with grants for domain personelle etc.   I had a link to presentation but am not sure if this connects.  In the end I suspect Foundation is working to offload - so over time we should have a better handle on this simply by doing it.   My expectation is that doing what the Foundation does now in a centralized fashion will cost 2-3x to do it in a decentralized one. Hopefully someone from the Foundation will offer some insight here as I don’t see how the DAO can just pick up things without knowing what is to be picked up - from an authoriity/responsibility perspective but also a cost and legal one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.689105339105339
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "25/12/2020-22:05:51",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}