{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-02-08-de-agosto-del-2022/17223",
            "title": "Relay Semanal | 02 - 08 de Agosto del 2022 ",
            "index": 17223,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "7",
                    "time": "12/08/2022-22:02:03",
                    "content": " 2585×580 110 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu parada obligatoria para estar al día con todas las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus y @Artem_Gordon  Versión Online en PDF    EVENTOS ACTUALES      Analizando la Division de RWA-001  En el transcurso de la semana se han producido una serie de posts (con alto tráfico de usuarios) relacionados con el tema, cada uno de ellos relacionado con RWA. A continuación, se ofrece un resumen de los eventos con enlaces a todos los debates relevantes y más detalles. Resumen de los Eventos enfocados en RWA ⮟  williamr es actualmente el único miembro que figura en la lista de RWF-001, ya que el equipo periférico fue despedido. Los antiguos miembros de RWF-001, christiancdpetersen, teej y eumenes, propusieron la creación de una nueva Core Unit de RWF, denominada RWF-0x. La propuesta inicial fue recibida con confusión; hasta ese momento, la comunidad en general desconocía la existencia de un conflicto en RWF-001. El equipo de RWF-0x propuesto cuestiono el posicionamiento de williamr sobre la CU y la estrategia subyacente. williamr prosiguió con un post defendiendo su posición, que incluía capturas de pantallas de mensajería privada entre los miembros del equipo, un tema que se volvió muy polémico a medida que avanzaba la semana. En otro hilo, posteado por SebVentures, se solicitan los fondos necesarios para “desbloquear” la iniciativa de generar ingresos a través de bonos a corto plazo, la cual actualmente está paralizada.  Línea de Tiempo Detallado y Análisis de los Eventos enfocados en RWAs ⮟ Las dos MIPs se postearon en conjunto. El resto de los enlaces dirigen a las innumerables discusiones que se generaron a partir de esos mensajes iniciales.  MIP39c2-SP34: Creación de RWF0x a partir de una división de RWF-001  3 de agosto del 2022 - christiancdpetersen posteo una MIP, que propone la división de RWF-001. Bajo los términos de la propuesta actual, RWF se dividirá en dos Core Units y el 75% del presupuesto de RWF-001 seria reasignado a RWF-0x.  MIP40c3-SP78: Propuesta Presupuestaria de RWF-0x hasta el 2022  3 de agosto del 2022 - christiancdpetersen describe el presupuesto de la Core Unidad RWF-0x propuesta. La propuesta solicita financiación hasta final de año con la siguiente distribución de gastos:   Horario de Oficina de los Delegados: RWF se divide en RWF-0x y RWF-001  5 de agosto del 2022 - Naturalmente, el Horario de Oficina de los Delegados de la semana pasada se centró en esta división de RWF. Un Breve Resumen de la Llamada ⮟  monkey.irish habla de los acuerdos que están quedando en el limbo por la separación. Actualmente está trabajando con willamr y el equipo de RWF-0x propuesto para facilitar las negociaciones en el intermedio. La continuidad del trabajo es actualmente su principal prioridad. Se confirmo que la totalidad del equipo periférico fue despedido. PaperImperium señala que williamr ha puesto en marcha un equipo de reemplazo. Según Mark Phillips, el retraso le está costando a las DAO 50.000 dólares al día, en gastos legales. Se llegó a un consenso general sobre la necesidad de obtener más información de las partes implicadas para elaborar un plan de acción apropiado.   La ‘respuesta ante un comportamiento inaceptable’ de williamr  5 de agosto del 2022 - willamr ofrece su versión de la historia, incluyendo capturas de pantalla de la mensajería privada entre los miembros del equipo. El post original se editó para excluir esta información, pero el Delegado Reconocido ChrisBlec optó por guardarlas y volver a publicar las conversaciones para lograr una “transparencia total”. Varios miembros de la comunidad han compartido sus opiniones sobre el tema, y el sentimiento actual está dividido.  Desbloquear las iniciativas de generación de ingresos por bonos a corto plazo paralizadas  7 de Agosto del 2022 - SebVentures solicita financiación para continuar con los proyectos retrasados, establecidos por la MIP65: Monetalis Clydesdale y la MIP-6: Invertir en bonos a corto plazo. De acuerdo con el post:  “Cada día de retraso tiene un costo de oportunidad de 40-80k DAI. Eso es clave para volver a la rentabilidad (consulta ALM forecast).”  SF-001 solicita 500k DAI del presupuesto legal de RWF-001, actualmente controlado por willamr, para ser depositado a la wallet de SF-001 y así cubrir los gastos legales derivados de los acuerdos mencionados.  [Encuesta Informal] ¿Deberíamos permitir la filtración de conversaciones privadas en el foro?  El último tema de discusión vino de la mano de TRUEMAKER, a través de una encuesta de seguimiento en la que se cuestiona si se debe permitir o no, compartir conversaciones privadas y, en caso de que no, si se debe penalizar de alguna forma a los responsables.    ¿Apoyas al Plan End Game?  En un esfuerzo por tener una mejor idea del nivel de apoyo de la comunidad hacia el Plan Endgame de Rune, Ippy presentó una encuesta informal simplemente preguntando: “¿Apoyas el Plan Endgame?”  1662×757 115 KB    Iniciativa de Colateral Respaldado por DAI para Recabar Información  LongForWisdom de GovAlpha anuncio el lanzamiento de una iniciativa para la creación de documentos y resúmenes de párrafos que expliquen cada tipo de activo que está respaldando a DAI, incluyendo RWAs. Varios miembros de la comunidad ya han participado para proporcionar descripciones de activos y compartir opiniones sobre el proyecto.  Desglose de la Compensación a los Delegados Reconocidos - Julio del 2022  Se publico el Desglose de la Compensación a los Delegados Reconocidos de julio. Donde se distribuyeron 121.808 DAI en compensación a los Delegados en julio, en comparación con 78.062 de mayo y 73.612 de junio.  1036×583 128 KB   SocGen Forge OFH: Conceder el permiso final después de la incorporación  Esta semana, se darán los pasos finales para incorporar el token OFH FORGE SocGen de Société Générale (RWA008-A), cuando la dirección de la wallet de SocGen sea añadida oficialmente al contrato de la Vault. Este paso quedo en pausa durante la fase inicial de incorporación, la semana pasada, debido a que las partes interesadas de Société Générale no estaban disponibles durante el proceso de creación y validación del spell.  ¡La Hora Feliz del Delegado! con Schuppi y ElPro  Ya lanzaron el Episodio #4 de “¡La Hora Feliz del Delegado! con Schuppi y ElPro”. Este episodio es el primero en presentar a un invitado: Raphael, de la Plataforma de Delegado de Flipside Crypto. Temas:  764×457 132 KB    Esta Semana en Gobernanza  Actualización Semanal de MIPs #99  Encuestas de Ratificación, propuestas y discusiones pre-MIP.   Votación(es) Ejecutiva(s) Te traemos los resultados de las dos Propuestas Ejecutivas que se aprobaron esta semana: Incorporar Vaults de Activos del Mundo Real – Aprobado el 02 de Agosto del 2022 a las 13:25 UTC. Ejecutado el 04 de Agosto del 2022 a las 14:01 UTC. Se han realizado las siguientes adiciones al Protocolo Maker:  De acuerdo con esta encuesta, se incorporó Forge (OFH) - Societe Generale, como un nuevo tipo de vault, RWA-008. De acuerdo con esta encuesta, se incorporó HVBank - Banco de Huntingdon Valley, como un nuevo tipo de vault, RWA-009.  Se llevaron a cabo los siguientes cambios en el Protocolo de Maker:   Enmiendas a las cartas de acuerdos entre la Fundación RWA y varias partes, para la construcción legal de RWA-009 (HVBank).      Parámetros de Colaterales OFH HVBank     Tarifa de Estabilidad 0.05% 0.0%   Techo de Deuda 30M DAI 100M DAI   Ratio de Liquidacion 100% 100%   Tiempo de Bloqueo de anulación de deuda (tau) 0 0   Proceso de Liquidacion MIP21 MIP21    Re-Despliegue de la Distribución de la Red Keeper – Aprobado el 04 de Agosto del 2022, 18:30 UTC. Ejecutado el 06 Agosto del 2022 a las 18:39 UTC.   De acuerdo con este post del foro y la MIP63c4-SP4: Incorporar/Enmendar la Red Keeper (Keep3r) ratificada, la distribución previamente establecida a la Red Keep3r fue cancelada y una nueva distribución fue desplegada.  215.000 DAI serán distribuidos a la Red Keep3r, a 0x37b375e3D418fbECba6b283e704F840AB32f3b3C, comenzando el 01-07-2022 y terminando el 31-01-2023 a una tasa de 1.000 DAI/día.  0x45fEEBbd5Cf86dF61be8F81025E22Ae07a07cB23 fue agregado como manager para esta distribución. En el caso de que haya inconvenientes con la distribución, esta dirección será capaz de cancelar la distribución, sin que se necesite una próxima propuesta ejecutiva.      Encuestas Activas  Encuestas de Ratificación Quedan menos de quince días para votar en estas Encuestas:     Nombre de la Encuesta Discusión Fecha de Inicio Fecha de Cierre     Modificar el Presupuesto de la Core Unit de la Fundación DAI (MIP40c3-SP74) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC   Enmiendas al Proceso de Desincorporación de Core Units (MIP4c2-SP15) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a la 16:00 UTC   Modificar el Presupuesto de la Core Unit de Oráculos (MIP40c3-SP75) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC   Modificación del Módulo de Deposito Directo de DAI MIP50 (MIP4c2-SP23) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC   Makershire Redux (MIP76) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC   Desincorporación de la Core Unit de Eventos (EVENTS-001) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC      Encuestas del Visto Bueno de la Comunidad Menos de una semana para decidirse:     Encuesta Desglose de Votos Fecha de Inicio Fecha de Cierre     MIP9 - Pando (Activos Climáticos de Nivel de Inversión de Pando)  image2275×532 86.7 KB  01 de Agosto del 2022 a las 16:00 UTC 15 de Agosto del 2022 a las 16:00 UTC      Encuestas Finalizadas Estas tres tuvieron un final feliz:     Encuesta Desglose de Votos Fecha de Cierre     PPG - Propuesta del Comité de Mercado Abierto  04 de Agosto del 2022 a las 16:00 UTC   Despliegue del Teleport de Maker en Starknet y los Parámetros de Riesgo Asociados  04 de Agosto del 2022 a las 16:00 UTC   Proceso de Reasignación Táctica para Ajustes Presupuestarios  04 de Agosto del 2022 a las 16:00 UTC      Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:  Conoce Tu Delegado #17 - ft. CodeKnight y pvl | Foro | Video  Comité de Votación Descentralizado Abierto | Foro | Video  Horario de Oficina de los Delegados | Foro | Video  Gobernanza y Riesgo - Ep. 202 | Foro | Video   Llamadas Recientes:  Comité de Votación Descentralizado Abierto | Link | 2022-08-10 Horario de Oficina de los Delegados | Link | Gobernanza y Riesgo - Ep. 203 | Foro | Link | Comité de Votación Descentralizado Abierto | Link |    Horario de Oficina de las Core Units    Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC | Alternativa: Link para unirse - Cada dos Miércoles a las 15:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Growth - Primer Miércoles de Cada Mes a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | Capital 6S - Cada dos Miércoles a las 14:00 UTC    Recursos  Abrir Lista  Todos los Paneles Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Rastreador del Panel de Gobernanza | Versión Google Sheet   Conoce tu Índice MIP   Portal de Aprendizaje y Documentación Técnica   Servidor de Discord de MakerDAO   MakerBurn   Lista de los Horarios de Oficina   Herramientas de Participacion   Calendario de Votación y Fechas Importantes    Descargo de Responsabilidad Esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de ser asesoramiento financiero, ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación. @Recognized-Delegates  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix. ",
                    "links": [
                        "https://forum.makerdao.com/g/Real-World-Finance",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968",
                        "https://forum.makerdao.com/t/my-response-to-unacceptable-behaviour/17028/53",
                        "https://forum.makerdao.com/t/unblocking-the-stalled-short-term-bonds-revenues-generating-initiatives/17073/1",
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967",
                        "https://forum.makerdao.com/t/mip40c3-sp78-rwf-0x-budget-proposal-through-2022/16968",
                        "https://www.youtube.com/watch?v=KZFZ1xQ6ZzU",
                        "https://forum.makerdao.com/t/my-response-to-unacceptable-behaviour/17028/53",
                        "https://forum.makerdao.com/t/unblocking-the-stalled-short-term-bonds-revenues-generating-initiatives/17073/1",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-liquid-bond-strategy-execution/13148",
                        "https://forum.makerdao.com/t/mip-6-declaration-of-intent-invest-in-short-term-bonds-proposal-for-implementation/16185",
                        "https://forum.makerdao.com/t/makerdao-alm-forecast/16881",
                        "https://forum.makerdao.com/t/informal-poll-should-we-allow-leaked-private-conversations-on-the-forum/17050",
                        "https://forum.makerdao.com/t/informal-poll-should-we-allow-leaked-private-conversations-on-the-forum/17050",
                        "https://forum.makerdao.com/t/informal-poll-end-game/17015",
                        "https://forum.makerdao.com/t/eli5-dai-backing/17000",
                        "https://forum.makerdao.com/t/recognized-delegate-compensation-breakdown-july-2022/16995",
                        "https://forum.makerdao.com/t/socgen-forge-ofh-granting-final-permission-after-the-onboarding/17033",
                        "https://forum.makerdao.com/t/the-schuppi-and-elpro-delegate-happy-hour-featuring-raphael-of-flipside-crypto/17023",
                        "https://forum.makerdao.com/t/weekly-mips-update-99/17102",
                        "https://vote.makerdao.com/executive/template-executive-vote-onboarding-real-world-asset-vaults-july-29-2022",
                        "https://vote.makerdao.com/polling/QmajCtnG#vote-breakdown",
                        "https://vote.makerdao.com/polling/QmQMDasC#vote-breakdown",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-transaction-documents-on-permaweb/16264/8",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-debt-ceiling",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-liquidation-ratio",
                        "https://mips.makerdao.com/mips/details/MIP21",
                        "https://mips.makerdao.com/mips/details/MIP21",
                        "https://vote.makerdao.com/executive/template-executive-vote-hvbank-drawdown-keeper-network-stream-re-deployment-august-03-2022",
                        "https://forum.makerdao.com/t/mip63c4-sp4-onboard-amend-keeper-network-keep3r-network/14321/8",
                        "https://mips.makerdao.com/mips/details/MIP63c4SP4",
                        "https://etherscan.io/address/0x37b375e3D418fbECba6b283e704F840AB32f3b3C",
                        "https://etherscan.io/address/0x45fEEBbd5Cf86dF61be8F81025E22Ae07a07cB23",
                        "https://vote.makerdao.com/polling/QmQJ9hYq",
                        "https://forum.makerdao.com/t/mip40c3-sp74-modify-dai-foundation-core-unit-budget-daif-001/16379/4",
                        "https://vote.makerdao.com/polling/QmbBh8t4",
                        "https://forum.makerdao.com/t/new-mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://vote.makerdao.com/polling/Qma3P8v9",
                        "https://forum.makerdao.com/t/mip40c3-sp75-modify-oracles-core-unit-budget-ora-001/16397",
                        "https://vote.makerdao.com/polling/QmWYXAdd",
                        "https://forum.makerdao.com/t/mip4c2-sp23-mip50-direct-deposit-module-amendment/16387",
                        "https://vote.makerdao.com/polling/QmTYQskE",
                        "https://forum.makerdao.com/t/mip76-makershire-redux/16400",
                        "https://vote.makerdao.com/polling/QmTNaLnY",
                        "https://forum.makerdao.com/t/mip40c3-sp73-modify-core-unit-budget-events-001/15991",
                        "https://vote.makerdao.com/polling/QmawHstd",
                        "https://vote.makerdao.com/polling/QmfMRfE4",
                        "https://vote.makerdao.com/polling/QmZxRgvG",
                        "https://vote.makerdao.com/polling/QmRLsRRA",
                        "https://forum.makerdao.com/t/meet-your-delegate-17/16932",
                        "https://www.youtube.com/watch?v=KZFZ1xQ6ZzU",
                        "https://forum.makerdao.com/t/endgame-dvc-meetings-for-today-and-tomorrow-9pm-cest/16981",
                        "https://www.youtube.com/watch?v=z_CKZmqsu5U",
                        "https://forum.makerdao.com/search?q=Delegate%20Office%20Hours%20%23pubcall-%3A-office-hours",
                        "https://www.youtube.com/watch?v=W8o7YKQQyZc",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://www.youtube.com/watch?v=Zk_tCIV7ItY",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/89326394914&sa=D&source=calendar&ust=1660493088184705&usg=AOvVaw1YBV1Am5xtqFqJNsoVQUIe",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/88286550832?pwd%3DdWQzQi9tYlNyemJJS2Nrd2NUdTBoZz09&sa=D&source=calendar&ust=1660493088184705&usg=AOvVaw2XZyE9BrQvOzddL7fBqmW4",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://zoom.us/j/697074715",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/82286534666&sa=D&source=calendar&ust=1660493088184705&usg=AOvVaw3JSh3pFt6uHQi0GbtOTGia",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/9"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.328947368421053
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/08/2022-07:48:59",
                    "content": "Gracias de nuevo mi gente. Siempre espero estos relevos semanales ya que me dan una idea de todo lo que sucedió dentro del marco de tiempo dado. Excelente trabajo como siempre. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-12-18-de-julio-del-2022/16789",
            "title": "Relay Semanal | 12 - 18 de Julio del 2022 ",
            "index": 16789,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "8",
                    "time": "23/07/2022-15:31:32",
                    "content": " 2587×582 102 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu parada obligatoria para estar al día con todas las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus y @Artem_Gordon  Versión Online en PDF    EVENTOS ACTUALES    Propuestas de Desincorporación en Curso Se han posteado tres propuestas para desincorporar y remover varias Core Units. Por lo tanto, este es un tema natural de discusión durante las Horas de Oficina de los Delegados de esta semana. Esta discusión comenzó con IS-001, representada por su Facilitador, @psychonaut. Se presentaron varias opciones de compromiso, que se tratarán a continuación. Pero, en primer lugar, vale la pena señalar que IS-001 propuso por primera vez estas reducciones en su actualización de junio antes de que surgiera la propuesta de desincorporación. Por ello, varios delegados aplaudieron a IS-001 por su proactividad y consideraron que los cambios propuestos ofrecen un modelo para que otros Facilitadores puedan solucionar problemas percibidos antes de tomar medidas drásticas. Propuesta de Reducción de IS-001   Una reducción del actual gasto mínimo mensual de 22k a 8k Los pagos a Immunefi cayeron de 10k mensuales a 0 Una reconsideración de las asociaciones activas con Chaos Labs y DeFi Safety.   Nota: Un recorte presupuestario de Immunefi supondría un cese de la clasificación de informes, contenido educacional y reportes sobre vulnerabilidades no críticas, asi como acceso a su cuarto de guerra/servicio de respuesta de emergencia. Además, IS-001 considera que Chaos Labs es una parte integral del futuro del programa de recompensas por errores. En la actualidad, los “whitehats” no tienen el incentivo necesario para crear los entornos adecuados para probar e impulsar al protocolo. Chaos Labs permite que este entorno se instale rápidamente, lo que significa que hay más ojos en el código y que se ponen a prueba condiciones adicionales que podrían no haberse considerado. Luego, la conversación se amplió y se identificaron algunos problemas subyacentes. Primero, tenemos tres propuestas de desincorporación que se están llevando a cabo al mismo tiempo, pero la MIP para revisar este proceso aún no se ha aprobado. @twblack88 siente que necesitamos comenzar a ver estas propuestas a través de los lentes de este nuevo marco, que enfatiza trabajar directamente junto con las CUs para fomentar la proactividad. La segunda vino por parte @rspa.  “Queremos ver disciplina presupuestaria, pero no hemos establecido que significa eso realmente.”  Para el, esto significa asignar presupuestos a las “cosas correctas” pero primero necesitamos establecer una base para decidir que son las “cosas correctas”. Antes de continuar por este camino, es necesario acordar una estrategia central, que otorgue a las CUs un camino más detallado hacia el éxito y asegurar que varias iniciativas de CUs se alineen bajo ese mensaje. El tercero sirvió más bien como un sutil recordatorio. @schuppi advierte que mientras la actividad del foro de ninguna forma dicta una opinión mayoritaria entre los poseedores de MKR, desde afuera puede ser así. Una idea expuesta por @Thomas-flitter1. La CU de Eventos se incorporó hace muy poco, cumplió con los puntos establecidos en su hoja de ruta y sigue siendo objeto de críticas debido a las condiciones del mercado. En pocas palabras, no se les ha dado el tiempo suficiente, sobre todo cuando ya funcionaban con la estrategia que las ratificó. Para concluir, hay más trabajo por hacer, pero ya se están creando marcos que ofrecen soluciones a algunos de estos problemas. Dicho esto, basándonos en el debate de la semana, es seguro que continuaran las conversaciones en torno a una estrategia para la DAO. Haz clic aquí para ver el debate completo. Propuestas de Desincorporación Activa   Desincorporación del Facilitador de IS-001 | Modificación del Presupuesto   EVENTS-001 | Modificación del Presupuesto   Desincorporación del Facilitador de SH-001 | Modificación del Presupuesto     Hasu Propone Reiniciar las Métricas de Delegado Una Sola Vez En una Petición de Senal posteada en el Foro, el Delegado Reconocido Hasu solicito un ‘reinicio’ de las métricas de delegación personal. El motivo de la solicitud se debe a una confusión que se presento en torno a las funciones, responsabilidades y compromisos esperados de un Delegado Reconocido. Para resumir la propuesta:  Hasu originalmente se unió sin la intención de trabajar como un Delegado asalariado, sino con la intención de ser un activista de plataforma; sin embargo, este trabajo comenzó a consumir cada vez mas de su tiempo. Hasu argumenta que bajo el sistema de participación actual, le tomaría años alcanzar las métricas requeridas para ser un delegado asalariado y solicita “reiniciar” una sola vez las métricas de participación personal.  La encuesta se mantendrá activa aqui, hasta el 23 de julio.   MonetSupply: Perspectivas sobre la Gobernanza de MakerDAO  El podcast “I Pledge Allegiance”, de reverie que mantiene conversaciones con “los principales participantes de la cripto-gobernanza”, acogió recientemente a @monet-supply de la Core Unit de Riesgo. Los temas del debate incluyeron:  El Modelo de la Core Unit El Enfoque de Maker sobre los Activos del Mundo Real El Plan Endgame de @rune  La propuesta de @Hasu para reformar la Gobernanza La controversia alrededor de la Core Unit de Supervisión de Prestamos (LOVE) Gobernanza de Cosmos Herramientas DAO Marcos de Gobernanza Modelos de veToken El colapso de Terra  El mes pasado, el podcast recibió al Delegado Reconocido @Hasu para hablar sobre los desafíos actuales de la gobernanza de las DAO y cómo se puede mejorar.   La Hora Feliz de los Delegados Schuppi y ElPro – Episodio 1    Horario de Oficina de los Delegados - Incluye encuesta para el tema de discusión.  ¡Los Delegados @ultraschuppi y @flipflopflapdelegate unieron fuerzas para el Episodio 1 de la Hora Feliz de los Delegados Schuppi y ElPro! En estas series, ambos esperan proporcionar una “plataforma visual” para que los Delegados puedan comunicar los valores centrales de su plataforma y sus opiniones sobre los eventos actuales en la DAO. También planean invitar a miembros de equipos de Core Units que no sean Delegados y Facilitadores de Core Units en el futuro.      La semana pasada también tuvo lugar la sesión Estándar del Horario de oficina de los Delegados. El principal tema de debate, votado por la comunidad, fueron las “Propuestas de Incorporación de Core Units Activas”, superando por poco la “Constitución de MakerDAO”.        BlockTower Credit - Introducción y Propuesta de Arreglo  El conocido fondo de inversión en criptomonedas BlockTower Capital, formado por el alumno de Goldman Sachs; Matthew Goetz y el gestor de riesgo de dotaciones de la Universidad de Chicago; Ari Paul, publicó un post la semana pasada en el que proponía convertirse en organizador de MakerDAO y anunciaba su intención de solicitar una Vault de $100MM DAI a una tasa de estabilidad del 4% para financiar activos de crédito senior garantizados en el mundo real. BlockTower gestiona actualmente “más de 500 millones de dólares” en activos. Como organizador de MakerDAO, BlockTower Credit buscaría aprovechar su experiencia, sus habilidades y  sus redes para, en palabras de @rune, “buscar, organizar y proponer acuerdos RWA” para aumentar la exposición de Maker a esta clase de activos.   Plan Endgame Parte 5: Hoja de Ruta del Producto Endgame - Pregame y Early Game  La Parte 5 del Plan Endgame de @rune se enfoca en la hoja de ruta del Producto Endgame, una lista completa de todos los productos principales de Maker y funciones que tendrán lugar si se alcanza el estado inmutable de Endgame. Un elemento esencial del Plan Endgame es que estas funciones deberían ser cuidadosamente definidas en una fase tan temprana como sea posible, para evitar demasiados cambios una vez que se haya puesto en marcha el Plan Endgame.  1035×622 50.8 KB  Este post se enfoca en los productos y funciones Pregame: bajo costo, productos de alto impacto que se pueden desarrollar rápidamente y deben estar listos antes del lanzamiento del Plan Endgame. Algunos productos Pregame propuestos por @rune incluyen:  ETHD I: EtherDai  El producto central orientado al usuario de todo el Plan Endgame, ya que todos los demás mecanismos e incentivos tienen como objetivo llevar a los usuarios hacia Vaults EtherDai La meta es tener un token ETH estakeado bajo el control de la Gobernanza de Maker, que pueda ser actualizado para convertirse en un activo sintético de pleno derecho   Elixir I  La solución de liquidez universal a largo plazo para DAI, ETHD y MKR en el Plan Endgame Se utiliza para automáticamente proporcionar una liquidez sostenible y cautiva en todos los mercados descentralizados clave   Tokens de MetaDAOs  Tokens ERC20 Simples que el Modulo de Seguridad de Gobernanza posee administrativamente   Votación off-chain simple  Un sistema como snapshot.org para encuestas off-chain sin necesidad de gas    Únete a @rune y a otras partes interesadas este miércoles y jueves a las 7 PM UTC para los siguientes Comités de Votación Decentralizados, esta vez enfocados en reducciones de presupuestos y la consolidación de Core Units relacionadas al crecimiento y marketing. Se grabo la llamada de la semana pasada, que contaba con Nik de la Core Unit de Oráculos, que hablo sobre la hoja de ruta de la CU de Oráculos y las iniciativas actuales, también compartió sus pensamientos sobre el Plan Endgame.        Retraso de la Delegación de Custodia de Maker en Coinbase  @0xdeniz, el Facilitador de la Core Unit DUX público un post en el #canal de gobernanza de Discord para hacernos saber que la Custodia de Coinbase no estará apoyando la Delegación de Maker hasta finales del cuarto trimestre.    Esta Semana en la Gobernanza  Actualización Semanal de MIPs #96  Encuestas de Ratificación, propuestas y discusiones pre-MIPs.  Votación(es) Ejecutiva(s) Una sola votación Ejecutiva se aprobó esta semana y de acuerdo con esta encuesta se llevaron a cabo los siguientes cambios recomendados por el Comité de Mercado Abierto de Maker - Grupo de Propuestas de Parámetros:   Cambios de Parámetros del MOMC - 13 de Julio del 2022 – Aprobada el 14 de Julio del 2022 a las 06:10 UTC. Ejecutada el 16 de Julio del 2022 a las 06:16 UTC.    Recomendación de Cambios de Parámetros del MOMC     Parámetro Tipo de Vault + / - De/a     Tarifa de Estabilidad GUNIV3DAIUSDC1-A + 0% / 0.01%   Tarifa de Estabilidad UNIV2DAIUSDC-A + 0% / 0.1%   Tarifa de Estabilidad WSTETH-A + 2.25% / 2.5%   Tarifa de Estabilidad USDC-A - 1% / 0%   Tarifa de Estabilidad USDP-A - 1% / 0%   Techo de Deuda Máximo (line) UNIV2DAIUSDC-A + 250M DAI / 300M DAI   Techo de Deuda Máximo (line) LINK-A - 50M DAI / 25M DAI   Techo de Deuda Máximo (line) WSTETH-A - 200M DAI / 150M DAI   Techo de Deuda Máximo (line) WSTETH-B - 150M DAI / 100M DAI   Techo de Deuda Máximo (line) YFI-A - 50M DAI / 25M DAI   Techo de Deuda Máximo (line) MATIC-A - 35M DAI / 20M DAI   Objetivo de Deuda Disponible (gap) UNIV2DAIUSDC-A + 10M DAI / 20M DAI   Objetivo de Deuda Disponible (gap) MATIC-A - 10M DAI / 5M DAI     Encuestas de Gobernanza Un mes atípico, julio nos trajo solo una Encuesta de Ratificación:     Nombre de la Encuesta Debate(s) Fecha de Inicio Fecha de Cierre     Encuesta de Ratificación para la Incorporación de Facilitadores de Gobernanza GOV-001 (MIP41c4-SP37) Debate 11 de Julio del 2022 a las 16:00 UTC 25 del Julio del 2022 a las 16:00 UTC     Encuestas del Visto Bueno de la Comunidad Una sola Encuesta del Visto Bueno de la Comunidad está esperando por tu participación:     Encuesta Desglose de Votos Fecha de Inicio Fecha de Cierre     Encuesta del Visto Bueno de la Comunidad - bIBTA (ETF de Bonos a Corto Plazo con Respaldo Financiero)  2265×532 78.1 KB  18 de Julio del 2022 a las 16:00 UTC 01 de Agosto del 2022 a las 16:00 UTC     Encuestas Terminadas Esto fue lo que ocurrió con las iniciativas de la semana pasada:     Nombre de la Encuesta Desglose de Votos Fecha de Inicio Fecha de Cierre     Agregar RWA-008 (OFH) como un nuevo tipo de Vault  Desgloce de Votos717×270 6.39 KB  11 de Julio del 2022 a las 16:00 UTC 14 de Julio del 2022 a las 16:00 UTC     Simulacro de Incendio   @psychonaut elaboró un resumen recopilando una serie de conclusiones y opiniones de varios Delegados y miembros, así como otras consideraciones técnicas, sobre el simulacro de incendio de la semana pasada. También hay una encuesta informal renovada, breve, destinada a reevaluar el sentimiento de la comunidad sobre el tema y refinar dichas conclusiones.  Para las iteraciones anteriores, consulta este post del foro.   Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:  Comité de Votación Descentralizado Abierto - 12 de Julio | Foro | Video  Horario de Oficina de Delegados | Discord | Video  Gobernanza y Riesgo | Ep. 199 | Link para unirse | Video  Llamada de Incorporación de Colateral #45 - Backed-Finance | Foro | Video   Llamadas Recientes:  DeFiSafety Presenta: Un Marco de Seguridad para Protocolos DeFi | Link para unirse | 19 de Julio a las 13:30 UTC  Comité de Votación Descentralizado Abierto | Foro | Link para unirse | 20 Julio a a las 19:00 UTC  Horario de Oficina de Delegados | Discord | Link para unirse | 21 de Julio a las 16:00 UTC  Gobernanza y Riesgo - Ep. 200 | Foro | Link para unirse | 21 de Julio a las 18:00 UTC  Comité de Votación Descentralizado Abierto | Foro | Link para unirse | 21 de Julio a las 19:00 UTC     Horario de Oficina de las Core Units   Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC | Alternativa: Link para unirse - Cada dos Miércoles a las 15:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Crecimiento - Primer Miércoles de Cada Mes a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | Capital 6S - Cada dos Miércoles a las 14:00 UTC    Recursos  Abrir Lista  Todos los Paneles Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Rastreador del Panel de Gobernanza | Versión Google Sheet   Conoce tu Índice MIP   Portal de Aprendizaje y Documentación Técnica   Servidor de Discord de MakerDAO   MakerBurn   Lista los Horarios de Oficina   Herramientas de Participacion   Calendario de Votación y Fechas Importantes    Descargo de Responsabilidad Descargo de Responsabilidad: esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de ser asesoramiento financiero ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación.  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix. ",
                    "links": [
                        "https://forum.makerdao.com/t/immunefi-security-cu-update-for-june/16275",
                        "https://www.youtube.com/watch?v=Wx2n6xHljk0",
                        "https://forum.makerdao.com/t/mip41c5-sp10-facilitator-offboarding-is-001/16437",
                        "https://forum.makerdao.com/t/mip40c3-sp77-modify-immunefi-security-budget-is-001/16436",
                        "https://forum.makerdao.com/t/mip41c5-sp8-facilitator-offboarding-events-001/15992/3",
                        "https://forum.makerdao.com/t/mip40c3-sp73-modify-core-unit-budget-events-001/15991",
                        "https://forum.makerdao.com/t/mip41c5-sp9-facilitator-offboarding-sh-001/16439/9",
                        "https://forum.makerdao.com/t/mip40c3-sp76-modify-strategic-happiness-core-unit-budget-sh-001/16438",
                        "https://forum.makerdao.com/t/signal-request-reset-delegation-metrics-for-hasu/16533",
                        "https://forum.makerdao.com/t/signal-request-reset-delegation-metrics-for-hasu/16533",
                        "https://www.reverie.ooo/podcast-episode/monetsupply-perspectives-on-makerdao-governance",
                        "https://www.reverie.ooo/podcasts",
                        "https://www.reverie.ooo/",
                        "https://www.reverie.ooo/podcast-episode/hasu-the-current-state-of-dao-governance",
                        "https://forum.makerdao.com/t/the-schuppi-and-elpro-delegate-happy-hour-episode-1/16604",
                        "https://forum.makerdao.com/t/delegate-office-hours-includes-poll-for-discussion-topic/16571",
                        "https://www.youtube.com/watch?v=ArAXvJHZCko",
                        "https://www.youtube.com/watch?v=Wx2n6xHljk0",
                        "https://forum.makerdao.com/t/blocktower-credit-introduction-arranger-proposal/16535",
                        "https://forum.makerdao.com/t/the-arranger-model-a-highly-scalable-rwa-framework/11298",
                        "https://forum.makerdao.com/t/the-arranger-model-a-highly-scalable-rwa-framework/11298#the-arranger-model-7",
                        "https://forum.makerdao.com/t/endgame-plan-part-5-endgame-product-roadmap-pregame-and-early-game/16670",
                        "http://snapshot.org/",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://www.youtube.com/watch?v=DEAk4VPZfeI",
                        "https://discord.com/channels/893112320329396265/899667119426371625",
                        "https://forum.makerdao.com/t/weekly-mips-update-96/16688",
                        "https://vote.makerdao.com/polling/QmefrhsE#vote-breakdown",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://vote.makerdao.com/executive/template-executive-vote-momc-parameter-changes-july-13-2022",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#target-available-debt-gap",
                        "https://manual.makerdao.com/module-index/module-dciam#target-available-debt-gap",
                        "https://youtu.be/kjq4wYuwgxs",
                        "https://vote.makerdao.com/polling/QmY3xqFQ",
                        "https://forum.makerdao.com/t/mip41c4-sp37-governance-facilitator-onboarding-gov-001/15284",
                        "https://vote.makerdao.com/polling/QmbDbzqW",
                        "https://vote.makerdao.com/polling/QmajCtnG",
                        "https://vote.makerdao.com/polling/QmQXTMw1",
                        "https://forum.makerdao.com/t/fire-drill-postmortem-informal-poll/16677",
                        "https://forum.makerdao.com/t/fire-drill-request-for-discussion-informal-polls/13799",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://www.youtube.com/watch?v=DEAk4VPZfeI",
                        "https://discord.com/channels/893112320329396265/989856974747349112",
                        "https://www.youtube.com/watch?v=Wx2n6xHljk0",
                        "https://zoom.us/j/697074715",
                        "https://www.youtube.com/watch?v=yekcB68XALc",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-45-backed-finance/16420",
                        "https://www.youtube.com/watch?v=Yt-Ktg1xcAc",
                        "https://meet.google.com/gkr-jbcq-foq",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://us02web.zoom.us/j/81436458345",
                        "https://discord.com/channels/893112320329396265/989856974747349112",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/88286550832?pwd%3DdWQzQi9tYlNyemJJS2Nrd2NUdTBoZz09&sa=D&source=calendar&ust=1658682481103460&usg=AOvVaw15ALIylKJo-y35jU4f22Ps",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://us02web.zoom.us/j/81436458345",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/5"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#2",
                    "likes": "1",
                    "time": "24/07/2022-01:21:43",
                    "content": "Gracias mi gente, ya una costumbre establecida esperar estos Relay, excelente como siempre. Se agradece  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Valen_Gayone",
                    "index": "#3",
                    "likes": "2",
                    "time": "25/07/2022-11:53:15",
                    "content": "Muchas gracias por la traducción  @joserjimz y @Sebix !! gran trabajo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#4",
                    "likes": "0",
                    "time": "25/07/2022-16:19:24",
                    "content": "Gran trabajo como siempre. Me encanta el relevo semanal. Me ayuda a ponerme al día con todo lo que está pasando. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#5",
                    "likes": "0",
                    "time": "27/07/2022-20:54:10",
                    "content": "Buen trabajo @Joserjimz! Gracias por la traducción.     Joserjimz:  En una Petición de Senal posteada en el Foro, el Delegado Reconocido Hasu solicito un ‘reinicio’ de las métricas de delegación personal. El motivo de la solicitud se debe a una confusión que se presento en torno a las funciones, responsabilidades y compromisos esperados de un Delegado Reconocido. Para resumir la propuesta:  Hasu originalmente se unió sin la intención de trabajar como un Delegado asalariado, sino con la intención de ser un activista de plataforma; sin embargo, este trabajo comenzó a consumir cada vez mas de su tiempo. Hasu argumenta que bajo el sistema de participación actual, le tomaría años alcanzar las métricas requeridas para ser un delegado asalariado y solicita “reiniciar” una sola vez las métricas de participación personal.  La encuesta se mantendrá activa aqui, hasta el 23 de julio.   Me pareció interesante esta propuesta hecha por @Hasu, me gustaría saber qué opinas si es que tienes una postura! Saludos ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-reset-delegation-metrics-for-hasu/16533"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
            "title": "Relay Semanal | 21 - 27 de Junio del 2022 ",
            "index": 16272,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "7",
                    "time": "01/07/2022-19:24:28",
                    "content": " 2585×580 166 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu para obligatoria para estar al día con todas las actualizaciones de MakerDAO.  Versión Online en PDF    Eventos Actuales   Canal de Discord del Plan Endgame @rune, el cofundador de MakerDAO, ha creado un Canal en Discord dedicado a la discusión en torno al Plan Endgame y al diseño de un futuro estado para MakerDAO que sea inmutable, mejorando las dinámicas de la Gobernanza y haciendo que los holders de MKR se involucren más en el proceso, en conjunto con otras metas planteadas para lograr el éxito.  Inscríbete aquí para unirte a la discusión. Para ponerte al día con el Plan Endgame, puedes consultar los posts originales de Rune y nuestros resúmenes sobre el tema:   Parte 1 y 2  Resumen    Parte 3  Resumen    Parte 4  Resumen    Comité de Votación Descentralizado  Resumen    @LongForWisdom también publicó un resumen de la Parte 1 y la Parte 2, donde se abordan temas como la estructura y los objetivos del Plan Endgame, junto con un índice bastante útil.  Debates y Recursos sobre la Votación por Orden de Preferencia Fallo en la visualización de resultados de la votación por ranking @lyt de la Core Unit de Finanzas Estratégicas publicó un post señalando un problema con la forma en que los resultados de la votación por ranking son mostrados en el Portal de Votación de Gobernanza de Maker. Viendo la encuesta de la MIP40c3-SP69 que terminó recientemente sobre la ratificación del Presupuesto de la Core Unit de Finanzas Estratégicas, @lyt señala que la opción de “Aprobar el aumento del presupuesto” parece estar muy por detrás de la opción de “Solo aprobar el presupuesto existente (como de costumbre)”, en términos de respaldo de MKR, lo que podría desanimar a los votantes al momento de escoger una opción que parece estar perdiendo.  920×291 30.1 KB  Sin embargo, la realidad es que debido a la naturaleza de la votación por ranking, la carrera estaba más reñida de lo que parecía. Si la opción de “Solo aprobar el presupuesto existente” no ha alcanzado el umbral de >50%, cualquier MKR que respalde la opción “Abstenerse” y (si ninguna de las principales opciones había alcanzado el umbral del 50%) la opción “Rechazar el presupuesto” se redistribuiría a las opciones de “Solo aprobar el presupuesto existente” y “Aprobar el aumento del presupuesto”, en función de los votos de segundo rango de los votantes. @lyt hace un llamado a investigar formas de mostrar las votaciones rankeadas en el Portal de Votación de la Gobernanza de Maker, para que representen mejor que tan cercano (o distante) está el voto. @Patrick_J comento que se pondrá en contacto con el equipo de DUX en breve para presentar las críticas de @lyt. Resultados de la Encuesta sobre el Criterio de Prioridad Hacia el final de la llamada de Gobernanza y Riesgo de la semana pasada, @prose11 proporcionó información sobre el desglose actual de las encuestas de Criterio de Prioridad abiertas sobre el Despliegue de Recursos Técnicos y la Clase de Colateral. Estas encuestas harán que sea más fácil para GovAlpha elaborar un marco de prioridades para asegurar que MakerDAO y sus Core Units enfoquen su energía en los lugares correctos.      Despliegue de Recursos Técnicos  921×387 38.9 KB  Clase de Colateral  921×387 43 KB  @tadeo de la Core Unit de Data Insights también mostró una herramienta para explorar y simular votaciones rankeadas de Maker.  1782×579 145 KB   Esta Semana en la Gobernanza   Actualización Semanal de MIPs #93  Encuestas de Ratificación, propuestas y discusiones pre-MIPs.  Votación(es) Ejecutiva(s) Las Votaciones Ejecutivas de esta semana siguen en el portal, a la espera de participación. Puedes votar hasta el 22 de julio del 2022 a las 14:18 UTC. Transferencias de Derechos de MKR - 22 de Junio del 2022  Transferencia de MKR a DECO-001 Si esta propuesta ejecutiva es aprobada, los siguientes cambios se llevarán a cabo en el Protocolo de Maker: De acuerdo con la propuesta de asignación de MKR, 500 MKR serán transferidos a la wallet del auditor de la Core Unit de Deco Fixed Rate (DECO-001).  Transferencia de MKR a RWF-001 De acuerdo con la propuesta de asignación de MKR, 152 MKR serán transferidos a la wallet del auditor de la Core Unit de Finanzas del Mundo Real (RWF-001). Ten en cuenta que la cantidad difiere de la propuesta original debido a los cambios de personal dentro de la Core Unit de Finanzas del Mundo Real. Nótese que la dirección de distribución también ha sido modificada para mantener la coherencia con la implementación presupuestaria descrita en la propuesta del Presupuesto de DAI de la Core Unit de Finanzas del Mundo Real.  Encuestas de Gobernanza A diferencia de la proliferación que hubo la semana pasada, hasta el momento, esta semana ha estado más tranquila:     Nombre de la Encuesta Debate Fecha de Inicio Fecha de Cierre     Asignación de Activos para la MIP65 (Clydesdale) Debate 27 de junio del 2022 a las 16:00 UTC 30 de junio del 2022 a las 16:00 UTC     Encuestas de Criterio de Prioridad Aún quedan seis días para votar en las dos encuestas de criterio de prioridad activas:     Criterio de Prioridad Desglose de la Votación Fecha de Inicio Fecha de Cierre     Despliegue de Recursos Técnicos  Actualmente852×774 24.5 KB  6 de junio del 2022 a las 20:00 UTC 4 de julio del 2022 a las 20:00 UTC   Clase de Colateral  Actualmente852×606 21.5 KB  6 de junio del 2022 a las 20:00 UTC 4 de julio del 2022 a las 20:00 UTC     Encuestas del Visto Bueno de la Comunidad ¿Quieres más encuestas? ¿Sí? ¡Pues no hay Encuestas del Visto Bueno de la comunidad para tí!    Encuestas Recientemente Finalizadas Once encuestas de ratificación finalizaron el lunes 27 de junio:     Nombre de la Encuesta Debate Fecha de Inicio Fecha de Cierre Opción Ganadora     Encuesta de Ratificación de Presupuesto para Modificar el Presupuesto de la Core Unit de Crecimiento, GRO-001 (MIP40c3-SP70) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 Aprobar el aumento del presupuesto (BearMarket)   Encuesta de Ratificación Presupuestaria para Modificar el Presupuesto de la Core Unit de Finanzas Estratégicas, SF-001  (MIP40c3-SP69) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 Aprobar solamente el presupuesto existente (como de costumbre)   Encuesta de Ratificación para Incorporar el Equipo de Trabajo de Growth (MIP75c3-SP1) Debate 14 de junio del 2022 a las 16:49 UTC 27 de junio del 2022 a las 16:00 Rechazar el Equipo de Trabajo   Encuesta de Ratificación para las Enmiendas de la MIP16 (MIP4c2-SP20) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 UTC Si   Encuesta de Ratificación para Operaciones de Mercado Abierto sin Autorización (MIP74) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 UTC Sí   Encuesta de Ratificación para Incorporar/Enmendar la Red Keep3r(MIP63c4-SP4) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 Sí   Encuesta de Ratificación de Incorporación de Facilitador a DIN-001 - @tadeo (MIP41c4-SP35) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 UTC Sí++   Encuesta de Ratificación de Incorporación de Facilitador a IS-001 - @psychonaut (MIP41c4-SP34) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 UTC No   Encuesta de Ratificación para Incorporar la Core Unit de Lending Oversight (LOVE-001) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 UTC No   Encuesta de Ratificación para los Equipos de Trabajo (MIP75) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 UTC No   Encuesta de Ratificación para Añadir un Fondo con Fines Especiales - Makershire Hathaway (MIP55c3-SP4) Debate 13 de junio del 2022 a las 16:00 UTC 27 de junio del 2022 a las 16:00 UTC No     Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:   Comité de Votación Descentralizado Abierto | 22 de Junio del 2022   Foro | Video     Comité de Votación Descentralizado Abierto | 23 de junio del June 2022   Foro | Video     Gobernanza y Riesgo | Ep. 196   Foro | Video     Focus On # 12: Centrifuge Indenture Trust Agreement Deep Dive | 28 de junio a las 15:00 UTC   Foro | Próximamente video     Futuras Llamadas:   Space de Twitter: Drama de la Gobernanza de MakerDAO por Chris Blec - Únete al Space en Twitter | 28 de junio a las 19:00 UTC   Llamada de Gobernanza y Riesgo - Link para unirse | Agenda | 30 de junio a las 19:00 UTC   Gobernanza desde los Primeros Principios: Construyendo una Stablecoin Resiliente, Descentralizada e Incensurable - Foro | Link para unirse | 30 de junio del 17:00 UTC   Comité de Votación Descentralizado Abierto | Foro | Link para unirse - 29 de junio a las 15:00 UTC     Horario de Oficina de las Core Units   Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Crecimiento - Miércoles a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | Capital 6S - Cada dos Miércoles a las 14:00 UTC    MIPs, Enlaces, y Recursos  MakerBurn Consulta el sitio para ver los tipos de Vaults actuales y sus parámetros. Foro y Discord de Maker Discusiones y debates sobre MakerDAO… Calendario de llamadas | Calendario de Votaciones y Eventos Suscríbete a ambos para estar al día con todas las llamadas públicas, las votaciones y otros recordatorios. Herramientas de Participación Biblioteca de links valiosos para stakeholders: análisis de protocolos, análisis de DAI, métricas de colaterales y liquidación, historial de gobernanza y datos de subastas. Portal de Gobernanza Tablero de Votación para los votantes de MKR. Portal de MIPs Tablero de MIPs para todos. Portal de Aprendizaje y Documentación Técnica Aprende más sobre el Protocolo de Maker.   ¿Tienes algún Feedback?  Tenemos algunas nuevas ideas para mejorar y apreciamos tu retroalimentación para lograr que el Relay Semanal sea una publicación más disfrutable. Descargo de Responsabilidad: esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de asesoramiento financiero ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación…  Créditos @nothsa, @Sol_Invictus y @Artem_Gordon  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix. ",
                    "links": [
                        "https://discord.com/invite/BvYahVmxKU",
                        "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2/15456",
                        "https://discord.com/invite/BvYahVmxKU",
                        "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2/15456",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-26-june-01-2022/15569",
                        "https://forum.makerdao.com/t/the-endgame-plan-part-3-the-endgame-decentralized-workforce/15737",
                        "https://forum.makerdao.com/t/weekly-relay-june-7-13-2022/15818",
                        "https://forum.makerdao.com/t/endgame-plan-4-understanding-metadaos/15974",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-16-22-2022/15999",
                        "https://forum.makerdao.com/t/decentralized-voter-committee-on-tuesday-5pm-cest-all-mkr-holders-welcome/15166",
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
                        "https://forum.makerdao.com/t/endgame-summary-part-1/16018",
                        "https://forum.makerdao.com/t/endgame-summary-part-2/16019",
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/flaw-in-the-display-of-ranked-choice-voting-outcomes/16044",
                        "https://forum.makerdao.com/t/flaw-in-the-display-of-ranked-choice-voting-outcomes/16044",
                        "https://vote.makerdao.com/",
                        "https://vote.makerdao.com/polling/QmVMc78Z#vote-breakdown",
                        "https://ballotpedia.org/Ranked-choice_voting_(RCV)",
                        "https://youtu.be/ysP-orYyapk?t=2980",
                        "https://forum.makerdao.com/t/prioritization-in-makerdao/10261",
                        "https://www.youtube.com/watch?v=ysP-orYyapk",
                        "https://ranked-polls.herokuapp.com/",
                        "https://forum.makerdao.com/t/weekly-mips-update-93/16129",
                        "https://vote.makerdao.com/executive/template-executive-vote-mkr-vesting-transfers-june-22-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP36",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP23",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP38",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP1",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP61",
                        "https://vote.makerdao.com/polling/QmSFpVXH",
                        "https://forum.makerdao.com/t/signal-request-asset-allocation-of-mip65-clydesdale/15922",
                        "https://vote.makerdao.com/polling/QmYqBhDx",
                        "https://vote.makerdao.com/polling/QmdZezCr",
                        "https://vote.makerdao.com/polling/QmdMkg2N",
                        "https://forum.makerdao.com/t/mip40c3-sp70-modify-growth-core-unit-budget-gro-001/15102",
                        "https://vote.makerdao.com/polling/QmVMc78Z",
                        "https://forum.makerdao.com/t/mip40c3-sp69-modify-core-unit-budget-strategic-finance-sf-001/15090",
                        "https://vote.makerdao.com/polling/Qmbs5Kx5",
                        "https://forum.makerdao.com/t/mip75c3-sp1-onboard-task-force-growth-task-force/15094",
                        "https://vote.makerdao.com/polling/Qmerh2xJ",
                        "https://forum.makerdao.com/t/mip4c2-sp20-mip16-amendments/14980",
                        "https://vote.makerdao.com/polling/QmaivXCv",
                        "https://forum.makerdao.com/t/mip74-permissionless-open-market-operations/15095",
                        "https://vote.makerdao.com/polling/QmXbgVGz",
                        "https://forum.makerdao.com/t/mip63c4-sp4-onboard-amend-keeper-network-keep3r-network/14321",
                        "https://vote.makerdao.com/polling/QmWhsLCU",
                        "https://forum.makerdao.com/t/mip41c4-sp35-facilitator-onboarding-din-001/14948",
                        "https://vote.makerdao.com/polling/QmaR6q4L",
                        "https://forum.makerdao.com/t/mip41c4-sp34-immunefi-security-core-unit-facilitator-onboarding-is-001/14610",
                        "https://vote.makerdao.com/polling/QmWYajMq",
                        "https://forum.makerdao.com/t/mip39c2-sp33-adding-lending-oversight-core-unit-love-001/15098",
                        "https://vote.makerdao.com/polling/QmTRtpp3",
                        "https://forum.makerdao.com/t/mip75-task-forces/15093",
                        "https://vote.makerdao.com/polling/QmZjU2pG",
                        "https://forum.makerdao.com/t/mip55c3-sp4-adding-a-special-purpose-fund-makershire-hathaway/14643",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-endgame-party-calls-everyone-welcome/15977",
                        "https://www.youtube.com/watch?v=YVPamJ3Cxkc",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-endgame-party-calls-everyone-welcome/15977",
                        "https://www.youtube.com/watch?v=nUeisgkh9tg",
                        "https://forum.makerdao.com/t/governance-and-risk-196-thursday-june-23-at-17-00-utc/15998",
                        "https://youtu.be/ysP-orYyapk",
                        "https://forum.makerdao.com/t/rescheduled-focus-on-12-centrifuge-indenture-trust-agreement-deep-dive/15262",
                        "https://www.google.com/url?q=https://twitter.com/ChrisBlec/status/1541783523899613184&sa=D&source=calendar&ust=1656861736351405&usg=AOvVaw1RQBCce6RZ04rajhRvUMvC",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://forum.makerdao.com/t/kickoff-governance-from-first-principles-building-a-resilient-decentralized-and-uncensorable-stablecoin/15978",
                        "https://us02web.zoom.us/j/87509546870",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-startup-phase-wednesdays-5pm-cest-all-mkr-holders-welcome/15330",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/81436458345&sa=D&source=calendar&ust=1654445893399659&usg=AOvVaw0-CBSXWDpRLmmAO6XGLV0G",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.653846153846153
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Muzza",
                    "index": "#2",
                    "likes": "4",
                    "time": "01/07/2022-19:49:52",
                    "content": "Excelente trabajo Jose!. Lastima que no hay mas encuestas me quede con ganas de mas  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "3",
                    "time": "02/07/2022-18:31:22",
                    "content": "Y eso que esta a mi parecer ha sido de las semanas mas movidas en el foro, jajaja. gran trabajo jose! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#4",
                    "likes": "2",
                    "time": "03/07/2022-19:15:08",
                    "content": "Gran trabajo chicos/as!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
            "title": "Relay Semanal | 26 de Julio - 01 de Agosto del 2022 ",
            "index": 17049,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "7",
                    "time": "06/08/2022-00:18:46",
                    "content": " 2585×572 117 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu parada obligatoria para estar al día con todas las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus y @Artem_Gordon  Versión Online en PDF    EVENTOS ACTUALES   MIP-6 Declaración de Intenciones – Invertir en bonos a corto plazo – Propuesta de implantación  @backed-finance presentó una solicitud de Incorporación de Colateral, bonos del Tesoro tokenizados a corto plazo, bajo la ley Suiza. La propuesta apunta a la MIP13c3-SP12, la cual ratifico una “Declaración de Intenciones” para que la DAO invierta en dichos bonos. Bajo los términos propuestos, Backed Finance crearía “valores en cadena respaldados 1:1 sin necesidad de permisos, con un ETF de bonos a corto plazo subyacente” que se mantendría en un custodio seguro de terceros en Suiza. Los participantes del mercado venderían entonces estos bonos tokenizados a la DAO. El concepto preliminar (sujeto a RFC) utilizaría una “implementación modificada del PSM”, incentivando a los participantes del mercado a vender ETFs tokenizados a cambio de DAI recién acuñados. Según la MIP, todas las transacciones serían líquidas, no requerirían permisos ni una gestión activa ni KYC por parte del protocolo.  Resumen del Activo Propuesto ⮛  Token: Backed iShares $ Treasury Bond 1-3yr UCTIS ETF (Acumulando) Dirección del Contrato: 0x9ABB4E7f4ee96cA58F156338640aEd031188E5E1   Su filial, Backed Assets, tokenizaría los valores IBTA (bonos del Tesoro denominados en USD) en la cadena Ethereum, otorgando al protocolo acceso a los ingresos pasivos de una “forma totalmente libre de permisos”. El token es un ERC-20, que da derecho a sus poseedores a canjearlo por dinero fiduciario a través del emisor en cualquier momento (durante el horario comercial estándar). El token es una nueva emisión y comenzaría con un suministro en circulación on-chain de cero. Ya que el activo es un ERC-20, las transacciones también se liquidarían on-chain.  Nota: Como el fundamento es la seguridad convencional, se basa intrínsecamente en un sistema de confianza que funciona de la siguiente forma: El capital subyacente se adquiere a través de un agente de bolsa y se deposita en una cuenta de custodia. Esta cuenta de custodia es supervisada por un tercero no relacionado (denominado “Agente de Valores”), que tiene la autoridad para “bloquear la cuenta y liquidar los activos para devolver a los holders el valor de su inversión.”  Custodio Actual: ISP Securities AG, Zurich, Suiza Agente de Seguridad Actual: Servicios de Agentes de Seguridad AG, Baarerstrasse 75, 6300 Zug, Suiza.   Resumen de los Casos de Uso Propuestos ⮛  El DAI generado a través de esta vault seria distribuido a sus depositantes con un ligero margen Siguiendo las actualizaciones de los precios de oráculos, “el cambio de precio debería acunar nuevo DAI directamente en el buffer de excedentes”. El Techo de Deuda de la vault seria calculado como un porcentaje de los holdings en stablecoins de la DAO para permitir que el volumen se desplace hacia el token ETF propuesto. Backed Finance propone un Techo de Deuda inicial de $50M.   Dado el potencial de la propuesta, se ha generado bastante debate al respecto. Si quieres opinar o seguir el debate, puedes encontrar el post aquí.   Participación y Compensación de los Delegados  Cuatro propuestas enfocadas en la delegación llegaron al Foro la semana pasada. El Facilitador de GovAlpha, @Patrick_J, posteo tres marcos para definir y agilizar el proceso de participación y compensación de los Delegados. El cuarto, a través de @GFXlabs, propone un periodo de enmienda para las métricas de participación de los Delegados Reconocidos. La MIP-77: Delegados en el Protocolo de Maker busca establecer una definición de referencia del rol del Delegado Reconocido y proporcionar un marco o “MIP Fundacional” sobre el cual se pueden implementar futuras iteraciones.  Resumen de Roles y Responsabilidades ⮛ Según la propuesta, el rol de un Delegado Reconocido puede dividirse en dos partes:   Expresar una opinión sobre los procesos de Gobernanza on-chain mediante la emisión de votos regulares. Comunicar sus decisiones de voto y la justificación de las mismas.   Además, los Delegados Reconocidos pueden asumir otras funciones y responsabilidades que consideren oportunas.  Resumen de las Métricas de Participación y Comunicación ⮛ Los Delegados Reconocidos deben votar en las Propuestas Ejecutivas o manifestar su oposición en un plazo de 72 horas desde su publicación. El hecho de no votar en una Propuesta Ejecutiva no se contará en las métricas de participación de un Delegado Reconocido si se proporciona una razón sólida para dicha ausencia (según la evaluación de los Facilitadores de Gobernanza). Además, se espera que los Delegados Reconocidos comuniquen su voto en un plazo de siete días a partir de la conclusión de una Encuesta de Gobernanza.  Resumen del Restablecimiento de las Métricas de los Delegados Reconocidos ⮛ Bajo el marco propuesto, un Delegado Reconocido podría solicitar un reajuste de sus métricas de seguimiento si lo aprueba la mayoría de los Facilitadores de Gobernanza. Si es aprobado, un Delegado Reconocido puede escoger cualquier fecha dentro de los tres últimos meses como la nueva “fecha de inicio” para el seguimiento de las métricas personales. Esta solicitud solo se puede hacer una vez al año. La MIP-78: Compensación en DAI de los Delegados Reconocidos-+ busca definir los procesos de la DAO para otorgar la compensación de DAI a los Delegados Reconocidos. El Protocolo de Maker compensa a los Delegados Reconocidos para incentivar su participación en el sistema de gobernanza. A cambio, el Protocolo recibe un grupo diverso de individuos capaces y motivados a estudiar propuestas, emitir votos y comunicar los razonamientos detrás de sus votaciones en el foro.  Resumen de las Objetivos propuestos por la MIP-78 ⮛  La compensación en DAI debería correlacionarse positivamente con el peso de la votación. La compensación de un Delegado Reconocido debería ser independiente de la compensación de otro Delegado. Esta compensación se inclinaría positivamente hacia los Delegados Reconocidos con menor peso de voto para fomentar el reclutamiento de nuevos Delegados Reconocidos. Debe imponerse un límite a la compensación máxima de DAI que puede recibir un solo delegado. Los Delegados Reconocidos con grandes pesos de votación deberían recibir suficiente compensación Los Delegados reconocidos con un alto peso en las votaciones deberían recibir una compensación suficiente por tener la opción de contratar a un asistente(s). El sistema debería permitir y compensar adecuadamente a los Delegados Reconocidos que actúan como parte de un equipo o grupo.   Parámetros Iniciales en Caso de Ratificación ⮛  La MIP-79: Compensación en MKR de los Delegados Reconocidos comparte un objetivo similar al de la anterior pero está orientado al crecimiento y la retención de los Delegados Reconocidos talentosos. El sistema propuesto pretende fomentar una mentalidad “a largo plazo” que alinee más plenamente a los Delegados Reconocidos con los holders de MKR que delegan en ellos. Si la MIP es aprobada, se distribuirá MKR a los Delegados Reconocidos mediante DssVest a una dirección de su elección. Las distribuciones deben tener una duración de doce meses y una fecha límite de doce meses. Los Facilitadores de Gobernanza postearán la cantidad de MKR que serán distribuidos, las fechas de distribución y fechas límite en el Foro de la Gobernanza Maker antes de la Votación Ejecutiva correspondiente.  ¿Cómo se calcularía la adquisición de derechos? ⮛  \"Una vez que un Delegado Reconocido ha estado activo durante seis meses, en efecto, seis meses desde que completó los pasos para convertirse en Delegado Reconocido definidos en la MIP77c2 y recibió sus primeros tokens MKR delegados, los Facilitadores de la Gobernanza calcularán la compensación total en DAI que el Delegado Reconocido ha recibido en ese tiempo. Este valor se dividirá por el precio medio móvil de 12 meses del token MKR en DAI. Esto calculará la cantidad de MKR a la que tiene derecho el Delegado Reconocido.\"  La MIP4c2-SP24: Modificar el Periodo de Medición de las Métricas de Participación de los Delegados propone modificar el bucle de retroalimentación de la participación del delegado, lo que es una variable clave en el cálculo de su compensación. Si es aprobada, la propuesta modificaría el lenguaje ratificado en la MIP61c2. Puedes consultar las modificaciones propuestas aqui.   Aclaraciones sobre mi opinión acerca de LOVE vs. MetaDAO y un diagrama de votación de aprobación  El cofundador de MakerDAO, @nikolai, aclara su visión sobre las propuestas de LOVE y MetaDAO. En resumen: “No estoy a favor de la propuesta de MetaDAO como tampoco estoy a favor de la propuesta de LOVE.” Nikolai cree que la Gobernanza de Maker está dividida en gran medida por el medio, lo que da lugar a una votación polémica tras otra y a una lista de Delegados que carece de un amplio apoyo debido al actual sistema de votación por mayoría simple. El sostiene que antes de realizar cualquier cambio severo en el sistema de gobernanza, Maker necesita abordar esta situación “disfuncional” de la gobernanza, reduciendo la complejidad y aclarando el funcionamiento del actual sistema de votación.   Conoce Tu Delegado #17  La llamada publica #17 de “Conoce Tu Delegado” tendrá lugar este Miércoles a la 1 pm UTC. Para esta sesión, el Candidato a Delegado, @CodeKnight presentará su plataforma y responderá las preguntas de la audiencia. Continuando con el episodio anterior, @pvl estará presentando el Q&A (consulta esta platforma y las diapositivas de la última llamada). Zoom ID de la Reunión: 823 9827 1372 Código: MYD17  Gastos Reales de MakerDAO vs Presupuesto - Junio del 2022  La Core Unit de Finanzas Estratégicas (SF) lanzo el Informe de Gastos Reales vs. Presupuesto de Junio. Lo más destacado es:  Los gastos de DAI reportados fueron de 2,9 millones en mayo, 0,6 millones menos de lo previsto. Se prevé que los gastos se estabilicen en torno a los 3,2 millones el mes en julio, lo que supone un ritmo anual de 40 millones (ligeramente inferior al previsto en abril). SF ha iniciado un trabajo proactivo en torno a la reducción de las tasas de quema para mitigar el impacto del mercado bajista en el protocolo (sigue la etiqueta bear-prep en los foros para encontrar estas iniciativas).    Lo que ocurre cuando envías 1 DAI  Este post del blog no proviene del foro, pero es demasiado valioso como para no compartirlo. Aprende cómo funcionan las transacciones de DAI a nivel de tuercas y tornillos, hasta cómo se ejecuta la transacción en la Ethereum Virtual Machine (“Máquina Virtual de Ethereum”).  Esta pieza es un poco técnica pero los conceptos son bien explicados y proporciona abundante material de referencia para llenar cualquier laguna de conocimiento.   Esta Semana en Gobernanza  Actualización Semanal de MIPs #98  Encuestas de Ratificación, propuestas y discusiones pre-MIP.   Votación(es) Ejecutiva(s) Incorporando Vaults de Activos del Mundo Real – Posteado el 29 de Julio del 2022. Expira el 28 de Agosto del 2022 a las 13:55 UTC. Si esta propuesta ejecutiva es aprobada, se presentarán las siguientes incorporaciones en el Protocolo Maker:  Societe Generale – Forge (OFH) será incorporado como un nuevo tipo de vault, RWA-008. El Banco de Huntingdon Valley (HVBank) será incorporado como un nuevo tipo de vault, RWA-009.  Si esta propuesta ejecutiva es aprobada, se llevarán a cabo los siguientes cambios en el Protocolo Maker:   Modificaciones de las cartas de acuerdo entre la Fundación RWA y varios partidos para la construcción legal de RWA-009 (HVBank). 25 millones de DAI se extraerán en la vault RWA-009 (HVBank).    Consulta los siguientes hilos del foro que contienen información sobre RWA-008 (OFH) y RWA-009 (HVBank) para informarte antes de votar:   RWA-008 (OFH)   Solicitud Inicial de Colateral Evaluación de Riesgo de la Core Unit de Finanzas del Mundo Real Evaluación Adicional de Riesgo - LOVE Evaluación de la Core Unit de Ingeniería de Servicios Colaterales Evaluación de la Core Unit de Oraculos Documentación de Transacción SocGen Propuesta del Comité de Delegados     RWA-009 (HVBank)   Solicitud Inicial de Colateral Evaluación de Riesgo de la Core Unit de Finanzas del Mundo Real Evaluación Adicional de Riesgo - LOVE Evaluación de la Core Unit de Ingeniería de Servicios Colaterales Evaluación de la Core Unit de Oraculos Documentación de Transacción HVB Fundación RWA Propuesta del Comité de Delegados      Encuestas     Nombre de la Encuesta Debate Fecha de Inicio Fecha de Cierre     PPG - Propuesta del Comité de Mercado Abierto Debate 1 de Agosto del 2022 a las 16:00 UTC 4 de Agosto del 2022 a las 16:00 UTC   Despliegue del Teleport de Maker en Starknet y Parámetros de Riesgo Asociados Debate 1 de Agosto del 2022 a las 16:00 UTC 4 de Agosto del 2022 a las 16:00 UTC   Proceso de Reasignación Táctica para el Ajuste Presupuestario Debate 1 de Agosto del 2022 a las 16:00 UTC 4 de Agosto del 2022 a las 16:00 UTC      Aclaración de la Encuesta sobre Gobernanza 2022-08-02    Consulta la agenda de GovAlpha sobre el Proceso de Reasignación Táctica para Ajustes Presupuestarios. También puedes leer una breve discusión sobre lo ocurrido en la Plataforma de Delegado de Schuppi.    Encuestas del Visto Bueno de la Comunidad     Encuesta Desglose de Votos Fecha de Inicio Fecha de Cierre     MIP9 Encuesta del Visto Bueno de la Comunidad: MIP9 - Pando (Activos Climáticos de Nivel de Inversión de Pando)  1 de Agosto del 2022 a las 16:00 UTC 15 de Agosto del 2022 a las 16:00 UTC     Encuestas Finalizadas     Encuesta Desglose de Votos Fecha de Cierre     Encuesta del Visto Bueno de la Comunidad - bIBTA (ETF de Bonos a Corto Plazo con Respaldo Financiero)  1 de Agosto del 2022 a las 16:00 UTC      Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:  Conoce Tu Delegado #16 - ft. pvl | Foro | Parte 1  Comité de Votación Descentralizado Abierto | Foro | Grabación  Horario de Oficina de los Delegados | Discord | Grabación  Gobernanza y Riesgo - Ep. 201 | Foro | Grabación   Llamadas Recientes:  Conoce Tu Delegado #17 - ft. CodeKnight & pvl | Foro | Link para unirse | Comité de Votación Descentralizado Abierto | Link para unirse | Horario de Oficina de los Delegados | Foro | Link para unirse | Gobernanza y Riesgo - Ep. 202 | Foro | Link para unirse | Comité de Votación Descentralizado Abierto | Link para unirse |    Horario de Oficina de las Core Units    Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC | Alternativa: Link para unirse - Cada dos Miércoles a las 15:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Growth - Primer Miércoles de Cada Mes a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | Capital 6S - Cada dos Miércoles a las 14:00 UTC    Recursos  Abrir Lista  Todos los Paneles Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Rastreador del Panel de Gobernanza | Versión Google Sheet   Conoce tu Índice MIP   Portal de Aprendizaje y Documentación Técnica   Servidor de Discord de MakerDAO   MakerBurn   Lista de los Horarios de Oficina   Herramientas de Participacion   Calendario de Votación y Fechas Importantes    Descargo de Responsabilidad Esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de ser asesoramiento financiero, ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación.  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip-6-declaration-of-intent-invest-in-short-term-bonds-proposal-for-implementation/16185",
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "https://etherscan.io/address/0x9abb4e7f4ee96ca58f156338640aed031188e5e1",
                        "https://forum.makerdao.com/t/mip-6-declaration-of-intent-invest-in-short-term-bonds-proposal-for-implementation/16185/2",
                        "https://forum.makerdao.com/t/mip77-delegates-in-the-maker-protocol/16905",
                        "https://forum.makerdao.com/t/mip78-recognized-delegate-dai-compensation/16906",
                        "https://forum.makerdao.com/t/mip79-recognized-delegate-mkr-compensation/16907/12",
                        "https://forum.makerdao.com/t/mip77-delegates-in-the-maker-protocol/16905#mip77c2-becoming-a-recognized-delegate-11",
                        "https://forum.makerdao.com/t/mip4c2-sp24-amend-measurement-period-for-delegate-participation-metrics/16904",
                        "https://mips.makerdao.com/mips/details/MIP61#a-solution",
                        "https://forum.makerdao.com/t/mip4c2-sp24-amend-measurement-period-for-delegate-participation-metrics/16904#changes-6",
                        "https://forum.makerdao.com/t/clarifications-about-my-take-on-love-vs-metadao-and-a-diagram-of-approval-voting/16920",
                        "https://forum.makerdao.com/t/meet-your-delegate-17/16932",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022",
                        "https://readymag.com/u1204790250/3792132/",
                        "https://us02web.zoom.us/j/82398271372?pwd=Z2ZGNjExb0JVcEk3Sk4ybGZJRjR0Zz09",
                        "https://forum.makerdao.com/t/makerdao-actual-expenses-vs-budget-june-2022/16912",
                        "https://docs.google.com/spreadsheets/d/17QHwAjmuh2ebZZgZpyg4QjIiboDzlYu0/edit#gid=317074082",
                        "https://www.notonlyowner.com/learn/what-happens-when-you-send-one-dai",
                        "https://forum.makerdao.com/t/weekly-mips-update-98/16940",
                        "https://vote.makerdao.com/executive/template-executive-vote-onboarding-real-world-asset-vaults-july-29-2022",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-transaction-documents-on-permaweb/16264/8",
                        "https://forum.makerdao.com/t/security-tokens-refinancing-mip6-application-for-ofh-tokens/10605",
                        "https://forum.makerdao.com/t/sg-forge-socgen-risk-assessment/15638",
                        "https://forum.makerdao.com/t/sg-forge-socgen-risk-assessment/15638/14",
                        "https://forum.makerdao.com/t/rwa008-ofh-mip21-token-ces-domain-team-assessment/15239",
                        "https://forum.makerdao.com/t/rwa-008-ofh-collateral-onboarding-oracle-assessment/15268",
                        "https://api.ipfsbrowser.com/ipfs/get.php?hash=QmW1UBVjPtHDo42oNzG2vspwggyeBfENS1xsPtpKLyDBvb",
                        "https://forum.makerdao.com/t/real-world-finance-decision-making-and-delegated-committee-proposal/15276",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-rwa-collateral-onboarding-risk-assessment/15828/1",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-additional-risk-assessment-love-cu-in-incubation/15886",
                        "https://forum.makerdao.com/t/rwa009-hvbank-mip21-token-ces-domain-team-assessment/15861",
                        "https://forum.makerdao.com/t/rwa009-huntingdon-valley-bank-collateral-onboarding-oracle-assessment/16069/1",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-transaction-documents-on-permaweb/16264",
                        "https://forum.makerdao.com/t/rwa-foundation-hvb-disclosure/16267",
                        "https://forum.makerdao.com/t/real-world-finance-decision-making-and-delegated-committee-proposal/15276",
                        "https://vote.makerdao.com/polling/QmfMRfE4",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-july-2022/16895",
                        "https://vote.makerdao.com/polling/QmZxRgvG",
                        "https://forum.makerdao.com/t/request-to-poll-for-maker-teleport-deployment-on-starknet-and-associated-risk-parameters/16844",
                        "https://vote.makerdao.com/polling/QmRLsRRA",
                        "https://forum.makerdao.com/t/signal-request-budget-re-allocation-core-unit-accountability-framework/16788",
                        "https://forum.makerdao.com/t/2022-08-02-governance-poll-clarification/16952",
                        "https://github.com/makerdao/community/pull/1889/files",
                        "https://vote.makerdao.com/polling/QmRLsRRA",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/100#tactical-re-allocation-process-for-budget-adjustmentshttpsvotemakerdaocompollingqmrlsrrapoll-detail-threadhttpsforummakerdaocomtsignal-request-budget-re-allocation-core-unit-accountability-framework16788-2",
                        "https://vote.makerdao.com/polling/QmawHstd",
                        "https://vote.makerdao.com/polling/QmbDbzqW",
                        "https://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqbFVNZUhOUFlveW1lNmVXZ2hIZDkwTFpZM2NDZ3xBQ3Jtc0tuWm9lS2JOQWsyMC1IX2FkcXRFcldOa3o3eXl4aVFsb01HWWlLMnZpVGZEYS01akwwZUtLd0p3ZlVoSVUzVFBMdjdTMjBmRDlScDRieVRkeXo0QnNVcVZ3R1FBZW5id2RQbDRBMUxxMW1yT0RGTFp0RQ&q=https%3A%2F%2Fforum.makerdao.com%2Ft%2Fmeet-your-delegate-16-pvl%2F16206&v=yIHFRJDA7cM",
                        "https://youtu.be/yIHFRJDA7cM",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://www.youtube.com/watch?v=FNe7DNYS6PA",
                        "https://discord.com/channels/893112320329396265/989856974747349112",
                        "https://www.youtube.com/watch?v=LuuqBZcCG_s",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://www.youtube.com/watch?v=ADYHWUbFUKw",
                        "https://forum.makerdao.com/t/meet-your-delegate-17/16932",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/82398271372?pwd%3DZ2ZGNjExb0JVcEk3Sk4ybGZJRjR0Zz09&sa=D&source=calendar&ust=1659880182562101&usg=AOvVaw2msC3KUOeGUer2_N2F1pgF",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/89326394914&sa=D&source=calendar&ust=1659880182562101&usg=AOvVaw3gr4l98ZrvNKq9S7A-Upry",
                        "https://forum.makerdao.com/search?q=Delegate%20Office%20Hours%20%23pubcall-%3A-office-hours",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/88286550832?pwd%3DdWQzQi9tYlNyemJJS2Nrd2NUdTBoZz09&sa=D&source=calendar&ust=1659880182562101&usg=AOvVaw3yTu9eh_VXgy4PmEpGR574",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://zoom.us/j/697074715",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/82286534666&sa=D&source=calendar&ust=1659880182562101&usg=AOvVaw02xxxyHrbSGj_eLBlVZiJQ",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.076388888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/08/2022-15:42:15",
                    "content": " ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-14-20-de-junio-del-2022/16062",
            "title": "Relay Semanal | 14 - 20 de Junio del 2022 ",
            "index": 16062,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#1",
                    "likes": "8",
                    "time": "26/06/2022-11:58:17",
                    "content": " Relay Semanal | 14 - 20 de Junio del 2022  2597×590 174 KB  ¡Hola a todos, gracias por consultar el Relay Semanal! Ya sea que tengas MKR o DAI, que poseas una vault o que te quieras involucrar más en la gobernanza, esta es tu parada obligatoria para estar al día con las actualizaciones de MakerDAO.  Versión Online PDF    Eventos Actuales  MakerDAO Vota por Desactivar el Suministro de DAI de Aave, Reduciendo así la Exposición a Celsius MakerDAO Vota por Desactivar el Suministro de DAI de Aave, Reduciendo así la Exposición a Celsius [Petición de Señal] Fijar el AAVE D3M DC en 0 (Cero) URGENTE: Petición de Señal, Fijar el bar de Aave D3M en 0% Hace seis días, el 14 de junio, GovAlpha envió una Petición de Señal urgente de acuerdo con la MIP24c4 Procedimiento de Respuesta Urgente para desactivar el Módulo de Depósito Directo de Dai (D3M) de Aave, limitando así la exposición de Maker al exchange precariamente posicionado Celsius (consulta el Relay de la semana pasada para tener un panorama de la situación de Celsius/stETH). La comunidad de MakerDAO ha aprobado la propuesta el 15 de junio, y fue ejecutada el 17 de junio.   twitter.com    Maker @MakerDAO  The Maker Governance has voted to temporarily disable the @AaveAave DAI Direct Deposit Module (D3M).  This change is available for execution on June 17 2022 21:03 UTC.  🗳 vote.makerdao.com/executive/temp…   11:34 PM - 15 Jun 2022           35                15            La propuesta fija la Tasa de Préstamo Objetivo, o bar, a 0, previniendo que Celcius tome más préstamos. Celsius ha tomado préstamos por 100 millones de DAI utilizando como colateral el token fuera del peg stETH, mientras que Maker solo obtuvo un APY del 1,4% en ingresos de esta posición. @Primoz y muchos otros miembros de la comunidad discutieron persuasivamente que estos bajos niveles de ingresos no compensan los riesgos. La Core Unit de Riesgo reevaluará la situación y presentará sus opiniones —posiblemente incluyendo una recomendación para volver a habilitar el D3M de Aave— en la siguiente reunión del [Comité de Mercado Abierto de MakerDAO] (MOMC por sus siglas en inglés) en aproximadamente una semana.  El Registro del Partido de Delegados Endgame  El Registro del Partido de Delegados Endgame El Registro de Delegados de Gobernanza  Científica Orientados a Negocios A medida que Rune continúa presidiendo las lamadas del Comité de Votantes Abierto Descentralizado, ha introducido recientemente el Plan Endgame; el mismo tendrá múltiples etapas de votación, incluyendo una Petición de Señal preliminar y la MIP ‘Lanzamiento del Plan Endgame’. Adicionalmente, Rune afirma que será beneficioso y estabilizador obtener una comprensión general del nivel de apoyo para el Plan Endgame. Como resultado, Rune ha posteado un hilo donde los delegados pueden anotarse para ayudar a manejar el Partido Endgame. Sin embargo, se espera que los delegados comprometidos asistan a tantos Comités de Votantes Descentralizados del Partido Endgame como sea posible, que voten en general de acuerdo a las intenciones del mismo y contribuyan con información, ideas y propuestas. Actualmente, los siguientes Delegados Reconocidos se han anotado y comprometido con el Plan Endgame:     Delegado Reconocido Plataforma Posteo de Registro     Doo Nam Plataforma Registro   JustinCase Plataforma Registro   3F Delegate LLC Plataforma Registro   Flipside Crypto Plataforma Registro   Penn Blockchain Plataforma Registro   Feedblack Loops LLC Plataforma Registro    Otros Delegados Reconocidos, como ChrisBlec, Mhonkasalo & teemulau, y MakerMan, han decidido apoyar la visión del Endgame al tiempo que se mantienen independientes para seguir con los valores de sus plataformas y promover la delegación descentralizada. Es más, SebVentures ha postreado su propia plataforma de registro de Delegados para un plan más orientado a los negocios. Su visión es sencilla: mejorar la asignación del balance al invertir en tokens líquidos, prestar contra ellos y promover la creación de mercado.  Esta Semana en la Gobernanza Actualización Semanal de MIPs #92  Votaciones Ejecutivas Deshabilitar Temporalmente el Módulo de Depósito Directo de DAI de Aave (D3M) - 15 de junio del 2022 Esta fue una propuesta ejecutiva fuera de planes. Ha sido desplegada e incorporada al Portal de Votaciones en respuesta a una Petición de Señal Urgente que fue posteada por recomendación del Facilitador de la Core Unit de Riesgo (RISK-001). Esta propuesta ejecutiva fue aprobada y, a según esta Petición de Señal Urgente, ocurrieron los siguientes cambios en el Protocolo de Maker:  La Tasa de Préstamo Objetivo (bar)  del Módulo de Depósito Directo de DAI de Aave (D3M) fue fijada en 0.  Este cambio fue propuesto para deshabilitar el D3M de Aave temporalmente. Ten en cuenta que si bien configurar bar en 0 podría sugerir intuitivamente que el D3M de Aave utilizará todo su Techo de Deuda, es un estado preprogramado en el código D3M que configurará la vault para que solo se relaje.  Más detalles sobre este tema y el origen de esta propuesta se pueden encontrar en los siguientes enlaces:  Recomendación y Análisis de la Core Unit de Riesgo Más análisis de la Core Unit de Riesgo   Encuestas On-Chain  La última semana hubo dos encuestas de Criterio de Prioridad activas. Diez encuestas de Ratificación fueron posteadas el 20 de junio, y una encuesta de Ratificación fue posteada el 21 de junio, lo cual sumariza un total de 13 encuestas on-chain activas.  Encuestas de Ratificación Hay 11 encuestas de Ratificación en las que aún se puede votar:     Nombre de la Encuesta Discusión Fecha de Inicio Fecha de Finalización     Encuesta de Ratificación para Incorporar Facilitadores a IS-001 - psychonaut (MIP41c4-SP34) Discusión 13 de junio de 2022 16:00 UTC 27 de junio de 2022 16:00   Encuesta de Ratificación para Incorporar Facilitadores a DIN-001 - tadeo (MIP41c4-SP35) Discusión 13 de junio de 2022 16:00 UTC 27 de junio de 2022 16:00   Encuesta de Ratificación para Incorporar la Core Unit de Lending Oversight (LOVE-001) Discusión 13 de junio de 2022 16:00 UTC 27 de junio de 2022 16:00   Encuesta de Ratificación para los Equipos de Trabajo (MIP75) Discusión 13 de junio de 2022 16:00 UTC 27 de junio, 2022 16:00   Encuesta de Ratificación para Añadir un Fondo con Fines Especiales - Makershire Hathaway (MIP55c3-SP4) Discusión 13 de junio de 2022 16:00 UTC 27 de junio de 2022 16:00   Encuesta de Ratificación para las Enmiendas de la MIP16 (MIP4c2-SP20) Discusión 13 de junio de 2022 16:00 UTC 27 de junio de 2022 16:00   Encuesta de Ratificación para Operaciones de Mercado Abierto sin Autorización (MIP74) Discusión 13 de junio de 2022 16:00 UTC 27 de junio de 2022 16:00   Encuesta de Ratificación de Presupuesto para Modificar el Presupuesto de la Core Unit de Finanzas Estratégicas, SF-001 (MIP40c3-SP69) Discusión 13 de junio de 2022 16:00 UTC 27 de junio de 2022 16:00   Encuesta de Ratificación para Incorporar/Enmendar la Red Keep3r (MIP63c4-SP4) Discusión 13 de junio de 2022 16:00 UTC 27 de junio de 2022 16:00      Encuestas de Criterio de Prioridad Aún hay bastante tiempo para votar en nuestras dos encuestas de Criterio de Prioridad activas también:     Criterio de Prioridad Desgloce de Votación Fecha de Inicio Fecha de Finalización     Despliegue de Recursos Técnicos  Actualmente852×774 23 KB  06 de junio de 2022 20:00 UTC 04 de julio de 2022 20:00 UTC   Clase de Colateral  Actualmente852×606 21.5 KB  06 de junio de 2022 20:00 UTC 04 de julio de 2022 20:00 UTC      Encuestas de Visto Bueno de la Comunidad: Resultados El No brilla en las últimas encuestas de Visto Bueno:     Encuesta de Visto Bueno Desgloce de Votos Fecha de Finalización     KREDIKA (Kredika LTD)  Ended852×270 7.24 KB  20 de junio de 2022 a las 16:00 UTC   XSGD (StraitsX)  Ended852×270 7.22 KB  20 de junio de 2022 a las 16:00 UTC     Reuniones y Eventos Grabaciones de Llamadas de la Semana Pasada:  Conoce tu MIP | MIP40 (Framework del Presupuesto) Enmiendas | Posteo | Video  Comité de Votantes Abierto Descentralizado | 15 de junio de 2022 | Posteo | Video  Conoce tu Delegado | Ep.15 ft. Governance House | Post | Video  Gobernanza y Riesgo | Ep. 195 | Posteo | Video  Comité de Votantes Abierto Descentralizado | 16 de junio, 2022 | Posteo | Video  Conoce tu MIP (KYM) #12 | Enmienda al Proceso de Desvinculación de Core Units | Foro | Video   Próximas Llamadas:  Twitter Spaces con la Core Unit de Crecimiento!   Twitter Spaces: InstaDapp & Dai | Tweetea y únete - 22 de junio a las 15:00 UTC  Llamadas Recurrentes:  Comité de Votantes Abierto Descentralizado | Foro | Link para Unirse - Wednesdays & Thursdays at 19:00 UTC Llamada de Gobernanza y Riesgo | Link para Unirse | Agenda - Jueves a las 17:00 UTC  Horario de Oficina de las Core Units   Link para Unirse | GovAlpha - Preguntas y Respuestas de la Gobernanza - Lunes 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes 15:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Link para Unirse | Crecimiento - Miércoles 17:00 UTC  Link para Unirse | Finanzas del Mundo Real - Miércoles 17:00 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes 18:00 UTC  Link para Unirse | 6S Capital - Cada dos miércoles 14:00 UTC     MIPs, Links y Recursos Abrir Actualización de MIPs Semanal Encuestas de ratificación, propuestas y discusiones pre-MIP. Foro y Discord de Maker Debates y discusiones de MakerDAO. Calendario de llamadas | Calendario de Votaciones y Eventos Suscríbete a ambos para que estés al día con las llamadas publicas, votaciones y otros recordatorios. Herramientas de Participacion Biblioteca de enlaces útiles para los Stakeholders: análisis del Protocolo, análisis de DAI, métricas de colateral y liquidación, historia de la Gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Documentación Tecnica Aprende más sobre el protocolo de Maker.    ¿Tienes algún Feedback? ¡Valoramos tu opinión! Completa nuestra encuesta para hacernos saber qué se nos está pasando por alto o que podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Créditos @nothsa, @Sol_Invictus y @Artem_Gordon Esta es una traducción libre del artículo original en inglés, gracias a @sebix y @joserjimz. ",
                    "links": [
                        "https://decrypt.co/103150/makerdao-votes-to-disable-aave-dai-supply-reducing-celsius-exposure",
                        "https://forum.makerdao.com/t/signal-request-set-the-aave-d3m-dc-to-0-zero/15775",
                        "https://forum.makerdao.com/t/urgent-signal-request-set-aave-d3m-bar-to-0/15800",
                        "https://mips.makerdao.com/mips/details/MIP24#MIP24c4",
                        "https://forum.makerdao.com/t/weekly-relay-june-7-13-2022/15818",
                        "https://vote.makerdao.com/executive/template-executive-vote-temporarily-disable-the-aave-dai-direct-deposit-module-d3m-june-15-2022#proposal-detail",
                        "https://twitter.com/MakerDAO/status/1537217115677130754",
                        "https://twitter.com/MakerDAO/status/1537217115677130754",
                        "https://twitter.com/MakerDAO/status/1537217115677130754",
                        "https://twitter.com/AaveAave",
                        "https://vote.makerdao.com/executive/template-executive-vote-temporarily-disable-the-aave-dai-direct-deposit-module-d3m-june-15-2022#proposal-detail",
                        "https://twitter.com/MakerDAO/status/1537217115677130754",
                        "https://manual.makerdao.com/module-index/module-dai-direct-deposit#target-borrow-rate-bar",
                        "https://forum.makerdao.com/t/signal-request-set-the-aave-d3m-dc-to-0-zero/15775/15",
                        "https://forum.makerdao.com/t/the-endgame-party-delegate-signup/15852",
                        "https://forum.makerdao.com/t/the-business-oriented-scientific-governance-delegate-signup/15838",
                        "https://forum.makerdao.com/t/the-endgame-plan-part-3-the-endgame-decentralized-workforce/15737",
                        "https://forum.makerdao.com/t/doo-delegate-platform/13246",
                        "https://forum.makerdao.com/t/the-endgame-party-delegate-signup/15852/2",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721",
                        "https://forum.makerdao.com/t/the-endgame-party-delegate-signup/15852/6",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106",
                        "https://forum.makerdao.com/t/the-endgame-party-delegate-signup/15852/11",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456",
                        "https://forum.makerdao.com/t/the-endgame-party-delegate-signup/15852/16",
                        "https://forum.makerdao.com/t/penn-blockchain-delegate-platform/14419",
                        "https://forum.makerdao.com/t/the-endgame-party-delegate-signup/15852/19",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366",
                        "https://forum.makerdao.com/t/the-endgame-party-delegate-signup/15852/21",
                        "http://forum.makerdao.com/t/the-business-oriented-scientific-governance-delegate-signup/15838",
                        "https://forum.makerdao.com/t/weekly-mips-update-92/15933",
                        "https://vote.makerdao.com/executive/template-executive-vote-temporarily-disable-the-aave-dai-direct-deposit-module-d3m-june-15-2022",
                        "https://mips.makerdao.com/mips/details/MIP41#MIP41c2",
                        "https://mips.makerdao.com/mips/details/MIP24#MIP24c4",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP2",
                        "https://forum.makerdao.com/t/urgent-signal-request-set-aave-d3m-bar-to-0/15800",
                        "https://manual.makerdao.com/module-index/module-dai-direct-deposit#target-borrow-rate-bar",
                        "https://forum.makerdao.com/t/signal-request-set-the-aave-d3m-dc-to-0-zero/15775/15",
                        "https://forum.makerdao.com/t/urgent-signal-request-set-aave-d3m-bar-to-0/15800/15",
                        "https://vote.makerdao.com/polling/QmaR6q4L",
                        "https://forum.makerdao.com/t/mip41c4-sp34-immunefi-security-core-unit-facilitator-onboarding-is-001/14610",
                        "https://vote.makerdao.com/polling/QmWhsLCU",
                        "https://forum.makerdao.com/t/mip41c4-sp35-facilitator-onboarding-din-001/14948",
                        "https://vote.makerdao.com/polling/QmWYajMq",
                        "https://forum.makerdao.com/t/mip39c2-sp33-adding-lending-oversight-core-unit-love-001/15098",
                        "https://vote.makerdao.com/polling/QmTRtpp3",
                        "https://forum.makerdao.com/t/mip75-task-forces/15093",
                        "https://vote.makerdao.com/polling/QmZjU2pG",
                        "https://forum.makerdao.com/t/mip55c3-sp4-adding-a-special-purpose-fund-makershire-hathaway/14643",
                        "https://vote.makerdao.com/polling/Qmerh2xJ",
                        "https://forum.makerdao.com/t/mip4c2-sp20-mip16-amendments/14980",
                        "https://vote.makerdao.com/polling/QmaivXCv",
                        "https://forum.makerdao.com/t/mip74-permissionless-open-market-operations/15095",
                        "https://vote.makerdao.com/polling/QmVMc78Z",
                        "https://forum.makerdao.com/t/mip40c3-sp69-modify-core-unit-budget-strategic-finance-sf-001/15090",
                        "https://vote.makerdao.com/polling/QmXbgVGz",
                        "https://forum.makerdao.com/t/mip63c4-sp4-onboard-amend-keeper-network-keep3r-network/14321",
                        "https://vote.makerdao.com/polling/QmYqBhDx",
                        "https://vote.makerdao.com/polling/QmdZezCr",
                        "https://vote.makerdao.com/polling/QmWTfWad",
                        "https://vote.makerdao.com/polling/Qmd4RbRq",
                        "https://forum.makerdao.com/t/amended-mip40-important-information-for-core-units/15450",
                        "https://www.youtube.com/watch?v=P2FiO-KdbIg",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-wednesday-and-thursday-9pm-cest-getting-real-edition/15777",
                        "https://www.youtube.com/watch?v=eqZ3kobXKAE",
                        "https://forum.makerdao.com/t/meet-your-delegate-15-governancehouse/15722",
                        "https://www.youtube.com/watch?v=67PFalZks5I",
                        "https://forum.makerdao.com/t/governance-and-risk-195-thursday-june-16-at-17-00-utc/15816",
                        "https://www.youtube.com/watch?v=8YRpgtrXsz8",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-wednesday-and-thursday-9pm-cest-getting-real-edition/15777",
                        "https://www.youtube.com/watch?v=5dbVmaoGI4I",
                        "https://forum.makerdao.com/t/know-your-mip-kym-12-core-unit-offboarding-process-amendments/15700",
                        "https://www.youtube.com/watch?v=13g3-Rz-ncc",
                        "https://twitter.com/MakerDAO/status/1538914358469742593?s=20&t=OlCGu6cGbdV_aFeufRVlpQ",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-startup-phase-wednesdays-5pm-cest-all-mkr-holders-welcome/15330",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/81436458345&sa=D&source=calendar&ust=1654445893399659&usg=AOvVaw0-CBSXWDpRLmmAO6XGLV0G",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/weekly-mips-update-88/15329",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/weekly-relay-june-14-20-2022/15950"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Muzza",
                    "index": "#2",
                    "likes": "3",
                    "time": "26/06/2022-14:36:58",
                    "content": "Excelente aporte Sebix ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#3",
                    "likes": "2",
                    "time": "26/06/2022-22:50:45",
                    "content": "Gran aporte. Está pasando mucho en MakerDAO con el Endgame Plan, es indispensable seguir atentamente los acontecimientos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#4",
                    "likes": "3",
                    "time": "27/06/2022-13:26:43",
                    "content": "Excelente. Me encanta el relay semanal de Maker. Me da la oportunidad para ponerme al día con todo lo que va sucediendo. Ya completé la encuesta. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#5",
                    "likes": "2",
                    "time": "27/06/2022-14:39:15",
                    "content": "Excelente trabajo Sebix  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#6",
                    "likes": "2",
                    "time": "27/06/2022-17:01:55",
                    "content": "Cuando pierdo la noción de algunas cosas por cuestiones de tiempo este post siempre me ayuda, muchísimas gracias ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#7",
                    "likes": "2",
                    "time": "27/06/2022-17:10:14",
                    "content": "Buenisimo, el relay de la proxima semana va a estar . Full polls terminaron hoy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-19-25-de-julio-del-2022/16925",
            "title": "Relay Semanal | 19 - 25 de Julio del 2022 ",
            "index": 16925,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "7",
                    "time": "01/08/2022-00:55:43",
                    "content": " 2587×577 105 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu parada obligatoria para estar al día con todas las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus y @Artem_Gordon  Version Online en PDF     EVENTOS ACTUALES    Presupuestos para Mercados Bajistas Los Mercados Bajistas siempre son “sombríos”, pero “sombrío” es un punto de referencia en constante cambio. Para muchos, el panorama macroeconómico representa esa nueva perspectiva. Por ello, gran parte del debate de la semana se centró en la rentabilidad al largo plazo, con un amplio abanico de posts y debates centrados en el manejo presupuestario. Algunas de estas soluciones propuestas podrían tener ramificaciones a corto plazo, pero aspiran posicionar mejor a la DAO en el largo plazo. En la reunión DVC de MakerDAO se debatió en detalle sobre el tema. En este hilo puedes encontrar una versión escrita de la señal, así como su posterior debate, gracias a @pipko, de la CU de Riesgo. …   Resumen de la Señal de Reasignación Presupuestaria de la CU de Riesgo  “[El protocolo está] bien capitalizado y se vislumbra una vuelta a la rentabilidad, pero hay que reevaluar la estructura de costes.”  Posición Financiera Actual  La DAO no incurrió en ‘deuda incobrable’ vinculada a prestamistas CeFi claves, a pesar de una exposición inicial que fue significativa. Durante una ventana de 1 mes que comenzó el 1ro de mayo, los colaterales no estables cayeron de 3.300 millones de dólares a 1.200 millones de dólares, lo que supuso 11,3 millones de dólares en ingresos por liquidación. A partir del 22 de julio, sólo 1,02 mil millones en colaterales no estables permanecen bloqueados en el protocolo, lo que significa que la DAO ya no puede confiar en los ingresos de liquidación consistentes, como una fuente significativa de beneficios.  Ingresos Previstos y Flujo de Caja  El Protocolo opera a una perdida mensual de 2 millones de dólares, hasta que los activos de la hoja de balance se desplieguen en bonos del tesoro a corto plazo. Si no se produce un mayor deterioro en los mercados de préstamos de criptomonedas, Maker alcanzará el equilibrio en el primer trimestre del 2023.  Caminos a Seguir De las dos opciones propuestas, la CU de Riesgo prefiere la “Opción 2”, pero apoyará cualquier solución elegida por la DAO y por los holders de MKR. Dicho eso, dada su preferencia, la opción de la “Reasignación Táctica” está más desarrollada en teoría y forma.  Los caminos propuestos para avanzar934×495 286 KB  De acuerdo con la evaluación de Riesgo, este enfoque permite a los poseedores de tokens asignar el capital en función de los méritos y concederlo de forma holística bajo una visión general de la DAO. El marco tiene como objetivo abordar innumerables problemas observados en el statu quo, particularmente en torno a:   Transparencia en las actividades e iniciativas de las CUs; dificultades sobre la evaluación de rendimiento, y; periodos presupuestarios no simultáneos.   …  Proceso Presupuestario Propuesto Ten en cuenta que cada estadio de este proceso propuesto se ejecutaría simultáneamente a través de todas las Core Units existentes y propuestas.  1458×797 102 KB  1. Presupuesto de Core Units y Propuestas de KPI  Delegados y holders de MKR determinarían el nivel de ‘Gasto Objetivo’ para el periodo presupuestario a través de una votación on-chain. Presupuestos propuestos para las CUs, diseños de actividades operativas clave, objetivos estratégicos y KIPs, así como destacar compensaciones de capital en un escenario de asignación presupuestaria “baja/alta”. Como parte de este proceso, las CUs prometen entregar resultados operativos (en la forma de KPIs) a cambio de una asignación de capital de parte de la DAO. De tal manera, las Core Units deberían identificar y dar a conocer los KPIs operativos que reflejan con exactitud el impacto y el retorno que sus servicios ofrecen al protocolo. Luego, los delegados y holders de MKR ayudarían a las Core Units a desarrollar, negociar y medir los KPIs para confirmar que los objetivos fijados sean razonables, tanto para la CUs como para el protocolo.  2. Evaluación de Propuestas Presupuestarias Con la ayuda de los delegados y holders de MKR, se redactarían y encuestarían varias iteraciones del presupuesto que compiten entre sí. El flujo general seria el siguiente:  Los Delegados y holders de MKR votan en una encuesta on-chain sobre los planes presupuestarios presentados, excluyendo las propuestas que no cumplen el ‘Gasto Objetivo’ acordado. Después que una encuesta de elección por orden de importancia es seleccionada, el plan presupuestario ganador, se propone a través de una votación on-chain binaria.  3. Asignación de Capital y Reorientación de los KPI Después de una confirmación on-chain, se espera que los Facilitadores de CUs comuniquen el impacto percibido que tendrían tanto las asignaciones de capital “más bajas y más altas” en sus KPIs, también se establecerán nuevas promesas operativas. 4. Evaluación de los KPI Una vez finalizado el periodo de los KPI, los delegados y holders de MKR revisarán el cuadro de mando de KPI de cada core unit para entender cómo ha sido el desempeño con respecto a sus objetivos estratégicos. Una vez que el rendimiento de los KPI pueda condensarse en una métrica cualitativa, los delegados y los holders de MKR dispondrán de la información necesaria para tomar decisiones informadas de cara al futuro. El post termina con una Petición de Señal que busca medir el sentimiento de la comunidad hacia las opciones propuestas.  image1700×922 160 KB  Ten en cuenta que debido a la urgencia generada por las condiciones del mercado, esta señal estuvo abierta hasta el 30 de julio.   Anunciamiento: Migración de Delegados  En este post, el Facilitador de la Core Unit DUX, @0xdeniz destaco una nueva función que se agregó al Portal de Gobernanza. Los contratos de Delegados (a través de los cuales, los delegadores delegan su poder de votación de MKR a los delegados) expiran después de un ano. Debido a esto, los delegados y sus delegadores necesitan migrar a un nuevo contrato, una vez que el antiguo contrato ha expirado, para asegurar que el MKR delegado que se pretende activar en las operaciones de gobierno no quede “obsoleto”. Para facilitar este proceso, la interfaz del usuario del Portal de Gobernanza ahora muestra un banner donde tanto los delegados como sus delegadores pueden consultar cuando a expirado su contrato de delegado y ofrece una guía sobre el proceso de migración.  979×727 204 KB    Solicitud de feedback - trabajo legal para MakerDAO  @Balloonist, un miembro del Equipo de Investigación Legal que está incubando SES, ha elaborado un documento que pretende servir como recurso para responder preguntas legales, así como también otro tipo de preguntas: se trata de “una base de datos tipo Stack Overflow para problemas y soluciones de DAOs y DeFi”. Balloonist prevé que el documento pueda ampliar su alcance y abarcar las contribuciones de los miembros de otras DAO para ayudar a definir y refinar los problemas, asi como ofrecer soluciones ampliamente aplicables.  1343×536 75.7 KB    Plataforma del Delegado de Codeknight   Mi objetivo es convertir a Maker en una entidad de un billón de dólares, que sea fácil de entender y descentralizada. Estoy comprometido con el crecimiento de Maker hacia un sistema sostenible y rentable.  @CodeKnight público su plataforma de Delegado el lunes. Sus valores principales incluyen:  Simplificar el protocolo eliminando la complejidad innecesaria, haciendo que sea más fácil de entender para las partes interesadas, así como lograr que la descentralización sea más fácil de alcanzar Desarrollo sostenible, sistemas descentralizados Asegurar que los intereses de los holders de MKR sean representados  En términos de las expectativas de votación, CodeKnight afirma que apoyará las propuestas que anticipen “fuertes rendimientos ajustados al riesgo” y se opondrá a las propuestas demasiado costosas.   Resumen End-Game - Parte 5  @LongForWisdom publico una nueva edición de su trabajo, donde resume la serie de posts del Plan Endgame publicadas por @rune La Parte 5 es la primera en discutir la Hoja de Ruta del Producto del Plan Endgame, una lista completa de todos los principales productos de Maker y funciones que necesitaran estar en su lugar para establecer el estado inmutable de Endgame, descrito en los posts de rune. Este resumen proporciona información básica sobre cada producto delineado en el post original, junto con notas sobre los plazos y los objetivos.  756×327 55 KB   Dune  La Core Unit de Finanzas Estratégicas ha puesto a disposición del público sus tableros y consultas. Se puede acceder a una amplia gama de datos sobre temas que van desde las stablecoins hasta las tarifas de gas de los oráculos.  1906×863 197 KB    Ajuste del Módulo de Seguridad de Gobernanza (GSM) [Encuesta Informal]   2025×345 104 KB  La Demora de Pausa del Módulo de Seguridad de Gobernanza (GSM) es utilizada para ayudar a asegurar que los holders de MKR tengan tiempo de revisar todos los cambios que se pretenden hacer en el protocolo antes de que se aprueben, buscando posibles intenciones maliciosas. Esta encuesta, busca recopilar el sentimiento de la comunidad sobre si ajustar o no la Demora de Pausa GSM.   Esta Semana en Gobernanza  Actualización Semanal de MIPs #97   Encuestas de Ratificación, propuestas y discusiones pre-MIP.  Votación(es) Ejecutiva(s) Las Votaciones Ejecutivas de esta semana quedaron en suspenso, ya que una parte importante de nuestros miembros y Delegados estuvieron asistiendo y disfrutando del EthCC en Paris. Mantente atento de la próxima Reunión de Gobernanza y Riesgo para más información sobre las próximas Votaciones Ejecutivas.  Votación Ejecutiva de la semana pasada: Cambios de Parámetros del MOMC – Aprobada el 14 de Julio del 2022 - 06:10 UTC. Ejecutada el 16 de Julio del 2022 - 06:16 UTC.  Encuestas Activas  Encuestas del Visto Bueno de la Comunidad     Encuesta Desglose de los Votos Fecha de Inicio Fecha de Cierre     Encuesta del Visto Bueno - bIBTA (ETF de Bonos a Corto Plazo con Respaldo Financiero)  2275×555 79.4 KB  18 de Julio del 2022 - 16:00 UTC 01 de Agosto del 2022 - 16:00 UTC     Encuestas Finalizadas @Patrick_J se convirtió en el nuevo Facilitador de Gobernanza de GovAlpha, para trabajar junto a @Prose11 como Co-Facilitador, con la incuestionable aprobación de la comunidad. ¡Felicitaciones Patrick!      Nombre de la Encuesta Desglose de los Votos Fecha de Cierre     Encuesta de Ratificación para la Incorporación del Facilitador de Gobernanza GOV-001 (MIP41c4-SP37)  25 de Julio del 2022 - 16:00 UTC      Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:  Comité de Votación Descentralizado Abierto | Foro | Video  Horario de Oficina de los Delegados | Discord | Video  Gobernanza y Riesgo - Ep. 200 | Foro | Video  Comité de Votación Descentralizado Abierto | Foro | Video   Llamadas Recientes:  Comité de Votación Descentralizado Abierto | Foro | Link para unirse  Horario de Oficina de los Delegados | Discord | Link para unirse  Gobernanza y Riesgo - Ep. 200 | Foro | Link para unirse  Comité de Votación Descentralizado Abierto | Foro | Link para unirse     Horario de Oficina de las Core Units   Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC | Alternativa: Link para unirse - Cada dos Miércoles a las 15:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Growth - Primer Miércoles de Cada Mes a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | Capital 6S - Cada dos Miércoles a las 14:00 UTC    Recursos  Abrir Lista  Todos los Paneles Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Rastreador del Panel de Gobernanza | Versión Google Sheet   Conoce tu Índice MIP   Portal de Aprendizaje y Documentación Técnica   Servidor de Discord de MakerDAO   MakerBurn   Lista de los Horarios de Oficina   Herramientas de Participacion   Calendario de Votación y Fechas Importantes    Descargo de Responsabilidad Esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de ser asesoramiento financiero, ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación.  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix. ",
                    "links": [
                        "https://www.youtube.com/watch?v=u-nFkEn0lY0&t=123s",
                        "https://forum.makerdao.com/t/signal-request-budget-re-allocation-core-unit-accountability-framework/16788",
                        "https://forum.makerdao.com/t/signal-request-budget-re-allocation-core-unit-accountability-framework/16788",
                        "https://forum.makerdao.com/t/signal-request-budget-re-allocation-core-unit-accountability-framework/16788",
                        "https://forum.makerdao.com/t/announcement-delegate-migration/16603",
                        "https://forum.makerdao.com/t/request-for-feedback-legal-work-for-makerdao/16772",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806",
                        "https://forum.makerdao.com/t/end-game-summary-part-5/16759",
                        "https://forum.makerdao.com/t/endgame-plan-part-5-endgame-product-roadmap-pregame-and-early-game/16670",
                        "https://dune.com/stratfi/maker-stratfi-directory",
                        "https://forum.makerdao.com/t/governance-security-module-gsm-adjustment-informal-poll/16205",
                        "https://forum.makerdao.com/t/weekly-mips-update-97/16816",
                        "https://forum.makerdao.com/t/the-schuppi-and-elpro-delegate-happy-hour-at-ethcc-paris-2022-episode-2/16720",
                        "https://forum.makerdao.com/t/governance-and-risk-200-thursday-july-21-at-17-00-utc/16736",
                        "https://vote.makerdao.com/executive/template-executive-vote-momc-parameter-changes-july-13-2022",
                        "https://vote.makerdao.com/polling/QmbDbzqW",
                        "https://vote.makerdao.com/polling/QmY3xqFQ",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://youtu.be/u-nFkEn0lY0",
                        "https://discord.com/channels/893112320329396265/989856974747349112",
                        "https://youtu.be/slO_NP800d8",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://youtu.be/3f4CghsTxOE",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://youtu.be/alr9vPRjync",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://us02web.zoom.us/j/81436458345",
                        "https://discord.com/channels/893112320329396265/989856974747349112",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/88286550832?pwd%3DdWQzQi9tYlNyemJJS2Nrd2NUdTBoZz09&sa=D&source=calendar&ust=1659276060142710&usg=AOvVaw3u_2Od_lu7gWBavWX4oip-",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://us02web.zoom.us/j/82286534666",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.338068181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/08/2022-20:03:20",
                    "content": "Excelente traducción Jose sigue así rockeando  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-28-de-junio-05-de-julio-del-2022/16473",
            "title": "Relay Semanal | 28 de Junio - 05 de Julio del 2022 ",
            "index": 16473,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "11",
                    "time": "10/07/2022-15:17:45",
                    "content": " 2582×582 235 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu parada obligatoria para estar al día con todas las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus y @Artem_Gordon  Versión Online en PDF    ¿Qué está ocurriendo en la DAO?    Se detienen los Retiros en las Plataformas de Prestamos Numerosos protocolos de préstamos detuvieron los retiros de sus clientes la semana pasada, alegando varios motivos para los retrasos. Babel, Celsius, CoinFLEX, Hodlnaut y Vauld están entre los nombres que han cerrado sus puertas a medida que la crisis de liquidez o el “Contagio de UST”, continúa su propagación. Haz Clic aquí para conseguir más información sobre la posición wBTC-A de Celsius  Dado que Celsius es uno de los principales poseedores de vaults en Maker, su situación de liquidez es el titular para nuestros fines. No se ha añadido Colateral a su posición wBTC-A desde el 16 de junio y su ratio de colateralización cayó a un mínimo de 154.1%. Eso cambio el 1ro de julio cuando la wallet de Celsius empezó a pagar DAI de vuelta en grandes cantidades.  Depósitos de Celsius1462×482 127 KB  Un frenesí de depósitos por un total de 196,7M, aumento la colateralización de la vault por encima de 577,8%, reduciendo su deuda de ~202M de DAI para el primero de julio a poco más de 82M de DAI para el 4 de julio.  Celsius sin-riesgo1355×622 60.8 KB  Nota: en cuanto a CoinFLEX, aun destacan sus prácticas de “gestión de riesgos”, que por cierto, son verdaderamente horrendas.   Un exploit en el Puente Harmony lleva al robo de 6M de DAI Daños: El Puente Harmony contaba con alrededor de $100M en activos wrapped (“envueltos”), los cuales fueron drenados, lo que significa que cada token envuelto no tiene respaldo actualmente. Haz Clic aquí para conseguir más información sobre el hackeo y la perdida de DAI.  La Multisig de 2 o 5 de Harmony cayó ante un campaña de phishing que se especula que fue preparada y llevada a cabo por el Grupo Lazarus, nombre que se le dio a la fuerza de hackeo patrocinada por Corea del Norte. El equipo intento contactarse numerosas veces mediante correspondencia on-chain pero no recibieron ninguna respuesta mientras los últimos fondos se abrían paso a través de Tornado Cash.  No es el Primer Rodeo de Lazarus  Una investigación del FBI identifico que los métodos utilizados en el Hackeo de Ronin eran curiosamente similares a los ataques que se conoce que son llevados a cabo por el grupo, en los que ingeniería social fue utilizada para ganar acceso a servidores de la compañía que contienen las llaves privadas usadas para firmar transacciones legitimas en la red. El Grupo Lazarus cuenta con dos unidades con dos objetivos distintos:   BlueNorOff (APT-38, BeagleBoyz) es un sector con motivación financiera que acoge unos 1.700 miembros. El subgrupo tiene como objetivo principal el sistema SWIFT, así como proyectos blockchain centralizados y descentralizados.  AndAriel (Andarial) se centra en la disrupción de Corea del Sur. No se sabe mucho sobre el subsector, pero sus objetivos han incluido desde empresarios coreanos de alto rango, corporaciones multinacionales, hasta oficiales del gobierno.   Posibles Vectores de Ataque  Según el hilo de Twitter de Mudit Gupta, el atraco se inscribe en una serie de “hackeos tradicionales” similares, en los que la violación de los servidores centralizados, en lugar de un ataque on-chain, condujo a enormes pérdidas. Aunque aún no se conocen todos los detalles, Gupta especula que este servidor central fue violado, advirtiendo a los desarrolladores que la próxima generación de mega hackeos no tendrán como objetivo la seguridad on-chain, sino que utilizaran más vectores tradicionales. El concluye que la seguridad tradicional debe abordarse con el mismo vigor que la seguridad on-chain.  ¿Qué significa esto para Harmony?  Harmony es funcionalmente insolvente. Cerca de $100M del total de 200 millones de dólares de su valor bloqueado se encontraban en el puente de Harmony. Sin intervención, es poco probable que la cadena se recupere. Esta cifra puede haber dejado caer el sombrero un par de meses atrás, pero con el panorama de VC diezmado, sin financiación FTX/Alameda es difícil de lograrlo.  ¿Qué significa esto para DAI?  Con el auge multi-chain de DeFi, muchos advirtieron los riesgos de los puentes centralizados. Riesgos que, desafortunadamente, se han puesto de manifiesto este año. DAI juega un rol mínimo en el ecosistema de Harmony, pero igualmente un numero de derivados wrapped (“envueltos”) fueron desviados y blanqueados al mismo tiempo. Alrededor de 6 millones de DAI fueron bloqueados inicialmente en el contrato del puente. Hoy en día, quedan menos de ~9.5k. Un apoyo masivo al equipo de PE por mantener el rumbo. El Wormhole de Optimism (y otras implementaciones similares) permite que el DAI florezca sin los riesgos sistemáticos inherentes a los contratos centralizados del puente. El año pasado, muchos temieron que DAI se quedara atrás con respecto a la competencia, ya que varias “stablecoins” se dieron a conocer rápidamente en el mercado a través de nuevas y brillantes layer-1s. Pero en lugar de jugar con el ruido, PE mantuvo el rumbo, posicionando a la DAO y a DAI, para beneficiarse de la próxima ola de innovación de las layer-2.   Este hilo de Twitter habla sobre cómo funciona el ataque de un Ladrón de Criptomonedas, como protegerte ante estos y un análisis básico de malware.   Eventos Actuales   Horario de Oficina de los Delegados  ¡Estamos emocionados de presentar un nuevo Horario de Llamada de los Delegados, el jueves 7 de julio a las 16:00 UTC! Lo que comenzó como una discusión entre Tim Schuppener, Raphael Spannocchi y otros, para ayudar a mejorar la comunicación y coordinación entre Delegados y Core Units, se ha vuelto una llamada publica bajo el nombre de: Horario de Oficina de los Delegados. Thomas Flitter, de Comunicaciones de Gobernanza será el anfitrión de la llamada. El formato para esta primera llamada es simple; un panel de debate inicial donde cada delegado tiene 5 minutos para hablar sobre cualquier tema de su elección, seguido por una sección a micrófono abierto. Todos son bienvenidos a participar. Link para unirse - Zoom   Actualizaciones DUX - ¡Recién salido de la prensa!   Lanzamiento del Portal Gobernanza v0.6.0  El equipo de la Core Unit DUX paso el mes de junio entregando dos nuevas funciones principales: Encuestas sin Gas y Migración de Delegados. El equipo también trabajo en mejorar la resiliencia y eficiencia de su infraestructura tecnológica, especialmente necesitada después de un reciente aumento en el tráfico y contrato de los Delegados. Ha finalizado la fase de investigación y de diseño de arquitectura de la Encuesta de Votación sin Gas y se estableció que el producto finalizado será lanzado el tercer trimestre de este año. El sistema será:  Compatible con el sistema de votación actual de Maker Libre para el usuario Disponible para todos los holders de MKR y Delegados  La función de Migración de Delegados, agendada para ser lanzada aproximadamente en dos semanas, pretende agilizar el proceso de migración para contratos de Delegados que hayan expirado, tanto para Delegados Reconocidos y Delegadores.  Parte 3 del Resumen de End-Game, por LongForWisdom  Para ayudar a su comprensión y aumentar la accesibilidad de las ideas para todos, @LongForWisdom posteo un resumen de la Parte 3 del Plan Endgame de @rune. Resumen estructurado:  Destaca la simpleza del proceso Señala los desafíos presupuestarios como la principal área de preocupación Destaca la necesidad de mejores prácticas para lograr una separación de poderes en general  Las MetaDAOs pueden ser la mejor forma de compartimentar este riesgo   Introduce ideas alrededor de las operaciones DAO2DAO  Sigue la Lista del Índice de Endgame de @LongForWisdom para obtener una lista de posts relacionados con el Plan Endgame y los resúmenes de @LongForWisdom.  Un kit de herramientas DAO para facilitar la transparencia  En este post, @rune argumenta que deberíamos tener “un máximo de transparencia razonable” respecto al trabajo de las Core Units. Todas las interacciones de trabajo significativas entre las Core Units deben ser llevadas a cabo públicamente y documentarse minuciosamente de acuerdo con procedimientos estandarizados. @rune propone un “kit de herramientas unificados de la DAO” para lograr este nivel de transparencia. Este kit comprendería una herramienta de software utilizada para el seguimiento del flujo de trabajo, similar a Jira o Trello y un tablero de información sobre la gobernanza tipo wiki. Estos dos componentes combinan la gobernanza y las operaciones bajo un solo sistema y permiten construir transparencia de forma “gratuita”.  Actualizaciones de Riesgo - ¡Recién salido de la prensa!  La Core Unit de Riesgo estuvo ocupada en junio. Entre las áreas particulares de interés destacan el trabajo de desarrollar una estrategia de liquidez de DAI multi-chain, una actualización del sitio de Makerburn y continuar trabajando en el panel de Riesgo de Maker V3. El equipo a publicado un post a profundidad sobre porque necesitamos una mejor liquidez de DAI a través de blockchains y cómo podemos lograrlo. Las formas de impulsar la liquidez de DAI entre cadenas incluyen:  Incentivos de Liquidez: un alcance limitado de incentivos para impulsar la liquidez de DAI en dominios externos hasta el punto donde los mercados de DAI se vuelven autosustentables. Asociaciones: de la mano de los incentivos autofinanciados, Maker se puede asociar con protocolos externos para apoyar la liquidez de DAI y la integración en sus proyectos. Visibilidad Comunitaria: los miembros independientes de la comunidad y/o ballenas de MKR no enfrentan los mismos riesgos de gobernanza y custodia que MakerDAO al desplegar activos cross-chain. Por lo tanto, podrían desempeñar un papel esencial en la mejora de la liquidez de DAI a través de dominios externos.  El sitio web de Makerburn tiene nuevas paginas para el excedente del sistema y estimaciones de los beneficios anuales.  El equipo recientemente hizo un post anunciando la v3 del Tablero de Riesgo de Maker.  Para esta tercera iteración, el equipo ha:  Rediseñado el sitio web para proveer una mejor y más accesible experiencia de usuario Datos, conceptos y modelos abstractos para reducir la complejidad y simplificar el tablero Agregado nuevas funciones para proveer acceso a datos que no estaban disponibles anteriormente en la v2.     Esta Semana en la Gobernanza   Actualización Semanal de MIPs #94  Encuestas de Ratificación, propuestas y discusiones pre-MIPs.  Votación(es) Ejecutiva(s) Dos votaciones ejecutivas fueron aprobadas esta semana y los siguientes cambios se llevaron a cabo dentro del Protocolo de MakerDAO:   Transferencias de MKR - 22 de junio del 2022 - Aprobada el 02 de Julio del 2022 a las 13:03 UTC. Ejecutada el 04 de Julio del 2022 a las 14:00 UTC.   Transferencia de MKR a las Core Units y Avance de Desincorporación de Colateral - 29 de junio del 2022 - Aprobada el 29 de Junio del 2022 a las 15:06 UTC. Ejecutada el 01 de Julio del 2022 a las 16:40 UTC.    Transferencia de MKR a las Core Units     Core Unit Cantidad Propuesta Presupuestaria     Deco Fixed Rate (DECO-001) 500 MKR Propuesta Presupuestria   Finanzas del Mundo Real (RWF-001) 152 MKR Propuesta Presupuestaria   Core Unit de Riesgo (RISK-001) 175 MKR Propuesta Presupuestaria     Desincorporación de Colateral De acuerdo con estas encuestas de desincorporación exitosas para UNI-A, UNIV2DAIETH-A, UNIV2WBTCETH-A, UNIV2UNIETH-A y UNIV2WBTCDAI-A, los siguientes cambios en los parámetros de liquidación se llevaron a cabo:     Parámetro Tipo de Vault + / - De / a     Ratio de Liquidacion UNI-A + 165% / 1300%   Ratio de Liquidacion UNIV2DAIETH-A + 120% / 2000%   Ratio de Liquidacion UNIV2WBTCETH-A + 145% / 2400%   Ratio de Liquidacion UNIV2WBTCDAI-A + 120% / 800%    Los cambios mencionados ocurrirán dentro de 30 días. Al mismo tiempo, el Incentivo de Inicio Flat (tip), la Penalización por Liquidación (chop) y el Techo de Deuda fueron fijados a 0 para todos estos colaterales. Esta votación ejecutiva es la continuación de una propuesta ejecutiva previa que fue exitosa y es el siguiente paso para ejecutar la desincorporación  de colateral, como está definido en la MIP62. No se llevaron a cabo cambios a UNIV2UNIETH-A en esta propuesta ejecutiva, ya que este tipo de vault ya tiene 0 DAI pendientes. Sin embargo, ya que esta propuesta fue aprobada, continuara la desincorporación.  Encuestas de Gobernanzas Actualmente hay tres encuestas activas esperando por tu participación:     Nombre de la Encuesta Discusión(nes) Fecha de Inicio Fecha de Cierre     Agregar RWA-009 (HVBank) como un nuevo Tipo de Vault  Aplicacion Inicial del Colateral / Evaluación de Riesgo de la Core Unit de Finanzas del Mundo Real / Evaluación de Riesgo Adicional - LOVE / Evaluación de la Core Unit de Servicios de Ingeniería de Colaterales / Evaluación de la Core Unit de Oraculos / Documentación de Transacción de HVB / Fundación RWA: HVB / Propuesta del Comité de Delegados  04 de julio del 2022 a las 16:00 UTC 07 de julio del 2022 a las 16:00 UTC   PPG - Propuesta del Comité de Mercado Abierto Discusión 04 de julio del 2022 a las 16:00 UTC 07 de julio del 2022 a las 16:00 UTC   Selecciona un Nivel Objetivo de Rentabilidad rNPI para Guiar los Recortes de Presupuesto Discusión 04 de julio del 2022 a las 16:00 UTC 07 de julio del 2022 a las 16:00 UTC     Encuestas de Criterio de Prioridad Estos son los resultados finales recogidos tras la finalización de la primera tanda de encuestas de criterio de priorización:     Criterio de Priorización Desglose de Votos Fecha de Cierre     Despliegue de Recursos Técnicos  Resultados852×774 24.1 KB  04 de julio del 2022 a las 20:00 UTC   Clase de Colateral  Resultados852×606 21.6 KB  04 de julio del 2022 a las 20:00 UTC     Encuestas del Visto Bueno de la Comunidad No hay encuestas del visto bueno de la comunidad esta semana, así que esto es todo amigos. Ahora ¡vayan a votar!    Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:  Comité de Votación Descentralizado Abierto | 29 de junio del 2022   Foro | Video    Comité de Votación Descentralizado Abierto | 30 de junio del 2022   Foro | Video    Gobernanza y Riesgo | Ep. 197   Foro | Video    Focus On # 12: Centrifuge Indenture Trust Agreement Deep Dive   Foro | Video     Futuras llamadas:  Evitando la Tragedia: Horario de Oficina de ACREinvest | 6 de junio a las 19:00 UTC   Foro | Link para unirse    Conoce Tu Delegado #16 - pvl | 7 de junio a las 15:00 UTC   Foro | Link para unirse    Kickoff - Horario de Oficina de Delegados | 7 de junio a las 16:00 UTC  Link para unirse    Llamadas Recurrentes:  Comité de Votación Descentralizado Abierto | Foro | Link para unirse - Miércoles y Jueves a las 19:00 UTC  Llamada de Gobernanza y Riesgo | Link para unirse | Agenda - Jueves a las 17:00 UTC     Horario de Oficina de las Core Units   Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC | Alternativa: Link para unirse - Cada dos Miércoles a las 15:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Crecimiento - Primer Miércoles de Cada Mes a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | Capital 6S - Cada dos Miércoles a las 14:00 UTC    Recursos  Abrir Lista  Todos los Paneles Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Rastreador del Panel de Gobernanza | Versión de Google Sheet   Conoce tu Índice MIP   Portal de Aprendizaje y Documentación Técnica   Servidor de Discord MakerDAO   MakerBurn   Lista los Horarios de Oficina   Herramientas de Participacion   Calendario de Votación y Fechas Importantes     ¿Tienes algún Feedback? Tenemos algunas ideas nuevas para mejorar y apreciaríamos tu retroalimentación para hacer que el Relay Semanal sea una publicación más disfrutable. Descargo de Responsabilidad: esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de ser asesoramiento financiero ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación.  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix. ",
                    "links": [
                        "https://fortune.com/2022/05/12/terrausd-ust-luna-contagion-tether-bitcoin-solana-ether-price-crypto/",
                        "https://twitter.com/FatManTerra/status/1541553080159830017/photo/1",
                        "https://www.coindesk.com/tech/2022/06/30/harmony-horizon-exploit-linked-to-north-korea-10m-bounty-offered-in-global-manhunt/",
                        "https://etherscan.io/tx/0xa4eda32985503e91dd02c31222a5e53a6a40f55129ec86c716d6446a7186b426",
                        "https://blockworks.co/fbi-says-north-korea-behind-625m-ronin-hack/",
                        "https://twitter.com/Mudit__Gupta/status/1540225234153996288",
                        "https://www.cnbc.com/2022/06/22/sam-bankman-fried-rescues-crypto-lenders-blockfi-voyager.html",
                        "https://dune.com/queries/991649/1717121",
                        "https://threadreaderapp.com/thread/1544186151585533952.html",
                        "https://us02web.zoom.us/j/86960768807",
                        "https://forum.makerdao.com/t/dux-monthly-update-june-2022/16324",
                        "https://www.notion.so/Governance-Portal-Release-v0-6-0-June-27th-cdbbb6352df049a688bcad66bbc01c",
                        "https://forum.makerdao.com/t/end-game-summary-part-3/16245",
                        "https://forum.makerdao.com/t/end-game-summary-part-3/16245",
                        "https://forum.makerdao.com/t/endgame-index-list/16021",
                        "https://forum.makerdao.com/t/unified-dao-toolkit-making-transparency-easy/16210",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-june-2022/16316",
                        "https://forum.makerdao.com/t/thoughts-on-multichain-dai-liquidity-strategy/16071",
                        "https://makerburn.com/",
                        "https://makerburn.com/#/system-surplus",
                        "https://makerburn.com/#/estimate",
                        "https://forum.makerdao.com/t/announcing-maker-risk-dashboard-v3/16335",
                        "https://forum.makerdao.com/t/weekly-mips-update-94/16330",
                        "https://vote.makerdao.com/executive/template-executive-vote-mkr-vesting-transfers-june-22-2022",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-mkr-transfer-and-advancing-collateral-offboardings-june-29-2022",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP23",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP36",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP1",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP61",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP2",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP25",
                        "https://vote.makerdao.com/polling/QmSfLS6V#poll-detail",
                        "https://vote.makerdao.com/polling/QmQUozNn#poll-detail",
                        "https://vote.makerdao.com/polling/QmY3YsDB#poll-detail",
                        "https://vote.makerdao.com/polling/QmUeYVa2#poll-detail",
                        "https://vote.makerdao.com/polling/QmZHNkip#poll-detail",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-liquidation-ratio",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-liquidation-ratio",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-liquidation-ratio",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-liquidation-ratio",
                        "https://manual.makerdao.com/parameter-index/collateral-auction/param-flat-kick-incentive",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-liquidation-penalty",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-debt-ceiling",
                        "https://vote.makerdao.com/executive/template-executive-vote-parameter-changes-starknet-bridge-limit-and-authority-changes-recognized-delegate-compensation-sh-001-budget-distribution-june-08-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP62",
                        "https://vote.makerdao.com/polling/QmQMDasC",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-rwa-collateral-onboarding-risk-assessment/15828/1",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-additional-risk-assessment-love-cu-in-incubation/15886",
                        "https://forum.makerdao.com/t/rwa009-hvbank-mip21-token-ces-domain-team-assessment/15861",
                        "https://forum.makerdao.com/t/rwa009-huntingdon-valley-bank-collateral-onboarding-oracle-assessment/16069/1",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-transaction-documents-on-permaweb/16264",
                        "https://forum.makerdao.com/t/rwa-foundation-hvb-disclosure/16267",
                        "https://forum.makerdao.com/t/real-world-finance-decision-making-and-delegated-committee-proposal/15276",
                        "https://vote.makerdao.com/polling/QmefrhsE",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-30-june-2022/16248",
                        "https://vote.makerdao.com/polling/Qmasg6zr",
                        "https://forum.makerdao.com/t/signal-request-bear-building-financial-resilience-dao-targets/16004",
                        "https://vote.makerdao.com/polling/QmYqBhDx",
                        "https://vote.makerdao.com/polling/QmdZezCr",
                        "https://forum.makerdao.com/t/endgame-decentralized-voter-committee-meetings-wednesday-june-29-9pm-cest-and-thursday-june-30-9pm-cest/16212",
                        "https://www.youtube.com/watch?v=yO0i2bP_UZM",
                        "https://forum.makerdao.com/t/endgame-decentralized-voter-committee-meetings-wednesday-june-29-9pm-cest-and-thursday-june-30-9pm-cest/16212",
                        "https://www.youtube.com/watch?v=v4i3RqzMoxE",
                        "https://forum.makerdao.com/t/governance-and-risk-196-thursday-june-23-at-17-00-utc/15998/2",
                        "https://www.youtube.com/watch?v=CTJsxelOSNk",
                        "https://forum.makerdao.com/t/rescheduled-focus-on-12-centrifuge-indenture-trust-agreement-deep-dive/15262",
                        "https://www.youtube.com/watch?v=rkgN7ajFtiY",
                        "https://forum.makerdao.com/t/avoiding-the-tragedy-acreinvest-delegate-office-hours/15857",
                        "https://acreofamerica.zoom.us/j/81726802661",
                        "https://forum.makerdao.com/t/meet-your-delegate-16-pvl/16206",
                        "https://us02web.zoom.us/j/89695990453?pwd=izoTjb5jrCAAOrug8GuQdb_Gofa26F.1",
                        "https://us02web.zoom.us/j/86960768807",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-startup-phase-wednesdays-5pm-cest-all-mkr-holders-welcome/15330",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/81436458345&sa=D&source=calendar&ust=1654445893399659&usg=AOvVaw0-CBSXWDpRLmmAO6XGLV0G",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.516203703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Muzza",
                    "index": "#2",
                    "likes": "3",
                    "time": "10/07/2022-19:54:41",
                    "content": "Excelente trabajo Jose! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#3",
                    "likes": "6",
                    "time": "10/07/2022-21:40:52",
                    "content": "Como siempre sin defraudar, muy buen resumen, con respecto a lo primero, hay un artículo muy interesante que engloba lo que está sucediendo en estos momentos con plataformas de préstamos centralizadas    Fortune    A ‘crypto credit crisis’: What to know about FTX, 3AC, BlockFi and a... Between the latest with BlockFi and Three Arrows Capital (3AC), the second quarter of 2022 has been rough for the crypto industry.      No me gusta la idea de querer salvar plataformas que prácticamente o quitaban contribución educativa a las criptomonedas incluso a veces servía como negatividad para la adopción de las criptomonedas, lo que está haciendo FTX es querer consumir algo y adueñarse del mismo, esto para aumentar su exposición e incluso no sería descabellado en pensar una especie de monopolio. Celsius me parece de las más centradas en aspecto de compromiso, aunque por supuesto a nadie le interesaría tener dinero congelado sin movilizar, aquí adjunto otra nota bastante interesante, la posición que da a demostrar Celsius en la nota es que trata de buscar alguna especie de solución, siempre y cuando se rijan de forma correcta    The Block    Celsius hires new restructuring lawyers to help navigate its options: WSJ Celsius has hired new counsel to advise it through a possible restructuring amid the fallout surrounding the lending protocol.      Voyager ya había hecho de las suyas, pero Vauld estaba en las sombras, pero como siempre cuando una plataforma centralizada se queda sin liquidez aparece la verdadera cara detrás de la máscara.    CNBC – 4 Jul 22    Another crypto lender Vauld pauses withdrawals as market crash takes its toll Vauld is the latest victim of the cryptocurrency price plunge this year that has exposed flaws in a number digital coin projects and business models.      Ahora bien, de todas esas podemos sacar una clara conclusión y es que las plataformas CENTRALIZADAS de cualquier tipo, están sujetas a un riesgo bastante importante ya que los dueños tienen la potestad de elegir qué camino tomar, exceptuando a Celsius que eligió su comunidad, pero no dudaría ni un segundo en que si la comunidad no hubiese elegido probablemente los directores de Celsius hubieran optado por eliminar los retiros. Moraleja de la historia las DAO estructuradas por actores interesados en el futuro de la adopción siguen siendo la mejor forma de lidiar con situaciones catastróficas. Sin darme cuenta hice un resumen de algunas noticias ",
                    "links": [
                        "https://fortune.com/2022/07/01/crypto-news-ledn-ftx-blockfi-rumors-3ac-liquidation-finblox-withdrawals-babel/",
                        "https://www.theblock.co/post/156805/celsius-hires-new-restructuring-lawyers-to-help-navigate-its-options-wsj",
                        "https://www.theblock.co/post/156805/celsius-hires-new-restructuring-lawyers-to-help-navigate-its-options-wsj",
                        "https://www.cnbc.com/2022/07/04/crypto-lender-vauld-halts-withdrawals-as-market-crash-takes-its-toll-.html",
                        "https://www.cnbc.com/2022/07/04/crypto-lender-vauld-halts-withdrawals-as-market-crash-takes-its-toll-.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609848484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#4",
                    "likes": "3",
                    "time": "14/07/2022-22:39:41",
                    "content": "Qué complicado que está lo de Celsius… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#5",
                    "likes": "3",
                    "time": "15/07/2022-22:24:48",
                    "content": "Me gusta el planteamiento. Crees que al final del día, absolutamente todas las decisiones se deban tomar de forma descentralizada o que quizá  puedan coexistir algunos tipos de comités centralizados que tomen ciertas decisiones puntales mientras que el resto se le delega a la gobernanza descentralizada? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#6",
                    "likes": "3",
                    "time": "15/07/2022-22:33:05",
                    "content": "Por supuesto, cuando una comunidad es mucho más grande todos deben tener poder en la toma de decisiones, siempre y cuando toda la comunidad tenga una misión o visión en específico, o tengan en su mente MEJORAR, las estructuras descentralizadas servirán siempre, porque formas parte de ella gracias a que tienes una visión en específico, si un actor sea minúsculo o un grupo quieren el mal para la comunidad el resto de la comunidad que aún sigue la visión de un protocolo querrá eliminarlos. Las tomas de decisiones centralizadas funcionan siempre y cuando la cabeza, el líder o la punta de la pirámide sean sensatos, pero imagínense que por 2 o 3 personas tomen una decisión que empeore un protocolo y gracias a ello se venga abajo todo. Colocare el ejemplo de un hogar, el padre o madre tienen mayor experiencia para administrar el hogar, ellos siempre quieren la felicidad tanto para ellos como para sus semejantes, llegará un punto donde los hijos también tendrán poder de votación, entonces todos pueden contribuir al hogar, pero y si el padre o madre elige únicamente las decisiones del hogar sin consultar previamente con la familia y ocasiona un caos, allí la centralización no funciona, y la descentralización si funciona ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#7",
                    "likes": "4",
                    "time": "16/07/2022-18:43:12",
                    "content": "Que gran trabajo como siempre @Joserjimz @Sebix pero esta vez me detengo a felicitar a nuestra estimada @Sol_Invictus que sorpresa señorita, enorme lo suyo y que alegría leer sus aportes ahora en los Weekly Relay. Keep going & cheers for you   PD: los comentarios y post que esta generando @Moi un lujo, placer leerte hermano.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#8",
                    "likes": "2",
                    "time": "16/07/2022-21:17:32",
                    "content": "Muchísimas gracias, aquí estamos para retroalimentarnos, esperando más oportunidades para contribuir a la comunidad, igualmente los aportes de todos son maravillosos❤️ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sol_Invictus",
                    "index": "#9",
                    "likes": "3",
                    "time": "17/07/2022-23:29:40",
                    "content": "Gracias por el continued support, Nahu~  Doin’ what I can, the best I can. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leandro",
                    "index": "#10",
                    "likes": "2",
                    "time": "18/07/2022-23:25:04",
                    "content": "+1, totalmente de acuerdo ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#11",
                    "likes": "1",
                    "time": "19/07/2022-00:25:20",
                    "content": "Excelente trabajo Jose!!! Maker se está poniendo las pilas me gusta  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-09-15-de-agosto-del-2022/17353",
            "title": "Relay Semanal | 09 - 15 de Agosto del 2022 ",
            "index": 17353,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "7",
                    "time": "20/08/2022-03:47:30",
                    "content": " 2585×575 110 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu parada obligatoria para estar al día con todas las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus y @Artem_Gordon  Versión Online en PDF     EVENTOS ACTUALES   Sanciones a Tornado Cash  Hemos alcanzado ese sutil cambio de paradigma, en el que la línea entre el ser humano y la máquina comienza a difuminarse. Los contratos inteligentes ahora pueden ser sancionados como si fueran sintientes. En un comunicado de prensa publicado el 8 de agosto por la Oficina de Control de Activos Extranjeros del Departamento del Tesoro (OFAC), el popular mezclador de criptomonedas, Tornado Cash y sus contratos se vieron en serios problemas. En una movida sin precedentes, la OFAC designo los contratos inteligentes como “Specially Designated Nationals”: una clasificación normalmente reservada para los estados-nación y las organizaciones terroristas. Tornado Cash y su IP fueron designados bajo EO. 13694, una Orden Ejecutiva que permite bloquear propiedades y activos de individuos implicados en actividades maliciosas en línea. De acuerdo con el informe: ⮟  Tornado Cash ha sido utilizado para lavar más de 7.000 millones de dólares desde su creación en 2019. De ese total, al menos 455 millones de dólares fueron robados por el Grupo Lazarus, el grupo de hackers patrocinado por el estado de Corea del Norte. Ya hemos visto como robaron y blanquearon 96 millones de USD en el asalto al puente Harmony ONE y al menos 7.8 millones de USD mediante el exploit de Nomad en 2022.  Resultados de las sanciones impuestas: ⮟  Todas las propiedades e IPs asociadas con Tornado Cash en los Estados Unidos están bloqueadas y deben reportarse a la OFAC. Cualquier entidad que sea propiedad directa o indirecta de “uno o mas de los individuos bloqueados” también será bloqueada. Todas las transacciones centradas en Estados Unidos que tengan que ver con los activos sancionados están prohibidas, a menos que cuenten con una licencia específica, emitida por la OFAC.  Sorprendentemente, la noticia no fue bien recibida, y varios cripto-nativos de alto perfil han dado su opinión sobre las implicaciones de las sanciones impuestas. Entre estos, también @Rune, compartió sus opiniones en una reciente entrevista con Coindesk. El siente que las sanciones son contraproducentes, incluso llegando a ser inútiles. Debido a la naturaleza de código libre del software, lanzar otro protocolo idéntico sería un procedimiento bastante sencillo.  “Enfócate en los criminales que realmente quieres atacar.”  Si la meta es utilizar un método de “lista negra” con los grupos de hackers patrocinados por el estado, cerrar la infraestructura no lo lograra. En su lugar, se deberían monitorear activamente las wallets de Ethereum conocidas de Corea del Norte, permitiendo que los activos robados sean congelados al momento que entran en estas wallets. Rune termina con una advertencia sobre las prohibiciones generales, comenta que estas solo sirven para ahogar la innovación que realmente puede beneficiar al consumidor promedio. Rune termina advirtiendo que prohibiciones generales como éstas sólo sirven para ahogar la innovación que realmente puede llegar a beneficiar al consumidor promedio. Pero tal como van, los efectos de las sanciones no se detuvieron con Tornado Cash. El reporte solo menciono servicios de mezclado directamente, pero algunos ven a Tornado como el primero de muchos dominios en caer. Aave respondió bloqueando todas las direcciones que han interactuado con Tornado Cash desde su front-end. Además, según un tweet de banteg, ciertamente no están solos en sus esfuerzos.   twitter.com    banteg @bantg  when defi apps started snitching on you, with links  2021-10-25 uniswap github.com/Uniswap/interf… 2022-05-10 ren github.com/renproject/bri… 2022-06-29 balancer github.com/balancer-labs/… 2022-08-11 oasis github.com/OasisDEX/oasis… 2022-08-12 aave github.com/aave/interface… (never) yearn, curve https://t.co/1FkgVPnUqb   11:52 PM - 12 Aug 2022           1.1K                280            Se proporcionan enlaces a las páginas de Github de Uniswap, Ren, Balancer, Oasis y Aave, destacando los momentos “en los que las DeFi apps empezaron a cantar”. Aqui puedes encontrar una discusión enfocada en las sanciones, así como el presunto arresto de un desarrollador de Tornado Cash.  Una Propuesta de ‘Presupuesto Basado en Proyectos’  @juan de SES-001, planteo sus ideas sobre un nuevo método de distribución presupuestario. La propuesta ve la estructura actual como desequilibrada, donde la “fuerza de trabajo” mantiene un control total sobre el trabajo que se está haciendo, así como su priorización. Un resumen de los cambios propuestos: ⮟ Actualmente, los holders de MKR:  Deben aceptarlo o rechazarlo, son incapaces de proporcionar dirección; y terminan discutiendo más sobre personas que sobre el trabajo.  Si se lleva a cabo la encuesta tal y como se propone, una CU propondría cualquier número de proyectos con todos los gastos asociados. Luego, se asignaría un presupuesto general, luego estos proyectos se votarían y clasificarían a través de la Gobernanza on-chain.  Hoja de Ruta de Alto Nivel de la Propuesta1974×1110 184 KB  Todos los proyectos que entran dentro del límite presupuestario asignado reciben financiación. Los que queden serán descartados. Esta implementación provee dos ventajas fundamentales: ⮟  Le da a los holders de MKR los medios para elegir los proyectos que quieren ver construidos. Actualmente, las propuestas presupuestarias tienden a una mentalidad de Core Unit vs. Holder de MKR. El modelo propuesto fomenta discusiones productivas sobre los méritos de los proyectos individuales, disminuyendo así la fricción inherente a un enfoque de “todo o nada”.  Aqui puedes encontrar el link de la propuesta y su debate.  Reporte Financiero Mensual | Julio del 2022  @adcv de SF-001 proporciona una vista actualizada de las finanzas actuales y previstas de la DAO. Aqui puedes encontrar el paquete de diapositivas completo. Un resumen del reporte: ⮟  710×278 14.1 KB   El post destaca estos tópicos como prioridades que la comunidad debe considerar:  [Petición de Señal] Objetivo de Nivel de Gasto de N6M Disminuir la tarifa de estabilidad de ETH/WBTC para reducir la dependencia de USDC y atraer mas prestatarios URGENTE: Petición de Señal para Establecer la bar del Aave D3M a 0% [GUNIV3-BUSD-DAI] MIP6 Formulario de Solicitud de Incorporación de Colateral Encuesta de Ratificación para Makershire Redux (MIP76) - 8 de Agosto del 2022  SF-001 cierra con una consulta de Dune que incluye todas las direcciones de wallets relevantes y su situación actual.    Aqui puedes encontrar el link de la propuesta y su debate.    Votación de Gobernanza y Compensación de Delegación   MIPX: Directrices para la Compensación de Maker   [Control de Temperatura] Directrices para la Compensación de MKR  La semana pasada, el Delegado Reconocido @CodeKnight presento una encuesta donde señala la naturaleza desorganizada de la compensación de MKR, haciendo notar que las directrices y métodos vigentes varían significativamente y son ajenos a la salud general de la DAO. Los participantes en la encuesta apoyaron vincular la compensación de MKR al estado financiero de la DAO, rechazaron vincularla al rendimiento de los precios del MKR y también rechazaron estandarizarla para implementar una compensación igual entre las Core Units. Unos días después, Codeknight presento la idea de la propuesta MIPX, la cual define una cantidad anual de MKR que cada Core Unit recibirá como compensación para reforzar los esfuerzos de contratación y retención de personal. El método de distribución propuesto es el de transferir la compensación de MKR a cada Facilitador de cada Core Unit y este tendrá la flexibilidad para encontrar la mejor manera de distribuir los fondos en función de la situación de la Core Unit determinada. El monto de compensación propuesto es de 75% del salario de la Core Unit con un calendario de adquisición de derechos de cuatro años y un año de cliff.  Campana para Incentivar las Votaciones de Gobernanza  El Facilitador de la Core Unit de Eventos, @PonJerry, posteo un plan para incentivar a los pequeños holders de MKR a participar en la Gobernanza de MakerDAO, mediante una campaña para incentivar las votaciones. La idea es aprovechar la gran demanda que tienen los tickets de DAIvinity y ofrecerlos como una recompensa por participar en las votaciones de Gobernanza. Los posibles beneficios incluyen:  Un aumento de <50 de la participación de los holders de MKR. Fomentar y promover la compra de MKR, así como la participación en las votaciones de gobernanza. Aumento de las conversaciones en las redes sociales sobre las votaciones de MKR. Atraer más atención de los medios hacia Maker en general. Mejor representación de los holders de MKR en los eventos de DAIvinity.    Propuestas de Financiación para Propósitos Especiales (SPF)  SPF para El Programa Embajador  Esta RFC de @kat sobre la Subpropuesta MIP55c3-SP7, solicita la asignación de 81.000 DAI al Programa Embajador, una iniciativa que busca crear más recursos y contenidos educativos sobre MakerDAO en otros idiomas, a parte del inglés. Hasta ahora, el programa se ha enfocado principalmente en el español, resultando en un aumento significativo en los usuarios y temas relacionados a Latinoamérica en el foro.   SPF para el Trabajo de Ámbito Legal de bIBTA  Esta RFC de @adcv, de la Core Unit de Finanzas Estratégicas, solicita un adelanto de 50k para cubrir los gastos legales implicados en darle luz verde a la solicitud de aplicación de bIBTA. Con la financiación se investigará cualquier consecuencia legal que se pueda derivar de la incorporación de una vault de bIBTA, un requisito previo para poder continuar con el trabajo técnico del proyecto.   The Chopping Block - Debate en Vivo  The Chopping Block Live! - con Hasu y Rune - YouTube  @Hasu y @rune participaron en un debate en vivo con Robert Leshner de Compound y otros, sobre el futuro de MakerDAO. Los temas cubiertos incluyen:  El Modelo de Negocios de MakerDAO, Posibles implicaciones en la estrategia de colaterales de MakerDAO, como resultado de las sanciones a Tornado Cash Las diferentes aproximaciones que tiene Hasu y Rune sobre la gobernanza de la DAO.     Esta Semana en Gobernanza   Actualización Semanal de MIPs #100!  Encuestas de Ratificación, propuestas y discusiones pre-MIP.   Votación(es) Ejecutiva(s) Después de una inesperada cuota de idas y vueltas con algunas de las partes implicadas, se propusieron y aprobaron los siguientes cambios dentro del Protocolo Maker: Cambio de Parámetros del MOMC, Autorización para Retirar DAI de la vault de SocGen, Compensación de los Delegados Reconocidos, Enmienda al Acuerdo Legal de HVBank - 12 de Agosto del 2022, – Aprobada el 12 de Agosto del 2022 a las 21:20 UTC. Ejecutada el 14 de Agosto del 2022 a las 21:23 UTC. Se aplicaron los cambios de parámetros de la última propuesta del Comité de Mercado Abierto de MakerDAO, incluidas las tarifas de estabilidad y los techos de deuda máximos (line):  Se aplicaron los siguientes cambios de parámetros, según lo estipulado en la última propuesta del Comité de Mercado Abierto de MakerDAO, incluyendo las Tarifas de Estabilidad y el Techo de Deuda Máximo (line):      Parámetro Tipo de Vault  + / - De / a     Tarifa de Estabilidad ETH-B - 4% / 3.75%   Tarifa de Estabilidad WSTETH-A - 2.50% / 2.25%   Tarifa de Estabilidad WSTETH-B - 0.75% / 0%   Tarifa de Estabilidad WBTC-B - 4% / 3.75%   Tarifa de Estabilidad GUNIV3DAIUSDC1-A + 0.01% / 0.02%   Tarifa de Estabilidad GUNIV3DAIUSDC2-A + 0.05% / 0.06%   Tarifa de Estabilidad UNIV2DAIUSDC-A + 0.01% / 0.02%   Techo de Deuda Máximo (line) GUNIV3DAIUSDC1-A + 750M DAI / 1B DAI   Techo de Deuda Máximo (line) GUNIV3DAIUSDC2-A + 1B DAI / 1.25B DAI   Techo de Deuda Máximo (line) MANA-A + 15M DAI / 17M DAI      Se autorizo a que SocGen Forge retire DAI de la vault de SocGen previamente activada (RWA-008):  El token OFH SocGenForge fue incorporado el 2 de Agosto del 2022. Sin embargo, debido a que los holders clave no estaban disponibles durante la creación y validación del spell, no se pudo verificar la propiedad de la wallet del ‘operador’. La propiedad ya ha sido verificada. Se le otorgo el permiso final a la wallet de SocGen, que les permitirá retirar DAI. Por favor, consulta este post de la Core Unit de Servicios de Ingeniería de Colaterales (CES-001) que explica esto más a detalle.    Un total de 121.808 DAI fueron transferidos a múltiples Delegados Reconocidos:       Delegado Cantidad Dirección     Flip Flop Flap Delegate LLC 12.000 DAI 0x688d508f3a6B0a377e266405A1583B3316f9A2B3   Feedblack Loops LLCC 12.000 DAI 0x80882f2A36d49fC46C3c654F7f9cB9a2Bf0423e1   JustinCase 12.000 DAI 0xE070c2dCfcf6C6409202A8a210f71D51dbAe9473   Doo 12.000 DAI 0x3B91eBDfBC4B78d778f62632a4004804AC5d2DB0   schuppi 11.918 DAI 0xCCffDBc38B1463847509dCD95e0D9AAf54D1c167   Flipside Crypto 11.387 DAI 0x62a43123FE71f9764f26554b3F5017627996816a   Penn Blockchain 9.438 DAI 0x2165d41af0d8d5034b9c266597c1a415fa0253bd   Chris Blec 9.174 DAI 0xa3f0AbB4Ba74512b5a736C5759446e9B50FDA170   GFX Labs 8.512 DAI 0xa6e8772af29b29B9202a073f8E36f447689BEef6   MakerMan 6.912 DAI 0x9AC6A6B24bCd789Fa59A175c0514f33255e1e6D0   ACREInvest 6.628 DAI 0x5b9C98e8A3D9Db6cd4B4B4C1F92D0A551D06F00D   mhonkasalo & teemulau 4.029 DAI 0x97Fb39171ACd7C82c439b6158EA2F71D26ba383d   Llama 3.797 DAI 0x82cD339Fa7d6f22242B31d5f7ea37c1B721dB9C3   [email protected] 2.013 DAI 0xdC1F98682F4F8a5c6d54F345F448437b83f5E432     Se actualizaron los acuerdos legales de HVBank (RWA-009) para facilitar el retorno de los fondos, como se detalla en este post.    Encuestas Activas     Nombre de la Encuesta Discusión Fecha de Inicio Fecha de Cierre     Despliegue del Teleport de Maker en Starknet y Parámetros de Riesgo Asociados Discusion 15 de Agosto del 2022 a las 16:00 UTC 18 de Agosto del 2022 a las 16:00 UTC      Encuestas de Ratificación Queda menos de una semana para participar en estas encuestas:     Nombre de la Encuesta Discusión Fecha de Inicio Fecha de Cierre     Modificar el Presupuesto de la Core Unit de la Fundación DAI (MIP40c3-SP74) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC   Enmiendas al Proceso de Desincorporación de las Core Units (MIP4c2-SP15) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC   Modificar el Presupuesto de la Core Unit de Oráculos (MIP40c3-SP75) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC   MIP50 Modificación del Módulo de Deposito Directo de DAI (MIP4c2-SP23) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC   Makershire Redux (MIP76) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC   Desincorporación la Core Unit de Eventos (EVENTS-001) Discusion 08 de Agosto del 2022 a las 16:00 UTC 22 de Agosto del 2022 a las 16:00 UTC      Encuestas del Visto Bueno de la Comunidad Recientemente publicadas y esperando tu participación:     Encuesta Desglose de la Votación Fecha de Inicio Fecha de Cierre     RWA Arranger  15 de Agosto del 2022 a las 16:00 UTC 29 de Agosto del 2022 a las 16:00 UTC   Cabot (Cabot Renewable Energy Crypto Mining LLC)  15 de Agosto del 2022 a las 16:00 UTC 29 de Agosto del 2022 a las 16:00 UTC   DDC (Detox Digital Coin)  15 de Agosto del 2022 a las 16:00 UTC 29 de Agosto del 2022 a las 16:00 UTC      Encuestas Finalizadas Finalmente, nuestra última encuesta del visto bueno de la comunidad, la cual fue rechazada:     Nombre de la Encuesta Desglose de la Votación Fecha de Cierre     Encuesta del Visto Bueno de la Comunidad: MIP9 - Pando (Activos Climáticos de Nivel de Inversión de Pando)  15 de Agosto del 2022 a las 16:00 UTC       Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:  Comité de Votación Descentralizado Abierto - Presentado Endgame v3 | video  Horario de Oficina de los Delegados | video  Gobernanza y Riesgo - Ep. 203 | Foro | video  Comité de Votación Descentralizado Abierto - Endgame v3 | video   Llamadas Recientes:  Llamada de Colateral #47 - BlockTower Credit (Arranger) AMA | Foro | Link | Comité de Votación Descentralizado Abierto | Foro | Link | Horario de Oficina de los Delegados | Foro | Link | Gobernanza y Riesgo - Ep. 204 | Foro | Link: 748478 | Comité de Votación Descentralizado Abierto | Foro | Link |    Horario de Oficina de las Core Units    Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC | Alternativa: Link para unirse - Cada dos Miércoles a las 15:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Growth - Primer Miércoles de Cada Mes a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | Capital 6S - Cada dos Miércoles a las 14:00 UTC    Recursos  Abrir Lista  Todos los Paneles Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Rastreador del Panel de Gobernanza | Versión Google Sheet   Conoce tu Índice MIP   Portal de Aprendizaje y Documentación Técnica   Servidores de Discord de MakerDAO   MakerBurn   Lista de los Horarios de Oficina   Herramientas de Participacion   Calendario de Votación y Fechas Importantes    Descargo de Responsabilidad Esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de ser asesoramiento financiero, ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación.  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix. ",
                    "links": [
                        "https://home.treasury.gov/news/press-releases/jy0916",
                        "https://www.federalregister.gov/documents/2015/04/02/2015-07788/blocking-the-property-of-certain-persons-engaging-in-significant-malicious-cyber-enabled-activities",
                        "https://www.coindesk.com/layer2/2022/08/12/an-alleged-tornado-cash-developer-was-arrested-are-you-next/",
                        "https://cryptoslate.com/defi-protocols-aave-uniswap-balancer-ban-users-following-ofac-sanctions-on-tornado-cash/",
                        "https://twitter.com/bantg/status/1558240022956064768?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1558240022956064768%7Ctwgr%5E5bf21580b894302857d97cd4faf557aad2a554eb%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fcryptoslate.com%2Fdefi-protocols-aave-uniswap-balancer-ban-users-following-ofac-sanctions-on-tornado-cash%2F",
                        "https://twitter.com/bantg/status/1558240022956064768?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1558240022956064768%7Ctwgr%5E5bf21580b894302857d97cd4faf557aad2a554eb%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fcryptoslate.com%2Fdefi-protocols-aave-uniswap-balancer-ban-users-following-ofac-sanctions-on-tornado-cash%2F",
                        "https://twitter.com/bantg/status/1558240022956064768?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1558240022956064768%7Ctwgr%5E5bf21580b894302857d97cd4faf557aad2a554eb%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fcryptoslate.com%2Fdefi-protocols-aave-uniswap-balancer-ban-users-following-ofac-sanctions-on-tornado-cash%2F",
                        "https://github.com/Uniswap/interface/pull/2623",
                        "https://github.com/renproject/bridge-v2/commit/",
                        "https://github.com/balancer-labs/frontend-v2/pull/2017",
                        "https://github.com/OasisDEX/oasis-borrow/pull/923",
                        "https://github.com/aave/interface/pull/1017",
                        "https://t.co/1FkgVPnUqb",
                        "https://twitter.com/bantg/status/1558240022956064768?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1558240022956064768%7Ctwgr%5E5bf21580b894302857d97cd4faf557aad2a554eb%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fcryptoslate.com%2Fdefi-protocols-aave-uniswap-balancer-ban-users-following-ofac-sanctions-on-tornado-cash%2F",
                        "https://forum.makerdao.com/t/arrest-of-suspected-developer-of-tornado-cash-in-amsterdam/17214/8",
                        "https://forum.makerdao.com/t/project-based-budgeting/17121",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/a/c/ace4e2de0c75659f1b37580b47058f8d594f0744.jpeg",
                        "https://forum.makerdao.com/t/project-based-budgeting/17121",
                        "https://forum.makerdao.com/t/financial-report-2022-07/17194",
                        "https://forum.makerdao.com/t/financial-report-2022-07/17194",
                        "https://forum.makerdao.com/t/signal-request-n6m-target-spend-level/17122",
                        "https://forum.makerdao.com/t/lower-eth-wbtc-stability-fees-to-reduce-usdc-reliance-and-attract-more-borrowers/17192",
                        "https://forum.makerdao.com/t/urgent-signal-request-set-aave-d3m-bar-to-0/15800",
                        "https://forum.makerdao.com/t/guniv3-busd-dai-mip6-collateral-onboarding-application-form/17185",
                        "https://vote.makerdao.com/polling/QmTYQskE#vote-breakdown",
                        "https://dune.com/queries/1153754",
                        "https://forum.makerdao.com/t/financial-report-2022-07/17194",
                        "https://forum.makerdao.com/t/mipx-maker-compensation-guidelines/17235",
                        "https://forum.makerdao.com/t/temperature-check-guidelines-for-mkr-compensation/17170",
                        "https://forum.makerdao.com/t/governance-voting-incentive-campaign/17158",
                        "https://forum.makerdao.com/t/mip55c3-sp7-special-purpose-fund-for-the-ambassador-program/17169",
                        "https://forum.makerdao.com/t/mip55c3-sp6-legal-domain-work-on-greenlit-collateral-bibta-special-purpose-fund/17166",
                        "https://forum.makerdao.com/t/live-debate-with-rune-hasu/17143",
                        "https://www.youtube.com/watch?v=kqap4lfLlnY",
                        "https://forum.makerdao.com/t/weekly-mips-update-100/17265",
                        "https://forum.makerdao.com/t/postponing-scheduled-2022-08-09-executive/17145",
                        "https://vote.makerdao.com/executive/template-executive-vote-momc-parameter-changes-socgen-vault-drawdown-authorization-recognized-delegate-compensation-hvbank-legal-agreement-amendment-august-12-2022",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-july-2022/16895",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://vote.makerdao.com/executive/template-executive-vote-onboarding-real-world-asset-vaults-july-29-2022",
                        "https://forum.makerdao.com/t/security-tokens-refinancing-mip6-application-for-ofh-tokens/10605/42",
                        "https://forum.makerdao.com/t/socgen-forge-ofh-granting-final-permission-after-the-onboarding/17033",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://etherscan.io/address/0x688d508f3a6B0a377e266405A1583B3316f9A2B3",
                        "https://vote.makerdao.com/address/0x845b36e1e4f41a361dd711bda8ea239bf191fe95",
                        "https://etherscan.io/address/0x80882f2A36d49fC46C3c654F7f9cB9a2Bf0423e1",
                        "https://vote.makerdao.com/address/0xcdb792c14391f7115ba77a7cd27f724fc9ea2091",
                        "https://etherscan.io/address/0xE070c2dCfcf6C6409202A8a210f71D51dbAe9473",
                        "https://vote.makerdao.com/address/0x8804d391472126da56b9a560aef6c6d5aaa7607b",
                        "https://etherscan.io/address/0x3B91eBDfBC4B78d778f62632a4004804AC5d2DB0",
                        "https://vote.makerdao.com/address/0xb21e535fb349e4ef0520318acfe589e174b0126b",
                        "https://etherscan.io/address/0xCCffDBc38B1463847509dCD95e0D9AAf54D1c167",
                        "https://vote.makerdao.com/address/0x84b05b0a30b6ae620f393d1037f217e607ad1b96",
                        "https://etherscan.io/address/0x62a43123FE71f9764f26554b3F5017627996816a",
                        "https://vote.makerdao.com/address/0x7ddb50a5b15aea7e7cf9ac8e55a7f9fd9d05ecc6",
                        "https://etherscan.io/address/0x2165d41af0d8d5034b9c266597c1a415fa0253bd",
                        "https://vote.makerdao.com/address/0x2c511d932c5a6fe4071262d49bfc018cfbaaa1f5",
                        "https://etherscan.io/address/0xa3f0AbB4Ba74512b5a736C5759446e9B50FDA170",
                        "https://vote.makerdao.com/address/0xf60d7a62c98f65480725255e831de531efe3fe14",
                        "https://etherscan.io/address/0xa6e8772af29b29B9202a073f8E36f447689BEef6",
                        "https://vote.makerdao.com/address/0x22d5294a23d49294bf11d9db8beda36e104ad9b3",
                        "https://etherscan.io/address/0x9AC6A6B24bCd789Fa59A175c0514f33255e1e6D0",
                        "https://vote.makerdao.com/address/0x4d3ac33ab1dd7b0f352b8e590fe8b62c4c39ead5",
                        "https://etherscan.io/address/0x5b9C98e8A3D9Db6cd4B4B4C1F92D0A551D06F00D",
                        "https://vote.makerdao.com/address/0xaa19f47e6acb02df88efa9f023f2a38412069902",
                        "https://etherscan.io/address/0x97Fb39171ACd7C82c439b6158EA2F71D26ba383d",
                        "https://vote.makerdao.com/address/0x4e314eba76c3062140ad196e4ffd34485e33c5f5",
                        "https://etherscan.io/address/0x82cD339Fa7d6f22242B31d5f7ea37c1B721dB9C3",
                        "https://vote.makerdao.com/address/0xb8df77c3bd57761bd0c55d2f873d3aa89b3da8b7",
                        "https://etherscan.io/address/0xdC1F98682F4F8a5c6d54F345F448437b83f5E432",
                        "https://forum.makerdao.com/t/urgent-executive-inclusion-request/17179",
                        "https://vote.makerdao.com/polling/QmbWkTvW",
                        "https://forum.makerdao.com/t/request-for-poll-starknet-bridge-deposit-limit-and-starknet-teleport-fees/17187",
                        "https://vote.makerdao.com/polling/QmQJ9hYq",
                        "https://forum.makerdao.com/t/mip40c3-sp74-modify-dai-foundation-core-unit-budget-daif-001/16379/4",
                        "https://vote.makerdao.com/polling/QmbBh8t4",
                        "https://forum.makerdao.com/t/new-mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://vote.makerdao.com/polling/Qma3P8v9",
                        "https://forum.makerdao.com/t/mip40c3-sp75-modify-oracles-core-unit-budget-ora-001/16397",
                        "https://vote.makerdao.com/polling/QmWYXAdd",
                        "https://forum.makerdao.com/t/mip4c2-sp23-mip50-direct-deposit-module-amendment/16387",
                        "https://vote.makerdao.com/polling/QmTYQskE",
                        "https://forum.makerdao.com/t/mip76-makershire-redux/16400",
                        "https://vote.makerdao.com/polling/QmTNaLnY",
                        "https://forum.makerdao.com/t/mip40c3-sp73-modify-core-unit-budget-events-001/15991",
                        "https://vote.makerdao.com/polling/QmY85FT6",
                        "https://vote.makerdao.com/polling/Qmekx2wh",
                        "https://vote.makerdao.com/polling/QmWVVivW",
                        "https://vote.makerdao.com/polling/QmawHstd",
                        "https://youtu.be/DmR4LDPX9LA",
                        "https://youtu.be/Lzr5bzYGJas",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://youtu.be/AZfl49_N32I",
                        "https://youtu.be/MGJy2Wo3cDg",
                        "https://www.google.com/url?q=https://forum.makerdao.com/t/collateral-onboarding-call-47-blocktower-credit-arranger-ama/17128&sa=D&source=calendar&ust=1661089765064760&usg=AOvVaw2-EnS5zXTeE7caQkxfVYnw",
                        "https://meet.google.com/waw-yfsk-pat?authuser=1&hs=122",
                        "https://forum.makerdao.com/search?q=DVC%20%23resources%3Acalls-meetings%20order%3Alatest_topic",
                        "https://us02web.zoom.us/j/89326394914",
                        "https://forum.makerdao.com/search?q=delegate%20office%20hours%20%23resources%3Acalls-meetings%20order%3Alatest_topic",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/88286550832?pwd%3DdWQzQi9tYlNyemJJS2Nrd2NUdTBoZz09&sa=D&source=calendar&ust=1661089765064760&usg=AOvVaw2Zme_yH2mUPeCl5MIn5g2k",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/search?q=DVC%20%23resources%3Acalls-meetings%20order%3Alatest_topic",
                        "https://us02web.zoom.us/j/82286534666",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4363027597402604
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#2",
                    "likes": "1",
                    "time": "20/08/2022-04:09:54",
                    "content": "Gracias @Joserjimz por la traducción. justo hace unos minutos publicab un comentario sobre el tema en relación a tornado cash, circle y el departamento del tesoro de EEUU, y toda la ola de miedo y noticias negativas que se ha esparcido en la red. Este tema me ha sido de ayuda para seguir entendiendo esta situación. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-16-22-de-agosto-del-2022/17444",
            "title": "Relay Semanal | 16 - 22 de Agosto del 2022 ",
            "index": 17444,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "8",
                    "time": "25/08/2022-17:45:06",
                    "content": " 2582×565 112 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu parada obligatoria para estar al día con todas las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus y @Artem_Gordon  Versión Online en PDF     EVENTOS ACTUALES  A menudo las DAOs son juzgadas por sus defectos, pero ¿en cuanto a sus triunfos? Bueno, quizás es porque el éxito no vende. En su lugar, la galería de cacahuates se congrega en masa, armados con sonrisas engreídas y retorica barata. Las últimas dos semanas han sido complicadas. No hay que negar eso, pero también hemos visto una tremenda respuesta de la comunidad en general para establecer un plan de acción viable en el ínterin. Y ahí radica la fuerza de una DAO, poder responder con rapidez a los problemas que se presentan.  MIP41c5-SP10: Desincorporación de Facilitador (RWF-001)  Con la autoría de los Delegados Reconocidos; @ultraschuppi y @JustinCase, esta MIP propone desincorporar al Facilitador Titular de RWF-001. Para resumir sus motivaciones: ⮟  De acuerdo con la propuesta, @williamr esta “cediendo activamente” sus responsabilidades en RWF-001. Además, los actuales proyectos de RWF-001 han sido “abandonados”.  Esta MIP busca proporcionarle a los holders de MKR una opción para actuar si, en el momento en que la propuesta pase a la etapa on-chain, RWF-001 continua eludiendo las responsabilidades señaladas en su mandato. Dicho esto, es preferible un plan de acción tangible, articulado y ejecutado por williamr. Las MIPS y propuestas que se presentan a continuación representan el trabajo encomendado a RWF-001, que actualmente está siendo llevado a cabo por distintas CU y partes interesadas.  MIP55c3-SP8: Trabajo Legal sobre la MIP65 Financiación para Propósitos Especiales (SPF)  Esta MIP, redactada por @adcv, @aes y @SebVentures, solicita una SPF por un total 30k DAI para reembolsar a @christiancdpetersen, por el trabajo legal requerido en el avance del acuerdo ratificado en la MIP65: Monetalis Clydesdale | Estrategia y Ejecución de Bonos Liquidos. Desglose de la Financiación ⮟  En la MIP65, williamr también compartio sus reflexiones actualizadas sobre el estado y la continuidad del proyecto.  Estoy recomendando una enmienda a la MIP65, basada en cambios relacionados con la responsabilidad de la ejecución del trabajo legal para esta estructura. La MIP65 se redactó originalmente con un alcance en mente, el cual actualmente está cambiando debido a las solicitudes de financiación de otras Core Units: CES y SF. Con eso en mente, es natural que también se modifique sobre quien recae la verificación del cumplimiento de los deberes legales, para reflejar los cambios en los responsables de llevar a cabo el trabajo. O por lo menos, supervisar que la revisión legal se haya hecho de acuerdo con las mejores prácticas. Dado que RWF no está empleando al contratista legal para llevar a cabo la revisión de la MIP65, por lo tanto, es natural que no tenga la responsabilidad de supervisar si la ejecución se llevó a cabo correctamente. De esta manera, estoy solicitando que la gobernanza alinee el trabajo de verificación legal y la estructura de gobernanza con la responsabilidad del desempeño de la tarea de revisión legal. Siendo responsabilidad de la core unit al mando, cualquiera que sea el equipo que contrate los servicios jurídicos para esta MIP. Gracias, William.   Solicitud de Financiación basada en Proyectos de Incorporación de Colaterales (PFR)  En respuesta a lo anterior, Monkey.irish hizo la petición de una Solicitud de Financiación basada en Proyectos de Incorporación de Colaterales (PFR), para utilizar el presupuesto existente de la core unit de CES-001, en servicios profesionales relacionados al manejo e incorporación de activos colaterales. Desglose de la Financiación ⮟ La PFR solicita que se apruebe el uso de:  44.000 DAI o 45% de la actual partida presupuestaria de los Servicios Profesionales de CES-001. 56.000 DAI o 40% del Buffer de Contingencia actual de CES-001.  La propuesta recalca que el total o los 100k DAI, solo representan una asignación debido a la significativa variación en el costo de servicios profesionales específicos de los activos del mundo real (RWAs). Bajo los términos de esta propuesta, CES-001 cumpliría los requisitos de incorporación y gestión de los RWA, rol que actualmente está a cargo de RWF-001.  Nota: esta propuesta busca ser una alternativa a varios SPFs derivados de acuerdos que quedaron en pausa por la situación actual de RWF-001.    Acuerdo de RWAs con el Banco de Huntingdon Valley: ¡Anuncio Oficial!      Crédito: @Growth-Core-Unit  Hoy es un momento decisivo para verdaderamente visualizar el potencial de conectar a las finanzas descentralizadas con las finanzas del mundo real. El Banco de Huntingdon Valley y Maker son pioneros del primer préstamo comercial entre Instituciones Financieras Reguladas por U.S.A y una moneda digital descentralizada. Maker se está conectando a la economía a través de la mayor vault de activos del mundo real hasta la fecha y su primera relación con un banco con sede en Estados Unidos. Esta integración implica una facilidad de participación de 100 millones de DAI para respaldar el crecimiento de los negocios nuevos y existentes del Banco de Huntingdon Valley.    Herramientas para Visualizar las Prioridades de los Delegados: Resultados del 1er Round  El Delegado Reconocido @rspa, compartió los resultados de la encuesta que le envió a los delegados el mes pasado. La encuesta pretendía ser una “herramienta para permitir el consenso”, a través de revelar que prioridades tienen los delegados para los próximos tres meses. Primero se le pregunto a los participantes que introdujeran los temas prioritarios en una hoja de cálculo, luego se le pidió que distribuyeran 1.000 puntos entre los temas prioritarios ya recopilados, para ayudar a determinar un “puntaje de priorización colectivo”.  1035×358 39.4 KB  Las tres prioridades principales son:  Incrementar el uso de las vaults (2399.84 puntos) Incrementar el suministro de DAI (1844 puntos) Potenciar la MIP65 y otras estrategias de rendimiento del PSM (1824 puntos)  La comunidad recibió bien esta iniciativa, la cual favorece a que se organice otra ronda.   Programa de Delegación de Llama  @luca_pro anuncio en Discord que se uniría al programa de delegación de @Llama, como Capitán de Delegación, encabezando las comunicaciones públicas de Llama. Llama trabaja con varias DAOs y Protocolos DeFi reconocidos, incluyendo Aave, Uniswap, Gitcoin y más. Puedes ver su Plataforma de Delegado aqui.   Plataforma de Delegado de Frontier Research  @Matt_NZ público su Plataforma de Delegado como Frontier Research LLC. Matt, que ha estado siguiendo activamente a MakerDAO desde el 2019, es un abogado y académico legal de Nueva Zelanda, especializado en la intersección entre las leyes y la tecnología. Él se especializa en las finanzas descentralizadas, la gobernanza descentralizada y el ambiente regulatorio alrededor de las tecnologías emergentes.   ¡La Hora Feliz del Delegado! con The Schuppi y ElPro feat. Greg DiPrisco de RWA Co  @g_dip de RWA Company LLC estuvo en el último episodio de ¡La Hora Feliz del Delegado! Con Schuppi y ElPro, para junto con nuestros hosts (y espectadores) favoritos saber cómo le está yendo a Maker con los Activos del Mundo Real y hablar un poco sobre whisky. Mira el episodio completo aquí.   Las Llamadas del DVC para el Plan Endgame del 17 y 18 fueron Canceladas  Las reuniones del Comité de Votación Descentralizado de la semana pasada fueron canceladas para darle tiempo a @rune de actualizar el Plan Endgame, debido a la nueva situación regulatoria y las sanciones a Tornado Cash.    Esta Semana en Gobernanza   Actualizaciones de MIPs Semanales #101  Encuestas de Ratificación, propuestas y discusiones pre-MIP.   Votación(es) Ejecutiva(s) No todos nuestros problemas se resolvieron la semana pasada y tampoco se resolverán muchos de ellos esta semana. Sin embargo, puedes tomar una galleta mientras recordamos el resultado de nuestra última Propuesta Ejecutiva.    Propuesta Ejecutiva de la Semana Pasada: Cambios de Parámetros del  MOMC, Autorización sobre la Vault de SocGen, Compensación a los Delegados Reconocidos, Enmienda al Acuerdo Legal de HVBank – Aprobada el 12 de Agosto del 2022 a las 21:20 UTC. Ejecutada el 14 de Agosto del 2022 a las 21:23 UTC.    Encuestas Activas     Nombre de la Encuesta Discusión Fecha de Inicio Fecha de Cierre     Objetivo de Nivel del Gasto Discusión 22 de Agosto del 2022 a las 16:00 UTC 25 de Agosto del 2022 a las 16:00 UTC   Solicitud de Financiación basada en Proyectos de Incorporación de Colaterales (PFR) Discusión 22 de Agosto del 2022 a las 16:00 UTC 25 de Agosto del 2022 a las 16:00 UTC      Encuestas del Visto Bueno de la Comunidad Las que quedan:     Encuesta Desglose de la Votación Fecha de Inicio Fecha de Cierre     RWA Arranger  2312×582 84.2 KB  15 de Agosto del 2022 a las 16:00 UTC 29 de Agosto del 2022 a las 16:00 UTC   Cabot (Cabot Renewable Energy Crypto Mining LLC)  2295×587 84.9 KB  15 de Agosto del 2022 a las 16:00 UTC 29 de Agosto del 2022 a las 16:00 UTC   DDC (Detox Digital Coin)  2290×580 86.3 KB  15 de Agosto del 2022 a las 16:00 UTC 29 de Agosto del 2022 a las 16:00 UTC      Encuestas Finalizadas     Nombre de la Encuesta Desglose de la Votación Fecha de Cierre     Encuesta de Ratificación para Modificar el Presupuesto de la Core Unit de la Fundación DAI (MIP40c3-SP74)  22 de Agosto del 2022 a las 16:00 UTC   Encuesta de Ratificación de Enmiendas al Proceso de Desincorporación de las Core Units (MIP4c2-SP15)  22 de Agosto del 2022 a las 16:00 UTC   Encuesta de Ratificación para Modificar el Presupuesto de la Core Unit de Oráculos (MIP40c3-SP75)  22 de Agosto del 2022 a las 16:00 UTC   Encuesta de Ratificación para la Modificación del Módulo de Deposito Directo de DAI MIP50 (MIP4c2-SP23)  22 de Agosto del 2022 a las 16:00 UTC   Encuesta de Ratificación para Makershire Redux (MIP76)  22 de Agosto del 2022 a las 16:00 UTC   Encuesta de Ratificación para Desincorporar la Core Unit de Eventos (EVENTS-001)  22 de Agosto del 2022 a las 16:00 UTC       Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:  Llamada de Colateral #47 - BlockTower Credit (Arranger) AMA | Foro | Video  Horario de Oficina de los Delegados | Foro | Video  Gobernanza y Riesgo - Ep. 204 | Foro | Video   Llamadas Recientes:  Gobernanza y Riesgo #205 | Foro | Link | Conoce Tu MIP #13 | Foro | Link | Conoce Tu Delegado #18 | Foro | Link | Comité de Votación Descentralizado | Foro | Link |    Horario de Oficina de las Core Units    Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC | Alternativa: Link para unirse - Cada dos Miércoles a las 15:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Growth - Primer Miércoles de Cada Mes a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | 6S Capital - Cada dos Miércoles a las 14:00 UTC    Recursos  Abrir Lista  Todos los Paneles Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Rastreador del Panel de Gobernanza | Versión Google Sheet   Conoce tu Índice MIP   Portal de Aprendizaje y Documentación Técnica   Servidores de Discord de MakerDAO   MakerBurn   Lista de los Horarios de Oficina   Herramientas de Participacion   Calendario de Votación y Fechas Importantes    Descargo de Responsabilidad Esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de ser asesoramiento financiero, ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación.  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip41c5-sp10-facilitator-offboarding-rwf-001/17332/4",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-liquid-bond-strategy-execution/13148/112",
                        "https://forum.makerdao.com/t/mip55c3-sp6-legal-domain-work-on-greenlit-collateral-bibta-special-purpose-fund/17166",
                        "https://forum.makerdao.com/t/mip55c3-sp8-legal-work-on-mip65-special-purpose-fund/17280",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-liquid-bond-strategy-execution/13148",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-liquid-bond-strategy-execution/13148/112",
                        "https://forum.makerdao.com/t/collateral-onboarding-project-based-funding-request-pfr/17290",
                        "https://www.youtube.com/watch?v=06cIXcap7dM",
                        "https://forum.makerdao.com/t/delegate-priority-surfacing-tool-round-1-results/17341",
                        "https://discord.com/channels/893112320329396265/899667119426371625/1009440749739327509",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298",
                        "https://forum.makerdao.com/t/the-schuppi-and-elpro-delegate-happy-hour-featuring-greg-diprisco-of-rwa-co/17346",
                        "https://www.youtube.com/watch?v=18MGJV-3OXc",
                        "https://forum.makerdao.com/t/endgame-dvc-meetings-cancelled-this-week/17302",
                        "https://forum.makerdao.com/t/weekly-mips-update-101/17392",
                        "https://vote.makerdao.com/executive/template-executive-vote-momc-parameter-changes-socgen-vault-drawdown-authorization-recognized-delegate-compensation-hvbank-legal-agreement-amendment-august-12-2022",
                        "https://vote.makerdao.com/polling/QmY8Fs9t",
                        "https://forum.makerdao.com/t/signal-request-n6m-target-spend-level/17122",
                        "https://vote.makerdao.com/polling/QmfRkWCP",
                        "https://forum.makerdao.com/t/collateral-onboarding-project-based-funding-request-pfr/17290",
                        "https://vote.makerdao.com/polling/QmY85FT6",
                        "https://vote.makerdao.com/polling/Qmekx2wh",
                        "https://vote.makerdao.com/polling/QmWVVivW",
                        "https://vote.makerdao.com/polling/QmQJ9hYq",
                        "https://vote.makerdao.com/polling/QmbBh8t4",
                        "https://vote.makerdao.com/polling/Qma3P8v9",
                        "https://vote.makerdao.com/polling/QmWYXAdd",
                        "https://vote.makerdao.com/polling/QmTYQskE",
                        "https://vote.makerdao.com/polling/QmTNaLnY",
                        "https://www.google.com/url?q=https://forum.makerdao.com/t/collateral-onboarding-call-47-blocktower-credit-arranger-ama/17128&sa=D&source=calendar&ust=1661089765064760&usg=AOvVaw2-EnS5zXTeE7caQkxfVYnw",
                        "https://www.youtube.com/watch?v=LOQm8NxzR7w",
                        "https://forum.makerdao.com/search?q=delegate%20office%20hours%20%23resources%3Acalls-meetings%20order%3Alatest_topic",
                        "https://www.youtube.com/watch?v=TSJgiSTYq20",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://www.youtube.com/watch?v=Rv-lBWmiBLE",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/t/know-your-mip-kym-13-makerdao-delegates-mip-set/17396",
                        "https://us02web.zoom.us/j/87455676075?pwd=aWxyMyt2M1VVQ0ZhSGpmYjlQRVRDdz09",
                        "https://forum.makerdao.com/tag/pubcall-:-meet-your-delegate",
                        "https://us02web.zoom.us/j/82028662414?pwd=VVdqVmRHSlhwQlZZL0pMWXNNelkxdz09",
                        "https://forum.makerdao.com/t/wednesday-and-thursday-endgame-dvc-meetings-presenting-endgame-v3/17144",
                        "https://us02web.zoom.us/j/89326394914",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/11"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.636574074074074
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-5-11-de-julio-del-2022/16629",
            "title": "Relay Semanal | 5 - 11 de Julio del 2022 ",
            "index": 16629,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "10",
                    "time": "15/07/2022-16:45:03",
                    "content": " image2585×577 97.3 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu parada obligatoria para estar al día con todas las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus y @Artem_Gordon  Versión Online en PDF    ¿Qué está ocurriendo en la DAO?    Aave propone su propia stablecoin sobrecolateralizada: GHO Aunque aún se mantiene en un estado de sondeo, el anuncio vino de Aave Companies, la entidad centralizada que respalda al protocolo. Maker y Aave son protocolos de préstamos, pero tradicionalmente han funcionado bajo diferentes modelos de negocios.   A través del Protocolo de Maker, los usuarios depositan activos para generar una cantidad determinada de DAI, relativa al valor de su depósito.*   Aave optó por el enfoque más tradicional, donde los usuarios depositan activos para ganar intereses. Estos depósitos son prestados a los prestatarios con una prima.   Entra en escena GHO, una stablecoin sobrecolateralizada, respaldada por múltiples activos digitales, los cuales solo pueden ser acuñados (minted) contra colateral depositado. Si GHO está por encima de su peg, es rentable mintearlo utilizando otra stablecoin y shorteandola a través de pools de stableswap. Y ¿si cae por debajo del peg? Pagar de vuelta la deuda acumulada sería el camino más rentable, permitiendo que el suministro total de GHO se contraiga, a medida que se quema la deuda pagada. Por supuesto, todo esto suena vagamente familiar… De forma sencilla, GHO aspira a posicionarse como un competidor directo de DAI con tokenomics casi idénticas. Haz clic aquí para más información sobre la propuesta de GHO   ¿Qué hace que GHO sea diferente? Rendimiento. Los que minteen GHO recibirán recompensas en tokens, tanto en los depósitos como en los préstamos, lo que permitiría un rendimiento “doble”. Estos incentivos se amplían a través de ofrecer un descuento en GHO a todos los usuarios, con stkAAVE bloqueado en el Módulo de Seguridad de Aave.  Facilitadores de Aave  Facilitadores de Aave1600×800 95.9 KB  La propuesta también presento a los “Facilitadores” de red, es decir protocolos, entidades o instituciones con la capacidad de generar GHO de forma “confiable”. A cada Facilitador se le asignaría un “cubo” o un límite superior para el GHO que se puede mintear y cualquier parte que aspire a la designación debe ser votada primero por la gobernanza de la comunidad.  Portales para transferencias cross-chain  Otra característica interesante descrita brevemente en el post son los “Portales”. Estos portales permiten a los usuarios mintear GHO en Ethereum para distribuir a través de cualquier número de redes. Los portales utilizarían ‘message passing’ en el que un mensaje (por ejemplo: sendTokenAndExecute()) se mueve a lo largo de la cadena fuente, mediante ‘Gateways’ que confirman la llamada, sustraen la tarifa mínima y preparan la transacción saliente en la cadena de destino. Luego se marca como aprobado y se envía a la cadena deseada por el usuario. También, esta propuesta deja espacio para añadir activos del mundo real (RWA) a medida que la plataforma se adentra en la financiación directa. El servicio también funcionara inicialmente en Aave v2, aunque se espera una actualización a v3 en las próximas semanas. Para seguir esta discusión sobre el lanzamiento, puedes consultar este hilo.    El Tema más Hot de la Semana: Reducciones de Presupuesto La mayoría de los hilos con más tráfico esta semana pueden reducirse al punto singular de las preocupaciones presupuestarias. Con la restricción de liquidez, los protocolos han activado el “modo supervivencia” y muchos ahora están reconsiderando la suma total de sus hojas de gastos. Como lo muestra el siguiente debate, Maker no es una excepción. Varias preocupaciones han sido expresadas y las más apremiantes son:  A pesar de la rápida caída de los ingresos, los gastos del protocolo siguen subiendo a medida que se van aprobando los aumentos presupuestarios. Miedo de la disolución de MKR ya que, al repartirse los tokens adquiridos entre los colaboradores, se agota el excedente de la tesorería. La necesidad de definir un proceso presupuestario simplificado con varias mejoras previstas, incluyendo:    Hacer que sea más fácil comparar diferentes presupuestos y propuestas La capacidad de modificar los presupuestos sin la necesidad de una micro gestión excesiva Mas convergencia entre los presupuestos asignados y utilizados     A medida que la discusión avanzaba, llegaron al foro varias propuestas que pedían modificar o desincorporar los presupuestos de Core Units particulares. Las más recientes de estas se pueden encontrar aqui, con un post adjunto de @Ippy, donde se destaca una serie reformas teóricas destinadas a agilizar el proceso de presupuestación y compensación. Pueden seguir la discusión entera y sus ramificaciones en la sección de ‘Eventos Actuales’ o a través de este mega hilo de @LongforWisdom.   Eventos Actuales  Cualquiera que siga lo que ocurre en el Foro de Maker sabe lo caliente que ha estado el tema del presupuesto estos últimos meses y la semana pasada no fue una excepción. Hoy proponemos renovar la Compensación de Delegados, instituir simulacros de incendios para poner a prueba la preparación de los Delegados ante una emergencia y más.  Restructurar Incentivos para la Compensación de Delegados Reconocidos  @aburban90 de la Core Unit de Felicidad Estratégica cree que si bien tiene sentido compensar a los Delegados Reconocidos por la difícil tarea de votar de forma efectiva en cada propuesta, la estructura de incentivos actual no está bien diseñada. En este post, ofrece varios mecanismos nuevos que cree que pueden mejorar cómo funciona la Compensación de Delegados en MakerDAO. Ponderación de la Presencia de la Comunidad Factor de Peso: Hasta un 30% Dado que una trayectoria más larga en Maker puede indicar una comprensión más profunda de los valores fundacionales y los principios básicos de Maker, este mecanismo compensaría más a los delegados cuanto más tiempo lleven siendo miembros de la comunidad. Una forma sencilla de medir este factor es comprobar cuándo tuvo lugar la primera participación de un Delegado en el Foro. Registro de Respaldo de Ballenas Si una sola fuente respalda un gran porcentaje del MKR de un Delegado, esta información debería ser claramente transparente y estar disponible públicamente. La Piel en el Juego Factor de Peso: Depende de la Cantidad de MKR Stakeado Este mecanismo necesitaría que todos los Delegados stakearan algo de su propio MKR como colateral antes de ser elegibles para cualquier compensación de Delegados. Una parte de este MKR stakeado podría ser recortado o quemado cuando un Delegado no está desempeñando sus responsabilidades de forma efectiva. Compensación en MKR Los Delegados son compensados utilizando DAI del Buffer de Excedente. A @aburban90 le gustaría que las Compensaciones de Delegados utilizaran una combinación de DAI y MKR, redirigiendo parte del DAI del Buffer de Excedente para comprar MKR, que después puede añadirse al poder de voto del Delegado. Si un Delegado renuncia, compra pero no distribuye, el MKR puede quemarse. De acuerdo con los resultados de la encuesta informal, los lectores del foro apoyan la Compensación de Delegados en MKR y DAI, asi como que se le exija a los Delegados que revelen el apoyo en MKR de las ballenas.  Simulacro de Incendio, Solicitud de Debate + Encuestas Informales  Parte del mandato de la Core Unit de Seguridad Immunefi es la ejecución de un “simulacro de incendios”, es decir, eventos prácticos que busquen responder la pregunta de “¿Cuánto tiempo se tardaría en pasar un spell ejecutivo de emergencia inesperado y no anunciado?” El primer simulacro de incendio se planeó para febrero, pero fue retrasado debido a que no había una idea clara sobre que debería incluir un simulacro de incendio. En este post, @psychonaut propone el siguiente proceso:  Se declarará un Simulacro de Incendio cada mes, a una hora y fecha aleatoria. Mediante canales de comunicación de emergencia se le pedirá a los Delegados firmar un mensaje. Se medirá y registrará el tiempo de reacción.  Los posibles beneficios incluyen:  Pruebas regulares de la preparación de los Delegados ante emergencias Los tiempos de reacción se muestran en las páginas de información de los Delegados, añadiendo otra métrica para que los holders de MKR la tengan en cuenta a la hora de delegar su poder de voto El tiempo de reacción podría ser incorporado a la estructura de compensación de Delegados   Iniciativas de Reducción de Presupuesto de las CUs - Un resumen wiki  Este post de @LongForWisdom pretende reunir iniciativas relacionadas con el presupuesto, tanto a nivel de Maker como de las Core Units, en un solo lugar, como punto de referencia para la comunidad. Este wiki post está libre para ser editado por usuarios con nivel 3 de confianza o más. @LongForWisdom ha pedido a los miembros del foro que conocen bien los debates presupuestarios en curso que contribuyan al documento.  pLaP59r636×888 86 KB   Reunión del DVC de Endgame - 20 de Julio | Reducciones de Presupuesto y Consolidación de las CUs de crecimiento y marketing  @rune anuncio su intención de que el Comité de Votación Descentralizado se reúna el miércoles 20 de julio a las 7 pm UTC para enfocarse en los planes de reducción de presupuesto. Su planteamiento consiste en agilizar los presupuestos de las Core Units, identificando los puntos donde se pueden reducir los presupuestos y luego consolidando las Core Units similares con presupuestos unificados. @rune espera que después de ganar algo de claridad en el tema de los presupuestos, pueda lograrse el apoyo preliminar de los votantes de MKR hacia una dirección general para futuras reducciones y consolidaciones presupuestarias, lo que permitiría a las Core Units “centrarse más en su día a día y no preocuparse por cambios presupuestarios repentinos de arriba abajo”.     ¡Ayuda! Andrew Burban de la Core Unit de Felicidad Estratégica le pide a la comunidad que ayuden a distribuir la merch de Maker a EthCC en Paris. Si alguno asiste e EthCC cerca de Nueva York o a Washington D.C. y tiene espacio libre en su equipaje, por favor, contactar @aburban90.   Esta Semana en la Gobernanza  Actualización Semanal de MIPs #95  Encuestas de Ratificación, propuestas y discusiones pre-MIPs.  Votación(es) Ejecutiva(s) Esta semana se aprobó una votación ejecutiva tripartita y se produjeron los siguientes cambios dentro del Protocolo de Maker:   Distribuciones de Core Units, Compensación de los Delegados Reconocidos, Configuración del flujo de la Red Keeper - 06 de Julio del 2022 – Aprobada el 06 de julio del 2022 a las 23:32 UTC. Ejecutada el 08 de julio del 2022 a las 23:38 UTC.    Presupuestos de Core Units De acuerdo con sus múltiples propuestas presupuestarias exitosas, un total de 3.902.998,22 de DAI se destinaron a estas Core Units:     Core Unit Cantidad Propuesta de Presupuesto     Core Unit de Finanzas Estratégicas (SF-001) 989.004 DAI Presupuesto Aprobado   Core Unit de Crecimiento (GRO-001) 2.913.994,22 DAI Presupuesto Aprobado     Transferencia de Presupuesto de Core Units También se transfirieron 648.133,59 DAI a la Core Unit de Crecimiento (GRO-001) como resultado de su mas reciente aprobación de presupuesto.  Compensación a los Delegados Reconocidos Según la MIP61: Compensación a los Delegados Reconocidos, un total de 85.185 DAI fueron distribuidos a 14 Delegados Reconocidos:     Delegado Cantidad Dirección     Feedblack Loops LLCC 11.573 DAI 0x688d508f3a6B0a377e266405A1583B3316f9A2B3   Flip Flop Flap Delegate LLC 11.528 DAI 0xCCffDBc38B1463847509dCD95e0D9AAf54D1c167   schuppi 11.292 DAI 0x80882f2A36d49fC46C3c654F7f9cB9a2Bf0423e1   MakerMan 9.366 DAI 0x9AC6A6B24bCd789Fa59A175c0514f33255e1e6D0   ACREInvest 8.813 DAI 0x5b9C98e8A3D9Db6cd4B4B4C1F92D0A551D06F00D   JustinCase 8.158 DAI 0xE070c2dCfcf6C6409202A8a210f71D51dbAe9473   GFX Labs 6.679 DAI 0xa6e8772af29b29B9202a073f8E36f447689BEef6   Doo 5.075 DAI 0x3B91eBDfBC4B78d778f62632a4004804AC5d2DB0   Penn Blockchain 3.795 DAI 0x070341aA5Ed571f0FB2c4a5641409B1A46b4961b   Flipside Crypto 3.186 DAI 0x62a43123FE71f9764f26554b3F5017627996816a   Chris Blec 2.739 DAI 0xa3f0AbB4Ba74512b5a736C5759446e9B50FDA170   [email protected] 2.150 DAI 0xdC1F98682F4F8a5c6d54F345F448437b83f5E432   mhonkasalo & teemulau 704 DAI 0x97Fb39171ACd7C82c439b6158EA2F71D26ba383d   Governance House 127 DAI 0x82cD339Fa7d6f22242B31d5f7ea37c1B721dB9C3     Para más información, consulta este post del foro.  Configuración del Flujo de la Red Keep3r Keeper De acuerdo con la MIP63c4-SP4: Incorporar/Enmendar la Red Keeper - Keep3r, un total de 215.000 de DAI se transmitirán a Keeper (Keep3r), a la dirección 0xc6A048550C9553F8Ac20fbdeB06f114c27ECcabb, a partir del 01-07-2022 y hasta el 31-01-2023 a un ritmo de 1.000 DAI/día.  Encuestas de Gobernanza Dos encuestas activas esperan por tu participación esta semana (y mas alla):     Nombre de la Encuesta Discusión(nes) Fecha de Inicio Fecha de Cierre     Agregar RWA-008 (OFH) como un nuevo Tipo de Vault  Aplicacion Inicial del Colateral /  Evaluación de Riesgo de la Core Unit de Finanzas del Mundo Real / Evaluación de Riesgo Adicional - LOVE / Evaluación de la Core Unit de Servicios de Ingeniería de Colaterales / Evaluación de la Core Unit de Oraculos / Documentación de Transacciones SocGen / Propuesta del Comité de Delegados  11 de julio del 2022 a las 16:00 UTC 14 de julio del 2022 a las 16:00 UTC   Encuesta de Ratificación para la Incorporación del Facilitador de GOV-001 (MIP41c4-SP37) Discusión 11 de julio del 2022 a las 16:00 UTC 25 de julio del 2022 a las 16:00 UTC     Encuestas Finalizadas ¡Oh no, esto no debería estar aquí!  Una encuesta sospechosa apareció en el Portal de Votación el 08 de julio del 2022. Después, @Prose11 revelo en el Foro que se trataba de un simulacro de incendio para medir la rapidez de respuesta (sin apenas aviso previo a la comunidad) ante un ataque malicioso.  Una fracción del poder de voto que se muestra en este desglose refleja la opinión de los votantes sobre la utilidad del simulacro, aunque esta prueba no fue concebida como un medio para evaluar eso en un principio. Supongamos que desea expresar su opinión sobre este asunto. En ese caso, actualmente hay una encuesta en el hilo original que tiene como objetivo evaluar efectivamente el sentimiento de la comunidad respecto al tema: ¿Mensualmente es una buena frecuencia? ¿Qué velocidad es suficiente para que un Delegado reaccione? ¿Deberíamos incorporar alguna medida de tiempo de reacción en el modificador de rendimiento de la compensación del Delegado Reconocido? Por otro lado, tres encuestas finalizaron el 07 de julio:     Nombre de la Encuesta Desglose de Votos Fecha de Cierre     Agregar RWA-009 (HVBank) como un nuevo Tipo de Vault   Resultados948×270 6.82 KB  07 de Julio del 2022 a las 16:00 UTC   PPG - Propuesta del Comité de Mercado Abierto  Resultados948×270 6.74 KB  07 de Julio del 2022 a las 16:00 UTC   Selecciona un Nivel Objetivo de Rentabilidad rNPI para Guiar los Recortes de Presupuesto  948×382 13.7 KB  07 de Julio del 2022 a las 16:00 UTC      Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:  Comité de Votación Descentralizado Abierto | 6 de Julio del 2022   Discord | Video    Gobernanza y Riesgo | Ep. 198   Foro | Video     Futuras Llamadas:  Comité de Votación Descentralizado Abierto | Foro | Link para unirse - 12 de Julio a las 19:30 UTC Horario de Oficina de los Delegados | Discord | Link para unirse - Cada jueves a las 16:00 UTC Llamada de Gobernanza y Riesgo | Link para unirse | Agenda - Cada jueves a las 17:00 UTC Comité de Votación Descentralizado Abierto | Foro | Link para unirse - 14 de Julio a las 19:00 UTC    Horario de Oficina de las Core Units   Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC | Alternativa: Link para unirse - Cada dos Miércoles a las 15:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Crecimiento - Primer Miércoles de Cada Mes a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | Capital 6S - Cada dos Miércoles a las 14:00 UTC    Recursos  Abrir Lista  Todos los Paneles Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Rastreador del Panel de Gobernanza | Versión de Google Sheet   Conoce tu Índice MIP   Portal de Aprendizaje y Documentación Técnica   Servidor de Discord MakerDAO   MakerBurn   Lista los Horarios de Oficina   Herramientas de Participacion   Calendario de Votación y Fechas Importantes     ¿Tienes algún Feedback? Tenemos algunas ideas nuevas para mejorar y apreciaríamos tu feedback para hacer que el Relay Semanal sea una publicación más disfrutable. Descargo de Responsabilidad: esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de ser asesoramiento financiero ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación.  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix ",
                    "links": [
                        "https://governance.aave.com/t/introducing-gho/8730",
                        "https://threadreaderapp.com/thread/1545057714815901696.html",
                        "https://medium.com/acalanetwork/the-first-successful-cross-chain-messaging-passing-xcmp-transaction-on-polkadot-testnet-eb36af2ad8c3",
                        "https://forum.makerdao.com/t/aave-released-a-stablecoin/16421",
                        "https://forum.makerdao.com/t/doo-thoughts-as-a-hawk-delegate/16453",
                        "https://forum.makerdao.com/t/discussion-rethinking-budgeting-for-cus/14410",
                        "https://forum.makerdao.com/t/mip40c3-sp77-modify-is-001-budget/16436",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-wednesday-and-thursday-9pm-cest-getting-real-edition/15777/38",
                        "https://forum.makerdao.com/t/cu-budget-reduction-initiatives-wiki-summary/16448",
                        "https://forum.makerdao.com/t/informal-poll-restructuring-incentives-for-recognized-delegate-compensation/16469",
                        "https://makerdao.world/learn/governance/param-system-surplus-buffer/",
                        "https://forum.makerdao.com/t/fire-drill-request-for-discussion-informal-polls/13799",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP24#february-2022",
                        "https://forum.makerdao.com/t/cu-budget-reduction-initiatives-wiki-summary/16448",
                        "https://meta.discourse.org/t/what-is-a-wiki-post/30801",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://forum.makerdao.com/t/weekly-mips-update-95/16504",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-distributions-recognized-delegate-compensation-keeper-network-stream-setup-july-06-2022",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://vote.makerdao.com/polling/QmVMc78Z",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP4",
                        "https://vote.makerdao.com/polling/QmdMkg2N",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP4",
                        "https://vote.makerdao.com/polling/QmdMkg2N",
                        "https://mips.makerdao.com/mips/details/MIP61",
                        "https://vote.makerdao.com/address/0x845b36e1e4f41a361dd711bda8ea239bf191fe95",
                        "https://etherscan.io/address/0x80882f2A36d49fC46C3c654F7f9cB9a2Bf0423e1",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://etherscan.io/address/0x688d508f3a6B0a377e266405A1583B3316f9A2B3",
                        "https://vote.makerdao.com/address/0xb21e535fb349e4ef0520318acfe589e174b0126b",
                        "https://etherscan.io/address/0xCCffDBc38B1463847509dCD95e0D9AAf54D1c167",
                        "https://vote.makerdao.com/address/0x22d5294a23d49294bf11d9db8beda36e104ad9b3",
                        "https://etherscan.io/address/0x9AC6A6B24bCd789Fa59A175c0514f33255e1e6D0",
                        "https://vote.makerdao.com/address/0x4d3ac33ab1dd7b0f352b8e590fe8b62c4c39ead5",
                        "https://etherscan.io/address/0x5b9C98e8A3D9Db6cd4B4B4C1F92D0A551D06F00D",
                        "https://vote.makerdao.com/address/0xcdb792c14391f7115ba77a7cd27f724fc9ea2091",
                        "https://etherscan.io/address/0xE070c2dCfcf6C6409202A8a210f71D51dbAe9473",
                        "https://vote.makerdao.com/address/0xf60d7a62c98f65480725255e831de531efe3fe14",
                        "https://etherscan.io/address/0xa6e8772af29b29B9202a073f8E36f447689BEef6",
                        "https://vote.makerdao.com/address/0x8804d391472126da56b9a560aef6c6d5aaa7607b",
                        "https://etherscan.io/address/0x3B91eBDfBC4B78d778f62632a4004804AC5d2DB0",
                        "https://vote.makerdao.com/address/0x7ddb50a5b15aea7e7cf9ac8e55a7f9fd9d05ecc6",
                        "https://etherscan.io/address/0x070341aA5Ed571f0FB2c4a5641409B1A46b4961b",
                        "https://vote.makerdao.com/address/0x84b05b0a30b6ae620f393d1037f217e607ad1b96",
                        "https://etherscan.io/address/0x62a43123FE71f9764f26554b3F5017627996816a",
                        "https://vote.makerdao.com/address/0x2c511d932c5a6fe4071262d49bfc018cfbaaa1f5",
                        "https://etherscan.io/address/0xa3f0AbB4Ba74512b5a736C5759446e9B50FDA170",
                        "https://vote.makerdao.com/address/0xb8df77c3bd57761bd0c55d2f873d3aa89b3da8b7",
                        "https://etherscan.io/address/0xdC1F98682F4F8a5c6d54F345F448437b83f5E432",
                        "https://vote.makerdao.com/address/0xaa19f47e6acb02df88efa9f023f2a38412069902",
                        "https://etherscan.io/address/0x97Fb39171ACd7C82c439b6158EA2F71D26ba383d",
                        "https://vote.makerdao.com/address/0x4e314eba76c3062140ad196e4ffd34485e33c5f5",
                        "https://etherscan.io/address/0x82cD339Fa7d6f22242B31d5f7ea37c1B721dB9C3",
                        "https://forum.makerdao.com/t/recognized-delegate-compensation-breakdown-may-2022/15536",
                        "https://mips.makerdao.com/mips/details/MIP63c4SP4",
                        "https://etherscan.io/address/0xc6A048550C9553F8Ac20fbdeB06f114c27ECcabb",
                        "https://vote.makerdao.com/polling/QmajCtnG",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-rwa-collateral-onboarding-risk-assessment/15828/1",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-hvb-additional-risk-assessment-love-cu-in-incubation/15886",
                        "https://forum.makerdao.com/t/rwa009-hvbank-mip21-token-ces-domain-team-assessment/15861",
                        "https://forum.makerdao.com/t/rwa009-huntingdon-valley-bank-collateral-onboarding-oracle-assessment/16069/1",
                        "https://api.ipfsbrowser.com/ipfs/get.php?hash=QmW1UBVjPtHDo42oNzG2vspwggyeBfENS1xsPtpKLyDBvb",
                        "https://vote.makerdao.com/polling/QmajCtnG#poll-detail:~:text=Delegated%20Committee%20Proposal",
                        "https://vote.makerdao.com/polling/QmY3xqFQ",
                        "https://forum.makerdao.com/t/mip41c4-sp37-governance-facilitator-onboarding-gov-001/15284",
                        "https://vote.makerdao.com/polling/QmQXTMw1",
                        "https://forum.makerdao.com/t/fire-drill-request-for-discussion-informal-polls/13799",
                        "https://vote.makerdao.com/polling/QmQMDasC",
                        "https://vote.makerdao.com/polling/QmefrhsE",
                        "https://vote.makerdao.com/polling/Qmasg6zr",
                        "https://discord.com/channels/893112320329396265/989856974747349112",
                        "https://www.youtube.com/watch?v=fAkKrDHpDoA",
                        "https://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqbVlzZW5GLVZ2a1NpbjZpM2NuYndWamNDcW5xZ3xBQ3Jtc0tuQ0U0MEFuSm01emZsSzN4dERDOHpkNjhFTWt3aV90U1EzOUNnVW1ZNUdiMGJPMWtfMmloTTFscXJ2X3NxWUtpdndsTWtPTHZCTW1abkhoLVpRMkNFVzBoS0F0bTZnN2t5ZXNjeXlabVVoSWQ1UGstVQ&q=https%3A%2F%2Fforum.makerdao.com%2Ft%2Fgovernance-and-risk-198-thursday-july-07-at-17-00-utc%2F16370&v=EdmJ1onA-20",
                        "https://youtu.be/EdmJ1onA-20",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://us02web.zoom.us/j/81436458345",
                        "https://discord.com/channels/893112320329396265/989856974747349112",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/88286550832?pwd%3DdWQzQi9tYlNyemJJS2Nrd2NUdTBoZz09&sa=D&source=calendar&ust=1658071467440167&usg=AOvVaw1qm0YhEhQ8s4_fWhEhXn17",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://forum.makerdao.com/t/endgame-dvc-meeting-july-20-budget-reductions-and-growth-marketing-cu-consolidations/16451",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/82286534666&sa=D&source=calendar&ust=1658071467440167&usg=AOvVaw1-TLoRTFGbnivqGwIvfZs9",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.786184210526316
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xRami",
                    "index": "#2",
                    "likes": "3",
                    "time": "15/07/2022-18:51:11",
                    "content": "Excelente trabajo chicos! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#3",
                    "likes": "4",
                    "time": "16/07/2022-15:51:02",
                    "content": "Gracias Jose por la contribución, estás haciendo un gran trabajo para la comunidad. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#4",
                    "likes": "3",
                    "time": "16/07/2022-19:22:28",
                    "content": "Paso muchisimo durante la semana pero me encanta la responsabilidad y acciones que estan tomando los CUs de voluntariamente reducir sus presupuestos. Estamos pasando por un momento ciclico de reduccion de ingresos por el tema de apetito de prestamos crypto pero muy interesante que sepamos y podamos tomar acciones rapidas sin tener que acudir a polls. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Muzza",
                    "index": "#5",
                    "likes": "3",
                    "time": "16/07/2022-20:39:10",
                    "content": "Excelente trabajo muchachos, se agradece la contribución! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#6",
                    "likes": "4",
                    "time": "16/07/2022-21:50:26",
                    "content": "Momento de ponerse al día, muchas gracias gente      Joserjimz:     ¡Ayuda! Andrew Burban de la Core Unit de Felicidad Estratégica le pide a la comunidad que ayuden a distribuir la merch de Maker a EthCC en Paris.   Fuerte deseo para que llegue merch a nuestra ETH LATAM, mas que dispuesto para colaborar en lo necesario para hacerlo realidad. Estoy seguro que seria algo que la comunidad cripto en general apreceria con creces, ni hablar para los que transitamos este foro. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#7",
                    "likes": "5",
                    "time": "16/07/2022-22:07:43",
                    "content": "    nahueth:  Fuerte deseo para que llegue merch a nuestra ETH LATAM, mas que dispuesto para colaborar en lo necesario para hacerlo realidad. Estoy seguro que seria algo que la comunidad cripto en general apreceria con creces, ni hablar para los que transitamos este foro.   Mi apoyo total a ésta idea y también estoy a disposición para colaborar para que se haga realidad. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#8",
                    "likes": "4",
                    "time": "17/07/2022-21:57:51",
                    "content": "La desventaja que tenemos nosotros es que los límites de nuestros paises son bastante grandes, pero si se ponen de acuerdo y a un delegado encargado de Latinoamérica despliega el presupuesto a personas que el seleccione de cada país sería bastante cómodo, en Venezuela también tendrán nuestro apoyo  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-23-29-de-agosto-del-2022/17600",
            "title": "Relay Semanal | 23 - 29 de Agosto del 2022 ",
            "index": 17600,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "9",
                    "time": "01/09/2022-23:50:31",
                    "content": " 2587×575 114 KB  ¡Hola a todos! ¡Gracias por consultar este Relay Semanal! Ya sea que poseas MKR o DAI, que tengas tu propia vault o quieras involucrarte más en la gobernanza, esta es tu parada obligatoria para estar al día con todas las actualizaciones de MakerDAO. Autores: @alec, @nothsa, @Sol_Invictus y @Artem_Gordon  Versión Online en PDF     EVENTOS ACTUALES  Vivimos en una era definida por el cambio. Hemos presenciado el ascenso de la tecnología y el surgimiento de la era de la información. Vimos a Web2 pasar de ser una máquina de creatividad sin límites a ser una caja de arena corporativa. De igual forma, vimos el ascenso de las finanzas criptográficas y si estas aquí hoy, es probable que te haya movido una fibra sensible. Dicho esto, el mundo a nuestro alrededor y nuestra interpretación de él se está moviendo a una velocidad que nunca habíamos visto antes. Desafortunadamente, velocidad no siempre implica eficiencia. Tiempos difíciles traen decisiones difíciles, incluso más en los negocios. Los modelos jerárquicos tienen centenares de datos y marcos a los que hacer referencia, sin embargo, el libro de reglas para Web3 aún no ha sido escrito. No obstante, los miembros de la comunidad se han dado a la tarea de poner en marcha el proyecto. Su primera orden del día: desarrollar un marco estandarizado para las desincorporaciones de las CU.  MIP4c2-SP15: Modificaciones al Proceso de Desincorporación de Core Units  El Delegado Reconocido @twblack88, en conjunto con @gfxlabs, @blimpa y @Gala, redactaron y lanzaron un marco de enmienda del proceso de desincorporación de Core Units, apodado MIP4c2-SP15. El marco paso por su proceso de votación on-chain el 8 de agosto, con cerca del 87% del apoyo de los votantes. A medida que analizamos numerosas propuestas de incorporación, sería beneficioso verlas a través de la lente de este nuevo marco. Resumen de sus motivaciones ⮟  La motivación original de la MIP era clarificar y simplificar el proceso de desincorporación de las CUs, con la meta general de reducir fallas en el funcionamiento en caso de que se interrumpan las actividades. Además de las alteraciones derivadas de la MIP propuesta, también se recomendaron cambios a las MIPs 38, 39 y 41 para agilizar aún más el proceso y limitar la exposición de la DAO a tangencias prolongadas y dolorosas.  Resumen de sus Objetivos⮟  Solidificar el Proceso Desincorporación de Core Units.  Simplificar y diseñar un template para el proceso de desincorporación. Clarificar los términos de desincorporación dentro del ciclo de gobernanza. Establecer un estándar para los proponentes.   Introducir y dar formato a las expectativas sobre los plazos del proyecto, flujo de trabajo y procesos presupuestarios. Hacer que el proceso de desincorporación haga referencia al nuevo proceso presupuestario de Core Units (esperando aprobación). Agregar templates donde sea apropiado.  Los cambios a las MIPs 38, 39 y 41 se hicieron en conjunto con la MIP propuesta⮟   MIP38 - Se agrego el marco para desincorporar las CUs, así como los medios para proponer una desincorporación a través de un subcomponente MIP.  MIP39 - Se agregaron las referencias a las MIPs requeridas y se finalizó la definición del marco.  MIP41 - Se menciono el proceso de desincorporación, pero no se definió claramente.  Además, no existía ningún marco para gestionar la pérdida de algun Facilitador de una CU. Se añadió un lenguaje para remediar ambos problemas.  Puedes encontrar información detallada sobre los cambios mencionados a través de los links que se proporcionaron anteriormente. Con este marco en mente, vamos a revisar la progresión de las propuestas de desincorporación más recientes.  MIP39c3-SP2: Desincorporación de la Core Unit de Felicidad Estratégica (SH-001)  La propuesta original fue retirada en favor de una nueva MIP redactada bajo la guía y las especificaciones del marco mencionado. Bajo los términos propuestos, se concederá una indemnización de 45K DAI (o cerca del 33% de su salario anual ratificado) al Facilitador de la core unit, a través de un voto de aprobación. La MIP entrara en su Frozen Period de una semana el 1ro de septiembre y será incluida en el ciclo de gobernanza de septiembre. Esta propuesta puede ser discutida aqui.  MIP41c5-SP10: Desincorporación de Facilitador (IS-001)  En las sub-propuestas MIPs, blimpa de GovAlpha proporciono una línea de tiempo actualizada sobre los eventos y enlaces a los recursos relevantes. Puedes encontrar una transcripción más adelante.  Esta es una propuesta de desincorporación valida bajo el proceso de gobernanza actualmente aprobado. La MIP40c3-SP77 (Modificación Presupuestaria) en conjunto con la MIP41c5-SP10 (Desincorporación de Facilitador) busca desincorporar la Core Unit de Seguridad Immunefi (IS-001). Si la propuesta de desincorporación es ratificada, se cancelará la distribución de MKR y DAI existente. Esta propuesta le solicita a la comunidad o a IS-001 proponer un plan de indemnización adecuado para los colaboradores. No se ha provisto un plan de ejecución. El autor de la propuesta comunico que están dispuestos a mantener la propuesta en RFC después que se haya alcanzado un compromiso.  Esta propuesta entrara en su “Frozen Period” el 1ro de septiembre y será incluida en el Ciclo de Gobernanza de Septiembre.  MIP41c5-SP11: Desincorporación de Facilitador (SF-001)  Propuesta el 9 de agosto, esta MIP solicita remover a @aes, Facilitador de SF-001. Sus motivaciones son escasas, pero a continuación puedes encontrar un resumen de estas. Resumen de sus motivaciones ⮟  SF se volvió increíblemente cara sin mostrar mucho valor. Un mandato borroso que se convirtió en experimentos que pueden ser una pérdida de tiempo y proyectos riesgosos. \"Estamos construyendo algo aquí detective, estamos construyendo algo desde cero. Todas las piezas importan.” Det. Lester Freamon.    La core unit aboga por una “estrategia para el mercado bajista,” pero su presupuesto ha visto un aumento significativo durante el año. Sin embargo, esto sigue las nuevas directrices de la MIP40, la cual fue aprobada para otorgar a SF-001 su presupuesto de siempre, aprobado por los holders de MKR.   La propuesta argumenta una ausencia de resultados, dado a su presupuesto, así como una “ausencia de profesionalismo” en su manejo.   En concordancia con lo anterior, esta MIP entrara en su Frozen Period el 1ro de septiembre y será incluida en el Ciclo de Gobernanza de Septiembre. La discusión hasta este punto ha sido limitada, pero se puede encontrar un enlace al hilo principal aqui.    Esta Semana en Gobernanza   Actualizaciones de MIPs Semanales #102  Encuestas de Ratificación, propuestas y discusiones pre-MIP.   Votación(es) Ejecutiva(s) Solo se aprobó una Propuesta Ejecutiva esta semana y los siguientes cambios se llevaron a cabo en el Protocolo de Maker:   Disposición de Fondos de HVBank (RWA-009) - 24 de agosto del 2022 – Aprobada 25 de agosto del 2022 a las 15:50 UTC. Ejecutado el 29 de agosto del 2022 a las 14:00 UTC.  De acuerdo con esta encuesta de gobernanza exitosa, 25 millones de DAI serán extraídos a la vault de RWA-009 (HVBank). En este post de la Core Unit de Servicios de Ingeniería de Colaterales (CES-001) se describen con más detalle el calendario y el mecanismo que se está utilizando para la retirada de fondos de esta vault.      Encuestas Activas     Nombre de la Encuesta Discusión Desglose de la Votación Fecha de Inicio Fecha de Cierre     PPG - Propuesta del Comité de Mercado Abierto Discusión  2270×717 100 KB  29 de agosto del 2022 a las 16:00 UTC 1 de septiembre del 2022 a las 16:00 UTC   Trabajo de Dominio Legal sobre el Propósito Especial de Financiación de Colateral (bIBTA) Discusión  2262×535 82.5 KB  29 de agosto del 2022 a las 16:00 UTC 1 de septiembre del 2022 a las 16:00 UTC      Encuestas Finalizadas     Nombre de la Encuesta Desglose de la Votación Fecha de Cierre     Objetivo de Nivel de Gasto  2267×995 183 KB  25 de agosto del 2022 a las 16:00 UTC     Aprobadas     Nombre de la Encuesta Desglose de la Votación Fecha de Cierre     Arreglo de RWAs  2267×542 89.4 KB  29 de agosto del 2022 a las 16:00 UTC   Solicitud de Financiación basada en Proyectos de Incorporación de Colaterales (PFR)  2272×540 84.5 KB  25 de agosto del 2022 a las 16:00 UTC     No Aprobadas     Nombre de la Encuesta Desglose de la Votación Fecha de Cierre     Cabot (Cabot Renewable Energy Crypto Mining LLC)  2272×535 86.2 KB  29 de agosto del 2022 a las 16:00 UTC   DDC (Detox Digital Coin)  2285×540 83.4 KB  29 de agosto del 2022 a las 16:00 UTC       Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada:  Gobernanza y Riesgo #205 | Foro | Grabación  Conoce Tu MIP #13 | Foro | Grabación  Conoce Tu Delegado #18 | Foro | Grabación  Comité de Votación Descentralizado | Foro | Grabación - 24 de agosto | Grabación - 25 de agosto   Llamadas Recientes:  MIP6: UNI-V3-WBTC-RENBTC | Foro | Link | 2022-08-30T15:00:00Z  Gobernanza y Riesgo #206 | Foro | Link - 748478 | 2022-09-01T17:00:00Z  Comité de Votación Descentralizado | Foro |   Link - 2022-08-31T19:00:00Z   Link - 2022-09-01T19:00:00Z       Horario de Oficina de las Core Units    Link para unirse | Gobernanza GovAlpha - Lunes a las 17:00 UTC  Link para unirse | Seguridad Immunefi - Cada dos lunes a las 23:00 UTC | Alternativa: Link para unirse - Cada dos Miércoles a las 15:00 UTC  Link para unirse | Ingeniería del Protocolo - Martes a las 15:00 UTC  Link para unirse | Escalado de Ecosistemas Sostenibles - Martes a las 13:30 UTC  Link para unirse | Growth - Primer Miércoles de Cada Mes a las 17:00 UTC  Link para unirse | Finanzas del Mundo Real - Cada dos Miércoles a las 18:00 UTC  Link para unirse | Comunicaciones de Gobernanza - Viernes a las 18:00 UTC  Link para unirse | 6S Capital - Cada dos Miércoles a las 14:00 UTC    Recursos  Abrir Lista  Todos los Paneles Disponibles   Todas las Guías Disponibles   Calendario de Llamadas   Foro y Discord de Maker   Rastreador del Panel de Gobernanza | Versión Google Sheet   Conoce tu Índice MIP   Portal de Aprendizaje y Documentación Técnica   Servidores de Discord de MakerDAO   MakerBurn   Lista de los Horarios de Oficina   Herramientas de Participacion   Calendario de Votación y Fechas Importantes    Descargo de Responsabilidad Esta actualización fue ensamblada por un grupo de miembros colaboradores de la comunidad de MakerDAO. Esto no tiene el propósito de ser asesoramiento financiero, ni es una incitación a votar de ninguna manera específica. Esta actualización solo tiene fines informativos y de comunicación.  Esta es una traducción libre del artículo original en inglés hecha por @joserjimz y @Sebix. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://vote.makerdao.com/polling/QmbBh8t4#vote-breakdown",
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291/15",
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291/16?",
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291/17",
                        "https://forum.makerdao.com/t/mip39c3-sp2-strategic-happiness-core-unit-sh-001-offboarding/16438/19",
                        "https://forum.makerdao.com/t/mip39c3-sp2-strategic-happiness-core-unit-sh-001-offboarding/16438/21",
                        "https://forum.makerdao.com/t/mip40c3-sp77-modify-immunefi-security-budget-is-001/16436/4",
                        "https://forum.makerdao.com/t/mip40c3-sp77-modify-immunefi-security-budget-is-001/16436",
                        "https://mips.makerdao.com/mips/details/MIP39#MIP39c3",
                        "https://forum.makerdao.com/t/mip40c3-sp77-modify-immunefi-security-budget-is-001/16436",
                        "https://forum.makerdao.com/t/mip41c5-sp10-facilitator-offboarding-is-001/16437",
                        "https://forum.makerdao.com/t/mip40c3-sp77-modify-immunefi-security-budget-is-001/16436/4",
                        "https://forum.makerdao.com/t/mip40c3-sp77-modify-immunefi-security-budget-is-001/16436/3",
                        "https://forum.makerdao.com/t/mip41c5-sp11-facilitator-offboarding-sf-001/17136",
                        "https://forum.makerdao.com/t/mip39c3-sp1-core-unit-offboarding-sf-001/17134#too-expensive-in-times-of-crisis-6",
                        "https://forum.makerdao.com/t/mip39c3-sp1-core-unit-offboarding-sf-001/17134#lack-of-results-8",
                        "https://forum.makerdao.com/t/mip39c3-sp1-core-unit-offboarding-sf-001/17134#lack-of-professionalism-misuse-of-funds-7",
                        "https://forum.makerdao.com/t/mip39c3-sp1-core-unit-offboarding-sf-001/17134#too-expensive-in-times-of-crisis-6",
                        "https://forum.makerdao.com/t/weekly-mips-update-102/17511",
                        "https://vote.makerdao.com/executive/template-executive-vote-hvbank-rwa-009-drawdown-august-24-2022",
                        "https://vote.makerdao.com/polling/QmQMDasC#vote-breakdown",
                        "https://forum.makerdao.com/t/rwa009-hvbank-mip21-token-ces-domain-team-assessment/15861/8",
                        "https://vote.makerdao.com/polling/QmXHnn2u",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-25-august-2022/17448",
                        "https://vote.makerdao.com/polling/QmfRkWCP",
                        "https://forum.makerdao.com/t/mip55c3-sp6-legal-domain-work-on-greenlit-collateral-bibta-special-purpose-fund/17166",
                        "https://vote.makerdao.com/polling/QmY8Fs9t",
                        "https://vote.makerdao.com/polling/QmY85FT6",
                        "https://vote.makerdao.com/polling/QmfRkWCP",
                        "https://vote.makerdao.com/polling/Qmekx2wh",
                        "https://vote.makerdao.com/polling/QmWVVivW",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://youtu.be/AXjYV85RLZQ",
                        "https://forum.makerdao.com/t/know-your-mip-kym-13-makerdao-delegates-mip-set/17396",
                        "https://youtu.be/zATpBvs_39g",
                        "https://forum.makerdao.com/tag/pubcall-:-meet-your-delegate",
                        "https://youtu.be/nUkjsG1VUzg",
                        "https://forum.makerdao.com/t/wednesday-and-thursday-endgame-dvc-meetings-presenting-endgame-v3/17144",
                        "https://youtu.be/1f9j65Xv2D8",
                        "https://youtu.be/px6awzHdhJQ",
                        "https://forum.makerdao.com/t/uni-v3-wbtc-renbtc-mip6-collateral-onboarding-application/15635/8",
                        "https://forum.makerdao.com/tag/pubcall-:-governance-and-risk",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/t/wednesday-and-thursday-endgame-dvc-meetings-presenting-endgame-v3/17144",
                        "https://us02web.zoom.us/j/89326394914",
                        "https://us02web.zoom.us/j/82286534666",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://makerdao.bigbluemeeting.com/adm-eox-jtz-tsi",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/all-available-dashboards/16104",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/the-calls-calendar/16095",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://www.makerdao-governance-dashboard.com/tracker",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forum.makerdao.com/t/makerdaos-discord-servers/16110",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/office-hours-list/16162",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://forum.makerdao.com/t/the-votes-and-important-dates-calendar/16096",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/12"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                }
            ]
        }
    ],
    "group_index": "1312"
}