{
    "poll_list": [
        {
            "title": "Rates Proposal - December 14, 2020",
            "index": "5533",
            "option": "Yes",
            "supporting_mkr": "60,709",
            "highest_fraction": 0.98
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rates-changes-proposal-7-dec-2020/5533",
            "title": "Rates Changes Proposal 7 Dec 2020 ",
            "index": 5533,
            "category": [
                "Updates"
            ],
            "tags": [
                "rates",
                "rates-working-group"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "17",
                    "time": "07/12/2020-22:32:55",
                    "content": "Authors: @Primoz, @LongForWisdom , @Hexonaut, @Monet-supply, @SebVentures, @Akiva  Source: Risk Premiums & Competitive Rates 7 Dec 2020 Table Notes:  Competitive rates are based on lowest stablecoin borrow rates on each lending venue for particular collateral, except when stablecoins are used as collateral (in such case only DAI borrow rate is compared) Negative competitive rates are mostly due to liquidity mining rewards at Compound & Cream and due to rates and rewards accrued on deposited collateral Risk premiums were recently updated for every Vault type except stablecoins where we used values from last governance votes. Links to calculations can be found in the table above. Lending products between secondary lenders and MakerDAO are not standardized and therefore rates can not be strictly compared.   Lending Market Overview Due to the recent crypto bull cycle, market rates for US dollar borrowing on crypto collateral have increased over the last couple of weeks:  Futures annualized 1M basis which are good indicator of rate trend, have increased by about 2% in the last month (source) Centralized margin platforms such as Bitfinex who rely on USD lending markets to offer leverage have had USD rates increased by more than 10% (source) Bitmex long 8h funding rate increased by more than a factor of 2 in last month (source) Importantly, DeFi competitive rates for USD borrowing at Compound and Aave are also higher for more than 1% on average (see analysis below)  DeFi is also continuing increased growth in terms of outstanding loans and collateral locked (TVL), although the growth seems to be more related to increased value of collateral than new organic growth. Still, demand for leverage has grown in the last couple of weeks, which explains higher rates on average.   Competitive Landscape Rates at secondary lenders such as Aave and Compound have been trending upwards in the last month, explained by increased leverage seeking activity and users potentially switching from stablecoin assets to crypto assets to participate in a bull run. DeFi rates haven’t increased as much as CeFi rates, although stablecoin borrow rates at Aave are about 2% higher one month ago. Compound rates also experienced an increase in mid November before returning to lower levels potentially due to the DAI liquidations on 26th November. To conclude, stablecoin borrow rates have increased at secondary lenders in the past month and are on average 1-2% higher. However liquidity mining rewards on platforms such as Compound and Cream are still offering cheaper rates compared to Maker.   Proposed Rate Changes ETH-A: SF increase from 2% to 2.5% As noted above, market CeFi rates have risen sharply over last month and the average competitive rate for ETH increased by 1.5%. ETH has experienced a 50% price increase in one month alone and DAI minted from ETH-A increased by 25% in the same period. Therefore we are suggesting SF increase of 0.5%, which shouldn’t negatively affect ETH-A vault usage if ETH bull run persists and competitive rates stay at similar levels.  ETH-B: SF increase from 4% to 5% Debt ceiling on ETH-B is getting potentially increased to 20m this week and possibly even more in mid-December if DC IAM for ETH-B is implemented. The OSM attack should be mitigated by DC IAM but the risk compensation for low LR vault type will increase if debt exposure continues to grow. This is why we are proposing a 1% SF increase to 5%, which should still equal average competitive rates for ETH observed in December. WBTC-A: SF increase from 4% to 4.5% The arguments for WBTC-A SF increase are the same as for ETH-A: higher market and competitive rates. Further, DAI supply from WBTC-A increased by about 20% in the last month and we think that 0.5% higher rates shouldn’t affect DAI supply growth too negatively.  BAT-A: SF increase from 4% to 8% The BAT-A vault type was onboarded more than a year ago when MCD launched. It has 150% LR applied although 175% LR would be more appropriate based on BAT-A risk profile. Further, worsened liquidity metrics don’t support current 3m debt exposure and 4% SF (calculated Risk Premium of 14%). We are proposing SF increase to 8% and @Risk-Core-Unit will separately also propose Debt Ceiling decrease from current 10m. KNC-A: SF decrease from 4% to 2% This vault carries very low debt exposure (125k) and therefore risk premium calculated is very low. We are suggesting SF decrease to 2% in order to attract potential demand. Further, average competitive rates seem to be lower than what Maker charges currently. ZRX-A: SF decrease from 4% to 2% This vault carries very low debt exposure (90k) and therefore risk premium calculated is very low. We are suggesting SF decrease to 2% in order to attract potential demand. Further, average competitive rates seem to be lower than what Maker charges currently. MANA-A: SF decrease from 12% to 10% @Risk-Core-Unit recently proposed Debt Ceiling decrease to only 250.000 due to worsened liquidity metrics for MANA. But days after implementation, Coinbase listed MANA tokens and liquidity was able to reach healthier levels. @Risk-Core-Unit might therefore recommend an increase of Debt Ceiling for MANA, whereas Rates Group proposes SF decrease to 10%. LINK-A: No changes (2% SF) LINK is one of the most liquid ERC20 tokens and the risk premium calculated for this vault type at current debt exposure of 5.9m is only 1%. The average competitive rate is above 5% and it might be possible to increase current SF at 2%. Still, we believe that Aave borrowers using LINK as collateral might potentially still be willing to migrate over to Maker at current rates as was also observed in the past and therefore no change to SF is proposed. COMP-A: SF decrease from 3% to 2% This vault carries very low debt exposure (35k) and therefore risk premium calculated is very low. We are suggesting SF decrease to 2% in order to attract potential demand. Further, average competitive rates seem to be lower than what Maker charges currently. LRC-A: No changes (3% SF) To our knowledge there are no competing DeFi or CeFi platforms offering leverage on LRC tokens and current SF seems to be more or less in line with risk premium (1% spread). We don’t suggest any changes to this vault type. BAL-A: SF decrease from 5% to 2% This vault carries very low debt exposure (3k) and therefore risk premium calculated is very low. We are suggesting SF decrease to 2% in order to attract potential demand. Further, competitive rate on CREAM currently measures -33% (positive yield on borrowing). The initial SF when asset was onboarded was high due to expected higher demand (Compound and Aave don’t support BAL) YFI-A: SF increase from 4% to 9% The situation with YFI-A vault type was recently addressed here. Until whitelisted vaults are available, a Debt Ceiling increase to 30m and SF of 10% was voted by governance. Recent update on calculation of risk premium suggested a 9%, as the collateralization ratio got slightly higher for the largest vault. Rates Group therefore suggests 9% SF for YFI-A at 30m DC. Stablecoins (USDC-A, TUSD-A, PAXUSD-A, GUSD-A) The proposed SF changes to 0% for stablecoins (excluding USDT-A and USDC-B) are based on recent on-chain poll and forum thread. In case MKR holders vote for no decrease of current 4% SF, Rates Group won’t include this proposal to on-chain vote next week. In such a case @Risk-Core-Unit will need to propose a Surplus Buffer increase for these vaults once their CR reaches 100% (expected in about 10 days).  Final Note To conclude, we think Maker should take advantage of the bull market and increased rates environment in both CeFi and Defi to slightly increase rates on its flagship vault types such as ETH-A and WBTC-A. We are proposing cautious increases that still make rates in line with competition and doesn’t cause users to refinance. On the other hand we are also making some decisions to achieve more proper risk compensation for vault types such as BAT-A and YFI-A. And finally we are proposing rate decrease for vault types where low usage is present and the risk profile of collateral allows it. Proposed SFs will get included into next week’s on-chain poll and if passed into executive vote on 18th December. ",
                    "links": [
                        "https://skew.com/",
                        "https://bfxrates.com/",
                        "https://datamish.com/ethusd/90d",
                        "https://forum.makerdao.com/t/signal-request-yfi-vault-options/5425",
                        "https://vote.makerdao.com/polling/QmeWnmyC?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/on-chain-poll-stablecoin-vaults-fee-adjustment-7th-dec-2020/5414",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-121-thursday-december-10-16-00-utc/5468/2",
                        "https://forum.makerdao.com/t/weekly-sourcecred-distribution-work-reaches-ath/5670",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/8",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-121-thursday-december-10-16-00-utc/5468/5",
                        "https://forum.makerdao.com/t/should-bat-sf-be-reduced/1192/41",
                        "https://forum.makerdao.com/t/maker-relay-ep-25/5671",
                        "https://forum.makerdao.com/t/maker-relay-ep-25-en-espanol/5680"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.271991655687308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "1",
                    "time": "08/12/2020-07:57:32",
                    "content": "First of all: will for sure not vote against anything the risk team puts on the table, I just want to understand and recalibrate my world-model      Primoz:  ETH-A: SF increase from 2% to 2.5%   Doesn’t it feel a bit weird that ETH is no longer our “AAA” non-stablecoin-collateral and we allow cheaper minting of DAI with collateral like ZRX, KNC, LINK (!), BAL? Also: aren’t we still above peg so it makes sense not to take every trend (here: CEFI) into account?     Primoz:  This vault carries very low debt exposure (35k)   I always though of DC being the debt exposure and not the “DAI from xxx”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#3",
                    "likes": "2",
                    "time": "08/12/2020-10:10:16",
                    "content": "    ultraschuppi:  Doesn’t it feel a bit weird that ETH is no longer our “AAA” non-stablecoin-collateral and we allow cheaper minting of DAI with collateral like ZRX, KNC, LINK (!), BAL?   Good question, I was expecting someone to ask this actually. The answer is very simple, if you have collateral with 100k debt versus collateral with 100m debt and even though the smaller debt collateral is much riskier than larger debt collateral, smaller one represent smaller risk premium due to better auction slippage outcome. So imagine if you have 10% debt liquidated on 100k or 100m, the auction outcome or haircut should be much better for smaller debt exposure, even if collateral is riskier.     ultraschuppi:  Also: aren’t we still above peg so it makes sense not to take every trend (here: CEFI) into account?   This is why we didn’t propose a larger increase that would probably make more sense from market and competitive perspective, which would be something like 1-2%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.522058823529412
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#4",
                    "likes": "2",
                    "time": "08/12/2020-10:48:17",
                    "content": "Looks very cheap to increase by 0.5 I personally prefer the previous rates they were clearer. 2% for low risk assert 4% for normal assert. Then some exception. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.503333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#5",
                    "likes": "2",
                    "time": "08/12/2020-13:41:51",
                    "content": "I will vote against the proposal. The rates are losing the touch with reality (DAI above the peg) and risk (ETH is riskier than KNC). I’ve read the explanation from the risk team why they chose that rates but I don’t agree with their explanation. I suggest setting the ETH SF to 0% and other rates according to the risk (liquidity, market cap…) with no copy-paste of rates from other lending sites. USDC will be heavily regulated, not easily transferrable (without KYC)… and relying on it as a way to maintain the peg is suicidal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#6",
                    "likes": "2",
                    "time": "08/12/2020-16:15:56",
                    "content": "Can I get a little more background on how DAI peg stability was factored into the proposed rates? With DAI still over 1, I’m having a tough time understanding what priority peg stability is compared to the risk analysis(and corresponding compensation to MKR holders) and the business policy included in the competitive rates analysis. Second point, something just doesn’t sit right with the ETH-A not having the lowest SF. I view ETH-A by far as the best collateral, and should continue to treated as such. Maybe its just an optics thing, but I think it sets a bad precedent to give lower quality collaterals a lower SF. Third, I think it would be valuable to also compare DAI in circulation compared to USDC and possibly Tether. From the research I have done, USDC appears to be growing their supply at a faster rate, and we might want to lower rates across the board to increase our growth rate so we don’t fall further behind USDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.080509768009768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#7",
                    "likes": "1",
                    "time": "09/12/2020-10:25:11",
                    "content": "If we’re going to have big fluctuations in rates, the rates group may need to meet more often. Or breaking up big changes in SF over multiple weeks. Some forward guidance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "0",
                    "time": "09/12/2020-11:48:09",
                    "content": "Is there something in particular you disagree with? Btw the rates group is open to join if anyone has strong feelings about what the rates should be. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "4",
                    "time": "09/12/2020-12:16:23",
                    "content": "@Jiecut We had a lot of meetings with not much to discuss.  If you look at what is really important, there is only the +50bps on ETH-A and WBTC-A due to the increase of stablecoin price on competitor markets due to the bull run. Stablecoin are not a big deal (as we transition to the PSM anyway). YFI is just to deal with this overnight success. There are some token were SF are decreased to see hat happen. But it’s not like we should care much anyay. there was a big issue on BAT which is dealt with. I’m fully on the camp to change slowly stuff, which is why we have 50bps changes. We could go as high as 3.5% on ETH-A should we want to make more revenues. @Jeffshaw there was no evidence that lowering the SF helps much with the peg issue. The peg is under control and will be even more in with the PSM. ETH-A is the collateral that made Black Thursday. 1 ETH is the best collateral, 2M ETH is a different story. There is the fundamental value of each asset, then there is the liquidity issue.     Jeffshaw:  Third, I think it would be valuable to also compare DAI in circulation compared to USDC and possibly Tether. From the research I have done, USDC appears to be growing their supply at a faster rate, and we might want to lower rates across the board to increase our growth rate so we don’t fall further behind USDC.   That’s supper important indeed. But DAI demand and credit demand are not fully related. The PSM is solving the PEG issue, so that might help DAI demand a bit. RWA and farming assets are helping on credit demand. I have big hope that DAI derivatives (cDAI, …) will help to remove all link to regulated stablecoin in the futures. The main missing piece is working on DAI demand. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.372222222222223
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#10",
                    "likes": "0",
                    "time": "09/12/2020-12:40:29",
                    "content": "First thanks for doing it. I believe we are mature enough and we have a good Dai demand now to have some stable price. and while I understand the ETH risk change, I doubt we can evaluate this risk at 0.5% margin yet. Moving the rate from 0.5% up or down every other month won’t really change anything and won’t help to say our prices don’t change like compound (cf topic - why maker vs compound). Same for the others, the 4% all it is clear. now we have 4% 5% 5.5% 8% 3% 2%. As far as we don’t have individual issue like with YFI or with new vaults which need a bit of help to start, I believe we have more benefit to have a clear rate on BtoC. ( I said BtoC because RWA is different) The main benefit we have is our fixed rate, so let them as fix as we can. Also we are already charging more than compound, let’s keep this benefit by being consistent with our prices. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.780618686868687
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#11",
                    "likes": "3",
                    "time": "09/12/2020-12:55:22",
                    "content": "Yeah YFI, some tricky things with the risk premium jump. It’s possible if it the SF was first raised to 7% that the risk premium would drop from some certain vaults leaving. Possible that users are fairly rate sensitive, so you only need to raise the SF slightly higher than the competitive rate. And Maker isn’t taking that much extra risk if they wait a week and do 4% -> 7% -> 9%.     SebVentures:  But it’s not like we should care much anyay. there was a big issue on BAT which is dealt with.   Is BAT dealt with? Or should we close BAT-A and start a new BAT-B with 175% CR. Though there’s some trouble with creating so many vault types.     SebVentures:  I’m fully on the camp to change slowly stuff, which is why we have 50bps changes.    I guess the only other thing would be WBTC-A, how competitive we want the rate to be. Considering the debt level,we might want a more accommodative policy for WBTC-A and not to tighten. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.618235930735931
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#12",
                    "likes": "0",
                    "time": "09/12/2020-14:00:07",
                    "content": "    alexis:  and while I understand the ETH risk change, I doubt we can evaluate this risk at 0.5% margin yet. Moving the rate form 0.5% up or down every other month won’t really change anything and won’t help to say our prices don’t change like compound (cf topic - why maker vs compound).   The risk is in the risk premium that is at 4% for ETH. A 50bps increase for ETH is about $2M. If stablecoin prices stays elevated in the next month. I like the idea to catching up slowly with the market to avoid SF moving all over the place (for established vaults). So if you made a Maker loan and come back 2 months after, you don’t get too much surprise. WBTC is complex because, I you remove the 3 biggest vaults, it’s almost empty. So decreasing the SF might trigger more people to open a vault (personally I closed a vault because WBTC is too costly compared to ETH). If not, it is a good sum of revenue that we miss. And it’s a big vault type so you don’t want to play/experiment too much with it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.412326388888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#13",
                    "likes": "2",
                    "time": "10/12/2020-05:29:37",
                    "content": "First, I support the proposed rate change. Regarding YFI, we can first increase the SF of YFI to 7%, and then observe the total amount of YFI loans for two weeks. If the total loan amount shows no signs of cooling down, increase the SF to 9% or higher, which can be more peaceful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840277777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#14",
                    "likes": "1",
                    "time": "10/12/2020-17:53:50",
                    "content": "Dai made from YFI has been dropping and is now well below the DC. It seems to me that we are not in a time where we can be perceived to be borrower-unfriendly. Screen Shot 2020-12-10 at 9.52.38 AM912×1218 55.3 KB ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#15",
                    "likes": "4",
                    "time": "11/12/2020-10:40:08",
                    "content": "I think that YFI vaults are unwinding due to price drop. That is it. It has nothing to do with SF increase. YFI went from 48k to 8k and back to 30k. I think that someone who is levering their YFI long position is expecting much higher returns and will not change his whole strategy because the cost of capital is 10% instead of 4% APY. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2749999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "18/12/2020-10:40:09",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3049"
}