{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/off-chain-governance-incentive-changes-sourcecred/15362",
            "title": "Off-Chain Governance Incentive Changes (SourceCred) ",
            "index": 15362,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "sourcecred",
                "offch-govinc-set"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "19",
                    "time": "25/05/2022-17:07:22",
                    "content": "This post summarizes the off-chain incentive changes that will be taking place from the start of June, this set of changes follows from the discussion and previous set of posts around the topic. Links to documentation and further details are provided where appropriate.  Changes to Community SourceCred Summary  Weekly payout is reduced from 5,000 DAI to 2,500 DAI. Payout Mechanisms adjusted - users effectively no longer receive DAI for contributions that took place more than 4 months ago (reward decays to less than 1% at that point.) Better support for users opting in and out of payouts.  Eligibility  Core Unit Members are no longer eligible and will be removed if opted in. This includes Core Unit Facilitators. Recognized Delegates are no longer eligible and will be removed if opted in. Document describing eligibility rules and how distribution works on the operational manual here.   Introduction of Delegate SourceCred Summary  Effectively a separate delegate instance of SourceCred payouts (though still based on the same SourceCred instance.) Weekly payout is 1,000 DAI Payout is divided proportionally between active delegates based on their cred (not based on MKR weight.)  Eligibility  Requires delegates to have received a non-zero amount of compensation through the participation-communication mechanism for the month to be eligible. Document describing eligibility rules and how distribution works on the operational manual here.  A more detailed forum post describing these changes can be found here.  Introduction of Proposal Bounties Summary  Bounties reward successful governance proposals (MIPs, MIP Subproposals, Signal Requests.) A monthly pool of 6,000 DAI is split amongst successful proposals weighted 0.25 for Signals, 0.5 for Subproposals, and 1.0 for MIPs. Maximum of 2,000 * weight DAI for a single proposal/sub-proposal/signal.  This should be considered a trial mechanism. Details might change, or it might be discontinued entirely in the future. Eligibility  Delegates are eligible, Core Unit members are not eligible. Document describing eligibility rules and how distribution works on the operational manual here.  A more detailed forum post describing these changes can be found here.  Atn: @Recognized-Delegates @Core-Facilitators ",
                    "links": [
                        "https://manual.makerdao.com/governance/offchain-incentives/sourcecred",
                        "https://manual.makerdao.com/governance/offchain-incentives/delegate-sourcecred",
                        "https://forum.makerdao.com/t/delegate-sourcecred-compensation-mechanism/15365",
                        "https://manual.makerdao.com/governance/offchain-incentives/proposal-bounties",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties/15363",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-10/16685",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-9/16355",
                        "https://forum.makerdao.com/t/govalpha-q2-2022-quarterly-report/18242",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-9-traduccion/16383",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties-round-up-4/18283",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-8/15939",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-7/15618",
                        "https://forum.makerdao.com/t/govalpha-gov-001-quarterly-review-q1-2022/15589",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397",
                        "https://forum.makerdao.com/t/cambios-en-los-incentivos-off-chain-a-la-gobernanza-sourcecred-traduccion/15393",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-11/16959",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-12/17264"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.200501253132832
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/08/2022-23:07:52",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}