{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/wanted-securitization-expert-to-join-the-real-world-finance-core-unit/9789",
            "title": "Wanted: Securitization expert to join the Real-World Finance Core Unit ",
            "index": 9789,
            "category": [
                "Resources",
                "Job Opportunities"
            ],
            "tags": [
                "real-world-finance",
                "rwa"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "10",
                    "time": "11/08/2021-08:52:56",
                    "content": "Context MakerDAO is managing one of the leading lending protocols in DeFi: Maker. With more than 5B DAI issued, it is producing the biggest decentralized USD-pegged stablecoin. MakerDAO is leading the space in bringing Real-World Asset (RWA) into its protocol. We have currently onboarded 4 (RWA) collaterals for $6M of value and are expanding exponentially with a target of $300M in the near term. Job description The main objective of this job is to help MakerDAO, and DeFi in general, onboarding Real-World Assets through on-chain securitization. As it is still in its infancy, much work is needed to bring on-chain securitization as a better alternative than traditional securitization. Working with our partners, your mission will be to improve the on-chain securitization space and bring hundred of millions of RWA on MakerDAO. The job is also to evaluate, manage and monitor RWA deals. The job is full-time and will be executed remotely within UTC-4 and UTC+2 timezones. Requirements Applicant should:  Have an understanding of MakerDAO and DeFi in general Have competencies and significant experience in securitization both on the business and on the legal front Have experience with working with credit rating agencies Have knowledge of the US and/or UK securitization ecosystem Be comfortable taking initiative and self-directing Have an understanding of smart contracts (it’s a plus)  Interested? If you feel you are capable of briging securitzation on-chain, please reach out to @SebVentures (Sébastien) on Twitter, MakerDAO forum or Rocketchat. Compensation will be competitive and paid monthly in DAI by the Maker Protocol. The candidate will benefit of the MKR compensation program. The candidate will have to deal with the fiscal and administrative implications (usually through setting up an LLC). In no way, MakerDAO will enter into a contractual arrangement with the candidate. ",
                    "links": [
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-07/9658",
                        "https://twitter.com/SebVentures",
                        "https://forum.makerdao.com/",
                        "https://chat.makerdao.com/",
                        "https://forum.makerdao.com/t/mip56-alternative-mkr-compensation-guidelines/9230",
                        "https://forum.makerdao.com/t/on-chain-securitization-roadmap-new-silver-audit/9937/33",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-08/10123",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-154-thursday-august-12-17-00-utc/9793/3",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/48"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.793320105820106
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brettlyons",
                    "index": "#2",
                    "likes": "3",
                    "time": "13/08/2021-01:26:05",
                    "content": "I think this is a great idea and important role.  Real world asset structures will inevitably be complex, requiring legal, tax, admin, controls, and financial auditors.  I could see someone from a Big 4 firm, like EY or Deloitte, being a great fit.  Particularly if they have experience in financial audit for alternative assets like hedge funds, PE, or private credit.  They would’ve seen hundreds of legal structures and can efficiently review nuanced SPV agreements.  For illiquid investments, having valuation experience would also be a big plus since valuation is a significant risk for us. Lot’s of this stuff can be outsourced to professional services firms like EY. But the DAO will certainly need its own recourses, as Seb describes above.  @SebVentures I’d love to help in a formal capacity, but I could only be part-time. Let’s discuss on chat whether that could work.  I’ll also try to help find someone full time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.044772256728779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/accfernandes",
                    "index": "#3",
                    "likes": "0",
                    "time": "06/07/2022-08:28:29",
                    "content": "Hi I worked in secularisation modeling for a few years and have good understanding of securitisation how can i help. Kind Regards Antonio ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.833333333333334
                }
            ]
        }
    ]
}