{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/assessing-the-preconditions-for-communication-influence-on-decision-making-scientific-study/1842",
            "title": "Assessing the Preconditions for Communication Influence on Decision Making - Scientific Study ",
            "index": 1842,
            "category": [
                "Governance"
            ],
            "tags": [
                "communication"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/adrianhacker-pdx",
                    "index": "#1",
                    "likes": "2",
                    "time": "29/03/2020-01:52:40",
                    "content": "I just thought I would share these interesting finds.  First is a scientific study that followed the decision making and communication practices amongst all the North American tobacco quitlines.  There are a couple moments where you might think you’re reading about quitting tobacco, but keep with it. Very interesting findings of the situations when communication and consensus worked best and worst.   drive.google.com    nihms402234.pdf Google Drive file.      Also, here is a great article about governance in general and the challenges it faces:    Medium – 29 Nov 17    Blockchain Governance: Programming Our Future This post describes why blockchain governance design is one of the most important problems out there, its critical components, current… Reading time: 17 min read       ",
                    "links": [
                        "https://drive.google.com/file/d/1O7fsbwtYxobBgDV9IZvk3ZPAncYB2xOD/view?usp=sharing",
                        "https://medium.com/@FEhrsam/blockchain-governance-programming-our-future-c3bfe30f2d74",
                        "https://medium.com/@FEhrsam/blockchain-governance-programming-our-future-c3bfe30f2d74"
                    ],
                    "GPT-summary": "The post shares a scientific study on decision making and communication practices among North American tobacco quitlines. The author also provides a link to an article on blockchain governance.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.3125
                }
            ]
        }
    ]
}