{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/a-decentralized-protocol-owned-operated-by-the-community/10627",
            "title": "A decentralized protocol, owned & operated by the community ",
            "index": 10627,
            "category": [
                "Governance"
            ],
            "tags": [
                "community",
                "governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nate",
                    "index": "#1",
                    "likes": "4",
                    "time": "01/10/2021-10:28:16",
                    "content": " Hello dear community members!  As one of the most operational protocols in the crypto ecosystem, MakerDAO is a staple in DeFi. It has unlocked the power of decentralized finance for everyone, creating an inclusive platform for economic empowerment.  The holders of the MKR governance token are the decision-makers for the Maker Protocol, maintaining the system and managing DAI. That gives us the confidence to consider MakerDAO stakeholders the right community, with whom we could share the ongoing liquidity bootstrapping and wider distribution of DXdao’s first product governance token SWPR. Swapr marked the first time a DAO launched a DeFi protocol on Ethereum. It has now grown to a multi-chain DEX with a suite of unique features including LP governance, DIY farming, eco-routing…, to name a few. It is the first automated market maker (AMM) to allow for swap fees to be adjusted through governance. Moving forward, the Swapr protocol will be governed by SWPR token holders through an ERC20 Guild structure, where tokens are locked for voting. That’s why it is important to attract and develop an engaged community to govern Swapr into the future. Token holders can use their voting power to :  Adjust and govern the protocol fee  Manage Swapr Guild treasury  Allocate liquidity mining rewards to targeted pools  Deploy the Swapr Guild and the Swapr protocol to additional networks  Adjust the base pairs that trades are routed through  Improve Swapr protocol and Swapr dApp Thus, the Swapr community would like to invite the Maker community, MKR and DAI holders, to participate in Swapr’s liquidity mining campaigns, be rewarded SWPR governance tokens, and help bootstrap its governance with more active participants to look after the protocol.  You can view the details on the latest Epoch here, including both MKR and DAI allocations.  Happy to stick around and answer any questions or concerns anyone might have!  Meanwhile, if you wish to help spread the word , please share with your fellow community members on social media here & here.  ",
                    "links": [
                        "https://swapr.eth.link/#/pools?chainId=42161",
                        "https://medium.com/swapr/swapr-farming-epoch-2-rewards-572396a0a5d0",
                        "https://twitter.com/SwaprEth/status/1443707981451849740",
                        "https://twitter.com/SwaprEth/status/1440799679554355200"
                    ],
                    "GPT-summary": "The post is an invitation to the Maker community to participate in Swapr's liquidity mining campaigns and help bootstrap its governance with more active participants. The post explains how the Swapr protocol will be governed by SWPR token holders through an ERC20 Guild structure, where tokens are locked for voting. The post also lists the ways in which token holders can use their voting power to adjust and govern the protocol. The author invites the community to participate and answer any questions or concerns they might have.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.0325630252100835
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "09/10/2021-12:44:06",
                    "content": "Interesting is it still possible to participate? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nate",
                    "index": "#3",
                    "likes": "1",
                    "time": "09/10/2021-16:53:48",
                    "content": "Hi!  Yes, everyone is very much welcome, the liquidity mining campaigns will run for many more epochs over the course of at least a year, and will even extend beyond Arbitrum to also include Ethereum mainnet and xDai chain /from next week/. There are still 6 days left in the current farms, they are live until next Thursday when the 3rd Epoch kicks in, which will still feature incentivized DAI and MKR pools:   DAI/wETH    MKR/wETH    You can deposit ETH and it gets auto-wrapped into WETH for free. When you remove liquidity you have the option to receive either ETH or wETH. After you add liquidity to a pool you do need to remember to also stake your LP tokens in a campaign, in order to start earning SWPR governance tokens as a reward. Protocol fees go automatically into your LP tokens, and farming rewards can be claimed from the farming campaign card in the UI. Once a campaign expires, you’d need to go into the pair and into the expired campaigns tab so you claim rewards and unstake your LP tokens. Then you will be able to stake them again in the new campaigns from the new epoch. There will be no need to remove liquidity from the pools, unless you wish to stop LPing. Join our Discord if you need help. ",
                    "links": [
                        "https://swapr.eth.link/#/pools/0x82aF49447D8a07e3bd95BD0d56f35241523fBab1/0xDA10009cBd5D07dd0CeCc66161FC93D7c9000da1/0x2310Ae88fcF850e2d22F5432d40Bf477674a3Fe1?chainId=42161",
                        "https://swapr.eth.link/#/pools/0x2e9a6Df78E42a30712c10a9Dc4b1C8656f8F2879/0x82aF49447D8a07e3bd95BD0d56f35241523fBab1/0x126B6a51D04B56f7D8528bF8B26ADE0A4b3d9B6A?chainId=42161",
                        "https://discord.gg/KZ2JPRxc"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.003246753246753
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "08/01/2022-22:54:12",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}