{
    "poll_list": [
        {
            "title": "Management of Velodrome Airdrop and veNFT - June 13, 2022",
            "index": "15371",
            "option": "Yes",
            "supporting_mkr": "56,783",
            "highest_fraction": 0.9
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-incoming-velodrome-airdrop-on-optimism-velo-venft/15371",
            "title": "[Signal Request] Incoming Velodrome Airdrop on Optimism - $VELO veNFT ",
            "index": 15371,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "summary",
                "sig-status-accepted",
                "impact-:-medium",
                "signal-request"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "4",
                    "time": "25/05/2022-20:37:59",
                    "content": " Sentence Summary MakerDAO will be receiving an airdrop equivalent to 1% of initial voting power for the new Velodrome protocol launching on Optimism on May 31st.  What is Velodrome? Velodrome is an AMM modeled on Solidly (1)(2) that seeks to provide deep liquidity and low slippage to token pairs critical for the growth of the Optimism ecosystem. Velodrome’s model incentivizes liquidity by giving token lockers the ability to direct the protocol’s emissions to their chosen pairs. In return, lockers receive 100% of the trading fees generated by the pairs they vote for, any bribes directed toward these pairs, and an anti-dilutive rebase (if $VELO tokens are locked for the max duration of four years). More information on Velodrome can be found on their Medium.  What benefit does the veNFT provide? The veNFT will allow MakerDAO to direct emissions to the liquidity pools of their choosing, increasing liquidity of the chosen pairs and receiving all trading fees and bribes for those pools.  How should emissions be directed? We believe liquidity and emissions should be directed to DAI pairs to continue building liquidity for DAI on Optimism. Based on the Velodrome team’s analysis, the optimal pairs to incentivize based on 1% voting power are DAI/USDC and DAI/OP. In their model, this would represent 20% APY for $3-4M TVL. Emissions are directed weekly and can be changed if the DAO decides incentivizing other LPs will create more value.  Why should the DAO care? Although Solidly attracted over $2.24B of TVL less than two weeks after launching, issues in the design and the departure of key members pushed the project into irrelevancy. The VELO team have thought deeply about why Solidly failed and are making key changes to Solidly’s mechanisms. Strategic Finance believes that Velodrome could be a significant contender for amassing DAI liquidity on Optimism. To the extent the project is successful, DAI liquidity on Optimism will be significantly improved and the MakerDAO protocol will receive a new income stream from the trading fees and bribes on the Velodrome protocol.  Management of veNFT Given how soon Velodrome is launching, the Velodrome team will initially manage the veNFT on MakerDAO’s behalf until the DAO is ready to manage it. The Velodrome team has recommended the following pairs for launch which they believe will maximize fees and DAI liquidity:  DAI/USDC DAI/OP  Note - Only two pairs are recommended to ensure emissions are high enough to attract adequate liquidity    Should MakerDAO incentivize the pairs recommended by the Velodrome team?  Yes No Abstain     0 voters     Voting to direct $VELO emissions occurs on a weekly basis, every week. The Velodrome team plans to add functionality for carryover voting, but on launch, voting will be manual. As a result, a Governance owned multi-sig would enable the DAO and signers to direct emissions while minimizing Governance overhead. Note - Multi-sig signers will be responsible for voting the veNFT every week once transferred, until carryover voting is enabled. Multi-sig signers will also be responsible for managing the trading fees accrued (based on the pending outcome of the bottom poll). Signers for the multi-sig will be made up of the following trusted community members: @adcv, @luca_pro, @hexonaut, @prose11, @Aes . If anyone else is interested in being a signer, happy to accommodate.    Should we transfer veNFT to a Governance owned multi-sig using MIP47 (4 of 5)?  Yes No, use a Governance owned address (requires executive approval to direct emissions) Abstain     0 voters      veNFT Strategy MakerDAO must also consider what to do with the trading fees earned through the trading activity on the liquidity pools it incentivizes.    What should MakerDAO do with the trading fees?  Compound fees earned into $veVELO to further incentivize DAI liquidity and potentially expand to new pairs when appropriate Send trading fees to the MakerDAO Optimism Governance Address MakerDAO should not participate and sell the veNFT, assuming a market for the veNFT exists Abstain     0 voters     Disclosure: I am long $WEVE (<1.5% of my MKR holdings). ",
                    "links": [
                        "https://andrecronje.medium.com/ve-3-3-curves-initial-distribution-competition-building-a-protocol-for-protocols-79a1ff1cf1a1",
                        "https://andrecronje.medium.com/ve-3-3-ouroboros-part-1-fee-distribution-5dcf131dc82e",
                        "https://andrecronje.medium.com/ve-3-3-ouroboros-part-2-fees-explored-c8e026841ae",
                        "https://medium.com/@VelodromeFi",
                        "https://cryptoslate.com/solidly-tvl-rises-to-over-2-billion-in-24-hours",
                        "https://medium.com/@vedao.alt/on-solidly-60f6481b26fd",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/47",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/84",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/24",
                        "https://forum.makerdao.com/t/weekly-relay-june-7-13-2022/15818",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/17",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/70",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-02-08-2022/15703",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-26-june-01-2022/15569",
                        "https://forum.makerdao.com/t/signal-request-create-a-multisig-to-manage-the-velo-venft/17777",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-may-june-and-july-2022/17037",
                        "https://forum.makerdao.com/t/governance-and-risk-195-thursday-june-16-at-17-00-utc/15816/2",
                        "https://forum.makerdao.com/t/governance-and-risk-194-thursday-june-09-at-17-00-utc/15664/2",
                        "https://forum.makerdao.com/t/relay-semanal-7-13-de-junio-2022/15897",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-13-de-junio-de-2022/15883",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/2"
                    ],
                    "GPT-summary": "The post is a signal request for MakerDAO to receive an airdrop of VELO tokens and veNFTs from the Velodrome protocol launching on Optimism. The post provides information on Velodrome, its model, and how MakerDAO can benefit from the veNFT. The post also asks for feedback on how emissions should be directed and what MakerDAO should do with the trading fees earned. The post is written by a third party who is long $WEVE and is asking for collaboration and feedback from the MakerDAO community.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.51869274136716
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "25/05/2022-23:27:12",
                    "content": "Is this a Signal Request, or an Informal Poll? Also, can you please add an Abstain option? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "0",
                    "time": "26/05/2022-13:18:52",
                    "content": "Formatted as an informal poll. Since there is a “See Vote” button and it’s not a formal signal I think the lack of an abstain is alright for information gathering purposes. With that said, would make my life easier with one as well for tracking how the vote is going, just not sure if it’s worth erasing the current inputs since the vote result is already visible. Post has been updated  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#5",
                    "likes": "5",
                    "time": "26/05/2022-15:12:13",
                    "content": "    flipflopflapdelegate:  Is this a Signal Request, or an Informal Poll? Also, can you please add an Abstain option?   Changed to a Signal Request and updated the polls based on feedback from GovAlpha. If you voted before, please revote!     PaperImperium:  Question: Does this mean Maker will commit energy/funds/time to any protocol that sends it governance tokens?   That is up to the DAO. My personal opinion is that we should be flexible and decide based on amount airdropped and if the project can positively impact our Strategic Focus Areas (DAI Market Share, ETH/WBTC Market Share, RWA Collateral Growth). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.857954545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#6",
                    "likes": "5",
                    "time": "26/05/2022-22:17:39",
                    "content": "This is sooooo exciting! I am very interested in assisting with the active governance of this on behalf of MakerDAO so we do not have to rely on the Velodrome team. Would the community support a metaGovernance proposal from ACREinvest and anyone in particular have capacity to help me with a proposal? ",
                    "links": [
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/24",
                        "https://forum.makerdao.com/t/the-endgame-plan-parts-1-2/15456/34"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party wanting to collaborate on proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#7",
                    "likes": "1",
                    "time": "27/05/2022-12:34:49",
                    "content": "DM us for sure would be amazing to count on your experience ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#8",
                    "likes": "1",
                    "time": "01/06/2022-17:58:19",
                    "content": "Wanted to bump this thread as there is one week left for voting and we do not have many non-abstaining votes. Please consider providing your opinion on these options and engaging about the benefits and drawbacks to the options presented in this thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teemulau",
                    "index": "#9",
                    "likes": "3",
                    "time": "16/06/2022-10:11:09",
                    "content": "Voting yes in the governance poll to improve DAI liquidity on Optimism. Velodrome is a good project and compared to efforts this is a net positive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.545454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "15/09/2022-16:11:18",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1145"
}