{
    "poll_list": [
        {
            "title": "Tactical Re-allocation Process for Budget Adjustments - August 1, 2022",
            "index": "16788",
            "option": "Yes",
            "supporting_mkr": "68,368",
            "highest_fraction": 0.66
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-budget-re-allocation-core-unit-accountability-framework/16788",
            "title": "[SIGNAL REQUEST] Budget Re-allocation & Core Unit Accountability Framework ",
            "index": 16788,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "strategic-finance",
                "impact-:-medium",
                "bear-prep"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#1",
                    "likes": "11",
                    "time": "23/07/2022-00:57:54",
                    "content": " [SIGNAL REQUEST] Budget Re-allocation & Core Unit Accountability Framework  Sentence Summary Should the DAO use a broad-based cut or tactical reallocation process to adjust budgets?  Background On the July 20th, 2022 Decentralized Voter Committee call, Strategic Finance presented two paths the DAO can take as it relates to adjusting the budgets and returning to breakeven operating cash flow, which was recently voted for on-chain as the preferred operating target by MKR holders. A recording of the presentation can be found here, and we’ve copied the slides from our presentation below for visibility. We would encourage those interested in this proposal to listen to the presentation and Q&A session which lasts about 40 minutes. To summarize, Strategic Finance recommends Option 2, but will support any option chosen by the DAO and MKR holders. We understand what we have presented is not the perfect solution, but we believe the DAO needs to start somewhere in regards to measuring Core Unit success and having accountability to MKR holders. We hope to collaborate with the community and continuously iterate on this framework while maintaining the core framework values of transparency & fairness, results & execution oriented, value accretive for MKR holders, high accountability, data driven, adaptable, and iterative.  Slide11040×720 44.9 KB   Slide21040×720 148 KB   Slide31040×720 51.8 KB   Slide41040×720 181 KB   Slide51040×720 172 KB   Slide61040×720 128 KB   Slide71040×720 133 KB   Slide81040×720 149 KB   Slide91040×720 137 KB   Slide101040×720 137 KB   Slide111040×720 157 KB   Slide121040×720 180 KB   Slide131040×720 114 KB   Slide141040×720 159 KB   Option 1: Broad Cut The main benefits of a broad cut approach are that reductions can be made quickly and they are easily measurable onchain to ensure Core Unit compliance. The downsides to such an approach are that Core Units are all treated equally, regardless of performance or spend. In fact, excessive historical spend is rewarded while and spend consciousness is penalized. Such an approach may also cut or delay mission critical activity or significantly delay product launches.  Option 2: Tactical Reallocation The primary benefits of a tactical reallocation are that MKR holders can allocate capital based on merit and holistically with a DAO-wide view. Up until this point, there have been no clear or agreed upon Core Unit KPIs–this framework seeks to facilitate alignment between Core Unit Facilitators, Delegates, and MKR holders on KPIs & goals that create value for the protocol. The main downside of this approach is that it will be time-consuming–like any new process or framework–to bootstrap from scratch. The tactical reallocation framework address several issues with the status quo, mainly lack of transparency & visibility into core unit activities, difficulties evaluating core unit performance, and non-simultaneous budgeting periods. This proposal recommends a concurrent budgeting period for all core units, during which core units will provide details on their strategic goals, key activities, and KPI targets to  delegates and MKR holders. Delegates and MKR holders will together develop competing budget proposals to guide the overall profitability of the protocol, which will be evaluated using an on-chain vote. At the end of the budgeting period, delegates and MKR holders will evaluate the performance of each core unit against its strategic goals and KPI targets and use the result as information in the next capital allocation process. Given the current volatility of our revenue, we recommend 6-month budget periods until the protocol can secure a source of more stable long term interest revenue (RWAs, Monetalis, etc.). After the initial reallocation and budget period, we believe the DAO should have much better visiblity into the operating runway. Once operating cash flows and the protocol revenue stabilize, subsequent budget cycles will be extended.  Rebudgeting Process  Screenshot 2022-07-22 1437021458×797 102 KB  Each stage of this budgeting process is executed across all existing and proposed core units concurrently:   Core unit Budget & KPI Proposals  Delegates and MKR holders determine the Targeted Spend level for the budgeting period using an on-chain vote Core units propose budgets, layout key operating activities, strategic goals, and KPIs, and highlight capital tradeoffs in a lower / higher budget allocation scenario  Important that core units categorize the spend between baseline (”lights on”) spend vs. growth spend → this will allow delegates to better understand capital allocation tradeoffs   As part of this process, core units are promising to deliver operating results (in the form of KPIs) in return for a capital allocation from the DAO Core units should identify and release a set of operational KPIs that accurately reflect the impact and return the DAO will receive from the core unit  3 KPIs per core unit to start (max 5 in the future) 1 short-term/quarterly 2 long-term/annual   Delegates & MKR holders will assist core units with the development, negotiation, and measurement of KPIs and confirm that the targets set are reasonable for the core unit and the protocol    Budget Proposal Evaluation  In this stage, Delegates & MKR holders match the total budget ask to the Targeted Spend level Delegates & MKR holders use allocation tradeoffs provided by core units, ROI & impact to the protocol, and past KPI attainment to develop several competing capital allocation plans (i.e. budget plans) that will be presented for a signal poll and then on-chain vote  Illustrative governance process:  Delegates & MKR holders vote in an on-chain ranked choice poll on the competing budget plans presented  Budget plans that do not match the Targeted Spend level previously voted upon will be ineligible to receive votes   After a winning ranked choice poll is selected, the winning budget plan is proposed to an  on-chain binary vote      Capital Allocation & KPI Re-Targeting  The budget plan is voted on and confirmed on-chain Core units communicate to delegates and MKR holders the impact of lower / higher capital allocation on their KPI targets and make new operational promises to the DAO Delegates & MKR holders will confirm that the new targets set are reasonable for the core unit and the protocol    Evaluation of KPI attainment  After the KPI period is complete, the delegates and MKR holders will review each core unit’s KPI scorecard to understand how they performed against their strategic goals. Delegates and MKR holders will have input when the KPI attainment is a qualitative metric KPI scores will help answer the questions of “How risky is the investment in this core unit?” and “How did this core unit perform against it’s targets last budgeting period?”     Key Performance Indicators (KPIs) KPIs allow delegates and MKR holders to measure the performance of a core unit against its own strategic goals. Maker will be able to allocate capital more efficiently in the future by understanding where capital produces results. Criteria for Effective KPIs  Simple to understand Relevant to the operations of the core unit Specific to a time period / timeline Aligned with the strategic goals and values of the protocol Actionable and able to be impacted by the operations of a core unit Measurable (calculation process must be disclosed during the budgeting process and immutable as long as the incentives are live) Attributed to a single owner / core unit facilitator who will take responsibility for attainment   Tactical Reallocation Timeline (relative)     Dates Action Items     7/22 Write post to the community to explain next steps and high level framework. core units have three weeks to prepare for the rebudgeting process, using the new format outlined in MIP4c2-SP19   8/1 - 8/5 Meet with core unit facilitators, delegates, and MKR holders to align on KPIs   8/18 - 8/25 Public calls are scheduled with each core unit and delegates to present new budgets, defining baseline spend, investment requests, and contingency scenarios (10% cost cut relative)   8/25 - 9/1 All budgets and scenarios are consolidated by SF and distributed to delegates to analyze and determine appropriate capital allocation. SF will also provide an updated cash flow forecast, working with Allan from Monetalis to incorporate latest revenue projections from MIP65   9/2 - 9/12 Based on the aggregated budgets proposed by core units, delegates and MKR holders (with the assistance of SF where needed) will independently develop an alternate budget allocations in response to the proposed budgets and overall organizational goals. Delegates and MKR holders should be focused on developing a alternate budgets that will pass   9/13 Delegates and MKR holders present competing budget proposals to the community   9/16 Delegates and MKR holders submit community budget MIP   9/19 - 9/23 Core Unit Facilitators align with delegates and MKR holders on new mandates and goals based on finalized budgets     Signal Request Poll If this Signal Request is approved, the on-chain poll will feature ranked-choice options between several options.     Signal Request Options Pro Con     Option 1: Broad Cut  Reductions can be made quickly  Budgets can still be viewed holistically     All Core Units treated equally, regardless of performance or spend Excessive spend rewarded, spend consciousness penalized Potential to cut mission critical activity or significantly delay product launches    Option 2: Tactical Reallocation  MKR holders can allocate capital based on merit Budgets can adjusted to reflect the current market environment and forecast, reductions can be made quickly  Capital can be allocated all at once, with a DAO-wide view  Time-consuming, new processes must be developed     None, no Change  No incremental work required Limits impact on current CUs   MKR’s cash burn will continue to be driven by topline performance Conflicts with previous signal poll to set a level of Recurring Net Protocol Income Profitability     Voting Yes (i.e. including in your multiple choice selection) will move this poll on-chain where MKR holders can vote for a broad-based cut, tactical reallocation, or no action, depending on which options gather >50% support:  If both A and B have >50% support the poll proceeds to a ranked choice vote on chain. If A or B has > 50% support, the poll proceeds to a yes/no vote on chain. If neither A nor B get > 50% support then no further action will be taken at this time.  This Signal Request will run for one week rather than two given the urgency triggered by market conditions: 2022-07-23T17:00:00Z→2022-07-30T17:00:00Z    Which are your preferred option(s) to guide budget allocations? (multiple choices allowed)  Option 1: Broad-based Cut Option 2: Tactical Reallocation None, no change Abstain     0 voters      2022-07-25 @Patrick_J edited to clarify next steps section. No changes were made to the poll.  ",
                    "links": [
                        "https://www.youtube.com/watch?v=u-nFkEn0lY0",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-may-june-and-july-2022/17037",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties-round-up-3/17860",
                        "https://forum.makerdao.com/t/blockchain-columbia-delegate-platform/15202/15",
                        "https://forum.makerdao.com/t/discussion-sf-and-its-involvement-with-lido-steth/17585/7",
                        "https://forum.makerdao.com/t/signal-request-n6m-target-spend-level/17122",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/55",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/92",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/9",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/38",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-28-de-julio-03-de-agosto-del-2022/17139",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-11-traduccion/16960",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-11/16959",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7",
                        "https://forum.makerdao.com/t/2022-08-02-governance-poll-clarification/16952",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/10",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/102",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-27-de-julio-del-2022/16941",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/100",
                        "https://forum.makerdao.com/t/relay-semanal-19-25-de-julio-del-2022/16925",
                        "https://forum.makerdao.com/t/mip77-delegates-in-the-maker-protocol/16905/7",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/6",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/8"
                    ],
                    "GPT-summary": "The post is a proposal for a budget re-allocation and core unit accountability framework for the DAO. The author explains two options for adjusting budgets and returning to breakeven operating cash flow, and recommends Option 2. The proposal seeks to measure Core Unit success and have accountability to MKR holders, and recommends a concurrent budgeting period for all core units. The post also outlines a rebudgeting process and a timeline for implementation. The author encourages collaboration with the community and continuous iteration on the framework. The post may receive constructive criticism, questions, and requests for collaboration or review.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.605415764790765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "3",
                    "time": "23/07/2022-00:57:55",
                    "content": "The following is GovAlpha’s summary of this Signal Request:  This is a valid Signal Request Multiple options are presented; voters should select all options they support. Any option which receives > 50% of non-abstain votes will proceed on-chain. Any on-chain vote will include “No” or “Reject option(s)” as a voting option. If more than one option receives > 50% of non-abstain votes, the on-chain poll will be an Instant Runoff Vote. This proposal has been given a “Medium Impact” rating as it does not make changes in isolation but will instead lead to future proposals if there is a positive outcome on-chain. If the Signal Request is successful, it will proceed on-chain on 2022-08-01. The on-chain poll will last for 3 days.   Discussion This Signal Request asks the community whether they would prefer Core Unit budgets to be subject to a broad-based cut (i.e. a flat % cut to all budgets) or a tactical re-allocation process. A broad-based cut will decrease all CU budgets equally. The % value of a broad-based cut is not specified in this proposal. The tactical reallocation process is outlined above. It seeks to achieve consensus between CUs, delegates, and MKR holders through a developed framework that will propose KPIs for CUs while taking a holistic view of the DAO’s expenses. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.532925407925408
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#3",
                    "likes": "2",
                    "time": "23/07/2022-16:53:02",
                    "content": "While I agree that KPIs are the right direction, I doubt the feasibility with our current structure. Developing good KPIs is hard and delegates will need to review, come to consensus on and implement 20 sets of KPIs. Those KPIs will inevitably be flawed, which will require delegates to closely monitor them and work with all 20 CUs to adjust as necessary. As it stands, people would inevitably be voting for KPIs they don’t understand well and follow-up would be sporatic. We would need some form of consolidation for this to be implemented properly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.121279761904763
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#4",
                    "likes": "0",
                    "time": "25/07/2022-14:56:59",
                    "content": "@CodeKnight This is true and will continue to become more difficult as CUs scale and grow in number. One potential strategy that may help is to group delegates with specialties or specific CUs. We have more Recognized Delegates now than Core Units, which means we can split CUs into something like four domains and, respectively, group delegates into those domains. This will allow delegates and CUs to spend more one-on-one time reviewing KPIs. Additionally, this will build more delegate-core unit relationships, reduce stress on delegates, and allow for better quality coverage of all CU KPIs. Just a thought! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.237500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#5",
                    "likes": "1",
                    "time": "25/07/2022-18:49:34",
                    "content": "That system sounds a lot like the US House of Representatives. Different constituencies have their own representatives(Maker holders or voters) and the reps delegate most of the work to smaller committees. It’s functional,  but generally isn’t considered a great system. It makes corruption easier as lobbyists can target relevant committee members and can diffuse responsibility. If we can’t reduce voting complexity though, then it may be our best option. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#6",
                    "likes": "0",
                    "time": "26/07/2022-15:40:40",
                    "content": "I had a good chat yesterday with SFCU and understand the problem that they’re trying to solve. My issue continues to be with the treatment of delegates as a “management council” of sorts that is supposed to be responsible for working with CUs to reach consensus on KPIs and budgets before they are voted for on-chain. I don’t ever believe it’s a good idea to ask delegates to reach consensus in crafting the proposal that they’ll be voting on. In this forum post, I noticed that mentions of “delegates” were changed to “delegates and MKR holders” in an attempt to show that delegates won’t be treated differently from MKR holders. However, I don’t see how non-delegate MKR holders can really participate in this process until there is voting with MKR, which does treat delegates differently. Delegates are just big blobs of MKR holders. That’s all they should be considered as. They shouldn’t be given additional jobs that aren’t directly related to MKR delegation. Maker’s system of governance simply is not set up to reach off-chain, subjective consensus. We’d need to develop a rigid framework for this. I do see how having some sort of formal off-chain negotiation process could yield great efficiency, but it can’t happen at the expense of decentralized decision-making. I’d want to see some process formalized for this before participating. The current proposition will result in negotiation happening very subjectively, arbitrarily and opaquely amongst delegates & CUs, even though that is the problem we’re trying to fix. Instead of leaning on delegates to act as management, I propose that we address the problems in governance that created this situation in the first place. We can’t just keep working around them. We need to work to change the rules where they’re failing us. And they appear to be failing us when it comes to CU accountability and proper budgeting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.983333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "4",
                    "time": "26/07/2022-18:06:21",
                    "content": "    CodeKnight:  While I agree that KPIs are the right direction, I doubt the feasibility with our current structure. Developing good KPIs is hard and delegates will need to review, come to consensus on and implement 20 sets of KPIs.   I believe SFCU has outlined a nice and simple  directional game plan that helps both MKR token owners and Delegates decide what is the best route for growth, or just keeping the “lights on.” Once the DAO gets the KPI dashboard up and running—the format will then make it easy for both MKR token owners and delegates to quickly understand the KPI status and progress of each CU in order to make informed decisions. BTW, this also sets up well for analyzing budgets for future MetaDAOs. All-in-all this a very nice initiative here that the community should be supporting.     ChrisBlec:  I noticed that mentions of “delegates” were changed to “delegates and MKR holders” in an attempt to show that delegates won’t be treated differently from MKR holders.   If you watch a replay of the call the SFCU always mentions both MKR token owners and delegates in the same sentence. Could be a grammatical error on this one. It happens.     ChrisBlec:  Delegates are just big blobs of MKR holders. That’s all they should be considered as. They shouldn’t be given additional jobs that aren’t directly related to MKR delegation.   Tough tasks are part of what it takes to Govern the protocol. You and I are servants of the DAO and now more than ever we need to step-up and help the DAO navigate this pivotal moment. I believe you mentioned this is why you’re here, and now more than ever Delegates and MKR token owners need to put all of their focus on helping CUs allocate their budgets judiciously and deliver the expected performance the DAO deserves. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.068596681096681
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#8",
                    "likes": "0",
                    "time": "28/07/2022-09:03:02",
                    "content": "7 posts were split to a new topic: The Role of Delegates within a DAO ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#9",
                    "likes": "3",
                    "time": "28/07/2022-18:30:38",
                    "content": "Voted Abstain. There’s just so many problems with this I can’t begin… I understand the frustration teams are under and desire to have a stable environment in which to work, so I respect the effort. The following have made important cautionary points above and on today’s G&R call @Eumenes @brianmcmichael @monkey.irish @Nadia @MakerMan @Llama @ChrisBlec ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Llama",
                    "index": "#10",
                    "likes": "7",
                    "time": "29/07/2022-15:08:53",
                    "content": "I voted to abstain as well, I think we might have rushed with jumping to conclusions (get back into profit) without analyzing both sides of the problem. From a financial analysis standpoint, it looked like the best option to get on break even as soon as possible. But have we analyzed the opportunity cost by doing so? Have we analyzed where we might have the opportunity to capture more market and bring more revenue long term? I support revisiting our priorities and confirming that the direction MakerDAO and individual core units are heading towards will bring the most value. But when we are already doing this, let’s not just put KPIs on what we are doing but rather create a framework that will enable innovation, accountability, and long-term growth. I assume many of our core units use some version of Agile methodology, and I think that’s a perfect start. Because all agile methodologies work with an overarching goal (Epic) in mind towards which we are all building. We should use some methodology like GOST to define the goal for Maker and then break it down to individual objectives, strategies, and tactics. The core units should be part of the process as they should then be working only on what has been defined as part of this process because that’s what we have agreed to work on for the next period, and we can track the completion of those items.  They should be granular enough that the Maker community sees progress and flexible enough to let core units work the way they want to. This process should repeat periodically to confirm the consensus on the direction, update the roadmap, and head toward new successes. Also, this process should not create a centralization, as the entity defining GOST would not have authority to enforce it; it only facilitates the discussion between core units and maker holders to find consensus on the direction and enables long-term focus. As Vitalik mentioned in his tweet a few weeks ago, Maker should outlast everyone rather than make rushed decisions. I am happy to kick off this work to define our long-term goals if there is community and core units support. cc: @Recognized-Delegates @Core-Facilitators ",
                    "links": [
                        "https://twitter.com/VitalikButerin/status/1545333682013093889?s=20&t=34xviLsdrU08PAQRpZC1tQ"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.173085016835017
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#11",
                    "likes": "2",
                    "time": "29/07/2022-22:57:17",
                    "content": "I voted for a tactical reallocation because it’s the only thing that moves the community towards two things:  Working off a similar page. Thinking about allocating capital and energy towards measurable outcomes.  My hunch is by putting this exercise on the calendar and committing, we’ll highlight the dependencies and at least roll things into a workable format.     Llama:  I support revisiting our priorities and confirming that the direction MakerDAO and individual core units are heading towards will bring the most value. But when we are already doing this, let’s not just put KPIs on what we are doing   To your point, is that KPI’s though…? maybe? It will be a rough beginning, but getting teams onboard needs to happen. I know another proposal on deck that I slightly prefer more, but the underlying result is the same. They aren’t mutually exclusive.     Llama:  create a framework that will enable innovation, accountability, and long-term growth.   Not to pick on you specifically, Puncar–The-Lead-Llama, but posts about coherent high level always go the same way. There is palpable frustration, then hand waving at designing high-level frameworks like it’s somehow the solution. Then the thread is forgotten without follow through, mostly because trying to design the perfect framework isn’t really what helps. It’s struggling through the mess. Gost, NCT’s, OKRs, KPIs, it’s all theatre until we :  Get a regular committed time on the calendar and recognize that it will take time/effort. (This proposal asks for a commitment). Bring in the stakeholders with a similar frame of reference. (MKR holders already voted to hit break even. FWIW that vote was missing the “by when”) Agree on a timeline to measure success (to the bullet above) Work together defining metrics to succeed (Preferably at a cross-core unit level, and maybe we’ll uncover that KPI’s don’t fit that way. It Is fine.)  LFG  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.736458333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#12",
                    "likes": "3",
                    "time": "30/07/2022-16:13:22",
                    "content": "Any budgeting process inevitably ends up somewhere on the spectrum between full automation, decisions are computable functions of quantitive KPIs, and purely manual approach, decisions are results of informal discussions and agreements. You can’t avoid finding a compromise between unfair and unrealistic KPIs, which always don’t take into account the reality of life, and subjective, opinionated human decisions. Inevitably there needs to be a layer between MKR holders and CUs for oversight and stewardship. Direct democracy works only under a very rigid scaffold of conditions. For now delegates have no codified power for oversight, but somebody has to do it in the interests of MKR holders. Maker could go forward with designing and implementing a bespoke structure(s) with this mandate. Unfortunately, the protocol is losing money as we are debating the issue. The proposal is an opportunity to sculpture such structure on the go. It will be an emergent rather than planned process. There’s nobody in the Maker community other than delegates who could jumpstart this process of finding an optimal design for the oversight and stewardship body by working on a better budgeting process simultaneously tackling the problem of bringing the protocol to the break even point. Hence a vote in favour of tactical reallocation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.906887755102041
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Llama",
                    "index": "#13",
                    "likes": "1",
                    "time": "30/07/2022-16:53:26",
                    "content": "Thank you for your comments Tim, I totally agree with you that framework itself wont solve our problem. But I believe that overall alignment on the direction will make everyones life easier and bring little bit of stability.     twblack88:   Get a regular committed time on the calendar and recognize that it will take time/effort. (This proposal asks for a commitment). Bring in the stakeholders with a similar frame of reference. (MKR holders already voted to hit break even. FWIW that vote was missing the “by when”) Agree on a timeline to measure success (to the bullet above) Work together defining metrics to succeed (Preferably at a cross-core unit level, and maybe we’ll uncover that KPI’s don’t fit that way. It Is fine.)    We are aligned here, we need to work together to define where are we heading, that should include gathering input from core units, MKR holders, conduct market research, check with our biggest ecosystem partners on what is their strategy etc.     pipko:  |8/1 - 8/5|Meet with core unit facilitators, delegates, and MKR holders to align on KPIs   I think we need to put more emphasis on this point, lets commit time and prepare a comprehensive material where we outline where we want to be in 6 months, 12 month, 24months with a background information about our partners, competitors, and overall market. We find consensus on that and then CUs can adjust their budgets/directions according to the overall strategy. I think there is already some good material to start with, we just need to make it more comprehensive (involve all stakeholders ) and actionable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.809722222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#14",
                    "likes": "1",
                    "time": "01/08/2022-12:09:58",
                    "content": "This Signal Request has ended with a majority of non-abstain voters voting in favour of Option 2: Tactical Reallocation. This will proceed to an on-chain weekly poll today, with Tactical Reallocation, No Change, and Abstain as options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "31/08/2022-22:10:57",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1469"
}