{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/an-even-more-sore-point-on-liquidation/8278",
            "title": "An even more sore point on liquidation ",
            "index": 8278,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "liquidations"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/absolutesun",
                    "index": "#1",
                    "likes": "2",
                    "time": "24/05/2021-01:58:25",
                    "content": "Hi Team, I’ve been following the conversations around liquidation as I, too, lost everything. Nothing new to add to that conversation; the 13% liquidation confusion also caught me. My issue is with the increase in minimum to $5000 DAI I understood the risk that somehow all of my collateral could be lost in a freak event, but I had my risk managed at a level I was comfortable with. Then one day I have to more than double my collateral at risk to meet the new $5k criteria, or I can’t transfer or manage my own available ETH or DAI. I do not find this acceptable as now I have lost more than I desired to risk. What can be done to compensate? Thanks for everyone’s support. Dave ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4363636363636365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "5",
                    "time": "24/05/2021-13:55:27",
                    "content": "Hey Dave, While compensation for your situation is probably off the table, I do think you bring up an important point. Although things like Flash Loans can provide some remedy to this situation, it is not practical for us to assume positions with smaller dust amounts will have the technical knowhow to preform them in the event that the dust limit is raised above their current debt. Your thoughts and opinions as a system participate are quite valuable and I encourage you to engage with Governance on this forum, if that’s something you’re interested in. You can even get monthly payouts through our SouceCred Program:    What is SourceCred and how do I opt in? Governance       With the extension of the Maker SourceCred trial, the team running the Maker SourceCred instance has received feedback that it is difficult to find information on opting in to receive payments and about the trial in general. This post is meant to be a useful resource for information on SourceCred and how it pertains to Maker.   What is SourceCred / Why should I be interested?  SourceCred is a way of paying contributors based on the value they add to a community. In the context of MakerDAO, using…     Hope this helps some, you might also like to read some of the engagement on the posts with the dust tag. https://forum.makerdao.com/tag/dust Best, Prose ",
                    "links": [
                        "https://forum.makerdao.com/tag/dust"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.795454545454546
                }
            ]
        }
    ]
}