{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/recent-executive-votes-2021-05-24/8300",
            "title": "Recent Executive Votes (2021-05-24) ",
            "index": 8300,
            "category": [
                "Updates"
            ],
            "tags": [
                "executive"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "21",
                    "time": "24/05/2021-13:25:25",
                    "content": "As some of you may have noticed, we did not end up putting up an new executive vote on the governance portal last Friday (2021-05-21) or the weekend following. The reasons for this are as follows:  The previous weeks (2021-05-14)  executive vote had not passed on Friday at the point we would normally put up the next executive. The previous weeks (2021-05-14) executive vote was required in order to pass the executive that was planned for 2021-05-21. The previous weeks (2021-05-14) executive vote ended up passing on Sunday. We had the monthly MIPs executive for May planned for 2021-05-24. We did not think that we could pass both executives given the constricted timescale.  The plan going forward is as follows:  Have the monthly MIPs executive for May as planned today (2021-05-24) Move last weeks executive (2021-05-21) to next Friday (2021-05-28). Possibly add additional content to the executive on Friday (2021-05-28). This might be urgent content in the form of PSM or tip changes, or might be regularly scheduled content.  After discussing with @Risk-Core-Unit  and @Protocol-Engineering  we decided not to bundle any urgent changes with the monthly MIPs executive for May. The main reason for this is that we don’t want to risk it not passing due to urgent changes. The monthly executive includes a couple of changes that are pretty important, namely:  The SES budget distribution MIP51, which will help prevent this situation in the future (at least mitigates it.)  If necessary we may consider an urgent executive midweek, depending on market activity and PSM usage. Thanks all, and apologies for not posting something sooner. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-may-30th-2021/8495",
                        "https://forum.makerdao.com/t/maker-relay-ep-46-en-espanol/8358"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.094507575757575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "6",
                    "time": "24/05/2021-13:48:07",
                    "content": "In full support of this timeline. The events of this past week have shown the power of measured decision making and steady progress. While all these votes contain important material, the great importance of the contents in the Monthly Governance Bundle dictates that it should not be combined with other material unless strictly necessary. With Risk signing off on this timeline I think this is the most prudent course of action. As a member of GovAlpha I will be paying close attention to the situation with the PSM and any recommendations that Risk or Protocol Engineering might put forward. We will be around and ready to facilitate an urgent executive should there be reason for one. Seeing that we are not at this situation yet, it makes most sense to me to proceed with the MIPs vote today, especially considering this one has Core Unit approval and funding tied into it. Happy to hear other thoughts and discourse on the matter, but lend my full confidence to this decision. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/05/2021-00:38:41",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/06/2021-00:38:56",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}