{
    "poll_list": [
        {
            "title": "MIP9 Community Greenlight Poll - UNI-V2-DAI-ETH (UniswapV2 Dai-Eth Liquidity Token) - August 17, 2020",
            "index": "3480",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "37,272",
            "highest_fraction": 1.0
        },
        {
            "title": "MIP9 Community Greenlight Poll - UNI-V2-USDC-ETH (UniswapV2 USDC-ETH Liquidity Token) - August 17, 2020",
            "index": "3481",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "37,269",
            "highest_fraction": 1.0
        },
        {
            "title": "Add UNI-V2-DAI-ETH (UniswapV2 DAI-ETH LP Token) as a Collateral Type - December 7, 2020",
            "index": "3480",
            "option": "Yes",
            "supporting_mkr": "31,052",
            "highest_fraction": 0.59
        },
        {
            "title": "Add UNI-V2-USDC-ETH (UniswapV2 USDC-ETH LP Token) as a Collateral Type - December 7, 2020",
            "index": "3481",
            "option": "Yes",
            "supporting_mkr": "30,952",
            "highest_fraction": 0.59
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/uni-v2-dai-eth-uniswap-v2-dai-eth-liquidity-token-collateral-application/3480",
            "title": "[UNI-V2-DAI-ETH] Uniswap V2 Dai-Eth Liquidity Token Collateral Application ",
            "index": 3480,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "uniswap-v2",
                "uni-v2-dai-eth"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#1",
                    "likes": "15",
                    "time": "31/07/2020-17:40:38",
                    "content": "So we’ve been recently been discussing the possibility of uniswap liquidity tokens as collateral again in this thread . The uniswap v2 pools now have much more liquidity than v1 pools, and so I think it’s time to have an updated application here. Here are more related threads: v1 collateral discussion v1 collateral application(v2 app is mostly copied from here): Reasons to include the Eth-Dai liquidity token Personally, I think the Eth-Dai token would make good collateral for the following reasons:  Being able to use it for collateral incentivises the uniswap-v2 ETH-DAI pool, this is beneficial as it allows people to trade Eth-Dai with less slippage. It is more valuable to hold when ETH is trading sideways rather than upward or downward. This makes it more likely actors will wish to use it for leverage when they expect no major change in Eth price. It is the 3rd largest liquidity pool of the uniswap liquidity pools at just over 10 million dollars worth of assets. We may also consider adding the eth-usdc token which is the 2nd largest with over 13 million dollars in assets. More uniswap pool info here  potential as a tool to improve the peg if the protocol opens a vault, allowing us to inject dai liquidity directly into the market by holding uniswap tokens, while providing much desired yield to mkr holders. This also mitigates the issue brought up previously of uniswap tokens having insignificant impact on dai supply.  Application Form 1. Who is the interested party for this collateral application? @befitsandpiper 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token Uniswap is a decentralized Constant Product Market Maker that operates on-chain. Unlike v1, there is a possibility of governance in the future that will allow upgrading of the profile. There are three user groups, the first: traders use uniswap to swap one crypto-asset for another. The second: liquidity providers who provide liquidity for traders in exchange for a small fee on every trade. The third: a hypothetical future DAO to manage and upgrade the protocol. As far as I can tell this DAO and associated governance tokens have not been released yet, and I have not been able to find much information on it. See https://uniswap.org/docs/v2/ for more details. 3. Provide a brief history of the project I’m going to leave this for someone else to provide. I’m not 100% sure how relevant it is for this particular collateral type and I suspect that most people are aware of uniswap. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. High level explainer of v2 vs v1: https://uniswap.org/blog/uniswap-v2/ Whitepaper: https://uniswap.org/whitepaper.pdf Docs: https://uniswap.org/docs/v2/ Code: https://github.com/Uniswap 5. Link any available audits of the project. Both procedural and smart contract focused audits. Audit report: https://uniswap.org/audit.html 6. Link to any active communities relating to the project. Discord: https://discord.com/invite/XErMcTq Blog: https://uniswap.org/blog/ 7. How is the applying collateral type currently used? To the best of my knowledge the uniswap liquidity tokens are not used by any other protocols directly. There are a number of dashboards that display the amount available, and some apps for calculating profit, but otherwise these appear to be a largely untapped resource. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? No organisation bears legal responsibility for the collateral. Dai, Eth and the uniswap tokens are all permissionless. 9. Where does exchange for the asset occur? I am not aware of any markets for the ETH-DAI uniswap liquidity tokens outside of uniswap itself. Uniswap allows redemption between liquidity tokens and the underlying assets at any time. By definition, there is always the required liquidity for this redemption. 10. (Determined by Legal Domain Team) Has the project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. No 11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. No 12. (Optional) List any possible oracle data sources for the proposed Collateral type. Not sure. I suspect the best way to go about this is to have oracles report the prices for the underlying assets and then get the ratio from the uniswap contract. Uniswap does have an oracle system discussed here: https://uniswap.org/blog/uniswap-v2/. I’ll leave it up to the Oracle Domain team to decide if we want to use the uniswap oracle for the token price. 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. No parties that I know of, though I suspect that anyone willing to bid on ETH collateral would also be willing to bid on ETH-DAI liquidity tokens. ",
                    "links": [
                        "https://forum.makerdao.com/t/uni-v1-uniswap-liquidity-tokens-as-collateral/711",
                        "https://forum.makerdao.com/t/uni-v1-dai-uniswap-dai-liquidity-token-collateral-application/1966",
                        "https://uniswap.info/home",
                        "https://uniswap.org/docs/v2/",
                        "https://uniswap.org/blog/uniswap-v2/",
                        "https://uniswap.org/whitepaper.pdf",
                        "https://uniswap.org/docs/v2/",
                        "https://github.com/Uniswap",
                        "https://uniswap.org/audit.html",
                        "https://discord.com/invite/XErMcTq",
                        "https://uniswap.org/blog/",
                        "https://uniswap.org/blog/uniswap-v2/",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793",
                        "https://forum.makerdao.com/t/maker-relay-ep-8/3712",
                        "https://forum.makerdao.com/t/maker-relay-ep-24/5534",
                        "https://forum.makerdao.com/t/uni-v2-dai-eth-erc20-token-smart-contract-technical-assessment/5013",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-11-wednesday-october-14-18-00-utc/4629/12",
                        "https://forum.makerdao.com/t/uniswap-lp-tokens-dai-collateral-onboarding-application/4278/4",
                        "https://forum.makerdao.com/t/weekly-polls-2020-08-17/3707",
                        "https://forum.makerdao.com/t/subreddit-repost-reducing-dai-redemption-value-to-fix-peg/3525/4",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/42",
                        "https://forum.makerdao.com/t/maker-relay-ep-24-en-espanol/5574",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-11-renvm-uniswap-wednesday-october-14-18-00-utc/4629"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Law and regulations"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.904094387755102
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#2",
                    "likes": "7",
                    "time": "31/07/2020-17:56:37",
                    "content": "I strongly support uniswap liquidity as collateral. It is easy to liquidate by breaking into parts. V2 has a built-in oracle that resists manipulation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#3",
                    "likes": "3",
                    "time": "31/07/2020-18:32:25",
                    "content": "What are the implications of having DAI serve as collateral for itself? Does it allow for vaults to create highly leveraged situations that could be unstable? One good thing about this is that it provides DAI liquidity in a positive way that will actually circulate in the market and provide stability for the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3590909090909085
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#4",
                    "likes": "3",
                    "time": "31/07/2020-18:50:04",
                    "content": "would say this topic has been discussed a fair amount itt:     [UNI-V1] Uniswap Liquidity Tokens as Collateral Collateral Discussion       The Uniswap liquidity token is essentially 50% ETH and 50% another token that does well while Uniswap volume outpaces volatility.  The two largest Uniswaps by ETH are DAI and MKR, so these would be good sources of collateral. It’s easy to oracle the value of uniswap liquidity tokens based on their underlying assets.  Uniswap MKR has 344 holders and a market cap of about $3.5mm  Uniswap DAI has 752 holders and a market cap of about $2.7mm.  Uniswap WETH never made sense to me but people still use…      ",
                    "links": [
                        "https://etherscan.io/token/0x2C4Bd064b998838076fa341A83d007FC2FA50957",
                        "https://etherscan.io/token/0x09cabEC1eAd1c0Ba254B09efb3EE13841712bE14",
                        "https://etherscan.io/token/0xa2881a90bf33f03e7a3f803765cd2ed5c8928dfb"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#5",
                    "likes": "5",
                    "time": "01/08/2020-01:01:59",
                    "content": "    rileyjt:  What are the implications of having DAI serve as collateral for itself? Does it allow for vaults to create highly leveraged situations that could be unstable?   While there’s limited value in DAI collateralizing DAI, there is no drawback to it. Mixed collateral, which is only partially DAI, works and is less risky the larger its DAI composition. See @Jiecut’s writeup in the v1 discussion.     [UNI-V1] Uniswap Liquidity Tokens as Collateral Collateral Discussion       To clear the issue of DAI not being fully backed at ES.  Say there was 100 DAI minted. The collateral pool is 90 USDC and 10 DAI.  At ES there will be 90 DAI in circulation with a collateral pool of 90 USDC and 10 DAI. There is enough collateral to back all claims.  You can think of DAI backed by DAI as being out of circulation, and the collateral backing the old DAI is backing the new DAI.  Another way of thinking of it. 100 DAI minted. Collateral pool is 90 USDC and 10 DAI at ES.  You hold the…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.065945165945166
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "8",
                    "time": "01/08/2020-01:15:12",
                    "content": "There are a few nice features with this one.  A keeper gets back roughly 1/2 the value in DAI when they liquidate requiring no other tx other than a deposit to return to making bids. A reduced pricing risk in ETH. The vault owner actually gets some return (probably not as much as in other pools) Incentivizes uniswap liqjuidity No liquidity issues (to be contrasted with any of the compound cTokens which can have significant liquidity issues given that 100% of the supply can be consumed by borrow) v2 pricing oracle is pretty robust now. No need for new oracles.  I am a yes to this one.    Depending on the LR I would not expect this to mint much DAI but anything to help incentivize DAI minting as well as putting additional liquidity in uniswap is a good idea generally. I think a general consideration for all the uniswap-DAI tokens that represent already in place Maker collateral (KNC-DAI, ZRX-DAI, BAT-DAI, USDC-DAI, etc.) should also be considered at some point because no new oracles are needed and keepers already know how to deal with these (all except USDC at this point - soon to change). There is only one negative and that is the number of tx’s required to fully cycle collateral for a keeper is up because to get the ETH and DAI one has to redeem the uniswap, and then sell the ETH where as ETH alone only requires a ETH sale. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3962320574162685
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#7",
                    "likes": "3",
                    "time": "01/08/2020-02:12:18",
                    "content": "I propose that since the volatility is approximately the square root of ETH volatility, then CR for this token should be about the square root of the CR for ETH, or about 123% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#8",
                    "likes": "1",
                    "time": "01/08/2020-04:30:00",
                    "content": "As long as the technical implementation risk can be solved perfectly, I will support it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#9",
                    "likes": "0",
                    "time": "04/08/2020-18:29:18",
                    "content": "Interestly because this is 50% non-DSR DAI, there could be a sf discount of DSR*0.5 for this collateral type. SF = Base Rate + Risk Premium - 0.5*DSR ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 0.9999999999999998
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#10",
                    "likes": "0",
                    "time": "04/08/2020-19:36:45",
                    "content": "@Jiecut, as the Uniswap liquidity can be more interesting than the DSR, I wonder if the discount makes sense. Maybe add a profit taking parameter in the Risk premium framework, not that it had anything to do with RP. If the Uniswap rate is 20%, everyone will leverage the position using the vault until a rate of let’s say 5%. If the rate is 0% (like now) or at least below 5% we should reach DC quickly (I acknowledge that the Uniswap profitability to lean towards 0 quickly as well). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.366666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#11",
                    "likes": "0",
                    "time": "04/08/2020-20:08:37",
                    "content": "@SebVentures This is just future proofing, in case we have a high rate environment with high DSR. We don’t want this vault to be only used during low rate environments. There’s also CHAI-ETH but it makes sense to just give a bit of a bypass on the DSR for DAI-ETH. [CHAI-ETH is just more annoying for end users] It should be noted if the vault user decided to use a 150% CR, for ever DAI they borrowed they’d be holding 0.75 DAI. Applying the DSR at a 50% rate is conservative. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.014285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#12",
                    "likes": "0",
                    "time": "04/08/2020-20:09:04",
                    "content": "@SebVentures Also, uniswap returns aren’t that simplistic. You still have ETH exposure and impermanent loss exposure. Also volume, which you’re calculating returns off of, can be volatile. Using UNI-V2-DAI-ETH as collateral and borrowing DAI is NOT rate arbitrage. It’s quite different. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/haydenadams",
                    "index": "#13",
                    "likes": "9",
                    "time": "07/08/2020-07:58:36",
                    "content": "I very much support this proposal  Some quick notes on oracle implementation:     befitsandpiper:  Not sure. I suspect the best way to go about this is to have oracles report the prices for the underlying assets and then get the ratio from the uniswap contract.   The best thing to do is definitely to have oracles report prices for both underlying assets. To calculate the underlying value of some amount of liquidity tokens at a given instant, you would naively do token0Amount = reserveToken0*liquidityAmount/liquidityTotalSupply token1Amount = reserveToken1*liquidityAmount/liquidityTotalSupply totalValue=token0Amount*oraclePrice0 + token1Amount*oraclePrice1  However, if the price of Uniswap is off at that moment, the value will be calculated higher than it should because liquidity tokens values are at their lowest in a fully arb’d state. So the oracle should instead calculate what reserveToken0 and reserveToken1 would in after an arbitrage trade that brings it to the price ratio reported by the Maker oracles for the underlying assets.  I can share this formula if helpful (shouldn’t be too hard to calculate on chain). Then calculate fully arbitraged value: token0Amount = arbitragedReserveToken0*liquidityAmount/liquidityTotalSupply token1Amount = arbitragedReserveToken1*liquidityAmount/liquidityTotalSupply totalValue=token0Amount*oraclePrice0 + token1Amount*oraclePrice1  This gives you a safe floor price to use when pricing liquidity tokens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.137121212121213
                },
                {
                    "author_link": "https://forum.makerdao.com/u/haydenadams",
                    "index": "#14",
                    "likes": "5",
                    "time": "07/08/2020-15:57:23",
                    "content": "We might just implement a simple smart contract that takes in a pair address, relative price, and amount of liquidity tokens and returns the underlying token balances if arbitraged to that price to save you some time  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#15",
                    "likes": "1",
                    "time": "07/08/2020-16:03:07",
                    "content": "Does this formula posted on the DAI:ETH UNI-V1 post look correct: BAL_A = SQRT(INVARIANT / PRICE_A:B) BAL_B = SQRT(INVARIANT / PRICE_B:A) SHARE_VALUE = (BAL_A * ORACLE_PRICE_A) + (BAL_B * ORACLE_PRICE_B)  In the context of UNI-V1-ETHDAI it would look like this: BAL_ETH = SQRT(INVARIANT / ETHUSD) BAL_DAI = SQRT(INVARIANT / (1 / ETHUSD))          // (USDETH === 1 / ETHUSD) SHARE_VALUE = (BAL_ETH * ETHUSD) + (BAL_DAI * 1)  // Value in USD ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/haydenadams",
                    "index": "#16",
                    "likes": "8",
                    "time": "07/08/2020-16:12:04",
                    "content": "I think that is very close but we also have to check if the protocol charge is turned on, and if so factor in the portion of the pools that will go to the feeTo address. Doesn’t add that much complexity though We just opened up an issue here to implement this:   github.com/Uniswap/uniswap-v2-periphery     \t      Create a contract that computes the value of liquidity shares after arbing to a given 'true' price            opened 04:03PM - 07 Aug 20 UTC               moodysalem               This function should consider the protocol fee, and needs to take kLast, reserve0, reserve1, and totalSupply as inputs from the pair getLiquidityValueAtPrice(address...         ",
                    "links": [
                        "https://github.com/Uniswap/uniswap-v2-periphery/issues/43",
                        "https://github.com/moodysalem"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Graeme_Barnes",
                    "index": "#17",
                    "likes": "4",
                    "time": "20/08/2020-15:54:50",
                    "content": "Hi, I made a prediction market on this to incentivize attention https://omen.eth.link/#/0xe0aabc3ab700623c5a47efcdadb61b009d46b135 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarzan",
                    "index": "#18",
                    "likes": "0",
                    "time": "26/08/2020-14:22:57",
                    "content": "hi, here is a Uniswap V2 DAI/ETH liquidity token -ETH pair on uniswap so you can trade the liquidity tokens directly for ETH. someone should make another one for uniswap v2 DAI/ETH - DAI pair to enable infinite liquidity the pool tokens for these pairs should be allowed on makerdao too as collateral creating a loop of infinite money and infinite money leverage (minus gas fees) https://uniswap.info/pair/0x6EdF66D04d5ED3357102ed8605b62752F740b598 needs more liquidity, if you have UNI-V2 for the Dai/eth pair please add liquidity on this pair ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "2",
                    "time": "26/08/2020-19:51:48",
                    "content": "Giving this the benefit of the doubt. Appreciate the spam flags, but I’m letting this one stay up in case anyone wants to discuss the utility of having ‘second level’ liquidity tokens. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#21",
                    "likes": "3",
                    "time": "27/08/2020-05:04:10",
                    "content": "    Tarzan:  here is a Uniswap V2 DAI/ETH liquidity token -ETH pair on uniswap so you can trade the liquidity tokens directly for ETH   I like arbitraging these but higher level pairs don’t help makerdao. Their volume for V1 was largely people making mistakes and losing money to arbitrageurs. You can already redeem the liquidity for dai and eth, and then the dai for eth, which is way more liquid than the higher-order exchange would supply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.330357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kojak",
                    "index": "#22",
                    "likes": "1",
                    "time": "29/09/2020-01:40:15",
                    "content": "Would not breaking the liquidity token apart mean a new process for liquidation of vaults, and therefore a change to the Maker protocol? If we are going that far, why don’t we let Maker setup the liquidity pool tokens as well as take them apart. I think a likely customer for this product would be someone who wants to borrow DAI to pair with their ETH to earn on Uniswap. Why not make it easy on them? How would it work in an emergency shutdown? Maker would have to convert all the liquidity pool tokens first before allowing any DAI holder access to their ETH claim, return collateral ETH and DAI to the vault holders, dump whatever ETH is left over into the pool that DAI holders have a claim to, and burn any remaining left over DAI. Actually, doing that seems less risky than a normal vault for everybody concerned. But, I think it is a big change. Edit: I mean otherwise during a shutdown, the DAI holder gets claim to collateral, which includes LP token, which breaks down into DAI which is a clam to collateral, etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1074915824915825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#23",
                    "likes": "1",
                    "time": "29/09/2020-02:15:32",
                    "content": "    Kojak:  Would not breaking the liquidity token apart mean a new process for liquidation of vaults   No     Kojak:  Why not make it easy on them?   Maker doesn’t have to do that.     Kojak:  How would it work in an emergency shutdown? Maker would have to convert all the liquidity pool tokens first   No it wouldn’t. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.633996212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kojak",
                    "index": "#24",
                    "likes": "4",
                    "time": "02/10/2020-04:02:00",
                    "content": "If you had a 1000 dai loan backed by $1230 ETH/DAI LP token and got liquidated, the LP token breaks down to about $615 worth of ETH and 615 dai. The dai goes to paying your debt, so you only owe 385 dai and have $615 worth of ETH as collateral, so you are like at 160%, you are still good. CR should be 120% for the LP token which equates to 150% for ETH. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.144444444444445
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/uni-v2-usdc-eth-uniswap-v2-usdc-eth-liquidity-token-collateral-application/3481",
            "title": "[UNI-V2-USDC-ETH] Uniswap V2 USDC-ETH Liquidity Token Collateral Application ",
            "index": 3481,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "uni-v2-usdc-eth"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#1",
                    "likes": "5",
                    "time": "31/07/2020-17:44:39",
                    "content": "So we’ve been recently been discussing the possibility of uniswap liquidity tokens as collateral again in this thread . The uniswap v2 pools now have much more liquidity than v1 pools, and so I think it’s time to have an updated application here. Here are more related threads: v1 collateral discussion v1 collateral application(v2 app is mostly copied from here): Reasons to include the Eth-Usdc liquidity token Personally, I think the Eth-Usdc token would make good collateral for the following reasons:  Being able to use it for collateral incentivises the uniswap-v2 ETH-Usdc pool, this is beneficial as it allows people to trade Eth-Usdc with less slippage. It is more valuable to hold when ETH is trading sideways rather than upward or downward. This makes it more likely actors will wish to use it for leverage when they expect no major change in Eth price. It is the 2nd largest liquidity pool of the uniswap liquidity pools at just over 13 million dollars worth of assets. More uniswap pool info here   Application Form 1. Who is the interested party for this collateral application? @befitsandpiper 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token Uniswap is a decentralized Constant Product Market Maker that operates on-chain. Unlike v1, there is a possibility of governance in the future that will allow upgrading of the profile. There are three user groups, the first: traders use uniswap to swap one crypto-asset for another. The second: liquidity providers who provide liquidity for traders in exchange for a small fee on every trade. The third: a hypothetical future DAO to manage and upgrade the protocol. As far as I can tell this DAO and associated governance tokens have not been released yet, and I have not been able to find much information on it. See https://uniswap.org/docs/v2/ for more details. 3. Provide a brief history of the project I’m going to leave this for someone else to provide. I’m not 100% sure how relevant it is for this particular collateral type and I suspect that most people are aware of uniswap. 4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. High level explainer of v2 vs v1: https://uniswap.org/blog/uniswap-v2/ Whitepaper: https://uniswap.org/whitepaper.pdf Docs: https://uniswap.org/docs/v2/ Code: https://github.com/Uniswap 5. Link any available audits of the project. Both procedural and smart contract focused audits. Audit report: https://uniswap.org/audit.html 6. Link to any active communities relating to the project. Discord: https://discord.com/invite/XErMcTq Blog: https://uniswap.org/blog/ 7. How is the applying collateral type currently used? To the best of my knowledge the uniswap liquidity tokens are not used by any other protocols directly. There are a number of dashboards that display the amount available, and some apps for calculating profit, but otherwise these appear to be a largely untapped resource. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? No organisation bears legal responsibility for the collateral. Dai, Eth and the uniswap tokens are all permissionless. 9. Where does exchange for the asset occur? I am not aware of any markets for the ETH-DAI uniswap liquidity tokens outside of uniswap itself. Uniswap allows redemption between liquidity tokens and the underlying assets at any time. By definition, there is always the required liquidity for this redemption. 10. (Determined by Legal Domain Team) Has the project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. No 11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. No 12. (Optional) List any possible oracle data sources for the proposed Collateral type. Not sure. I suspect the best way to go about this is to have oracles report the prices for the underlying assets and then get the ratio from the uniswap contract. Uniswap does have an oracle system discusses here: https://uniswap.org/blog/uniswap-v2/ but this probably is still too risky to query directly. 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. No parties that I know of, though I suspect that anyone willing to bid on ETH collateral would also be willing to bid on ETH-DAI liquidity tokens. ",
                    "links": [
                        "https://forum.makerdao.com/t/uni-v1-uniswap-liquidity-tokens-as-collateral/711",
                        "https://forum.makerdao.com/t/uni-v1-dai-uniswap-dai-liquidity-token-collateral-application/1966",
                        "https://uniswap.info/home",
                        "https://uniswap.org/docs/v2/",
                        "https://uniswap.org/blog/uniswap-v2/",
                        "https://uniswap.org/whitepaper.pdf",
                        "https://uniswap.org/docs/v2/",
                        "https://github.com/Uniswap",
                        "https://uniswap.org/audit.html",
                        "https://discord.com/invite/XErMcTq",
                        "https://uniswap.org/blog/",
                        "https://uniswap.org/blog/uniswap-v2/",
                        "https://forum.makerdao.com/t/weekly-mips-update-25/6092",
                        "https://forum.makerdao.com/t/maker-relay-ep-8/3712",
                        "https://forum.makerdao.com/t/weekly-polls-2020-08-17/3707",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/43",
                        "https://forum.makerdao.com/t/weekly-mips-update-24/6052",
                        "https://forum.makerdao.com/t/weekly-mips-update-23/5914",
                        "https://forum.makerdao.com/t/maker-relay-ep-24-en-espanol/5574",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-11-renvm-uniswap-wednesday-october-14-18-00-utc/4629",
                        "https://forum.makerdao.com/t/maker-relay-ep-24/5534",
                        "https://forum.makerdao.com/t/uni-v2-usdc-eth-erc20-token-smart-contract-technical-assessment/5012",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-11-wednesday-october-14-18-00-utc/4629/12",
                        "https://forum.makerdao.com/t/uniswap-lp-tokens-dai-collateral-onboarding-application/4278/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-09/3793"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Token economics",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.956362734487735
                }
            ]
        }
    ],
    "group_index": "2555"
}