{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/forum-poll-deciding-the-peg-stabilization-modules-implementation-timeline/3090",
            "title": "Forum Poll: Deciding the Peg Stabilization Modules Implementation Timeline ",
            "index": 3090,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "pegstab-module"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#1",
                    "likes": "4",
                    "time": "06/07/2020-18:30:24",
                    "content": "Over the past few days, there have been ongoing discussions on whether the Peg Stabilization Modules (PSM) should be proposed for implementation as an expedited measure or if the community should implement them after a more extended period of review. In short, a PSM is very similar to using a stablecoin like USDC as collateral for Dai, except it enforces a price of 1 USDC per Dai directly in the market. This concept ultimately makes Dai significantly more liquid and stable. The results of this poll may affect the speed at which the PSM implementation will proceed through Governance. Given that this is a ‘new’ concept (despite the reuse of code from the Sai to Dai migration bridge implementation from the Multi Collateral Dai upgrade), it is vital to see a large majority of the Maker community in favour of implementing this as an expedited measure in order to pursue that path. Accordingly, this forum poll will allow the Maker community to signal their desired way forward for the PSM implementation timeline.  Should we implement the PSM, and if so, what process should we follow?     I don’t want to see this implemented. I would like to see this implemented only using the MIPs process (longer-term implementation). I would like to see this implemented, but after a few weeks of discussion. I would like to see this implemented as soon as possible as an expedited measure.     0 voters     Notes:  The poll will be live for at least 24 hours but might be extended based on the results after the initial 24 hour period has passed. Regardless of the winning option here, the PSM will also be formalized as a MIP at a later date and proposed in the monthly governance cycle.  ",
                    "links": [
                        "https://forum.makerdao.com/t/what-so-what-now-what-psm-solution/3154",
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517",
                        "https://forum.makerdao.com/t/signal-request-should-makerdao-signal-that-it-prefers-for-comp-rewards-for-dai-suppliers-and-borrowers-to-be-disabled/3112",
                        "https://forum.makerdao.com/t/peg-stabilization-modules-a-pre-mip-discussion/3045/19",
                        "https://forum.makerdao.com/t/liquidity-mining-response-summary/3134",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-100-thursday-july-9-9am-pst-4-00-pm-utc/3023/2",
                        "https://forum.makerdao.com/t/week-6-dai-distributions-sourcecred-trial/3202",
                        "https://forum.makerdao.com/t/signal-request-consider-refinements-to-psm-or-release-asap/3165"
                    ],
                    "GPT-summary": "The post explains the concept of Peg Stabilization Modules (PSM) and proposes a poll to decide whether to implement it as an expedited measure or after a more extended period of review. The author emphasizes the importance of a large majority of the Maker community in favor of implementing this as an expedited measure. The post also mentions that regardless of the winning option, the PSM will be formalized as a MIP at a later date and proposed in the monthly governance cycle.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.32552973342447
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#2",
                    "likes": "5",
                    "time": "06/07/2020-19:12:22",
                    "content": "While I would directly benefit from this being implemented immediately I voted agaist my financial interests by voting to discuss this a bit more. I really want to know details of what would be pushed immediately.  We will be using SAI-DAI bridge code with 1:1 bidirectional facility but what will the DC be? Are there other parameters we need to be aware of? Why not put a bi-diretional fee so we end up with a real spread vs. pegging this 1:1 for free out of the gate?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.953125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#3",
                    "likes": "10",
                    "time": "06/07/2020-19:40:41",
                    "content": "I want to provide some data points that are relevant for the PSM poll. Recently in the Foundation we have been observing that integration partners in DeFi have been switching from Dai to USDC, or launching with USDC support instead of Dai, and it has in many cases been attributed directly to the peg. One example was the new gnosis prediction (omen.eth) market which had planned to use Dai, but felt forced to switch to USDC because the broken peg would mean an unacceptable user experience. There’s also examples of distribution channels (wallets, exchanges) in South America that currently are Dai exclusive that are seriously considering switching to USDC because of the peg. This is all something that has been happening slowly ever since march 12 when the peg first broke, but recently it has been definitely been happening a lot more - given that it is accelerating, I think this is a situation where every day matters, and there should be a very good reason to delay fixing the peg. It’s also important context that any decision now could easily be switched later by governance, meaning that even if the initial implementation is quite simple, it obviously doesn’t mean that Maker is somehow permanently chained to that version. Rather it could simply act as a short term solution that provides some much needed relief to the peg, only to later be replaced by a more sophisticated solution that the community has had plenty of time to discuss and design Edit: Apparently omen.eth does support Dai now, however if you look at the site in practice I think it is clear that USDC is the de facto main currency on the site, and I believe that this has been attributed to the broken peg as, as far as I know, the original plan was that it would be Dai focused, or even Dai exclusive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.453198653198653
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "2",
                    "time": "06/07/2020-20:19:17",
                    "content": "Going to provide a little more clarity around this poll and how it’s going to work and what the different options will mean in practice. Due to the nature of this change (very different to what we’ve done in the past) and the timeline and recent holidays we will require a 66% majority on the ‘expedited’ (read emergency) measure option in order to pursue that route. If we do pursue implementation as an emergency measure: Maker Governance will get a chance to vote on parameters in ranked on-chain polls. Unfortunately there will not be a large amount of time for discussion around the merits of various parameters, however we will address it on a governance and risk call before the polls close. If we do pursue implementation after a few weeks of discussion: We’ll discuss the PSM and possible parameters further over the next three weeks and within multiple governance and risk calls. On week four we will vote on the parameters during the weekly governance cycle, with the PSM being included in the executive on Friday. If we do pursue implementation only using the MIPs process: A MIP will be written and shared and will follow the rules of the MIPs process and the monthly governance cycle.  Just as an aside, I’ll be keeping track of any sybil-like behaviour on the poll. If you’ve only joined the forum recently and you vote in this poll, please leave a short reply with your reasoning so I don’t have to try to figure out if anyone is trying to manipulate the result. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.784821428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#6",
                    "likes": "7",
                    "time": "06/07/2020-20:30:50",
                    "content": "Could a proponent of PSM as an emergency measure weigh in on whether or not they view PSM as a mitigation of the Compound problem, and if so, sketch how it would help? It seems like Compound is the reason we are considering emergency measures, but it’s far from clear how PSM would address it. For that reason, I voted in favour of considering the PSM as part of the MIPs process but against implementing it as an emergency measure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#7",
                    "likes": "4",
                    "time": "06/07/2020-21:40:41",
                    "content": "    LongForWisdom:  Due to the nature of this change (very different to what we’ve done in the past) and the timeline and recent holidays we will require a 66% majority on the ‘expedited’ (read emergency) measure option in order to pursue that route .   This decision seems strange to me. Here on the forum, it’s one person one vote. In contrast, on-chain polls are one MKR one vote. Hence, this poll should be regarded as unrepresentative. It’s a straw poll. If there is really doubt in the will of MKR holders then the same poll can be placed on-chain in a rank-choice format or some other on-chain process can be followed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#8",
                    "likes": "11",
                    "time": "06/07/2020-21:54:33",
                    "content": "The PSM would help against COMP, or any other disruptions to the peg if governance is willing to increase the debt ceilings of stablecoins enough to accomodate it. It means Maker governance will always have a “fix the peg” button available at all times, as an option. It would have a big impact right now, even without further increases to debt ceilings by making sure that the approved 40 million debt ceiling for USDC would actually be used (as right now it is not used, likely due to the strict risk parameters) And even with limited stablecoin debt ceilings, the existence of a large amount of stablecoins available to buy Dai at 1 USD makes the protocol more attractive to vault users, as it provides them guaranteed liquidity for their Dai even when generating large amounts of Dai at once. This dynamic of guaranteed liquidity in fiat backed stablecoins at the peg is also crucial in cutting through the chicken and egg problem that exists with onboarding real world assets as collateral to the system, as real world loan originators need a large amount of liquidity before it becomes worth it to spend the enormous amount of effort that it would require to learn how to engage with the Maker protocol. The PSM helps provide this guaranteed liquidity directly, even if governance is unwilling to increase the stablecoin debt ceilings beyond the current 40 million. So it will in all circumstances be a big step forward towards solving the long term issues with the peg. However, as a separate argument I do believe that it is absolutely the best option for maker governance to begin much larger scale onboarding of stablecoins as collateral (this works even better with the PSM due to the multiplier effects noted above, but even without the PSM it is better than doing nothing). The alternative is to let the peg fail, or work towards implementing negative rates. To continue to let the peg fail is suicidal, as it is eroding the organic growth that the project has built up for years, and this erosion is happening at an accelerating pace as we now approach month 4 of a broken peg. I know the numbers look good right now on daistats, but what we’re seeing is that organic users are being replaced by artificial demand driven by compound. Yet the dogma is that maker governance should just continue to let the peg fail, on the basis of an emotional argument that “centralized stablecoins are of the devil, and ETH is pure”, and keeping maker “pure” is more important than the delivering on the one promise that Maker governance has made to its userbase, which is to keep Dai stable at 1 USD. The systemic reliance that ETH and BTC has on Tether and Binance is conveniently overlooked every single time someone argues against USDC as collateral, but the fact is that USDC, PAX and other regulated and legit stablecoins actually are among the only options for hedging the indirect exposure that Maker has to Tether and Binance right now. IMO someone who is not willing to take action to fix the peg through higher debt ceilings and different risk parameters, should then argue for implementing negative rates (which I would completely respect, it’s just important to be realistic about how big of a challenge that actually is). Just letting the peg fail is a betrayal of the users of the system, especially when it is being done based on a purist argument that ignores the role of Tether in crypto markets and the indirect exposure Maker has. Edit: something that add that obviously needs to be clearly spelled out, is that of course no one would want to see a large concentration of stablecoins for a long time in the portfolio, just like it wouldn’t be good to have a lot of any other asset. The end goal in all cases is a diversified collateral portfolio. But the whole point is that choosing to fix the peg in the short term through a lot of stablecoins, enables the ecosystem to then move forward to a state where a lot of e.g. real world assets can be onboarded to proper diversify the collateral portfolio. Choosing to keep the peg broken, means choosing to wither and die by alienating all the organic users of the system who aren’t in on the purity-but-lets-ignore-tether religion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.331654456654457
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "5",
                    "time": "06/07/2020-22:00:02",
                    "content": "I don’t think it’s about doubting the will of the MKR Holders in this case, it’s more that moving this quickly on something new, especially proposed during a major holiday is not something we should be doing unless there is a very good reason for it. If it was something we’d done before, then sure, a simple majority to make it an emergency action seems reasonable. If it had been proposed on a regular Monday rather than on the 4th of July weekend, sure, maybe it would be a simple majority. As it is, it’s new and it was badly timed. If 2/3rds of people want to see happen as an emergency action anyway, then sure. But we should not normalize this short of a timescale around new proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8986642743221696
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#10",
                    "likes": "11",
                    "time": "06/07/2020-22:09:39",
                    "content": "Chris Mooney and I are working on a critical response, because we feel it deserves an opposing perspective that it currently lacks. However, we are still digesting the information on this proposal and the comments and we are feeling rushed to formulate a reasonable response under this time frame. I’d like to request that we extend the time frame on this signal request to give people enough time to adequately respond. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.533333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "1",
                    "time": "06/07/2020-22:24:26",
                    "content": "This is a reasonable request, but I think it would be difficult to justify delaying action if after 24 hours more than 66% of voters want to continue under an emergency process. I will point out that if we don’t do this as an emergency process now, that doesn’t mean that we can’t follow it as an emergency process at some point in the future if the peg worsens, or if @Risk-Core-Unit decides to support it as an emergency measure (Cyrus is currently undecided, and also wants more time to consider the impact before weighing in.) Given that that is the case, I would like to recommend that people avoid voting precipitously to follow this as an emergency process now before hearing an opposing perspective. Apologies @brianmcmichael and @cmooney, I would recommend that you either aim to get a short summary done in the next few hours, or attempt to convince people to wait for your piece before voting. As always, even if this does proceed as an emergency measure, it will need to pass an on-chain executive, and unless there is a sudden disaster, we won’t allow that executive to go up before Friday. There will be time for MKR Holders to read your piece before voting on-chain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "4",
                    "time": "06/07/2020-22:33:55",
                    "content": "One additional point. If ‘emergency / expedited’ response reaches a majority, but not 66%, then we’ll go with the option of ‘taking a few weeks.’ I think this is the fairest compromise option in that situation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#13",
                    "likes": "1",
                    "time": "06/07/2020-23:23:22",
                    "content": "For voters that would like to see immediate action, I would like to point out that you should only vote for the “as soon as possible as an expedited measure” option and NO OTHER OPTIONS. If you split your vote among other options, even if you are comfortable with these other courses of action, then you drop the percentage in favor of the expedited option. Oops, @LongForWisdom says that I’m wrong (below). Nevermind. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.951388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "2",
                    "time": "06/07/2020-23:28:11",
                    "content": "No, you don’t need to do this. The percentages for each option are calculated as ‘votes for option’ / ‘total voters’ (not total votes.) 23/35 = ~65% 23/45 = 51% The only thing you do when voting for multiple options is drop the percentage for options that you aren’t voting for, and increase it for options you are voting for. Which is what is supposed to happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#15",
                    "likes": "8",
                    "time": "06/07/2020-23:40:55",
                    "content": "I think the PSM has the potential to smooth peg fluctuations and hold us closer to the peg, on average, and given the cursory investigation I’ve had time to do today seems to be implementable safely. However, this feels very rushed and I am concerned about the possibility of overlooking subtle bugs, especially involving multi-contract interactions. This will also increase the complexity of governing the system (particularly PSM-DSR interactions), and it seems prudent to explore those issues as far as possible before taking on-chain action. Thus I am personally in favor of a slower, MIPs-based process, unless a strong argument can be presented that a swift implementation of a PSM is an existential necessity for the Maker protocol. In the meantime, why not consider a significant ETH debt ceiling increase to combat the high peg deviation? Is something going on with COMP farming that makes that a bad idea? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.391145833333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AXA",
                    "index": "#16",
                    "likes": "2",
                    "time": "07/07/2020-00:30:21",
                    "content": "Peg is the most critical and basic feature of Dai,  comparing with other stable coins we have seen unhappy development on both mint & adoption due to the unstable rate of Dai . Some stable coins focus Dex such as Curve has been showing the strong needs for a bridge of stable coins. Via 1:1 with USDC , and maybe tusd,pax in future, a good link to real world will be established. So we should implement the PSM ASAP. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.446969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#17",
                    "likes": "5",
                    "time": "07/07/2020-00:35:29",
                    "content": "I’m a bit concerned that the full spectrum of views aren’t expressible in this poll. I suspect many people are in the “few weeks of discussion” camp, but with an open mind on whether or not it should be implemented. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#18",
                    "likes": "6",
                    "time": "07/07/2020-00:48:38",
                    "content": "I agree with this sentiment. I don’t understand why the MKR holders are being deprived of immediate action if that’s (potentially) what the majority of MKR wants? A forum poll doesn’t seem like it’s targeting the right group of decision makers for something this important/significant. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.732142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#19",
                    "likes": "3",
                    "time": "07/07/2020-03:20:43",
                    "content": "A brief inquiry on process (and borne from my ignorance): is the 2/3rd’s majority (66%) required for passing an “emergency/expedited” response in Forum Signal Requests generally? Or is that 66% cutoff present only for the current situation? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#20",
                    "likes": "2",
                    "time": "07/07/2020-10:39:47",
                    "content": "I agree that fixing the peg should be the first priority. I don’t think DAI should be a wrapper for other stablecoins - we must find our own way to be stable and that means developing new features (negative rate support, undercollateralization etc.). PSM might buy us some time so let’s use it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5613636363636365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#21",
                    "likes": "1",
                    "time": "07/07/2020-11:19:10",
                    "content": "    Spidomo:  I’m a bit concerned that the full spectrum of views aren’t expressible in this poll.   This is a fair point, and something I probably should have identified earlier. At this stage though, it would be difficult to modify the options to a more expressive set given the number of people who have already voted. I think it’s best to think of this poll as largely about the timeline for possible implementation rather than the fact of implementation itself. Any implementation will have to be confirmed via on-chain polls anyway, that would be the optimal time to vote yay/nay.     g_dip:  I agree with this sentiment. I don’t understand why the MKR holders are being deprived of immediate action if that’s (potentially) what the majority of MKR wants? A forum poll doesn’t seem like it’s targeting the right group of decision makers for something this important/significant.   It’s very difficult to make assumptions about what the majority of MKR wants. If we’d gone straight on-chain you could equally well have asked why MKR Holders being forced into immediate action outside of the established governance processes. There needs to be some threshold for considering whether an action can take place as an emergency response. As I stated previously, those thresholds are a majority (or in this case a 2/3rds majority) in favour taking action, or a recommendation from the Risk Team that emergency action is warranted.     Tosh9.0:  is the 2/3rd’s majority (66%) required for passing an “emergency/expedited” response in Forum Signal Requests generally? Or is that 66% cutoff present only for the current situation?   Only for the current situation. This is on the basis that the timing and the magnitude of the change compared with doing something we’ve done before (like a debt ceiling raise) during a working week (as opposed to a holiday weekend in the U.S.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.610215053763441
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#22",
                    "likes": "20",
                    "time": "07/07/2020-11:30:42",
                    "content": "Here are what I see to be the main issues with PSM (relative to the status quo) which should be explored in further discussion before it is implemented:   It is not at all clear that deploying a PSM will address the ongoing issue with Compound sucking up DAI due to COMP rewards and idiosyncratically narrow supply-borrow spread. In fact, a likely outcome is that the PSM ceiling is immediately maxed out as farmers swap USDC to DAI to take advantage of the better COMP-adjusted yields on the DAI market, further extending DAI’s lead as a COMP farming Schelling point as its total borrow increases. Unlike current COMP farmers who are borrowing DAI from CDPs, MakerDAO will earn no ongoing yield from those users to compensate for the stablecoin risk that it is taking on. Once we’ve hit the ceiling, we might be back in the situation we started with, except with extra USDC exposure, and more DAI in Compound. Instead of solving the Compound issue, there is a risk that the PSM only deepens DAI’s exposure to both COMP yield and to USDC.   In general, unlike the status quo with stablecoin CDPs, the PSM does not allow the system to earn a risk premium to compensate for the risk that it takes on exposure to collateral. This actually violates one of the core assumptions of MakerDAO, which is that any risk that the system takes should be compensated with a reward, with the reward “funding” the risk in the long run by creating a surplus buffer and/or supporting the value of MKR in the event that the system needs to be recapitalised. Changing the economics of MakerDAO to make it possible for the majority of the risk taken by the system (in the event that USDC exposure balloons) to be uncompensated by a risk premium is a very significant departure from the current economic model, and IMO requires extensive discussion.   Unlike the status quo with stablecoin CDPs, allowing the system to mint DAI 1:1 against stablecoins creates an immediate mark-to-market accounting deficit, meaning that the PSM’s stablecoin exposure might be very difficult or impossible to unwind (without Emergency Shutdown). In particular, when the PSM mints 100 DAI and puts 100 USDC on the system’s balance sheet, if the market price of DAI at that time is $1.01, the system has asccrued a $1 loss/deficit on a mark-to-market basis. In the event of ES, the system is still solvent because the DAI debt will be marked not to market, but to the target price of $1.00. However, without ES, there is no way for the system to unwind the USDC position without realising a loss. Note that this markedly different from stablecoin CDPs, where the system is not exposed to a loss unless the market price of DAI exceeds the target price by the liquidation ratio, and only the CDP owner’s mark-to-market equity is affected by the market price of DAI.   I think all 3 of these are such serious issues/discussion points that further discussion is required, at the very least, before proceeding with the implementation of the PSM proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.015563725490196
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#23",
                    "likes": "1",
                    "time": "07/07/2020-11:31:47",
                    "content": "Given that the poll is attracting strong opinions I’ll just clarify the closing time. The poll will close at 07/07/20 18:30 UTC which should be exactly 24 hours from the start time of the poll (please correct me if I’ve screwed up timezones here.) In this case I think extending the poll beyond 24 hours would be a mistake given that it is contentious. Once it’s closed we’ll check the results and consider options. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.972222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#24",
                    "likes": "3",
                    "time": "07/07/2020-12:12:48",
                    "content": "I am still unclear whether this will be done 1:1 or whether it will actually have a fee spread. Completely agree with (1) the PSM will not address comp mining IMO but probably enable it further. (2) and (3) are the reasons why to have these with a price spread and DC.  I agree even with a spread fees are one time and not based on risk. Brought up above is a  With the PSM there may be DAI that exists not paying the SF that can earn the DSR which may cause surplus to be drained if DSR=SF and more DAI is earning DSR than paying SF.   There are more cases with excess PSM DAI not paying the SF where the surplus could be drained due to DSR fees being greater than SF + PSM (if there is a fee) revenues generated.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.921875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/equivrel",
                    "index": "#25",
                    "likes": "3",
                    "time": "07/07/2020-12:19:48",
                    "content": "Certainly the PSM must apply a spread, however problems (2) and (3) still apply in the presence of a spread. (2) because the spread is a small, one-time cash flow which does not depend on whether or not the trade is increasing or decreasing the system’s stablecoin exposure, or on how long the system is exposed to the stablecoin (an interest rate charged over time is the normal way to be compensated for risk taken over time). (3) because e.g. if the system sells 1 DAI for $1.01 USDC when the market price of DAI is $1.02, that is still a $0.01 deficit accrued. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.080357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#26",
                    "likes": "3",
                    "time": "07/07/2020-12:26:47",
                    "content": "    MakerMan:  With the PSM there may be DAI that exists not paying the SF that can earn the DSR which may cause surplus to be drained if DSR=SF and more DAI is earning DSR than paying SF. There are more cases with excess PSM DAI not paying the SF where the surplus could be drained due to DSR fees being greater than SF + PSM (if there is a fee) revenues generated.   PSM only makes sense when DSR is zero. The reason that we might want DSR>0 is if DAI/USD was less than 1. If DAI/USD<1 then it would be profitable to drain the PSM. You buy DAI cheap, sell it to the PSM, and get 1 USDC per 0.99 DAI. The cheaper DAI gets, the more the incentive to drain the PSM. Once the PSM is empty then the DSR can be safely raised. It might make sense to gate the PSM to the DSR==0. That is, add code to ensure that the PSM will not mint DAI unless the DSR is set to zero. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.254166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#27",
                    "likes": "3",
                    "time": "07/07/2020-12:28:32",
                    "content": "While (3) is a loss the only difference between this and doing this via a vault is the risk of liquidation and lack of LR mechanics at current 120% LR> Which may beg a question.   If we set a spread on this why not use the same vault mechanics to support it.   Meaning use PSM to open a USDC vault and pay the SF fee with the spread profits until it comes under liquidation or closes naturally.   My bet is that these would liquidate and again a reason to turn liquidations on and use a system based USDC facility as normal to manage the PSM exposure. Then we satisfy your 2 and 3 directly.   The issue will be that the PSM will need a low LR USDC vault since it is giving up liquidity directly almost 1:1 and even at 101LR and with spread fee of 1% would immediately put these kinds of vaults at liquidation risk.  At least if we were to try to apply vault mechanics to this PSM DAI creation.  This idea perhaps illustrates directly the issues with the PSM from a risk, fee management standpoint. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.113636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#28",
                    "likes": "1",
                    "time": "07/07/2020-12:49:49",
                    "content": "    psychonaut:  PSM only makes sense when DSR is zero   Pray tell what then is the mechanic to clear these when the PSM is not zero but no one is using the facility at .99 or whatever the low mark is? Given all of the above I think this discussion is warranted and productive since it is teasing out the various issues with a PSM making me think the PSM really should be a liquidity provider of last resort with a pretty wide spread reflected by a SF of some kind and a DC relative to the USDC DC and/or total.DAI outstanding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.645833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#29",
                    "likes": "3",
                    "time": "07/07/2020-12:55:51",
                    "content": "    MakerMan:  Pray tell what then is the mechanic to clear these when the PSM is not zero but no one is using the facility at .99 or whatever the low mark is?   Uh, it’s practically a risk free trade to empty the PSM when DAI < 1. You buy 1 DAI for .99 USDC, sell to PSM to obtain 1 USDC, and repeat until the PSM is empty. If you don’t want to do this trade then I will. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#30",
                    "likes": "2",
                    "time": "07/07/2020-13:11:06",
                    "content": "    psychonaut:  Uh, it’s practically a risk free trade to empty the PSM when DAI < 1.   That might be true but one still has to clear that trade otherwise if say the spread was 1.01 and .99 we have to see PEG < .99 before the USDC will clear from the PSM and will we still be at a DSR of 0?  We don’t want to manually have to clear these facilities and who is going to sell 1 DAI for .99 USDC to clear it if the price is at .995 or .992? Granted we can just let this sit there and not raise a SF till the PSM USDC clears but do we really want to do that?  It was why I wanted assymetric pricing on the facility so we would quickly mop up the USDC purchased at say 1.01 or 1.02 at say .997 or .998.   But then again perhaps not. I think what people are forgetting in this PSM talk is that our current situation is being driven by comp farming and not any NORMAL market situation.   As @equivrel points out above and I agree with him.  THe PSM will not fix this situation.   Look at what is going on here.  PEG is 1.015+/-.005 and sustained.  USDC rate of 4% looks to be about correct so USDC facility isn’t pegged, and ETH borrow rates are now in the 3% range on compound.   This is sustained demand that we can’t price out with higher SF’s across the spectrum of assets (ETH-A say) without driving the PEG up, and even if we somehow drove rates down wouldn’t the cheap DAI just be soaked up entirely even if we could magically mint another 200-500M DAI to try to saturate the market demand to drive the PEG down. So I think it is important to distinguish what the PSM can and will address how as distinguished from what it probably can’t (i.e. comp farming) clearly. Does anyone have a cogent argument against the idea that the PSM simply is not going to deal with the comp problem as well as the PEG unless we are literally talking about flooding the market with DAI and hope the PEG comes in line and that we somehow saturate comp farmers with so much DAI it becomes less profitable for them to use it?   I honestly am skeptical we could saturate the comp farming demand enough to drive the PEG down with anything short of .25-.5B DAI here and that may not even be enough.  Then we have to somehow magically sop this up without also seeing the PEG drop much below 1 when compound changes things again. One other thing I’d like to see @rune answer is how well the PEG needs to be satisfied to bring market players back.  I do not ever see DAI having a PEG that is as good as a centrally managed one by any definition unless the system itself takes on higher risk by putting the PEG first and risk second in terms of priorities for the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.621710526315789
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#31",
                    "likes": "3",
                    "time": "07/07/2020-13:11:22",
                    "content": "    psychonaut:  PSM only makes sense when DSR is zero   I think a balance exists where where DSR > 0, total SF > 0, and peg ~1.  However, implementing PSM will make it difficult for the base rate to be > 0.  (Which I think could be a good thing.  It allows for super cheap leveraged long ETH).  So yeah, DSR > 0 will be more finicky with the PSM in place ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.324074074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xEffAlt",
                    "index": "#32",
                    "likes": "2",
                    "time": "07/07/2020-13:40:35",
                    "content": "I like the proposal but I think we need a few weeks of discussion and thinking for a change this impactful, even though I’m currently short DAI using a USDC vault so I want the peg to be 1:1 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#33",
                    "likes": "3",
                    "time": "07/07/2020-13:42:24",
                    "content": "I don’t understand this logic. If the MKR holders don’t want to be bothered with a vote, they won’t vote? If we absolutely need a community straw poll threshold, should’t it be what % of the community participates and a simple majority? To take a super-majority without a quorum could mean that 12 people voting push an emergency measure to the MKR holders. In my ideal world, I’d set the quorum at whatever the current weekly active users are (50 as of 7/7/20) and then look for a simple majority. So right now, with this having nearly 100 votes (2x our weekly active forum users) and a majority of them wanting it to go to an on-chain poll (not an executive vote), I don’t see why the MKR holders would be prevented from voting on this in the short term. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4120670995671
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#34",
                    "likes": "3",
                    "time": "07/07/2020-13:53:21",
                    "content": "I’ve already justified the decision to enforce a 2/3rds majority in this case based on two points:  The timing of the PSM proposal coming on the 4th of July weekend. The fact that the PSM is fundamentally different to what we’ve done before.  If there are any large MKR Holders that want to vote on the issue on-chain they are perfectly able to make themselves known here in this thread. If they want to provably communicate that desire, there are tools available to encode messages into ethereum transactions. If either of those things happen, that could be grounds to reconsider.     g_dip:  If the MKR holders don’t want to be bothered with a vote, they won’t vote?   Or they won’t know that the vote is happening and something will pass with a small amount of MKR, because many MKR Holders weren’t aware that a vote was taking place. This is a risk any time we do something outside of the regular governance cycle. The risk is limited when we are doing something we’ve done before, and the risk is reduced if this happens during a normal working week. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.87202380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#35",
                    "likes": "3",
                    "time": "07/07/2020-14:10:58",
                    "content": "Do I understand correctly that the plan we are trying for here is as follows: When Dai is over Peg price reduce interest rates down and then create and sell Dai at Peg price plus some fee for a system profit using USDC or whatever means makes sense. When Dai is below Peg price buy Dai back for the USDC we sold until it runs out.  If price is still below Peg raise rates and implement DSR if needed. If Dai price is between these prices which is the goal pretty much just sit there and do little to nothing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.106944444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Daa",
                    "index": "#36",
                    "likes": "2",
                    "time": "07/07/2020-14:12:29",
                    "content": "Hello, I’m interested in this topic from Japan. I can agree with this proposal but it better to consider with these question.  How many ratio do you plan to have Centralized stable coin as collateral? The priority of adding “Centralized stable coin” as collateral. I could find it in MIP8 but I couldn’t find  process of how each teams turn on greenlight for Smart contract, Legal, Oracle, Risk.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.664285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#37",
                    "likes": "6",
                    "time": "07/07/2020-15:52:31",
                    "content": "    FourthStreet:  When Dai is over Peg price reduce interest rates down and then create and sell Dai at Peg price plus some fee for a system profit using USDC or whatever means makes sense. When Dai is below Peg price buy Dai back for the USDC we sold until it runs out. If price is still below Peg raise rates and implement DSR if needed. If Dai price is between these prices which is the goal pretty much just sit there and do little to nothing.   I don’t think this is clear yet. One of the problems we have is that, aside from the innate incentives in the protocol, there’s not a way to quickly helicopter in new Dai supply to satisfy market demand. This is really only a problem when Dai is above the peg, as we have several ways to sop up Dai supply during periods of less demand (namely, a price below peg which encourages vaultholders to repay, higher stability fees that discourage long-term leveraging, and the Dai Savings Rate which encourages lockup.) Since the only real “problem” Dai has is that there’s too much demand for the system to scale quickly enough, I’d argue that the low-end of the band should be set directly at the peg, and the upper band, the buy price, should be some amount higher than that, and at a level that does not discourage market making. This would allow the PSM to fill with USDC when it’s needed, but clear out when we’re back at peg, and might even be a valuable metric for considering whether we are “at peg” or not. In this scenario, the PSM is only utilized in times of Dai demand, and the proven facilities of stability fees and the DSR can be reengaged to manage the peg on the other side of $1. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.309369739057239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#38",
                    "likes": "7",
                    "time": "07/07/2020-16:40:56",
                    "content": "    brianmcmichael:  ’d argue that the low-end of the band should be set directly at the peg, and the upper band, the buy price, should be some   I like this idea. We have more than enough tools to deal with Dai being below the peg but are lacking the ability to reinforce the peg when Dai is above the peg and we are already at 0% rates. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#39",
                    "likes": "1",
                    "time": "07/07/2020-16:41:07",
                    "content": "What do we do if there is always Dai demand? Keep taking more and more USDC exposure on>? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#40",
                    "likes": "1",
                    "time": "07/07/2020-16:53:51",
                    "content": "@rojosnow @rkapurbh @alfie @two-cheers @Deleuze.G Apologies to highlight you, but you guys all have very new accounts. If you could make a brief comment about why you’re voting the way you are that would go a long way to convince me that you’re all real people. Additionally we have @Jenn @Matthew_Cooper  from Maker that have only just made accounts on the forum (presumably to vote in this poll). I’m glad you guys are taking part in the governance process for the first time. Can you share any thoughts as to why you’re voting the way you are? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.76948051948052
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#41",
                    "likes": "0",
                    "time": "07/07/2020-17:00:07",
                    "content": "Reminder: The PSM Forum Poll will be closing in 1.5 hours. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#42",
                    "likes": "4",
                    "time": "07/07/2020-17:07:13",
                    "content": "I have a lot of concern over this Peg Stabilization Module.  We are headed towards 1 Dai = 1 USDC and if that is the case why use Dai at all and not just base the whole system on USDC.  Something feels very wrong about getting so tied up with USDC.  We never intended on having them connected to the system at all when we started. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 2.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#43",
                    "likes": "14",
                    "time": "07/07/2020-18:48:14",
                    "content": "This poll has now finished. From the results it is clear that most voters are in favour of implementing the PSM in some form over some timescale. Looking long-term, this looks very promising for the implementation of the PSM. That said, in accordance with my statements prior to poll completion, we’ll move forward on this issue in the following way. I think this path is a fair compromise given the circumstances surrounding this issue. Because the expedited / emergency option did not reach 2/3rds consensus, we will not be implementing the PSM in the executive on Friday. Instead, we will follow the next fastest option of implementation in a few weeks. In practice, this means that we will vote on the PSM in the last week of July*, having discussed it during the month. There will be a chance to discuss the PSM in every governance and risk meeting between now and the end of July, starting this Thursday. I kept track of potential sybil accounts voting in this poll. I think it is very unlikely that sybil-like behaviour affected the result, if indeed any was present at all. I don’t think that this remote possibility justifies invalidating the outcome. Thank you all for voting, I’m looking forward to hearing from many of you in the governance and risk meetings over the next few weeks. * It is always possible that a more serious emergency may require implementation before the end of July. That said, the bar for this is going to be quite high given that this has failed to pass as an emergency measure once already. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.167424242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rojosnow",
                    "index": "#44",
                    "likes": "3",
                    "time": "07/07/2020-19:00:17",
                    "content": "I’m with Maker but registered under my personal account. Sorry for the confusion. Nik or Charles can vouch for me, Robert Jordan.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cnoyes",
                    "index": "#45",
                    "likes": "22",
                    "time": "07/07/2020-22:20:05",
                    "content": "Hi! For those of you who I haven’t had the opportunity to interact with yet, my name is Charlie. I work at Paradigm and spend a lot of time on our MKR position. On the PSM & Timeline We are opposed to the implementation of this PSM proposal on both substantive and procedural grounds. We share @equivrel’s concerns that:  it will likely exacerbate the dynamics of COMP-driven exogenous demand for DAI (i.e. will not return it to the peg), it will not provide ratable compensation for those risks, and it could be difficult – if not impossible – to unwind the facility without causing extreme dislocations in the market for DAI (e.g. an emergency shutdown).  Given those points and the generally polarizing nature of the issue we would oppose an implementation of this PSM proposal. While any path forward is likely to be contentious, it is especially critical that the community feels it has had time to fully consider the menu of options and subject each to a high standard of scrutiny. Of course, governance is inherently messy so we hope to avoid overly prescriptive suggestions. The only procedural point we feel strongly about is that a public MKR Poll is appropriate before any concrete proposal(s) are put to executive vote. On the broader issue of the peg @cyrus, @equivrel, and others suggested that some context on how we think about the broader issue (DAI>$1) may be helpful to understanding our perspective on the PSM. It’s our view that expansion of the acceptable collateral supply in response to excess demand at the zero-rate barrier is, inherently, a decision that MKR holders shoulder the risk rather than passing the cost on to DAI holders. We are not dogmatically opposed to relaxing collateral requirements in order to relieve pressure on the peg; in Maker’s short history it has frequently been the most practical option. But like any tool there are limits to its safe application – returns on supply expansions diminish quickly if you stop moving out on the risk curve, and Maker can only take on so much before those risks accumulate into a credible threat to the system’s long-term sustainability. The potentially fundamental nature of @equivrel’s concerns may be an indication that we are already up against that barrier and that it is time to more seriously explore alternative mechanisms (e.g. negative real rates) as necessary for steady-state maintenance of the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.455833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#46",
                    "likes": "0",
                    "time": "08/07/2020-06:07:40",
                    "content": "for 1- I think this will become Compound problem… because a high percentage of the rewards will go to DAI farmers which will force them to change the incentives. 2- I agree but this problem could be solved if we start offering to lend the USDC locked in PSM we can create a lending platform (a competitor to Compound and aave) and set the lending value for each centralized stable coin to 1$ that means if usdc lose 50% of its value for any reason, the borrowers will have to pay back 2 times the original usdc amount this will offer protection against most centralized stable coins risks and offer a new revenue stream for the protocol not to mention the spread fee ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.171363636363636
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#47",
                    "likes": "2",
                    "time": "08/07/2020-11:08:06",
                    "content": "    mmoossttaaffaa:  I agree but this problem could be solved if we start offering to lend the USDC locked in PSM   Are you thinking of flash loans or long term loans? I don’t see a problem with flash loans, but long term loans would constrain our ability to drain the PSM when DAI<1. That is, we would have to wait for the loans to mature. Maybe loans as long as a day would not create problems. I just worry that it’s a lot of complex smart contract development to enable loans that might be better invested in a more core protocol feature. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.540178571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#48",
                    "likes": "1",
                    "time": "08/07/2020-12:49:57",
                    "content": "with long term loans if the PSM get drained the lending fees will sky rocket the borrowers will either pay back their debt or suffer from very high fees (that will go to the protocol) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.263333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#49",
                    "likes": "5",
                    "time": "08/07/2020-13:13:17",
                    "content": "    cnoyes:  it will likely exacerbate the dynamics of COMP-driven exogenous demand for DAI (i.e. will not return it to the peg),   I’m curious about why you believe this to be the case. As far as I can see for the Compound dynamic there are two forces at play:  Increased overall Dai supply which will decrease the APY as a fixed supply of COMP are distributed to a larger collateral pool. Increased relative Dai borrow amount which will increase the portion of the COMP rewards going to the Dai collateral and thus increasing APY.  These forces operate in opposite directions, but the second force falls off more rapidly. To see why this is let’s double the Dai supply in Compound and see how that effects the two forces:  APY will reduce by 50% due to the first force. Twice as many tokens taking the Dai portion of the COMP rewards. Currently Dai is taking ~78% of the 2880 COMP tokens. This will increase to 87% by doubling the Dai supply. An increase in APY of ~12%.  The decrease of 50% will more than counter the increase of 12% which means that increasing the Dai supply to Compound is a good move no matter what the source of that Dai. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.673611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#50",
                    "likes": "9",
                    "time": "08/07/2020-16:29:12",
                    "content": "    cnoyes:  negative real rates   Thanks for being brave enough to actually suggest alternative solutions to fixing the peg beyond expanding the collateral portfolio with stablecoins, or signaling a desire to simply abandon the peg. But, while it makes sense to view negative rates as an alternative to onboarding lots of stablecoins, I think it’s a mistake to see negative rates as an alternative to activating PSMs. The PSM mechanism doesn’t inherently mean onboarding lots of stablecoins, in fact there is synergy between PSMs and negative rates as well: Having negative rates means that PSMs can provide significant liquidity and peg stability, even with low debt ceilings at all rates, positive and negative, similar to how they would function at a positive DSR/Base rate. PSMs also, in all situations, mean that the Maker Protocol can earn income from trading non-Dai stablecoins against each other. That being said I personally think most people that are right now considering negative rates have not yet considered the ecosystem-wide ramifications of implementing them, as the disruption it would cause to every single app that supports Dai would be immense. However it’s important that the community begins serious discussion about negative rates sooner rather than later, as it will help move past the current situation where governance appears content with maintaining the status quo of the system just languishing with a broken peg for months. We may very soon see a showdown of the only two realistic options available to the community: Onboarding large amounts of stablecoins, or implementing negative rates. If forced to choose, which one will the community pick? However, this question actually doesn’t have anything to do with whether or not PSMs should be implemented - they are an equally useful mechanism for creating a more stable and liquid peg in both scenarios. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.022261653075607
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#51",
                    "likes": "0",
                    "time": "08/07/2020-16:58:20",
                    "content": "    brianmcmichael:  Chris Mooney and I are working on a critical response, because we feel it deserves an opposing perspective that it currently lacks. However, we are still digesting the information on this proposal and the comments and we are feeling rushed to formulate a reasonable response under this time frame. I’d like to request that we extend the time frame on this signal request to give people enough time to adequately respond.   @brianmcmichael and @cmooney very much would like to see this response.     g_dip:  I agree with this sentiment. I don’t understand why the MKR holders are being deprived of immediate action if that’s (potentially) what the majority of MKR wants? A forum poll doesn’t seem like it’s targeting the right group of decision makers for something this important/significant.   I don’t think MKR holders are being denied anything since anyone can put up an on-chain poll as well as post a new executive.     LongForWisdom:  Due to the nature of this change (very different to what we’ve done in the past) and the timeline and recent holidays we will require a 66% majority on the ‘expedited’ (read emergency) measure option in order to pursue that route .   I am really mixed on this.   I don’t think the world runs around US holidays.    Perhaps a general change regarding what is needed poll wise to proceed on an ‘emergency’ measure is what is required.   While I don’t know how to do this my understanding is that anyone can put up an on-chain poll so if even one MKR holder with ability to do this could put up such a poll is there anything stopping them?   Or is this kind of a technical issue in that other things need to change in the governance portal as well when putting up an on-chain poll.?   Really these last questions are more of a governance curiosity than anything else. As far as I can tell we have not even polled on whether the PEG is an emergency or not so I am uncertain regarding status on the 66% needed to treat this as an emergency action.   I think most are concerned about the PEG but if we are going to classify this as an emergency then once that is determined lets line up our tools to manage this.    But be prepared in the sense that if the PEG is out of whack because of COMP - I am completely with @equivrel that unless we are prepared to flood the market with perhaps 200-500M DAI  and subsequently soak it up when compound changes - yet again - yanking the markets change a piddly 20-40M probably won’t do enough.     rune:  It would have a big impact right now, even without further increases to debt ceilings by making sure that the approved 40 million debt ceiling for USDC would actually be used (as right now it is not used, likely due to the strict risk parameters) And even with limited stablecoin debt ceilings, the existence of a large amount of stablecoins available to buy Dai at 1 USD makes the protocol more attractive to vault users, as it provides them guaranteed liquidity for their Dai even when generating large amounts of Dai at once.   I think this is telling us 4% is too high of a rate.  I saw ETH facility going up on compound and wondered if people were just borrowing ETH to cycle into Maker at the 0%SF. I literally don’t think anyone knows how much DAI would be required to bring the PEG back into line here nor what price in USDC to sell it at.   My rough guess is that somewhere between 100-200M priced in the 1.005 to 1.01 range would be enough to pull the PEG down under 1.001.   I have no clue what it would take to bring it to 1 at this point.   Which is why I have been advocating different PSM facilities with different fee/pricing spreads and different DC’s - we need to gauge what the markets are trying to tell us on this vs. trying to dictate to markets what we want them to do with a flood of abnormally cheap liquidity that will only be paying whatever onetime facility fee to access.   We literally could end up with no-one using the vaults for DAI and only generating fees from one-time swaps on the DAI-stablecoin swap facility. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6467918533708
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#52",
                    "likes": "1",
                    "time": "08/07/2020-17:03:44",
                    "content": "Charlie looks like your Team is onboarding Georgios Konstantopoulos. Would be cool to have Georgi come on here and see what he thinks. Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#53",
                    "likes": "1",
                    "time": "08/07/2020-17:06:25",
                    "content": "    rune:  But, while it makes sense to view negative rates as an alternative to onboarding lots of stablecoins, I think it’s a mistake to see negative rates as an alternative to activating PSMs.   More tools for monetary policy are good.   I think we should have a negative interest rate discussion. I know i posted somewhere on the idea of paying vault holders to open vaults since this would encourage taking on debt and in effect the DAI payout to vaults basically could run against future accrued interest (it doesn’t have to be paid just pledged against future interest as a kind of DAI interest redemption token given to vault holders and hence traded as a interest reducer).   Now if holding some of these caused the furture SF to come down for a vault as well - that would be very interesting. I really would like to see some proposal regarding a implementation of negative rates though as the above was the only thing I could come up with regarding negative rates that did not drain the surplus and was accounted for with a token in the vault but all of this necessitates contract changes. If we talk about negative rates I think we need to pay attention to whether an idea requires significant contract changes, secondary wallet changes, or ? Don’t get me wrong - I want to have this discussion I have a feeling here implementing an effective negative rate strategy is probably going to be difficult but I know there are a lot of clever people around here so perhaps someone will have a good idea that is easily implemented. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.263354700854701
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#54",
                    "likes": "2",
                    "time": "08/07/2020-18:22:16",
                    "content": "    MakerMan:  I know there are a lot of clever people around here so perhaps someone will have a good idea that is easily implemented.   I talked about this a while back but personally i think you might be able to artificially create negative rates by offering a vaults for DAI liquidity pools uniswap.    [UNI-V1] Uniswap Liquidity Tokens as Collateral   What i am trying to get at on the monetary policy front is that this would actually give you a way to inflate the DAI supply by listing on uniswap. Users would be able to take DAI they had to mint a uniswap token then can turn around and take that uniswap token to mint more DAI. If the SF for the uniswap token was sufficiently low i imagine you could use this mechanism create some downward pressure on the dai price.   Granted that idea kinda was squashed by the oracle team but it still seems like a much lower effort approach compared to rewriting / auditing / deploying / and migrating new vault contracts to include actual negative stability fees. Could post a bit of napkin math I did a while back if people are interested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.607323232323233
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#55",
                    "likes": "0",
                    "time": "06/10/2020-18:22:18",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}