{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/will-makerdao-have-to-abide-by-know-your-customer-and-anti-money-laundering-laws/819",
            "title": "Will MakerDAO have to abide by know-your-customer and anti-money-laundering laws? ",
            "index": 819,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "concerns"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tester",
                    "index": "#1",
                    "likes": "1",
                    "time": "20/11/2019-03:33:01",
                    "content": "This article specifically mentions Dai:   coindesk.com    CoinDesk: Bitcoin, Ethereum, Crypto News and Price Data Leader in cryptocurrency, Bitcoin, Ethereum, XRP, blockchain, DeFi, digital finance and Web 3.0 news with analysis, video and live price updates.      Here is an excerpt from that article: \"Including stablecoins as money transmitters … means firms dealing with them must follow federal know-your-customer (KYC) and AML laws under the Bank Secrecy Act.\" Does this mean that MakerDAO must abide by know-your-customer and anti-money-laundering laws? An investigator could easily cross reference all Ether addresses that have interacted with Maker contracts, with records from all licensed U.S. exchanges (including CoinBase). This would identify many MakerDAO players. Unfortunately, there currently is no privacy method that works with Ethereum addresses. Search google for “mimblewimble broken”. ",
                    "links": [
                        "https://www.coindesk.com/policy/2019/11/19/fincen-stablecoin-issuers-are-money-transmitters-no-matter-what/",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-november-21-9am-pst-5-00-pm-utc/823/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6399147727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "1",
                    "time": "20/11/2019-13:30:24",
                    "content": "The issue is which KYC/AML rules? A dapp is a dapp no matter where you are but regulations are usually national.  That being said - I can’t wait for Tornado Cash to come out of beta and preferably cover ERC20s as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tester",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/11/2019-14:09:02",
                    "content": "Centralized exchanges (like Coinbase) could expel accounts that send to the Tornado contract. For example, Coinbase expels accounts that send to major gambling sites. Yes, you can route your ETH through other contracts/accounts before sending to Tornado, but that can be easily traced. They would have to anonymize transactions going to the anonymizer contract. Otherwise, all transactions going to the “one” anonymizer contract could be open to suspicion. The Problem: If the majority of addresses that the Tornado contract sends to are illicit sites, Coinbase will expel accounts that sent to the static Tornado contract address. Adding a finite number of layers between Coinbase and Tornado would not solve the problem. The Solution: Add infinite layers between Coinbase and the destination site. This would make it impossible for Coinbase to trace the transaction to the destination. Can a UI generate new contract addresses that will internally forward a transaction, with no trace of the forwarding transaction occurring, or will the final destination address still appear in Etherscan? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.189183501683502
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "20/11/2019-15:27:47",
                    "content": "As we all know regulatory concerns are globally, best practices differ from country to county, continent to continent. In my opinion, as long as we follow best practices for each continent, and the MKR Governance/token holders point the system in the right direction, the governance process should get everything right with regards to each jurisdiction standards. We all know that one jurisdiction standards does not dictate the entire world’s best practice standards. But yes, it is important that the Maker token holders point the entire ecosystem in the right direction. I also believe that we have a tendency to forget that DAI is global. Just my 2 gwei… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.912337662337662
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PatrickDehkordi",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/11/2019-15:50:57",
                    "content": "How would an organization become KYC compliant? I think you need to scan and keep everyone’s legal ID, like a bank. How would you do that in a decentralized network where anyone can run their own node/cli/GUI ? Same question with regards to AML ? Even more difficult. Ethereum is more public than any bank. All the addresses, balances, transfers are public. Governments are able to work with the telecom companies, and link IP addresses to the ethereum addresses and enforce their laws. Not sure what imposing outdated laws on a small group of innovative experimental start ups achieves, other than curb innovation, and put US behind the world. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3046875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "0",
                    "time": "20/11/2019-19:44:33",
                    "content": "You’re right! You look at some of the larger banks, so for instance Citibank alone has 30,000 out of some 204,000 employees in their compliance department, many of which are processing suspicious reports–how in the world will the decentralized/open finance ecosystem pull off something similar? SMH ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PatrickDehkordi",
                    "index": "#7",
                    "likes": "1",
                    "time": "20/11/2019-21:12:34",
                    "content": "I think the legislation needs to change, and the governments have to realize something like ethereum, with an open public ledger, maybe even safer for them to regulate than the current financial institutions. However, sooner than later we will be able to do smart contracts on privacy centric networks like Monero or Zcoin and so on. Then we are back to a political debate. It will be positive for individual freedom under corrupt governments, and negative for a non-corrupt governments trying to control criminals.  Where do you draw the line? I have no clue, but I am finally sensing some panic in the US agencies. Of course for fascist governments and anarchist individuals, the answer is simple and clear. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.071046600458366
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#8",
                    "likes": "0",
                    "time": "20/11/2019-22:53:34",
                    "content": "US regulators fined EtherDelta for operating an unregistered exchange even though they didn’t defraud anyone. It is annoying that trustless and accountable systems are being regulated by laws that governed human organizations. It is unfortunate that much of the regulatory attention is on trustful systems such as the Libra, and that resulting worldwide regulation may lack nuance. We should disregard laws that make victimless criminals of us and instead physically relocate to a country that empowers secure and private commerce. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#9",
                    "likes": "1",
                    "time": "21/11/2019-01:46:20",
                    "content": "Doesn’t that mean just the foundation would be targeted? So if the foundation ceases to exist will the system crash in its current form? Governance needs to rapidly mature and develop a treasury and procedures for funding for risk teams, lawyers, oracles, integration, marketing, ect. Once that capability is launched I dont think governance will collapse post foundation dissolution. The government would have to figure out how to control an idea and the software that the idea is implemented on (etherum). The US government can say whatever its wants but wont be able to do shit besides hunting down people or destroying etherum, which is always a risk. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.957465277777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#10",
                    "likes": "0",
                    "time": "20/04/2020-02:50:22",
                    "content": "Like Amazon and Microsoft and The Government do, we can just get another instance or portal or server based location that would solve the problem regarding this. There is nothing illegal in this right now, it’s considered as using a service. Legal mitigation and terms around this is mostly a grey color right now. I don’t see any problem about privacy of current owner. They can remain anonymous if they want, but we are not going to encourage the fiscal invasion. There is still privacy issue and legal issue in the documentation and everyone is free to do what they want. We supply only an address here like Etherscan is doing. The Ethereum and MakerDAO is not looking to get anonymous. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.456349206349206
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#11",
                    "likes": "0",
                    "time": "20/04/2020-02:53:16",
                    "content": "They will eventually re-legalize it, and they will get into the crypto and blockchain world sooner than you think. Like they did here with the Marijuana… make it illegal, then make rules, then re-legalize it with authorization and make huge profit… lol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                }
            ]
        }
    ]
}