{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-devcon-vi-endgame-kickoff-w-matthew-rabinowitz-of-6s-capital-on-drinks-with-makerdao-delegates/18171",
            "title": "The Devcon VI Endgame Kickoff w/Matthew Rabinowitz of 6S Capital, on Drinks with MakerDAO Delegates ",
            "index": 18171,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "community-delegate-vlog",
                "drinks-maker-delegates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "8",
                    "time": "01/10/2022-10:08:56",
                    "content": " The Endgame Stance with 6S Capital As we look forward  to the much anticipated  Devcon VI in Bogota, Colombia this October, we catch up with the Godfather of MIP21, Matt Rabinowitz the co-founder of 6S Capital. We talk with Matt about the state of Real World Assets within MakerDAO, how the Endgame plan could benefit the overall scopes of MakerDAO, and how 6S Capital is looking to help scale the DAO into primetime status. We hope you enjoy this special episode as much as we did, and get a good idea where the mindset of Matt and 6S Capital are in the grand scheme of RWA innovations.  Not Financial Advice This Content is for entertainment and informational purposes only, you should not construe any such information or other material as legal, tax, investment, financial, or other advice. Nothing contained on the FlipFlopFlap YouTube Channel constitutes a solicitation, recommendation, endorsement, or offer by @mrabino1 a.k.a, Matthew Rabinowitz,  @ultraschuppi a.k.a, Tim Schuppner @ElProgreso a.k.a, Frank Cruz @rspa a.k.a, Raphael Spannocchi, Flip Flop Flap Delegate LLC, Flipside Crypto, 6S Capital, or any third party service provider to buy or sell any cryptocurrencies, securities, or other financial instruments. Nothing in this YouTube Video constitutes professional and/or financial advice.  The Tastings El Pro: Naturally Squeezed Orange  Juice , Medellin, Colombia   4 Stars     Schuppi: Flensburger Brauerei Pilsner, Flensburg, Germany   4 Stars     Raphael: Tegernseer Helles, Bavaria    3.5 Stars     Matt: Costco Black Coffee  Every State in the United States   2 Stars        ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-212-thursday-october-20-at-17-00-utc/18427/3",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/23"
                    ],
                    "GPT-summary": "The post discusses an interview with Matthew Rabinowitz, the co-founder of 6S Capital, about the state of Real World Assets within MakerDAO and how the Endgame plan could benefit the overall scopes of MakerDAO. The post also mentions the goals of 6S Capital to help scale the DAO into primetime status. The post does not contain entirely positive or negative feedback on the proposal, but rather constructive criticism and an explanation of the proposal. Additionally, the post advertises the FlipFlopFlap YouTube Channel and mentions the disclaimer that the content is not financial advice.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.548971861471862
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#2",
                    "likes": "2",
                    "time": "01/10/2022-11:04:54",
                    "content": "Small beer update: I drank a Tegernseer Helles. From Bavaria. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/10/2022-04:48:23",
                    "content": "“This is how it should be done, this style is identical to none” -Rakim First Decentralized Drinks with MakerDAO Delegates on Lenstube (Lens protocol) LFGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGGG https://lenstube.xyz/watch/0x2c29-0x02 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.25
                }
            ]
        }
    ]
}