{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-potential-issue-with-protocol-paid-delegates/10061",
            "title": "[Informal Poll] Potential Issue with Protocol Paid Delegates ",
            "index": 10061,
            "category": [
                "Governance"
            ],
            "tags": [
                "delegation",
                "informal-poll",
                "legal",
                "compensation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#1",
                    "likes": "4",
                    "time": "29/08/2021-03:24:27",
                    "content": "I previously raised some issues to think about regarding the protocol potentially compensating delegates.  Since then, one more came to mind which I think is important enough to poll the community on. At this early stage, three recognized delegates collectively have 88% of the voting power needed to pass an execute.  It seems likely that in the future, recognized delegates collectively will have more than enough voting power to pass an executive on their own, and that it will be common for all of them to vote for an executive spell. It occurred to me that this bears some resemblance to executives empowered to govern a company, except of course that corporate executives are paid to govern the company. I’m concerned that this resemblance could be heightened if recognized delegates are paid by the protocol to govern it, and I wonder what the rest of the community thinks.    Would the protocol paying recognized delegates to govern it put MakerDAO at increased risk of being deemed a security by United States authorities?  Yes No Abstain Other (specify in comments)     0 voters     For Reference: Framework for “Investment Contract” Analysis of Digital Assets ",
                    "links": [
                        "https://www.sec.gov/corpfin/framework-investment-contract-analysis-digital-assets",
                        "https://forum.makerdao.com/t/maker-relay-ep-60/10082",
                        "https://forum.makerdao.com/t/maker-relay-ep-60-en-espanol/10375",
                        "https://forum.makerdao.com/t/delegate-debates-1-delegate-compensation/10267/6",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-27th-september-2nd/10125",
                        "https://forum.makerdao.com/t/delegate-compensation-informal-poll/10042/31"
                    ],
                    "GPT-summary": "The author of the post is seeking feedback from the community on a potential issue with the protocol compensating delegates. The author raises concerns about the resemblance of recognized delegates being paid to govern the protocol to executives empowered to govern a company. The post asks the community whether paying recognized delegates to govern the protocol would put MakerDAO at increased risk of being deemed a security by United States authorities. The post explains the issue and asks for feedback, while also inviting the community to vote on the issue.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.223039215686275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "29/08/2021-13:37:53",
                    "content": "For my part, as the saying goes, “I don’t believe the snake bites itself”. We start from a point in which, any change they make for their own benefit, they will lose the power delegated to them. Simple question of interest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "1",
                    "time": "29/08/2021-13:47:44",
                    "content": "Is there a particular legal opinion or reference that makes you wonder this? I’m not a lawyer, so just wondering why paid delegation would play into securities law. Maybe there’s a good reason, but it seems unrelated to me. Also note that neither MKR or DAI have to be deemed a security for there to still be “securities transactions” that are regulated. See: XRP’s legal woes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "2",
                    "time": "29/08/2021-14:44:27",
                    "content": "@Spidomo Great question and something I didn’t even think about when considering another post with suggested changes to the delegate process so we could consider fair compensation for delegates. I am going to have to think about your question a bit and probably do some research before coming back with an answer. I do think if delegates have sufficient MKR to pass an executive they basically have the power to alter their own pay structures.   This becomes a potential conflict of interest.   I think it is a thorny area honestly. You will see another post which recommends changes to the delegate process.   One of my biggest cocnerns around any discussion of formalizing delegate statuses enough to compensate them is that delegates self - elect.   There is no formal election process, and no formal positions.  There is also no maximum MKR a delegate can accumulate.  It is true one person with many wallets could accumulate enough MKR to effectively ‘rule MKR’ the question is whether we should allow via delegation such an accumulation to occur. I think this post, with probably the delegation poll, and my own post suggesting that Maker have formal elected delegate positions should cause sufficient concern to pause a bit and rethink what delegation means both from conflicts of interest standpoints, accumulation of MKR voting power and the governance system in general. One of the biggest issues here is that MKR votes like stock votes and since there is no way to connect a person to wallet, we could have players with sufficient MKR that basically don’t vote because they have sufficient power to rule.   This may be one of the sole reasons our MKR whales don’t vote and also exhibits a significant unsolvable problem to governance.   How does a system which is dominated by non-voting whales effective secure such a system with some small fraction of the total remaining vote? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.528409090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/08/2021-16:07:29",
                    "content": "    PaperImperium:  Is there a particular legal opinion or reference that makes you wonder this? I’m not a lawyer, so just wondering why paid delegation would play into securities law.   I’m also not a lawyer, and at first I was going to highlight parts of the referenced document but trying to do so comprehensively was making my head spin. I think it’s already a concern to have a small group of delegates effectively governing the protocol, and how similar that is to executives of a company.  Remember, a key issue of whether MKR holders are governing the system themselves, or whether someone else governs it for them. I don’t have a legal opinion or citation for why the protocol paying those delegates to govern it would heighten that concern.  It just struck me that it makes this group look, to my non-lawyer mind, even more like executives of a corporation who are hired to do the job of managing it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.925925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#6",
                    "likes": "5",
                    "time": "29/08/2021-16:20:51",
                    "content": "    MakerMan:  One of my biggest cocnerns around any discussion of formalizing delegate statuses enough to compensate them is that delegates self - elect.   I expect that this is more a problem in theory than in practice. In practice, delegates can lose their delegated MKR within hours. I think this threat will guide them to act with integrity. Flip Flop Flap (ElPro) has a MKR weight of 6622.92. Suppose all of this MKR was self-delegated. Even without the delegate system, ElPro can just vote for a short-term gain that is long-term detrimental. Why go through the GovAlpha gauntlet to become a recognized delegate? Suppose ElPro locked up $22 million worth of assets to earn $38k per year (per my reward proposal). That’s an annual return of like 0.16%. Is such a small return really worth all the GovAlpha trouble if you just want to vote selfishly? ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-compensating-recognized-delegates-parameters/10196",
                        "https://forum.makerdao.com/t/delegate-compensation-informal-poll/10042/36"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.527777777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#7",
                    "likes": "0",
                    "time": "12/09/2021-01:52:00",
                    "content": "Poll Results Summary: A 52% majority abstained. More than twice as many voters (31%) are concerned about the legal risks of the protocol treating recognized delegate as a paid role vs. those who are not concerned (13%). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "12/12/2021-07:52:51",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}