{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-vision/12880",
            "title": "MakerDao Vision ?   ",
            "index": 12880,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Karim_Zniber",
                    "index": "#1",
                    "likes": "1",
                    "time": "27/01/2022-11:13:32",
                    "content": "message is for maker delegates that are currently handling our governance. You are not doing enough, we need more automated service developments around Maker Dao and we should use a part of the growing surplus buffer to do it. We could have an app with a maker wallet ( like metamask ) where you can trade and swap in dai as the only stable currency ( like argent ). We cannot just sit idle gathering money to only burn or stack up in the surplus buffer. I see our protocol as the premise of a central bank that can create a whole ecosystem depending on it. I personally think you are making a mistake by just increasing the surplus buffer and stopping everything else. I think it should be divided a certain way with burning maybe having only a fifth or less of the budget. Dai pegged to the dollar ( fiat ) loses value everyday you don’t use it and the only thing right to do with it is create new added value. As a lover and investor of maker, I am afraid that without a proper vision and path forward in improving and providing a comprehensive ecosystem to help our DAO thrive and garner attention, we quickly become dinosaurs in the crypto-sphere. ",
                    "links": [],
                    "GPT-summary": "The author of the post is addressing MakerDao delegates and expressing concern about the lack of automated service developments around Maker Dao. The author proposes using a portion of the growing surplus buffer to develop an app with a Maker wallet where users can trade and swap in Dai as the only stable currency. The author believes that MakerDao should not just increase the surplus buffer and stop everything else, but instead divide the budget in a certain way to create new added value. The post also extends an invitation to collaborate and improve the DAO.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.106060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "27/01/2022-11:59:19",
                    "content": "You are so right, I see slow execution times, little innovation and several other flaws. These posts help to throw a bucket of cold water and to be able to work on the fly. I don’t understand how other protocols process in record time new integrations, even running on new networks natively, while here we are just trying to explore L2. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.236791617473435
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "8",
                    "time": "27/01/2022-14:36:34",
                    "content": "A couple of things here;  The surplus buffer increase is a temporary step while Surplus Auction upgrades/alterations are considered. There’s a lot of vision happening here (see below)  Between the ~22 ratified Core Units, the several in incubation, and the Recognised Delegates there are ALOT of things in the works.  image637×511 42.8 KB   ~11 major initiative buckets   L2 = Layer 2 CMON = Collateral Management OnChain CMOFF = Collateral Management OffChain OR = Oracles TU = Technical Upgrades OI = Organizational Improvements GR = Growth SC = Stakeholder Content SPF  = Special Purpose Fund RISK = Risk SEC = Security   image659×676 11.4 KB   image744×571 10.5 KB   image742×588 11.1 KB   image743×631 11.6 KB   image742×213 4.61 KB  There is quite a lot of vision happening here. See:     A Multichain Strategy and Roadmap for Maker Governance   A Multichain Strategy and Roadmap for Maker The aim of this forum post is to present a bird’s eye view of the Layer 2 ecosystem and the various opportunities that exist. By presenting our interpretation of the multichain landscape we hope to be able to (1) Guide and engage with the broader community on this specific topic, (2) Gather feedback regarding the various opportunities, and (3) Align technical and development resources to agree on a strategy for how MakerDAO should embrace this new and…         Introducing Maker Wormhole Protocol Engineering   [maker-wormhole-logo] Introduction Maker’s Protocol Engineering Core Unit is building upon its multichain strategy by introducing DAI Wormholing - the ability for almost instant teleportation of DAI between supported Layer 2s + Ethereum.  As the Layer 2 ecosystem evolves and DAI liquidity grows within these domains, it will become important for users to be able to move DAI between them in a trustless manner. This initiative to Wormhole DAI across Layer 2 ecosystems, starting with Optimism and…         Product Discussion: NFTs as MakerDAO Collateral Collateral Onboarding       This post gives an overview of opportunities for Maker to begin serving the NFT lending market.   Market Opportunity The NFT market has seen incredible growth over the past year. Sales activity has dipped somewhat over the past 3 months, but the NFT space retains huge user attention, narrative tailwinds, and overall momentum. Despite this, NFTs are still second class citizens within the defi space with sparse lending and collateral support. I believe this presents an opportunity for Maker to cap…         On the State of the Auctions UIs Governance       Hi everyone   I feel like these past days of high market volatility (ie. Flappy Friday) has painfully pointed out that the state of UIs built for interacting with auctions (CLIP, FLAP and FLOP auctions) is fragmented, somewhat deprecated and clunky. With this thread I hope to create some clarity on the state of these UIs, where they are going and lastly announce some short-term measures to increase discoverability of the appropriate UIs for end-users.   Context Ever since the Maker Fou…         The case for Clean Money Governance   [image] [image] [image] [image] [image] [image] [image] [image] [image][image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] [image] Clean Money MakerDAO is in the position to use the most powerful tool ever invented to fight the most challenging problem ever faced - all it takes is the w…         Improving governance participation rate at MakerDAO Governance       Fellow DAOists   The past few weeks have been very interesting at MakerDAO—we’ve seen a ton of discussions about long-term topics such as Maker’s mission, the RWA strategy, MKR tokenomics and more. I have also read a lot of critique on the state of Maker governance. With this post I’d like to zoom into one particular problem that Maker governance is facing today: Low governance participation rate.  With this post I hope to achieve the following:   Highlight the problem and its pote…         The Arranger Model - a highly scalable RWA framework Governance   The Arranger Model Real World Assets are one of the biggest opportunities and challenges for Maker, and the thing that sets the Dai stablecoin apart from any other DeFi project.  Just as it has incredible potential, the field of RWA is also extremely complex and difficult. For this reason it is extremely important that MKR holders structure the entire framework to make it as easy as possible for them to manage its risks, especially at scale.  This post is intended as a simplified overview of th…      etc etc ",
                    "links": [
                        "https://forum.makerdao.com/t/introducing-maker-wormhole/11550",
                        "https://forum.makerdao.com/t/a-multichain-strategy-and-roadmap-for-maker/8380",
                        "https://forum.makerdao.com/t/product-discussion-nfts-as-makerdao-collateral/12619",
                        "https://forum.makerdao.com/t/on-the-state-of-the-auctions-uis/12844",
                        "https://forum.makerdao.com/t/flappy-friday-clip-and-flap-analysis/12790",
                        "https://forum.makerdao.com/t/the-case-for-clean-money/10684",
                        "https://forum.makerdao.com/t/improving-governance-participation-rate-at-makerdao/11706",
                        "https://forum.makerdao.com/t/the-arranger-model-a-highly-scalable-rwa-framework/11298"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.65418300253206
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "28/04/2022-20:36:59",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}