{
    "poll_list": [
        {
            "title": "MIP10c9-SP4 Governance Poll to Whitelist MCDEX on ETHUSD Oracle - June 15, 2020",
            "index": "2723",
            "option": "Yes",
            "supporting_mkr": "6,334",
            "highest_fraction": 0.82
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c9-sp4-proposal-whitelist-mcdex-on-eth-usd-oracle/2723",
            "title": "MIP10c9-SP4 Proposal: Whitelist MCDEX on ETH/USD Oracle ",
            "index": 2723,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-whitelist-sp",
                "mcdex",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/yangzhao28",
                    "index": "#1",
                    "likes": "3",
                    "time": "03/06/2020-04:38:17",
                    "content": "MIP10c9: Subproposal to Whitelist MCDEX for ETH/USD Oracle Access Preamble MIP10c9-SP#: 4 Author(s): Zhao Yang, Tianchi Zhu, Jie liu Contributors: Zhao Yang, Tianchi Zhu, Jie liu Status: Formal Submission Date Proposed: 2020-06-03 Date Ratified: <yyyy-mm-dd>  Disclaimer MIP10 is meant to handle all of the Oracle related actions. Unfortunately MIP10 has inconsistencies and doesn’t conform to the monthly governance cadence that the Maker Improvement Proposal framework is built around. This has generated a backlog of Oracle proposals. While MIP10 is refactored to conform to the regular MIP process, Oracle proposals such as this one will utilize the more liberal weekly governance cycle. While strictly speaking this makes them not subproposals, they are included in the subproposal archive as a point of provenance to serve as a paper trail. Specification Introduction MCDEX is a decentralized derivatives trading platform for perpetual contracts and futures. Currently, the perpetual contract is provided with fully on-chain AMM and off-chain order book. Both of the trading mode are based on margin account which is create through depositing collaterals into the contract. The PNL (profit and loss) is calculated based on the price read from oracle called mark price which is critical for keeping the whole system work. Therefor, instead of using mark price from a single oracle, we read price from a primary oracle source and validate it with prices from different on-chain data sources. An update causing the price gap between primary price and validating prices exceeding a threshold (5% by default) would never success. The administrator could then decide to switch to another data source or stop the perpetual to prevent further loss. Currently, MCDEX uses single price from Chainlink and intent to introduce Medianizer as a validator. There may be more sources in the future and a switch between them could happen at any time. Oracle Name ETH/USD Customer(s) MCDEX - [email protected] Whitelist MCDEX - 0x12Ee7E3369272CeE4e9843F36331561DBF9Ae6b4 - Medianizer Requirements For each customer address to be whitelisted:  Is the contract source code verified on etherscan? yes Is the Oracle data used in a permissioned manner that would prevent parasitic behavior? yes Is Oracle data written to storage? yes If Oracle data is stored, is it stored in a private variable? yes If Oracle data is stored, is the value accessible on-chain exclusively by the protocol? yes  Fee In accordance with the Responsible Oracle Migration Proposal, fees are waived for the first year and determined by MKR Governance after that. Changelog  reformatted preamble added disclaimer  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.420031055900622
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "03/06/2020-13:01:11",
                    "content": "There is already a MIP10c9-SP1 here which pre-dates this one: MIP10c9-SP1 Proposal: Whitelist DeFi Saver on ETHUSD Oracle The next available number is 4. I would suggest modifying this proposal such that it refers to itself as MIP10c9-SP4. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yangzhao28",
                    "index": "#3",
                    "likes": "1",
                    "time": "03/06/2020-14:26:22",
                    "content": "Thanks for your advice .  I’ve corrected the numebr. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/06/2020-04:32:56",
                    "content": "I’ve verified all the information supplied in the application specifically around the requirements. Governance Poll will go live tomorrow. ",
                    "links": [
                        "https://forum.makerdao.com/t/set-of-oracle-proposals-included-in-july-3rd-executive-vote/2977"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#5",
                    "likes": "0",
                    "time": "16/06/2020-04:48:07",
                    "content": "Polling Vote is live https://vote.makerdao.com/polling-proposal/qmuajcxpbqahsx32xsakpmswgedaw6muvpjguycdqkcylv ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                }
            ]
        }
    ],
    "group_index": "2407"
}