{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-increase-sai-to-dai-migration-debt-ceiling/1969",
            "title": "[Discussion] Increase Sai to Dai migration debt ceiling ",
            "index": 1969,
            "category": [
                "Governance"
            ],
            "tags": [
                "idea",
                "mcd-migration",
                "scd-shutdown"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Snow",
                    "index": "#1",
                    "likes": "1",
                    "time": "14/04/2020-09:52:37",
                    "content": "As a Sai holder, who trust the original system and wasn’t sure to migrate to Dai before the new system is bullet-tested or inevitable ES on Sai. The sudden 0 debt ceiling put me into a very difficult situation (I also thought it is only going to happen on April 24 date or whenever SAI was officially shutdown, no clear communication in advanced). I have encountered many people facing the same issues too after the proposal was voted in by only 17 MKR holders. I understand Sai should be gradually eased out but not in such a dramatic manner, at the potential expense of Sai holders. Instead, the migration debt ceiling should be tracking above the current Sai liquidity (currently ~3m) in the contract so that small and medium Sai holders can still swap their Sai to Dai at par without significantly increasing the risk of MCD system, in addition, it could inject liquidity for CDP holders to migrate their position before the ES. Therefore, I propose to increase Sai to Dai migration debt ceiling relatively above the Sai liquidity in the migration contract, eg. 5m, which is the middle round from the last decreasing (I believe the debt ceiling went from 20m to 15m to 10m and jumped to 0). ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing an increase in the Sai to Dai migration debt ceiling to ease out the transition process for Sai holders. The post also includes constructive criticism of the sudden 0 debt ceiling and questions about the communication regarding the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.99060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#2",
                    "likes": "2",
                    "time": "15/04/2020-02:35:20",
                    "content": "Why don’t you just sell your Sai for ETH and then sell the ETH for Dai?  It would cost you like $0.50 in transaction fees. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "3",
                    "time": "15/04/2020-12:59:58",
                    "content": "Based on community chats, I’ve seen people recommending Uniswap, Kyberswap, and 1inch as good venues for exchanging SAI -> DAI/ETH. A search for Decentralized Exchanges or DEXs will reveal more. I haven’t verified it but dex.ag lets you quickly compare rates across a number of exchanges. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/04/2020-22:40:19",
                    "content": "I have acquired a bunch of SAI, more than I could reasonably liquidate. Should I wait for shutdown and claim the ETH? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Snow",
                    "index": "#5",
                    "likes": "1",
                    "time": "15/04/2020-23:54:16",
                    "content": "thanks for the advices, yet the slippage is too high, more than 10% for the amount of Sai I have. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#6",
                    "likes": "1",
                    "time": "16/04/2020-03:00:22",
                    "content": "So just claim the ETH at shutdown at market price with no slippage ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#7",
                    "likes": "0",
                    "time": "16/04/2020-03:00:58",
                    "content": "That’s what I would do ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "0",
                    "time": "16/04/2020-07:13:49",
                    "content": "I don’t know how much you are looking to exchange but I agree I unwound my SAI through ETH to DAI as the liquidity was better. I think just converting on GS your SAI to ETH with 0 slippage IS the best option.   Then just sell the ETH for DAI when it is profitable to do so. While I agree with you the time to closure and PR in relation to that is pretty aggressive (I would have liked to see a 3month timeline from when voted to give everyone a last 3 months to clear the heck out of the SCD or face GS). Given that fees will be forgiven I honestly think it is in best interest for people in SCD simply to liquidate at OSM and claim remaining ETH than to pay fees to recover the ETH. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.125
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/lower-sai-to-dai-migration-debt-ceiling-to-0/1929",
            "title": "Lower Sai to Dai migration Debt Ceiling to 0 ",
            "index": 1929,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "3",
                    "time": "07/04/2020-20:23:27",
                    "content": "Please vote on the current executive because it contains the important step to “Lower Sai to Dai migration Debt Ceiling to 0”! https://vote.makerdao.com/executive-proposal/adjust-multiple-risk-parameters ",
                    "links": [],
                    "GPT-summary": "The post is an explanation of a proposal to lower the Sai to Dai migration debt ceiling to 0 and a call to action to vote on the current executive. The author is explaining the proposal and a 3rd party is asking for more information by requesting a vote.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/04/2020-05:14:42",
                    "content": "I did vote but this docs should be reviewed also. This lead to a little bit of confusion if you are not used to vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0625
                }
            ]
        }
    ],
    "group_index": "2047"
}