{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/partial-collapse-of-civilization-due-to-climate-catastrophe-is-now-locked-in/16999",
            "title": "Partial collapse of civilization due to climate catastrophe is now locked in ",
            "index": 16999,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "clean-money"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "7",
                    "time": "04/08/2022-14:08:42",
                    "content": " image1200×1125 135 KB  It’s about a year ago since I posted the Case for Clean Money and the IPCC AR6 report gave a clear indication that even mainstream, greenwashed climate science cannot hide the fact that humans are a few years away from irreversibly breaching the tipping points that will bring the earths climate into a new and much hotter equilibrium. Since then maker has accomplished absolutely nothing, and the world as a whole has not only accomplished nothing, but rather accelerated the crash with things like coal burning and renewed fossil fuel investments due to the Ukraine war putting the nail in the coffin on any kind of long term thinking. ‘Dirty ol’ coal is making a comeback. While in theory it is still physically possible to prevent breaching the climate tipping points that will cause irreversible, locked in collapse, what actually matters is whether it is pragmatically possible to do so given the “climate change meta” of global human society. “The meta of something” is a broad concept describing all second order, contextual effects related to human interactions around a particular subject, such as the game theory and political, social and socio-economic conditions that impact the subject. What matters isn’t whether it is still physically possible for humans to stop collapse-inducing economic activity, the question is if they want to Unfortunately the climate change meta has always been locked in the same spiral of doom - the costs of dealing with the future problem is too high, and even acknowledging the costs (let alone the consequences of doing nothing) would cause immediate financial damage due to forecasting, so the best option is to ignore and downplay it. The problem is of course that every year no action is taken, the physical requirements, and thus the cost, of trying to prevent collapse just becomes even higher, making it even more unlikely and out of reach that the meta of climate change would ever change to the point where ignoring and downplaying isn’t the best available short term option. That brings us to today, a year after the IPCC AR6 report, and the “head in the sand” meta is stronger than ever. Instead of casting doubt and dismissing the possibility of global collapse, it has transcended to  Westworld style “that doesn’t look like anything to me” Catastrophic climate change outcomes like human extinction ‘not being taken seriously’ - BBC News Honestly, the above video is one of the most amazingly meta things I have seen in a long time, and unfortunately it is exactly because of what’s being displayed in the video - the broken, suicidal meta we are locked in and cannot break free from, that many of us are already doomed to a horrible fate. Those of us who aren’t lucky enough to live in the few resilient places on earth, and aren’t rich enough to get there in time, could very well expect unavoidable economic ruin and starvation, and early death from the collapse of society. While collapse cannot be averted, it is still a possibility that total collapse can be prevented and we can hang on by a thread in what I call partial collapse. This basically translates to the lucky and the rich choosing which of the unlucky and poor are going to die. And as much as that sucks, that’s the best case outcome we have to look forward, with the other alternative being extinction or near extinction with cultural reset. In the context of such a catastrophe, unlike anything we have ever seen - even global nuclear war - we need to think about what Maker can do to deal with this. First and foremost how to survive as a system, but also how to help some of the billions of unlucky humans survive - what we do with Maker specifically is much more impactful than anything we could do individually, because nothing is more relevant to the crisis we’re facing than the financial power of currency, and the ability for DAOs and blockchain to create more collaborative metas. If we are unable to grasp this responsibility we will never be able to govern Maker properly and we will be doomed to the same tragedy of the commons that has befallen all of humanity, and rightfully deserve it. ",
                    "links": [
                        "https://www.youtube.com/watch?v=BuFheTMljZk",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-12/17264",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-04-10-de-agosto-del-2022/17250",
                        "https://forum.makerdao.com/t/el-colapso-parcial-de-la-civilizacion-debido-a-la-catastrofe-climatica-ya-esta-asegurado-traduccion/17093",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-12-traduccion/17270",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/10"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.464349136526556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/08/2022-14:28:41",
                    "content": "There actually has been much about this recently.  The climate apocalypse. I hope we are not too late and can reverse course globally.    Capital Gazette    Gerald Winegrad: The signs of our climate apocalypse are everywhere | COMMENTARY In the case of global warming, it is hard to overstate the urgency. We are confronted by apocalyptic ecological changes threatening life on Earth. The world’s best climate scientists have become so alarmed, they can no longer refrain from using...      ",
                    "links": [
                        "https://www.capitalgazette.com/opinion/columns/ac-ce-winegrad-global-warming-20220729-urbbgcgfm5gmpbdmctjlycjtqe-story.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.560185185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "7",
                    "time": "04/08/2022-16:25:14",
                    "content": "Pretty sure no one wants to respond to this because likely inevitable existential impacts are depressing. I found this to be a little heartening (and relevant), though it was posted prior to the resurgence in coal.      Curious if you have thoughts on it Rune, or if you watch Kurzgesagt? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.231249999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#4",
                    "likes": "1",
                    "time": "04/08/2022-16:36:05",
                    "content": "Earth vs. Civilization. At 4.5 billions years old, the earth always wins. In a few million years from now, hopefully the next civilization will understand the impacts they make. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ClausClowes",
                    "index": "#5",
                    "likes": "1",
                    "time": "04/08/2022-17:38:09",
                    "content": "Every bit of progress we make now will reduce real human suffering in the future. The current global governing structure was able to fix the hole in the ozone, but a new, better governing structure could do so much more. I wax and wane with doomer vibes, but that’s what I find so hopeful about DAOs – especially this “L2 for governance” possibility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.909090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#6",
                    "likes": "0",
                    "time": "04/08/2022-21:44:02",
                    "content": "    rune:  In the context of such a catastrophe, unlike anything we have ever seen - even global nuclear war - we need to think about what Maker can do to deal with this. First and foremost how to survive as a system   I agree with this. As far as I recall, the ‘Clean Money’ vision and emphasis on resilient collateral was widely supported by the community last year (potentially some parts of the Sagittarius Engine were not, but I think the broad vision was popular). There are lots of reasons why working towards that vision makes sense for Maker, even aside from a sense of moral responsibility: long-term survivability, resiliency, and comparative advantage versus slow-moving TradFi operators. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.581439393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/synesthesia",
                    "index": "#7",
                    "likes": "0",
                    "time": "05/08/2022-07:46:08",
                    "content": "In the linked video, it’s quite scary how the anchor cuts the guy off when he’s about to expand on how the catastrophe can be averted. Shows it all on how serious humans really are about this grave topic. The short-sighted perspective sadly wins over any long-term plan and the current geopolitical landscape doesn’t help. Hopefully Maker community will be able present a broader, coherent approach as should pretty much everyone these days. Paradoxically I still see some hope in the ongoing psychedelic revolution as it’s all about underlying disconnect with nature and the planet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.558333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/08/2022-08:34:46",
                    "content": "    rune:  fuel investments due to the Ukraine war putting the nail in the coffin on any kind of long term thinking.   It was quite shocking to see how quickly the plans were aborted and coal made a big comeback. There are so many avenues to address carbon emissions and carbon capture that receive little to no funding, because they are either not sexy enough (low meta) or have some abstract regulatory concerns piled against them (like small nuclear).     monkey.irish:  Earth vs. Civilization. At 4.5 billions years old, the earth always wins. In a few million years from now, hopefully the next civilization will understand the impacts they make.   And this is what’s blocking so much of the discourse atm. Earth is not in danger. Life on the planet is billions of years old and survived far worse. The human species is endangered. Most people are unable to feed themselves when there’s no supermarket close… We’re the first to go when things get rough. So telling people to “save the planet” is actually terrible meta and pitches human against human. We should start saving ourselves. I think we deserve it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.807291666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#9",
                    "likes": "1",
                    "time": "05/08/2022-09:24:23",
                    "content": "this is an excellent point.  Lets not self exterminate ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#10",
                    "likes": "3",
                    "time": "05/08/2022-09:41:31",
                    "content": "I think it’s a good video, but if you look closely it is actually saying the same thing as my post, it just wraps the message in hopium vibes rather than doomer vibes, since their strategy seems to be that using hopium is more likely to get people to act rather than doom and gloom. However, as they point out themselves, all of the combined positive trends and technological adoption and advances still puts us on track to 3 degrees heating (and that’s the IPCC mainstream greenwashed data that excludes some of the most inconvenient feedback loops). I also think they are not including the latest physical science data about just how bad 3 degrees is, or consider it in light of all the other systemic pressures - I have a hard time imagining it would be possible to find any expert that would consider 3 degrees survivable in the global south when combined with all other systemic pressures. That would result in billions of migrants to the west, which may not result in total collapse of civilization but I think it counts as partial collapse, and it is a fate that is effectively locked in and unavoidable. I would guess that Kurzgesagt don’t actually believe that a miracle can happen and we can just work hard to redirect our pathway from 3 degrees to 2 degrees - they just think that using such a message is most likely to get people to act, because even redirecting from 3 degrees to 2.9 makes a huge difference. The worse things get, the higher the marginal impact of each ton of CO2e is, so the response to things getting worse and looking bleaker shouldn’t be to give up and just let it happen (which would result in literal extinction of humanity), it should be to react more fiercely and decisively to try to save what’s left of the future. IMO I think the time for hopium is over and it is time for collapse acceptance and the necessary grief, so that it becomes possible to let go and adapt. It is no longer enough to try to get people to act to become more sustainable and prevent worse future outcomes, it is also necessary for people to seriously consider what a partial collapse future means to them, so that they can start preparing today and save themselves and their families. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.088326446280992
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "2",
                    "time": "05/08/2022-13:09:13",
                    "content": "Yep, I agree it’s the same message, but I do think there is merit to the ‘hope over despair’ wrapper. Anecdotally, I respond better to that sort of message, than the doom version. More generally, I feel like people are more likely to expend effort when something feels ‘winnable’ versus something that is just gradations of loss. I’ll grant that it’ll vary from individual to individual though. I think it matters where hope is applied here. Hope applied to the strategy area feels harmful. A purely hope-based-strategy ie ‘if I hope enough it’ll go away’ is obviously useless. However, hope applied to the objective area feels essential because ‘if there is no hope of victory, why bother trying.’ I think perhaps the key is convincing people that victory is possible (whether true or not), but requires x concrete actions. Where x is something like lobbying or more extreme actions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.659821428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#12",
                    "likes": "7",
                    "time": "05/08/2022-15:07:09",
                    "content": "Stealing an exceprt from a newsletter that was shared with me, SNS. \"Luntz proposed “10 US Climate Communication Commandments,” which are as follows (with some paraphrasing):   Follow the equation Positive-Negative-Positive. This means describing a bright future, explaining the consequences of failing to build that future, and returning to a positive message.   Bipartisan messaging. Focus on our responsibility to take care of the Earth, particularly for future generations.   Targeted messaging. Democrats respond to fear of environmental consequences; Republicans respond to opportunities related to solving the crisis.   Focus on how individuals, not the collective, benefit from climate solutions.   Individualize, personalize, humanize, then globalize planetary impacts.   C=E2. A combined environmental and economic message is better than one focused solely on climate.   Emphasize positive personal impacts to health.   Focus not just on healthy forests, but what lives there. Life is compelling.   China’s activities that harm climate can cause complacency in other nations. Focus on transparency, accountability, and enforcement to address this.   COP26 and other climate-related efforts should be billed in \"-er\"s - e.g., “a cleaner, safer, healthier future.”   Original talk here: Americans and Climate: Words to Use, Words to Lose - YouTube In a way, maybe doomspeak is useful for a community like this, we have a unique opportunity to create fundamental impact and a limited window of time, so urgency of action is critical. But in general, I found these principles a useful way to think about the communication problem that exists around this topic. ",
                    "links": [
                        "https://www.youtube.com/watch?v=Kzj-Co0wy0s"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8332882395382395
                }
            ]
        }
    ]
}