{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-bat-sf-be-reduced/1192",
            "title": "Should BAT SF be reduced? ",
            "index": 1192,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "rates",
                "bat"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#1",
                    "likes": "3",
                    "time": "27/01/2020-17:36:46",
                    "content": "For the past few weeks the amount of BAT backed debt hovering around 1.5 MM (about 50% of the current debt ceiling) Conversely we see that ETH holders are more willing to take advantage of a DAI loan with almost 100% of the available debt (~100MM) being utilized. Is there a case to be made that the SF currently too high for BAT holders to be incentivized to borrow against their collateral? If so should the BAT SF be lowered to help spur on the creation of new DAI and help grow the ecosystem? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.553535353535354
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "3",
                    "time": "27/01/2020-19:21:57",
                    "content": "My intuition would say that BAT is even more volatile/speculative than ETH so BAT should actually have a higher SF if anything. I understand the sentiment of growing the system by keeping SF lower to promote Dai minting but I don’t think that is the optimal solution, especially with our limited grasp on controlling the peg right now. Perhaps once more risk teams and modules become available we can see collateral types decouple. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.165178571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#3",
                    "likes": "3",
                    "time": "27/01/2020-21:14:32",
                    "content": " My intuition would say that BAT is even more volatile/speculative than ETH  Yes, but do we have any data to back that up? This is just some napkin math here based on coinmarketcap data, but since jun 1 2017 BAT’s price has been decidedly less volatile (as measured by it’s coefficient of variation) than ETH.   docs.google.com    ETH Vs BAT BAT  Date,Open*,High,Low,Close**,Volume,Market Cap Jan 26, 2020,0.204678,0.212331,0.203494,0.211612,47,850,762,300,842,390,0.1092713206,Standard Dev Jan 25, 2020,0.207349,0.207404,0.202128,0.204836,41,628,366,291,208,657,0.2429890639,Average Jan 24,...      Not to say that number in that spreadsheet really means anything. I just don’t think it is fair to dismiss the idea outright based on our intuition. Are there other metrics that we are looking at beside DAI price to determine if the current stability fees are effective? When would we consider polling the MKR voting body to see if a change in SF is warranted for a given collateral type vs the SF of the system overall? ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1Z0ex75b0_5fzjoluLcJiXc_4u5XAwVLXGDU6OTGdCm4/edit?usp=sharing",
                        "https://docs.google.com/spreadsheets/d/1Z0ex75b0_5fzjoluLcJiXc_4u5XAwVLXGDU6OTGdCm4/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.949074074074074
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#4",
                    "likes": "1",
                    "time": "28/01/2020-11:33:03",
                    "content": "I don’t think it’s wise to look at risk only quantitatively.  For example, BAT is not really necessary for the Brave project (on protocol level or something like that). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "3",
                    "time": "29/01/2020-03:43:53",
                    "content": "Total ETH cap approx $19B - $100M borrowed approx .5% of cap. Total BAT cap approx $300M - $1.5M borrowed approx .5% of cap. Surprisingly about the same % of cap. This was my point about adding ‘new’ asset classes to Maker.   I would not bother adding other assets that only have caps of < $1B as they won’t add that much to the DAI borrow.   ETH is growing by itself nicely and the BAT probably will grow with it as more people with multple assets find out about Maker. In effect based on the above imo there is nothing amiss and having the BAT DC be 2x the % of available cap as compared to ETH is like having ETH DC at 200M and complaining it isn’t being utilized.   The idea that Maker could or would claim significantly more than .5-1% of the total available caps in anything at this point really isn’t a realistic view.  I’m thinking at the current rate of debt and deposit expansion that Maker could hit $200M DAI outstanding in approximately 6 months give or take and by then the $3M DC on BAT likely will be hit as well and need to be upped.  By then Maker will have raised the ETH DC probably 3 more times to approx $200M all with ~1% of the total available ETH and BAT market cap value in DAI borrowed.   FYI given the collateralization of > 200% this means there is at least 2-3x the collateral value deposited vs. the DAI minted which I’m looking at above and so this means Maker already has about 1-1.5% of the available caps as collateral deposited and by summer will have 2-3% of the available cap value deposited. As to Risk Premiums on top of the SF’s I’m going to leave that for Cyrus.  BTW:  Total DAI outstanding grew to $130M (1.85M in the past 24 hours).    Folks just sit back because from what I’m seeing growth in DAI outstanding has been consistent and only slows during significant market pull backs (probably due to liquidations).   My only annoyance is not seeing a chart of the total ETH and BAT deposited vs. the $$ amounts as I think this is a more important metric to keep track of along with collateralization ratios.   One of my concerns here is that it took SFs of 16-20% to slow this growth, and about the same time we saw the market pull back.    There is some concern here that the SF rates were not very effective in controlling debt facility growth and a more dynamic debt facility SF based on utilization curve would be more appropriate for managing this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.879726107226108
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#6",
                    "likes": "0",
                    "time": "29/01/2020-16:47:40",
                    "content": "Thanks for the great response. I hadn’t looked at the amount of collateral as % of the available marketcap in said asset. This really sets things into perspective. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#7",
                    "likes": "2",
                    "time": "30/01/2020-07:48:44",
                    "content": "I think daily volatility data, while important, it not sufficient to justifiably quantify the risk. BAT was designed to be less volatile than ETH, for the Maker protocol, given one hour OSM delay, it will be interesting to see if there were periods of short-term (less than an hour) significant price drops. We will look at the coinbase one-minute candles as see what we can find from there. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.784722222222223
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#8",
                    "likes": "1",
                    "time": "30/01/2020-09:05:13",
                    "content": "    MakerMan:  Total ETH cap approx $19B - $100M borrowed approx .5% of cap. Total BAT cap approx $300M - $1.5M borrowed approx .5% of cap.   While it is very interesting point, I think it determines Debt Ceiling not SF. I believe that Debt Ceiling should be set on level low enough to ensure that there is allways sufficient liuidity to sell off undercollateralized debt. and SF should reflect voliality of an asset. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#9",
                    "likes": "3",
                    "time": "30/01/2020-19:23:52",
                    "content": "Will just add another metric here to potentially give some signal on ETH v BAT volatility. I went through this morning and tried to calculate the beta coefficient for each of the collateral types. For this I compared the daily change in closing price for each asset vs the daily change in the CCMIX cypto index. Found BAT’s beta coefficient to be 0.3017 and ETH’s to be 0.6425 You can check my work here. Obviously this is still just another volatility metric though but i thought it was more useful than the previous one I posted since it compares the two against the volatility of the overall crypto market. And again based on this metric we see that ETH could potentially be viewed as a higher risk asset. ",
                    "links": [
                        "https://www.crescentcrypto.com/cryptocurrency-market-index/",
                        "https://docs.google.com/spreadsheets/d/1hzQx7IpgLziGlmh3i6T3cljdoHiw5dHIGVJWqmj0bww/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.441666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#10",
                    "likes": "0",
                    "time": "31/01/2020-20:05:50",
                    "content": "To add a little more context to those beta numbers I came up with a little CAPM graph to show what those numbers vs their historical return. To calculate the security market line in this graph i defined the “risk free rate” = DSR. All of the return numbers are based on the closing price change between 07/01/2017 - 01/26/2020  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#11",
                    "likes": "0",
                    "time": "31/01/2020-20:41:54",
                    "content": "DAI could easily be 10% of ETH cap, but today’s ETH price is not sustainable - think $1000/ETH in 2020/21. 10% of that is about 10B. That is realistic. If you have a vision to look further - you’ll see a chance that ETH becomes bigger than BTC at $10k+/coin. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#12",
                    "likes": "1",
                    "time": "03/02/2020-21:20:56",
                    "content": "As a preface, I want to say that my understanding of DAI is that it gains its value through the value of the collateral offered to mint it. That said: I’ve given this a bit more thought over the past couple of days and at this point I’m at least fairly certain that at least conceptually BAT SF should not equal ETH SF because its rate of return (RoR) is not equal to the ETH RoR. I haven’t seen much in this thread to explain to me why the BAT SF == ETH SF. IMO, we only find ourselves in this place today because setting the BAT SF == ETH SF was the simplest course of action when launching MCD. Having thought a bit more about the SF the past few days I would like to put out a strawman argument that the SF should be more or less be defined by the green line in the following graph for each asset.  That is, that the SF should equal the difference between the expected RoR for a particular asset and the desired RoR at the given risk level times the desired collateralization ratio. Whether or not beta is an adequate way to quantify risk is probably up to debate, but i think conceptually the idea is there i.e risk v return. As i see it, when demand dynamics are ignored, the SF is simply a mechanism to protect DAI against the inflation caused by the DSR which ensures that each and every DAI token remains backed by the appropriate amount of collateral. To drive this point home I’ll provide a quick example. Let’s imagine a world where the SF of all assets is 0%. All dai is backed by 2 assets types A and B. The DAI DSR is 8.75%. Asset A has a return rate of 7.75% and asset B has a return rate 9.75%. On Jan 1 I mint 100 DAI by offering up $100 of asset A and $100 of asset B. My collateralization ratio at this point is 2. I immediately lock the 100 in the DSR to begin drawing interest. At the end of the year my DAI has grown and I now should have 108.75 DAI (54.38 DAI / vault). The value of my collateral also grew over this time the $100 worth of asset A is now worth $107.75 and the $100 in asset B is now worth $109.75, but now my collateralization ratio is not 2. The 54.38 DAI that is backed by the collateral in vault A now only has a collateralization ratio of ~1.98. For vault B that number is ~2.02. However, if we change this example and charge asset A a SF of 2% we should find that at the end of the year that the DAI minted by that vault should still be backed by 2x the collateral. I’ll leave refuting my strawman as homework for the reader, but here is where I will segue into my point. Whether or not the past 3 years of price appreciation is going to be representative of the future is unknown. ETH may prove to be the better asset to hold but that too is unknown. What i do know is that ETH RoR over the past 2.7 years is not equal to BAT RoR over the past 2.7 years, and I’d be willing to bet that BAT RoR will not equal to ETH RoR over the next 2.7 years, so it seems a bit off to me that we would keep the SF for these two assets in sync. BAT over the past 2.7 years has been both a higher return and a lower volatility asset, so MAYBE I’m justified in saying that the SF should be lower. That said, I think it is ultimately up to the MKR holders to decide if I am right or not, so what i am trying to figure out at this point is what is stopping us from letting the MKR holders vote on the SFs separately. Is there a tech limitation or are we just looking for some signal to justify polling separately? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.337121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#13",
                    "likes": "0",
                    "time": "04/02/2020-11:11:35",
                    "content": "Several  remarks:   besides SF and DC there is also third risk parameter - Collateralization Ratio which can be used to mitigate both voliality and potential lack of liquidity (which will result in price  slippage)   My personal thinking about SF is more as it being a “price of DAI” Like central bank interest rates and If that is a case then it should be common for all assets since DAI is fungible and independent from it’s origin. In that case risk of an asset should be handled by Debt Ceiling and Collateralization Ratio   I must say I do not understand Your example. This one in particular would allow risk free rent - so it would operate on loss of MKR holders. I do not see correlation between expected returns on an asset and SF and if there is one, it is positive not negative. If asset is expected to increase in value then owners of this asset will be ready to pay higher SF in order to generate DAI and leverage on this asset with newly generated DAI. Historically SF was higher during bull market  (to keep DAI peg) not lower. I believe You are making false asumtion that by generating DAI against collateral You somehow give up ownership of this collateral. This is not the case. If collateral increases in value, you still 100% benefit from that increase, so You do not give up any of your profits (you can eve increase them if You used generated DAI in order to buy more collateral not to put them in DSR)   This thread looks very interesting. Are You aware of Signaling Guidelines ? Consider registering Signal Request for your proposal.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.604413702239789
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "2",
                    "time": "04/02/2020-13:47:06",
                    "content": "    Andy_McCall:  I haven’t seen much in this thread to explain to me why the BAT SF == ETH SF. IMO, we only find ourselves in this place today because setting the BAT SF == ETH SF was the simplest course of action when launching MCD.   You are correct in this assertion (although governance also voted to keep them the same, it wasn’t decided by the Foundation, see here: Signal Request / Poll: How should we structure monetary policy polls in MCD?). To be honest, the only reason BAT is in MCD at all is that we wanted to launch with two collateral types in order to test the Multi-Collateral functionality and for PR reasons (it’s in the name!) That said, I don’t think that’s a good argument for changing it separately to the ETH SF at the current time. We know it doesn’t accurately represent the risk for BAT, we know the same thing for ETH, which has also not yet had risk parameters defined for it. At this stage, we are effectively waiting for risk models to be produced by the interim risk team (@cyrus) and risk parameters proposed for both BAT and ETH. Neither of these assets is currently being priced correctly according to their risk. Both assets are being priced solely due to the requirements of monetary policy. Risk isn’t even a component yet, which is why I think your arguments here are premature. All that said, I’m fantastically encouraged that more people are contributing to the discussion around risk, so please don’t think of this as a criticism. We need people to work as part of risk teams! If you don’t mind me asking, is this a general interest of yours or is your interest limited to BAT? To be completely honest risk analysis goes over my head at this point, so you’ll have to forgive me for not engaging directly with your argument above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.894642857142856
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#15",
                    "likes": "0",
                    "time": "04/02/2020-15:57:33",
                    "content": "Let me try and clear up some of the confusion in my example. I was only trying to point out that as long as the RoR > DSR DAI can remain appropriately collateralized even in the complete absence of the stability fee. Which IMO should in theory mean that 1 DAI == $1 again ignoring the demand dynamics of the marketplace. It doesn’t really bring in factors such as the desired profit of the maker holder. You are correct in saying that maker would be operating at a loss or at best break even in that example. Nor does it bring in risk factors which also should be included in the whatever model you use to set SF. I would argue that if you expand upon that idea a bit and instead of trying break even (by making the sure you are charging enough interest to cover the DSR) you set the SF to make up the difference between the RoR of the asset and some desired RoR for the MKR holder (maybe that security market line??) then things start to change. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#16",
                    "likes": "3",
                    "time": "04/02/2020-16:46:12",
                    "content": "    LongForWisdom:  If you don’t mind me asking, is this a general interest of yours or is your interest limited to BAT?   I don’t really have any particular interest in BAT per se. I’ve only downloaded the browser since ive started looking into this . I just noticed something that seems off in the numbers and started trying to dig into the data. Where my continued interest lies is that it seems to be a fairly high return on investment question to answer. I know BAT doesn’t represent that much liquidity to bring onto the platform, but we have support for it. There are not code changes that need to happen and there isn’t a million executive votes that need to pass, so if we spend a few hours (or even days) to come up with a better number and bring on say 2-3x the liquidity that’s potentially ~ $270k this year in interest. Seems like a win to me!     LongForWisdom:  At this stage, we are effectively waiting for risk models to be produced by the interim risk team (@cyrus) and risk parameters proposed for both BAT and ETH.   I hear a lot about “risk models” in these forums, but I don’t have clarity on what exactly we are trying to produce. Is there a forum post or even an academic paper where I can go to learn more about what we are looking for from that? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1184126984126985
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "1",
                    "time": "04/02/2020-17:05:19",
                    "content": "The best person to talk to is @Cyrus, I only have a vague idea of what these are and there were some presentations at some point. Let me see if I can dig up the appropriate governance and risk meetings. Edit: Some detail here, possibly more in the meetings around this one Scientific Governance and Risk - Thursday, June 27 9 AM PST (4:00 PM UTC)     Andy_McCall:  There are not code changes that needs to happen and there isn’t a million executive votes that need to pass, so if we spend a few hours (or even days) to come up with a better number and bring on say 2-3x the liquidity that’s potentially ~ $270k this year in interest. Seems like a win to me!   This is a fair point, although it’s worth noting that we couldn’t reduce the BAT fee below the DSR without causing problems. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.7272727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#18",
                    "likes": "0",
                    "time": "04/02/2020-22:28:25",
                    "content": "    LongForWisdom:  The best person to talk to is @Cyrus, I only have a vague idea of what these are and there were some presentations at some point. Let me see if I can dig up the appropriate governance and risk meetings. Edit: Some detail here, possibly more in the meetings around this one Scientific Governance and Risk - Thursday, June 27 9 AM PST (4:00 PM UTC)    Sweet thank you so much! I’ll probably be back in a few days once i dig through this some. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.055555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#19",
                    "likes": "5",
                    "time": "04/02/2020-22:31:23",
                    "content": "Hey @Andy_McCall  thanks for that really great analysis. Certainly exploring betas and daily volatilities is one avenue towards assessing risk. As others mentioned, however, we are opting to take a slightly different approach. While it is counterintuitive, a market risk approach (such as the one you have used using CAPM and such) is less appropriate given the CDP nature of MakerDAO. Instead, a credit risk analysis is (in our view) more applicable. So daily volatility becomes much less of a factor as opposed to risk of a CDP defaulting, which occurs due to sudden and sharp drawdowns in a collateral asset. Daily volatility is less useful for anticipating these sudden drawdowns, versus some other approaches (such as just basic fundamental analysis). So while BAT may have a lower daily vol over the past 3 years, or a higher expected return, it is (likely) to have significantly higher risk of a sudden drawdown. (In a credit risk model, you might liken this drawdown to a probability of default and the loss given default). A simple counterexample that I like to use a lot is Tether. USDT has incredibly low volatility, but that does not make it a safe collateral type for MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357700892857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#20",
                    "likes": "0",
                    "time": "05/02/2020-14:43:30",
                    "content": "Hey @LongForWisdom - is there a reason why the protocol does not allow an asset SF to be less than the DSR? I can imagine a number of conditions where we would want a particular asset to have a SF lower than the DSR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#21",
                    "likes": "0",
                    "time": "05/02/2020-17:13:35",
                    "content": "The protocol allows it (that’s my bad I need to be more clear in what I’m saying), but so far as I can tell it’s rarely a good idea. It means that the asset is being subsidised by other assets or by MKR Holders. Fair enough, there might be a business reason to do this. More problematic is that is allows Vault holders to lock their money, mint Dai, and then lock that Dai in the DSR to receive the balance of the DSR - SF Rate, this creates ‘parasitic’ Dai that costs the protocol income without providing us with anything in return. It doesn’t increase the Dai supply directly, because the new Dai would be locked in the DSR, and out of circulation. There is no reason not to do this when DSR - SF > the interest rate for the asset on other platforms. Hypothetical example: DSR at 5%, Eth SF at 2% Users can:  Lock Eth Mint Dai Lock Dai in the DSR. Gain 3%* on their Eth with the only downside being the risk of liquidation.  *It’s not actually 3% because you need to take into account the collateralization ratio, in this case I think it’s max 2%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6737012987013
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#22",
                    "likes": "0",
                    "time": "05/02/2020-20:38:11",
                    "content": "I think -0.25% DSR spread option should be allowed in polls today. MKR holders should decide if it is acceptable or not. I believe the protocol should also have a safety switch which would revert to last (positive?) DSR if the current DSR causes MKR minting because of the negative spread AND high DSR utilization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.087272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#23",
                    "likes": "0",
                    "time": "05/02/2020-20:51:40",
                    "content": "    bit:  I think -0.25% DSR spread option should be allowed in polls today.   Why? -0.25% is not that different from 0% spread.     bit:  I believe the protocol should also have a safety switch which would revert to last (positive?) DSR if the current DSR causes MKR minting because of the negative spread AND high DSR utilization.   I think you mean DAI minting, not MKR minting. In any case, it would be hard to determine whether people were taking advantage of the risk free return. One address might own the CDP and another address might be earning DSR on the DAI. The only way to know for sure is to remove the possibility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4096275252525245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#24",
                    "likes": "6",
                    "time": "06/02/2020-05:35:17",
                    "content": "I’m back and I have more numbers! ok so I’ve looked through @cyrus slides and done the bare minimum amount of research that i could into the merton model. Wanted to explain my methods and discuss my findings. Wanted to get peoples critiques. Ok first the TLDR. My methods are probably too over-simplistic to be certain, but based on the numbers i came up with it may be the case that BAT_SF < 9% but it is also the case that BAT_SF > ETH_SF. Ok so now the boring part! Numbers! Let me talk through my methods for solving the Merton Model (there were probably plenty of the things i did were suspect).  just like in my CAPM model above i set the risk free rate == DSR. i am basically treating the whole of the debt ceiling for each asset as 1 big CDP, and that the DC for each asset == K V = CR * K I also had a constant CR == 2 * LR == 3 You can find my work here. Like i said there is probably a few things i have gotten wrong. I encourage anyone who is interested to take a look.  Those simplifications noted you should probably just look at any of the numbers below as (at best) a ballpark estimate. Ok so what did if get for my SF calculation? Well the first numbers I’ll give you is cyrus’s method where I calculate the ln(Risk free CDP / Risky CDP) = SF. Using this method i found the SF_BAT should be ~ 5.58%. Hey its lower right!?!? Well news isn’t so good i also found that ETH have a SF ~4.04%. Knowing that, maybe the argument is over BAT_SF > ETH_SF, and all of my numbers are measurably too low so who cares? Well I personally found the model used to calculate those numbers a little too simplistic bc it doesn’t take the market risk premium into acount. However, i found a metric that i can derive from K, V that does take those two factors into account and seems more in touch with the current SF votes; Expected Return on Debt (RoD). Using that CAPM graph from earlier i found those numbers for each asset to be RoD_ETH ~ 18.08% and RoD_BAT ~ 10.61%. Maybe my original argument still stands? Just doing a quick gut check both of these numbers seem like better candidates for SF given how the executive votes since MCD launch have been pushing the SF from ~ 4% -> 9%. So time for new questions!  Firstly, any criticism into my methods are always welcome. Secondly, and most importantly in my opinion, how is the foundation trying to incorporate the “market risk premium” into their risk model? Obviously i know the “risk model” is a work in progress, but any pointers to reading i can do would be very appreciated.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.99845263863121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#25",
                    "likes": "6",
                    "time": "06/02/2020-06:06:58",
                    "content": "Hey, awesome work! Kinda surprised you went back and looked at slides lol. So, we’ve come a bit of a ways longer since we presented those slides, but yeah that’s is the gist of it. Here are some additional thoughts/ considerations.  There’s really no good justification for what the crypto risk-free rate should be, although I am expecting some super-quants to come in and make some solid justifications for something or another. In the end, it doesn’t matter though as the drift ends up having minimal impact on the outputs. we have broken up the CDP distribution into buckets instead of 1 giant CDP, which allows for some additional granularity. Instead of using a constant CR, we incorporate a behavioral function that allows for users to adjust their CR over time (users tend to add collateral or wipe dai on selloffs, and vice versa on rallies).  There are also two additional critical features we have been incorporating.  liquidity risk means that there is additional slippage to be incurred upon liquidation the merton model does not include jump risks, which we view as critical to the model. so we add an additional jump component to the basic stochastic model. The parameters of the jump component can be estimated using a fundamental analysis framework for the collateral asset.  Finally, there is a slight difference between CDP pricing and CDP risk management. While the model you describe is for an average or expected stability fee rate, we need to take a few extra steps for the scenario analysis. So we’re doing a value-at-risk analysis that helps inform us what the max theoretical debt ceiling can be. Would love to get your input on any of the above. Unfortunately we haven’t published too much stuff yet regarding what i’ve said, but hopefully in the next few weeks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.15432098765432
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#26",
                    "likes": "0",
                    "time": "06/02/2020-13:46:06",
                    "content": "    psychonaut:   I think -0.25% DSR spread option should be allowed in polls today.  Why? -0.25% is not that different from 0% spread.   So is +0.25% not much different from 0 but it exists in the poll. Perhaps we could round all spreads to 0.5% or even 1%. I believe that small increases/decreases are not efficient at all at this DAI supply.     psychonaut:  I think you mean DAI minting, not MKR minting.   No, I mean MKR. When the income from SF is not enough to pay for all DSR - new MKR is minted and sold to keep the system afloat.     psychonaut:  it would be hard to determine whether people were taking advantage of the risk free return.   It’s not a risk free return. I don’t think it’s worth locking 150% collateral to get less than 0.25% profit a year but some people will probably try that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.061350108225108
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#27",
                    "likes": "0",
                    "time": "06/02/2020-18:40:02",
                    "content": "    cyrus:  There’s really no good justification for what the crypto risk-free rate should be, although I am expecting some super-quants to come in and make some solid justifications for something or another. In the end, it doesn’t matter though as the drift ends up having minimal impact on the outputs.   Yeah i know, but the DSR seems to me to be about as good of starting place as anything else would be. Maybe you could come up with an index that incorporates the some yield numbers from other stablecoins? Coinbase is paying something for holding USDC iirc. Still might not be any more useful though     cyrus:  the merton model does not include jump risks, which we view as critical to the model.   I do have some thoughts on jump risk. I assume what we are trying to do there is quantify the likelihood of some sort of black swan event and price that number in somehow. I could see how that would be a very useful number for overall VaR analysis, but I question how relevant it is to the stability fees charged for an asset. Firstly, my intuition says that the premium we would end up charging for “jump risk” probably could be measured in the 10s of basis points if not single digits. Secondly, it seems like even if I could quantify the risk and decided the premium was significant enough to start charging for, the protocol doesn’t appear to have a great way of storing that value for a rainy day. Maybe you could assume that the MKR holders would take the extra money and set it aside, but it seems like we would need the facilities to earmark that premium for some sort of insurance fund. Maybe put it into some non-dai stablecoin? Maybe buy some off-chain asset like a 10y T-note? Again this is only an opinion but is seems to me that the “best” risk management strategy as it pertains to black swan events in the crypto market is going to be bringing in off-chain assets as DAI collateral, but I’m sure that is going to be a fairly large effort that brings in a ton of questions concerning how to appropriately decentralize it or price in the counter-party risk. For the time being (and probably for the next few years) the fate of DAI seems very intertwined with the fate of crypto generally. Meanwhile though MKR is trading at ~90 PE ratio (Ben Graham would not approve), so it seems to me that seems to me that we should be more interested in getting earnings up for the sake of the MKR holder. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.947979797979798
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#28",
                    "likes": "0",
                    "time": "06/02/2020-20:12:09",
                    "content": "    Andy_McCall:  the protocol doesn’t appear to have a great way of storing that value for a rainy day.   Yes it does. MKR’s value is the insurance fund. In the event of a default, MKR is minted and sold to buy back any DAI that is not backed by locked value.     Andy_McCall:  so it seems to me that seems to me that we should be more interested in getting earnings up for the sake of the MKR holder.   Absolutely, but BAT isn’t enough. I’m eagerly waiting to hear about onboarding more assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.607142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#29",
                    "likes": "3",
                    "time": "06/02/2020-20:20:59",
                    "content": "    Andy_McCall:  the protocol doesn’t appear to have a great way of storing that value for a rainy day.   that’s what the surplus buffer is for  In the medium term, there will also hopefully be ways to hold off-chain assets such as treasuries. Your intuition is spot on. Regarding jump risks, currently they come out to be a super low charge, but that’s primarily because of just how overcollateralized the eth vaults are. When makerdao starts becoming more competitive, the liquidation ratio will fall, and the jump risks more pronounced, and thus the stability fee will be more distilled. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.741666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#30",
                    "likes": "0",
                    "time": "08/02/2020-18:32:54",
                    "content": "Hey guys still out there working on figuring out that expected return number up there. I have a new method drawn up but its gonna take me a little while to code up before I can be back with more numbers. There have been some replies that i wanted to address while im working on that though.     cyrus:  that’s what the surplus buffer is for    Yeah i mean i guess. I think the idea of: storing dai to save dai/mkr in the event of the collapse of the dai system seems a little suspect. Also $500k seems like not be enough of a cash infusion to really keep us afloat in the event of a black swan happening. That said I’ve seen talks about the treasury happening around the forum. Im really intrigued by this idea of streaming money constantly to the treasury. Hopefully we can get some sort of a proof of concept up around that soon. On that note:     psychonaut:  MKR’s value is the insurance fund.   I think with the kind of jump risk the foundation is trying to estimate it might be a little naive that such an event would not affect the MKR price as well. Think BTC < $100. We would be talking about a 2008 style financial crisis in the crypto markets. ETH price would plummet as well and likely so too would MKR.     cyrus:  Regarding jump risks, currently they come out to be a super low charge, but that’s primarily because of just how overcollateralized the eth vaults are. When makerdao starts becoming more competitive, the liquidation ratio will fall, and the jump risks more pronounced   This idea that jump risk will be more pronounced isn’t really tracking with me. Ok so if the default probability is main factor driving price of the SF and you accept my premise above that the CR of a CDP is some function of the LR it seems to me that lowering the LR is going to drive up default probability. If we are saying the jump risk premium ends up being “a super low charge” with the liquidation ratio set to 1.5 wont it just be more insignificant when the LR is ~1.01? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.673239750445633
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#31",
                    "likes": "1",
                    "time": "08/02/2020-18:42:12",
                    "content": "    Andy_McCall:   that’s what the surplus buffer is for   Yeah i mean i guess. I think the idea of: storing dai to save dai/mkr in the event of the collapse of the dai system seems a little suspect. Also $500k seems like not be enough of a cash infusion to really keep us afloat in the event of a black swan happening. That said I’ve seen talks about the treasury happening around the forum. Im really intrigued by this idea of streaming money constantly to the treasury. Hopefully we can get some sort of a proof of concept up around that soon. On that note:  MKR’s value is the insurance fund.  I think with the kind of jump risk the foundation is trying to estimate it might be a little naive that such an event would not affect the MKR price as well.   I don’t understand how you distinguish between the surplus buffer ($500k) and MKR’s value and “a treasury” (with or without streaming). As far as I can tell, all these are fungible forms of value storage.     Andy_McCall:  Think BTC < $100. We would be talking about a 2008 style financial crisis in the crypto markets. ETH price would plummet as well and likely so too would MKR.   Yeah, of course. That’s why we’re having a conversation about risk and conservative risk parameters. We have some backstop against black swan events, but it’s not infinite. And it will never be infinite. Risk management is the name of the game today and in the future. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.827546296296296
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#32",
                    "likes": "5",
                    "time": "09/02/2020-21:38:31",
                    "content": "    Andy_McCall:  Yeah i mean i guess. I think the idea of: storing dai to save dai/mkr in the event of the collapse of the dai system seems a little suspect. Also $500k seems like not be enough of a cash infusion to really keep us afloat in the event of a black swan happening. That said I’ve seen talks about the treasury happening around the forum. Im really intrigued by this idea of streaming money constantly to the treasury. Hopefully we can get some sort of a proof of concept up around that soon.   I don’t know how suspect it is, but I do think it’s a good idea to diversify the buffer outside of Dai. While Dai is the only thing you need to cover bad debt, it feels a bit weird for MakerDAO to hoard a chunk of the Dai supply. There have indeed been various proposals for some sort of treasury, and I think some people inside the Foundation are working on a plan as well (although I am not really involved with that initiative). $500k is also certainly not enough. I was hoping we could put out some models to calculate more meaningful numbers before we hit that amount, but unfortunately it did not happen. As we scale, that surplus will need to go much, much higher. Additionally, there are some technical concerns about the behavior of the surplus in regards to emergency shutdown, and we’re still working through how to remedy that. So for now, the surplus is just kind of up in the air. The jump risks do affect MKR as well, of course, and we have built in a steep discount to the spot price as an input parameters (close to 80-90% IIRC). $500 mil market cap certainly doesn’t mean $500 mil of insurance.     Andy_McCall:  This idea that jump risk will be more pronounced isn’t really tracking with me. Ok so if the default probability is main factor driving price of the SF and you accept my premise above that the CR of a CDP is some function of the LR it seems to me that lowering the LR is going to drive up default probability. If we are saying the jump risk premium ends up being “a super low charge” with the liquidation ratio set to 1.5 wont it just be more insignificant when the LR is ~1.01?   The jump risk premium goes up as the LR falls, right? The SF is ultimately a function of losses. Lower LRs lead to more harmful jumps. Right now with a high LR, the jumps just aren’t large enough to trigger any losses (hence why we’ve never had an undercollateralized Vault). We’re more likely to see this with a lower LR. Maybe I’m misunderstanding your point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.552540650406504
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#33",
                    "likes": "1",
                    "time": "10/02/2020-09:18:37",
                    "content": "    Andy_McCall:  Yeah i mean i guess. I think the idea of: storing dai to save dai/mkr in the event of the collapse of the dai system seems a little suspect. Also $500k seems like not be enough of a cash infusion to really keep us afloat in the event of a black swan happening. That said I’ve seen talks about the treasury happening around the forum. Im really intrigued by this idea of streaming money constantly to the treasury. Hopefully we can get some sort of a proof of concept up around that soon.   As far as I’m aware in current setup surplus buffer should not be arbitrarily large because in case of emergency shutdown it goes to dai holders and that may screw incentives if it will be too large in comparition to dai supply. But truth be told probably in an event of sudden market crash DAI buffer is probably better backstop against undercollateralisation than minting MKR and hoping there will be suffficient demand for them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.337301587301587
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#34",
                    "likes": "0",
                    "time": "10/02/2020-10:02:11",
                    "content": "Yes, Rune talked about it in ‘treasury topic’. I assume buffer size was sized for circa 100m DAI supply. If we assume we don’t want to change the ratio, we could easily double to 1m if supply goes to 200m. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#35",
                    "likes": "3",
                    "time": "13/02/2020-08:39:49",
                    "content": "Just wanted to give an update since I’ve been silent for the past few days. I’m working on a program to get a better look at the debt that is backing dai so i can refine my previous answer to be a bit more reflective of reality. That said, as it turns out jumping into blockchain development is harder than i expected it to be, so progress has been slow. Stay tuned for updates on that front. I’m hoping that soon i’ll be able to give my own closing thoughts on this topic. In the meantime you can watch my progress and struggles here: https://github.com/tamccall/dai-vaults. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.446969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#36",
                    "likes": "2",
                    "time": "13/02/2020-08:57:31",
                    "content": "If You need any help with a blockchain part PM me, will be happy to help You. I do not know a lot about risk analysis, but if a challenge is to get data from MakerDAO smart contracts then I can easily help. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.412698412698413
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#37",
                    "likes": "1",
                    "time": "13/02/2020-08:59:38",
                    "content": "    Andy_McCall:  I’m working on a program to get a better look at the debt that is backing dai so i can refine my previous answer to be a bit more reflective of reality. That said, as it turns out jumping into blockchain development is harder than i expected it to be, so progress has been slow.   Ideally, you should not need to deal with intricacies of data retrieval from the blockchain. I don’t feel confident enough about my understanding of data representation, but it seems you are dedicating a lot of effort on tasks not related to your core objective. Does anyone else feels this is significant barrier for attracting people interested in analysis and it’s worth exploring further? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.886111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#38",
                    "likes": "6",
                    "time": "16/02/2020-22:44:25",
                    "content": "Hi guys, it’s been a bit since my last post and I wanted to give an update on my findings. …So after calculating the expected return on debt (rD) number from before and finding that it seemed to approximate what we have been seeing in the executive votes i decided to refine my model a bit to hopefully reduce the difference between our calculated sf and the calculated actuals. To do this I decided to not model each collateral type as one large cdp and instead find the weighted average rD for each individual CDP. You can find the source code of the program i made to do this here: https://github.com/tamccall/dai-vaults. Looking at the CDPs individually did make a small difference for my rD calculation. Using the same CAPM parameters from before. I found that the rD_ETH to be ~14.7% and the rD_BAT to be ~9.04%. Although, You can probably take those numbers with a grain of salt though as they are very dependent on how you determine the market risk premium for eth and bat respectively. As I said earlier between the time periods of Jun 1, 2017 - Jan 26 2020 ETH had an annualized return of about -10% that said if you look at ETH over the period of 2016 - 2020 you’ll come out with very different numbers, and of course all of these numbers are based on past returns which are not necessarily correlated with the future. A second criticism might be the usefulness of rD itself. Should a better metric be used to help inform stability fee votes? I’m unsure. Ultimately having gone through this exercise I have come away with 2 main takeaways.  Maker should probably consider making the underlying debt portfolio easier to access The way we vote on spread seems a bit backward to me.  First I’ll tackle what is probably the first of the most controversial of those two assertions. If you notice in both my models above to calculate an estimate for SF one of the first things that we need to know is the “risk free rate” (rf). Now, if you accept my premise that the rf in the crypto market is == DSR then it seems odd to me that we first decide on SF and then subtract a few basis points from there to determine DSR. Given a rD number in the model above along with the input parameters sans rf (K,V, etc). I would have a hard time arriving at rf that was used for calculation. It is much easier to calculate the former (rD) from the latter (rf). Likewise, it seems to me that maker voters should probably be setting stability fees based on the DSR and not the other way around. My last point was touched on a bit earlier by @jernejml , but I’ll drive this home as my biggest take away from this exercise. Although it is public information, looking at the underlying debt portfolio of maker is certainly not a trivial task to do. I am a software engineer and a “money enthusiast,” so with a little help from @Adam_Skrodzki I was able to get the data I was looking for. For most people, however, I would imagine writing a javascript program to query the ether blockchain is just too much of a barrier of entry to cross. Could be keeping out people with more of an economics background from adding their input on the protocols risk. Perhaps the foundation might consider publishing certain datasets in easy to consume formats such that independent analysis need not be such an undertaking. I could imagine something like a weekly snapshot of the debt portfolio linked from makerdao.com. Maybe I’ll put together a signaling request around the later at some point. That said, I may come back to this topic at some point in the future, but I think I’ve spent enough time trying to figure this out for now! ",
                    "links": [
                        "http://makerdao.com",
                        "https://forum.makerdao.com/t/governance-initiative-open-grafana-dashboard/1376/4"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.334874574829932
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#39",
                    "likes": "2",
                    "time": "03/01/2021-12:29:04",
                    "content": "I am reviving this old thread after about 1year  Currently, the SF of BAT is 8% (3rd of Jan 2021). There only a couple of tokens with the same or higher SF, namely: MANA (10%) and YFI-A (9%). This seems objectively a bit weird.  BAT has been the first ERC20 to be added to MCD, because it was considered a serious project back in 2019. The Brave company has been building up since then, so I guess the evaluation should be the same. See, e.g., consistent growth-over-time of the BAT purchases from Brave: https://twitter.com/BraveSampson/status/1344378924567035906/photo/1  BAT token holders have grown 4x (from 100k to 400k) in the last 24 months. The price of BAT has been very stable, between 15 cents and 35cents over the last few years (now it is 20cents).  Question: What is the general sentiment here towards reducing the SF of BAT to, e.g., 4%? Note: The amount of BAT in Maker is kind of negligible vs other tokens (2.8 millions). But this, imo, should not imply that we do not care about it and/or disincentivize its usage in MCD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.486742424242425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#40",
                    "likes": "0",
                    "time": "03/01/2021-18:35:06",
                    "content": "I’ll add my two cents here since i originally posed this question. I’ve been messing around a ton in recent weeks with the collateral risk model built by @Vishesh. The numbers I am getting currently for BAT would indicate that the expected loss on BAT is around 5.93%. So IMO the 4% number quoted above is probably a little too low, but there would be some room to decrease the fee if that were desirable. Ultimately it just boils down to where we want our margin spreads to be. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.9621913580246915
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#41",
                    "likes": "0",
                    "time": "03/01/2021-20:34:44",
                    "content": "The primary reason was stated in the recent SF changes proposal. Basically it is because the LR is 150% instead of 175% for most others of comparable assets. If we want a lower rate, we should be adding a variant with a higher CR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#42",
                    "likes": "0",
                    "time": "03/01/2021-21:28:24",
                    "content": "Thank you both for the answers.     Andy_McCall:  Ultimately it just boils down to where we want our margin spreads to be.   My impression is that we should:  be safe, i.e., have a SF that agrees with the risk model and is sufficient to cover the risk. So, accordingly with what you said, SF > 5.93%. Calculate both the ‘margin’ and the ‘total debt’.  Regarding the current example of BAT which we are discussing discussing, we have SF=8% and 2.8m DAIs. If setting the SF=6% would bring up the amount DAI minted to 6m, that would be a clear gain in terms of total fees earned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.317460317460317
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#43",
                    "likes": "1",
                    "time": "03/01/2021-22:31:49",
                    "content": "When I was referring to margin before I was really referring to “profit margin.” Meaning if you have an expected loss of say 6% well that’s pretty much the minimum you have to charge, but you may well want to charge 8% so you could pocket the 2% difference. As far as whether or not dropping the SF 200 bps is a “clear gain” that’s probably debatable just depends on what your goals are. If the goal is more DAI issued then yeah I think it’s worth considering, but if your goal is profit that might be another story. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.96875
                }
            ]
        }
    ]
}