{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dai-crisis-control-negative-interest-rates-debt-repayment-mechanism/1677",
            "title": "DAI Crisis Control, Negative Interest Rates, Debt Repayment Mechanism ",
            "index": 1677,
            "category": [
                "Governance"
            ],
            "tags": [
                "covid-crash",
                "negative-rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/adamluc",
                    "index": "#1",
                    "likes": "0",
                    "time": "18/03/2020-03:34:41",
                    "content": "Hi All, I am a long-time user of the MakerDAO system, and for MakerDAO to become a viable solution for a globally decentralized stablecoin, a few items need to change:  Provide a way for negative interest rates to be used in the system, so in a crisis, the DAI price can be incentivized to return back to its peg of $1.00. Although the addition of USDC I suspected was going to come at some point, there are other options. If Vault owners lose money due to a system glitch, they should be re-paid. The argument that Maker is an experiment is not a reason with the release of MCD. What I propose is a way for Vault owners to be paid back for lost funds due to system related issues, which can be tracked via the blockchain. One way this could work is with having a portion of the interest paid from Vault Owners into a debt pool, that is then fed into target vaults until the lost funds are = 0.  The above two items I believe could help instill confidence into MakerDAO and provide a pathway for it to manage in times of crisis in a better way, and additionally allow Vault Owners to trust that their funds are safe. ",
                    "links": [],
                    "GPT-summary": "The author of the post is proposing changes to the MakerDAO system to make it a viable solution for a globally decentralized stablecoin. The proposal includes providing a way for negative interest rates to be used in the system, repaying Vault owners for lost funds due to system-related issues, and creating a debt pool to track lost funds. The post also invites feedback and questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.932692307692308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/03/2020-11:50:05",
                    "content": "I’m in favor of repaying vault owners, but I’m against negative interest rates. Negative interest rates break the concept that DAI is a stable value store. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ta32",
                    "index": "#3",
                    "likes": "2",
                    "time": "18/03/2020-12:00:21",
                    "content": "I requested a governance poll to make it that negative rates are against the social contract of DAI. People will simply move DAI out of the DSR contract and only applying negative rates to reduce the supply of DAI of people who forgot to. This is a pathetic move DAI holders should not need to actively monitor every governance action to ensure their savings in DSR are not being depleted. The social contact of DAI should be, that DAI attempts to peg to the value of the US dollar and there will be no negative rates ever. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#4",
                    "likes": "3",
                    "time": "18/03/2020-13:07:48",
                    "content": "I think negative interest rates are an undesired side effect of the present fiat banking system, not a natural feature that all financial systems share. When the fiat system combines the features of  fractional reserve credit expansion low demand for credit due to opportunity stagnation quantitative easing  then as a result of the above you get negative interest rates in certain economies. None of the above applies to crypto so I don’t see why Maker should consider this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.7196428571428575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#5",
                    "likes": "2",
                    "time": "18/03/2020-13:47:51",
                    "content": "    psychonaut:  Negative interest rates break the concept that DAI is a stable value store.   Prolonged periods when DAI is off the peg break the very definition of a stablecoin.     ta32:  The social contact of DAI should be, that DAI attempts to peg to the value of the US dollar and there will be no negative rates ever.   The social contact of DAI should be a decentralized dollar-pegged stablecoin. You should only be able to trade 1 DAI for 1 USD and that’s it. Everything alse is a distraction. The DSR is not a part of the social contract - that’s an add-on. If you have $1 in a bank - you can have a negative rate. If you have $1 in cash - there are expenses and risks holding that cash so basically you lose value both ways. DAI is a part of the ETH ecosystem. 1 DAI cannot be exactly 1 USD because when you spend it - a network fee is deducted.     Planet_X:  I think negative interest rates are an undesired side effect of the present fiat banking system, not a natural feature that all financial systems share   It might simply not be possible to maintain the peg without unpopular measures. It seems to me that between the $1.00 peg and no peg - you will choose no peg because of something that is not in a social contract but it seems “right”.     Planet_X:  so I don’t see why Maker should consider this.   Because we cannot wait forever for the peg to return. If the current measures are not working in short term (days/weeks) then Maker should consider everything that might help. If the peg is not the priority in this system then what is a priority? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.078703703703704
                }
            ]
        }
    ]
}