{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/my-journey-at-makerdao-through-a-new-lens/20221",
            "title": "My journey at MakerDAO through a new lens ",
            "index": 20221,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/synesthesia",
                    "index": "#1",
                    "likes": "10",
                    "time": "19/03/2023-23:11:49",
                    "content": "Hello MakerDAO community! It’s been a while since I parted ways with the SES Team. What a journey it was! Meeting so many kind and bright minds and people wholeheartedly devoted to creating a new world of stable cryptocurrency. To be honest, I have tormented myself over and over for months, trying to fully grasp the reasons behind me having to leave the team, having spent over a year in this environment that was on one hand exciting on the other technically overwhelming and mentally challenging. My struggle does not start with Maker though. The entire past decade, I’ve been trying my best as an entrepreneur and it was as expected - tough. Design and development was easy.  80 hours a week at work, no problem. But when the product was ready, when it was time to scale, I would hit the wall. Every time, with every project I did. So I’d often end up demotivated and depressed.That “lack of luck” as I called it started to overshadow my innate need for creativity. It started impairing my self-esteem like a iron ball attached to a leg.  All I knew was I had problems with staying focused and that people at work would often make me feel like an impostor. Recent months have been really challenging for both my work-life and the more personal side including relations with others. My relationship started to degrade quickly (to spice things up, my gf has BPD). A week before quite hopeless I still had no clue what’s wrong. But a few days ago a picture started to emerge regarding my seemingly maladaptative traits that had been such a pain in the ass pretty much all my life (yet I didn’t realize their harmful nature). I quit stimulants, alcohol, cigarettes, went to therapy, read tons of self-help books and intensely looked for a cure. Last week, at 41 I got diagnosed with intense attention deficiency and hyperactivity disorder (or ADHD). Hearing of it, most people picture an hyperractive 9-year old failing to adapt to the schooling system. But this condition stays with you pretty much all your life. You can try to adapt, mask it, deny it, but it won’t go away. For an adult, such diagnosis needs time to sink in. ADHD is an inherited condition, but when going on undiagnosed, usually causes a person to develop other, sometimes severe disorders due to intense feeling of inadequacy. Your closest friends and relatives start to stigmatize you for your behaviour early on - lack of attention, forgetfulness, making the same mistakes all over, being too sensitive, failure to finish more challenging tasks, lacking motivation or not being bold enough to take on an important role. On top of that, roughly 30% of addiction treatment wards are people with ADHD. We constantly need new stimuli and we need to be able to finally relax, being pretty much 24 hours in a ferrari with bicycle brakes. Been there too.  As a person with ADHD you try as hard as you can to level up, to be like others, to remove the stigma. All in vain. Brains of people with ADHD are wired differently. While for others, it is normal to be either in TPN (task positive network) state or DMN (default mode network) state, in us, these networks are both competitive. You are at the same time focused on the task at hand, while being constantly distracted by unrelated thoughts and products of imagination. Interestingly traits in ADHD are polarized. For every negative trait, there is an opposite trait that neuronormative people don’t have. You procrastinate work, but when excited by it, you go into hyper-focus and can spend hours on the task with powerful results, losing notion of time whatsover (usually also being late to your next meeting). Because of the TPN-DMN concurrency, you get strokes of creativity pretty much all the time, but can’t fully carry out a complex task without support, as things become just way too overwhelming very quickly. While we are born leaders, as we seek novelty, are risk-prone and enjoy sense of appreciation, we are afraid to fully embrace the role of a leader. We are afraid of being rejected many times more than an average person. At least until we are finally diagnosed. Once you are, you’re gaining a whole new perspective on your entire life. Suddenly the dots can be connected and your maladaptation is no longer your shame and blame. No matter how hard you try, there is no way to stop forgetting, fix your inattention or lower sensitivity. But you can start coping with the condition knowing your limitations and making use of your talents, which we have many. Like many people with ADHD I had many jobs, started many projects, invented and co-created products which were unique and in essence were also selling, but…I understand now that all of them were subconscious projections to make my own life better - increase the sense of belonging (social platforms) or improve productivity and sense of time (Timeqube). And yes, we also perceive time differently hence being late so often. Now I understand, I was really creating products for people with ADHD. I’d like to thank the entire SES team for bearing with me such a long time. I now understand how frustrating some of these traits must have been. Making stupid mistakes, avoiding to step up as a meaningful contributor for the DAO, failing to pay attention in the meetings, being slow on the overall learning curve. The SES experience, though challenging, finally pointed me in the right direction, so in that sense this was a truly priceless gift. I’ve written this post as I personally needed a closing to the SES journey and finally stop beating myself up for how it ended. I am grateful to @wouter @lenkla @retro @layerzero @Sarah @juan , Jack and @Claudia_Rivero  for the patience and always being kind and helpful (hope I didn’t miss anyone, but if I did, at least it’s clear why ;). Currently I’m working on an AI that helps remote teams detect socio-cultural bottlenecks by analyzing meeting recordings. This includes insights into sentiment, balance, interactions etc to help diagnose problems such as lack of inclusion, burnout, falling group energy, speaker imbalance and hopefully many psychological flags that need leader’s and team’s attention for the team to be sustainable. Soon we’re launching a self-service demo at https://meetra.ai I’m also expanding my other gig called 0xBreathe - regular breathwork sessions online for everyone who wants to relax their mind and body, release emotions and tap into brain’s incredible neuroplasticity for creativity and genuine insight. The metaverse is a constant flood of stimuli and here mental self-care is more important than ever. I’m also experimenting with ADHD patients, as a lot of emerging research point to a positive link between this condition and using breath based relaxation techniques.  If you feel like trying, you’re most welcome to join my Sunday sessions (19:00 CEST) And, though I’m forgetful, I never forgot how to facilitate teams and guide them through their scrum lifetime, so if there’s ever a need for this kind of expertise, please feel free to drop me a line (synesthesia#5763) and I’ll be happy to help. This time more consciously and finally without fear. With 10% of population being neuroatypical there is a chance, with over 5000 members in this forum around 500 will statistically live with ADHD. Many undiagnosed and unconscious of both the burden and the opportunities it brings. I’m starting to feel there is a new life opening up and so can anyone like me. Thank you and good luck everybody! Andy / Synesthesia ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7944582449616
                }
            ]
        }
    ]
}