{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/recovering-accidentally-burnt-sai-before-its-forthcoming-shutdown/1393",
            "title": "Recovering accidentally burnt SAI before it's forthcoming shutdown ",
            "index": 1393,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "mcd-migration",
                "tech-support"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/callumzone",
                    "index": "#1",
                    "likes": "1",
                    "time": "05/03/2020-11:52:03",
                    "content": "Hi all, I’ll get straight to the point here. Back in September 2019 I unfortunately encountered a bug in Metamask and/or the Nuo Network Dapp that mistakenly sent 57,729 SAI (DAI at the time) to the 0x00 burn address instead of the Nuo Network deposit address. The process was automated through the Nuo Dapp and in one confirm transaction click the SAI was gone. None of these funds were ever recovered, although I have been told solutions were implemented by Metamask to stop this bug ever occuring again. My question to you - is there anyway to recover these funds or reverse this transaction before the eventual SAI shutdown? Transaction shown below: - https://etherscan.io/tx/0x2083f7492a38fc2b6c1200d3b528fbd0dffa51d406e254a7fd9a67b6ba5dec36 Thank you for your time, Callum ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/galabasquer",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/03/2020-12:40:35",
                    "content": "I think we have discussed this in the chat back on that time, but unfortunately is not possible to recover those funds. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#3",
                    "likes": "0",
                    "time": "05/03/2020-17:02:55",
                    "content": "Hi @callumzone, Welcome to the forum MakerDAO Feel free to introduce yourself here : The Official Welcome Thread To answer to your question, You should open a New Issue on Github about your problem in the Metamask repository… This is not a MakerDAO problem, but a Metamask problem, nothing here unfortunately will help you to find back your funds, sorry about this. ",
                    "links": [
                        "https://forum.makerdao.com/t/the-official-welcome-thread/771"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.710227272727273
                }
            ]
        }
    ]
}