{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rep-how-to-do-rep-as-a-collateral-type/105",
            "title": "[REP] How to do rep as a collateral type ",
            "index": 105,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/joeykrug",
                    "index": "#1",
                    "likes": "4",
                    "time": "10/07/2019-18:24:52",
                    "content": "There are two ways to solve this problem:  Have CDPs be wrapped REP where the Maker governance system decides which fork all REP in CDPs goes to.  As a CDP holder, if you don’t like this risk, you can simply close out your CDP before the fork occurs and REP has to be migrated and make your own decision. Anyone holding REP is aware of forking risk anyways, although I imagine some lazy people will be happy to just follow w/e Maker governance decides for any CDPs that weren’t closed pre-fork.  Doing it this way would get the best of both worlds for sophisticated users and for unsophisticated ones, but is a bit more complex  Another option would be for Maker governance prior to a fork (it’s public / well known when this is with at least 60 days warning) to reduce the amount of REP CDP debt that can be taken out and/or raise rates on rep and eventually liquidate people who don’t withdraw just prior to a fork. Doing this there’s no “rep can go to 0” issue and none of these issues are relevant and it can be done with 0 modifications to the way Maker already works in MCD  With option 2, Augur / Reporters / REP holders already have to be aware of this risk and paying attention to it, and getting liquidated is far better than losing all your rep due to not participating in a fork, so it’s fine from both a Rep holder end user perspective and a Maker perspective. For Maker, this option doesn’t require any changes to how Maker works already IMO rep adds diversification to Maker as one of the few ERC20 collateral types where the creators cant unilaterally steal funds / update the contract arbitrarily. This would add very minimal complexity relative to the benefits of including REP as a collateral type imo, and in the case of option 2, basically no additional complexity. With risk limits, I don’t think the arguments against rep as a collateral type are relevant. Risk is like water, drink too much and you die, but appropriate amounts and different types of risks can be perfectly fine! If maker governance cannot handle a rep fork via either migrating to the correct universe or simply adjusting the risk parameters of rep leading up to a fork, then there is essentially a 0 chance maker governance will be able to handle monetary policy, as the latter is 1000x more complicated. Everyone betting on MKR (myself included as a MKR holder) believes it can do the latter, so I believe it can certainly do the former. Worrying about REP collateral risk is akin to giving someone a math test where the first question is derive e=mc^2 from scratch and the second question is what’s the derivative of x^2 but being worried about the person being able to solve the second problem yet having full confidence they can solve the first one: it’s inconsistent. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7774206349206345
                }
            ]
        }
    ]
}