{
    "poll_list": [
        {
            "title": "Quantitative easing aka Manual PSM - September 14, 2020",
            "index": "3902",
            "option": "No",
            "supporting_mkr": "18,737",
            "highest_fraction": 0.8
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-quantitative-easing-to-fix-the-peg-aka-manual-psm/3902",
            "title": "[Signal Request] Quantitative easing to fix the peg (aka Manual PSM) ",
            "index": 3902,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "usdc"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "7",
                    "time": "31/08/2020-21:06:57",
                    "content": " Summary Creation a USDC-M vault with no stability fees and a liquidation ratio of 100%. Only whitelisted address from Maker can use it. This bring the ability to unlimited leverage if needed to:  Fix the peg Turn on the revenue stream (separate the SF parameters from fixing the peg) Make a profit doing so  It is quite similar to the PSM but manual (PSM prototype?).  Motivation The Maker Protocol is a two sided business. Vault owners want to get DAI loan (producer side), DAI users want to have DAI (consumer side). Both want 1 DAI = 1$. Currently we have more consumers than producers. We set the SF to 0%, DC are not used to their full extends. With a USDC-M vault with no fees and a liquidation ratio of 100%, we can have unlimited leverage and arbitrage ourselves the DAI price. The USDC-A lower LR proposal is similar but I think less effective (higher exposure to USDC for the same effect, leaving the profit to the users, having to handle “abandoned” USDC-A vaults that are not easily liquidated). This proposal is very similar to the quantitative easing programs from central bank that were quite effective at setting rates.  Quantitative easing process  Create a USDC-M vault that only some wallet can use (i.e. only Maker) with no SF and LR @ 100%. No limit or a 100M USDC limit. Borrow 100K DAI with a flash loan ( as an alternative to take 100k DAI from the surplus buffer) Sell the DAI to get USDC (around 101k USDC at first iteration, more later) Use USDC as collateral in the USDC-M vault to generate 101k DAI. Pay back 100k DAI of the loan, use the 1k DAI remaining to get ETH for transactions costs Repeat from 3 until the DAI don’t sell at 1.005 USDC/DAI. Unwind if 1 DAI <= 1 USDC   Pros  We control the whole process 100% of the generated DAI goes to pressure the peg downward. This is unlike the behavior of USDC-A that tend to keep the DAI in a Compound loop (very limited impact on the peg at best). When we unwind we most likely make a profit We can liquidate at any time. We can stop the process anytime if the results are not great We can say “we do whatever it takes, and believe us it will be enough, don’t fight MakerDAO” That would enable Different Approach to Rate Setting  The 1 DAI = 1$ of collateral is kept   Cons  A lot of manual work (fake it until you automate it), therefore operational risk Operational burden (who do it, under which supervision, …) If 100M DAI from USDC is not enough, it will increase our last accepted exposure to USDC. May have unwinding issues if we want to unwind when DAI is expensive. A government may freeze MakerDAO USDC collateral The strategy may have limits as it would be public and may be front runned (pro or con not sure).   Further possible iterations  Add other stablecoins vaults (TUSD, PAX, GUSD, …) as soon as possible to diversify risk, including cDAI and similar Automate it and create a whole framework to make it a peg stabilizer (a real PSM).   Related   Signal Request: Should we reduce the USDC-A collateralization ratio? Alternative proposal to lower the USDC-A LR for all customers MIP20: Target Price Adjustment Module (Vox)  [Poll] Should MakerDAO print unbacked DAI to solve the peg issue? - #24 by mario First iteration of this idea  MIP13c3-SP3: Declaration of Intent - Strategic reserves fund (SRF) can be used as source of funds Different Approach to Rate Setting [Discussion] cDAI/aDAI/yDAI collaterals as a peg enabler tool   Signal request Do you want to put forward this quantitative easing plan (Maker leverage a USDC-M LR100% SF0% vault to fix the peg)?     yes, this is the way no, not a good idea abstain     0 voters     If you voted no please help us understand:     I voted yes or abstain previously No, I prefer the USDC-A with lower LR solution No, I want the PSM No, I want negative rates No, I want unbacked DAI No, the solution is RWA collaterals No, the solution is adding more collateral No, too much operational work No, we can’t use the surplus buffer for that No, the peg is not such a big issue No, I don’t like USDC No, we should do X instead (please explain below) No, I have another reason (please explain below)     0 voters     The poll will be open until 2020-09-07T22:00:00Z ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-should-we-reduce-the-usdc-a-collateralization-ratio/3886",
                        "https://forum.makerdao.com/t/different-approach-to-rate-setting/3889",
                        "https://forum.makerdao.com/t/cdai-mip6-collateral-onboarding-application/3764",
                        "https://forum.makerdao.com/t/signal-request-should-we-reduce-the-usdc-a-collateralization-ratio/3886",
                        "https://forum.makerdao.com/t/mip20-target-price-adjustment-module-vox/3196",
                        "https://forum.makerdao.com/t/poll-should-makerdao-print-unbacked-dai-to-solve-the-peg-issue/3589/24",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765",
                        "https://forum.makerdao.com/t/different-approach-to-rate-setting/3889",
                        "https://forum.makerdao.com/t/discussion-cdai-adai-ydai-collaterals-as-a-peg-enabler-tool/3470",
                        "https://forum.makerdao.com/t/signal-request-should-we-take-emergency-action-to-fix-the-peg/4096/21",
                        "https://forum.makerdao.com/t/discussion-proposing-yeth-vault-alternative/4121/10",
                        "https://forum.makerdao.com/t/maker-relay-ep-12/4153",
                        "https://forum.makerdao.com/t/substantial-unrecognized-risk-with-cdai-collateral-proposal-please-read-and-vote/4436/3",
                        "https://forum.makerdao.com/t/different-approach-to-rate-setting/3889/43",
                        "https://forum.makerdao.com/t/maker-relay-ep-10/3907",
                        "https://forum.makerdao.com/t/signal-request-dai-is-at-1-04-going-towards-1-05-should-we-fix-the-peg-with-an-emergency-vote-to-lower-stablecoin-lr-and-increase-stablecoin-dc/4088/11",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-108-thursday-september-3-16-00-utc/3850/2"
                    ],
                    "GPT-summary": "The author proposes creating a USDC-M vault with no stability fees and a liquidation ratio of 100% to fix the peg and turn on the revenue stream. The proposal is similar to the quantitative easing programs from central banks. The author explains the quantitative easing process and lists the pros and cons of the proposal. The author also suggests further possible iterations and asks for feedback through a poll. Some third parties give constructive criticism and ask questions about the proposal, while others collaborate by voting in the poll.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.238881401617251
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "5",
                    "time": "31/08/2020-21:38:11",
                    "content": "At this point – with 300,000+ DAI sitting in the sidelines (system surplus) catching dust–I rather explore–than sit around and wait for another Black Swan event–similar to the DAO hack (hopefully not)–or a major sell-off based on World economic, regulatory, & political risk Let’s not forget that Not only do we have the entire Ethereum community dependent of DAI being Stable – but we have supporters out there wishing us success:  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.622395833333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#3",
                    "likes": "2",
                    "time": "31/08/2020-21:45:09",
                    "content": "Trying to wrap my head around this. It sounds like the end result would be the equivalent of minting X million unbacked DAI, then retroactively backing it by purchasing assets (USDC) and locking it in a maker controlled vault that can be liquidated (but not until we have the Dutch auction system live). While these peg stability tools are important to research in the medium to long term, the yETH launch is imminent, and I’m concerned the +200M curve stable coin buffer is going to get eaten up. I would not be surprised in the least if the 80 million left in the ETH-A vault gets filled on day 1 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.490259740259741
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "2",
                    "time": "31/08/2020-21:45:31",
                    "content": "Great work here @SebVentures for taking this initiative. I agree that brave actions are required now and I think this would be a great experiment. Lets hope others agree! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 9.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#5",
                    "likes": "0",
                    "time": "31/08/2020-21:48:34",
                    "content": "We can hope can’t we!!! Oh if all our problems could be solved with this one addition! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "2",
                    "time": "31/08/2020-21:56:34",
                    "content": "Yes, you can say it’s the same, maybe we can do it with a flash loan. No capital needed and it should work or liquidation as well. I agree with the yETH, but what happen if the underlying strategy change and hurt the peg? Let’s move forward on both and activate quantitative easing only if needed. For the PSM I didn’t add that this option was only valid if you are working on it  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#7",
                    "likes": "3",
                    "time": "31/08/2020-22:22:55",
                    "content": "My suggestion would be to increase the debt ceilings. They are not high enough to allow large players to successfully arbitrage the peg. Primarily ETH, but also USDC (doesn’t make sense to me that this was lowered). Trying to do large scale arbitrage is risky because there is a chance the market moves against you. It needs to be done fast in order to limit your risk, but because doing this arbitrage would hit the debt ceiling cap before the peg was restored, you would get exposed to extraordinary risk market demand pushing against you. DeFi can create demand of hundreds of millions in the space of a few days. DAI is simply failing to scale to the point where it can meet this demand. So people are making do with inferior alternatives like USDT because it is the only other option. Current market demand for stable coins is over $10B on Ethereum and we are only supplying 3-4% of the demand. Why is there any confusion at all as to why the peg is off when we are constraining supply? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.609608843537415
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#8",
                    "likes": "1",
                    "time": "31/08/2020-23:00:45",
                    "content": "I don’t know if there are implementation difficulties but if there aren’t I see no harm in trying it out with a 100k from the SB. There should be a designated individual from the dao to execute it. Edit: It would not be unbacked dai, we would be using our own dai reserves for abitrage trading, the only downside I see is a black swan event on usdc but it’s a contingent event vs a real problem ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.444444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#9",
                    "likes": "7",
                    "time": "31/08/2020-23:25:51",
                    "content": "I think there’s a big difference between Maker accepting USDC as collateral, vs Maker outright owning USDC (or other real world assets). If a government wants to target the Maker protocol, or if a lawsuit receives a judgement against the protocol, it will be much more difficult to freeze/attach USDC collateral assets that belong to a user, and comparably much easier to do that to assets belonging to the protocol itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.339285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#10",
                    "likes": "1",
                    "time": "01/09/2020-00:10:26",
                    "content": "I think that if a government wants to target the maker protocol the consecuences go far beyond USDC, how probable are RWA under that scenario? On the other hand if the government wants to target USDC we still have 11m under custody, doubt we would get any dai back I believe there isn’t a perfect solution therefore we should act upon those that we believe may have the highest impact with the lowest risk. Currently with the peg still hovering above 1 I find the approach interesting, it could even be a temporary one while we keep onboarding new collaterals, RWA included, if not we may be facing the fact that we are months away from a peg stabilization (if this idea actually helps the peg), isn’t that a far higher risk? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.908216783216783
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#11",
                    "likes": "4",
                    "time": "01/09/2020-05:15:15",
                    "content": "    SebVentures:   Selling the DAI to get USDC (around 101k USDC at first iteration, more later) Using USDC as collateral in the USDC-M vault generate 101k DAI.    This step. You deposit 101K USDC and want 101K DAI in return. This is called printing DAI. In this plan Maker is set up as a trader in its own currency with more privileges (a special USDC pool and exchange mechanism) than no other market maker has access to. If the community uses such a solution it will cause a massive blow to credibility. You will probably be able to fix the peg in the short run but at the cost of sinking Maker karma below that of Tether. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.258928571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#12",
                    "likes": "0",
                    "time": "01/09/2020-07:22:40",
                    "content": "We should pause the ETH liquidations until the peg is restored but I’ll support any solution that is not status quo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "1",
                    "time": "01/09/2020-07:54:14",
                    "content": "    Planet_X:  You deposit 101K USDC and want 101K DAI in return. This is called printing DAI.   I would argue that printing mean issuing DAI without having a same value collateral. Here we only do what we do every day, making credit. Take collateral and offer a credit on it. the only difference is the SF and LR ratio. SF is just and accounting trick (we don’t pay ourselves), the LR doesn’t change the risk profile. The USDC risk is in main part binary (backlisting or default). It’s still MKR that hold the risk in any case. I understand that a special poll can mean more privileges. In any case, it seems less privileges than running a PSM which would do the same with more contract risk, more market risk and less operational risk. In fact, I’m just suggesting a manual PSM. The current best alternative on proposal is to set USDC-A at a low LR. Something I’m not sure we can unwind easily.     monet-supply:  If a government wants to target the Maker protocol, or if a lawsuit receives a judgement against the protocol, it will be much more difficult to freeze/attach USDC collateral assets that belong to a user, and comparably much easier to do that to assets belonging to the protocol itself.   @monet-supply I fully agree but is really the US government our biggest problem? And do they really have only this option? The PSM would have the same issue (and I’m not talking about RWA). If we keep having the peg issue, the US government will be the last of our worries.     rileyjt:  My suggestion would be to increase the debt ceilings. They are not high enough to allow large players to successfully arbitrage the peg. Primarily ETH, but also USDC (doesn’t make sense to me that this was lowered). Current market demand for stable coins is over $10B on Ethereum and we are only supplying 3-4% of the demand. Why is there any confusion at all as to why the peg is off when we are constraining supply?   There is 80M on ETH-A and there was 130M on USDC-A. MakerDAO is not at ease to rush increasing WBTC-A. Therefore I’m not sure debt ceiling are the issue but would suggest you propose a signal request to increase the DC as you see fit. You are nicely summarizing our problem. I would say that we are not constraining the supply but that the supply is not here. Like any marketplace, if the supply is not there, you make it. I would love to spend time figuring out why the supply is not following. Let’s solve the peg and work on that problem. The add more collateral argument As a lot of people think adding more collateral is a better way, I would say that I’m 100% in and we can/should do both. Quantitative easing is a problem fix, not a business model. I’m super excited that we get PAXG this month but I’m not betting Maker life on it. It’s a long way and I would prefer the peg to be fixed during this journey. On the next collaterals for inclusion, I see nothing that will solve the peg with an high probability. Are we okay to keep the peg broken for at least the next 3-6 months? The flash loan option The key issue (that isn’t often cited, interestingly) is the operational risk. But the flash loan option seems to me working, so we don’t even have to touch the surplus buffer. We just need the vault. The whitelisted wallet would be known by everyone for scrutiny and the vault can be disabled at any time. Scale of the quantitative easing The amount needed to bring DAI under 1.005$ is 40M on Curve (most likely some will frontrun us if we announce that, meaning we may need way less than 40M). No one can tell if that’s durable after that or if it will revert to 1.015. What is sure is that no one is doing it. Obviously, we will have to test it with a lower amount at the beginning and understand the market dynamics. ",
                    "links": [
                        "https://forum.makerdao.com/t/collateral-status-index/2231"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7445634920634925
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#14",
                    "likes": "1",
                    "time": "01/09/2020-14:42:23",
                    "content": "This is a great idea, and the kind of bold move we need right now to keep our position in the DeFi economy. My suggestion is that instead of having the LR all the way at 100%, it could be set at e.g. 100.5% with a small stability fee, in order to capture a decent profit for Maker. It would still fix the peg within a reasonable spread of 1 USD, but would be a better trade for the DAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.647321428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#15",
                    "likes": "2",
                    "time": "01/09/2020-15:09:08",
                    "content": "@Replenish2030 thanks for your support. The stability fee is not needed as we pay it to ourselves. Both ways it end up in the surplus buffer. The LR can be set at 100.5% but it increases the complexity of management as the spread is thinner. It’s our vault so we can limit ourselves to any leverage we want, I see no need to set that in the vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#16",
                    "likes": "1",
                    "time": "01/09/2020-20:49:42",
                    "content": "I would like to see this exact same thing done in the long term with uniswap v2 tokens, balancer tokens, other crypto derivatives with lower volatility than bare crypto assets, no custodial risk, and yield. But in the intermediate time period this seems like a good compromise since it achieves largely the same thing, only involves taking on temporary custodial risk, and these other assets which I think would be a better fit are not yet onboarded as collateral in the maker protocol. I prefer this to the PSM since we have direct control over how much USDC we take on, and when we buy or sell dai on the market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.755102040816327
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#17",
                    "likes": "1",
                    "time": "02/09/2020-03:12:55",
                    "content": "Actually if you look at this carefully from an ES perspective all DAI holders basically own the collateral in the MCD system.   Maker DOES NOT own the collateral in this protocol the DAO only manages this facility like all the other facilities for DAI holders. While I am a strong advocate for direct intervention in the form of the above one thing no-one has considered is what the heck happens if the markets goes against this facility.    When I look at what Central Bankers do there is something that as far as I can tell CAN’T be done by Maker DAO. Stealth and power.   Central Banks when interviening in currency markets don’t advertise what they are doing (price limits), nor how far they will go (liquidity they will throw at this).   While they privately have a price target they generally DO NOT publicaly advertise if/when or how much they will move.    The point here is facilities and activities like these are best accomplished with secrecy, and some stealth as well as real unknown financial power and then once they begin often times an announcement is made to try to influence the markets.   These types of direct market interventions are tricky and require significant exposure as well as coordinated efforts not just in markets but with news releases.  Meaning if one is going to mess with the Yuan say - you better have brokers that have direct access to all the markets at once because the power of these moves is that they happen across all markets simultaneously limiting arbitrage opportunities.   You don’t want to be driving down DAI-USDC on DYDX and not also selling on Coinbase for example.    I think there are real legal and tax hurdles in doing this kind of direct market interventions for this reason.   It was why I wanted to advocate a more dynamic PSM that moved its pricing brackets when utilized and only allowed so much liquidity at a time to be pushed into or removed from these markets so that people could ‘expect’ there would be intervention - but market participants could NOT anticipate how much or at what prices the PSM would act.   Hence in a way I wanted not just moving price bracketing based on the facility usage and OSM prices but also to use the actual decentralized users of the facility to drive an element of randomness in how such a facility priced and how much volume it would provide.  (I never posted details of this as the PSM appeared to already have too much controversy and was not moved forward as far as I could tell) I also felt it was important to couple an auction that constantly drove auctions when this facility was actively filled with assets on one side or another. Example lets say this facility has like 80M DAI of 100M DAI utilized and basically sold at an average price of 1.01.    There is no reason NOT to do constant reverse auctions for buyers between 1.005 and 1.01 while having the PSM decide to set the DAI buy back price at say 1.005 for users until the next market fill happens and then these would be dynamically adjusted again. For such a facility to be useful it should appear pretty unlimited and should act somewhat randomly so as not to be easily gamed or gamable. My growing problem with a lot of these tools as well as the increasing complexity not just of Maker but the entire DeFI system is that it is becoming more and more difficult to understand what the real ramifications of such a beast will be.   Also we have governance decidedly unwilling to take on significant USDC/stablecoin risk.    It has become pretty apparrent to me that governance really needs to sit back and take a look at what the future of Maker is.    I started constructing a post but life events have side swiped my ability to contribute much lately. Put simply when network tx fees are growing at the current rate we basically are pricing out many smaller decentralized players in Maker and pretty much destroying any ability for Maker to serve the underserved except by another third party who can in-expensively take on collateral and make micro-loans (i.e. loans in the 100-5000 DAI levels).   Unless somehow this entire system gets the massive tx capacity boost we are rapidly going to see DeFI on Ethereum become the playground for the rich and so some level of discussion within governance on what the future looks like for Maker and decentralized users at not just 400-500gwei/tx but 4000-5000gwei/tx really is in order. I saw wouter posting that fees just to run Maker are now running 50K/month.   That is 600K DAI/yr which could rapidly grow to 1-2M if fees keep running like this.   I don’t know about the rest of you but fees are pretty much locking up most of my positions in places and forcing me to do less not more in terms of market making activities.    It is a prime reason that low cap collateral is somewhat pointless and why Maker is going to see risk clumping in virtually ALL of the MCD classes - particularly the small ones which generally is bad for bankers.    We don’t want to have like 5 MANA holders or 3 wBTC holders taking up the entire DC because then there we have a huge and growing liquidation risk in these things.  It is my hope the liquidation system upgrade will be up to this task - but this will be new and itself may have bugs or attack surfaces that may only appear when we have real clumping in liquidation risk. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.510970819304153
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#18",
                    "likes": "0",
                    "time": "02/09/2020-13:43:11",
                    "content": "I’m not very convinced that transparency about what Maker is doing will cause issues. Sure in theory there’s some way gamification can happen. But I think in most cases the market front running us actually helps us because it creates a situation where the peg stabilizes without the need for MakerDAO to take on any assets. Doing random things and losing the transparency we have which is one of our core tenants would be terrible. I believe that clear decisive action that market actors can count on creates a better dynamic. It’s possible that things can be gamed and for example the peg does not return to $1. However we have full control over these funds and can stop and find new solutions any time. I doubt there’s any real risk here besides the prior mentioned custodial risk, and the risk that dai will not return to a $1 peg. The tax considerations are interesting and I’m not sure what they would be. But taxes in the crypto space are terribly nasty and convoluted already and probably should not greatly impact what kinds of decisions we make for government policy. If there are ways to do this and optimize taxation, we maybe should look into that, but there are a number of significant differences between this and PSM which are unrelated to taxation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.002840909090908
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#19",
                    "likes": "0",
                    "time": "02/09/2020-14:04:43",
                    "content": "    befitsandpiper:  I’m not very convinced that transparency about what Maker is doing will cause issues. Sure in theory there’s some way gamification can happen. But I think in most cases the market front running us actually helps us because it creates a situation where the peg stabilizes without the need for MakerDAO to take on any assets.   If this was true one could just make a news release and markets would move to the new price.  Typically the move is made and the news about it is releases so that market participants are ‘guided’ to stay in the new range.   My point here is that typically these types of operations are tricky at best and one key component to any chance of success is stealth with power.  Maker misses two things here, stealth, and with a fixed DC uncertain power.     befitsandpiper:  Doing random things and losing the transparency we have which is one of our core tenants would be terrible. I believe that clear decisive action that market actors can count on creates a better dynamic. It’s possible that things can be gamed and for example the peg does not return to $1. However we have full control over these funds and can stop and find new solutions any time. I doubt there’s any real risk here besides the prior mentioned custodial risk, and the risk that dai will not return to a $1 peg.   One can still have things happen programmatically but using random elements.   In PID control loops one normally doesn’t use such features as there is no outside agents acting to game the PID controller. I think we will have to disagree.   One can have clear decisive actions but do them unpredictably.  We know that IF a system CAN be gamed - IT WILL and doing something like the above basically will reduce the effective power of such actions because as the DC fills up the gamers will know the price can be pushed over until ‘governance’ does something else.   If this is programmatic it ofc will be frontrun.   This on first glance looks like it will help but there is a reason currency interventions don’t do things this way and it is because the markets often themselves will do the unexpeted.   Think of it this way.  Do you think you would ever win at poker if your opponents could always see your hand? As to tax implications.   My thought was not dydx but trying to do these kinds of open market operations on CEX’s.  Who is something like coinbase going to send a tax bill to?  Which means they would be done outside of the CEX’s and arbitragers would make bank doing the arb on these - reducing the overall financial power of such activities. I want to add one last thing.   I really want to see something like this as a tool in the arsenal but some really clear thinking needs to be made as to how it could work and my primary issue here is that there is no stealth possible (AFAIK) and no uncertainty in ‘power’ that would be applied and so becomes a new system for outside agents to find ways to game for profit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.374545454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#20",
                    "likes": "1",
                    "time": "02/09/2020-14:33:58",
                    "content": "Doing operations on CEX’s? Can you even interact with coinbase via smart contract? Sorry but I find this idea completely wild, and I’m not even sure how it helps. The entire point of decentralized finance is we believe it will eventually be more efficient/cost effective and overtake centralized financial markets, at least within the crypto space itself, right? Why would we want to bake interactions with CEXs into the protocol even if this was possible? I still don’t buy the stealth idea, or that we need to use random number generators to make decisions. Can you provide some evidence of this claim? It seems like one of those things that maybe feels intuitive, but it’s also a significant claim which should require data. Even the US fed nowadays tries to be predictable and reliable for markets. There were examples in the past of the Fed trying to be unpredictable and outsmart markets and it ended poorly. Here is an article about federal reserve policy over time. It seems to me the thing we need to do if we want to emulate the more successful aspects of the US federal reserve is provide forward guidance and MORE predictable long term policy decisions, not less predictable. Market actors will make the trades that are profitable. We just have to make sure that what is profitable provides incentives that align with government policy. And if new issues crop up, we have the capacity to find new solutions to those problems. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.413284632034632
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#21",
                    "likes": "2",
                    "time": "02/09/2020-21:19:23",
                    "content": "Some very good points in your discussion , I will try to address some.     MakerMan:  If this was true one could just make a news release and markets would move to the new price.   MakerDAO doesn’t have any power in any statement it can make currently. There is no “whatever it takes” possible because leadership is decentralized in people no one knows. WBTC to capped by a debt ceiling for weeks before it gets raised. We have this issue for months now and we have tried 2-3 new policies, not even one per week. Moreover, the subject is very complex and we don’t have the manpower to do proper research on the topic. I would argue that the Fed isn’t stealth. I’ve not seen any research on a spike in volatility on Fed meetings. The market and the economy dictate the Fed action more than the opposite. Making power statement is powerful, and most of the time, the market front run the Fed so the Fed has almost nothing to do. The last example I have is buying corporate bonds ETF. The announcement was enough to get price in check. For government bonds you know exactly what they will buy each week. It could be that having a USDC-M vault capped at 100M is 10x less effective than having a vault capped at 100 billions and it require less minting the later case. The way I see it, the peg is taking most of our governance bandwidth. We let others fires burning. We lose momentum. I want to fix the peg because it should be easy to do (in this direction at least) so we can focus on others problems. In my view, on this side of the PEG we should have:  inside the range $1.0 < DAI < $1.005 the market should be able to fluctuate and market maker do the job to absorb small imbalance of supply and demand. at $1.005 the PSM should absorb a medium imbalance automatically with a buffer. It’s the outside spread from the money view so arbitrageurs have support. over $1.005 manual intervention should take place. It can be lowering the rates (subsidize the borrowing) or stuff like quantitative easing.  For the tax implications, that’s already here with earnings in the surplus buffer. At some point we may probably have to pay taxes. That’s not a near term problem. I would be disappointed if the first project being a government target is not Maker. That’s a success metric. By design quantitative easing can be unlimited (let say billions of dollars), I don’t see how someone can go against. Most likely, we will stop before, but that’s a governance call. It’s the same problem with the PSM. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.575151515151515
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#22",
                    "likes": "2",
                    "time": "03/09/2020-16:33:54",
                    "content": "Just adding. While I think increasing the DAi minted and adding more collateral will help.   I believe that having open market operations to manage DAI supply are important but I am conviced there is a better way is using something like the PSM that acts differently and doesn’t require manual intervention. What I really want to see is a serious and well thought out as well as complete discussion regarding the topic of long term Maker goals against the constraints as I still do not have a clear feeling what the community (ala governance) sees in this regard.    I am beginning to think that we are going after tons of different issues and no-one is really putting together a long term plan for Maker that has a vision as well as an approach to achieving that vision. At some point I may post a new thread - Long term Vision for Maker where anyone and everyone is enouraged to submit their visions, discuss them civilly ofc, so that the community might come to grips with what our long term goals are and then work on determining the metrics for achievement of those goals. Put simply I think we are using a pea shooter to deal with issues when if we can look at the entire Maker system globally with all participants from a vision perspective perhaps this will elicit more concrete long term plans to solve the issues we are dealing with repeatedly almost on a weekly basis now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.50068870523416
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#23",
                    "likes": "1",
                    "time": "05/09/2020-09:52:33",
                    "content": "I think this is a good idea! At least worth trying on a small scale with, e.g., the current surplus available. Ideally, it should be done in just 1 transaction (flash loans) etc, but I really like that we can try it “by hand” quickly with the surplus, without requiring much additional complexity/smart contracts, etc. My impression is that having SF=0% is simply not a sufficient mechanism to keep the peg at 1:1. People in the forum suggested that RWA will solve the problem, or additional YFI liquidity, etc. But for the moment (today) this is not available/working. So I am totally inclined to experiment with your idea, on a small scale first. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.949404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#24",
                    "likes": "1",
                    "time": "05/09/2020-10:06:38",
                    "content": "One more comment. We all expect that, eventually, the peg will be stable at 1:1, because once the market players truly trust that MakerDAO can keep the peg, they will sell DAI whenever 1DAI>1USD and buy day whenever 1DAI < 1USD. The idea proposed here basically amouts to let MakerDAO itself play the role of the player trusting the the peg will be reached. This can be powered either by flash loans or, in a more conservative way, with the surplus. In the latter case, the MakerDAO is simply choosing to invest its money in this arbitrage activity (between DAI and USDC, for example) rather than burning MKR. It all seem pretty healthy to me if only surplus money is used. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#25",
                    "likes": "1",
                    "time": "06/09/2020-02:16:49",
                    "content": "Hi Guys, checked back this post again to run through the process, although I stated that I´m willing to give it a shot, how exactly does the unwinding work?  Create a USDC-M vault that only some wallet can use (i.e. only Maker) with no SF and LR @ 100%. No limit or a 100M USDC limit. Borrow 100K DAI with a flash loan ( as an alternative to take 100k DAI from the surplus buffer) Sell the DAI to get USDC (around 101k USDC at first iteration, more later) Use USDC as collateral in the USDC-M vault to generate 101k DAI. Pay back 100k DAI of the loan, use the 1k DAI remaining to get ETH for transactions costs Repeat from 3 until the DAI don’t sell at 1.005 USDC/DAI. Unwind if 1 DAI <= 1 USDC  The moment that we unwind position probably the impact will be neutralized therefore we will be stuck with USDC until intrinsic demand = intrinsic supply or am I missing something here? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#26",
                    "likes": "0",
                    "time": "06/09/2020-07:29:15",
                    "content": "You are right. We may decide to unwind before reaching the peg but the USDC selling price should be lower than the buying price or we take a loss (and it’s not even possible with flash loan and no capital). The overall idea is to have this supply of DAI as long as needed (until 1 DAI < 1 USDC). The discussion shift from how to solve the peg with existing tools (which takes a disproportionate amount of governance bandwidth) to developing those tools (onboarding RWA for instance). It may also be the case that such tool will impact the market behavior and anchor the price 1 DAI = 1 USD for market participant. This is still not a given as the peg was broken for so long. It seems that TUSD will available as well soon and domain teams are working on cDAI and PAX. I especially like cDAI as it would be like having a Maker vault for Compound borrowers yielding 3-4% SF (excluding COMP farming). I would personally prioritize the increase of stability fees (up to competitive levels) over unwinding those facilities. I want to highlight that when we add RWA, the SF will be less effective to reduce DAI supply (because RWA will have a quite low SF ceiling it seems). We might need to have some ways to tighten the DAI supply soon. Overall I see the unwinding risk lower than using consumer vault doing the same. MKR take the same risk but Maker can manage its own vault more easily than customer vaults (swapping the collateral for instance). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5664160401002505
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#27",
                    "likes": "1",
                    "time": "06/09/2020-12:29:28",
                    "content": "Currently DAI Utilization is approximately 59.4% and the peg is 1.014196 DAIUSDC at 12:24 UTC. Can we agree that an abundance of DAI is also Not going to fix the Peg? Also, if we do implement QE, or the PSM–I believe it will have a lot of short-term Tax consequences in the U.S./EU–therefore we will need to form a separate LAO/Corp. and appoint/elect Board Members. This is one of the reasons why the Maker Foundation could not help the community w/the PSM, in my opinion. I hope we are ready to organize as ONE, and make things happen. Honestly, we don’t have much of a choice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#28",
                    "likes": "0",
                    "time": "06/09/2020-14:59:09",
                    "content": "Seems unlikely that we could sell USDC at a price above $1… so I would say this point guarantees a purchase of USDC means a small loss when unwinding, or at least a 0% return. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#29",
                    "likes": "2",
                    "time": "06/09/2020-16:38:51",
                    "content": "Yes, definitely, basically it’s the same as the usdc vault (not contemplating capital efficency) with the difference that we absorb the profit and we may decide to absorb usdc risk by increasing our exposure till dai is below one when a rational trader would perhaps take the profit. There will be a trade off between SF revenue from USDC vaults and this idea (still I want to give it a shot). The unwinding should be done at a lesser speed while other assets are onboarded or Yeth vault on the short run is again implemented. Short note on RWA, they will definitely help the peg much more that crypto assets since the dai is probably offloaded, the dai miniting through RWA to impact the peg should be less than crypto leverage/farming exposure (no numbers in, just a general feeling). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.129166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#30",
                    "likes": "1",
                    "time": "06/09/2020-16:47:53",
                    "content": "@flipflopflapdelegate The exchange rate is defined by something that like the amount of DAI generated times the DAI velocity. Currently most DAI generation doesn’t have a high velocity or even no velocity at all. So creating more DAI help a bit (used to provide liquidity in Curve,  …) or almost nothing (Uniswap LP, Comp leveraged farming). RWA should have an higher velocity. The tax consequence exists since the first DAI hit the surplus buffer. QE or the PSM don’t add much to this problem. This is a discussion we should have but I’m not sure now is the time. You are too ahead for me  @befitsandpiper the idea is to bring the peg at 1. The expected behavior is not to sell above 1.005 and not to buy below 1.005 (if we agree that’s the good limit, can be 1.000 as well). QE is a temporary and flexible measure to give us the time to ship collaterals that will supply DAI while having a good product in the meantime. This way we can work on the supply and the demand side at the same time and get stability fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2124999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#31",
                    "likes": "0",
                    "time": "06/09/2020-16:50:05",
                    "content": "    flipflopflapdelegate:  Currently DAI Utilization is approximately 59.4% and the peg is 1.014196 DAIUSDC at 12:24 UTC. Can we agree that an abundance of DAI is also Not going to fix the Peg?   IMO it depends on how dai is used     flipflopflapdelegate:  Also, if we do implement QE, or the PSM–I believe it will have a lot of short-term Tax consequences in the U.S./EU–therefore we will need to form a separate LAO/Corp. and appoint/elect Board Members. This is one of the reasons why the Maker Foundation could not help the community w/the PSM, in my opinion. I hope we are ready to organize as ONE, and make things happen. Honestly, we don’t have much of a choice.   Thanks for bringing this up, didn´t think of that, in my microworld of Uruguay crypto is not taxed (yet  ). By this do you imply we should implement a separate LAO/Corp. before eventually implementing the proposed idea? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#32",
                    "likes": "0",
                    "time": "07/09/2020-10:08:39",
                    "content": "So something I probably should have contributed earlier: This sort of change might be better suited to a Declaration of Intent than a signal request. It straddles the line between being doable with the tools we currently have (Vaults) and adding new functionality (restricting a vault to be used only by Maker + requiring flash loans.) It would be good to get input from the Smart Contracts team to weigh in on how feasible this is technically. @wil, @cmooney any thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9691558441558445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#33",
                    "likes": "0",
                    "time": "07/09/2020-14:58:24",
                    "content": "The way I wanted this to work from the PSM was basically to have a high side DAI price that would float with how much USDC was in the facility.   Say we set the high price to 1.02 when 0 USDC is in the vault.  The above facility would put up a 100K DAI sell at USDC 1.02.  If it is purchased then the new ask price on the next 100K USDC is like 1.021 or some variation. Now once one has USDC in the above vault allow anyone to initiate a USDC auction for DAI starting at .99USDC/DAI and going all the way up to the average USDC/DAI price of the facility at current.  If this is 1.0225 then take any bid all the way up to 1.021 or 1.022 - otherwise cancel the auction with no sales and repeat only when another keeper initiates an auction.   The idea here is to use your keepers against such a facility to try to clear collateral when there is an opportunity for them and the system to profit.  A keeper will know both the average facility price (i.e. the high point where the facility will sell) and they will also know that they want to buy at a lower price than what the facility is currently offering.   If they can profit from this they will use it.   As the facility fills up with USDC the offer price should rise and the average price of USDC for DAI in the vault should rise above the target.    As the price comes down use the auction process to basically clear out the USDC from the facility. While this won’t drive the PEG down it should put a managed cap of liquidity on the high side and then use keepers to clear the facility when the price falls.   I thought a better way to deal with this was with a PSM type contract that would just have a fixed bid and ask prices based on the facility usage and hence the average price of the collateral in the facility.   Then just allow keepers to trigger auctions to buy in the middle of the spread all the way up to the avg facility price - some profit percentage. Remember here while there is an idea to have system profit off this facility, this is not the primary job.  The primary job of any facility in this regard is to be able to manage the PEG with liquidity that only has a fixed fee premium without any collateral risk other than pricing risk.  (i.e. a PSM contract means someone doesn’t have to deposit collateral into a vault and then withdrawal DAI to use it or repay anything 3rd tx).   A PSM like contract is a one tx to swap USDC for DAI or DAI for USDC for most users. Primary issue here is that I wanted to have a couple PSMs using different operating parameters and DC’s so we could watch the different PSM utilizations and judge market effectiveness as well as manage losely overall DC usage with a group of PSMs trying to target different PEG values with their liquidity the widest one having the largest DC ofc. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.392531565656565
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wil",
                    "index": "#34",
                    "likes": "1",
                    "time": "08/09/2020-14:34:06",
                    "content": "Neither the Foundation or Rune will be providing advice on the proposed solution above. The mandated Domain Team will be once they’ve worked through it internally. It is feasible but implementation is in the hands of the community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#35",
                    "likes": "2",
                    "time": "08/09/2020-14:58:24",
                    "content": "Implementation is in the hands of the community? We don’t have a community led smart contract team yet, so there’s no community expertise to implement this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#36",
                    "likes": "1",
                    "time": "08/09/2020-15:03:18",
                    "content": "This should be really straight forward to build. I believe you can just take the USDC-A adaptor and add a whitelist to it. Adjusting the LR to 100% already exists. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#37",
                    "likes": "2",
                    "time": "08/09/2020-15:15:34",
                    "content": "@wil so if the community provide a pull request or a new USDC-A join adapter solidity code and parameters (I was thinking about that too but unsure) and this signal pass the governance + executive on chain, will it be pushed by the SC domain team? Or is there another process we should be aware? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.965909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wil",
                    "index": "#38",
                    "likes": "1",
                    "time": "08/09/2020-15:21:39",
                    "content": "You would need to go through the standard MIP6 process as defined here: https://github.com/makerdao/mips/blob/master/MIP6/mip6.md ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#39",
                    "likes": "0",
                    "time": "08/09/2020-19:10:31",
                    "content": "Why bother with building extra complexity when we can just change the liquidation ratio of USDC-A? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#40",
                    "likes": "1",
                    "time": "08/09/2020-19:29:44",
                    "content": "I made the case in the first post but it’s more detailed here. Basically liquidation will probably not work as expected (when activated) and leave a mess or a loss. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/EdwardM290",
                    "index": "#41",
                    "likes": "0",
                    "time": "08/09/2020-20:03:37",
                    "content": "True. Because of this we need to fix peg ASAP, otherwise there is no valuable reason to store your value in DAI. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/EdwardM290",
                    "index": "#42",
                    "likes": "0",
                    "time": "08/09/2020-20:05:24",
                    "content": "    SebVentures:   The 1 DAI = 1$ of collateral is kept    This is literally the ONLY IMPORTANT THING that matters! Otherwise people searching for stablecoins will go away from DeFi projects like DAI! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#43",
                    "likes": "0",
                    "time": "08/09/2020-20:25:16",
                    "content": "If we wait until liquidations 2.0 to do liquidations, it will be possible to force liquidations to happen only at 1:1 (by not letting the dutch auction decrease in value) and then doing it when the peg is below 1 USD so a 1:1 trade is better than the market ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#44",
                    "likes": "3",
                    "time": "08/09/2020-20:27:11",
                    "content": "    SebVentures:  Only whitelisted address from Maker can use it.   I oppose the whitelist. It monopolizes an arbitrage opportunity that should be permissionless. Whitelists should not be an alternative to security or good design. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#45",
                    "likes": "0",
                    "time": "08/09/2020-21:05:39",
                    "content": "    EdwardM290:      SebVentures:   The 1 DAI = 1$ of collateral is kept    This is literally the ONLY IMPORTANT THING that matters! Otherwise people searching for stablecoins will go away from DeFi projects like DAI!   It is not the only important thing. It is the least important thing of the 3 things:  DAI should stay decentralized DAI should be tradeable for $1 DAI should be backed by $1 of collateral  As we are witnessing for the last 6 months - we cannot have all 3 things at the same time so people searching for stablecoins are moving to USDC and other coins. It is important that people understand that they might not get $1 in the case of the ES even if DAI is backed by $1 of collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/EdwardM290",
                    "index": "#46",
                    "likes": "0",
                    "time": "09/09/2020-06:05:14",
                    "content": "    bit:  It is important that people understand that they might not get $1 in the case of the ES even if DAI is backed by $1 of collateral.   the problem is that people only look at results. No 1$ exchange ratio? Well, then they’ll just move to another stablecoin, no matter how DAI is safe and decentralized. Even if DAI is an awesome project, no one will use it if it can’t be traded for 1$ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#47",
                    "likes": "0",
                    "time": "09/09/2020-06:51:19",
                    "content": "    wjmelements:  I oppose the whitelist. It monopolizes an arbitrage opportunity that should be permissionless. Whitelists should not be an alternative to security or good design.   Removing the whitelist (or a USDC-A LR at 101%) would be providing a profitable arbitrage to others while leaving all the risk on Maker. How fair is that? We can say that USDC-M has an initial fee of 100% and open to anyone if that makes you better. Now, as no one will pay that except Maker (which pays to itself), can we agree to not implement it as it would be a waste? The concept of whitelist is already used by Maker for OSM feeds anyway. RWA will likely not be permissionless neither. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#48",
                    "likes": "4",
                    "time": "09/09/2020-10:44:09",
                    "content": "“Creating arbitrage privileges with inadequate risk only compensated by the special position of the privileged trader” should really fire up alarm bells. Either the proposed vault is risk-adequate and should be open to everyone, or it is not and should not be open for business. I remember Maker repeatedly being called a Rube Goldberg machine early on by people who didn’t take the time to get the simplicity behind the concept. I don’t want to see that criticism become valid. The PSM had a slight Rube Goldberg scent. This form of QE has an even stronger smell. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.056547619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#49",
                    "likes": "5",
                    "time": "09/09/2020-11:34:52",
                    "content": "Aight, so the end result of this is:  24 Yes 14 No 17 Abstain.  Ignoring the abstain votes, that puts yes with a majority over no. In general, this would be the sort of signal that I think fits better as a Declaration of Intent under MIP13. Especially given that the Foundation teams are not able / willing to implement it. However, given the state of the peg and the DAI supply right now, I think this is reasonable to put on-chain as a poll next week. I will emphasise that the poll won’t really have any power to cause this to happen and someone outside the Foundation would need to pursue it in order for us to see results. However, it will open the door to a strong signal from MKR token holders that might prompt further action from the more technically minded community. @SebVentures please submit a PR with the poll wording on the community github today, and I’ll put it on-chain next Monday. Happy to discuss the contents with you whenever. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.852513227513228
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#50",
                    "likes": "2",
                    "time": "17/09/2020-16:38:37",
                    "content": "The on chain poll result was against this proposal (19k for, 5k against). MakerDAO decided in the meantime to push USDC-A at 103% (then 101%) which seems to work. I still believe that it would have been better to gives the profit to MKR holders. Moreover we are not able to diversify the current 200M USDC. In the same time, I get the issue with MakerDAO having assets and manually manage them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#51",
                    "likes": "0",
                    "time": "24/09/2020-13:07:44",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2649"
}