{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/una-estrella-del-norte-dai-como-un-destino-traduccion/16326",
            "title": "Una Estrella del Norte - DAI Como un Destino (Traducci\\xc3\\xb3n) ",
            "index": 16326,
            "category": [
                "Latin America"
            ],
            "tags": [
                "traducci\\xc3\\xb3n",
                "finanzas-del-mundo-real"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#1",
                    "likes": "12",
                    "time": "04/07/2022-21:17:53",
                    "content": " Una Estrella del Norte: DAI como el Destino Referencias Charting a Path for RWAs - The Case For Continuity 5 Aggressive Growth Strategy 1 Maker Growth Strategy - We Must Act Now 3 A Balance Sheet Approach to Executing an Aggressive Growth Strategy 4  Preámbulo El sobre-colateralizado ecosistema B2C de préstamos cripto es un océano rojo: es un negocio competitivo que está siendo comoditizado delante de nuestros ojos. Adquirir nuevos clientes es costoso, la rotación es considerablemente alta y el resultado marginal va a tender a cero. Es momento de ver más allá de la punta de nuestras narices y empezar a posicionarnos para la próxima fuente de demanda de créditos on-chain.  1064×692 130 KB   Aumentando la Demanda Orgánica de DAI Las organizaciones exitosas se alinean alrededor de una única misión central. En mi opinión, generar demanda orgánica de DAI es la razón de ser de MakerDAO, su Norte. La demanda orgánica es diferente a circulación, lo que es bueno, pero no suficiente. Abordar RWAs implica aumentar la circulación de DAI, pero no necesariamente su demanda orgánica. (en una especie de orden secundario, RWAs podría incrementar la demanda orgánica, pero mantengámonos con el orden primario por el momento). Cuando un gestor de activos del mundo real crea una vault, muy probablemente hará un swap de DAI por dinero FIAT para conseguir algo off-chain, como desarrollos en bienes raíces o realizar un pago en una línea de crédito preexistente. DAI es un medio para un fin . Por otro lado, cuando un usuario de cripto crea una vault de DAI, él o ella probablemente utilizará el DAI provisto ellos mismos para conseguir algo on-chain, como proveer liquidez. DAI es un destino . La razón por la cual nosotros queremos maximizar el DAI orgánico es porque es más rígido. En el mundo tradicional, para un banco minorista los depósitos son rígidos (baja tasa de redención) y por lo tanto son una fuente estable de ingresos para estas instituciones. De manera similar, todo el DAI impago es un riesgo del protocolo – MakerDAO debe honrar siempre las redenciones en el momento en que son requeridas, con el fin de que el mercado no pierda confianza en él. Por lo tanto, la manera en la que MakerDAO podría implementar el capital productivamente está dictada por la naturaleza de esos riesgos. Si las redenciones son consistentemente escasas (DAI rígido), entonces MakerDAO puede tomar riesgos mayores y a mayor plazo en iniciativas de negocios (D3Ms, RWAs, etc) que generen ingresos al protocolo. Este incremento en los ingresos reforzará la percepción del mercado sobre DAI, lo que lleva a mayor demanda orgánica, lo que abre más y diversas oportunidades para ingresos, y así sucesivamente. El dinero es una red, y como tal, debemos enfocarnos en sentar las bases para que se dé un efecto de red. Aunque muchos se burlan de las rewards insostenibles que Anchor actualmente otorga a sus discípulos, tanto UST como DAI vivirán o morirán por la misma razón: casos de uso o la falta de ellos .  707×384 31.8 KB   Crecimiento Agresivo – Enmarcando la Recaudación de Fondos El núcleo de MakerDAO es su negocio de préstamos cripto de carácter directo. Este kernel debería mantenerse rígido, descentralizado al máximo y sin necesidad de permisos. Este negocio arroja beneficios y seguirá creciendo pasivamente al ritmo en que crezca la capitalización de las criptomonedas. Con suerte obtendremos una mayor porción del mercado vía las L2s conforme esos proyectos se vayan implementando. El PSM, la segunda capa de Maker, debería ser un poco más flexible pero también mantenerse bastante rígido. El mecanismo central no debería cambiar demasiado, pero sus elementos pueden variar a medida que DAI produzca alianzas estratégicas con otras stables. Las capas D3M y RWA es donde se aloja el potencial latente de Maker – a través de las implementaciones en estas capas, el excedente que se genere impulsará una nueva era de crecimiento agresivo y rentable. Es una cuestión de supervivencia, la experimentación ocurrirá en las placas de Petri de RWA y D3M. Los RWAs, en su estado actual, son una enorme oportunidad para la circulación de DAI y para obtener ganancias, pero no aún para la demanda orgánica de DAI. Como el mundo real está atascado en dependencias económicas, técnicas y legales, DAI por algunos años no penetrará orgánicamente en los mercados de capitales existentes. Para que eso suceda, se requeriría que los “usuarios” cambien su comportamiento, lo que no es razonable.  1310×655 57.7 KB  Como debe ser, la comunidad está comprometida con la persecución de RWAs off-chain. Nosotros, RWF, forjaremos excelentes asociaciones con excelentes gerentes. No sólo estas vaults obtendrán MONTONES de ganancias, sino que las asociaciones con firmas y compañías ya establecidas potenciarán y legitimarán la marca Maker. A medida que el negocio de RWA madure, RFW impulsará para innovar en el protocolo de RWA. A través de estos esfuerzos y los de nuestros pares, activos del mundo tradicional prontamente estarán viviendo nativamente on-chain. Pero nosotros no podemos esperar hasta ese día – es imperativo encontrar hoy PMF para el DAI orgánico. Necesitamos casos de uso orgánico que transportarán a DAI hasta el Valhalla. Agressive Growth seguirá hacia adelante. Al momento de pensar cómo MakerDAO debería estructurar su inminente aumento de capital y en qué cantidad, debemos considerar la variedad de oportunidades de crecimiento que nosotros, como una comunidad, creemos que otorgarán las propiedades específicas que tengan mayor potencial de dirigir a MakerDAO hacia el éxito. Sólo a través de la consideración mesurada de los “usos” podemos volver inteligentemente hacia las “fuentes” de los mercados de capitales.  798×368 51.8 KB   Empezar Con Start-Ups  1600×1002 356 KB  El inicio de Square se basó en la premisa de este diagrama: que los negocios pequeños pagaban en 2009 ~45x más por soluciones de pagos que los negocios más grandes. Al habilitar la digitalización de los pagos SMB, Square desbloqueó el potencial latente de sus clientes y se aprovechó de él. El producto The Square estaba bien pero fue el ajuste entre su producto único y el mercado correcto (ajuste producto-mercado) lo que fue excelente. Dai es nuestro producto. El éxito, desde mi punto de vista, yace en los usos orgánicos para DAI, entonces ¿cómo creamos más de estas oportunidades? Como Paul G sugiere, hay que poner el producto (DAI) en manos de las start-ups. Porqué empezar con start-ups es ir de la nada a todo:   Tabula Rasa : Las start-ups son inherentemente más propensas a adoptar y utilizar DAI orgánicamente.  DAO Jones : Las empresas emergentes digitales y cripto-nativas de hoy serán los nombres más importantes del ciberespacio en 2030. Si esta cohorte de unicornios es la DAO Jones, Maker debería ser JP Morgan.  Posicionamiento Único : A diferencia de RWAs o de los préstamos-cripto, MakerDAO está en una posición única para inyectar star-ups con DAI y liberar su potencial. Ningún otro prestador tiene una stablecoin nativa. Ningún otro emisor de stablecoins tiene un negocio de préstamos nativo.   D3M – La Bujía de Arranque El D3M es en este momento el utensilio de la caja de herramientas de Maker mejor equipado para hacer frente a esta visión. Más allá de la creencia de que su forma corriente cambiará, el D3M sirve como una campana para lo que va a venir, un acercamiento híbrido – un back-end criptográfico, protocolo-a-protocolo, que permita actividad comercial. El D3M es la prueba piloto de MakerDAO como un prestamista mayorista – les presta a prestadores cripto-céntricos como Aave y a prestadores cripto del mundo real como Mapel o TrueFi, quienes luego tratan directamente con los prestatarios. El D3M es interesante porque les da a los negocios, más que a los individuos, acceso predecible al crédito. En última instancia, la distinción entre “RWAs” y el “D3M” desaparecerá. Esto sucede a través de dos canales paralelos:  Los rieles del mundo real migran nativamente on-chain. Los activos familiares al mundo de las finanzas tradicionales (acciones, bonos, derivados) son emitidos por entidades que viven nativamente on-chain.  A partir de ahora, la diferencia percibida entre como MakerDAO categoriza RWAs y D3Ms yace en cómo se clasifica el riesgo y por lo tanto qué core units tienen la responsabilidad de evaluarlo. El D3M, supuestamente, incurre en riesgos relacionados al Smart contract, pero no en riesgos de crédito. RWAs, supuestamente, incurre en riesgos crediticios, pero no en riesgos relacionados al Smart contract. Ninguna de las caracterizaciones es realmente correcta. Como nos estamos dando cuenta con la potencial incorporación de Maple y TrueFi, no sólo existe el riesgo del Smart contract sino también el riesgo crediticio. Con las integraciones de RWA como Cetrifuge, Maker incurre no solo en riesgo crediticio al nivel de activo/prestatario, sino también en riesgo de Smart contract al nivel de plataforma. Para la siguiente cohorte de activos de MakerDAO, esta bifurcación será irrelevante. Estos activos pueden oler y parecer como activos de riesgo tradicionales (Acciones, bonos, derivados, inmobiliarios), pero existen completamente on-chain. Más que basarse en contratos legales, la próxima serie de start-ups incorporarán dichos activos en Smart contracts.  1016×1232 62 KB  Yo creo que MakerDAO, va a adoptar y debería adoptar un enfoque cada vez más estricto respecto a la generación de DAI. Por un lado, prestará a fintechs y DAOs principalmente de manera mayorista. Esto se hará a través de un mecanismo de préstamos similar al de D3M pero con una garantía suficiente de los prestamistas especializados así como de su clientela (ingeniería + finanzas del mundo real). A esto lo llamaremos B2B DAI . Por otro lado, MakerDAO prestará grandes montos a minoristas e instituciones directamente contra cripto y activos relacionados a cripto en una manera que sea accesible para los prestatarios. A esto lo llamaremos EZ DAI .  Modelo 1: B2B DAI Obtener y mantener consumidores es difícil en cualquier espacio, aún más los préstamos cripto. Los prestatarios cripto se han acostumbrado a recompensas por adopción, lo que puede resultar en emisiones dilutivas y costosas. Sabemos que ese tipo de incentivación no es sostenible, pero este es el estado de las cosas hoy. La naturaleza de código abierto del ecosistema hacen que las condiciones sean más traicioneras todavía: ataques vampiro, una serie infinita de opciones de crédito, y una erosión generalizada de lealtad hacia la marca se han convertido en la norma. El mundo de préstamos B2C es difícil y sólo se está volviendo cada vez más difícil.  718×650 71.1 KB  Fuente Recurly Research Prestándole a negocios que crean valor económico, el financiamiento de un prestamista es más rígido, con menores costos de adquisición y de administración de clientes, y puede convertirse en el éxito comercial del prestatario. Mientras que el mercado de préstamos comerciales en TradFi está saturado, el mercado de préstamos comerciales on-chain no ha sido explotado aún. MakerDAO debería encabezar y desbloquear estos mercados de crédito, un océano azul. Al medir correctamente el riesgo crediticio, comenzaríamos con un portfolio de baja exposición y creceríamos en estos negocios. A medida que los exitosos maduran y eliminan el riesgo, MakerDAO aumentaría las líneas de crédito, alivianaría los convenios y los precios, y habilitaría a estas empresas a crecer sin obstáculos hacia su potencial.  1474×628 77.9 KB  Para llevar : No existe un prestamista comercial institucional para el comercio on-chain. Los mercados de capital para DAOs, o más ampliamente la financiación de DAO a DAO, aún están subdesarrollados. En los próximos meses, seremos testigos de la génesis del mercado de bonos corporativos on-chain a través de plataformas como Porter Finance. A diferencia de sus contrapartes del mundo real, muchas DAO optarán por pagar los costos operativos (indexación, nómina, etc.) en DAI. Más especulativamente, preveo que también vamos a ver demanda por integraciones nativas de stablecoins en mundos de cripto gaming: conceptos de “metaverso” exitosos (por ejemplo, Crabada, Star Atlas, Illuvium) sirven como la puerta de entrada para que los normales ingresen a nuestro mundo enrarecido. Tendrán mercados vibrantes de capital, alquileres, comerciales y laborales. Debido a que las economías (de juego) son tan notoriamente difíciles de controlar y balancear, la integración de una stablecoin sin permisos puede ser una solución elegante. MakerDAO a través de rigurosas suscripciones sobre negocios on-chain y los intereses de seguridad garantizados por Smart-contracts en los activos nativos de esos negocios, movilizará simultáneamente capital muerto, impulsará el comercio on-chain, y generará fuertes retornos ajustados al riesgo para la tesorería de MakerDAO. MakerDAO está equipada de manera única para cumplir este rol como LA prestamista mayorista on-chain.  Modelo 2: EZ DAI (Dai Para Normales) Las vaults cripto, donde DAI es minteado contra activos Lindy como wBTC y ETH, son obviamente ideales porque el riesgo de pérdida es bajo (y monitoreable) siempre que los Smart contracts estén firmes y los oráculos estén en lo correcto. En su formulación corriente, las vaults cripto son excelentes para los expertos en cripto pero inaccesibles para los normales, ya sean individuos o instituciones. Aquellos que estén incómodos con la auto custodia, el cambio de tasas crediticias, o simplemente con maniobrar on-chain no pueden y no usarán Maker – esto deja muchísima demanda potencial de DAI sin explotar. Poder movilizar una porción de las cripto paralizadas en billeteras de custodia sería expandir el TAM para DAI drásticamente. Una nota respecto a las definiciones: Voy a usar el término “Vaults de Acceso” para describir lo que la comunidad de MakerDAO históricamente ha llamado “Vaults Institucionales” (por ejemplo, Nexo, Celsius). Estos son agregadores que custodian fondos minoristas y desean ganar acceso directo a liquidez de DAI. Voy a usar el término “Vaults Corporativas” para referirme a las vaults extendidas específicamente a compañías/instituciones quienes no necesariamente enfrentan usuarios minoristas. Vaults de acceso : Los Nexos y los Celsiuses del mundo, empresas emergentes con un back-end criptográfico y un front-end normal, se están multiplicando y adoptando nuevas formas. En la actualidad, la mayoría de las empresas emergentes minoristas que comercian con cripto son, de una forma u otra, exchanges. Pero esto cambiará rápidamente. A medida que cripto continúe normalizándose y, presumiblemente, se vuelva menos volátil, veremos que surgen vías convenientes que permiten a las personas monetizar sus tenencias de cripto como lo harían con sus acciones de S&P o viviendas. MakerDAO debería asociarse tácticamente con empresas emergentes que se beneficien de esta tendencia. Para visualizar, piensen en el aumento invariable de las cripto-hipotecas, o en un préstamo garantizado por cripto Y A LA VEZ por bienes raíces. Las start-ups como Figure y Moon Mortgage reconocen que: A) una hipoteca tradicional se está volviendo inaccesible y B) que cada vez más prestatarios potenciales poseen criptomonedas. Por lo tanto, combinan el colateral cripto del deudor hipotecario (sí, el prestatario es un deudor hipotecario) con el colateral en bienes raíces y ofrecen mejores condiciones que los competidores que no pueden o no están dispuestos a aceptar cripto como colateral. Al igual que Nexo y Celsius, este tipo de empresas eventualmente tendrán la custodia de cientos de millones en cripto de minoristas con las que querrán apalancarse y reinvertir en sus negocios. MakerDAO debe evolucionar continuamente y reevaluar hacia donde va la pelota. Proporcionar capital a los exchanges es un negocio saturado. Además, los exchanges son un objetivo natural para las regulaciones: serán sensibles a problemas relacionados con el KYC/AML. ¿Cómo podemos volver a imaginar qué forma toma una “Access Vault” para asegurar que DAI navega elegantemente a través de las tormentas de la destrucción creativa? Vaults Corporativas : Puede ser muy temprano para los bonos Bitcoin, pero los préstamos a plazo garantizados en cripto para clientes corporativos están en el menú. Silvergate Bank recientemente originó un préstamo colateralizado en bitcoin para Saylor’s MicroStrategy valuado en US$ 205MM. ETH y BTC serán utilizados cada vez más como activos del tesoro por fondos de riqueza soberanos, bancos centrales y corporaciones. En ese sentido, dichas entidades querrán préstamos a tasas atractivas en relación a esas participaciones. Como fue mencionado en el epílogo de “RWAs – The Case For Continuity”, un entorno de tasas crecientes genera oportunidades para prestamistas de tasas fijas, predecibles y baratas. El costo del capital para empresas (¡y gobiernos!) está creciendo y probablemente siga creciendo. ¿En qué momento se vuelve un imperativo fiduciario para un CFO el solicitar préstamos más baratos contra cripto que lo que podría conseguir en el mercado de bonos empresariales? Hay una oportunidad aquí y los inteligentes niveles-C la aprovecharán. MakerDAO está equipada de manera única para servir en esta intersección – la que existe entre las garantías cripto y las tradicionales. Tenemos equipos internos para construir tanto la implementación técnica de las vaults sólo-cripto como el marco crediticio para proveer financiamiento más creativo a clientes particulares. (Por ejemplo, imaginen una vault colateralizada en cripto y ASIC para un minero institucional).  Pagos – La Pieza Final Una discusión sobre la demanda de DAI orgánico estaría incompleta sin considerar los pagos de la última milla. Sin una puerta de enlace a través de la cual DAI fluya de forma nativa hacia el mundo real, DAI fallará en penetrar en el espacio físico. Nos gustaría que DAI sea un medio de cambio, no solamente para NFTs y comercio-cripto sino para compras del día-a-día. Tal objetivo es prácticamente imposible de lograr en la red principal, pero existen asociaciones obvias que se deben perseguir con un optimismo cauteloso.  “Quien controla el dinero controla el mundo” – Kissinger La Estrella del Norte para la Estrategia de Crecimiento Agresivo y MakerDAO en términos más generales es potenciar la demanda orgánica de DAI – el viaje hacia DAI como dinero. Si esta es realmente la misión, entonces deberíamos orientarnos sin descanso hacia los vehículos que nos llevarán allí. Para mí, los RWA en su formulación actual son un recurso provisional, una forma de hacer cabe DeFi en TradFi. Pero la siguiente etapa de crecimiento de Maker será una forma única de financiamiento que solo MakerDAO puede dar vida. El D3M y los RWA se fusionarán en un único mecanismo de implementación para introducir a DAI en los cimientos de un motor económico nuevo, paralelo y no correlacionado. Esta es una traducción libre del post “The North Star - DAI as a Destination\" de @teej Créditos: Traducción @Gonzalo_Napolitano - Revisión @FuchoCrypto ",
                    "links": [
                        "https://forum.makerdao.com/t/aggressive-growth-strategy/13958",
                        "https://forum.makerdao.com/t/maker-growth-strategy-we-must-act-now-part-1/14501",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://recurly.com/research/churn-rate-benchmarks/",
                        "https://vulpine.substack.com/p/nfts-digital-property-rights?s=w",
                        "https://www.figure.com/",
                        "https://www.moonmortgage.io/",
                        "https://cointelegraph.com/news/michael-saylor-financial-markets-are-not-quite-ready-for-bitcoin-bonds",
                        "https://finance.yahoo.com/quote/JNK/chart/#eyJpbnRlcnZhbCI6ImRheSIsInBlcmlvZGljaXR5IjoxLCJ0aW1lVW5pdCI6bnVsbCwiY2FuZGxlV2lkdGgiOjQuNDY4NTAzOTM3MDA3ODc0LCJmbGlwcGVkIjpmYWxzZSwidm9sdW1lVW5kZXJsYXkiOnRydWUsImFkaiI6dHJ1ZSwiY3Jvc3NoYWlyIjp0cnVlLCJjaGFydFR5cGUiOiJsaW5lIiwiZXh0ZW5kZWQiOmZhbHNlLCJtYXJrZXRTZXNzaW9ucyI6e30sImFnZ3JlZ2F0aW9uVHlwZSI6Im9obGMiLCJjaGFydFNjYWxlIjoibGluZWFyIiwic3R1ZGllcyI6eyLigIx2b2wgdW5kcuKAjCI6eyJ0eXBlIjoidm9sIHVuZHIiLCJpbnB1dHMiOnsiaWQiOiLigIx2b2wgdW5kcuKAjCIsImRpc3BsYXkiOiLigIx2b2wgdW5kcuKAjCJ9LCJvdXRwdXRzIjp7IlVwIFZvbHVtZSI6IiMwMGIwNjEiLCJEb3duIFZvbHVtZSI6IiNmZjMzM2EifSwicGFuZWwiOiJjaGFydCIsInBhcmFtZXRlcnMiOnsid2lkdGhGYWN0b3IiOjAuNDUsImNoYXJ0TmFtZSI6ImNoYXJ0In19fSwicGFuZWxzIjp7ImNoYXJ0Ijp7InBlcmNlbnQiOjEsImRpc3BsYXkiOiJKTksiLCJjaGFydE5hbWUiOiJjaGFydCIsImluZGV4IjowLCJ5QXhpcyI6eyJuYW1lIjoiY2hhcnQiLCJwb3NpdGlvbiI6bnVsbH0sInlheGlzTEhTIjpbXSwieWF4aXNSSFMiOlsiY2hhcnQiLCLigIx2b2wgdW5kcuKAjCJdfX0sImxpbmVXaWR0aCI6Miwic3RyaXBlZEJhY2tncm91bmQiOnRydWUsImV2ZW50cyI6dHJ1ZSwiY29sb3IiOiIjMDA4MWYyIiwic3RyaXBlZEJhY2tncm91ZCI6dHJ1ZSwiZXZlbnRNYXAiOnsiY29ycG9yYXRlIjp7ImRpdnMiOnRydWUsInNwbGl0cyI6dHJ1ZX0sInNpZ0RldiI6e319LCJjdXN0b21SYW5nZSI6bnVsbCwic2V0U3BhbiI6eyJtdWx0aXBsaWVyIjoxLCJiYXNlIjoieWVhciIsInBlcmlvZGljaXR5Ijp7InBlcmlvZCI6MSwiaW50ZXJ2YWwiOiJkYXkifX0sInN5bWJvbHMiOlt7InN5bWJvbCI6IkpOSyIsInN5bWJvbE9iamVjdCI6eyJzeW1ib2wiOiJKTksiLCJxdW90ZVR5cGUiOiJFVEYiLCJleGNoYW5nZVRpbWVab25lIjoiQW1lcmljYS9OZXdfWW9yayJ9LCJwZXJpb2RpY2l0eSI6MSwiaW50ZXJ2YWwiOiJkYXkiLCJ0aW1lVW5pdCI6bnVsbCwic2V0U3BhbiI6eyJtdWx0aXBsaWVyIjoxLCJiYXNlIjoieWVhciIsInBlcmlvZGljaXR5Ijp7InBlcmlvZCI6MSwiaW50ZXJ2YWwiOiJkYXkifX19XX0-",
                        "https://www.coindesk.com/business/2022/04/21/stripe-taps-polygon-to-allow-customers-to-make-payments-in-usdc/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.592142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "6",
                    "time": "04/07/2022-22:41:31",
                    "content": "Tremenda traduccion y gran aporte, no me daba tiempo de leerlo pues no domino el ingles pero gracias a que esta traducido ya puedo leerlo! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#3",
                    "likes": "2",
                    "time": "05/07/2022-03:48:28",
                    "content": "Gracias Diego, es un tema muy interesante para debatir! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Valen_Gayone",
                    "index": "#4",
                    "likes": "5",
                    "time": "05/07/2022-14:50:12",
                    "content": "Muchas gracias por la traducción y la revisión @Gonzalo_Napolitano @FuchoCrypto Muy buen trabajo! es re interesante y te invita a conocer y estudiar un poquito más, sobre todo para aquellos que somos nuevos en esto. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/07/2022-15:10:24",
                    "content": "Gracias Valen! Estoy de acuerdo. Nos sirve a todos para aprender y motivarnos a indagar un poco más profundo cada vez. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#6",
                    "likes": "7",
                    "time": "06/07/2022-07:37:12",
                    "content": "    Gonzalo_Napolitano:  Una discusión sobre la demanda de DAI orgánico estaría incompleta sin considerar los pagos de la última milla. Sin una puerta de enlace a través de la cual DAI fluya de forma nativa hacia el mundo real, DAI fallará en penetrar en el espacio físico. Nos gustaría que DAI sea un medio de cambio, no solamente para NFTs y comercio-cripto sino para compras del día-a-día. Tal objetivo es prácticamente imposible de lograr en la red principal, pero existen asociaciones obvias que se deben perseguir con un optimismo cauteloso.   Gracias por la traducción @Gonzalo_Napolitano. Que gran importancia cobran estos planteamientos acerca de la necesidad de la penetración del DAI en el mundo real y que su utilidad vaya mucho más allá de nuestra esfera, lamentablemente minoritaria por ahora. Cada vez que leo en el post donde son reseñadas las noticias, una buena nueva como que una flota que transporta alimentos cárnicos o que una distribuidora de vinos están aceptando DAI, por mencionar dos ejemplos, me llena de gusto y satisfacción, y me impulsa a seguir confiando en el DAI como la moneda predilecta para mantener mis ahorros. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Valen_Gayone",
                    "index": "#7",
                    "likes": "6",
                    "time": "06/07/2022-11:48:04",
                    "content": "Totalmente de acuerdo con vos! Cada día somos mas los que tenemos nuestros ahorros en cripto y Dai específicamente. Es bueno saber como impacta o el alcance que tiene esta moneda, como vos decís, en el mundo real. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#8",
                    "likes": "2",
                    "time": "07/07/2022-17:07:44",
                    "content": "Excelente traducción Gonzalo  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#9",
                    "likes": "1",
                    "time": "07/07/2022-17:30:14",
                    "content": "Gracias Ale! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#10",
                    "likes": "3",
                    "time": "07/07/2022-17:51:09",
                    "content": "Lectura ideal y diría que casi obligada con los tiempos que corren, excelente trabajo gente @Gonzalo_Napolitano @FuchoCrypto ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#11",
                    "likes": "4",
                    "time": "08/07/2022-07:46:48",
                    "content": "Gracias @nahueth. Que nuestra comunidad latinoamericana siga creciendo, y como comentabas en otra publicación, es hora de subir el nivel y comenzar a crear, aparte de traducir que -ojo- sigue siendo muy importante ya que necesitamos que se unan más colaboradores, sigue habiendo mucha información interesante por llevarla a nuestro idioma pero las limitaciones y compromisos de cada uno no nos permite ser más constante de lo que quisiéramos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#12",
                    "likes": "2",
                    "time": "08/07/2022-13:04:08",
                    "content": "Adhiero @FuchoCrypto, de a poco vamos a ir creciendo para poder abarcar más y mejores tareas ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#13",
                    "likes": "4",
                    "time": "08/07/2022-21:55:34",
                    "content": "Unidos no solo aumenta nuestro numero sino que somos mas fuertes, podemos esto y mas, arriba mi gente! Creo que mas pronto que tarde vamos a estar en presencia de producciones orgánicas de nuestra comunidad, sin duda estamos transitando un sendero para que no solo la información sea accesible para todos sino también para consolidar nuestros aportes al foro, en el meantime iremos perfeccionando nuestro conocimiento en los mecanismos y datos que desarrollan y sostienen nuestro querido protocolo para poder colaborar y ayudar(nos) tanto a los newcomers como a los que ya tenemos un tiempo por estos lares. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}