{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/launch-a-grand-mkr-yield-framing-program-that-sends-dai-to-100b-market-cap/5873",
            "title": "Launch a grand MKR yield framing program that sends Dai to 100B market cap ",
            "index": 5873,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/aliatiia",
                    "index": "#1",
                    "likes": "8",
                    "time": "02/01/2021-19:01:42",
                    "content": "This is a temperature check for whether the community is open to launching a grand yield farming program where MKR is awarded as yield in return for minting Dai. The assumption here is that at a high enough level of liquidity, the peg will be more robust and governance/community can turn its focus to other things like adoption, fiat on-ramp etc. Some initial thoughts to kick start the discussion:   MKR yield comes from existing foundation reserves and/or inflation   lobby comp/aave to add MKR as collateral so that existing holders can borrow against and participate in yield farming as well   yield is exponentially proportional to vault’s age … so drive-by farming whales don’t make much yield. example: a 2-year old vault gets 4X yield as a 1-year-old vault   a {Dai, USDC} reserve is created, aiming to keep ~10% of Dai market cap; this reserve is used to buy Dai with USDC or sell Dai into USDC to modulate the peg   negative interest rates are introduced   the yield farming contracts are not built anew, tried and tested contracts in DeFi can be used; this allows the farming program to launch quickly without worrying about introducing potential vulnerabilities to existing code base.    ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-24/6052",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-3rd-2021/5950",
                        "https://forum.makerdao.com/t/weekly-mips-update-23/5914"
                    ],
                    "GPT-summary": "The author is proposing a grand yield farming program where MKR is awarded as yield in return for minting Dai. The proposal aims to increase liquidity and make the peg more robust. The author suggests using existing foundation reserves and/or inflation to provide MKR yield, creating a {Dai, USDC} reserve, introducing negative interest rates, and using tried and tested contracts in DeFi. The author is asking for feedback and suggestions from the community. Some initial thoughts are provided to kick start the discussion.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.381547619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#2",
                    "likes": "6",
                    "time": "02/01/2021-19:09:18",
                    "content": "Antarctica here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#3",
                    "likes": "1",
                    "time": "02/01/2021-19:19:06",
                    "content": "It’ll be very very hard that MKR holders vote for something where they’ll be diluted. TBH, I think that with the current yield-farming craze, this should work and MKR price could skyrocket instead of getting lower (at the very end, it does it everyday with coins that have 0 value to start with). But convince all the MKR holders of this will be very hard IMO. A possibility will be to make a re-deployment of most part of the platform, with MKR2 tokens, and supported by the same team and community, that means, MKR holders will vote on the new platform, new MKR2 holders will be able to vote only in that version of the platform. With MKR2 tokens having the risk only of that “v2”, and MKR risk is only in the current platform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.183712121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Demelain",
                    "index": "#4",
                    "likes": "1",
                    "time": "02/01/2021-19:22:17",
                    "content": "100% support from this corner (have owned x,xxx mkr since 2016). These are critical features MKR needs to adopt to thrive. It made sense to let others battle test new features, (yield farming, algorithmic stuff) and move slow. I think these concepts are sufficiently tested and it’s time to adopt. I normally don’t comment, but this gets my full support in this forum and in an executive vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.336363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#5",
                    "likes": "17",
                    "time": "02/01/2021-19:40:29",
                    "content": "Haven’t we seen how Compound turned into a zombie protocol after yield farming was introduced? Numbers in billions look good but what is the point of using Dai as collateral to mint cDai within Compound? Whom do these ponzinomics help other than a select few pump-and-dumpers and does it even stimulate any real activity? I think all numbers within MakerDAO are in a great place right now(yes, even MKR price). We don’t have to take the the sentiment created by a few trolls on Twitter seriously. We should just continue to grind as we’ve been doing the past five years and devote our time to serious new experiments like RWAs etc. Having said that, i think we could always launch experiments with new tokens and introduce them through fair yield farming launches. Maybe a new Uniswap clone that only has Dai pairings, and has a special risk parameter support within the Maker Protocol for its LP tokens and no protocol fees? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.628212932900433
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#6",
                    "likes": "2",
                    "time": "02/01/2021-19:44:40",
                    "content": "I think we first have to figure out what change to the existing design we are willing to make in order to have both the peg and the censorship resistance. Then we can discuss farming. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aliatiia",
                    "index": "#7",
                    "likes": "2",
                    "time": "02/01/2021-19:59:31",
                    "content": "    smaugho:  It’ll be very very hard that MKR holders vote for something where they’ll be diluted.   An MKR holder thinking long-term however would realize that revenue from a 100B+ Dai mc should more than make up for dilution costs and fairly quickly, should this proposal pass temperature check we can do the math to illustrate to MKR holders what the future will be.     vamsi:  Haven’t we seen how Compound turned into a zombie protocol after yield farming was introduced?   That’s why I recommended time-weighted yield farming, so the program lasts, say, 4 years, and exponentially favoring “resident farmers”. There could also be a smooth emission curve independent of when the farmer closes vault (a farmer gets their MKR smoothly overtime, not at the time of closing vault).     bit:  I think we first have to figure out what change to the existing design we are willing to make in order to have both the peg and the censorship resistance.   I am of the opinion that high Dai market cap will solve so many problems including these ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.097348484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#8",
                    "likes": "2",
                    "time": "02/01/2021-20:04:07",
                    "content": "    jernejml:  Antarctica here.   Hello from the North Pole! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Redacted003",
                    "index": "#9",
                    "likes": "0",
                    "time": "02/01/2021-21:26:07",
                    "content": "Why not just use $zai, https://zai.finance ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/freiza",
                    "index": "#10",
                    "likes": "3",
                    "time": "03/01/2021-00:38:59",
                    "content": "I think the general idea is interesting and worth thinking about.  I am a bit conflicted, and have some random thoughts below: Arguments against   The 100B Dai Marketcap is probably out of the question short term–it would imply a raise in the debt ceilings for our current vaults significantly, which would add a lot of additional risk.   The system is currently growing organically without the need for yield farming incentives, which is generally a bootstrapping mechanism to attract greater initial capital or a large uptick in locked value.  Even without this mechanism, Maker has the largest TVL in DeFi, which means we have reached product market fit. That being said, a yield farming program could lead to manic levels of growth, albeit short-term (as soon as the yield farming ends).  This manic level of growth doesn’t really jive well with our debt ceilings, which basically limits growth to account for risk.   I also do wonder how this would effect the MKR price, since MKR is not the asset that is locked in yield farming, but rather dumped by the farmers once acquired.   Arguments for   Retroactively rewarding users who have used and bootstrapped the Dai Credit system, is, IMO, a great thing to do and part of the DeFi ethos.  This was impossible in the early days of Maker because MKR existed prior to the Dai Credit System deployment.   If the idea is to grow Dai supply and accrue fees from this growth, special ‘yield farming’ vaults could be created, with high fees to account for greater risk.  This would directly lead to the yield farming program generating revenue for the protocol.  If we could successfully offset the costs, this investment just might be worth it.   Here’s a really naive example: lets say we use 50k MKR for the yield farming program.  At a price of $600 USD, this is a $30M opportunity cost.  If the ‘yield farming’ vaults have a debt ceiling of $500M, and fees at 10%, thats $50M in annual fees.  At $1B & 10% fees we would see $100m in fees.  We can play with the numbers obviously, but these fees burn MKR that would be minted for yield farming & more.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9267431972789115
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#11",
                    "likes": "0",
                    "time": "03/01/2021-11:27:43",
                    "content": "Definitely a good idea to do MKR yield farming on vaults, but the parameters are very important. IMO it has to be relatively low yield, and long term. The benefits of yield farming, especially when applied to Maker, are less about artificially pumping usage and TVL in the short term, and more about distributing MKR to loyal users, so they become more vested in the protocol rather than just use it until something more flashy comes along. Also to avoid stupid abuse the amount thats being distributed in MKR should obviously be less than the stability fees, so people dont just recycle money to farm and dont actually use the product. But if yield farming is done right, users will just see the MKR as a “buy 1 get 1 free” type of free bonus that gets them more aligned with the long term success of the protocol. Also strategically it would be a good idea to try to time this before compound launch their “maker killer” attempt, since it will obviously benefit from heavy yield farming right from the start that might give it a shot at a “vampire mining” type of attack similar to sushi vs uniswap. If maker preemptively has yield farming then the risk is completely mitigated, while also providing all the inherent long term benefits a moderate yield farming program would provide ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.524384236453201
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#12",
                    "likes": "0",
                    "time": "03/01/2021-11:43:51",
                    "content": "While I generally agree with:     jernejml:  Antarctica here.   I also agree with:     freiza:   Retroactively rewarding users who have used and bootstrapped the Dai Credit system, is, IMO, a great thing to do and part of the DeFi ethos. This was impossible in the early days of Maker because MKR existed prior to the Dai Credit System deployment.    I am in favour of some kind of ‘marketing’ moves (not necessarily farming). For example: rewarding with 1MKR each wallet who has minted some DAI’s over the last 3 years would be interesting and perhaps a good investment. This is what the UNI token did, and I think it paid out pretty well in terms of popularity for them. In general, I know that there are some people (e.g., a couple of friends of mine) who in 2020 have abandoned Binance&Coinbase and are now managing their own wallet/keys, but are still not exposed to DeFi etc. It might be a good move to attract these profiles. Although rewarding those that already have used Maker, doesn’t exactly do that  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5092592592592595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#13",
                    "likes": "1",
                    "time": "03/01/2021-19:59:15",
                    "content": "It would be Artificial increase in DAI i have no clue what it has to do with MakerDAO mission even if profitable for MKR holders (which i doubt) It has nothing to do with MKR DAO promise (stady MKR burn as reward for providing decentralized stablecoin) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 2.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/refri",
                    "index": "#14",
                    "likes": "0",
                    "time": "03/01/2021-20:06:48",
                    "content": "Do we really want to grow that fast in volume? I am no never a friend of liquidity mining like compund did: depositing and lending just to earn rewards might be a good choice to attract capital but as DAI marketcap growth seems fine right now it seems simply not necessary to attract more volume. But what I would like to see is an increase in number of users. The number of vaults have more than doubled during 2020 but still the growth in users is lagging behind the growth in capital. Cause it’s quite expensive due to the high gas price many potential users with not-so-deep-pockets might stay away cause its not worth the gas to take out e.g. 2k Dai. This could be overcome if we offer some kind of incentive for opening a vault, possibly also for deposit and withraw. Thereby I would favor an incentive which isn’t dependend on the amount (or just within a small range to avoid fake accounts that are never intended to be used) but given per tx. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5624686716791985
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aliatiia",
                    "index": "#15",
                    "likes": "0",
                    "time": "03/01/2021-20:54:11",
                    "content": "    Adam_Skrodzki:  It would be Artificial increase in DAI i have no clue what it has to do with MakerDAO mission       refri:  Do we really want to grow that fast in volume?   one advantage of high liquidity is that Dai can become a viable alternative to USDT, meanwhile if the latter suddenly pops, there is enough Dai liquidity to absorb USDT’s entire market     refri:  This could be overcome if we offer some kind of incentive for opening a vault   This is an interesting point, the challenge here is sybil resistance however ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.53
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#16",
                    "likes": "3",
                    "time": "03/01/2021-22:10:21",
                    "content": "I think a good approach that could avoid the compound style recycling, is to have the yield farming be dependent on stability fees paid and be e.g. 50% of stability fees. So e.g. if you pay 2.5% per year in stability fees on your eth-a debt, you farm 1.25% of the value of your eth-a debt as MKR. Basically it halves the cost of your debt, but the rebate is given to you in MKR which is more fun and interactive, and potentially will create a lot of MKR holders who will then buy even more MKR, or just be more aligned with the protocol and less likely to switch to a competitor. Maker will always be earning a profit all in all, but the difference is that the MKR holders will be using MKR rewards to subsidize growth which means an overall lower profit, in return for more users and more long term value, and especially more long term community members who hold MKR ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.511904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/refri",
                    "index": "#17",
                    "likes": "0",
                    "time": "03/01/2021-22:14:31",
                    "content": "    aliatiia:  one advantage of high liquidity is that Dai can become a viable alternative to USDT, meanwhile if the latter suddenly pops, there is enough Dai liquidity to absorb USDT’s entire market   I see the point, as it looks like today, mainly USDC and Dai will have to absorb it. Thinking about the volume, not only the market cap of tether but even more your proposed 100B gives me some headache…What kind of securities can be used? USDC might not the best idea although it will be minted in large quantities if incentive is fine. Paying to backup the maker system with a competitor coin doesn’t seem resonable to me. Ether and btc vaults are the other possible sources, cause of their market cap but still…a volume of 100B?..this means about 150B locked value, i.e. more than the whole ether marketcap even after todays bull run. And regarding btc we have only access to the bridged part of it…and another problem I see: If the stories about tether-driven btc bull runs are at least partially correct especially btc might depriciate if tether fails. So still much to think about, but having some more thoughs about a possible tether failure seems worth the effort.     aliatiia:  This is an interesting point, the challenge here is sybil resistance however   this can be easily overcome by installing a limit (amount and maybe time) which you have to deposit and ofc the incentive shouldn’t be too high. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.777463054187192
                },
                {
                    "author_link": "https://forum.makerdao.com/u/refri",
                    "index": "#18",
                    "likes": "0",
                    "time": "04/01/2021-00:07:07",
                    "content": "agree, this seems a good way to limit the unwanted craze. edit: but cause of the small amouts for smaller vaults the payout might not be worth the gas…therefore it seems necessary to let the incentive accumulate over time with the possibility to withdraw later to the users choice…and also the incentives should be given per ether address if someone choose to open different vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.46875
                }
            ]
        }
    ]
}