{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-alm-forecast/16881",
            "title": "MakerDAO ALM forecast ",
            "index": 16881,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "alm",
                "sf-001",
                "longform"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "14",
                    "time": "28/07/2022-15:09:16",
                    "content": " Summary  This paper models the balance sheet over the next 18-month based on assumptions coming from CUs The solvency constraint (Capital at Risk < Surplus Buffer) is a limitation but should be manageable by allocating more carefully, reducing expenses and taking into account that some opportunities will not be concluded The liquidity constraint is not a concern, there is still an excess of 700M of liquidity in the tighter maturity (1-week) It is suggested that community use this work as a basis for discussing capital allocation for MakerDAO and strategic directions While liquidity is not an expected concern, the current Surplus Buffer limits our ability to invest if we want to above to the solvency constraint One could consider the current pipeline of assets as light, but it is already big enough to put all our Surplus Buffer at work If we exclude a capital raise, capital creation should be seen as the main current objective of MakerDAO  The key learning is that we need to get back to profitability with the current Surplus Buffer to increase it, invest more and grow faster.  If we can’t get back to profitability with the current Surplus Buffer we will get stuck   Beside hoping for better rates in DeFi, there is two solutions to this problem:  Reduce expenses Allocate to higher RoE investments     Open questions for the community Feel free to ask/discuss others questions.  Would you like to see a different high-level allocation? This one was bottom-up (deal we have, where does that lead us). Would you prefer the opposite process (community deciding asset allocation then community finding the deals)? Do you have a view on the constraints, of both solvency and liquidity, that MakerDAO should decide? (already asked before, still trying to get some thoughts) How should we optimize? All else being equal, we should invest in the highest RoE first. But reality is more complex than that. You can’t stop providing DeFi loans because TradFi rates are higher today. What are your thoughts about this subject?   Introduction The article balance sheet approach to executing an aggressive growth strategy called for CU collaboration to improve the input parameters and get a clearer view on the project’s pipeline. This work provides an 18 months forecast of the MakerDAO balance sheet. MakerDAO remains a startup operating in an uncertain and volatile market. It is also impossible to predict governance actions and wishes as MakerDAO is decentralized. It is one forecast of many that can be as valid as this one as all depends on assumptions. While the model is unlikely to be right, we will use it as a guide to infer learnings that might be valid even with deviations. The model source used for this analysis can be found here. The broader ALM framework can be found here.  Methodology The methodology remained similar to the original work but was extended in many ways:  While still regrouped into buckets (changed a bit see below), the assets are now more detailed, and we track 27 assets types We added a time component to model the evolution of the balance sheet over 18-months and taking into account the timeline of investments We added a more elaborated maturity profile taken from previous research   The asset categories are the following:  Crypto-vaults: previously crypto-backed loans. It is the same thing but adds DeFi Money Markets (D3M Aave and Compound). It was grouped as it is of the same nature, and we are now able to track maturity more precisely in another dimension. Crypto-assets: contains all crypto-related assets held outright by the protocol. It includes ETH holdings and Makershire redux. Due to the speculative nature of crypto-assets, the profit they should generate are not taken into account in recurring metrics nor in the Surplus Buffer. Private Credit: Previously RWA. RWA is confusing for people as it is used for risk weighted assets in TradFi. Public Credit: Previously Short-term bonds. Stablecoins: No change, it represents the PSMs, the stablecoins LP are considered as stablecoins for simplicity. No yield is currently attributed here but SF, in association with other CUs, is working on plans to deliver permissionless on-chain RoA without divesting or reallocating away from stablecoins.  The table below presents the main characteristics of each asset type. Each asset is attached to a category (described above) and given an owner within MakerDAO CUs. Then, you have the Return over Asset (RoA), which is the expected average return of this asset, and the Capital at Risk (CaR), which represent the possible loss that this asset might generate over a 1-year horizon. CaR multiplied by the exposure of an asset gives the proposed requirement in terms of equity (Surplus Buffer) to invest safely in such an asset. The next column, Return over Equity (RoE) is just the division of RoA by CaR and presents the expected possible return using the minimum amount of equity and a cost of DAI funding of 0%. The reader can refer to the ALM Framework for more details. The remaining columns are inputs to model exposure to those assets with a starting date (in the past for what is already present), a starting and ending debt ceiling (DC, assumed to be fully used), and a ramp up time in month which interpolate between starting DC and ending DC.  802×544 18.5 KB  For the expenses of MakerDAO we are using recent numbers and keeping them constant over time. As always, modeling is about trade-offs so there are plenty of limitations:  The model doesn’t take interest rate fluctuations, it is unlikely that rates will stays constant The model assumes a constant CUs expenses and doesn’t model MKR compensation We don’t model a change in DAI demand We don’t model a diversification effect   Results  Exposure The following chart shows the evolution in terms of exposure (asset allocated) in the different asset classes. As you can see there is an increase in crypto-vaults (IVs, L2/sidechains launches) and private credit (HVB, Centrifuge/Blocktower, …). Yet, the bulk of the increase on the public credit side with Monetalis/Clydesdale, Backed and two more unassigned short-term bonds buckets. Crypto assets, represented by ETH holdings and Makershire remain quite muted during this period.  1173×661 27.8 KB   MakerDAO profitability The chart below shows the annualized recurring net protocol income (rNPI) by contributors. The expense side (light pink) is kept constant and based on the current expenses. MKR compensation is not taken into account (but is one order of magnitude smaller at this price level). Crypto-vaults are providing the bedrock of revenues during the period but fail to compensate for the operating expenses. While both crypto-assets and private credit are providing revenues, those are not main drivers. The public credit investments are providing the bulk of the rNPI. Notice that while represented, crypto-assets are not contributing to the rNPI due to their speculative nature.  1203×678 16 KB  Overall, at the end of the period under study, revenue mix is leaning towards TradFi credit. This is mainly due to the depressed lending rate in DeFi. We expect that TradFi and DeFi rates will converge providing a more balanced revenue mix.  Capital adequacy According to the ALM Framework, we need to maximize revenue generation while keeping the solvency and liquidity constraints. Let’s start with the solvency constraint and check if we keep an adequate capital buffer (i.e. the Surplus Buffer). As you can see in the chart below, we start with a Surplus Buffer bigger than needed to sustain the financial risk generated by the assets (mainly crypto-vaults). The increase in crypto-vaults (due to institutional vaults and L2/sidechains MCD deployment) increases the equity needed over time. Nevertheless, the main Capital at Risk increase is driven by private and public credit in roughly the same proportion. We can see a period where the Surplus Buffer is lower than the Capital at Risk. The difference is, in our view, not a source of concern as it can be solved by adjusting public credit investments and/or returning operating wallets excess budgets to the Surplus Buffer. Community should nevertheless prioritize the allocation that makes the most sense. The balance sheet allocation should be optimized to generate some capital so we can invest more and generate even more capital. If we don’t get to a point of being profitable, we will not generate capital and be stuck.  1173×661 12.9 KB  Now that we have reviewed the solvency constraint, let’s move to the liquidity constraint.  Asset-liability mismatch The liquidity constraint is about being sure that the DAI holder will be able to redeem for a fiat-backed stablecoin at a PSM (see the Maturity risk in the ALM Framework). The expected redemptions of DAI are based on the DAI maturity profile. Maturity on the asset side is inferred from the underlying asset and the expected governance delay to take an action. For instance, crypto-backed loans are in the 1-month maturity bucket because governance would have to increase the stability fees (SF) or the collateral ratio (CR) to incentivize borrowers to unwind (which will take a bit of time as well). In the chart below, the darker the gradient, the longer the maturity with assets on the top and liabilities (DAI and protocol equity) on the bottom. There is no mismatch.  1173×661 10.6 KB  If we zoom in at the beginning and the end of the timeline we can see (on the left) that we start with a lot of very short-term investments (stablecoins), and we migrate them slowly over time to longer maturity assets. The liquidity gap (in purple) stays always above the zero line (meaning no maturity mismatch), and keeps a healthy buffer.  892×305 13.3 KB   Conclusion As we have seen in the exposure chart, MakerDAO is moving toward a more diversified balance sheet allocation to reduce its exposure to stablecoin and generate more revenues. While liquidity is not an expected concern, the current Surplus Buffer limits our ability to invest. One could consider the current pipeline of assets as light, but it is already big enough to put all our Surplus Buffer at work. If we exclude a capital raise, capital creation should be seen as the main current objective of MakerDAO. This is going back to profitability within the current Surplus Buffer constraint. Failure to do so will lead us to be stuck. While capital allocation should be optimized, it is important to remember that we live in a volatile world. While public credit is currently the best way (yet still untested) to generate revenues, this could change going forward if DeFi rates are increasing. If we start to have to pay the risk-free rate to DAI holders, private credit will be required to generate a spread due to the illiquidity premium. We might want to both optimize the short-term and build the foundation to be agile in the longer-term. ",
                    "links": [
                        "https://1drv.ms/x/s!Asg5FEQOu74tg2R3sdY-QCGFmknP?e=Qnceh8",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://forum.makerdao.com/t/modeling-dai-maturity/15961",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://forum.makerdao.com/t/mip76-makershire-redux/16400/1",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994",
                        "https://forum.makerdao.com/t/alm-framework-for-makerdao/12994#maturity-risk-15",
                        "https://forum.makerdao.com/t/modeling-dai-maturity/15961",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-may-june-and-july-2022/17037",
                        "https://forum.makerdao.com/t/the-business-thinktank-for-scientific-governance/15838/21",
                        "https://forum.makerdao.com/t/mip85-ldo-to-mkr-otc-swap/17714/36",
                        "https://forum.makerdao.com/t/updating-the-short-term-bond-strategy/18302",
                        "https://forum.makerdao.com/t/relay-semanal-02-08-de-agosto-del-2022/17223",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/9",
                        "https://forum.makerdao.com/t/unblocking-the-stalled-short-term-bonds-revenues-generating-initiatives/17073",
                        "https://forum.makerdao.com/t/mip39c2-sp-creating-rwf0x-from-a-split-of-rwf-001/16967/6",
                        "https://forum.makerdao.com/t/open-discussion-wen-mkr-burn/16947/8",
                        "https://forum.makerdao.com/t/build-your-makerdao-alm-model/18730",
                        "https://forum.makerdao.com/t/mip84c10-sp1-modify-emulated-surplus-buffer-upper-limit/18315"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.429296687109187
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#2",
                    "likes": "8",
                    "time": "28/07/2022-16:27:56",
                    "content": "Thanks for sharing this detailed forecast, its a great summary to visualize the expanding product mix and how it will start affecting expected NII. Its clear from this analysis that product diversification was a good decision, not only for DAI’s peg, but for revenue stabilization. Since vault usage is cyclical and dependent on asset prices, public and private credit markets will provide ongoing uncorrelated revenue.     SebVentures:   892×305 13.3 KB   Another very liquid and investable tranche maturity, usually used in ALM by TradFi, could be 3 or 6 months. There are usually a lot of investable options and with the yield curve flattening it could be better to keep flexibility by dividing among 3, 6 and 12 months rather than keeping it all in one year. Unless the 1 year column is reflective of all DAI maturities between 1 month and 12 months then the approach is consistent with the above recommendation.     SebVentures:  While capital allocation should be optimized, it is important to remember that we live in a volatile world. While public credit is currently the best way (yet still untested) to generate revenues, this could change going forward if DeFi rates are increasing. If we start to have to pay the risk-free rate to DAI holders, private credit will be required to generate a spread due to the illiquidity premium.   This is a great point.  As rates continue to rise and the real world economy slows (on a lag) as inflation calms down, product usage may differ (i.e., if the US enters a deeper recession than the technical one we’re in now, what products will customers gravitate to?), so the Maker community needs to continue to iterate on revenue generating products that are appropriate for various market conditions. Seems like we’re moving in the right direction! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.010491822991822
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#3",
                    "likes": "2",
                    "time": "02/08/2022-00:36:34",
                    "content": " How would USD yield curve impact asset allocation? Do we think this is beneficial or detrimental to existing initiatives ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "1",
                    "time": "02/08/2022-07:13:34",
                    "content": "The impact of a yield curve change is indeed a good question. The model assume that everything stays constant which obviously is not realistic but it simplifies both the construction of the model and the understanding. If rates goes up we will earn more interest income, if rates goes down we will earn less. As we will start to have some duration exposure, if rates are going down we will make a mark-2-market profit which will counterbalance the decrease in the interest rate for the short-term. Same on th other side but with a loss. Notice that something like Backed will be mark to market while MIP65 will be at historical cost (like all RWA) even for the same underlying, the IBTA ETF. It’s really accounting plumbing but so it is mentioned. I guess DeFi rates will converge with TradFi rates. This will increase our revenues. It might also increase our exposure to crypto-backed loans. To quote the FT:  Issuers of these stablecoins have thrived while nominal interest rates have been near zero. With high positive interest rates, the opportunity cost of holding zero-interest stablecoins increases and the issuers lose business.  Issuers of these stablecoins have thrived while nominal interest rates have been near zero. With high positive interest rates, the opportunity cost of holding zero-interest stablecoins increases and the issuers lose business. Sadly, that might come with the TradFi risk-free rate coming into DeFi. As discussed, earlier this might be a serious challenge for us. It will provide a serious competition to the DSR. When you have a TradFi DSR at 2.5%, it is difficult to sell a DSR at 1bps. SF CU is working hard on fixing that (MIP65 and Backed are a first answer) and hope to provide other solutions soon for community to discuss/decide. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-liquid-bond-strategy-execution/13148",
                        "https://www.ishares.com/uk/individual/en/products/287340/ishares-treasury-bond-1-3yr-ucits-etf",
                        "https://www.ft.com/content/c6585dea-e1f8-491e-bd2f-7373c5476794"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.047240927796484
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Freakytainment",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/08/2022-12:48:20",
                    "content": "Well it’s a nice  post you’ve got here @SebVentures well I’d like to contribute my idea to this. I feel the Maker community must continue to iterate on revenue generating products that are appropriate for various market conditions. As interest rates rise and the real world economy slows, product usage may differ. The community must continue to iterate on revenue generating products that are appropriate for various market conditions. As interest rates rise and the real world economy slows (on a lag) as inflation falls, product usage may differ. We appear to be heading in the right direction! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4732142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/WaterLily",
                    "index": "#6",
                    "likes": "0",
                    "time": "26/08/2022-16:39:03",
                    "content": "The maker community needs to keep refining goods that generate income and are suitable for varied market situations. Product consumption may change when rates continue to increase and the real world economy contracts (on a lag) as inflation eases. Since there are typically many investable possibilities, it can be preferable to maintain flexibility by dividing among 3, 6, and 12 months rather than holding it all in one year when the yield curve is flattening. The foundation of the period’s earnings is being provided by blockchain, but total costs are not being covered. Confidential finance and blockchain currencies both provide income, but they are not the primary drivers. If rates are declining as we begin to have considerable term exposure, For the short run, the increase in our mark-2 market earnings will balance out the decline in interest rates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "24/11/2022-16:39:38",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}