{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/flaw-in-the-display-of-ranked-choice-voting-outcomes/16044",
            "title": "Flaw in the display of ranked choice voting outcomes ",
            "index": 16044,
            "category": [
                "Governance"
            ],
            "tags": [
                "concerns"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#1",
                    "likes": "5",
                    "time": "25/06/2022-02:12:44",
                    "content": "There is a large problem with the way ranked-choice vote outcomes are displayed. It can discourage people from voting. This specific poll highlights it best: https://vote.makerdao.com/polling/QmVMc78Z#vote-breakdown When it comes down to it, it will be the “increased budget” option against the “existing budget” option. It seems like “increased budget” is 26K MKR behind, so those who might want to vote in favor of increasing budget can easily be discouraged by thinking their vote won’t make a difference. 26K MKR is huge!! Realistically, if one counts manually down to the last two options, “existing budget” has 54,420 MKR for it and “increased budget” has 52,680 MKR for it, as of right now. The vote is actually pretty tight, but someone with the <2K MKR to make the difference might be discouraged from voting because it seems like the difference is 15X (FIFTEEN TIMES) what it is. This is like a page out of traditional politics that we see in manipulation of poll outcomes - make it seem like there is a clear winner to discourage people from voting for the other option. Except, in this case, I know it is unintentional. Obviously, I have a vested interest in this particular example as part of the strategic finance core unit. BUT, I think it perfectly highlights a general governance / polling problem in multi-choice voting. One that we simply MUST fix. I think the way transfer votes are displayed makes sense up until the final 2 choices. Transfers BETWEEN the final 2 choices should not count. This is what is happening here. Some people voted 1) “increased budget” 2) “same budget”. And this is precisely what is being displayed poorly. Since those two will be the final remaining options, these votes should realistically show as counting for “increased budget”. I hope this makes sense, and I hope you all can see why this is concerning! ",
                    "links": [
                        "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158"
                    ],
                    "GPT-summary": "The author of the post is pointing out a flaw in the display of ranked-choice voting outcomes, which can discourage people from voting. The post highlights a general governance/polling problem in multi-choice voting and suggests a solution to fix it. The post is a constructive criticism of the proposal and the author is explaining the issue and asking questions about it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.598137973137973
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "4",
                    "time": "25/06/2022-04:07:15",
                    "content": "Ranked Choice (IRV) votes are generally pretty hard to display. The DUX voting portal biases toward the winning options, which is a legitimate design choice (we want people who use the voting portal to easily be telling what vote has won or is currently winning). In regards to this specific case, I think you are misunderstanding the transfer vote rationale for IRV. Under Ranked Choice (also called Instant Run-off Voting), a 50% majority is needed to win the poll. When no option achieves 50%, the bottom preforming option is dropped and the round of voting restarted, with ballots voting for their top remaining option. So while it is frustrating to see the vote appear so lob-sided on the final round, the reason the portal is doing this is because no option receives over 50% of the votes until the final round takes place, meaning the bottom option is dropped and a new round starts with just the votes left for approve existing budget. There might be a better way to display this, but it is worth noting that the first choice values are available on mouseover, and the Vote Breakdown lists all voters submissions. This is a rather extreme example, but the rationale for displaying the vote as it does is because the vote doesn’t end until an option gathers more than 50% support in IRV, so showing only the ~50k amounts would be confusing and indicate that no option is being selected by the poll. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.606351981351981
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#3",
                    "likes": "0",
                    "time": "25/06/2022-16:40:00",
                    "content": "Thank you for explaining this. What happens in the case when no option receives over 50% of the votes, even in the final round? Or is this not a possibility (does the 50% threshold ignore votes that are effectively discarded)? I think I maintain the same viewpoint but it is contingent on the answer to the above. If that edge case does not need special treatment, the final round of IRV should not transfer votes among the last remaining choices, period. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.228571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#4",
                    "likes": "0",
                    "time": "26/06/2022-06:04:15",
                    "content": "What happens when two options are pretty much the same (eg. https://vote.makerdao.com/polling/QmdMkg2N#vote-breakdown). Bearmarket option is a cut down version of Base Growth. In this instance supporting Base Growth is also supporting Bearmarket option. That is to say, if someone is okay to approve a budget of 5m technically they should be okay with approving 3m. In this situation, would votes for Base and bear be tallied up? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.747685185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#5",
                    "likes": "2",
                    "time": "26/06/2022-09:31:26",
                    "content": "    lyt:  does the 50% threshold ignore votes that are effectively discarded   Yes it ignores these votes and abstain for the purposes of calculating a winner. So in the scenario:  Option A: 55,000 Option B: 45,000 Discarded: 10,000 Abstain: 10,000  The result would be Option A 55%; Option B 45%     Mamun:  In this situation, would votes for Base and bear be tallied up?   No. They have different DAI amounts attached to them so how would we interpret that result? You can’t assume that this logic holds. People can select multiple options so if they support the bear option and the base option, one should be first choice and one should be second choice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.464285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mamun",
                    "index": "#6",
                    "likes": "1",
                    "time": "26/06/2022-11:15:27",
                    "content": "Thanks @Patrick_J for the clarification.     Patrick_J:  People can select multiple options   Of course! Totally forgot the multiple option. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#7",
                    "likes": "2",
                    "time": "26/06/2022-20:46:10",
                    "content": "Got it. In this case, I definitely maintain my viewpoint - the final round of IRV should not transfer votes among the last remaining choices ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#8",
                    "likes": "2",
                    "time": "26/06/2022-21:04:51",
                    "content": "I see what you mean and I agree that this is a bit confusing. I will follow-up with the DUX team tomorrow and get back to you. My suspicion is that the UI is processing it so that the winning option displays above 50% (even though abstain is ignored in the calculation it shows in the UI, and it would look weird for an IRV poll to have a winner on 47% in the UI) and is a conscious design choice but will see what the technical team say. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6796875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tadeo",
                    "index": "#9",
                    "likes": "4",
                    "time": "30/06/2022-15:40:47",
                    "content": "Hi @lyt, I think some of your concerns would be somewhat covered by the Ranked Poll Simulation, where you can see the tally of votes at every round, including the decisive second to last round (Round 3 in the example below). If I understand correctly, it would be valuable to have a dedicated section that would show the total MKR support for both 1st and 2nd option such as “1st: 82k, 2nd: 59k”, essentially omitting the votes from the 2nd option that would then get transferred to the 1st option.  image1269×598 112 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.7272727272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#10",
                    "likes": "0",
                    "time": "30/06/2022-21:12:59",
                    "content": "Is the plan to make this the default UI for reporting live poll outcomes? Default UI is what must be changed And yes, you understood correctly ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#11",
                    "likes": "6",
                    "time": "08/07/2022-17:16:46",
                    "content": "Hey @lyt, apologies for the late follow-up here. And above all; thanks for the feedback!     Patrick_J:  My suspicion is that the UI is processing it so that the winning option displays above 50% (even though abstain is ignored in the calculation it shows in the UI, and it would look weird for an IRV poll to have a winner on 47% in the UI) and is a conscious design choice   This is exactly right. I do understand that the vote appears lob-sided on the final round. However, hiding the ‘transfer’ votes could also make the vote appear lob-sided for the other vote options (which might actually be close in MKR vote amount too). We’ve discussed internally and decided to introduce a toggle to the vote breakdown visual of IRV poll details, which allows for switching between displaying ‘first choice’ MKR voting weight per vote option, and ‘IRV results’ per vote option (in other words: hiding/showing the MKR transfers). We believe this is a neutral way of making the design more useful & intuitive, and it also allows us to add a tooltip to further explain the workings of an IRV poll. We’ll implement this somewhere over the following weeks. Thanks again for the feedback—you’ve essentially made this idea happen.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.210884353741497
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#12",
                    "likes": "2",
                    "time": "08/07/2022-18:39:05",
                    "content": "litty Thanks so much! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "08/10/2022-00:39:18",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}