{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/the-difficulties-of-dao-governance-with-paperimperium-on-drinks-with-makerdao-delegates/19033",
            "title": "The Difficulties of DAO Governance with PaperImperium on Drinks with MakerDAO Delegates ",
            "index": 19033,
            "category": [
                "Governance",
                "Delegates"
            ],
            "tags": [
                "delegate-platform",
                "community-delegate-vlog",
                "drinks-maker-delegates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "6",
                    "time": "03/12/2022-22:21:23",
                    "content": "     Kicking-off The December Holiday Season with MakerDAO Delegates      As we embark on the final month of the year, @ultraschuppi @rspa  and @ElProgreso kickoff the festive December month with Recognized Delegate @PaperImperium on Drinks with MakerDAO Delegates. We were excited to finally have Paper on the show–and he didn’t disappoint! We explored the mindset of how Delegates can simultaneously Govern multiple DAOs, the future outlook of MakerDAO, and the pros and cons of the Endgame Plan. Don’t miss this cool episode with a Maker community member who lives and breathes all-things MakerDAO.  Not Financial Advice This Content is for entertainment and informational purposes only, you should not construe any such information or other material as legal, tax, investment, financial, or other advice. Nothing contained on the Drinks With MakerDAO Delegates YouTube Channel constitutes a solicitation, recommendation, endorsement, or offer by @PaperImperium @ultraschuppi a.k.a, Tim Schuppner @ElProgreso a.k.a, Frank Cruz @rspa a.k.a, Raphael Spannocchi, Flip Flop Flap Delegate LLC, Flipside Crypto, GFX Labs, or any third party service provider to buy or sell any cryptocurrencies, securities, or other financial instruments. Nothing in this YouTube Video constitutes professional and/or financial advice.  The Tastings PaperImperium: A&W zero sugar root beer   3 Stars    El Pro: Big Wave  Golden Ale by Kona Brewing Co.   Brewed in Kailua-Kona on Hawaii’s Big Island  : 3 Stars    Schuppi: Hacker Pschorr - Kellerbier,   Germany  3 Stars    Raphael: Riegele BrauManufaktur Amaris 50 BTUs from Augsburg,   Germany  4.5 Stars           ",
                    "links": [
                        "https://www.konabrewinghawaii.com/come-visit",
                        "https://www.hacker-pschorr.de/unsere-biere/kellerbier",
                        "https://www.riegele.de/biere/brauspezialitaeten/amaris-50/",
                        "https://www.youtube.com/watch?v=rXHGbphYxns"
                    ],
                    "GPT-summary": "The post is an episode of a YouTube show called \"Drinks with MakerDAO Delegates\" featuring a recognized delegate named PaperImperium. The post discusses the difficulties of DAO governance and explores the future outlook of MakerDAO. The post also includes a disclaimer that the content is for entertainment and informational purposes only and should not be construed as legal, tax, investment, financial, or other advice. The post ends with a section on the beverages tasted during the episode.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author is advertising proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.329545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "4",
                    "time": "03/12/2022-23:04:25",
                    "content": "Great episode. I appreciated Paper’s view on the surplus buffer being a comingling of several things and a need for definitive separation if we hope to properly define our risk capital. Thanks for putting this on Frank and Tim! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smartcontracts",
                    "index": "#3",
                    "likes": "1",
                    "time": "03/12/2022-23:42:19",
                    "content": "some of the greatest minds in DeFi - thanks for sharing! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                }
            ]
        }
    ]
}