{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/bd-team-growth-cu-maker-community/7348",
            "title": "BD team/Growth CU < > Maker Community ",
            "index": 7348,
            "category": [
                "Core Units"
            ],
            "tags": [
                "gro-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "12",
                    "time": "06/04/2021-20:36:20",
                    "content": "After reading everyone’s responses in the forum and RC, we (the BD team) decided to share a summary about what we do to show the community what’s happening with our partners (aka distribution channels) and how this could impact the Maker Protocol. We look forward to keeping this conversation going. For now, as the BD team and in the future as the Growth Core unit. Here is the link to the notion page where you can find what we presented last Thursday.  image1046×1500 103 KB  And, we want to know your thoughts about: We should improve the way we communicate BD’s work to the community Solution: We will post our work updates in the forum. But: What about people who are not involved in the forum or the governance calls? How should we reach out to them? Is it the Maker blog enough (or the community blog)? Remember, Maker’s marketing is out of our CU scope, our objective is to find distribution channels and engage them with the protocol, but we work with our partners’ marketing teams. Gas fees are high, impacting the maker protocol (from a user perspective) in different ways:  Micropayments or transactions below 50 Dai make no sense because of gas fees Using Dai in other DeFi protocols is not possible for retail investors Dust at 5k Dai is not viable for retail users Voting participation could be affected by gas fees Other DeFi protocols are going to L2 Other stablecoins are in various chains  DSR is Dai’s most relevant differential compared with other stablecoins. Although decentralization is essential and we have to maintain it, DSR could convince users to convert USDC/USDT/others to Dai. Different stablecoin yields rely on the legacy banking system, and various CeFi protocols are squeezing their margin to gain more users, Dai’s DSR is independent of the banking system. ",
                    "links": [
                        "https://forum.makerdao.com/t/operational-support-weekly-update-april-5-8-2021/7381"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.278947368421053
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "1",
                    "time": "06/04/2021-21:15:54",
                    "content": "Is there a feeling that high gas fees need to be addressed immediately (and suggestions)? Or wait and see what happens over the next several months as solutions get built out in the ecosystem? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.266666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "3",
                    "time": "06/04/2021-21:33:22",
                    "content": "I like what Operational Support does for their updates. Before their weekly update on the governance call, they publish a written version of that update to the forum. At a minimum, I think doing something like this would be good. Whether it’s a weekly update, a monthly or quarterly one, written updates are always the best. Unlike the governance calls, they are a lot easier to reference. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#4",
                    "likes": "5",
                    "time": "06/04/2021-23:18:37",
                    "content": "With regard to communicating BD’s work, there are a couple of layers to consider:  Marketing the integrations themselves Promoting the integration to generate brand value for MakerDAO  I’m happy to advise on marketing strategy but I would typically expect decisions about how the integration will be marketed to come from the marketing teams of our partners. I think it would be helpful for BD/Growth and the proposed MarComms team to coordinate localized campaigns and the Content team can coordinate with those external marketing teams to lend support where it makes sense, whether that means producing content or helping them publish and amplify theirs. The Content team is proposing to coordinate the management of MakerDAO’s social channels and web properties and has started mapping what this might look like once core units go through and assuming the Core Unit passes, we’ve included the development of a “Request for Content” process in our mandate to make it easy for other Core Units to request that we create content for them, help them create their own content, or help them publish their content on MakerDAO’s official channels. Depending on what these updates consist of, I could see it being fine just having some of them on the forum and governance calls but I would certainly like to see any substantial updates featured on Maker’s official channels. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2255291005291005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#5",
                    "likes": "2",
                    "time": "07/04/2021-22:45:44",
                    "content": "yes! I think every project in some way is feeling the urge to move to another chain/L2. Recently Sam announced the Optimism Dai Bridge, and we know about other chains which developed bridges to bring Dai to their networks. I think we all agree about Dai has to be everywhere. I guess the next step is to decide if vaults or DSR can exist on L2. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AdrienDLT",
                    "index": "#6",
                    "likes": "2",
                    "time": "11/05/2021-23:22:29",
                    "content": "    Nadia:  But: What about people who are not involved in the forum or the governance calls? How should we reach out to them? Is it the Maker blog enough (or the community blog)? Remember, Maker’s marketing is out of our CU scope, our objective is to find distribution channels and engage them with the protocol, but we work with our partners’ marketing teams.   Heads up: I’m currently involved in building the MarComm team with Kathleen Typically, Biz Devs work hand-in-hand with the Marketing/Content teams to communicate successful integrations and partnerships. This on both sides. That’s usually done through a co-marketing effort, synchronized marketing on both side of the deal (both projects), this includes communication done on both our project channels (tg, twitter, blog, forum, etc) but also on third party channels (news media outlets, influencers, etc). Projects usually report back on their progress via a monthly blog post - that’s what Terra has been doing. Just like every blog post, it is also shared on the official Twitter account, Discord, Telegram, Youtube and other channels. In our case, being a DAO, we might want to also bring the discussion in the forum with the relevant categorization and tags to the post.     seth:  I’m happy to advise on marketing strategy but I would typically expect decisions about how the integration will be marketed to come from the marketing teams of our partners. I think it would be helpful for BD/Growth and the proposed MarComms team to coordinate localized campaigns and the Content team can coordinate with those external marketing teams to lend support where it makes sense, whether that means producing content or helping them publish and amplify theirs.   Exactly. The ideal situation is if the Marketing team is coordinating the announcement on our own channel, our partner’s comms channels, and in media outlets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.806372549019608
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gustav_Arentoft",
                    "index": "#7",
                    "likes": "1",
                    "time": "12/05/2021-09:28:49",
                    "content": "    AdrienDLT:  that’s what Terra has been doing   And Maker since March 2018  ",
                    "links": [
                        "https://blog.makerdao.com/category/making-maker/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AdrienDLT",
                    "index": "#8",
                    "likes": "0",
                    "time": "12/05/2021-09:48:17",
                    "content": "    Gustav_Arentoft:  And Maker since March 2018   Nice! So I guess the discussion only need to brought into the forum. And maybe in the dedicated channel on Rocket Chat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                }
            ]
        }
    ]
}