{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/eth-c-risk-parameters/6684",
            "title": "ETH-C Risk Parameters ",
            "index": 6684,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "risk-domain-work",
                "eth-c"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "21",
                    "time": "22/02/2021-09:45:33",
                    "content": "MKR holders have recently voted yes to implement a new ETH-C Vault Type. We believe ETH-C should be particularly useful in current circumstances where ETH-A risk exposure is hitting some of the risk limits. Additionally, we are proposing another urgent increase of the ETH-A and ETH-B SF in order to lower debt growth. This means lower ETH-C SF should stimulate users to migrate to a safer vault type and overall lower ETH risk profile at Maker. Here are proposed parameters for ETH-C Vault type: Stability Fee: 3.5% Liquidation Ratio: 175% DC-IAM ‘line’: 2,000,000,000 DAI DC-IAM ‘gap’: 100,000,000 DAI DC-IAM ‘ttl’: 12 hours Auction Lot Size: 50,000 DAI Minimum Bid Increment: 3% Bid Duration: 4 hours Max Auction Duration: 4 hours Liquidation Penalty: 13% Dust: 2,000 DAI Stability fee Risk Premium calculations are based on the simplified risk model used here. Below are shown risk premiums for different liquidation ratios. The more important part when deciding for ETH-C SF is the risk premium spread between 150% and 175% LR which should be high enough to stimulate users moving to a safer vault. If we apply the 2% spread to the recently proposed ETH-A SF of 5.5%, ETH-C 175% LR would have a proposed SF of 3.5%. Note that current stability fees would be still below RPs proposed by our models, yet these models don’t include adjustments for ‘box’ or unwinding of vaults during crash events, so numbers may probably be overestimated to some degree.     LR RP     130% 8%   150% 7%   175% 4%    Together with recently proposed SF changes for both ETH-A and ETH-B, Maker would offer following ETH Vault types:  ETH-B LR = 130%, SF = 9% ETH-A LR = 150%, SF = 5.5% ETH-C LR = 175%, SF = 3.5%  Liquidation Ratio We decided only for a modest LR increase for ETH-C compared to ETH-A since 175% LR for borrowing on ETH is already less competitive than the majority of such DeFi products. However we believe Maker can still attract a lot of borrowers with this liquidation ratio, particularly those who rely on OSM and use automation tools for deleveraging. Higher LR affects yield farmers and we made a simulation of how competitive ETH-C would be compared to other Maker ETH vault types and their stability fees.     LR CR buffer - 30% drop Est. farm APY Normalized APY (150% LR) SF Net APY     175% 250% 20% 17% 3.50% 13.6%   150% 214% 20% 20% 5.50% 14.5%   130% 186% 20% 23% 9.00% 14.1%    Debt Ceiling We already implied ETH-C would have DC-IAM implemented and we proposed parameters that are fairly relaxed since OSM risks for 175% vaults are small in ETH case. Further, we might expect a larger amount of migrated vaults from ETH-A to ETH-C and we might be hitting IAM enabled DC more frequently than expected. This is why we proposed a 12h ‘gap’ of 100million DAI and max. debt ceiling of 2bn DAI. There is about 55% of ETH-A vault exposure that has a collateralization ratio of over 250% (about 800m DAI). Large part of these vaults could potentially migrate to ETH-C and we may expect huge demand. Chart1200×742 37.8 KB This could to some degree represent risk of lost revenue if only safest ETH-A vaults migrate to ETH-C, where effects of risk mitigation are fairly low compared to fees lost for Maker. Ideally we should aim to stimulate new ETH based debt growth based to move to ETH-C. We believe we are able to achieve this if rates on ETH-A continue to grow (assuming debt growth of ETH-A doesn’t slow down). Since the community doesn’t intend to limit ETH-A DC because of integration risks and various other concerns, the only way to mitigate ETH exposure risk is to keep increasing ETH-A SF and stimulate users to migrate to safer ETH-C vaults. This should hold at least until Liquidations 2.0 are implemented. ",
                    "links": [
                        "https://forum.makerdao.com/t/mid-month-rates-changes-proposal-19-feb-2021/6660",
                        "https://docs.google.com/spreadsheets/d/15YWCxZfxEPtCF3YXPhNunEGLgNGsWaMnu9S563DTm0g/edit#gid=1787304706",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-132-thursday-march-11-17-00-utc/6859/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-131-thursday-march-4-17-00-utc/6737/2",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-february-28th-2021/6830",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/21",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/19",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-130-thursday-february-25-17-00-utc/6651/5",
                        "https://forum.makerdao.com/t/signal-request-adjusting-dust-parameter-2021-2/6704/11",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-a-dc-iam-line-2021-05/6688/2",
                        "https://forum.makerdao.com/t/signal-request-new-vault-type-for-eth-with-a-higher-lr/6069/43",
                        "https://forum.makerdao.com/t/maker-relay-ep-36/7039",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458309003657841
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "3",
                    "time": "22/02/2021-09:47:35",
                    "content": "loving it! I really like that we start directly with a pretty high line and gap - I think this is a great start, thanks @Risk-Core-Unit for making this possible ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5375000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "2",
                    "time": "22/02/2021-11:25:39",
                    "content": "Main problem I see here is the naming. For liquidation ratio we have B < A < C but alphabetical order is A < B < C. I guess it’s not a huge problem with only three choices, but it could still cause confusion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#4",
                    "likes": "3",
                    "time": "22/02/2021-18:53:41",
                    "content": "That’s not really a problem since UI can always deal with it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#5",
                    "likes": "3",
                    "time": "28/02/2021-20:21:45",
                    "content": "We made an adjustment to bid duration (ttl) and max auction duration (tau) parameters based on recent proposal of FLIP auctions parameters adjustments proposal. Both ttl and tau are proposed to be 4 hours from previously proposed 6 hours. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.583333333333333
                }
            ]
        }
    ]
}