{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-public-commitment-to-restoring-peg/3634",
            "title": "[Signal Request] Public Commitment to Restoring PEG ",
            "index": 3634,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#1",
                    "likes": "2",
                    "time": "11/08/2020-13:33:09",
                    "content": "Central banks across the world use forward guidance to anchor expectations by making a public commitment to achieve some objective such as target inflation. Many times this public commitment includes language to “overshoot” objective to restore confidence that the central bank has not lost control. Should MakerDAO make a commitment to setting and maintaining 0% stability fees until the dollar peg is restored for a sustained period of time?     Yes No Abstain     0 voters     ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "4",
                    "time": "11/08/2020-14:07:58",
                    "content": "Going to nudge you in the direction of this thread: Practical Guide to the Signaling Process. I think it’s important that signal requests try to follow a more consistent format and meet certain requirements. That said, this topic might be better suited to a Declaration of Intent under MIP13 as it represents more of an ongoing commitment than a one-and-done change to a protocol parameter. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP13/MIP13.md#mip13c1-what-is-a-declaration-of-intent"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.970238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/08/2020-14:36:45",
                    "content": "I voted “No” because I don’t think there is a binding way to commit to 0% stability fees. Or I guess we could actually put a timer in code to keep fees at 0%, but that seems crazy. That would be like increasing the governance security module from 12 hours to 3 month. No thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.8333333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/08/2020-17:46:40",
                    "content": "I voted no because it’s not sure that SF at 0% is the solution. Why commit to stay on a wrong course of action? But a way to express a strong commitment of the MKR governance to restore the peg would be nice but I’m unsure that a poll will help (strong incentive to vote yes no matter the commitment). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680555555555555
                }
            ]
        }
    ]
}