{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/new-priority-spreadsheet-and-domain-work/4980",
            "title": "New Priority Spreadsheet and Domain Work ",
            "index": 4980,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/shaners",
                    "index": "#1",
                    "likes": "2",
                    "time": "03/11/2020-14:04:37",
                    "content": "Hello, Apologies if this is not appropriate for the forum. I’ve been looking through the new prioritization spreadsheet and wondering two things:  If new community greenlight polls are running every week/few weeks then are some tokens going to be left forever waiting to be added? If new polls add tokens that have higher priority than previously greenlit tokens. Will there a point when there is enough greenlit that the community polls need to be paused in order to get through the existing list as it’s quite extensive at the moment?  Thanks ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.221212121212121
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "2",
                    "time": "03/11/2020-15:59:40",
                    "content": "Hey @shaners welcome to the forum. Perfectly appropriate questions.     shaners:  Will there a point when there is enough greenlit that the community polls need to be paused in order to get through the existing list as it’s quite extensive at the moment?   There’s no real reason the list can’t and shouldn’t continue to grow. The list represents possible collateral types for MakerDAO. With the addition of the prioritisation sheet, we can have some idea of which are most valuable to work on at any time. Right now, the important part is that the limited resources we have for onboarding collateral (the domain teams) are being used as effectively as possible.     shaners:  If new community greenlight polls are running every week/few weeks then are some tokens going to be left forever waiting to be added? If new polls add tokens that have higher priority than previously greenlit tokens.   It’s definitely a possibility that some tokens will be left for a long time before being added (or will possibly never be added.) I don’t see this as a problem though, due to the prioritisation sheet and the expertise of the domain teams, the hope is that if an older token keeps dropping lower in the list then that means it isn’t as valuable to the protocol in terms of some of the tokens added more recently. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.658752705627705
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#3",
                    "likes": "3",
                    "time": "04/11/2020-15:19:12",
                    "content": "Thanks for the contribution, @shaners Going a step forward, we might want to question if the amount of MKR in a poll is a good proxy for priorities, which are good alternatives, and what’s a good way of implementing them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "03/02/2021-21:19:16",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}