{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/should-we-use-the-ens-airdrop-to-cover-costs/12143",
            "title": "Should we use the ENS airdrop to cover costs? ",
            "index": 12143,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#1",
                    "likes": "1",
                    "time": "02/12/2021-11:09:11",
                    "content": "Perhaps we can use the ENS airdrop to cover some of these costs? Seems like it could almost cover the entire Maker Foundation refund, and we’d be done with it. EDIT: This was discussed on the governance call - the sentiment was that it would be better hold the ENS tokens, which I agree with  EDIT2: This was originally a comment to this post: MIP40c3-SP45: Modify Core Unit Budget, ORA-001 (Oracle Gas Costs) - #15 but has since been turned into a separate thread. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp45-modify-core-unit-budget-ora-001-oracle-gas-costs/11621/15",
                        "https://forum.makerdao.com/t/signal-request-lp-our-aave-and-ens-with-eth-on-uniswap-v3/15863"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#2",
                    "likes": "0",
                    "time": "10/12/2021-09:37:14",
                    "content": "    lollike:  EDIT: This was discussed on the governance call - the sentiment was that it would be better hold the ENS tokens, which I agree with   What exactly is the goal of holding it and how do we plan to cash out those tokens? Or is it a hold forever kind of sentiment? I actually think this is not at all a bad idea to use the ENS tokens for this expense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lollike",
                    "index": "#3",
                    "likes": "1",
                    "time": "10/12/2021-10:14:03",
                    "content": "    AstronautThis:  What exactly is the goal of holding it and how do we plan to cash out those tokens? Or is it a hold forever kind of sentiment?   The sentiment was mostly that it would be a bad look if we sold it, that would result in MakerDAO not getting any future airdrops that might be of strategic importance, which I think is a good point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                }
            ]
        }
    ]
}