{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/campaigning-vote-for-chuguire-capybara-carpincho-to-be-the-mascot-of-the-makerdao-protocol/8307",
            "title": "[Campaigning] Vote For Chuguire/Capybara/Carpincho to be the mascot of the MakerDAO protocol ",
            "index": 8307,
            "category": [
                "Governance"
            ],
            "tags": [
                "polls",
                "campaigning",
                "mascot"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#1",
                    "likes": "4",
                    "time": "24/05/2021-18:06:00",
                    "content": "I propose that you vote in favor of the chigüire as the mascot of the Maker protocol, it has everything necessary to be considered as the most appropriate mascot for our community. Benefits: It is very friendly It has no problems with any other species. It gets along well with everyone. He is like a giant hamster and I think we all like hamsters. Why go hand in hand with makerDAO? He is sociable He lives in a community or herd. It has unique characteristics in itself, which makes it an inclusive animal when living with different species, which goes hand in hand with DAI which is money for everyone. I think these are the most important points to consider it as an optimal pet for MakerDAO. Vote here          [Informal Poll] Following up: MakerDAO Mascot Governance       Following up on the fantastic response from the poll, here. This poll ran for a total of 10 days  The poll received 52 unique voters, with 63 total votes ending in:  Dragon - 48%  Dog - 19%  Nothing - 15%  Something else - 15%  Cat - 13%  Cartoon Burban - 9%  This is a follow-up informal poll that hopefully will lead to a consensus, which will be used to create a signal request that, in turn, will be used to formalize the potential mascot through Governance.  This poll will only allow one choice…     ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-does-makerdao-want-a-mascot/8083",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-may-13-may-26-2021/8386",
                        "https://forum.makerdao.com/t/maker-relay-ep-46-en-espanol/8358/3",
                        "https://forum.makerdao.com/t/maker-relay-46/8312/2",
                        "https://forum.makerdao.com/t/informal-poll-following-up-makerdao-mascot/8305/13"
                    ],
                    "GPT-summary": "The author proposes that the chigüire be the mascot of the MakerDAO protocol, citing its friendly nature and inclusivity. The post also includes the results of a previous poll on the topic and a follow-up poll to create a consensus for formalizing the mascot through governance. The post does not contain any negative feedback or criticism of the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.7006578947368425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "26/05/2021-14:58:52",
                    "content": "I already did my bit in the voting, without a doubt the chiguire is one of the most inspirational animals, it is peaceful, friendly and relates well with other species. Go Chiguire!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.4296875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "25/08/2021-20:59:37",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}