{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/thoughts-on-multichain-dai-liquidity-strategy/16071",
            "title": "Thoughts on Multichain DAI Liquidity Strategy ",
            "index": 16071,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "liquidity-mining",
                "multichain",
                "liquidity",
                "l2"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "24",
                    "time": "27/06/2022-00:52:00",
                    "content": "Hi all, I’ve been slinging small $ amounts around various alt chains / L2s for the past year, and while I think Ethereum will remain king I’m equally convinced that an increasing amount of economic activity (particularly among regular users) will take place on these external domains. I wrote this to share how I’m thinking about the problems and opportunities this brings for MakerDAO and DAI adoption. I’d like to acknowledge prior work done by community members and contributors to support multichain liquidity, particularly the Growth CU (who just recently submitted an application required to be considered for OP incentives scheme on Optimism) and those involved in forthcoming L2 integrations (PE and many others).  Overview DAI currently has high liquidity on Ethereum L1, with broad integrations to centralized exchanges as well as significant on chain liquidity sources. Liquidity is made up of both protocol directed assets (PSMs, D3M, Gelato Uniswap v3 vaults, etc) as well as user supplied assets (Curve, lending markets, volatile DEX pairs, etc). Liquidity on external domains, including Ethereum L2s, alternative EVM chains, and non EVM chains, is significantly less deep. While DAI has managed to attain decent liquidity across many external EVM chains, it frequently lags USDC and USDT by a significant margin. And there are a growing number of important external domains where DAI struggles to attain even the minimum viable liquidity needed to enable regular usage. MakerDAO and independent community members could take a more proactive approach to supporting liquidity across external domains. This thread covers strategic considerations and ideas for near term action to address deficiencies.  Motivation Recently, Maker has been struggling to productively deploy our balance sheet due to relatively weak crypto borrowing demand and few immediately available alternatives (eg. scalable RWAs, D3Ms, etc). But in the long run, it is likely that Maker’s growth will be constrained in the opposite direction, with users’ willingness to hold and transact in DAI as our fundamental limiting factor. Increasing DAI liquidity across domains will bring the following significant benefits to MakerDAO: DAI “convenience yield”: If DAI has greater usability within trading, bridging, and commerce across external domains, users will be willing to hold it with relatively lower base yield which helps support Maker’s net interest margin. Asset base growth: Greater usage of DAI across external domains will lead to increasing quantity of DAI in circulation, which allows Maker greater flexibility to expand vault usage and grow revenue. Exposure and user acquisition: With Ethereum L1 continuing to face high costs, an increasing share of DAI user (distinct from volume or USD value) growth will come from lower cost domains, presenting an opportunity to expand DAI’s real user base and economic activity. On a dollar for dollar basis, smaller users provide more long term value and stickiness versus large whales, as there is relatively greater switching costs and coordination required to replace DAI with an alternative stablecoin. Gaining sticky integrations: Key integrations can help support DAI usage and network effects in a sustainable way, but increasing opportunities for organic, non incentivized usage. Examples of high value DAI integrations include usage as a payment option on NFT or grants platforms, or integration into pooled lending markets. These integrating protocols will only add support for DAI if they expect significant usage, which depends on the relevant domain having sufficient DAI liquidity to allow people to use it efficiently.  Support Mechanisms Currently, Maker primarily supports liquidity on Ethereum L1 by deploying balance sheet assets. Examples of this include PSMs and Gelato Uniswap v3 vaults - both of these mechanisms serve to increase DAI liquidity and ensure a tight peg. This works particularly well in Maker’s current position, where there is an excess of organic demand to hold DAI vs minting DAI from vaults. This allows for deploying assets into liquidity strategies with little direct cost. Projects can also support liquidity by providing token incentives for users. While this is often favored by issuers with a deficit of organic stablecoin demand (incentives help increase demand to balance supply), it may also make sense for Maker in certain limited circumstances. For example, Maker faces increased centralization and custody risks to deploy assets on external domains that are not Ethereum L2s; this is due to inability to trustlessly control these assets through governance, with multisigs likely being required for various functions. This means that for some external domains it may make more sense for Maker to achieve required liquidity levels through targeted incentives and partnerships with 3rd party protocols, rather than deploying balance sheet assets. To generalize:  On Ethereum L1, Maker should focus on supporting liquidity through deploying assets (eg. PSMs, D3Ms, LP token vaults) as this has the lowest possible cost and may even provide opportunities to earn revenue on otherwise idle assets On core Ethereum L2s where MCD is planned for deployment, Maker can in the future deploy assets to build up liquidity, but it may make sense to offer limited incentives to support liquidity before MCD is available or to bootstrap specific uses (eg. Aave DAI markets) that require significant external usage before Maker can safely contribute assets On non-core L2s and alternative L1s (where MCD is not imminently planned for deployment), liquidity needs could be met with targeted bootstrapping incentives and partnerships with the relevant domains and/or defi platforms   Liquidity KPIs Developing key performance indicators (KPIs) for evaluating liquidity will help Maker support DAI utility and integration across external domains. A set of initial suggested KPIs are described below. Historical Volatility This indicates how tightly DAI maintains the $1 target price. Higher volatility increases risk for stablecoin users, who may be forced to purchase above or sell below peg. Key measurement methods include average daily volatility, maximum variance from target price, and skew (differences in upside vs downside variance from peg). While this doesn’t directly measure liquidity, in general more liquid stablecoins should exhibit lower volatility over time (through a combination of greater arbitrage efficiency and lower market impact for trades). Theoretical Variance This calculation gives rough upper and lower bounds for DAI price on an external domain, based on assumptions about arbitrage efficiency. Arbitrage transactions through Ethereum L1 may involve fixed or variable bridge fees (both inbound and outbound), as well as gas costs and exchange fees. We can use these inputs to estimate the minimum necessary revenue for arbitrageurs to break even, and then use the revenue value to determine maximum variance from peg based on external domain liquidity. Alternatively, we can set a target maximum variance and use that to calculate the minimum required liquidity to support efficient arbitrage. Example measurement: Arbitrage costs = bridge out fee/gas + bridge in fee/gas + mainnet swap fee/gas + external domain swap fee/gas (rough estimate = $50-200) Expected keeper profit + arbitrage costs = AMM liquidity until peg * average premium (discount) Arbitrage profit potential from moving external domain AMMs back to peg depends on specific AMM curve used (eg. x*y=k for volatile LPs, Curve invariant for stable LP, etc) as well as liquidity depth. For xyk AMMs like Uniswap v2, moving a price 1% off market back to peg would involve roughly 0.5% market impact (0.35% accounting for swap fees), and equate to a trade size of 0.25% of total pool TVL. Assuming $200 in combined arbitrage costs and keeper profits, this would require $23 million in pool TVL to maintain bounds of 1% deviation from peg purely through risk free arbitrage. (Note that traders could arbitrage much more efficiently than this by holding inventory on the external domain, so this is a conservative overestimate of required TVL. But willingness for traders to allocate capital or attention depends on expected usage / opportunity for arbitrage profit.) Calculations are somewhat more complicated for stableswap pools due to amplification / concentrated liquidity. Generally lower slippage would require higher TVL, while higher A parameters would allow for relatively lower TVL. Rough estimate: a pool with a 250 A parameter would require around $200-300,000 in TVL to support 1% theoretical max volatility assuming the same $200 arbitrage costs as above. Relative Market Impact This is a measure of overall DAI liquidity on an external domain. First, slippage is calculated at various trade sizes between top stablecoins and a domain’s native token / gas token. Subtracting the best performing stablecoin’s slippage from DAI’s slippage yields the relative market impact. This should measure DAI’s liquidity in a more uniform way across domains with varying levels of native token liquidity, and also incorporates available stableswap liquidity. This differentiates between the market impact attributable to DAI illiquidity vs general native token illiquidity. Example measurement: This could be determined by measuring aggregator quoted market impact at various trade sizes across top stablecoin - native token pairs. For example on Arbitrum, we could use 1inch to measure market impact on DAI/ETH, USDC/ETH, USDT/ETH, and MIM/ETH pairs. Relative market impact is equivalent to DAI/ETH market impact minus the lowest stablecoin pair’s market impact. In cases where DAI is not among the top stablecoins on a domain, this will likely depend primarily on stablecoin swap liquidity (trades would route through DAI → other stablecoin → native token).  Domain Evaluation Domains have wide variance in their proximity to Ethereum L1 (which incorporates custody and technical risks of bridging), integration landscape, and long term growth potential. Understanding key domain features will help Maker prioritize and tailor liquidity strategies to maximize impact while minimizing cost and risk. Proximity Ethereum L1 is Maker’s home base, with strong liquidity support across centralized exchanges and defi platforms. Actors on L1 have atomic access to top DAI liquidity sources, and DAI is tightly pegged to $1 through Maker PSMs. Rollups and L2 platforms have relatively close proximity, with a long term plan to rely fully on Ethereum security and eliminate trusted bridging or custodial elements. In their current state, all L2 platforms have some degree of centralization and technical risks, but these are expected to decline over time. L2s with shared Ethereum security will likely represent low enough risk to allow Maker to deploy assets (eg. through native L2 DAI minting, PSMs, liquidity pool vaults, etc). Sidechains and alternative L1s have lower “proximity” due to bridging risks between platforms, as well as risk of validator misbehavior. Deploying assets to these domains generally represents a worse risk adjusted return than on Ethereum or L2s due to these irreducible cross chain issues. For these relatively more distant domains, liquidity support could focus on user incentives (where users bear the risk of bridge failure but don’t face cross chain governance risk) and partnerships rather than direct asset deployment. Integration Landscape Domains have varying levels of defi penetration and availability of base primitives (exchanges, lending, derivatives, etc). At a minimum, Maker needs AMM exchanges to be available to begin offering liquidity support. Additional primitives including stableswap AMMs and lending pools offer significant additional value. Protocols’ openness to joint reward partnerships is also a positive factor. In general, stableswap liquidity is most efficient, but significant xyk liquidity offers important safety benefits that may be required for integration with lending markets. Growth Potential This can be difficult to measure objectively as it is dependent on multiple contributing factors, including technical viability, support of institutional investors, marketing, existing user traction, and philosophical alignment. Domains with unique value propositions have a higher chance of long term success and relevance vs unremarkable EVM clones. With attention and liquidity following somewhat of a power laws distribution, market leaders are also at significant advantage over laggers.  Minimum Viable Liquidity and Premier Liquidity Minimum Viable Liquidity At a high level, minimum viable liquidity (MVL) is the least amount of liquidity required to make DAI a usable stablecoin on a given domain. Failure to achieve this ensures that stablecoin demand on the given domain will be met by other issuers (which limits DAI adoption and Maker’s asset base, while implicitly raising equilibrium cost of capital). Once MVL is attained, organic user activity can begin to support a virtuous cycle of sustainable liquidity funding (eg. users paying trading fees to LPs to swap between DAI and other assets) and increasing sticky integrations (such as NFT platforms, or pooled lending markets which require sufficient liquidity as a condition of listing). MVL can be defined by the amount of liquidity needed to support acceptable trading costs at a given size. To figure this we need to determine:  What level of transaction costs are acceptable? (this can be measured as percent of transaction value) Beyond market impact, what other factors impact total trading costs? (typically this would include domain gas fees and exchange swap fees, as well as the implied cost of stablecoin volatility vs the peg) What trade size should be targeted for support? (generally larger size requires greater amount of liquidity to support) What style of LP is used? (stableswap “curve” vs xyk “uni v2 vs concentrated liquidity “uni v3”)  Below is an example of a minimum viable liquidity standard for external domains.  Users should be able to swap between 1,000 DAI and the domain native (gas) token with less than 1% in total costs, inclusive of gas fees, exchange swap fees, relative market impact, and average price variance vs peg.   DAI should have less than 0.5% average daily volatility, and less than 0.3% average variance vs $1 value.   DAI should have volatility theoretically bounded between ∓2% of peg by arbitrage opportunities against Ethereum L1 liquidity sources.  This would ensure DAI is broadly usable for small to moderate value retail transactions, and make it an acceptable choice of price stable asset within users’ portfolios. Depending on domain gas costs, types of AMMs available, and bridging mechanisms, this level of service could likely be achieved with between $100,000 to $500,000 in total liquidity. The concept of “harmonic liquidity” described by IndexCoop offers a useful way to think about optimal liquidity targeting. After defining a target total cost of transacting, we can determine what size of trade we should be focusing on for L2s and alternative L1 vs users who are more likely to transact on Ethereum (and could more easily bear the cost of bridging DAI to an external domain).  1102×527 133 KB  Source: IndexCoop Forum Premier Liquidity To achieve premier liquidity, DAI should be either the most liquid stablecoin available on a given domain, or be able to support high value trades with close to equivalent execution costs vs top alternative stablecoins. An example of premier liquidity standards could include:  Users should be able to swap between 100,000 DAI and the domain native (gas) token with less than 1% in total costs, inclusive of gas fees, exchange swap fees, relative market impact, and average price variance vs peg.   DAI should have less than 0.3% average daily volatility, and less than 0.2% average variance vs $1 value.   DAI should have volatility theoretically bounded between ∓1% of peg by arbitrage opportunities against Ethereum L1 liquidity sources.  Providing this level of service would require a far higher amount of liquidity, likely between $500,000 to $10,000,000 in TVL depending on availability of stableswap exchanges and liquidity of competing stablecoins.  Prioritization Maker probably can’t achieve premier liquidity support on all top external domains at once (at least in the short to medium term). So we need a framework for prioritizing between domains and determining where to seek premier liquidity support, where supporting minimum viable liquidity is enough, and where direct liquidity support is not worthwhile. Arbitrum and Optimism arguably present the greatest near term opportunity for integration. These platforms’ native token launches should help kickstart ecosystem adoption. If DAI can maintain its position as a top stablecoin, Maker will have greater opportunities to deploy assets for yield through L2 native vaults, liquidity strategies, or D3Ms. These domains have a rich integration landscape (many Ethereum apps will set up shop on L2), growth potential (most retail activity on Ethereum is expected to migrate to L2s), and close proximity (in their final state, L2s should have the lowest possible bridging and validator risk with respect to Ethereum L1). Next highest priority could be given to top alternative L1 platforms that have not yet achieved minimum viable DAI liquidity. Examples in this category include Cosmos ecosystem chains, Solana, certain EVM chains, as well as less adopted Ethereum L2s like Boba Network. While these platforms don’t present an immediate opportunity for deploying the balance sheet, increased DAI usability across domains will still improve user acquisition and increase Maker’s available asset base. Beyond these core domains, Maker could support liquidity on emerging L2s such as zkSync and Starkware as they become more feature complete. And Maker can also seek incentive partnerships to help improve usability and attain or maintain DAI’s position as a premier stablecoin on high impact domains that have already attained decent liquidity (examples here include Avalanche, Polygon, etc). Certain platforms with significant negative headwinds and limited potential may not be worth considering for integration or liquidity support at all. If needed, a formal prioritization framework could be developed to ensure that any actions are properly aligned with the DAO’s goals and strategy.  Ideas for Action Below are a few ideas for how Maker could improve multichain DAI liquidity and network effects. Liquidity Incentives Generally, Maker avoids open-ended incentives schemes for DAI holders or LPs, as there’s a risk of this becoming a money pit and in the short term higher DAI supply doesn’t help increase revenues. But it could make sense to pursue limited scope incentives to bootstrap DAI liquidity on external domains and get it to the point where DAI markets become self sustainable through organic usage. Incentive schemes should include explicit goals and KPIs, and estimates of potential long term value by comparing planned expenses to the expected marginal revenue from a larger DAI supply. For example, stablecoin liquidity on the Cosmos ecosystem’s Crescent DEX is very low at the moment. If Maker were to offer e.g. 100,000 DAI to be distributed to DAI/bCRE (native token) LPs over 3 months, this could catapult DAI into first place among stablecoin liquidity pairings (roughly $400,000 TVL at 100% APR expected return). This could trigger positive second order effects where users favor DAI as their stable asset, and organic trading fee APY can support necessary liquidity depth over the long term.  1230×794 99.3 KB  Source: Crescent DEX Partnerships Hand in hand with self-funded incentives, Maker can partner with external protocols to support DAI liquidity and integration within their app. As an example, Osmosis DEX is offering nearly 100% APR incentives on the DAI-OSMO pool to help support general platform liquidity and usability. While Osmosis was willing to support DAI without any pre-agreed reciprocity, many other protocols seem to be defaulting to just using USDC, USDT, or FRAX. Showing willingness to bootstrap initial DAI integrations with short term incentives could help us build partnerships with external defi protocols, who will then shoulder the (likely far larger) cost of long term incentives to maintain usability. Improving partnerships and integrations could make short term incentives a very high leverage way to support DAI adoption across chains (eg. $100,000 in Maker provided incentives could lead to $1 million or more in long term 3rd party incentives). Community Visibility Independent community members and/or MKR whales could play an important part in improving DAI liquidity across external domains. Because these users can maintain their existing custody scheme (eg. using a hardware wallet or setting up a multisig), they don’t face the same governance and custody risks that MakerDAO itself would when deploying assets cross chain. Sharing these opportunities in a more accessible way (without making recommendations, as individuals must assess the risk of each protocol independently) could help increase DAI adoption without direct costs to the DAO.  1600×822 161 KB  Source: Frax  978×762 69.6 KB  Source: QiDAO Frax and QiDAO do a good job of surfacing places to use their assets on external platforms. In addition to helping users find opportunities to deploy their assets, it also increases the value offered to underlying protocols as a partner (by helping these 3rd party protocols with discovery and user acquisition).  Final Thoughts Maker has a unique opportunity to outcompete other stablecoins and attain broad network effects as the crypto space grows across external domains. Compared with centralized stablecoin issuers, Maker has greater flexibility to use protocol assets, revenues, and reserves to proactively bootstrap usage. That being said, we are currently falling behind across many external domains compared to competitors. USDC is emerging as the defacto #1 stablecoin with increasing network effects, and even relatively higher risk stablecoins like FRAX have much broader cross chain integrations than DAI. I think this is an area where targeted, limited investments of contributor focus and financial resources can bring significant long term benefits for the protocol. And equally as important, a proactive strategy for liquidity on external domains will show third party protocols (who are key to maintaining DAI liquidity) that Maker is a strong partner that brings something to the table. ",
                    "links": [
                        "https://gov.indexcoop.com/t/liquidity-pod-our-product-liquidity-vision-harmonic-liquidity/3734",
                        "https://app.crescent.network/farm",
                        "https://app.frax.finance/staking/overview",
                        "https://app.mai.finance/farm",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-june-2022/16316",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-junio-05-de-julio-del-2022/16473",
                        "https://forum.makerdao.com/t/this-week-in-governance/16382/2",
                        "https://forum.makerdao.com/t/pensamientos-sobre-la-estrategia-de-liquidez-multicadena-de-dai-traduccion/16415",
                        "https://forum.makerdao.com/t/mip76-makershire-redux/16400/32",
                        "https://forum.makerdao.com/t/the-risk-core-unit-2022-year-in-review/19372"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.402901796366363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#2",
                    "likes": "2",
                    "time": "04/07/2022-15:04:28",
                    "content": "I am in full support of something like this.  Bootstrapping now will give DAI much more usability in the years to come.  The ROI is definitely there, it just might not be the easiest to see since it comes from network effects rather than a guaranteed APY.  There is a little risk (it is fairly negligible), but the return will be worth it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.385416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#3",
                    "likes": "14",
                    "time": "04/07/2022-17:24:18",
                    "content": "Great post and a very needed take beyond pure technical and risk PoV that perhaps I can be guilty personally of. Having said that, I think that there is an elephant in the room that truly needs to be addressed here, namely the existence of “native” or “canonical” DAI vs various versions of a synthetic token minted on on different chains by different third-party bridges w/out MakerDAO control or permission. The post seem to assume that there is one “DAI” on a given domain/chain and end-users could be rightly excused for thinking so. The reality though is very different, let’s take just two concrete examples: BSC (Binance Chain) - This is the address of the contract: https://www.bscscan.com/address/0x1af3f329e8be154074d8769d1ffa4ee058b1dbc3 If you look at the source code, line 359 you might notice 10M of pre-minted DAI. Where these DAI came from ? Another example: There seems to be only 126M DAI in L1 Fantom Bridge contract (https://etherscan.io/address/0xc564ee9f21ed8a2d8e7e76c085740d5e4c5fafbe) but 157M DAI in Fantom (Dai Stablecoin (DAI) Token Tracker | FtmScan). That’s 31M difference. How this 31M was minted on Fantom ? I am sure this can be explained somehow, but should that be MakerDAO’s concern ? I am not aware of any discussions between DAO and BSC/Fantom regarding minting DAI. I would like to remind as well that we have DAI Foundation that is supposed to protect DAI name against the potential misuse. In any case, our current focus, at least in PECU, is to focus on creating what we call canonical DAI. This DAI is designed to be fully fungible with DAI minted on any other domain (there are some caveats). The analogy here is US$ “minted” in one commercial bank that should be fungible with US$ “minted” in another commercial bank. If we deploy this canonical DAI on chains that already have some “form” of DAI (all except Optimism, Arbitrum and StarkNet) we will also face confusion, potential migration from other forms of DAI, etc… ",
                    "links": [
                        "https://www.bscscan.com/address/0x1af3f329e8be154074d8769d1ffa4ee058b1dbc3#code#L359",
                        "https://etherscan.io/address/0xc564ee9f21ed8a2d8e7e76c085740d5e4c5fafbe",
                        "https://ftmscan.com/token/0x8d11ec38a3eb5e956b052f67da8bdc9bef8abf3e"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.211956521739131
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#4",
                    "likes": "1",
                    "time": "05/07/2022-20:22:00",
                    "content": "This is a very important point! In some cases I think it could still be beneficial to offer liquidity support for non-canonical “wrapped” DAI. Maker will likely only want to deploy our balance sheet assets (eg. vaults, PSMs, protocol owned liquidity) through canonical DAI, but we still benefit from larger DAI circulating supply even if it is held in wrapped DAI. Wrapped DAI also imposes lower risk on MakerDAO, as any bridge or validator failures are externalized onto end users. That being said, proof of full reserves and assessments of bridge safety should be an important condition of supporting wrapped DAI versions on external domains. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/07/2022-20:56:45",
                    "content": "Could you please explain what would be held as collateral for canonical DAI? I think the idea is great and have seen a lot of traction and DAI demand on other L1s, e.g. Cosmos blockchain. For example if canondical-DAI was made available through Osmosis (Cosmos DEX), does that mean that all DAI was bridged there so it would be backed by existing PSM/RWA/Vaults? If that is the case, it might be worth also exploring DAI vaults on those L1s too support scalability, e.g. Atom-A Vault in Cosmos Blockchain. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.062500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "4",
                    "time": "05/07/2022-21:04:52",
                    "content": "Canonical DAI is backed by the overall Maker collateral pool. “Wrapped” DAI is backed by canonical DAI held in a particular bridge escrow contract, so it faces all of the solvency/technical risks of canonical DAI plus additional solvency/tech risk of the bridge provider. Canonical just means that Maker itself controls the bridging infrastructure. I think cosmos is a good example of a case where supporting wrapped DAI makes sense. It would be technically complex and also somewhat risky for Maker to operate our own ETH<>Cosmos bridge; developing cosmos sdk/cosmwasm components, vulnerability to validator misbehavior or governance attacks from the destination chain, etc. So while it would be great to offer ATOM vaults or more native MCD features in the Cosmos ecosystem, I don’t think it’s a realistic goal in the short term and we’re better off seizing the opportunity to support wrapped DAI (and growing our asset base). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.076388888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bartek",
                    "index": "#7",
                    "likes": "3",
                    "time": "07/07/2022-08:59:20",
                    "content": "I would also add here that not all bridges are being equal and - generally - we (at PECU) look very carefully at risks associated with different bridge types. On one extreme with have Rollups that promise to “inherit Ethereum security” meaning that they aim to not add any additional security assumptions. Deploying canonical DAI and Maker Vaults on Rollups feels safe and there is no need for Maker to manage its own bridge there. On another extreme are alt-L1s where bridged assets are typically held in custody/escrow managed by external Validators. It can be MultiSig, it can be PoS Validators, it does not matter - they are all external to Maker/Ethereum with no control from MakerDAO. Recent bridge hacks such as Harmony ($100M), Poly ($611M), Wormhole ($326M), Ronin (624) show that this infrastructure is very risky and I would be personally against relying on third-party bridge infrastructure. Finally we may consider running our own Bridge - it is doable and potentially does not introduce additional security assumptions other than our existing Oracle network. This is, however, complex investment and it would certainly be somewhat unique - we still have not seen app-specific bridges (although dYdX might change that if they build app-specific bridge to their app-specific chain). I have recently published a proposal for Bridge Risk Framework to l2beat.com governance forum. Hopefully this will bring us closer to better understanding of the risks associated with using certain bridges for MakerDAO. ",
                    "links": [
                        "https://rekt.news/polynetwork-rekt/",
                        "https://rekt.news/wormhole-rekt/",
                        "https://rekt.news/ronin-rekt/",
                        "https://gov.l2beat.com/t/l2bridge-risk-framework/31",
                        "https://l2beat.com"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.456380952380952
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#8",
                    "likes": "4",
                    "time": "07/07/2022-09:29:27",
                    "content": "    monet-supply:  Growth Potential This can be difficult to measure objectively as it is dependent on multiple contributing factors, including technical viability, support of institutional investors, marketing, existing user traction, and philosophical alignment. Domains with unique value propositions have a higher chance of long term success and relevance vs unremarkable EVM clones. With attention and liquidity following somewhat of a power laws distribution, market leaders are also at significant advantage over laggers.   While I do agree that multi-chain DAI would be a net positive for us, IMO (and especially after talking with other projects embarking on similar multi-chain missions to spread liquidity)… I think that focusing any of our efforts right now towards multi-chain integration would largely amount to wasted capital, and efforts, and stretch our team’s already limited bandwidth. Within the crypto space, I think the only pressing matter would be L2 integrations, native to Ethereum. Other chains seem to be dying a slow death, which I imagine will only get worse over time. We know that Ethereum is resilient, and will be here to stay, but as the crypto winter progresses… how many of the other chains will remain relevant? Some, of course, will, but only time will tell. Personally, I’d focus on deploying MCD across the Ethereum ecosystem. That’s where I see a truly addressable market. After the dust settles, and we see which other chains survive… we can always redirect bandwidth there.     monet-supply:   Source: QiDAO   The great guys behind QiDAO frequent our forums regularly. I would invite them to comment on some of their multi-chain woes.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.195256132756133
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sorenpeter",
                    "index": "#9",
                    "likes": "5",
                    "time": "07/07/2022-09:33:54",
                    "content": " ( means I’m watching since Discourse Police doesn’t allow for just posting an emoji ) - please tag @daif-core-unit when there is smth we need to be aware of. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#10",
                    "likes": "2",
                    "time": "21/07/2022-18:46:57",
                    "content": "RSK, a Bitcoin L2, should not be overlooked because of its solidity in terms of the infrastructure on which it is built, unlike other blockchains such as Solana or BSC, which stop their operation for periods of time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                }
            ]
        }
    ]
}