{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/subtle-attack-vectors-on-makerdao/19057",
            "title": "Subtle attack vectors on MakerDAO ",
            "index": 19057,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#1",
                    "likes": "9",
                    "time": "05/12/2022-21:25:36",
                    "content": "MakerDAO has put considerable effort into managing overt attacks(like harmful executives and hacks) and has fairly robust systems in place to manage them. However, I believe it is far less prepared for more subtle attack vectors aimed at siphoning value at the protocol through indirect channels through social coordination and governance voting. This becomes especially important as RWA investments provide far more ways to extract value. A simple example being a MKR holder(or few large holders) voting to give themselves below-market loans, or to use their services for transactions. With this attack, the value of MKR would stagnate or decline, while a small group of MKR holders earn considerable income. The protocol itself may deteriorate as it is slowly looted by a few well-connected insiders. The high complexity of governance, low governance participation rate and lack of disclosure requirements all make such attacks cheaper and easier to pull off. Uninvolved MKR holders can be rallied against a protocol killing executive, but are unlikely to rally against mundane, behind the scenes efforts to skim funds from a bond deal. I hope we can find better ways to manage these attacks and give them more consideration when MIPs come up to vote. TradFi organizations rely on heavy vetting of people in such positions and strong legal obligations to manage self-dealing, but MakerDAO does not have such mechanisms and will need to find its own tools to manage such attacks. ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining how MakerDAO is vulnerable to subtle attacks that can siphon value from the protocol through social coordination and governance voting. The author suggests that MakerDAO needs to find its own tools to manage such attacks and give them more consideration when MIPs come up to vote. The post provides constructive criticism and an audit of MakerDAO's vulnerability to these types of attacks.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.377417027417027
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#2",
                    "likes": "1",
                    "time": "07/12/2022-19:32:54",
                    "content": "Its unfortunate that Maker hasnt directly addressed this key risk. Maker’s lack of action doesnt demonstrate to DAI holders that Maker has a solid investment process that reasonably manages conflicts of interest.  It arguably demonstrates the opposite which isnt a good look. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/03/2023-01:33:50",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}