{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c2-sp2-add-core-unit-budget-risk-core-unit/6343",
            "title": "MIP40c2-SP2: Add Core Unit Budget (Risk Core Unit) ",
            "index": 6343,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "risk",
                "core-unit",
                "risk-001",
                "core-unit-budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#1",
                    "likes": "11",
                    "time": "03/02/2021-17:43:15",
                    "content": " Preamble MIP40c2-SP#: 2 Author(s): Primož Kordež Contributors:  Status: Formal Submission Date Applied: 2021-02-03 Date Ratified:    Specification  Motivation Remuneration for the Risk Core Unit.  Core Unit Name Risk Core Unit  List of Budget Implementations This budget implementation uses the Manual Budget Implementations, the Simple one, or any other method achieving the same result at the discretion of the Governance Facilitators.   Payment per month: based on predetermined quarterly budget  Asset type: DAI  Address: 0xd98ef20520048a35EdA9A202137847A62120d2d9  Payment Frequency: within first 10 days of each month  We intend to “invoice” the protocol on a monthly basis (first week of the month). This follows Simple implementation logic where through recurrent suck () calls Core Unit Facilitator requests for monthly funds to finance its team.  Budget Breakdown / Items  Team costs Team currently consists of 2 full time members, 5 part time members covering various risk related fields and at least 3 part time collateral onboarding evaluators:  Primož Kordež (@Primoz), full time - Risk Core Unit Facilitator Marko Štemberger (@rema), full time - Risk Analyst Monetsupply (@monet-supply), part time - Collateral evaluations & DeFi Andy McCall (@Andy_McCall), part time - VaR models & Risk Premiums Vishesh Choudhry (@vishesh), tentative, part time - State of the peg Dmitri (dmitri.z / d_zap), part time - Auctions Bogdan Gheorghe (bogdan.g), part time - On-chain data Jernej Mlakar (@jernejml), part time - Collateral evaluations Andrej Marolt (@indy), part time - Collateral evaluations Will Remor (@williamr), part time - Collateral evaluations   Tooling  AWS Infura Subscriptions to off-chain data APIs   Operations  Company administration Flights, conferences, etc. Legal costs   Grants  Risk tools development to attract new members Smaller tasks   Funding Process The team will use a company to distribute funds and sign contracts with its contractors (full time or part time workers). This enables contractors additional security but also enables the team to make payments in fiat (for infrastructure, administrative and operations costs). Further, this enables the team to behave like a competing startup and can manually decide how performance of individuals is rewarded. Also, privacy of workers payouts can be secured this way.  Budget Breakdown The monthly amount is based on quarterly budget. We believe we can reasonably estimate our costs on about a 3 month frequency. If the modifications are needed, they would be done on a 3 month basis through “Modify Core Unit Budget Subproposal Process”. If modifications are not proposed, the monthly payout amount gets rolled over from the initial proposal, if our work meets community and MKR holders expectations and demands. Proposed quarterly budget for the Risk Core Unit is 301,500 DAI, which translates into 100,500 DAI per month. Breakdown:  Team Costs        78% / 78,000 DAI Tooling                 5% / 5,000 DAI Operations           5% / 5,000 DAI Grants                 12% / 12,500 DAI   ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c2-spx-core-unit-budget-gov-001/6349/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/weekly-mips-update-28/6791",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/weekly-mips-update-27/6649",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-127-thursday-february-4-17-00-utc/6261/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/16",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-127-thursday-february-4-17-00-utc/6261/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-37-en-espanol/7168",
                        "https://forum.makerdao.com/t/maker-relay-ep-37/7154",
                        "https://forum.makerdao.com/t/weekly-mips-update-30/7083",
                        "https://forum.makerdao.com/t/weekly-mips-update-29/7000"
                    ],
                    "GPT-summary": "The post is a formal submission of a proposal to add a budget for the Risk Core Unit in the MakerDAO protocol. The proposal includes details on the budget implementation, payment frequency, team costs, tooling, operations, grants, and funding process. The author explains the proposal in detail and provides a breakdown of the proposed quarterly budget. A 3rd party could give constructive criticism or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Privacy, Security and risk management",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.502840909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/02/2021-06:57:22",
                    "content": "    Primoz:  Team currently consists of 2 full time members, 5 part time members covering various risk related fields and at least 3 part time collateral onboarding evaluators   All this for 65k DAI per month? None of you live in Norway that is for sure. I would perhaps run that spreadsheet one more time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.7414772727272725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "3",
                    "time": "05/02/2021-12:57:02",
                    "content": "    Planet_X:  All this for 65k DAI per month? None of you live in Norway that is for sure. I would perhaps run that spreadsheet one more time.   Yes, I agree. @Primoz, I am not in a position to give you any suggestions, of course! But I think the proposal (and Core Unit) would be even stronger if you could be more ambitious in the medium term:  planning to expand the team, even significantly. Including costs for ‘unexpected’ events (e.g., quick 3rd party audits of some sort). Include a salary for ‘less’ technical tasks. For example one person, with a good technical background, that is charged with the task of interacting often with the community (results/scientific dissemination) etc. On the same lines of (3) above, another figure with the task of grouping together all major results and simplify the life (with Wikis, Documentation, whatever) of other Risk-people who might come in the future and may want to start another Risk Core Unit.  I mean, I know the budget can be updated, but it would still be good (IMHO) to have a outlook for the medium-term expansion of the team (since this team is of 100% critical importance). NOTE 1: If you don’t spend all the DAI, nobody is going to blame you too much. You can always give them back to the MakerDAO. NOTE 2: We are in an expansion phase. Please give yourself a good salary (that depends on your country cost of living, of course), and also make sure that salaries can attract talents living in Norway (as @Planet_X said). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.118412384716732
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#4",
                    "likes": "6",
                    "time": "18/02/2021-22:55:45",
                    "content": "    Primoz:    Address: The destination Company address will be provided by the Core Unit Facilitator    You should be adding your ETH address here for the funds to go into     Primoz:    Payment Frequency: within first 10 days of each month for past month    Was there a reason to do previous month? This would also affect payment timeline. If this goes through at end of March, is the first month for March or April?     Primoz:   Team Costs 76% / 65,000 DAI    I think this is appropriate for what we have up to now, but agree with @Planet_X and @iammeeoh that you may want to consider a future looking growth & retainment proposal. I reference the conversations you and I had around being able to find and hire good people with both a background in financial risk and comprehensive understanding in blockchain fundamentals. In the end, it’s up to you and you can certainly ask for more later, but I wanted to share from a growth perspective (data points are still rough. Happy to pull more detailed data at a later time):   Risk Management at the Head, Director, Executive level at banks or consulting can range fairly wide range from USD 130K - 500k+ just for base salaries. I’m not going to go too deep into this but I do hope you consider a global market rate salary for yourself and other full time people on your team. I find Risk, Governance, Engineering to be critical units for at minimum, maintaining the Maker Protocol, let alone for growth.   Risk Analysts range (globally) from USD 60K - 80K annually / $6K a month salaried (Data from US H1Visa, and more), which means for the many part-time or contractor folks you have, it would imagine it be closer to $7.5-8K with the premium. If we go with that avg x 6 (given not all folks work full part time hours), that’s already 48,000, leaving 17,000 for 2 full time employees, so it might be a bit of a squeeze if you want to hire or retain more.   In comparison, teams like yEarn are around $7k - $12K a month for “core team” roles and Sushi is proposing around USD $10K - $25K excluding bonuses for there “core team” roles. Disclaimer, none of these have a “Risk” role, so I think the market rate is a more appropriate comparison.       Primoz:   Operations 3% / 2,500 DAI    Additionally only 3% to cover Company administration and legal costs (we don’t have legal core unit right now, so we should assume this as not expensed elsewhere) seems a bit low, given you will use a company to do so on your behalf (I believe even Accountable was quoting 10%?). Do you see this increasing? ",
                    "links": [
                        "https://www.glassdoor.de/Salaries/risk-analyst-salary-SRCH_KO0,12.htm?countryRedirect=true",
                        "https://forum.sushiswapclassic.org/t/sushiswap-hiring-guidelines-v4/2258"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.987612612612613
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#5",
                    "likes": "7",
                    "time": "20/02/2021-01:25:25",
                    "content": "Conscious this is not necessarily my place to add comments on compensation, as it comes down to talent sourcing and retention strategies from each facilitator. But @amyjung asked me to provide feedback, so here it goes :). If strategy is aimed at recruiting/retaining senior quantitative risk analysts/risk managers then I am not 100% sure the budget reflects what I see in the marketplace.  For permanent salaried employees (full FTE), I do not know a single senior quantitative analyst and/or manager earning less than 110K/year. That base salary excludes holiday pay, sick leave pay, pension retirement contributions, employer insurance (health, redundancy…) etc which the company covers. For contractors and/or freelance on a full-time basis there is a premium given there are none of perks around holiday, pensions etc. For those the base is more like 70-80% (185-195K) on top of the permanent role rate. For top rank Risk people, if that is the strategy, I recommend looking at rates at global financial hubs first: NY, London, Amsterdam, Frankfurt, Hong Kong, Singapore, Sydney. Then second tier hubs and so on. This should give a proxy for rates.  Hopefully this helps strategising/budgeting. Disclaimer: I’ve worked as both permanent and contractor in quantitative Risk. Plus, I have a full circle of quantitative Risk people around (Analysts, Managers and Head Ofs). We’re pretty open about how much each of us make. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.106970324361628
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#6",
                    "likes": "11",
                    "time": "23/02/2021-10:44:53",
                    "content": "Thanks everyone for valuable feedback. I have made few adjustments to proposal: partially increased compensation and operations costs and added address for receiving DAI. The thing is that majority of people working for Risk Core Unit are still part timers and that is why compensation per person might seem low. My goal is to motivate them to come on board full time and propose a higher budget afterwards if needed. This is why 3 month period for budget adjustments was chosen. Hopefully they recognize that Maker Risk is serious and exciting business and they join Maker full time. This proposal is also now formally submitted for the March governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.453703703703704
                }
            ]
        }
    ]
}