{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/redenominate-the-mkr-token-to-aid-adoption-and-increase-the-safety-backstop/7593",
            "title": "Redenominate the MKR token to aid adoption and increase the safety backstop ",
            "index": 7593,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MkrMstr",
                    "index": "#1",
                    "likes": "1",
                    "time": "21/04/2021-19:43:54",
                    "content": "Pretty much what it says in the title : I propose MKR pulls a $DOT and redenominates by 100 or even 1000. Why? Unit bias is a thing. Expected Result : Ownership goes up, backstop increases, me happy you happy. Let’s hear it… ",
                    "links": [],
                    "GPT-summary": "The author proposes to redenominate the MKR token to increase adoption and safety backstop. The proposal is explained in the post, and the author is asking for feedback. A 3rd party is giving constructive criticism of the proposal and asking questions about it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.950000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "21/04/2021-19:59:20",
                    "content": "Apparently DOT was split to make it “more ergonomic”–MKR is a Governance Utility Token, currently protecting more money than the Polkadot ecosystem has get to garner (that could change)–but I get your drift–would be interesting if MKR was split–if people would want to buy more–but IMO incentives is what usually folks go for–or/and of course silly price pumps–which won’t be happening here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "2",
                    "time": "21/04/2021-21:20:00",
                    "content": "Why not go the other way? Divide the number of MKR by 1M so there are about 0.99 MKR total. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "3",
                    "time": "21/04/2021-21:20:37",
                    "content": "But… we have a lot of decimal places. MKR isn’t indivisible like a share of Berkshire-Hathaway ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MkrMstr",
                    "index": "#5",
                    "likes": "1",
                    "time": "21/04/2021-21:56:27",
                    "content": "Thoughtful responses, thank you. One aspect I didn’t consider (of many, I’m sure) is that doing a stock split might attract slightly more short term speculative holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "1",
                    "time": "22/04/2021-01:18:00",
                    "content": "MKR does not need to be renamed, since its own emission and burning system guarantees security for the protocol, and it does not make sense to expand the mass of MKR since it would affect the security of the protocol itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MkrMstr",
                    "index": "#7",
                    "likes": "0",
                    "time": "22/04/2021-04:19:41",
                    "content": "Wasn’t proposing a rename. Thank you for your reply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#8",
                    "likes": "1",
                    "time": "22/04/2021-04:25:23",
                    "content": "sorry, hahahaha the corrector of the keyboard ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#9",
                    "likes": "3",
                    "time": "22/04/2021-10:21:01",
                    "content": "I think the great thing about Maker so far is that we haven’t tried things like this and chased after the silly crowd of crypto. I like that we’re a serious protocol doing serious stuff in this space and generating value through real products and not speculation. I’d rather have buyers buying MKR for those fundamentals, even if it means that we miss out on the Doge/XRP/ADA crowd. Our actions influence the kind of community we attract and this kind of move does more harm than good. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "1",
                    "time": "22/04/2021-10:38:13",
                    "content": "    AstronautThis:  I’d rather have buyers buying MKR for those fundamentals, even if it means that we miss out on the Doge/XRP/ADA crowd.   Given the fairly flat governance hierarchy, I think it’s important we don’t try to attract people who lack financial literacy— which is exactly who the marginal buyer on a split would be. Remember: The protocol provides us with a put when things are profitable. We don’t need another speculative buyer to hold our bags. As long as our business is sound, our tokens have intrinsic value, and I will admit that I worry governance could deteriorate if we actively tried to attract the least financially sophisticated investors in the market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.578703703703703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "8",
                    "time": "22/04/2021-11:41:19",
                    "content": "    PaperImperium:  Given the fairly flat governance hierarchy, I think it’s important we don’t try to attract people who lack financial literacy— which is exactly who the marginal buyer on a split would be.   I want to comment briefly on this. I think we should be a little careful about this sort of thinking. One of the advantages to Maker over the legacy banking system is that it’s accessible to anyone (both in terms of product, and in terms of governance.) We should be careful not to exclude people just because they aren’t financially literate, people can learn, and differing perspectives can be valuable. One could also make the argument that the legacy banking system is too far out of reach from the everyday person. Now obviously Maker is currently also way out of reach, but I feel like it has the potential to be more open and accessible than a traditional bank, hopefully to the benefit of all. That said, what I think we want to avoid is attracting lots of speculators with little knowledge of what Maker is, and who are very focused on short-term profit. This is the group I fear we would attract if we did some sort of split on MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "2",
                    "time": "22/04/2021-12:23:18",
                    "content": "    LongForWisdom:  I think we should be a little careful about this sort of thinking. One of the advantages to Maker over the legacy banking system is that it’s accessible to anyone (both in terms of product, and in terms of governance.) We should be careful not to exclude people just because they aren’t financially literate, people can learn, and differing perspectives can be valuable.   So that’s a fair criticism, and a reminder to myself that I’m sitting in a traditional mindset and Maker is not a traditional corporation. It does perhaps suggest there should be some kind of formal on boarding of new participants, though. I was fortunate to have quite a few people engage with me directly on the forum, in the chat, and in private message from the very beginning. But I also immediately sought out things like our financial statements and combing through all the threads on collaterals and core units. Given what you rightly point out about not wanting to exclude people based on their starting point, it may be worth being able to offer a sort of primer on what Maker is, how it sits financially, and and where the ongoing discussions about its future are. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.683994982290437
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#13",
                    "likes": "2",
                    "time": "22/04/2021-13:59:54",
                    "content": "    LongForWisdom:  I want to comment briefly on this. I think we should be a little careful about this sort of thinking. One of the advantages to Maker over the legacy banking system is that it’s accessible to anyone (both in terms of product, and in terms of governance.) We should be careful not to exclude people just because they aren’t financially literate, people can learn, and differing perspectives can be valuable.   I agree with this.   I think it is why I think that L1 fees (as well as increases to DUST to current levels) is actually excluding anyone but the well heeled financially from Maker.    Like any situation or choice there are pros/cons to be considered.   I think less people involved who also have to hurdle the high information requirements can be seen as a good thing as bandwidth by the knowledgeable is limited.  Reduce the hurdle and we have 10’s if not 100’s of new people asking questions and everyone could get saturated very quickly.   There is a fine balance to be achieved by doing something or even asking a question. Is Maker really suffering from MKR price being 5K/MKR?    Frankly if there is anything we need is to hire more qualified people and being able to make salary offers and long term contracts that will pull in the most experienced and best of the best. There are technical issues with just splitting MKR btw that involve contract, governance and documentation changes.   We end up loading more work on people already overworked to get what exactly.? My biggest issue here is the large MKR holders that really haven’t done anything except put money in.  Honestly I want to dilute these people against those who are doing the actual work because Maker isn’t just something you drop money into and can expect to get rich by doing nothing.   A LOT of people have worked their ass off, continue to work their asses off and a good number of them are barely getting competitive wages much less MKR ownership.  Sure I have issues with paying people a lot of money (that they basically can retire on in 4-5 years).   My concern isn’t about paying them, but about the potential that we will have to replace them.   I don’t want just a 4-5 year vesting contract but one that gives them a good nest egg but also offers decent rewards to stay on 5-10-15 years.    In operations we learned that hires basically follow a U curve.   Most people who are going to leave will do it in the first year of training.    Hardly anyone leaves between 3-7 years and then after about 10 people are ready to retire or move on. My concern here is the length of the U curve for MKR being 4-5 years basically means we will constantly be cycling through people and never really build experienced long term folks in this protocol simply because there will be no reasons for them to stick around or they will find a better prospect elsewhere. I don’t see anything in Maker related to a HR department or feed back system so we can gauge how our workers feel about their positions in Maker, whether they plan or want to stay, and how we can help them. But this is off topic on this thread.    Personally I am a no (at this time).  If Maker were to do ANYTHING to bring new people in I’d say take some of the MKR that the foundation holds (say 10-50K) and lock it in a contract and issue 10-50M MKR-I (for Maker-Invest) that doesn’t vote or does something different.  The markets love new tokens and I can’t see any reason why this couldn’t be a new thing to bring people over.   But this is a whole other project that our current staff probably doesn’t have time for.  I also don’t know that we want to lock away more MKR from governance. I think if there was one issue to solve it would be to get fees down both for governance participation, but also use of Maker by getting to a sidechain/L2 solution both for governance and for Maker vault access as soon as reasonably possible.    The barrier to access here imo is rapidly becoming L1 network access fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.0546911211683945
                }
            ]
        }
    ]
}