{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/publication-of-the-runtime-verification-audit/976",
            "title": "Publication of the Runtime Verification Audit ",
            "index": 976,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "security"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/iamchrissmith",
                    "index": "#1",
                    "likes": "9",
                    "time": "18/12/2019-18:52:13",
                    "content": "With the launch of Multi-Collateral Dai (MCD), the Maker Foundation worked with the community to deliver a major milestone for the DeFi ecosystem. Rather than the end point, the initial deployment of the MCD system is the start of a continuous process of extending and improving the protocol.  Security Roadmap Not only will the Maker protocol be extended with new functionality, the quality and security of the system are also reviewed on an on-going basis. This was already illustrated by the publication of our permanent security overview site, as well as the bug bounty program which is still on-going without end date. On October 23rd, the Maker Foundation posted the latest update of the MCD security roadmap discussing the details of multiple audits. At the time, we published and discussed the findings of the Trail of Bits and Peckshield audits that were done on the MCD code base.  Runtime Verification Audit A third team, Runtime Verification, had already completed their high-level model of the core MCD system and just begun building models of the other modules. In the meantime, the remaining models for MCD have been completed and we’re happy to publish these results today. Read the update below, have a look at our updated security overview site, or visit the github repository for more technical details. Any questions and comments can be posted in this forum thread and the Foundation smart contracts team will be happy to reply.  Runtime Verification, an Illinois-based software analysis company, uses runtime verification-based techniques to improve the safety, reliability, and technical “correctness” of software systems. The modelling and review components of Runtime Verification’s engagement have been delivered. The code repository can be found in the MakerDAO’s Github. The project involved a review of the DSS source code, the development of a K specification that described the high-level behaviors of MCD core and the overall state-updates that each operation in the system should have. It also included reproducing the issues found through our other review and the bug bounty program and adding those tests to the specification. Lastly, it included a random tester and bounded model checker that run on both concrete and symbolic back-ends to ensure the properties hold. While this engagement has been focused more on designing and building the specification than a traditional audit of the code, it did identify several improvements that could be made in the code and integrated known/previous bugs to give us reasonable confidence in the model’s ability to identify similar bugs. Going forward this specification and the resulting model can be used to check that changes to the protocol do not violate the specified system behaviors. We are continuing this work by focusing on applying and directing the tester over random and real world events and continuing to add to the high-level properties of the specification. The random tester can generate arbitrary sequences of transactions for testing and test them against the known properties of the system. These properties document the intended behavior of the system and act as checks against the traces that the random tester generates. Future governance updates to system parameters and changes to the MCD system itself can be tested against the high-level model and random tester before deploying to mainnet to ensure they do not unintentionally violate the desired system properties. If it is desirable to change the properties, the model and testing can be used to show how the proposed change alters the overall behavior of the system.  ",
                    "links": [
                        "https://hackerone.com/makerdao_bbp",
                        "https://blog.makerdao.com/mcd-security-roadmap-update-october-2019/",
                        "https://security.makerdao.com/audit-reports#trail-of-bits-final-audit-report",
                        "https://security.makerdao.com/audit-reports#peckshield-final-audit-report",
                        "https://runtimeverification.com/",
                        "https://security.makerdao.com/audit-reports#runtime-verification-specification",
                        "https://github.com/makerdao/mkr-mcd-spec",
                        "https://github.com/makerdao/mkr-mcd-spec"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.062598386462023
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/12/2019-21:10:04",
                    "content": "Great Update, i was about to ask if the bug bounties was still on. But i did not since the hackathon is still going on and you guys have a lot of thing to do. Unfortunately i can’t try to hack Maker hahaha. It would have been funny… Well not really but i like to explore new things . I did read that to be eligible you need to find the bug in a days basics like you would normally navigate each day so too bad, no hack for me today. @iamchrissmith Thanks for the update. We should update the other post if its related to this one Taken: A Governance Dashboard ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.030681818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iamchrissmith",
                    "index": "#3",
                    "likes": "2",
                    "time": "18/12/2019-21:55:23",
                    "content": "Thanks for your reply and glad you found this helpful! If you ever want to participate in the bug bounty program, we don’t have a time limit or deadline (other than to report a bug we don’t already know about). You check out full details on that program and how to submit on our HackerOne page. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#4",
                    "likes": "4",
                    "time": "19/12/2019-00:25:46",
                    "content": "Thanks for the inside, i mean, so much work here i can do and there, github etc. I don’t have enough of 24 hours in a day … i wish there was more than only 24 hours . It’s almost like a drug addiction this things, i can’t leave my computer until i finished it…Like a game, but even better while learning… Thanks @iamchrissmith i will be targeting this tonight and get in touch with ya  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.493055555555556
                }
            ]
        }
    ]
}