{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/govalpha-administered-multi-sig/8304",
            "title": "GovAlpha Administered Multi-sig ",
            "index": 8304,
            "category": [
                "Core Units",
                "GovAlpha"
            ],
            "tags": [
                "multi-sig",
                "gov-001",
                "multisig-rec"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "10",
                    "time": "24/05/2021-17:11:36",
                    "content": "As per MIP47, GovAlpha would like to disclose the details of their multi-sig such that it can be considered owned by Maker Governance. A ledger spreadsheet exists and will be shared in the near future, we’re currently trying to figure out how much information should be shared publicly and how much should be obfuscated to maintain contributors and grantee’s privacy. Multi-sig Address: 0x01D26f8c5cC009868A4BF66E268c17B057fF7A73 Keyholders:   @LongForWisdom : 0x66f40F044E0e2F77bB746e3275E82e88dCBA2D69  @prose11 : 0xf3ED2bdeBa77940E6759B806cd55CE20cAE369BE  Per MIP47c1:   Governance must be able to revoke funding and permissions from approved multi-sigs at any time.   You can check the spending limit section here. The DSPauseProxy Contract is allowed up to 1B DAI.   Signatory requirements providing no less than ⅔ of listed signatories to sign off on an action.   It’s a 2 of 2 mult-sig currently, with @LongForWisdom and @prose11 as keyholders.  All signers must be tagged on the forum and their willingness to be included in the Multi-Sig publicly confirmed.  Confirmed.  A representative for the Multi-Sig must be designated as an official point of contact.  @LongForWisdom is the primary contact.  There must be a clear and public explanation of the purpose and scope of the Multi-Sig.  Administering funds designated by Maker Governance to be spent to achieve the GovAlpha Core Unit mandate.  A clearly defined process for onboarding and offboarding signatories.  Facilitators of GovAlpha will be added as keyholders to this multi-sig. Signatory requirements will be adjusted as necessary to maintain 2/3rd signers wherever possible. In certain circumstances members of GovAlpha may be added as keyholders at the existing facilitators discretion to maintain an adequate level of security for administered funds.   A wallet address to be whitelisted.   0x01D26f8c5cC009868A4BF66E268c17B057fF7A73  Following an approved Governance action that involves a newly recognized Multi-Sig, the information provided will be added to a list of recognized Multi-Sig Wallets.  @MIP-Editors please add this to the list when appropriate. ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP47",
                        "https://gnosis-safe.io/app/#/safes/0x01D26f8c5cC009868A4BF66E268c17B057fF7A73/settings",
                        "https://etherscan.io/address/0xBE8E3e3618f7474F8cB1d074A26afFef007E98FB",
                        "https://gnosis-safe.io/app/#/safes/0x01D26f8c5cC009868A4BF66E268c17B057fF7A73/balances",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2021-06-04/8526",
                        "https://forum.makerdao.com/t/mip40c3-sp59-govalpha-budget-2022-23/13144",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2021-05-27/8387"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.72448384948385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "2",
                    "time": "02/06/2021-18:55:59",
                    "content": "Whoops, liked the post but forgot to confirm. That’s my permission address and I have been successfully added to the multi-sig  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "1",
                    "time": "03/06/2021-15:52:29",
                    "content": "GovAlpha will use this multi-sig for budget distributions for the month of June onwards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/09/2021-15:52:57",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "0",
                    "time": "03/06/2022-15:29:34",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#6",
                    "likes": "1",
                    "time": "03/06/2022-15:32:50",
                    "content": "We’ll be making some changes to the multisig today following this announcement:    MIP41c5-SP7: Facilitator Offboarding (Voluntary) - LongForWisdom (GOV-001) RFC   MIP41c5-SP7: Facilitator Offboarding (Voluntary) - LongForWisdom (GOV-001)  Preamble MIP41c5-SP#: 7 Author(s): @LongForWisdom Contributors: Tags: core unit, cu-gov-001, facilitator, personnel-xboarding Status: Date Proposed: 2022-06-03 Date Ratified: <yyyy-mm-dd>   Sentence Summary MIP41c5-SP7 voluntarily offboards @LongForWisdom, one of the active Facilitators of the GovAlpha Core Unit (GOV-001).   Paragraph Summary MIP41c5-SP7 voluntarily offboards @LongForWisdom, one of the active Facilitato…     Namely, adding @Patrick_J as a signer and removing @LongForWisdom. Will follow up with a full report but wanted to give advisement before we submitted the transactions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.104166666666666
                }
            ]
        }
    ]
}