{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip65-clydesdale-governance-framework-setup/16565",
            "title": "MIP65 Clydesdale / Governance Framework & Setup ",
            "index": 16565,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "mip65"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#1",
                    "likes": "9",
                    "time": "13/07/2022-09:26:42",
                    "content": "Dear Community, We have settled on a general governance scheme for Clydesdale and want to explain this to the community. Here’s a basic illustration of the process and participants  1233×689 69.7 KB  We get to a situation where:  Asset ownership and all actions hereupon sit entirely with a single Trust structure in the BVI The trust, with DAI holders as beneficiary, is governed by a professional Trustee The Trustee is instructed exclusively via Governance Poll outcomes The execution of the instructions happens within a structure of validations and controls by a set of independent third-parties to ensure no deviation from instructions possible and feeds back appropriate data to Maker.  One can somewhat see the Instructions coming as a Governance Poll outcome from Maker as the “code” and the trust/trustee/3rd parties as the “machine” that safely executes the code and puts relevant data back to Maker. Sort of an alpha version of “programmatic tradfi/defi integration governance” we hope to expand upon over this year to further automate. Key to note here is that, in principle, anybody on the Maker forum can create a Governance Poll with a proposed instruction set for the Trust. We are trying to create an entirely open and transparent platform for deploying capital/acquiring collateral. We’ll now describe the “code” and the “machine” in a bit more detail. First the code/instruction part.  “Code”/Instruction Sets via Governance Poll Upon the “clydesdale genesis” executive vote that setup the vault, we issue 3 sets of instructions/”code” to the professional Trustee - and we choose to see the positive execution vote and setup of the Vault as a Maker decision that these 3 sets of instructions are approved (i.e. we won’t do separate Governance Polls for each of them, as that makes little practical sense as these are a key part of completing the task of implementing MIP65). But hereafter any action-set, beyond the very benign, needs to be instructed to the Trust/Trustee via Governance Polls. The initial package of Instruction sets perform the following general functions (and we will share the specifics of these instructions sets as soon as LTS/RWF have reviewed them finally):  INITIAL INSTRUCTION SETS     Set Actions in Instruction set     I This sets up the “machine” - i.e.:  * Approves the setup of a Trust with Trustee and according to a specific Deed poll in BVI  * Approves the engagement of 3rd parties (i.e. Cash administrator, Bank, Custodian, Auditor, Maker Committee, etc) and their individual roles   II This executes a Pilot transaction to test the “machine”: * Mint DAI 1M, exchange to USDC via PSM, exchange to USD and ultimately buy BlackRock ETF product  * Sell 10K worth of BlackRock ETF product and return in DAI to Vault   III This executes the Principal Capital Deployment on the “machine”:   * Over a set of weeks mint DAI xM per week and buy BlackRock ETF and fund Baillie Gifford mandate. (CES is evaluating what the most appropriate and secure deployment pattern is)    These instruction sets are set out to be as detailed as possible - including clear specification of checks and validations required along the way. Maker can structure instruction sets in any manner it prefers and submit via Governance Poll to the Trust - and given it is legal and possible - it will execute. The above 3 Instruction sets have been “pre-tested” in the sense that they have been discussed with the relevant parties in the instruction sets and so we know they are confirmed executables. As a safety measure we have also developed a library of key instruction sets that address key situations and can be put up as Governance Polls, that we know are appropriately designed and confirmed executables. This way most eventualities are planned for and can be acted upon confidently and speedily by Maker. This library has the following instruction sets (these will also be filed in detail with the community as soon as LTS/RWF have validated):  LIBRARY OF INSTRUCTION SETS     Instruction Set Content     Emergency Shutdown Executes an Emergency Shutdown (as agreed with CES)   Part/full Liquidation Liquidates the current investment portfolio (partly or full) and returns DAI to Maker Vault   Add Deployment/Strategy Add capital to either existing or new strategies/managers   Yield Payment Pay Yield to Surplus Buffer (the intent is for this to be manual at inception and turn to automatic as principles hereupon are agreed within the community)   Wind-up Wind-up portfolio and structure   Change 3rd Parties Change one of the parties engaged in the structure   Change Maker Committee Special case of changing Maker Committee Members   Change Trustee Special case of changing Trustee    More of these instruction sets may be constructed as needed - and edited and updated as required. Here’s a draft Instruction set (they are named “MakerDAO Resolutions” in the Deed Poll that needs to be referenced) as example  The “Machine”/Trust, Participants & Interaction setup There are 4 fundamental parties that ensure correct execution of instructions:     Party Role & Purpose     Trustee(SHRM)  Execute. This is the party executing for the Trust according to the instructions made by Maker.   Maker Committee(2 Community Members)  Validate. Two individuals appointed by MakerDAO from the community. They validate that the instructions made by Maker are correct and validate reporting going back to Maker.   Administrator(Hadstone)  Control & Approve. All Trustee’s actions relating to payments and actions require physical approval by Administrator - matching action up with the instructions (i.e. approver role in banking systems etc)   Monitor(Monetalis)  Monitor & Report. Dual role of monitoring the participants execution and collating reports/data and delivering to Maker.    Together these parties ensure correct execution of Maker decisions and true reporting of data/situation via both requiring multi-independent party validations and approvals. The general rules in the Trust foundation are:   Trustee has no discretion for executions outside of Governance Poll approved instruction sets.   Governance Poll instructions and Trustee’s plan to execute the instruction request must be validated by Maker Committee (it adds a check and ensure no “lost in translation” problems)   In execution, the Administrator must independently approve key actions (in particular cash/crypto transactions) physically within the respective third-party tools (i.e. bank account/custodian etc require multi-approver transactions - i.e. trustee and administrator). The approval is based upon whether the action satisfies the requirements of the Governance Poll instruction set and the validated plan with the Maker Committee.   All actions and outcomes are aggregated by the Monitor and provided to the Maker community including evaluation of process soundness. Including monthly valuation reports.   All such Monitoring Reports are delivered with a Maker Committee validation of reporting results.   All 4 parties are required to post process, party concerns or errors on the Maker Forum directly.   Please note that removal/change of the Maker Committee requires appropriate governance poll and a direct validation hereof by a Governance Facilitator to the Trustee We, of course, expect to refine and develop further on this framework over the coming months. Shortly we will come back with the detailed instruction sets (with RWF/LTS and CES validations) and Maker Committee appointment requests etc. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip65-sub-project-tokenization-community-feedback-request/16692",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-documentation-hq/17923",
                        "https://forum.makerdao.com/t/2022-09-28-executive-inclusion-update/18076/5",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-14-20-de-julio-del-2022/16911",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.739328582672738
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/07/2022-09:52:40",
                    "content": "    Allan_Pedersen:  Mint DAI 1M, exchange to USDC via PSM, exchange to USD and ultimately buy BlackRock ETF product   The broker of choice for exchanging USDC to USD has been selected? Also, once this method gets going (smoothly) is the idea to DCA into Blackrock ETF?     Allan_Pedersen:  Pay Yield to Surplus Buffer (the intent is for this to be manual at inception and turn to automatic as principles hereupon are agreed within the community)   Have you looked into the HVB setup where RWAJar is used and CES keeper sweeps funds to SB? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/07/2022-10:26:49",
                    "content": "Hi @flipflopflapdelegate , Very quickly…  2 options in the works: Sygnum Bank w/fee for USDC/USD exchange + Coinbase w/zero fee for USDC/USD exchange. Working out operations and pro/cons of both to make a final choice to put into the instructions for the trust. The intent would be to just deploy ASAP in the ETF as money available - CES is considering a deployment pattern they find most safe. I would like to do yield via governance poll in the beginning to be in control of what is going on here in the beginning. Remember these assets have some potential market value variations yet essentially support a fixed 500M DAI vault - and so we somewhat need to evaluate monthly or so - at least in the beginning - what is reasonably safe to pay into SB. As soon as principles around yield payment are clear we can go into automatic mode with CES help. I have a sense that the community also need to more broadly discuss about yield formats - for instance: reinvest TradFi-> Vault value increase → mint value increase in DAI to SB vs Convert TradFi income to DAI → Pay to SB - and probably other formats. CES is reviewing the technical side right now - and I am sure they are evaluating how to reuse the HVB solution for this also (update: I am told by CES they are indeed expecting to reuse that HVB structure you mention. They are, as expected, on the ball!).  I hope that makes sense. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.860615079365079
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Wrongcomma",
                    "index": "#4",
                    "likes": "2",
                    "time": "31/07/2022-22:40:24",
                    "content": "Dear Community, Following on from our last [post] (MIP65 Clydesdale / Governance Framework & Setup) that describes Clydesdale’s Governance design, we would like to reach out to the Maker community to find two candidates to sit on the Maker Committee. The Maker Committee has a few key functions as a “human relay” between Maker and Trustee:  Validate the Instructions made by Maker (via Signal Request) for the Trustee. (infrequently) Validate the reports on portfolio performance (as aggregated and audited by Monetalis) for Maker. (monthly) Act as “sparring partner” for Trustee from time-to-time, as needed, to translate the instructions from Maker into executions.(infrequently)  All validations require both members of the committee to positively validate, and the Maker Committee members are appointed/removed by Maker Instructions. We have to highlight that, as the Maker Committee is constituted in the Trust document as part of governance, the two members will be required to register personal details with the Trustee. There are no particular skill requirements for the persons on the Committee except for an interest in RWA and understanding of the Maker governance process. Some accounting and financial services experience may be an advantage. Should you be interested in the role - or have questions - you can register the interest/question here in the forum - or contact [email protected] / [email protected] directly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.133608815426998
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#5",
                    "likes": "6",
                    "time": "17/08/2022-07:45:56",
                    "content": " UPDATE:  Structure, trusts and entities established (pending final legal review) Agreements with the various service providers developed and agreed (pending final legal review) Onboarding on-going with below mentioned key parties  in the picture (Bank Sygnum, Baillie Gifford etc) for the relevant entities. Some of these should be finalised within a week or two - some will take longer. Draft Trust Instruction sets/MakerDAO resolutions made and being reviewed by the relevant CU’s over the coming days to come to final versions.  In our view all involved - CU’s, service providers and onboarding parties - are doing a terrific job and working to get this completed ASAP over the coming few weeks for actual deployment. Will post more as things progress. Hopefully very soon.  PresofMonetalis1280×720 71.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                }
            ]
        }
    ]
}