{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/decap-quadratic-funding-augmenting-the-endgame-optimal-infrastructure-funding-mechanism-for-makerdao/15904",
            "title": "DeCap + Quadratic Funding: augmenting the EndGame. Optimal infrastructure funding mechanism for MakerDAO ",
            "index": 15904,
            "category": [
                "Governance"
            ],
            "tags": [
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#1",
                    "likes": "0",
                    "time": "19/06/2022-20:54:16",
                    "content": "I’ve been thinking about @rune 's Endgame proposal. The key task that is up for recurrent solutions within MakerDAO is finding consensus over alternative policy priorities and allocating limited resources (financial and non-financial) accordingly. In other words bridging the discrepancy in perceived subjective value of respective competing policy venues, ideally by measuring it and mapping these subjective values to respective allocations in an optimal Maker’s interests-wise way. One can foresee that without a systematic approach this problem will only exacerbate with the protocol growing more complex with consequent increasing complexity of the protocol’s infrastructure and range of contributing efforts. What MakerDAO is facing here is the problem of optimal allocation of limited resources towards public goods. Maker protocol, as any decentralised fat protocol, is open infrastructure. Hence Maker infrastructure funding is essentially a problem of optimal allocation of limited resources towards public goods. Public goods, like national defense, urban or DeFi infrastructure, are non-excludable (if you use Maker, you can’t refrain from benefiting from efficient technical backend, for example, it’s part of what makes Maker a DeFi protocol) and non-rivalrous (your benefits do not reduce that of other Maker users). The problem of efficient and fair distribution of resources towards public goods has been a subject of extensive research. Buterin et al. have suggested a Capital-constrained Liberal Radicalism (CLR) mechanism, aka quadratic funding, which offers a (nearly) optimal distribution of limited resources (e.g.: a designated budget) against a given list of proposed public goods. Basically the idea is that voters (delegates) deciding over limited resources  allocation can reflect in their decision not only their preference, but also the strength of their preference by buying influence at increasing marginal cost, thus a broader community can account for interests marginal on grand scale, but important in view of part of the community, while also preserving the overall democratic ethos and not sliding towards oligarchy, where a few powerful make decisions for everybody. And then there’s a matching pool (a budget) provided either by the DAO, like MakerDAO, or some benevolent outsiders, which matches voting results with funds. Here’s a primer on quadratic payments from V. Buterin. It’s also been mathematically proven by Weyl et al. that under standard assumptions, a fixed set of communities and public goods as in our case, in large populations quadratic voting mechanism, of which CLR is an extension, leads to approximately optimal decisions on public goods. Finally, a number of promising real world experiments around CLR has been carried out, of particular interest for us being Gitcoin protocol for Ethereum infrastructure funding, clr.fund with purposes similar to that of Gitcoin, but implementing anti-collusion infrastructure and Optimism, which augmented CLR with badge holder governance.  Next we introduce a notion of Global DeCap (Decentralised/Delegate/Degen Capital). Each delegate has their own individual DeCap. It’s cumulative, non-transferable and can’t be delegated. A delegate votes with their DeCap. A delegate is compensated proportionally to their DeCap, maybe with some floor and ceiling. DeCap is comprised of:   delegated MKR;   reputation earned from objective data (degree of active involvement in the DAO life: onchain vote participation, successful MIP authorship etc.);   subjective peer assessment (delegates/community members/MKR holders give subjective scores).   Regarding the subjective part: e.g. delegates give each other scores, say from [0, 1] for each post, proposal, commit, maybe with some weight differentiation. Or one/several scores at the end of a given period. Reviewers could be rewarded for being the first to rate a highly popular contrib. They can also be peer scored for the quality of their reviewing contribs, which would add up to their score. One can imagine even more sophisticated credit assignment systems for reviewers and authors that: propagate credit down the citation graph, so that you get credit if your contrib is cited by a highly-rated contrib; gives credit to reviewers whose evaluation was predictive of the ultimate success of the contrib. It all creates a kind of contrib/review market. After assessments have been cast a ranking mechanism aggregates subjective individual assessments and assigns global subjective score/ranks (part of the Global DeCap) to each delegate reflecting one’s input while being:  accurate, such that estimated reputation scores were close enough to the ground truth about delegate’s input ; resistant to manipulations like sybil attacks (creating fake identities to boost one’s own ranking) or misreporting peers as less reputable than they actually are in order to diminish their ranking; computationally efficient.  An example of such algorithm is Personalised Hitting Time (PHT). A community is represented as a weighted digraph, where members are vertices and a score given by a member i to a member j as a reflection of i-th belief of j-th merit is a weighted directed edge h_{ij}. Then hitting time between nodes i and j is the expected number of steps that a standard \u0007lpha-terminating random walk starting at node i will take to hit node j for the ﬁrst time. PHT is provably an optimal trade-off between accuracy, robustness to manipulation and computational efficiency as compared to alternatives like PageRank and PathRank. However, there is a caveat: personalized reputation mechanisms are resistant to sybil attacks (global mechanisms are not), but to adopt a PHT for our global ranking we need to select a pretrusted set of nodes. Alternatively/complimentarily by modeling the community as a graph, Graph Neural Networks can be utilised here to learn user and input embeddings, something akin to GraphRec, but that’s a long topic — we can dive deeper in future discussions. The exact DeCap formula TBD.  So drawing from all the above here’s a tentative proposed scheme. Global Allocated Budget is designated for a period X (e.g. three months). Within a designated period (say, the first 2 weeks of the month preceding the start of the designated period) anyone can nominate a funds recipient with all reasoning possible. All pre-voting discussions are held in public on Discord/Discourse. Decision about funds allocation is made with the quadratic voting mechanism. All delegates are given an individual amount of credits in proportion to their DeCap at the start of the voting period (could be an average over a month preceding that date to combat possible manipulation). Each delegate can allocate their credits reflecting their respective individual assessment of nominated projects’ value and strength of these opinions (that is for a given voter marginal cost of the next vote given for the same nominee is bigger, reflecting the strength of subjective value preference: 1st vote costs 1 credit, 2nd vote for the same nominee = 2 credits (total 1+2=3), 3rd vote for the same nominee = 3 credits (total 1+2+3=6) etc. If the number n of votes goes to the infinity, then the sum limit is \frac{n^2}{2}, hence the term “quadratic”. The proportion of the budget received by each nominee is calculated as follows: =(\\Sigma_i\\sqrt{x_i})^2 The share of the budget received by each nominee is proportional to the square of the sum of the square roots of votes received. The result reflects the distribution not only of perceived value, but value weighed by the strength of respective supporting delegates’ preferences. The beauty of this mechanism is that almost everything here is a variable, hence it can be gradually adapted to fit MakerDAO evolution. For example, the delegate body composition is up to further change, in particular distribution of people with certain expertise: technical, marketing, risk etc., can be fine-tuned. This will obviously impact the eventual funds distribution priorities. Voting credits distribution could also be a variable; delegates could receive credits in linear proportion to their DeCap or according to some formula. Another class of variables could deal with the funding structure. For a certain class of funding recipients an n-component funding structure could be introduced as mandatory: x\\% retroactive + y\\% future-looking, or x\\% liquid + y\\%  vested + z\\%  locked. Or some floor/ceiling/portion of the budget level of funding. These caveats could all be integrated into the delegate mandate by the DAO decision. Even the key reward formula can be tweaked, as was done by Optimism — they didn’t raise the sum to the power of 2, although this led to smaller variance in funding distribution as compared to Gitcoin. Also certain anti-spam firewalls could be introduced for nominees, like pre-approval of at least one delegate, some (not big) deposit or proof of humanity. Obviously, both individuals and groups like CUs and MetaDAOs could be among funding seeking nominees. Multiple variants of vanilla QV and QF aimed at mitigating certain shortcomings (particularly inefficiencies and collusion vulnerabilities) have been suggested and are being actively explored, which should become the subject of further discussions here as well. Still in case of badge holder governance collusion considerations are slightly mitigated by reputation factors. An example of badge holder code was introduced by Optimism in the course of their experiment. In the future this mechanism will help mitigate the discrepancy in perceived subjective value of respective contributions, approaches to measuring it and hence mapping this value to resource allocation. This clash is already emerging within evolving DeFi communities and one can foresee that without a systematic approach this problem will only exacerbate with the protocols and respective range of contributing efforts growing more complex.  Part of this scheme is already working as delegate compensation logic     MIP61: Recognized Delegate Compensation Archive   MIP61: Recognized Delegate Compensation  Preamble MIP#: 61 Title: Recognized Delegate Compensation Author(s): Joshua Pritikin (@jpritikin) Contributors: @g_dip, @LongForWisdom, @Patrick_J Tags:  Type: process Status: Accepted Date Proposed: 2021-10-01 Date Ratified: 2022-03-28 Dependencies: Replaces: <List of MIP it is replacing> Ratification Poll URL: https://vote.makerdao.com/polling/QmTvzCjL?network=mainnet Forum URL: https://forum.makerdao.com/t/mip61-recognized-delegate-compensation/10640  …     ",
                    "links": [
                        "https://arxiv.org/abs/1809.06421v2",
                        "https://vitalik.ca/general/2019/12/07/quadratic.html",
                        "https://arxiv.org/abs/1409.0264v6",
                        "https://gitcoin.co/",
                        "https://clr.fund/",
                        "https://medium.com/ethereum-optimism/retroactive-public-goods-funding-33c9b7d00f0c",
                        "https://www.ifi.uzh.ch/en/ce/news/aamaspaperfeb2016.html",
                        "https://dash.harvard.edu/bitstream/handle/1/12705170/Brandon%20Liu%20-%20Senior%20Honors%20Thesis.pdf",
                        "https://optimismpbc.notion.site/Public-Badge-Holder-Manual-d05c3695ef684d1fb62ef38690fb3ff7",
                        "https://forum.makerdao.com/t/mip61-recognized-delegate-compensation/10640",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-16-22-2022/15999",
                        "https://forum.makerdao.com/t/the-endgame-party-delegate-signup/15852/47",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-16-22-de-junio-del-2022/16204"
                    ],
                    "GPT-summary": "The post proposes a mechanism for optimal allocation of limited resources towards public goods in MakerDAO. The author explains the problem of optimal allocation of resources towards public goods and suggests a Capital-constrained Liberal Radicalism (CLR) mechanism, aka quadratic funding, which offers a nearly optimal distribution of limited resources against a given list of proposed public goods. The post also introduces a notion of Global DeCap (Decentralised/Delegate/Degen Capital) and proposes a tentative scheme for the allocation of funds. The post also discusses the caveats and variables that could be integrated into the delegate mandate by the DAO decision.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.280090106217926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "4",
                    "time": "19/06/2022-22:24:17",
                    "content": "  Any sort of peer assessment is prone to toxicity. It will make people less willing to speak their mind and more focused on backroom dealmaking. Especially if you tie it to a fixed budget system, where voting down your political opponents gives you more money and influence.   Budgets need to be predictable year to year and are very complex. This voting scheme makes it very difficult to get consistency and gives less informed delegates stronger influence over them. What we should have is a highly knowledgeable group that sits down, puts together a range of global budget  with justifications for each, then presents them to delegates to vote up/down.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8751851851851855
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#3",
                    "likes": "1",
                    "time": "19/06/2022-22:40:04",
                    "content": "    CodeKnight:  Any sort of peer assessment is prone to toxicity. It will make people less willing to speak their mind and more focused on backroom dealmaking. Especially if you tie it to a fixed budget system, where voting down your political opponents gives you more money and influence.   Personalised Hitting Time mechanism for aggregating personal reputation score is provably resistant to such strategic manipulations.     CodeKnight:  Budgets need to be predictable year to year and are very complex. This voting scheme makes it very difficult to get consistency   A budget period can also be a variable, different projects have different horizons.     CodeKnight:  and gives less informed delegates stronger influence over them.   Better informed, knowledgeable delegates can express the strength of their preference by buying influence with their DeCap at increasing marginal cost. Then a broader community can account for interests marginal on grand scale, but important in view of part of the community. That’s a feature of quadratic funding.     CodeKnight:  What we should have is a highly knowledgeable group that sits down, puts together a range of global budget with justifications for each, then presents them to delegates to vote up/down.   These debates can and should happen before votes are cast. But then delegates vote not only up/down, but express the strength of their preference. Mind you that a simple yes/no vote is a special case of the mechanism, if all delegates cast just one vote for a nominee without buying influence. It’s a mechanism for provably optimal allocation of limited resources towards public goods within a community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.242827748383304
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "2",
                    "time": "20/06/2022-00:55:45",
                    "content": "What are the standard set of assumptions needed for this result to hold? Unless we think these assumptions are reasonable, there isnt much point in considering the results… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#5",
                    "likes": "0",
                    "time": "20/06/2022-19:12:37",
                    "content": "    Eumenes:  What are the standard set of assumptions needed for this result to hold?   QF mechanism: we take as an assumption that we can verifiably distinguish among and identify citizens of a society choosing which public goods to fund. There is a set of potential public goods P. We do not make any assumption about the nature of this set. In particular, there is no sense in which the set of public goods needs be specified externally or in advance; any citizen may at any time propose a new public good; all public goods generate independent value to citizens; citizens have quasi-linear utility denominated in units of currency; we also abstract away from issues about observability and timing of contributions. I refer you to the original paper for details Liberal Radicalism: A Flexible Design For Philanthropic Matching Funds by Vitalik Buterin, Zoë Hitzig, E. Glen Weyl :: SSRN as well as Gitcoin protocol experience with Ethereum infrastructure funding, clr.fund with purposes similar to that of Gitcoin, but implementing anti-collusion infrastructure and Optimism, which augmented CLR with badge holder governance (very similar to recognised delegates). PHT mechanism. When analysing the robustness of PHT to manipulation and comparing this with the other mechanisms we assume that a strategic agent is interested in increasing its own score and decreasing the scores of others. One strategy is to misreport other agents as untrustworthy, which in the random-walk family of mechanisms is equivalent to dropping reports (and hence also known as cutting outlinks). A strategic agent v_j can also execute a sybil attack by creating one or more sybils and arbitrary trust reports among itself and its sybils. I refer you to the original papers for details https://dash.harvard.edu/handle/1/33009675 https://dash.harvard.edu/handle/1/12705170 ",
                    "links": [
                        "https://gitcoin.co/",
                        "https://clr.fund/",
                        "https://medium.com/ethereum-optimism/retroactive-public-goods-funding-33c9b7d00f0c",
                        "https://dash.harvard.edu/handle/1/33009675",
                        "https://dash.harvard.edu/handle/1/12705170"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.468050065876153
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "20/09/2022-01:13:05",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}