{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/us-treasury-secretary-yellen-ust-collapse-could-have-been-avoided-with-rules-for-stablecoin-issuers/15158",
            "title": "US Treasury Secretary Yellen: UST Collapse Could Have Been Avoided With Rules for Stablecoin Issuers ",
            "index": 15158,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "regulation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "3",
                    "time": "13/05/2022-00:12:56",
                    "content": "Of course, the UST fiasco has given regulators an opportunity to discuss what regulation might be needed as to stablecoins. “We’ve just had over this last week with Terra and with Tether an illustration of the risks associated with stablecoins…there can be runs,” Yellen said Thursday during testimony before the House of Representatives Financial Services Committee. “We invented a good regulatory framework for dealing with this, and that is a federally insured depository institution.” We will see how this impacts things going forward.  The article is below:    Blockworks – 12 May 22    Yellen: UST Collapse Could Have Been Avoided With Rules for Stablecoin Issuers... The framework legislators should use for stablecoins has already been introduced, Treasury Secretary Janet Yellen said.  Est. reading time: 2 minutes       ",
                    "links": [
                        "https://blockworks.co/yellen-ust-collapse-could-have-been-avoided-with-rules-for-stablecoin-issuers/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "2",
                    "time": "13/05/2022-00:51:29",
                    "content": "I get why regulators are opportunistic here, but it is notable that the Terra community doesn’t seem to be clamoring for regulation. The people who actually lost money holding UST mostly accept that they just made a bad bet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "2",
                    "time": "13/05/2022-10:36:22",
                    "content": "I think that many people that took a hard hit aren’t even aware of the regulators claiming that regulations could have saved them. I think most people are skeptical and get scared away when they hear regulators might be coming. But as this continues to unfold and as people analyze what has happened to their investment, I suspect more people will be pro-regulation. Not over regulation but the bare minimum necessary to protect the public. And this actually speaks to a bigger issue. Whether we like it or not, in the US, regulations are coming and there is really nothing that can stop that. And this recent bloodbath has given regulators and lawmakers more incentive to get something on the books.  Crypto in general will need to adapt. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.58611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/05/2022-15:14:12",
                    "content": "This is a problem, they are like a stone in the shoe, the only thing they do is to annoy from my point of view. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}