{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-weekly-updates-march-25-and-an-intro-to-makerbrand/14233",
            "title": "Growth CU weekly updates: March 25, and an intro to MakerBrand ;) ",
            "index": 14233,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "11",
                    "time": "26/03/2022-14:19:48",
                    "content": " General Updates  MakerBrand Since GrowthCU’s inception, we identified the need to create campaigns with our partners to announce and create use cases around their integrations with the Maker Protocol. This has given us a tool to communicate with their audience to show them Maker’s power, and all these actions are under what we call “B2B Activations”. After months without the commonly called Marketing CU, we have seen new people/institutions interested in crypto and DeFi, and because it’s their first time in the space, they don’t know about Maker: for some of them, Maker is about stablecoins but is not a lending protocol, or worse, they don’t link Maker with Dai. This challenge made us realize we have to do something, and as we have been doing the B2B Activations, it’s more than natural for us to scale towards creating a “MarketingCU”. But, with the mindset of maintaining the DAO ethos, we decided to help evolve our internal B2B Activations team to convert it into MakerBrand, first as a team inside GrowthCU but with the vision of being an independent CU. MakerBrand will work on Maker’s brand through initiatives to create ideas around what people think, feel, and say about Maker. We will post more details in the following weeks.   WhatsApp Image 2022-03-26 at 3.24.15 PM960×960 47.2 KB    Dai Liquidity. After several internal conversations with @pyramidmaker and PECU and talking with various of the most relevant MM in the ecosystem, we have identified the following solutions to increase Dai Liquidity in specific domains: Before the launch of Maker Vaults on L2  We have to integrate with intermediary protocols to give loans to MM by creating a D3M DAI pool within these protocols. These protocols will help us structure these loans without lending the DAI from the surplus buffer.  After the launch  We will onboard the GUNI token to increase liquidity through it.   EthRio. @Lozadaluis12 and @Corina talked about Maker:  Luis participated in the panel: Stablecoins and settlement, talking about the real uses cases for stablecoins in LATAM, mostly in Argentina and Vzla. Cori gave a presentation: Growing as a DAO - MakerDAO Lessons Learned. With the full house Cori explained the dissolution of the Foundation and how is the DAO being self-sustainable since past year. Few minutes later Cori participated in the panel: **DAOs & Governance experiences**.  Luis gave an interview to Beincrypto brazil, where he explained the situation in Vzla and how stablecoins like DAI helps the people to fight against inflation.  And we organized a side-Event with Lemon, one of the top crypto companies in Argentina, expanding to all Latam.  image1920×1440 260 KB    Star of the week.   Pokket: Crypto savings account integrated DAI (BEP20 and ERC20). On both Avalanche and Fantom. TVL: 167mill.  MakerDAO twitter Account. Twitter followers (MakerDAO account): 203.9k (+0.74% WoW) Number of tweets: 26 (+36.8% WoW) Twitter engagement rate: 0.89% (-11.88% WoW)   We posted the coordination framework to include announcements from any CU in the Maker Twitter Account, TLDR: choose your representative and if they are not in our internal twitter channel on discord, send a DM to Tobal More tweets than previous week due to a rise in the demand for communications: - DeFi Saver stETH LP launch - Oasis stETH LP launch - TUSD-A Offboarding    MakerGrowth Tweet of the week   twitter.com    MakerDAO Growth @MakerGrowth  💥@CurveFinance's stETH-ETH LP was just onboarded as collateral in@MakerDAO.  🤑 You can create a super leveraged and super secure strategy using@MakerDAO,@LidoFinance, and@CurveFinance together, the real OG top 3 of all DeFi protocols.  How does it work? 👇🧵  1/14 https://t.co/PXSwqxnUKY   3:59 PM - 17 Mar 2022           410                85            ",
                    "links": [
                        "https://www.youtube.com/watch?v=RCLUbdiEz3w",
                        "https://youtu.be/3dHNUPteia0",
                        "https://br.beincrypto.com/eth-rio-brasil-esta-preparado-para-negociar-stablecoin-com-cbdc-diz-ceo-da-transfero/",
                        "https://twitter.com/EthereumRio/status/1504261716640681984",
                        "https://twitter.com/POKKETOfficial/status/1505799374739484674",
                        "https://forum.makerdao.com/t/content-for-the-makerdao-twitter-account/13819",
                        "https://twitter.com/MakerDAO/status/1503733795161350149?s=20&t=AT7UeB34P9K4ZGFGnyzzfA",
                        "https://twitter.com/MakerDAO/status/1504102461853863939?s=20&t=AT7UeB34P9K4ZGFGnyzzfA",
                        "https://twitter.com/MakerDAO/status/1504085571848884225?s=20&t=AT7UeB34P9K4ZGFGnyzzfA",
                        "https://twitter.com/MakerGrowth/status/1504487609480798208",
                        "https://twitter.com/MakerGrowth/status/1504487609480798208",
                        "https://twitter.com/MakerGrowth/status/1504487609480798208",
                        "https://twitter.com/CurveFinance",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/LidoFinance",
                        "https://twitter.com/CurveFinance",
                        "https://t.co/PXSwqxnUKY",
                        "https://twitter.com/MakerGrowth/status/1504487609480798208",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.744916267942584
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/06/2022-14:19:53",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}