{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-reduce-pressure-on-usdc-psm-through-a-mkr-psm/8430",
            "title": "[Informal Poll] Reduce Pressure On USDC-PSM Through A MKR-PSM ",
            "index": 8430,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion",
                "informal-poll",
                "monetary-policy",
                "psm"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "0",
                    "time": "29/05/2021-20:44:14",
                    "content": "If you are uncomfortable with a large PSM, this is a possible way to limit that. If you are comfortable with a large PSM, this is probably unnecessary We’ve all noticed how the PSM is filling up, and today is now the single largest vault class in the Maker Protocol. The PSM’s main function at the moment is to inflate DAI supply by the process of arbitrage with USDC. I propose we need to think about new ways to purposefully debase DAI so that price stability in terms of $1 = 1 DAI is maintained. DAI are, ultimately, debt that is either issued by Maker (via RWA or PSM) or guaranteed by Maker on behalf of private individuals (who use the standard vault classes). This debt (DAI) is consistently trading above face value in the markets. Thus far, the rather simple and elegant answer to this was the USDC PSM. I do not find a large PSM troubling, but many do. I propose that we consider when USDC is above a certain threshold – perhaps 3 billion or even higher – we have a new ilk for MKR that is authorized to flap. Instead of burning this MKR, it will be held in the vault. From an accounting standpoint, this is just changing our capital structure by retiring equity through the issuance of debt. It also leaves something that the DAI is minted against. This does come with some uncomfortable optics, namely that the (probably not correctly named) SB could be negative if done in extremely large amounts. That is as designed. It does not mean Maker is bankrupt or cannot cover its expenses. It means that we hold more debt than cash reserves, which is not unusual. Note that this is not primarily to finance expenditures or even buying back MKR. It is only done to maintain the peg, and in this case reduce exposure to a single counterparty (Circle). The reason this would be done with MKR is to limit the distortions to prices of other assets that are not themselves expressly pegged to the dollar, or may be improperly propped up themselves by another PSM. Also, by doing it with MKR, and with what is effectively zero-coupon debt (DAI), we are mostly just moving things around internally, without in real time altering the value of Maker Protocol in aggregate. This is because the E in the core accounting equation is simply being reduced buy the exact same amount as L is growing: Assets = Liabilities + Equity If L grows by 1 DAI, but E shrinks by 1 DAI, then the net value of Maker Protocol’s assets has not changed. Do note that regardless of how you feel about this particular proposal, debasing DAI is what is necessary to keep the peg maintained. We already do this every day through the PSM’s operation. This is merely a different way to do that so there is another tool in the box besides the PSM. It makes a lot of financial sense in general, and also reduces (or slows down growth of) exposure to USDC. There is more thought that would need to go into the technical execution – perhaps a new ilk isn’t the best choice – and there are several aspects that may be uncomfortable to on a philosophical level (negative SB possibility without minting, accepting MKR as a kind of “collateral”). But we need to think about the most harmless ways to diminish the deflationary pressures on DAI.    Should We Introduce A “MKR-PSM” As A Way To Ease Pressure On The Peg?  Yes. We need more than one way to increase inflation to maintain the peg No. USDC-PSM and any future stablecoin PSMs will provide enough inflation to maintain the peg Abstain     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-47/8491"
                    ],
                    "GPT-summary": "The author proposes a new way to purposefully debase DAI to maintain price stability in terms of $1 = 1 DAI. The proposal suggests introducing a new ilk for MKR that is authorized to flap when USDC is above a certain threshold. The proposal aims to reduce exposure to a single counterparty and limit distortions to prices of other assets. The post also acknowledges that there are several aspects that may be uncomfortable on a philosophical level and that more thought would need to go into the technical execution. The post ends with a poll asking whether a \"MKR-PSM\" should be introduced to ease pressure on the peg.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.419087912535493
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/05/2021-21:05:19",
                    "content": "You probably have a start here : MIP33: Maker Stability Price Module Need to plug it to a private vault. Main problem is that the MKR price can go down, how do you account it? are we liquidating the MKR? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.018518518518519
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/05/2021-21:10:20",
                    "content": "I had not seen that. But this is to stabilize DAI, not MKR ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/05/2021-21:17:36",
                    "content": "It is fondamentally the same, both are buying MKR with dai using fix price order ( PSM ), or I misunderstood. The rest is sementical. The MIP buy with the surplus where you want to buy from a vault debt, which is fine with me but political. Edit : ok sorry I misunderstood. It is basically negative SB you are proposing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.097222222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/05/2021-22:04:04",
                    "content": "You can reduce par to maintain a positive surplus buffer while increasing the supply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.136363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#6",
                    "likes": "2",
                    "time": "29/05/2021-22:38:34",
                    "content": "@PaperImperium what happens if Emergency Shutdown is triggered? Not sure if I understand you 100% about the details here, but to me this has similar implications as negative rate or par manipulation @zenithlight mentioned. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "0",
                    "time": "29/05/2021-22:54:20",
                    "content": "    Primoz:  @PaperImperium what happens if Emergency Shutdown is triggered?   I’m not familiar enough with ESM to comment, probably. Also, there may be different technical approaches that approximate the same function. But that’s a good question. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.080357142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#8",
                    "likes": "3",
                    "time": "30/05/2021-03:42:35",
                    "content": "I just wanted to say that the wording of the poll could be slightly improved. If this becomes a signal request, please consider editing it. The poll’s header question is fine but then options should be just yes, no and abstain. Or if you’re asking a more general question about whether we need ways to achieve Dai inflation apart from stablecoin PSMs, that’s a related but different question. I think it’s clear enough here that you’re polling about the “MKR PSM” so I have treated the poll options as just yes or no to that question. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#9",
                    "likes": "0",
                    "time": "30/05/2021-05:32:49",
                    "content": "    PaperImperium:  I propose that we consider when USDC is above a certain threshold – perhaps 3 billion or even higher – we have a new ilk for MKR that is authorized to flap. Instead of burning this MKR, it will be held in the vault.   Flapping means selling off surplus Dai for MKR (and burning the MKR). Authorizing something to flap won’t have any effect unless it has Dai to auction off. Why would a “new ilk” which can hold MKR have Dai to auction off? Or do you propose that existing flaps that happen anyway have their MKR not burned, but put in this “new ilk” as collateral? If so, who exactly would mint Dai from a MKR vault… owned by MakerDAO? Only MakerDAO can, I suppose… but how would it? If MakerDAO has this new mechanism to mint Dai, it has no effect unless used. What would MakerDAO do if it could mint Dai like this…? When a vault or PSM user mints Dai, it is theirs, permissionless, they can do anything with it. Dai gets in the hands of someone who probably has an intended use for it. It is useful Dai. But MakerDAO… would would the DAO do with this Dai? Just give it to… someone? Who? The only sensible thing to do with it is just keep it… add to the system surplus. So MakerDAO sold off DAI from the surplus buffer for MKR, put that MKR in a vault, borrowed Dai against it, and paid back the surplus buffer. I don’t see how that is useful. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7213695395513575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#10",
                    "likes": "1",
                    "time": "30/05/2021-08:31:10",
                    "content": "I think from both logistics and technical perspective, might be easier to source good collateral to increase Dai supply to reduce USDC % ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "1",
                    "time": "30/05/2021-09:47:33",
                    "content": "After further helpful input from folks here in the comments, I’m going to go ahead and close this. Thanks for sharing your thoughts, everyone! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#12",
                    "likes": "6",
                    "time": "30/05/2021-13:22:47",
                    "content": "So I have been thinking about this today a bit more and the general idea is interesting to me at least from accounting or capital allocation perspective. I imagine there are many technical constraints, specifically those related to ES. I also think PSM wording might be incorrect here. But in general flapping newly minted DAI and buying MKR on the open market means that part of DAI gets backed by future Maker net cashflows. So capital structure changes for existing MKR holders: circulating MKR supply becomes deflationary when flapping and back inflationary at ES or when potentially flopping. Which means existing MKR holders would somehow risk diluting themselves in return for managing the DAI supply this way. The price of MKR at flaps versus price at flops would play the crucial role to assess potential dilution or surplus effect. This is also where the problem lies because you could be buying MKR high and selling low. And in a ES scenario, this is net negative for existing MKR holders, unless they sell at higher prices in between because of MKR demand pressure from flaps. I may be completely wrong here but it got me thinking. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.237809917355372
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#13",
                    "likes": "2",
                    "time": "30/05/2021-15:17:19",
                    "content": "so this is pretty similar to an idea that i had a while back.     Pre-MIP discussion: PSM flapper Proposal Ideas       There is currently a discussion going on in MIP35 that would see maker lend assets purchased via the PSM to compound in order to gain some interest.  I would posit that a better decision for maker to would be to try and get the USDC off of its books outright.  so the TLDR of everything below is: auction off USDC to buyback MKR instead  There are basically 3 motivations behind this in my mind:   In order for the PSM to do its job there needs to be sufficient room between the current liabilities a…     i will say that one thing that is interesting about this idea vs mine is that through holding the MKR in a vault here you may be able to avoid the “balance sheet reduction” issue in that thread. i will say though, the thing that makes me a bit uneasy about this implementation is that it seems the protocol will more or less just be providing itself with 0 interest debt to buy maker and inflate the supply. It’s hard to even wrap my head around what that means really. FWIW I’m glad to see people are starting to think about what to do about the growing amount of usdc that maker is collecting. However given the current climate im not sure if there is anything that can be done outside of adding new PSM ilks ",
                    "links": [
                        "https://forum.makerdao.com/t/mip35-peg-stability-module-compound-mixed-exposure-with-farming/6024"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.520534290271133
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#14",
                    "likes": "0",
                    "time": "30/05/2021-15:43:41",
                    "content": "    Andy_McCall:  inflate the supply   The whole point of doing this would be to inflate the supply. Currently, the only way to do that is via the PSM or through a net leveraging by users of the regular ilks. Thanks for the link and extra thoughts! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#15",
                    "likes": "2",
                    "time": "01/06/2021-20:31:52",
                    "content": "    Discussion: inclusion of MKR in the collateral list? Collateral Onboarding       I don’t have time for a lengthy comment, but here is an outline.   If MKR were collateral, and MKR underwent a pullback that caused liquidations, then we could see a few undesirable consequences.  The liquidations could cause further MKR price drops and a downward spiral of yet more liquidations.  This means the system accrues bad debt.  That bad debt is handled by first the surplus buffer, and second with flop() debt auctions that will further dilute MKR’s price to attempt to recapitalize the s…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "01/09/2021-02:32:18",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}