{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/consolfreight-taps-into-makers-vault/12968",
            "title": "ConsolFreight taps into Maker's Vault ",
            "index": 12968,
            "category": [
                "Updates",
                "Integrations"
            ],
            "tags": [
                "consolfreight"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/AleG",
                    "index": "#1",
                    "likes": "11",
                    "time": "01/02/2022-16:19:54",
                    "content": "Consolfreight is tapping into Maker’s Vault We are extremely happy to update the Maker community that after a few months of hard work, Consolfreight is finally tapping into Maker’s vault. We have been working sustainably to bring RWA transactions that are safe and can scale and grow the size of our pool. In this particular case, we are providing trade finance solutions for a transaction involving the Canadian governments and its efforts to fight Covid-19. Here is a quick overview of the transaction. The Government of Ontario placed an order for 3,500 units of air purifying machines to be installed through the school system in the state worth CAD 4,339,895. The bid was granted to a local SME, eSupply, who was able to find the liquidity needed to procure and deliver the units in DeFi. We have provided 280K Dai towards the total amount of the purchase order and we are handling the logistics in order to provide certainty across the supply chain and minimise any potential risk with the transaction. It will be good to mention that Consolfreight complied with the soft covenants for the vault. An example of the soft covenants is - single loaned asset (either cargo or factoring) must not exceed 15% of the maximum Vault DC i.e. 300K This transaction also allows us to test our integration to Centrifuge via Defactor (a protocol that optimises access to liquidity for Asset Originators in the defi space), helping us expedite and simplify the operational process. We are looking forward to adding RWA use cases, especially during this pandemic, and supporting our community to grow their potential. @EAV @AleG on behalf of all being involved ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-jan-27-feb-3-2022/13019"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.838659147869674
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/03/2022-02:20:14",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}