{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/rwa001-a-custody-agreement/7724",
            "title": "RWA001-A Custody Agreement ",
            "index": 7724,
            "category": [
                "Governance"
            ],
            "tags": [
                "sixs",
                "rwa-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "0",
                    "time": "29/04/2021-11:12:18",
                    "content": " 001-WSFS Form Escrow Agreement 2020 4.26.21 - post2550×3300 830 KB   002-WSFS Form Escrow Agreement 2020 4.26.21 - post 22550×3300 944 KB   003-WSFS Form Escrow Agreement 2020 4.26.21 - post 32550×3300 958 KB   004-WSFS Form Escrow Agreement 2020 4.26.21 - post 42550×3300 905 KB   005-WSFS Form Escrow Agreement 2020 4.26.21 - post 52550×3300 817 KB   006-WSFS Form Escrow Agreement 2020 4.26.21 - post 62550×3300 518 KB   007-WSFS Form Escrow Agreement 2020 4.26.21 - post 72550×3300 818 KB   008-WSFS Form Escrow Agreement 2020 4.26.21 - post 82550×3300 907 KB   009-WSFS Form Escrow Agreement 2020 4.26.21 - post 92550×3300 717 KB   010-WSFS Form Escrow Agreement 2020 4.26.21 - post 102550×3300 317 KB   011-WSFS Form Escrow Agreement 2020 4.26.21 - post 112550×3300 592 KB   012-WSFS Form Escrow Agreement 2020 4.26.21 - post 122550×3300 397 KB   013-WSFS Form Escrow Agreement 2020 4.26.21 - post 132550×3300 428 KB   014-WSFS Form Escrow Agreement 2020 4.26.21 - post 142550×3300 403 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/rwa-senior-lending-trust-trust-agreement/7721",
                        "https://forum.makerdao.com/t/6s-rwa001-a-document-roadmap/7413",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-139-thursday-april-29-17-00-utc/7618/2"
                    ],
                    "GPT-summary": "The post contains a series of images of a WSFS Form Escrow Agreement for the year 2020. There is no text accompanying the images, and no information is given about the purpose or context of the agreement.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#2",
                    "likes": "3",
                    "time": "29/04/2021-11:12:43",
                    "content": "ESCROW AGREEMENT This Escrow Agreement (this “Escrow Agreement”) is dated as of this __ day of _____, 2021 (the “Effective Date”), by and among RWA International Ltd., (“Depositor”), RWA Senior Lending Trust “Trust”; Trust and Depositor are referred to herein collectively as the “Other Parties”), and Wilmington Savings Fund Society, FSB, a federal savings bank (the “Escrow Agent,” which term shall also include any successor escrow agent appointed in accordance with Section 4(h) hereof). WHEREAS, pursuant to that certain Trust Agreement, dated as of [________], 2021 (the “Trust Agreement”) the Depositor is contributing monies to the Trust from time to time as more particularly described therein; and WHEREAS, the Depositor wishes to deposit with the Escrow Agent the Escrow Amount (defined below) from time to time which amount is to be held in an escrow account and distributed in accordance with the terms of this Escrow Agreement. NOW, THEREFORE, the parties hereto, in consideration of the mutual covenants contained herein, and intending to be legally bound, hereby agree as follows:  Escrow.  a. Appointment of the Escrow Agent. The Other Parties hereby appoint the Escrow Agent to serve as, and the Escrow Agent hereby agrees to act as, escrow agent for the benefit of the Other Parties in accordance with the terms and conditions of this Escrow Agreement, to receive, hold and disburse the Escrow Amount (as defined below) in accordance with the terms hereof and to perform the other duties expressly set forth herein. Escrow Agent shall account for the Escrow Amount separately from its funds and the funds of other customers. Escrow Agent shall have the sole power of withdrawal from the Escrow Account (as defined below) on the terms and conditions set forth with more particularity herein. b. Escrow Account. The “Escrow Account” means a segregated account established on the books of the Escrow Agent entitled “RWA International Ltd. Escrow,” in which the Escrow Agent shall hold the Escrow Amount pursuant to this Agreement. The Escrow Account number is [_______________]. All transfers in and distributions from the Escrow Account shall be in United States dollars. Notwithstanding anything herein or elsewhere, it is expressly understood and agreed that the Escrow Agent shall have no duty, liability or obligation whatsoever in connection with Depositor’s delivery of the Escrow Amount, including, without limitation, any duty or obligation to ensure delivery of the Escrow Amount to the Escrow Agent in a timely manner, or to monitor, oversee or confirm that the Escrow Amount delivered to the Escrow Account conforms to or is in accordance with the terms of the Trust Agreement or any agreement to which the Trust is a party. c. Escrow Amount. The “Escrow Amount” means the initial amount of $15,000,000 delivered in one or more increments, together with all other subsequent funds, if any, on deposit in the Escrow Account. The Escrow Amount may be held uninvested. d. Tax reporting. Notwithstanding anything to the contrary contained herein, the parties hereto acknowledge and agree that, for federal, state, and local income tax purposes, Depositor shall be treated as owning the assets that comprise the Escrow Amount. e. Termination. This Escrow Agreement shall terminate upon the joint written instructions (upon which the Escrow Agent shall be entitled to conclusively and exclusively rely) of Depositor and Trust and instructions in the form as set forth on Exhibit A to release the Escrow Amount in accordance with Section 3 hereof (the “Instructions”) and terminate the Escrow Agreement. Upon termination of this Escrow Agreement in accordance with the foregoing, the Escrow Agent shall be relieved of all liability, responsibility, or obligation with respect to or arising out of this Escrow Agreement, provided, however, that the Escrow Agent’s rights, privileges and protections, including without limitation its right to indemnification, shall survive such termination.   Escrow Procedure. The Escrow Amount, shall be held and disbursed in accordance with the terms of this Escrow Agreement or as provided in a final decision of a court or arbitrator (a “Final Award”) ordering the disbursement of all or a portion of the Escrow Amount, in which case Escrow Agent shall disburse the Escrow Amount or such portion thereof specified in the Final Award (to the extent of available funds in the Indemnity Escrow Account) in accordance with such Final Award within two (2) Business Days after Escrow Agent’s receipt of such Final Award (it being expressly understood that the Escrow Agent shall be entitled to conclusively and exclusively rely on the Final Award and shall have no right, duty or obligation to verify the same).   Release of Escrow Amount.   a. On the date hereof, Depositor shall (and from time to time thereafter Depositor may) deliver Instructions to the Escrow Agent instructing the Escrow Agent to release funds in the Escrow Account, if any, or such portion thereof specified in such Instructions. Such Instructions may be standing Instructions; provided, however, (i) any amendments to or replacement Instructions regarding outgoing wires (as described in Exhibit A hereto) shall require signature by the Verification Agent confirming its verification of the existence of an affirmative vote of MakerDAO and (ii) Depositor shall give written notice to the Escrow Agent of funds being deposited to the Escrow Account (a “Transfer Notice”). Each Transfer Notice shall notify the Escrow Agent of the amount to be received in the Escrow Account and the identity of the account from which such amounts will be transferred into the Escrow Account. Escrow Agent shall disburse such amounts in accordance with such Instructions within two (2) Business Days after Escrow Agent’s receipt of such funds, the Transfer Notice and Instructions; provided, however, (i) the Escrow Agent may refrain from disbursing such amounts if the Escrow Agent needs further information requested from the Depositor and (ii) that if any Claims are pending on the Distribution Date, the estimated amount of such pending Claim(s), as determined in good faith by Depositor, shall be set forth in such Instructions and deducted from any amount to be released to Trust on the Distribution Date. If a Claim is pending on the Distribution Date and the amount of damages in such Claim cannot be estimated in good faith, Depositor and Trust shall work in good faith to agree to an amount that will remain in the Escrow Account to cover such Claim and deliver Instructions to the Escrow Agent setting forth such agreed upon amount and until such Instructions are delivered by the Depositor to the Escrow Agent, the Escrow Agent shall retain in the Escrow Account the entirety of the then-remaining funds in the Escrow Account. b. From and after the Distribution Date, as each Claim that was pending as of the Distribution Date is resolved and upon the earlier of receipt by the Escrow Agent of either (i) Instructions or (ii) a Final Award, the Escrow Agent shall distribute to the applicable Other Party, by wire transfer of immediately available funds, such amounts and to such parties specified in such Instructions or Final Award, as applicable, within two (2) Business Days after Escrow Agent’s receipt of such Instructions or Final Award, as applicable.  Duties of the Escrow Agent.  a. The Escrow Agent shall not be liable to the Other Parties or any other person under any circumstances in connection with any of the transactions contemplated by this Escrow Agreement, except that such limitation shall not relieve the Escrow Agent of any liability it may have for the Escrow Agent’s own willful misconduct or gross negligence in the performance of its express duties under this Agreement. The Escrow Agent’s sole responsibility shall be for the safekeeping and disbursement of the funds in the Escrow Account in accordance with the terms of this Escrow Agreement. The Escrow Agent shall have no implied duties or obligations and shall not be charged with knowledge or notice of any fact or circumstance not specifically set forth herein. The Escrow Agent may rely upon any instrument, not only as to its due execution, validity and effectiveness, but also as to the truth and accuracy of any information contained therein, which the Escrow Agent in good faith believes to be genuine, to have been signed or presented by the person or parties purporting to sign the same and to conform to the provisions of this Escrow Agreement, without further inquiry and without requiring substantial evidence of any kind. In no event shall the Escrow Agent be liable for incidental, indirect, special, consequential or punitive damages. The Escrow Agent shall not be obligated to take any legal action or commence any proceeding in connection with the Escrow Account, any account in which the Escrow Amount is deposited, or this Escrow Agreement, or to appear in, prosecute or defend any such legal action or proceedings. The Escrow Agent may, at the expense of the Other Parties, jointly and severally, consult legal counsel selected by it in the event of any dispute or question as to: (i) issues that may arise between the parties with respect to the disposition or disbursement of any of the assets held hereunder, (ii) the application of any federal or state law or regulation; (iii) the construction of any of the provisions hereof or of any other agreement; or (iv) the performance of any of the Escrow Agent’s responsibilities and duties hereunder, and shall incur no liability and shall be fully protected from any liability whatsoever in acting in accordance with the opinion or instruction of such counsel. b. The Escrow Agent shall have only those duties as are specifically provided herein, which shall be deemed purely ministerial in nature, and shall under no circumstance be deemed a fiduciary of any of the Other Parties. The Escrow Agent shall neither be responsible for, nor chargeable with, knowledge of the terms and conditions of any agreement, instrument or document between the Other Parties other than this Escrow Agreement. This Escrow Agreement sets forth all matters pertinent to the escrow contemplated hereunder, and no additional obligations of the Escrow Agent shall be inferred from the terms of any other agreement, instrument or document. In no event shall the Escrow Agent be liable, directly or indirectly, for any (i) damages or expenses arising out of the services provided hereunder, other than damages which result from the Escrow Agent’s failure to act in accordance with the standards set forth in this Escrow Agreement, or (ii) special or consequential damages, even if the Escrow Agent has been advised of the possibility of such damages. Without limiting the effect of any other provision of this Agreement, the Escrow Agent shall have no obligation or liability: (1) to review, examine, enforce, administer or take notice of any agreement, instrument or document other than this Escrow Agreement; (ii) to determine whether any conditions precedent to a disbursement of Escrow Amounts, other than as set forth in Section 2, have been or will be satisfied or otherwise to investigate any claim, notice, objection or Instructions received by Escrow Agent hereunder; (iii) to evaluate or determine the validity or legality of any action or omission by any other person; (iv) to make any payment to either Depositor or Trust from any source other than the Escrow Account; (v) to communicate with any person other than as expressly provided for in this Agreement; (vi) for any action or omission of Escrow Agent taken or made upon the oral or written instructions of either Depositor or Trust; (vii) for any action or omission of any third party or any federal or state bank regulator; (viii) for any other action or omission of, or for errors in judgment by, Escrow Agent under or in connection with this Agreement taken or made in good faith. c. The Escrow Agent shall have the right to perform any of its duties hereunder through agents, attorneys, custodians or nominees all of which shall be indemnified to the full extent of the indemnity provided in Section 7(l)herein. d. Any banking association or corporation into which the Escrow Agent may be merged, converted or with which the Escrow Agent may be consolidated, or any banking association or corporation resulting from any merger, conversion or consolidation to which the Escrow Agent shall be a party, or any banking association or corporation to which substantially all of the corporate trust business of the Escrow Agent shall be transferred, shall succeed to all of the Escrow Agent’s rights, obligations and immunities hereunder. e. The Escrow Agent shall have the right, without the need for further action on the part of any person. to liquidate any investments of the Escrow Account held by the Escrow Agent hereunder in order to provide funds necessary to make required payments hereunder. f. No provision of this Escrow Agreement shall require the Escrow Agent to pay or be liable for an amount in excess of the then-current balance of the Escrow Account. g. In the event the Escrow Agent is required to disburse any amounts hereunder on a day that is not a Business Day, such amounts shall be disbursed by the Escrow Agent on the next succeeding Business Day. h. Resignation and Removal of the Escrow Agent. The Escrow Agent may resign as escrow agent at any time, with or without cause, by giving prior written notice to the Other Parties, such resignation to be effective at the time specified in the notice, which may not be sooner than thirty (30) days following the date such notice is delivered (the “Notice Period”). In addition, the Other Parties may jointly remove the Escrow Agent as escrow agent at any time, with or without cause, by an instrument (which may be executed in counterparts) delivered to the Escrow Agent, which instrument shall designate the effective date of such removal. In the event of any such resignation or removal, a successor escrow agent shall be appointed by the Other Parties within the Notice Period. Any successor escrow agent shall be a U.S. bank or trust company in good standing with its regulatory authority. If the Other Parties do not appoint a successor escrow agent, the Escrow Agent may, at the expense of the Other Parties, jointly and severally, apply to a court of competent jurisdiction to do so. Any such successor escrow agent shall deliver to the Other Parties a written instrument accepting such appointment and the terms and conditions of the Escrow Agreement, and thereupon it shall succeed to all the rights and duties of the Escrow Agent hereunder and shall be entitled to receive the Escrow Amount pursuant to the terms hereof. i. Upon receipt of written notice from the Other Parties, informing it of the appointment of the successor escrow agent, the Escrow Agent shall deliver the balance of the Escrow Account then held hereunder to the successor escrow agent. Upon such delivery and the confirmation thereof by the successor escrow agent, the Escrow Agent shall have no further duties, responsibilities or obligations hereunder and all such duties, responsibilities and obligations shall be binding upon the successor escrow agent. j. In the event the Escrow Agent is removed, the Escrow Agent shall be paid a pro rata portion of all fees earned hereunder but not paid through the date of such removal, and the Escrow Agent shall have no obligation to refund or remit any portion of such fees received by the Escrow Agent prior to the date of such removal.   Fees. The Escrow Agent shall be compensated for its services hereunder in accordance with a separate fee agreement as between the Escrow Agent and the Trust. To the extent the Other Parties shall fail to pay any cost, fee or expense payable to the Escrow Agent hereunder when due, the Other Parties hereby authorize the Escrow Agent to debit such amount from the Escrow Account without notice to the Other Parties. Without limiting the generality of the foregoing, any fees owed to the Escrow Agent as of the date hereof that are not paid to the Escrow Agent concurrently with the execution of this Escrow Agreement shall be debited directly from the Escrow Account.   Actions by the Escrow Agent.   a. In the event conflicting demands are made upon, or conflicting notices delivered to, the Escrow Agent with respect to the Escrow Amount or any portion thereof, the Escrow Agent shall be entitled, in its sole discretion, to refuse to comply with all demands or instructions with respect to such assets so long as such conflict shall continue, and the Escrow Agent shall not be or become liable in any way to the Other Parties for failure or refusal to comply with such conflicting claims, demands or instructions. The Escrow Agent shall be entitled to refuse to act until such conflicting claims or demands shall have been resolved by a final non-appealable judgment of a court of competent jurisdiction. The Escrow Agent may, in addition, elect, in its sole discretion, to commence in a court of competent jurisdiction an interpleader action or seek other judicial relief or orders as it may deem, in its sole discretion, necessary. The costs and expenses (including reasonable attorney’s fees and expenses) incurred in connection with such proceeding shall be paid by and shall be deemed a joint and several obligation of, the Other Parties. b. Notwithstanding anything to the contrary contained herein, this Escrow Agreement shall not be construed to require the Escrow Agent to refer to, or interpret, any provisions of any other document in connection with carrying out the Escrow Agent’s duties under this Escrow Agreement.  General.  a. Notices. Any notice given hereunder shall be in writing and shall be deemed received upon the earlier of: (i) as of the date delivered if delivered personally or by a nationally recognized overnight courier service or the U.S. Mail if sent certified mail; or (ii) on the date of confirmation of receipt (or, the first Business Day (as hereinafter defined) following such receipt if the date is not a Business Day) of transmission by facsimile; or (iii) solely with respect to delivery of Transfer Notices, on the date of receipt if delivered to the Escrow Agent by email, and, in each case to the parties at the following addresses or facsimile numbers (or at such other address or facsimile number for a party as shall be specified by like notice, except that notices of changes of address shall be effective upon receipt): If to Depositor or the Trust: RWA International, Ltd. c/o Crestbridge Cayman Limited 9 Forum Lane Camana Bay PO Box 31243 Grand Cayman, KY1-1205, Cayman Islands Attention: Director with a copy (which shall not constitute notice) to: For Depositor or the Trust, copy: Walkers 190 Elgin Avenue George Town, Grand Cayman KY1-9001 Cayman Islands Attention: Melissa Lim 6S Capital Partners, LLC 427 N Tatnall Street Ste. 47933 Wilmington, DE 19801 Attention: Manager If to the Escrow Agent: Wilmington Savings Fund Society, FSB 500 Delaware Avenue, 11th Floor Wilmington, DE 19801 Attention: S. Amanda Wilson Phone: 302-571-6817 For purposes of Transfer Notices by email: [email protected] Amanda Wilson [email protected] Ashley Smith [email protected] Jim Casterioto [email protected] Cedric Strother or to such other address as the applicable Other Party may have furnished in writing to the Escrow Agent in the manner provided above. Notwithstanding the foregoing, notices addressed to the Escrow Agent shall be effective only upon receipt. When any notice, claim, objection to a claim or document of any kind is required to be delivered to the Escrow Agent and any other person or entity, the Escrow Agent shall forward such notice, claim or other document within two (2) Business Days after the date on which it was received by the Escrow Agent to the parties hereto, and such notice shall be subject to the provisions of this Section 7(a). The Escrow Agent shall send statements to each of the Other Parties on a monthly basis reflecting activity in the Escrow Account for the preceding month. For purposes of this Escrow Agreement, a “Business Day” shall be deemed a day that the Escrow Agent is open for business. b. Captions. The captions in this Escrow Agreement are for convenience only and shall not be considered a part of, or affect, the construction or interpretation of any provision of this Escrow Agreement. c. Counterparts. This Escrow Agreement may be executed in counterparts, each of which shall be deemed an original and all of which, when taken together, shall be deemed to be one Agreement. This Escrow Agreement, to the extent signed and delivered by means of a facsimile machine or via electronic mail of a .pdf or .tif or similar file format, shall be treated in all manner and respects as an original agreement or instrument and shall be considered to have the same binding legal effect as if it were the original signed version thereof delivered in person. d. Amendments. The provisions of this Escrow Agreement may be waived, altered, amended or supplemented, in whole or in part, only by a writing signed by the Escrow Agent and each of the Other Parties. e. Assignability. No party may, without the prior written consent of each other party, assign this Escrow Agreement in whole or in part. Subject to the foregoing, this Escrow Agreement shall be binding upon, and inure to the benefit of, the respective successors and assigns of the parties hereto. f. Governing Law. This Escrow Agreement shall be construed in accordance with, and governed in all respects by, the laws of the State of Delaware, without regard to conflicts of law principles. Process and pleadings mailed to a party at the address provided in Section 7(a) above shall be deemed properly served and accepted for all purposes. g. Warranty. Each party hereby represents and warrants that (i) this Escrow Agreement has been duly authorized, executed and delivered on its behalf and constitutes its legal, valid and binding obligation, and (ii) the execution, delivery and performance of this Escrow Agreement by such party do not, and will not, violate applicable law or regulation. h. Severability. The parties agree that: (i) the provisions of this Escrow Agreement shall be severable in the event that for any reason whatsoever any of the provisions hereof are invalid, void or otherwise unenforceable; (ii) such invalid, void or otherwise unenforceable provisions shall be automatically replaced by other provisions which are as similar as possible in terms to such invalid, void or otherwise unenforceable provisions but are valid and enforceable; and (iii) the remaining provisions shall remain enforceable to the fullest extent permitted by law. i. Force Majeure. Notwithstanding any other provision of this Escrow Agreement, the Escrow Agent shall not be obligated to perform hereunder and shall not incur any liability for the nonperformance or breach of any obligation hereunder to the extent that the Escrow Agent is delayed in performing, unable to perform or breaches such obligation because of acts of God, war, terrorism, fire, floods, strikes, epidemics, pandemics, electrical outages, equipment or transmission failures, or other causes reasonably beyond its control. j. WAIVER OF JURY TRIAL . EACH PARTY ACKNOWLEDGES AND AGREES THAT ANY CONTROVERSY WHICH MAY ARISE UNDER THIS ESCROW AGREEMENT IS LIKELY TO INVOLVE COMPLICATED AND DIFFICULT ISSUES, AND THEREFORE EACH SUCH PARTY HEREBY IRREVOCABLY AND UNCONDITIONALLY WAIVES ANY RIGHT SUCH PARTY MAY HAVE TO A TRIAL BY JURY IN RESPECT OF ANY LITIGATION DIRECTLY OR INDIRECTLY ARISING OUT OF OR RELATING TO THIS ESCROW AGREEMENT, OR THE TRANSACTIONS CONTEMPLATED BY THIS ESCROW AGREEMENT. EACH PARTY CERTIFIES AND ACKNOWLEDGES THAT (I) NO REPRESENTATIVE, AGENT OR ATTORNEY OF ANY OTHER PARTY HAS REPRESENTED, EXPRESSLY OR OTHERWISE, THAT SUCH OTHER PARTY WOULD NOT, IN THE EVENT OF LITIGATION, SEEK TO ENFORCE THE FOREGOING WAIVER, (II) EACH SUCH PARTY UNDERSTANDS AND HAS CONSIDERED THE IMPLICATIONS OF THIS WAIVER, (III) EACH SUCH PARTY MAKES THIS WAIVER VOLUNTARILY AND (IV) EACH SUCH PARTY HAS BEEN INDUCED TO ENTER INTO THIS ESCROW AGREEMENT BY, AMONG OTHER THINGS, THE MUTUAL WAIVERS AND CERTIFICATIONS IN THIS SECTION. k. Compliance with Court Orders. In the event that any property deposited under this Escrow Agreement shall be attached, garnished or levied upon by any court order, or the delivery thereof shall be stayed or enjoined by an order of a court, or any order, judgment or decree shall be made or entered by any court order affecting the property deposited under this Escrow Agreement, the Escrow Agent is hereby expressly authorized, in its sole discretion, to obey and comply with all writs, orders or decrees so entered or issued, which it is advised by legal counsel of its own choosing is binding upon it, whether with or without jurisdiction, and in the event that the Escrow Agent obeys or complies with any such writ, order or decree it shall not be liable to any of the parties hereto or to any other person, entity, firm or corporation, by reason of such compliance notwithstanding such writ, order or decree be subsequently reversed, modified, annulled, set aside or vacated. l. Indemnity. The Other Parties shall, jointly and severally, indemnify, defend and save harmless the Escrow Agent and its affiliates and their respective successors, assigns, directors, officers, managers, attorneys, accountants, experts, agents and employees (the “Escrow Agent Indemnitees”) from and against any and all losses, damages, claims, liabilities, penalties, judgments, settlements, actions, suits, proceedings, litigation, investigations, costs or expenses (including, without limitation, the reasonable fees and expenses of either in-house or outside counsel, and experts and their staffs and all expense of document location, duplication and shipment and including any costs of enforcement of Other Parties indemnity obligations hereunder) (collectively “Escrow Agent Losses” or “Claims”) arising out of or in connection with (a) the Escrow Agent’s execution and performance of this Escrow Agreement, tax reporting or withholding, the enforcement of any rights or remedies under or in connection with this Escrow Agreement, or as may arise by reason of any act, omission or error of the Indemnitee, except in the case of any Escrow Agent Indemnitee to the extent that such Escrow Agent Losses are finally adjudicated by a court of competent jurisdiction to have been primarily caused by the gross negligence or willful misconduct of such Escrow Agent Indemnitee, or (b) its following any instructions or other directions, whether joint or singular, from the Other Parties in accordance with the terms herein. The Other Parties acknowledge that the foregoing indemnities shall survive the resignation, replacement or removal of the Escrow Agent or the termination of this Escrow Agreement. The Other Parties hereby grant the Escrow Agent a lien on, right of set-off against and security interest in, the Escrow Amount for the payment of any claim for indemnification, expenses and amounts due hereunder. In furtherance of the foregoing, the Escrow Agent is expressly authorized and directed, but shall not be obligated, to charge against and withdraw from the Escrow Amount for its own account or for the account of an Escrow Agent Indemnitee any amounts due to the Escrow Agent or to an Escrow Agent Indemnitee under this Section 7(l). The obligations contained in this Section 7(l)shall survive the termination of this Escrow Agreement and the resignation, replacement or removal of the Escrow Agent. [Signature Page Follows.] IN WITNESS WHEREOF, each of the parties has executed this Escrow Agreement as of the date first above written. ESCROW AGENT: WILMINGTON SAVINGS FUND SOCIETY, FSB By: Name: Its: DEPOSITOR: RWA INTERNATIONAL LTD. By: Name: Its: TRUST: RWA SENIOR LENDING TRUST By: RWA INTERNATIONAL LTD., as Trust Sponsor and authorized signatory By: Name: Its: EXHIBIT A WRITTEN INSTRUCTIONS TO ESCROW AGREEMENT Wilmington Savings Fund Society, FSB 500 Delaware Avenue, 11th Floor Wilmington, DE 19801 Attention: S. Amanda Wilson Phone: 302-571-6817 Email: [email protected] _________, 20 Written Instructions Ladies and Gentlemen: Reference is made to the Escrow Agreement dated as of _____________, 2021 (the “Escrow Agreement”), among RWA International Ltd, RWA Senior Lending Trust and you. Incoming From time to time, amounts will be deposited into the Escrow Account (as defined in the Escrow Agreement), from a brokerage account of the Depositor held by [INSERT BROKER NAME], a broker-dealer registered with the U.S. Securities and Exchange Commission (the “SEC”) or a similar securities regulatory or governing body or agency in Canada or Western Europe, [INSERT DETAILS AND ACCOUNT NUMBER] (the “Brokerage Account”). Pursuant to the Escrow Agreement, the undersigned hereby instructs you to disburse from the Escrow Account (as defined in the Escrow Agreement) by wire transfer or internal transfer to the account identified below any amounts received from the Brokerage Account:     Bank Wilmington Savings Fund Society, FSB     Address 500 Delaware Avenue, 11th Floor    Wilmington, DE 19801| |ABA No.|| |Account Name|| |Account No.|| ||| |Further Credit to:|| |Account Name|RWA Senior Lending Trust| |Account No.|| Outgoing Further, from time to time, amounts will be deposited into the Escrow Account (as defined in the Escrow Agreement), from a Trust Account [INSERT DETAILS AND ACCOUNT NUMBER] (the “Trust Account”). Pursuant to the Escrow Agreement, the undersigned hereby instructs you to disburse from the Escrow Account (as defined in the Escrow Agreement) by wire transfer to the Brokerage Account identified below any amounts received from the Trust Account:     Bank      Address    ABA No.    Account Name    Account No.        Further Credit to:    Account Name    Account No.     We confirm that these instructions are merely to facilitate our own internal requirements and that we remain fully liable to you under the terms and conditions of the Escrow Agreement between us. You have no liability for losses resulting from errors in these instructions. RWA INTERNATIONAL LTD. By: Its: [RWA Senior Lending Trust By: RWA INTERNATIONAL LTD., as Trust Sponsor and authorized signatory By: Its: ][1] [Pursuant to (and subject to) the terms of the Trust Agreement, the Verification Agent has confirmed the affirmative vote of MakerDAO to the outgoing Instructions contained herein. Wilmington Savings Fund Society, FSB, not in its individual capacity but solely as Verification Agent By: Name: Title:][2] EXHIBIT B TRANSFER NOTICE TO ESCROW AGENT Wilmington Savings Fund Society, FSB 500 Delaware Avenue, 11th Floor Wilmington, DE 19801 Attention: S. Amanda Wilson Phone: 302-571-6817 Email: [email protected] _________, 20 Transfer Notice Ladies and Gentlemen: Reference is made to Section 3(a) of the Escrow Agreement dated as of _____________, 2021 (the “Escrow Agreement”), among RWA International Ltd, RWA Senior Lending Trust and you. We hereby notify you that funds [will be] [have been] deposited into the Escrow Account. The amount [to be received] [received] is $_______________ The funds [will be] [were] transferred from [Name of Bank] [Account No. _______________] from ____________________________ as payee. RWA INTERNATIONAL LTD. By: Its: [1] If the Instructions are issued pursuant to Section 1(e) of the Escrow Agreement, the Instructions shall include a signature block for the Trust and the following statement shall be contained within the Instructions: “The Trust and Depositor instruct you that the Escrow Agreement is hereby terminated pursuant to, and subject to the rights, privileges and protections of the Escrow Agent in, Section 1(e) of the Escrow Agreement.” [2] If the Instructions are amendments to or replacements of the outgoing Instructions, the Instructions shall include a signature block for the Verification Agent and the related bracketed language. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1387391434561245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "1",
                    "time": "29/04/2021-14:09:42",
                    "content": "woah on the escrow agreement (h in particular).   So because this collateral is in the US basically the escrow agent Wilmington is also in the US?!   So this is the collateral side that basically involves the Cayman part of 6s International in terms of legal entity offering up the US based collateral for escrow into a US based trust. I don’t want to make more work but I think a kind of info-diagram of the parties with their juridictions as well as what they hold/do (i.e. what is transferred via a kind of venn diagram also showing their legal jurisdiction) might be nice here.   The who (a person, company), the what (DAI, USD, collateral or collateral rights), and the where (in terms of jurisdiction) might be really helpful to me/people here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.726851851851851
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/04/2021-14:12:02",
                    "content": "This custody account is for RWA International Ltd. It holds cash to move into the Trust Account… OR in reverse, it sends received funds back to the Broker / Dealer. No other assets are here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/04/2021-14:13:50",
                    "content": "Ah man I completely misread this (easy to do just cursory reading)! So this is the custody of the funding side?!  I think I got it. Yeah definite urge to you/your team to make a kind of who, what, where diagram with maybe numbers to the relevant agreements applicable. The elegant structure constructed not easily to follow via the documents.  I think I have to hunt for your infographic.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.47172619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#6",
                    "likes": "1",
                    "time": "29/04/2021-14:14:55",
                    "content": "yup… go back to    MIP13c3-SP4 Declaration of Intent & Commercial Points - Off-Chain Asset Backed Lender to onboard Real World Assets as Collateral for a DAI loan Archive       MIP13c3-SP4 Declaration of Intent & Commercial Points - Maker Governance Intends to Utilize an Off-Chain Asset Backed Lender to onboard Real World Assets as Collateral for a DAI loan Preamble MIP13c3-SP#: 4 Author(s): Matthew V Rabinowitz (@mrabino1 or [email protected]) Contributors: n/a Status: Accepted Date Proposed: 2020-09-01 Date Ratified: 2020-10-27 --- Declaration Statement: Maker Governance Intends to Utilize an Off-Chain Asset Backed Lender to onboard Real World Assets into the Maker Proto…      and look at the flow of funds… This is for the TFE. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "0",
                    "time": "29/04/2021-14:21:22",
                    "content": "Got it.  Thank you for the pointer. First glance and I think the part I am missing is the whole jurisdictional part in those graphics.    The structure well done (ofc) and the whole who has jurisdiction over Maker is a whole grey area.   I think this is why I wanted to see the jurisdictions applicable in the whole structure.   Not a huge deal because I can just take the intographics you presented above and just print them and then look at the paper work to see who has jurisdiction where. Man - well detailed as usual Matt.    Probably won’t have time to review carefully to see if I spot anything but your lawyers are top-notch.  I don’t expect too many places for wiggle.   My concern is the jurisdictional situation with respect to the Maker Rep(s) so I just wanted to get a handle on where things would be settled if there were any hitches… (i.e. the clauses). Thanks again Matt. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.783333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "1",
                    "time": "29/04/2021-14:28:20",
                    "content": "    MakerMan:  the whole who has jurisdiction over Maker is a whole grey area.   Maker cannot sign as a party to the agreements. All of the legal document LendCo upsteam make reference to the affirmative vote of MakerDAO (or in the case of the Trust an outright verification of the current state of the given vault. See this post. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-139-thursday-april-29-17-00-utc/7618/3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "29/07/2021-20:29:18",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}