{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/wallet-cdp-liquidation-based-predictive-scoring-model/2687",
            "title": "Wallet & CDP Liquidation-based Predictive Scoring Model ",
            "index": 2687,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "idea",
                "risk-model"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ChristG87",
                    "index": "#1",
                    "likes": "0",
                    "time": "31/05/2020-15:36:07",
                    "content": "Hi Maker Community, As someone having perspective in both the traditional financial system and the blockchain/crypto world, the concept of significant over-collateralization (of min. 150%, typically much higher) has always bothered me as prohibitely expensive and basically - the polar opposite of enabling financial inclusion (say we leave flash loans out of the picture for the time being, as they are exclusive in a whole different purely technical fashion). Having read up a bit more about the MakerDAO mechanics over the last couple of days, I notice that the average collateral locked up is actually even higher, currently at around ~400% (likely due to the forced liquidations during the mid-March flash crash, where my own CDP also got bitten) - basically, a 4x overcollateralization of the borrowed amount. I understand that the current protocol risk framework focuses mainly on risk management at collateral asset, liquidity and price level. However, IMO it makes sense to further fine-tune risk at individual CDP-level, by combining historic parameters  about CDP-liquidations with information about the ETH wallet behind the CDP and any further voluntarily provided information as an option (i.e. identity-verifications). In real-world credit risk modelling, verified proof about the owner’s:  their historical loan performance (number of loans, credit cards taken/repayed/defaulted, number/frequency of late payments, number of concurrent loans - essentially, parameters that in the blockchain world are availble through various MakerDAO liquidations explorers) total available assets, their activity within a network, time of first transaction, nr of transaction, balances etc (in the blockchain equivalent, all that info is publicly available on the ETH blockchain) their digital presence, identity parameters and other variables voluntarily provided (i.e. phone numbers, e-mails, IP etc) all feed into a model that can add a risk-modelling dimension on individual level.  Applying that model to every new open CDP, it could allow for an additional dynamic setting of parameters such as:  lower / higher liquidation threshold/ratio; lower / higher liquidation penalty size; lower / higher stability fee; and many other potential use cases that apportion risk based on further information, obtained at borrower level;  Of course, it’s a given that in the crypto/blockchain world many of these aspects can be obfuscated by opening a CDP with a fresh ETH address each time, but that on its own should already be factored in (i.e. - the absence of information is information in itself). I’ve see one or two white papers focusing on such models so far, but haven’t seen an actual application / analysis of the portfolio in any of the DeFi Lending protocols that I looked at, so it would really help to get some inputs on:  What is the easiest way to obtain all the necessary info from the blockchain and convert it into a CSV file?  Perhaps similar to the one in WhiteRabbit’s post here (https://medium.com/@whiterabbit_hq/black-thursday-for-makerdao-8-32-million-was-liquidated-for-0-dai-36b83cac56b6), but looking at ALL CDPs ever opened and all state changes, instead of only a zoom-in on Black Thursday liquidation events;   I realize there would/could be many objections at taking this approach, especially prior to actually having done any analysis on the information, but I would appreciate thoughts or comments on what would be the biggest barrier for adoption of such “product” by DeFi Lending Protocols, such as MakerDAO   Any ideas on predicting the target outcomes or other collaboration on the matter would be greatly appreciated - please feel free to DM;   My intention would be to provide the above to a team of data scientists / analysts, proficient in credit risk modelling, with several possible targets outcomes to predict; It is fairly possible that the exercise may prove that the available information is not sufficient to build a predictive / discriminating model & distribution, but if it is, it may help to bring a very early version of the “credit scoring” concept on-chain. Thanks in advance. Best, Chris ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-1/2970",
                        "https://forum.makerdao.com/t/discussion-liquidity-mining-impacts/2898/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.436425968546221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#2",
                    "likes": "1",
                    "time": "31/05/2020-15:47:20",
                    "content": "I made a program a while back that will query the debt and collateral values for every eth and bat CDP and outputs those to a csv file.   github.com   tamccall/dai-vaults/blob/master/out.csv id,proxy_address,ilk,collateral_amount,collateral_value_usd,debt_value 1,0xa40F68003B69dAE2a3feb0271008EE1ec37afEe6,ETH-A,0,0,0 2,0x50C04ECf34c71c6e5478D040E177628b7c511960,ETH-A,0,0,0 3,0xD38B4471B09bCAE999e9C8677C8E72E8F9a531Cb,ETH-A,0,0,0 4,0x2fBF4299A04c2Bee60270cF638572eC29CFF69aa,ETH-A,0,0,0 5,0x005014dF5f837a0c761E2E06F4Ff4b0134d7807b,ETH-A,0,0,0 6,0xdA4Fabe68542c8C4A32e798c4578A13Ae70cBe28,ETH-A,0,0,0 7,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 8,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 9,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 10,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 11,0xb0430906006065c5DC72808c6F51958960De85d5,ETH-A,0.001,0.262855962366799999999995,0 12,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 13,0xaf9c8610DA451b557048F2833189F8118B42B7DC,ETH-A,0,0,0 14,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 15,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 16,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 17,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 18,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0 19,0xdDb108893104dE4E1C6d0E47c42237dB4E617ACc,ETH-A,0,0,0     This file has been truncated. show original      If you download and run it again you should be able to query a more up to date file, and obviously contributions are welcome if you want it to have more functionality. ",
                    "links": [
                        "https://github.com/tamccall/dai-vaults/blob/master/out.csv",
                        "https://github.com/tamccall/dai-vaults/blob/master/out.csv",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-98-thursday-june-25-9am-pst-4-00-pm-utc/2878/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.910714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/06/2020-19:39:27",
                    "content": "I love what you are going for here, and I would say that it is something that would benefit the system.  How might we implement this in a way that is suitable yet limited in complexity?  I do feel like users who want the true privacy of giving zero information should be given less favorable loan terms than those who provide quality substantiation that they have “good credit”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.551587301587301
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mike.wyre",
                    "index": "#4",
                    "likes": "1",
                    "time": "01/06/2020-21:17:15",
                    "content": "    ChristG87:  In real-world credit risk modelling, verified proof about the owner’s:   Nice! If you need any help or want to bounce ideas around, I’m more than willing to help or provide feedback. Great initiative for awareness. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChristG87",
                    "index": "#5",
                    "likes": "0",
                    "time": "02/06/2020-14:44:50",
                    "content": "Hi Mike, Would be happy to get some additional inputs, ideas and feedback - let me know how I can reach out to you (just spent 10 min searching for a way to DM and didn’t find one here ) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mike.wyre",
                    "index": "#6",
                    "likes": "0",
                    "time": "02/06/2020-20:52:51",
                    "content": "Ping me on the chat! mike.wyre is my name (from memory? ) Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#7",
                    "likes": "2",
                    "time": "22/06/2020-15:29:34",
                    "content": "I like this idea a lot. I think a good method to create such a credit system would be through some sort of non transferable value tokens. It’s unclear how much information we can gather purely from vaults, but I  don’t think we should incentivize removal of personal privacy. Maybe we could increase the vault/wallet’s credit rating by incentivizing behavior that reduces the risk of maker? For example, higher credit for opening vaults with liquidation levels that are significantly offset from other vault holders, so that it is harder to have a mass liquidation event. Or maybe higher credit for having many vault in different assets instead of all in one collateral type (this would have to be at the wallet level rather than the vault level). We gain something for the ecosystem by creating this credit system that isn’t specifically related to loans and defi: a decentralized, pseudonymous form of identity. If it is sufficiently difficult to game the credit system and it takes enough time and resources on the part of the borrower to duplicate it could be used for things like quadratic voting, and other blockchian application that require identity ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.364495798319328
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#8",
                    "likes": "4",
                    "time": "22/06/2020-15:50:34",
                    "content": "IMO, Maker should only consider past credit performance of vaults. Arguably the protocol is no longer permissionless/non-discriminatory if we consider outside identity info, eth address associations, or interactions with other dapps when determining vault specific pricing and access conditions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RepoTactics",
                    "index": "#9",
                    "likes": "3",
                    "time": "22/06/2020-15:59:57",
                    "content": "Instead of this applying to ALL vaults, could it be an opt-in system? If you opt-in, you can take on a higher leverage? That way individuals can still remain anonymous, keep their ETH address associations and their associated dapp interactions private if they choose to do so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#10",
                    "likes": "3",
                    "time": "22/06/2020-18:18:18",
                    "content": "Given that users seem to place low value on privacy, I’d guess over time most users would opt in to the system. The remaining opt-outs would be a mix of privacy focused users and credit-impaired (negative history/high risk) users. There’s potential for a vicious cycle of adverse selection in the opt out group as a greater ratio of credit impairment makes opting out progressively more expensive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#11",
                    "likes": "0",
                    "time": "22/06/2020-20:00:21",
                    "content": "Because of this we should avoid asking for information that compromises privacy in the first place. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kevin_Thomas",
                    "index": "#12",
                    "likes": "0",
                    "time": "28/06/2020-18:03:58",
                    "content": "Perhaps a system based more on the length of time a CDP has been functioning? Overall length of the account being maintained would suggest that in general a fund owner has been more responsible, therefore can be trusted with higher leverage? This could bypass privacy concerns while still incentivising and rewarding funds for keeping collateral locked up for longer periods of time and behaving responsibly. Also could help to create a ‘fairer’ system…If people with less funds play by the rules they gain a potentially small advantage over others with deeper pockets but a higher appetite for risk… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.924242424242424
                }
            ]
        }
    ]
}