{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp10-facilitator-onboarding-sustainable-ecosystem-scaling-core-unit/7370",
            "title": "MIP41c4-SP10: Facilitator Onboarding, Sustainable Ecosystem Scaling Core Unit ",
            "index": 7370,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "core-unit",
                "ses-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#1",
                    "likes": "10",
                    "time": "07/04/2021-22:39:51",
                    "content": " MIP41c4-SP10: Facilitator Onboarding, Sustainable Ecosystem Scaling Core Unit  Preamble MIP41c4-SP#: 10 Author(s): @juanjuan Contributors: Status: Accepted Date Applied: 2021-04-07 Date Ratified: <yyyy-mm-dd>   Sentence Summary MIP41c4-SP10 adds @juanjuan as the Facilitator for Core Unit SES-001: Sustainable Ecosystem Scaling  Specification  Core Unit ID SES-001  Motivation I put myself forward as the candidate facilitator for the Sustainable Ecosystem Scaling Core Unit because I believe that its mission strikes at the heart of what is needed for the continued success of the Maker Protocol. I believe I am a suitable candidate for this role due to my current involvement in MakerDAO, as well as my extensive prior experience in Finance, IT, and Management.  Involvement in MakerDAO  Collateral onboarding  helped put together the Collateral Onboarding Framework Model    Governance Communications & Faciliatation:  Host of Collateral Onboarding Calls, in 2020 and 2021. Host of Know Your MIP Calls  Host of Core Unit Tools Calls    Created coreunit.makerdao.network : a place for resources and tools for Core Units (existing and to be) Created makerdao.network : a place to quickly spin Maker-related things Helping Governance Alpha with the MIPs Portal creation and MIP-related tasks Helping Mandated Actors Participating in Autonomous MakerDAO working group Participated in the CDIP (CommDevs Micro-Grants) Program   Prior Experience  8+ years in Fintech (3+ in FX; 2+ in Assets Management) Studied Finance, IT, and Entrepreneurship. Product + Project Management 5+ years Operations + Financial Transformation Manager   Facilitator Commitment  As a facilitator I’m committing to fulfill the mandate, engage in discussions regarding Governance, and collaborate with other Facilitators and units to contribute to the success of MakerDAO. The team structure is relatively flat. @wouter will act as a Team Lead while the different projects on the roadmap will each have their own lead. Permanent Team members may act as project leads, participate in them and/or work to support the Incubation Program teams. Incubation Team members will operate as much as possible in the same role that they will fullfill in their future Core Unit. Through coaching and guidance, we will work with them to further improve their understanding of each team member’s role and responsibilities. Roles and responsibilities will be documented and shared as part of our Core Unit documentation. Best practices that we identify will be shared within the Core Unit, as well as the wider Community whenever relevant.   Contact Information  Github: https://github.com/juan-fintech  Forum: @juanjuan  Twitter: @0Ju4n  (Outdated) Site: https://DeFiNotes.com    Related Documents Core Unit Mandate MIP Core Unit Budget MIP ",
                    "links": [
                        "https://forum.makerdao.com/t/all-your-collateral-calls-are-belong-to-us-2020-recap-upcoming/5718/",
                        "https://forum.makerdao.com/t/collateral-onboarding-calls-listing-2021-edition/6566/",
                        "https://forum.makerdao.com/t/know-your-mip-index/6768",
                        "https://forum.makerdao.com/c/core-units/core-unit-meetings/32",
                        "https://coreunit.makerdao.network",
                        "https://makerdao.network",
                        "https://mips.makerdao.com/",
                        "https://github.com/juan-fintech",
                        "https://DeFiNotes.com",
                        "https://forum.makerdao.com/t/mip39c2-sp10-adding-sustainable-ecosystem-scaling-core-unit/7368",
                        "https://forum.makerdao.com/t/mip40c2-sp10-modify-core-unit-budget-ses-001/7369",
                        "https://forum.makerdao.com/t/mip39c2-sp10-adding-sustainable-ecosystem-scaling-core-unit/7368",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-136-thursday-april-8-17-00-utc/7279/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-40/7467",
                        "https://forum.makerdao.com/t/weekly-mips-update-32/7464",
                        "https://forum.makerdao.com/t/mip40c3-sp55-modify-core-unit-budget-sustainable-ecosystem-scaling-ses-001/12097",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-8-sustainable-ecosystem-scaling-core-unit-ses-001/7545",
                        "https://forum.makerdao.com/t/maker-relay-ep-46/8312",
                        "https://forum.makerdao.com/t/weekly-mips-update-38/8486",
                        "https://forum.makerdao.com/t/maker-relay-ep-46-en-espanol/8358",
                        "https://forum.makerdao.com/t/weekly-mips-update-37/8309",
                        "https://forum.makerdao.com/t/maker-relay-ep-44/7974",
                        "https://forum.makerdao.com/t/weekly-mips-update-33/7573",
                        "https://forum.makerdao.com/t/mip40c3-sp87-modify-the-sustainable-ecosystem-scaling-core-unit-budget-ses-001/18339"
                    ],
                    "GPT-summary": "The post is an explanation of MIP41c4-SP10, which adds @juanjuan as the Facilitator for Core Unit SES-001: Sustainable Ecosystem Scaling. The author explains their motivation and involvement in MakerDAO, as well as their prior experience. The post also includes the facilitator commitment and contact information. There is entirely positive feedback from a 3rd party, and the post extends an invitation to collaborate.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.697463768115942
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#2",
                    "likes": "7",
                    "time": "16/04/2021-03:17:44",
                    "content": "I am really glad to see this kind of “seed” Core Unit come along. This speaks to one my attempts at contributing to the discussion back at the start of the year. We have an immense need in this space not to lose the vibrant ecosystem the Grants nourished. I think there is lots to learn from other fintech incubators all over the world, but particularly to be open to global initiatives as DAI has no frontiers. It requires a quasi asset management approach with a fully international outlook imho. My two cents recommendation: look at the evolution of the Linux Foundation & Rothschild for tech and financial inspiration respectively. ",
                    "links": [
                        "https://forum.makerdao.com/t/makerdao-people-at-a-glance/7503",
                        "https://forum.makerdao.com/t/mips-update-36/8125",
                        "https://forum.makerdao.com/t/weekly-mips-update-35/7962"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.518939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#3",
                    "likes": "1",
                    "time": "04/05/2021-10:00:36",
                    "content": "The SES team would like to formally submit this subproposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}