{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/meet-your-delegate-17/16932",
            "title": "Meet Your Delegate #17 ",
            "index": 16932,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-meet-your-delegate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "5",
                    "time": "01/08/2022-14:11:30",
                    "content": " Meet Your Delegate #17  Welcome to the (announcement for the) seventeenth episode of Meet Your Delegate, where MKR holders and the broader community get to know their delegates. For this episode, we will have delegate candidate @CodeKnight presenting their platform and holding an AMA session. We will also be finishing up @pvl’s call by hosting his Q&A session. You can read pvl’s platform and check out their slides from last time @prose11  will be hosting.  When 2022-08-03T13:00:00Z Google Calendar link  Where    Zoom Video   Join our Cloud HD Video Meeting Zoom is the leader in modern enterprise video communications, with an easy, reliable cloud platform for video and audio conferencing, chat, and webinars across mobile, desktop, and room systems. Zoom Rooms is the original software-based conference...      Meeting ID: 823 9827 1372 Passcode: MYD17 ",
                    "links": [
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022",
                        "https://readymag.com/u1204790250/3792132/",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=Nmgyc2Y4ZmllN28zcTc3Yzdib2QyNXQ1dGcgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/82398271372?pwd=Z2ZGNjExb0JVcEk3Sk4ybGZJRjR0Zz09",
                        "https://us02web.zoom.us/j/82398271372?pwd=Z2ZGNjExb0JVcEk3Sk4ybGZJRjR0Zz09",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/9",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/9",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-28-de-julio-03-de-agosto-del-2022/17139",
                        "https://forum.makerdao.com/t/relay-semanal-02-08-de-agosto-del-2022/17223"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.808333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#3",
                    "likes": "2",
                    "time": "01/08/2022-14:13:40",
                    "content": "     Here’s part 1 of pvl’s call, featuring his presentation. Unfortunately, we had to abandon the remainder of the call due to technical issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#4",
                    "likes": "0",
                    "time": "02/08/2022-23:30:09",
                    "content": "Good stuff, glad I had some time to check it out! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kunfu-po",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/08/2022-02:11:33",
                    "content": " Meet Your Delegate: Episode #17   Agenda   00:00: Introduction  00:52: CodeKnight Delegate Platform  9:21: QA w/ CodeKnight  26:00: pvl Delegate Platform  34:14: Questions w/ pvl  49:23: Conclusion   Video Link  General Introduction  Payton Rose 00:00  Hello to everyone, and welcome to Meet Your Delegate call #17. Today, we are joined by CodeKnight, who will be presenting his platform, and we will save the questions for the end.   Delegate Introductions  CodeKnight Delegate Platform 00:52  Long Term Vision1920×1105 120 KB   1920×1101 81.7 KB   Core Values1920×1102 90.7 KB   Managing Complexity Budget1920×1097 155 KB   Sustainable Decentralization1920×1107 148 KB   Stakeholder Representation1920×1113 106 KB   Key Info1920×1109 153 KB   Questions 9:35   Frank: Does this consider MakerDAO as a bank?  People are depositing USDC and getting Dai. Then we are using their USDC to earn money. So, at a high level, it is a banking function. At some point, we must share the money we are earning off USDC with the people because that is what our competitors do. If we earn a 5% return on your money, we can share 2% or 1% of that.    10:20   Someone: How do you protect Maker token owners’ best interest when outsourcing centralized decision-making? Could there be any point of failure? Or do you believe automation needs to have a centralized component?  There are two parts to that question: 1.)   Much of this comes with the lining of the decision. Rune is ensuring that the meta-DAO has the same structure as us and that the centralized aspect is fully under our control. 2.)   I would love to have as much automation as possible with real-world assets. Automation needs to be a central component. We can have tokenized on-chain assets that the government say is enforceable in a court of law. We can have a way to liquidate assets on-chain because there will be other people willing to buy them. For now, that is not doable. These are our points of failure that you have to interface with the real world.    12:09 Someone: What low-hanging fruit for automation and immutability do you see?  I see tokenizing real-world assets on-chain and having a liquid marketplace. If we bought treasuries on-chain, we could make that an enforceable thing. I think there would be people who would love to buy and sell them on-chain.  13:26   Patrick: I am pleased to hear the enthusiasm for approval voting because we have been working actively with DUX to get that live on the protocol. I would like to hear more about how you think we could use that best. I imagine that we would use it as a prioritization tool.  We have all these arrangers and portfolios that come to the DAO. They get voted upon, and at some point, they get approved. That is the theory. Instead, when portfolios come to us and get approval voting, the ones with the highest approvals are the ones that are getting the most money. Gives ACD coal plant as an example of avoiding contentious votes.     Patrick: That is a good example that needs to be balanced with governance overhead…  16:46   Patrick: Would you like to make this our number 1 priority?  I am not a big believer in prioritization schedules. I trust the people doing the work. Prioritization is often kind of fake because you have got things in parallel…    18:14   Payton Rose: You mentioned in your platform that you wanted to see Maker become this trillion-dollar company. I am curious how you see Maker scaling to that path, especially real-world assets versus crypto collateral.  Right now, it would have to be real-world assets. The total market cap for all crypto is about a trillion. We can not take on 50% of all crypto or liquidate it at that level. We would have to be looking at treasuries and real-world assets. We have the expertise to do these things. Other DAOs and groups will come to us because we already have these legal structures to tokenize something, and they do not want to redo that legal work. That is one area where we could have many assets under management.    19:26   Frank: I want to go back to the IDai example. Is the idea to create a DSR opportunity? Or is the idea to support ETH-Dai, M0, and the end-game?  I want the proposals to have liquidity, where people can earn yield without locking up all their money. Aave is working on a system where you can lend out your collateral, make the interest of that, and still use your GHO.     737×415 51.1 KB  22:37   Payton Rose: How do you feel about Rune’s proposed changes?  Overall, I would say cautiously optimistic. I like the idea of offboarding that complexity. It will be huge if the meta-DAOs act in our best interest without us having to micromanage them. I will most likely be voting for like the framework and testing it out. The devil gets in the details on how much capital we are deploying to these groups. I am a huge fan of experimentation and trying out these different frameworks. You can consider me an end-game delegate.     pvl Delegate Platform 26:00  739×369 137 KB   743×369 99.6 KB   Questions 34:14   Frank: Are you saying that reputation score should be based on proposals that go to an executive and get voted on to the protocol, or is it just based on participation?  You could develop metrics you could devise. I am saying that we could at least explore metrics, for instance, voting systems that involve MKR delegates and community participation metrics. This considers objective things (number of posts and likes) and subjective metrics (scores you and I assign).    Frank: What was the name of the last platform you showcased? You said it was an IPFS.  Skiff.    36:42   Payton Rose: You mentioned being active in the end game Discord. How do you see the transition occurring between where we are now as a protocol and the end game? What are the necessary steps you seek to happen to what the CUs can do for you as this idea is formulated?  I believe even Rune does not have an exact idea of the eventual blueprint, so I think it is an emergent process. Accesses the rigid structure of meta-DAOs. References MoneyIrish’s points on interface protocols.     39:55   Payton Rose: Do you have any strategies to attract people to delegate to your platform?  I do not necessarily have a strategy, but I plan to say what is on my mind on the forums and Discord.    42:09   Patrick: I remember you favor clean money.  Is that something you think should be your primary focus for the DAO?  In my previous presentation, I said clean money is much more than just clean energy. -Refers to Oxman Documentary: Human and Nature- I favor this prioritization if clean money goes beyond solar panels or other forms of clean energy.    Patrick: Is it fair to say that if RWF applicants came into the picture, your platform would be supportive if it has anything to do with experimenting and processing nature and heat-sensitive materials?  Exactly, I would like to offer new avenues worth exploring.    46:54   Patrick: Any thoughts on how KPIs could be designed in the near future?  Full automation is always a compromise. That is a great opportunity for the communities to rule themselves. KPIs should be worked out with corporations with seals because they know the deep stuff on the protocol. On the other hand, they also need oversight. Some people say that delegates should not be doing this. They should be operating and voting in the interest of Maker. KPIs also need stewardship because, at the moment, it is losing money.     Conclusion  Payton Rose 49:23  That is a good place to wrap up. Thank you, CodeKnight and pvl, for coming on to speak.   Common Abbreviated Terms DAO: Decentralized Autonomous Organization RWA: Real World Asset DeFi: Decentralized Finance  Credits  Kunfu-po produced this summary Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/KZFZ1xQ6ZzU?t=52",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=561",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=1560",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=2054",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=2963",
                        "https://youtu.be/KZFZ1xQ6ZzU",
                        "https://youtu.be/KZFZ1xQ6ZzU",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=52",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=575",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=620",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=729",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=806",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=1006",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=1094",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=1166",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=1357",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=1560",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=2054",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=2201",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=2395",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=2529",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=2814",
                        "https://youtu.be/KZFZ1xQ6ZzU?t=2963",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-august-2022/17882"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.097971408436525
                }
            ]
        }
    ]
}