{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-211-thursday-october-06-at-17-00-utc/18244",
            "title": "Governance and Risk #211 - Thursday, October 06 at 17:00 UTC ",
            "index": 18244,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "1",
                    "time": "05/10/2022-16:04:21",
                    "content": " 211 f1920×442 27.2 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-10-06T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Votes Recap  @MIP-Editors - MIPs Recap  @Artem_Gordon - Pre-recorded Forum Recap    Initiative Updates  Using JokeDAO for soft consensus in governance @twblack88 & @rspa   Selected Discussion   Main Topic MIP81: Coinbase USDC Institutional Rewards Core Unit implications & commentary by select Facilitators Other considerations by Delegates + Q&A Ask us stuff  Anonymous question box   @Recognized-Delegates @Core-Facilitators  Selected Discussion   Main Topic MIP81: Coinbase USDC Institutional Rewards Core Unit implications & commentary by select Facilitators Other considerations by Delegates + Q&A Ask us stuff  Anonymous question box   @Recognized-Delegates @Core-Facilitators ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1InRwOj5yhILasrsi9yZlIralZ4J_goAHqzOuMhW7fXE/edit?usp=sharing",
                        "https://www.loom.com/share/ecac9b3b022e46cabdaab7633df7ae96",
                        "https://forum.makerdao.com/t/using-jokedao-for-soft-consensus-in-governance/17673",
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/mip81-coinbase-institutional-rewards-community-summary/17898",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/20",
                        "https://forum.makerdao.com/t/relay-semanal-7-de-octubre-13-de-octubre-del-2022/18456"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.319444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/10/2022-23:50:02",
                    "content": " Episode #211: October 6th, 2022 | Editorial Summary  Agenda   00:00: Introduction  01:17: Votes and Polls  03:16: MIPs Update  Pre-recorded: Weekly Forum Recap  09:25: Initiatives Update: JokeDAO for Consensus  37:03: Discussion Segment: MIP81: Coinbase USDC Rewards  1:08:05: Conclusion   Video Link  General Updates  Votes  Payton Rose 01:17 Visit: Voting Portal  Votes:   Polls: – 01:55   Executive Proposals: – 02:20     MIPs  Gala 03:16 Visit: Weekly MIPs Update #107 MakerDAO Votes and Polls Public Calendar Important Dates: Ratification Polls for the formally submitted proposals are going up on Monday, October 10. New Proposals must be posted by October 12 to be eligible for the November Governance Cycle.  October Formal Submission:   Endgame MIPs – 3:28   Standalone MIPs and misc. – 4:34   Proposals in RFC:     Standalone MIPs – 5:37   Core Unit Budgets – 6:34   Core Unit Mandates – 7:07   Weekly-cycle Subproposals – 7:20     Weekly Forum Recap  Artem Gordon Pre-Recorded  Visit: Weekly Forum Recap: September 29th - October 6th, 2022  News & Announcements:    ConsenSys Delegate Platform ​[Poll Notice] Signal Support for Ending DAI Funding for Sourcecred GUSD & MakerDAO Partnership Announcement    Signal Requests:    [Signal Request] Modify D3M Guidance for MOMC [Signal Request] Change PSM-GUSD-A parameters    Initiatives Update  JokeDAO  Raphael 09:25 Visit: Using jokedao for soft consensus in governance  Contents:   Agenda – 9:17   Try it! – 9:51   Opportunities – 11:28   Environment – 13:25     Discussion  MIP81: Coinbase USDC Institutional Rewards 16:04  If this MIP passes, what will the Core Units do?1423×798 63.3 KB   GovAlpha(GOV-001):  It is all about coordination! Facilitating the “Strategic Finance Core Unit, CES Core Unit, or Growth Core Unit” in creating a proper entity-onboarding Signal Request. Coordinating with technical teams on producing an expected Executive date once a legal entity has been onboarded(and cleared with Coinbase) Facilitating(drafting copy, getting confirmations from stakeholders, merging PRs to list) an executive bundle with a transfer. Putting people in touch for questions and comments.   Strategic Finance (SF-001)  Seek approval for a specific legal entity, i.e., an arranger. Maker Governance will have control over the funds and access the funds.   Collateral Engineering Service (CES-001)  We want to look at the trustless way of considering and base primarily on the feedback we see in the community and some of the concerns raised. That would be my signal if this MIP were passed I would highly encourage any of these MIPs to look at our past work, how we have answered the questions, the details around the deal, the legal and regulatory structure, and the technical implementation. Before you put up a MIP, talk and gain consensus and agreement of the individual CUs you are requesting work from, and then place the MIP out there. Please reach out. We are here to help.   Growth (GRO-001)  Our main focus is to find the opportunity, the partner. Once approved, it is more in the hands of CES, PE, SF, and other CUs. As we do with everything inside Maker, we will prepare an announcement, talk with a partner and the people at Maker who helped to onboard or make it happen to work on a PR, and have the announcement everywhere. It is important to remind delegates and the Maker community to look at these deals not as unique but as part of a solution. We have all of this idle capital. What can we do with it? Strategic Finance has presented a framework for taking advantage of that idle capital and increasing revenue for Maker.   The Exercise 33:13  The &quot;Yes and...&quot;1417×802 119 KB   Discussion Segment 37:03    Payton Rose: Who would like to start and say something about MIP81?  39:47   PaperImperium: Is there any dark magic we can use to get around the custody downside? Can we get around the risk of giving full custody to Coinbase?   Robert: We can explore the trustless option, which allows Coinbase to have custody of a smart contract. This special function will enable us to claw back if we need to. Before recommending it, we are working with Coinbase to see if this is a real solution. Miguel also made a good point: a trustless solution requires some development, audit, and verification work. A manual solution may be quicker, but we have identified its downsides.  Raphael: The smart contract is amazing. However, considering Coinbase’s perspective, they will have input on the contract’s nature. While a smart contract is ideal, it is for the longer term. They have no reason to rush it and will likely stall it, at least for a couple of months.  Mark: I spoke with Coinbase, and from the beginning, they were interested in an automated and permissionless solution. They want to help us make it a reality. However, the challenges are more on the non-technical side. The DAO needs to decide the liquidity level on-chain. That will determine how much funds are moved back and forth. From this, it makes the most sense to start manually to get cash in the door. Then, we can transition to a new solution.    46:05   Raphael: Have your concerns been addressed from GovAlpha’s perspective?   Patrick: Yes and no. GovAlpha initially had concerns about the incompleteness of the MIP. It did not fit the template. This concern has been addressed. We still do have concerns from the governance perspective. Specifically, we have concerns about the withdrawal of the funds, their time frame, and the governance process around that. However, this is a legitimate MIP and will go on-chain next week.    48:23   Frank: The 3F Delegate Platform supports MIP81 and what Gemini has proposed. We want to greenlight this but are also in favor of automation. We would love a trustless environment because custodial services and risk management is missing. This includes transaction, compliance, and credit risks. What are the parameters Risk CU provides to the community?  51:07   Tim Black: If the MIP fails, will they submit again?   Payton Rose: I do not have a direct answer, but I believe so.    52:19    Justin: I see a situation where the DAO ends the agreement in the future. This MIP asks for a huge portion of the PSM, and the payoff percentage is insignificant. We have several things that could utilize the USDC in the PSM. In the future, we might not have that much USDC in the PSM or even a PSM. It is prudent for us to end this agreement if that comes to fruition. It could be a nice baseline if we can manage that risk—however, there are other opportunities to earn more money on our balance sheet than the one percent.   David Utrobin: Automating the MIP is not all or nothing. Automation could potentially be done in phases. Before we determine that, we need to confirm with Coinbase their criteria for custody of a smart contract. One of our team members, Nikolai, suggested that if Coinbase can custody a smart contract, it could be as much as taking our MIP21 output conduit. The only way the USDC can be taken out of that smart contract is via return to the PSM. Then, further automation could be done later on.    55:58   PaperImperium: Does voting on this lock us into a schedule or implementation? Or is it just conceptual?   Payton Rose: I would say a level above conceptual. The MIP outlines what happens after it passes. It asks a CU to pass a signal to push this forward. Of course, that gives the option for the entity to get rejected.    56:59   Raphael: I want to further Patrick’s point of auto-signaling when the PSM reaches a certain level. We can say in their arranger agreement that one signal will withdraw funds immediately at a certain level with no executive requirement.  58:23   Payton Rose: David said in the chat that the implementation requires sign-up from CUs. That is a potential blocking point. Paper has pointed out some questions about implementation that lie in Robert’s earlier points. It falls on your shoulders if you do not talk to a CU and expect it to happen.  59:09   Frank: I would like to address the community question. I see from the telegram chats that people do not think MakerDAO and Dai are cool anymore. If Aave were doing this, you would not hear this chatter. Regardless, this is a huge opportunity for MakerDAO.  1:01:45   Payton Rose: Considering the Gemini proposal, what other opportunities exist for Maker? Does this open the door to pursuing other partnerships?  Chat: The Coinbase MIP is a big deal. Everyone is starting to realize the opportunities of working with Maker. The positive attention given to Maker through this MIP proposal is huge.     Conclusion  Payton Rose 1:08:05  Big thanks for everyone coming out. Check out forum.makerdao.com, and see you soon.  Suggestion Box  Credits  Kunfu-po produced this summary. Andrea Suarez produced this summary. Larry Wu produced this summary. Everyone who spoke and presented on the call.  ",
                    "links": [
                        "https://youtu.be/0wWfLly2Tzw?t=77",
                        "https://youtu.be/0wWfLly2Tzw?t=196",
                        "https://www.loom.com/share/ecac9b3b022e46cabdaab7633df7ae96",
                        "https://youtu.be/0wWfLly2Tzw?t=565",
                        "https://youtu.be/0wWfLly2Tzw?t=2223",
                        "https://youtu.be/0wWfLly2Tzw?t=4085",
                        "https://youtu.be/0wWfLly2Tzw",
                        "https://youtu.be/0wWfLly2Tzw?t=77",
                        "https://vote.makerdao.com/",
                        "https://youtu.be/0wWfLly2Tzw?t=115",
                        "https://youtu.be/0wWfLly2Tzw?t=140",
                        "https://youtu.be/0wWfLly2Tzw?t=196",
                        "https://forum.makerdao.com/t/weekly-mips-update-107/18199",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://youtu.be/0wWfLly2Tzw?t=208",
                        "https://youtu.be/0wWfLly2Tzw?t=274",
                        "https://youtu.be/0wWfLly2Tzw?t=337",
                        "https://youtu.be/0wWfLly2Tzw?t=394",
                        "https://youtu.be/0wWfLly2Tzw?t=427",
                        "https://youtu.be/0wWfLly2Tzw?t=440",
                        "https://www.loom.com/share/ecac9b3b022e46cabdaab7633df7ae96",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/22",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246",
                        "https://forum.makerdao.com/t/poll-notice-signal-support-for-ending-dai-funding-for-sourcecred/18204",
                        "https://forum.makerdao.com/t/gusd-makerdao-partnership-announcement/18140/1",
                        "https://forum.makerdao.com/t/signal-request-modify-d3m-guidance-for-momc/18069",
                        "https://forum.makerdao.com/t/signal-request-change-psm-gusd-a-parameters/18142",
                        "https://youtu.be/0wWfLly2Tzw?t=565",
                        "https://forum.makerdao.com/t/using-jokedao-for-soft-consensus-in-governance/17673",
                        "https://youtu.be/0wWfLly2Tzw?t=557",
                        "https://youtu.be/0wWfLly2Tzw?t=591",
                        "https://youtu.be/0wWfLly2Tzw?t=688",
                        "https://youtu.be/0wWfLly2Tzw?t=805",
                        "https://youtu.be/0wWfLly2Tzw?t=964",
                        "https://youtu.be/0wWfLly2Tzw?t=1993",
                        "https://youtu.be/0wWfLly2Tzw?t=2223",
                        "https://youtu.be/0wWfLly2Tzw?t=2387",
                        "https://youtu.be/0wWfLly2Tzw?t=2765",
                        "https://youtu.be/0wWfLly2Tzw?t=2903",
                        "https://youtu.be/0wWfLly2Tzw?t=3067",
                        "https://youtu.be/0wWfLly2Tzw?t=3139",
                        "https://youtu.be/0wWfLly2Tzw?t=3358",
                        "https://youtu.be/0wWfLly2Tzw?t=3419",
                        "https://youtu.be/0wWfLly2Tzw?t=3503",
                        "https://youtu.be/0wWfLly2Tzw?t=3549",
                        "https://youtu.be/0wWfLly2Tzw?t=3705",
                        "https://youtu.be/0wWfLly2Tzw?t=4085",
                        "https://forum.makerdao.com/",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-october-2022/18865"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7941673136645955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#3",
                    "likes": "3",
                    "time": "06/10/2022-12:32:04",
                    "content": "I will be unable to attend today’s call but I will record a 2 minute video explaining my point-of-view and post it to the forum within the next few days. I encourage everyone to chime in with thoughtful reasoning on the existential risks surrounding the Coinbase proposal and general direction of this organization - taking into full consideration that this org is supposed to be decentralized and autonomous. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.357142857142857
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-213-thursday-october-27-at-17-00-utc/18494",
            "title": "Governance and Risk #213 - Thursday, October 27 at 17:00 UTC ",
            "index": 18494,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "0",
                    "time": "24/10/2022-23:22:47",
                    "content": " 213 f1920×442 24.2 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-10-27T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides, updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Votes Recap  @MIP-Editors - MIPs Recap  @Artem_Gordon - Forum Recap   Initiative Updates  EndGame Effects CES GOV RISK Others   Selected Discussion   Main Topic MIP88: Monetalis - Redwood Friesian MIP89: Monetalis - Arrow Andalusian Ask us stuff  Anonymous question box   @Recognized-Delegates @Core-Facilitators ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1ENddCumDfNcAz98oDO8JF7Zfd8KPNG0G2Me-XKODFlI/edit?usp=sharing",
                        "https://forum.makerdao.com/t/mip88-monetalis-redwood-friesian/18336",
                        "https://forum.makerdao.com/t/mip89-monetalis-arrow-andalusian/18338",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/22",
                        "https://forum.makerdao.com/t/relay-semanal-20-de-octubre-28-de-octubre-del-2022/18703"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.428030303030304
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "1",
                    "time": "04/11/2022-15:03:07",
                    "content": " Episode #213: October 27th, 2022 | Editorial Summary  Agenda   00:00: Introduction  1:34: Votes and Polls  3:13: MIPs Update  12:17: Weekly Forum Recap  8:10: Initiatives Update: Endgame Effects w/ Core Units  33:32: Discussion: MIP88: Monetalis - Redwood Friesian  47:57: Discussion: MIP89: Monetalis - Arrow Andalusian   Video Link  General Updates  Votes  Patrick_J 1:34 Visit: Voting Portal  Votes:   Polls: – 1:35   Executive Proposals: – 2:06     MIPs  Pablo 3:13 Visit: Weekly MIPs Update #110 MakerDAO Votes and Polls Public Calendar Important Dates: November 2nd is the last day to introduce modifications in eligible proposals aiming to enter that Governance Cycle. The formal submission window opens November 7th.  October Ratification Polls Outcomes:   The Endgame Prelaunch MIP Set – 3:19     Proposals in RFC:   Core Unit Budgets – 4:33   Top Level MIPs – 4:50   Other Subproposals – 5:28     Weekly Forum Recap  Artem Gordon Video Recording  Visit: Weekly Forum Recap: October 20th - October 26th, 2022  News & Announcements:  LBS Blockchain - Envoy Proposal Alerter    Proposal Ideas:  Utilizing Hats Protocol ERC-1155s Fixed rates strategies and mechanisms in the Decentralized Collateral Scope    Signal Requests:  A Note on Signal Request Clear Vaults’ Bad Debt in the MakerDAO protocol The SHCU Requests a One-Month Budget Extension    Initiatives Update  Endgame Effects w/ Core Units 8:10 Visit: Endgame Plan v3 complete overview  Contents:   CES – 08:43   GovAlpha – 13:45   Strategic Finance – 23:42   Risk – 31:57     Discussion  MIP88: Monetalis - Redwood Friesian  David Utrobin 33:32  726×411 114 KB   726×354 91.2 KB   726×403 219 KB   731×413 77 KB  35:27   Redwood: Both parties (Arrow and Redwood) are talking about moving to private structure credit in the United States and Europe. Monetalis is trying to set up the metaDAO situation with MIP 65 as the pyramid foundation. MIP 65, 88, 89, and 82 are trying to get us to a place with a sufficient amount of approved counterparties for the metaDAO to develop an appropriate asset allocation strategy that would work for a stablecoin…  38:46   Jeremy: Redwood Trust is a publically traded company; our ticket is RWT. Our business involves residential housing. We aggregate loans to create assets for our investor base. Redwood has been doing this since 1996.   Alan: That was a wonderful introduction.     Discussion  Discussion: MIP89: Monetalis - Arrow Andalusian 47:57   John: I am the head of group I.T. with a second function as the principal of distribution and securitization for blockchain tokenization. Arrow is a vertically integrated asset manager and servicer in Europe. We service loans and assets on behalf of 200 banks across five countries. We own 17 servicing platforms and have 70 billion Euros under management. We own about two billion.  56:48   Jeremy: Paper asked about the discount for Maker. Any costs associated with that are on the Redwood side.  1:00:26   Jeremy: There is another question about commercial-backed securities and the inclusion of this collateral. We would not cross-collateralize residential and commercial levels.  1:03:33   Allan Pederson: Someone asked why there are so many MIPs when MIP 65 is just starting. This is because I need to ensure that the metaDAO has a sufficient range of options to invest from.  1:04:43   Allan Pederson: Someone asked why I think cash from the issuances should be reinvested. In both cases, there is monthly interest coming in from the principal. The cash flow will go back to Maker for its operating costs. This maintains the exposure.  1:06:04   Allan Pederson: Now that signal requests are no longer valid, how do you engage the community’s appetite to keep investing versus taking back the proceeds to SB?  I need to work on solving that.    1:08:09   Allan Pederson: Will the Sequoia Platform also incur allocations to the CMBS market?  No, not in this particular case.    1:08:53   Allan Pederson: Who bares the Balloon Risks in the RMBS?   Jeremy: The investor.  Person 3: Is there an RMBS tranche in the portfolio?  Jeremy: Not in the current structure, but we could.    1:13:27   ElPro: How will MIP 89 structure itself to the appetite of the Maker community?   Alan: Arrow will define a credit box that specifics the portfolios going into this MIP.    1:16:13   ElPro: Can you walk us through non-performance loans (NPLs)?  We will not be doing NPLs. The future relates more to ESG and green lending.    1:19:33   Alan: How much should we allow a single actor to control? Is it better to split existential risk levels between several actors?   David: Where does the risk lie?  Alan: We are not at the point of failure because we are not making the investments.    1:23:19   Alan: Who is monitoring the total rehypothecated USDC number?  Strategic Finance is doing work on this.    1:28:00   Alan: How do these two MIPs relate to MIP 65?  They both work to present the metaDAO with a range of asset options to build a portfolio with the stablecoin. They also share similarities in legal setups.    1:28:56   Alan: Can you explain the MIP titles? Why the houses?  A project always needs a memorable title. I ride horses, and each initiative is named after another horse breed.    1:29:37   Alan: How is this related to the Clean Money Initiative?  Redwood and Arrow are very receptive to using greenhouse gas accounting.    1:31:06   Alan: Are there any management fees? How does Monetalis make money? Are there any kickbacks?  There are no kickbacks. We are trying to figure out reasonable fees. There aren’t many comparable models for arrangers.    Suggestion Box  Credits  Larry Wu produced this summary. Artem Gordon produced this summary. Everyone who spoke and presented on the call.  ",
                    "links": [
                        "https://youtu.be/m6B5V7hcvEA?t=94",
                        "https://youtu.be/m6B5V7hcvEA?t=126",
                        "https://www.youtube.com/watch?v=m7JQidyg7uU",
                        "https://youtu.be/m6B5V7hcvEA?t=490",
                        "https://youtu.be/m6B5V7hcvEA?t=2012",
                        "https://youtu.be/m6B5V7hcvEA?t=2877",
                        "https://www.youtube.com/watch?v=m6B5V7hcvEA",
                        "https://youtu.be/m6B5V7hcvEA?t=94",
                        "https://vote.makerdao.com/",
                        "https://youtu.be/m6B5V7hcvEA?t=95",
                        "https://youtu.be/m6B5V7hcvEA?t=126",
                        "https://youtu.be/m6B5V7hcvEA?t=126",
                        "https://forum.makerdao.com/t/weekly-mips-update-110/18493",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://forum.makerdao.com/tag/endgame-prelaunch-mip-set",
                        "https://youtu.be/m6B5V7hcvEA?t=273",
                        "https://youtu.be/m6B5V7hcvEA?t=290",
                        "https://youtu.be/m6B5V7hcvEA?t=328",
                        "https://www.youtube.com/watch?v=m7JQidyg7uU",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/29",
                        "https://forum.makerdao.com/t/tooling-lbs-blockchain-envoy-proposal-alerter/18500",
                        "https://forum.makerdao.com/t/proposal-idea-utilizing-hats-protocol-erc-1155s/18480",
                        "https://forum.makerdao.com/t/fixed-rates-strategies-and-mechanisms-in-the-decentralized-collateral-scope/18529",
                        "https://forum.makerdao.com/t/a-note-on-signal-requests/18501",
                        "https://forum.makerdao.com/t/signal-request-clear-vaults-bad-debt-in-the-makerdao-protocol/18376",
                        "https://forum.makerdao.com/t/signal-request-the-shcu-requests-a-moment-of-your-time/18466/1",
                        "https://youtu.be/m6B5V7hcvEA?t=490",
                        "https://forum.makerdao.com/t/endgame-plan-v3-complete-overview/17427",
                        "https://youtu.be/m6B5V7hcvEA?t=523",
                        "https://youtu.be/m6B5V7hcvEA?t=825",
                        "https://youtu.be/m6B5V7hcvEA?t=1422",
                        "https://youtu.be/m6B5V7hcvEA?t=1917",
                        "https://youtu.be/m6B5V7hcvEA?t=2012",
                        "https://youtu.be/m6B5V7hcvEA?t=2127",
                        "https://youtu.be/m6B5V7hcvEA?t=2326",
                        "https://youtu.be/m6B5V7hcvEA?t=2877",
                        "https://youtu.be/m6B5V7hcvEA?t=3408",
                        "https://youtu.be/m6B5V7hcvEA?t=3626",
                        "https://youtu.be/m6B5V7hcvEA?t=3813",
                        "https://youtu.be/m6B5V7hcvEA?t=3883",
                        "https://youtu.be/m6B5V7hcvEA?t=4014",
                        "https://youtu.be/m6B5V7hcvEA?t=4089",
                        "https://youtu.be/m6B5V7hcvEA?t=4133",
                        "https://youtu.be/m6B5V7hcvEA?t=4406",
                        "https://youtu.be/m6B5V7hcvEA",
                        "https://youtu.be/m6B5V7hcvEA?t=4773",
                        "https://youtu.be/m6B5V7hcvEA?t=4999",
                        "https://youtu.be/m6B5V7hcvEA?t=5280",
                        "https://youtu.be/m6B5V7hcvEA",
                        "https://youtu.be/m6B5V7hcvEA?t=5377",
                        "https://youtu.be/m6B5V7hcvEA",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.647702104097453
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/governance-and-risk-212-thursday-october-20-at-17-00-utc/18427",
            "title": "Governance and Risk #212 - Thursday, October 20 at 17:00 UTC ",
            "index": 18427,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "pubcall-:-governance-and-risk"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "0",
                    "time": "19/10/2022-21:46:20",
                    "content": " 212 f1920×442 28.1 KB   Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only and should not be relied upon as legal, business, investment, financial, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only and do not constitute any recommendation for any action or an offer to provide investment, financial, or other advisory services.  Call Recording       Call Information The zoom waiting room will be on, and a password is set to: 748478; please ping us in the Maker Discord’s #governance channel if you aren’t let in from the waiting room. 2021-10-20T17:00:00Z  Video/Voice  Dial-in  Calls Calendar  Slides - updated before the call  Introduction   @GovAlpha-Core-Unit - Hosting, Introduction, Agenda.  @gov-comms-core-unit - Slides   Governance Round-Up   @GovAlpha-Core-Unit - Votes Recap  @MIP-Editors - MIPs Recap  @Artem_Gordon - Forum Recap   Initiative Updates  DevCon Bogota Recaps by Various Core Unit Facilitators   Selected Discussion   Secondary Topic RWF Offboarding points of clarity MIP39c3-SP5: Offboarding the Real-world Finance Core Unit (RWF-001) MIP41c5-SP12: Facilitator Offboarding (RWF-001) Main Topic EndGame PreLaunch MIP Set If passed, what happens? Ask us stuff  Anonymous question box   @Recognized-Delegates @Core-Facilitators ",
                    "links": [
                        "https://discord.gg/5uAJtzkK",
                        "https://zoom.us/j/697074715",
                        "https://zoom.us/u/acRbIMDvK",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://docs.google.com/presentation/d/1tMzplA73Q1SIz6MgT8_EGjy6A_Q25u9vIl0FP_vwLBw/edit?usp=sharing",
                        "https://forum.makerdao.com/t/mip39c3-sp5-offboarding-the-real-world-finance-core-unit-rwf-001/17753",
                        "https://forum.makerdao.com/t/mip41c5-sp12-facilitator-offboarding-rwf-001/17332",
                        "https://vote.makerdao.com/polling/QmTmS5Nf#poll-detail",
                        "https://app.suggestionox.com/r/GovCallQs",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/21",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-octubre-2022/18516"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.246794871794872
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#3",
                    "likes": "0",
                    "time": "20/10/2022-17:11:29",
                    "content": " Episode #212: October 20, 2022 | Editorial Summary  Agenda   00:00: Introduction  02:45: Votes and Polls  04:07: MIPs Update  08:04: Weekly Forum Recap  15:35: Initiatives Update: DevCon Bogota Recaps  27:10: Discussion: RWF Offboarding points of clarity  45:20: Discussion: EndGame PreLaunch MIP Set  01:13:04: Conclusion   Video Link  General Updates  Votes  Payton Rose 2:45 Visit: Voting Portal  Votes:   Polls – 2:54   Executive Proposals – 3:16     MIPs  Pablo 4:07 Visit: Weekly MIPs Update #109 & MakerDAO Votes and Polls Public Calendar Important Dates: November 2nd is the last day to introduce modifications in proposals aiming to enter that Governance Cycle. The Formal Submission Window for November opens on November 7th.  MIPs:   October Ratification Polls – 4:21   Proposals in RFC – 5:18     Weekly Forum Recap  Artem Gordon 8:04       Visit: Weekly Forum Recap: October 14th - October 19th, 2022 & Meet Your Delegate #21  News & Announcements:  CalBlockchain Delegate Platform MakerDAO Talent Branch Maker Academy Initial Release    Active Discussions:  TieDai Creator Cluster Spring Cluster Introduction and Proposal Purpose 2.0 - Endgame, Clean Money and Nuclear Energy A16z Endgame Thoughts    Signal Requests:  Clear Vaults’ Bad Debt in the MakerDAO protocol MIP65 Asset Reallocation    Initiatives Update  DevCon Bogota Recaps  David Utrobin 15:35  Visit: Devcon 2022 Day Uno, on Drinks w/MakerDAO Delegates & The Devcon VI Endgame Kickoff  Contents:   Attendees & Agenda – 16:20   Slideshow – 16:50   David’s (GovComms) Highlights – 19:17   Payton’s (GovAlpha) Highlights – 19:38   Robert’s (CES) Highlights – 21:20     Discussion  RWF Offboarding: Points of Clarity   Mabel Tong & David Utrobin 27:10  Contents:   RWA - Collateral Status – 27:52   Questions - CU Ops – 30:43   William Remor’s Response – 31:43     Q&A 32:59   Robert: I want to clarify the scope of the Interim Facilitator issue: currently, there is no work going on in the RWF CU anymore, as it is in the process of being offboarded. If there is still a need for such a person, it is because someone must make final payments and oversee the overall shutdown of the operation.   Juan: The Auditor’s role will not be to set up agreements and continue working with other CUs but to do what Governance asks them to do.   Payton Rose: Such as GovAlpha’s role is to ensure that, for example, any given MIP proposed and passed by MKR Holders is accordingly put up as an Executive and executed promptly.      36:36   Frank Cruz: Regarding the need to address the possibility of grifting, it is 3F’s Platform point of view that it is fundamental to start onboarding individuals with the best intentions at heart when it comes to making sure that this DAO prospers from their work. It is a new paradigm. It is about building an ecosystem with contributors that will produce good results with honesty and are willing to do the right thing, no matter what their future might be within the DAO.  40:06   Robert: Moving forward with the End Game plan, we should take advantage–if the End Game MIPs pass–of the change of times and start looking into our vetting process and how to apply it when onboarding new Meta DAOs and individuals. It should always be all about MakerDAO. We must always look out for Maker’s best interest. A vetting process could be a fine addition to the culture of MakerDAO.  42:27   MakerMan: Once the offboarding process ends for RWF, what is the wind-down time/close date to submit invoices?   Discussion  EndGame PreLaunch MIP Set  David Utrobin 45:20  EndGame PreLaunch MIP Set1912×1064 132 KB   If this MIP passes, the MIP1 problem space changes.1920×1067 196 KB   If this MIP passes, some gov processes are changing.1920×1068 219 KB   If this MIP passes, some mandates are changing.1920×1070 138 KB   If this MIP passes, POVE becomes a priority.1920×1067 226 KB   Discussion Segment  Discussion Segment1916×894 155 KB  49:03   ACREinvest: Can someone speak to the process and plan for coming up with a Constitution? How will that be drafted and ratified?   Payton Rose: Within the Pre MIP Set, it is not specified. It would have to be a Standalone or separate governance motion that would draft a Constitution. The general idea is to gather more aspects from the overall plan and try to put that into a less mutable form.    52:07   ACREinvest: Regarding the Constitution, is it a gating item for any other mandates?   Payton Rose: This PreLaunch MIP Set is putting us in the direction of tackling an EndGame. If passed, we can work on those items, one of them being the Constitution, which will be more solidified in terms of what can be changed and how easily.  Derek: The idea of gating is a good one to add because there is a lot implied in the EndGame plan, but it is not explicitly written out or documented. So, on the technical side, we will have to figure out what elements need to be tackled first, even if they are long out in the overall scheme of EndGame.    54:55   Jacob: Could MIP 4 still be used to repel the EndGame MIP Set?   Payton Rose: Unless there is a rule that passes saying that no more amendments would stand and could still be used,  our MIPs are the closest that we have to the Constitution.    56:39   David Utrobin: What is the possibility of breaking this into bite-sized technical, social, and governance chunks? Can we do one MetaDAO, for example, to start?   Payton Rose: A lot of us are waiting to see how that will be done.  Frank Cruz: To build a new organizing principle, you need more than just one MetaDAO because you have to use this circle of different clusters where each cluster can work together and somehow cluster together to become a MetaDAO. If you get one MetaDAO, you will not be able to grow that ecosystem.    1:04:08   Nadia Alvarez: What will happen with CUs if the focus is on clusters and MetaDAOs?   David Utrobin: CUs should see what is happening with clusters and MetaDAOs and see where they may fit.  Payton Rose: It is a year minimum from when the pre-launch stuff passes from when we might see MetaDAOs. There is a lot of work and things to be figured out during that time, and many of the mandates are about keeping the DAO running.  Frank Cruz: It is a difficult question. Some CUs are essential to keeping the protocol working. In my opinion, if you are a CU that provides a service that can equate to an ecosystem actor, you should start thinking about how you can provide that service either as an ecosystem actor or a member of a cluster.    Suggestion Box  Credits  Larry Wu produced this summary. Constanza produced this summary. Kunfu-po produced this summary. Everyone who spoke and presented on the call.  ",
                    "links": [
                        "https://youtu.be/ePMfIUrG9Q8?t=165",
                        "https://youtu.be/ePMfIUrG9Q8?t=247",
                        "https://youtu.be/ePMfIUrG9Q8?t=484",
                        "https://youtu.be/ePMfIUrG9Q8?t=935",
                        "https://youtu.be/ePMfIUrG9Q8?t=1630",
                        "https://youtu.be/ePMfIUrG9Q8?t=2720",
                        "https://youtu.be/ePMfIUrG9Q8?t=4384",
                        "https://youtu.be/ePMfIUrG9Q8",
                        "https://youtu.be/ePMfIUrG9Q8?t=165",
                        "https://vote.makerdao.com/",
                        "https://youtu.be/ePMfIUrG9Q8?t=174",
                        "https://youtu.be/ePMfIUrG9Q8?t=196",
                        "https://youtu.be/ePMfIUrG9Q8?t=247",
                        "https://forum.makerdao.com/t/weekly-mips-update-109/18404",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://youtu.be/ePMfIUrG9Q8?t=261",
                        "https://youtu.be/ePMfIUrG9Q8?t=318",
                        "https://youtu.be/ePMfIUrG9Q8?t=484",
                        "https://www.youtube.com/watch?v=mSDjY9n3780",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/26",
                        "https://forum.makerdao.com/t/meet-your-delegate-21-calblockchain-daostrat-c/18418",
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407",
                        "https://forum.makerdao.com/t/makerdao-talent-branch-is-up-and-needs-community-feedback/18372",
                        "https://forum.makerdao.com/t/maker-academy-staging-release/18364",
                        "https://forum.makerdao.com/t/tiedai-creator-cluster/18369/1",
                        "https://forum.makerdao.com/t/spring-cluster-introduction-and-proposal/18398",
                        "https://forum.makerdao.com/t/purpose-2-0-endgame-clean-money-and-nuclear-energy/18421",
                        "https://forum.makerdao.com/t/a16z-endgame-thoughts/18412",
                        "https://forum.makerdao.com/t/signal-request-clear-vaults-bad-debt-in-the-makerdao-protocol/18376",
                        "https://forum.makerdao.com/t/signal-request-mip65-asset-reallocation/18295",
                        "https://youtu.be/ePMfIUrG9Q8?t=935",
                        "https://forum.makerdao.com/t/devcon-2022-day-uno-on-drinks-w-makerdao-delegates/18326/1",
                        "https://forum.makerdao.com/t/the-devcon-vi-endgame-kickoff-w-matthew-rabinowitz-of-6s-capital-on-drinks-with-makerdao-delegates/18171",
                        "https://youtu.be/ePMfIUrG9Q8?t=980",
                        "https://youtu.be/ePMfIUrG9Q8?t=1010",
                        "https://youtu.be/ePMfIUrG9Q8?t=1157",
                        "https://youtu.be/ePMfIUrG9Q8?t=1178",
                        "https://youtu.be/ePMfIUrG9Q8?t=1280",
                        "https://youtu.be/ePMfIUrG9Q8?t=1630",
                        "https://youtu.be/ePMfIUrG9Q8?t=1672",
                        "https://youtu.be/ePMfIUrG9Q8?t=1843",
                        "https://youtu.be/ePMfIUrG9Q8?t=1903",
                        "https://youtu.be/ePMfIUrG9Q8?t=1979",
                        "https://youtu.be/ePMfIUrG9Q8?t=2196",
                        "https://youtu.be/ePMfIUrG9Q8?t=2406",
                        "https://youtu.be/ePMfIUrG9Q8?t=2547",
                        "https://youtu.be/ePMfIUrG9Q8?t=2720",
                        "https://youtu.be/ePMfIUrG9Q8?t=2943",
                        "https://youtu.be/ePMfIUrG9Q8?t=3127",
                        "https://youtu.be/ePMfIUrG9Q8?t=3295",
                        "https://youtu.be/ePMfIUrG9Q8?t=3399",
                        "https://youtu.be/ePMfIUrG9Q8?t=3848",
                        "https://app.suggestionox.com/r/GovCallQs"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.965069413345275
                }
            ]
        }
    ],
    "group_index": "1810"
}