{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/issue-discussion-call-5-budget-modification-process/14226",
            "title": "Issue Discussion Call #5 | Budget Modification Process ",
            "index": 14226,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "budget",
                "public-call",
                "core-unit-budget",
                "pubcall-:-issue-discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/thomas.flitter",
                    "index": "#1",
                    "likes": "9",
                    "time": "25/03/2022-18:56:06",
                    "content": " 1280×720 465 KB  Disclaimer This communication is provided for information purposes only. The views and opinions expressed in this meeting are those of people involved, and do not reflect the official policy or position of MakerDAO or any of its contributors, Core Units, or affiliates. This communication makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, financial or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only , and do not constitute any recommendation for any action or an offer to provide investment, financial or other advisory services.  Date and Time Wednesday, March 30, 2022 at 12EST / 4PM UTC. Join link: Launch Meeting - Zoom  Description As MakerDAO continues to grow and expand, each Core Unit is required to update and manage their budget. This issue discussion call provides an overview of the current challenges surrounding core unit budget modification and proposed solutions on improving the overall process. This call features members of the Strategic Finance Core Unit, who will be putting out a MIP40 revision soon. Please bring questions, thoughts and opinions! If you can’t make it, this recording will be posted on the MakerDAO Youtube Channel.  Tentative Agenda  Welcome and Introductions What are the policies that currently drive the budget modification process? What are the biggest concerns with the existing budget modification process? How can we improve the budget proposal process? Open Discussion   Resources Call Notes Call Recording     @gov-comms-core-unit @Recognized-Delegates @Core-Facilitators @MIP-Editors @strat-fin-core-unit ",
                    "links": [
                        "https://www.youtube.com/c/MakerDAO/featured",
                        "https://docs.google.com/document/d/1SUNGmTNFgUNgiyxv_I0KPWk9Sab9EtI3KSXGrPDdwKs/edit#heading=h.ta6asm29tei7",
                        "https://www.youtube.com/watch?v=1UE98EVrk2I",
                        "https://forum.makerdao.com/t/relay-semanal-22-28-de-marzo-de-2022/14333",
                        "https://forum.makerdao.com/t/weekly-relay-march-22-28-2022/14300",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-mar-14-mar-25/14263",
                        "https://forum.makerdao.com/t/weekly-relay-march-28-april-4-2022/14450",
                        "https://forum.makerdao.com/t/relay-semanal-28-de-marzo-4-de-abril-de-2022/14495",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#2",
                    "likes": "2",
                    "time": "31/03/2022-16:28:06",
                    "content": "Check out this Medium summary of the Issue Discussion Call: Budget Modification Process  ↓ Semi-transcription Summary ↓   Issue Discussion Call #5: Budget Modification Process  Agenda   00:00: Introduction with Thomas Flitter  03:41: Budget Policy  06:55: Policies and Concerns  09:42: Addressing Policy Concerns  13:03: MIP40 Reform Proposals  24:21: Questions with Strategic Finance  01:07:48: Conclusion   Video Link  Introduction  Thomas Flitter  Agenda and Preamble 00:00  Good day, everyone. My name is Thomas Flitter, Engagement Lead for GovComms. I want to thank you for joining us for the Issue Discussion Call episode #5. The topic is Budget Update Process. We have a lot of good folks on board. We will go through a couple of things. In particular, we have got a new amendment that is out, and we would love to walk through that today. As we continue to grow, the Issue Discussion Calls are very important for bringing up topics for the community to discuss.  01:08  Agenda1920×1087 160 KB   Our Agenda for today. We will go over our current budget policy briefly. Also, what are some of the issues discussed? We have got many updates to budgets for CUs out on the forum. There have been some discussions about some budget policy issues and the processes. Also, how are some of these issues addressed? In particular, we have the MIP40 amendment proposal. We have got members from our Strategic Finance CU here today. Hopefully, they will go through and give us the highlights of this amendment proposal. They are chock-full of new information, a lot of it coming from the issues discussed. We will talk about some of the other considerations for improvement. We have some great ideas on the amendment and a couple of other ideas captured from the community members that we would like to highlight. There will be an open discussion session at the end to wrap up any ideas or additional feedback about the topic. Today’s call intends to encourage feedback and idea generation for everyone on board to be able to talk about their thoughts and ideas about budget policy and amendment information. The amendment is now on the forum, and you can find a link for that in the call notes. We want to go ahead and talk first about our current budget policy.   Bugeting Policy 03:41  What is our current budget policy?1920×1092 153 KB   Let us talk about our current budget policy. In the MIP40, budgets have a framework, and those frameworks are used to fund the work defined by CUs. The facilitators of the CUs are the ones that administer the CU budgets. The composition of a budget can have multiple entries. It includes a breakdown and implementation. With multiple entries, each has an implementation and a breakdown and enables more advanced compensation and funding structures to be created if desired. Once the budget gets approved, the CU facilitators begin drawing the payments to fund their CU according to their budget implementation. The CUs have a breakdown of spending for their CU during the budget period in the budget breakdown. The budget breakdown component is non-binding, but it is intended to encourage transparency. The implementation defines how and when the CU facilitators will receive funds that make up their budget. Unlike the breakdown, the implementation is binding. When those budgets are approved, they have to be modified. Adding and modifying the budget process can get tricky because the CUs have their own going cost, and if they want to grow and expand, they will have to include that information. In that addition and modifying those budgets, there is a template to be followed. In that template, they explain what is needed and what needs to be added. Process two has a feedback period of one month with a minimum frozen period of one week. The budget portions include implementation details that look at smart contracts authorized by Maker Governance to draw funds from the protocol. A couple of CUs and some forum information has demonstrated concern that we have outgrown the MIPS40 budget. There are certain aspects of it that we need to look at to improve it.   Policies and Concerns 06:55  What are the recent budget policy/process issues being discussed?1920×1090 202 KB   When we look at some of the concerns, at least the recent policy issues discussed on the forum, the following questions have been asked:  How can we improve the overwhelming budget review process? Doo Nam, who spoke from a delegate perspective, said how do we handle all the budget reviews? There are a lot out there. It would be very overwhelming. Is there a best practice for expanding a budget? When you look at putting together a budget and want to increase it because a CU wants to grow or has a growth strategy, many of its components are put out there on the forum. The community will ask questions, and we will spend much time explaining why we have expanded that budget. How can expense reporting be less fragmented and more standardized? That is one of the key aspects of the MIP amendment and new proposal. Should MakerDAO tie in performance and accountability in a budget update? How would that tie in if we have got OKRs and these things that we are putting together as strategic objectives for a particular CU? How would those tie into a budget update? Are there any other concerns or questions from folks on the call?   Payton Rose: How can we make this work now and in the future when we maybe have a hundred CUs?   Addressing Budget Concerns 09:42  How are budget issues being addressed?1920×1096 180 KB   Strategic Finance CU issued a draft proposal on March 27th. The MIP40 amendment is broken down into four sections. I wanted to see if someone from AES or Strategic Finance would be able to go through some of the draft proposals amendments are? Adrian: Strategic Finance is on this call. We have Mark, and I am Adrian. We had a chat earlier ahead of the MIP being published, and we have some pages that we shared with Artem. Could you quickly put them on the screen to introduce a bit of context? We can try and explain how we thought about this MIP process. And then open the floor for questions. We should spend most of our time addressing questions.   Submitting an Offboard Proposal MIP40 with Adrian 13:03  MIP40 Reform Proposal1920×1062 119 KB   Overview of Cash Burn Sensitivity to Macro Scenarios1920×1081 242 KB   To remind everyone a little bit of context, this was triggered by an analysis of the sensitivity of the protocol to various macro scenarios of varying degrees of likelihood. The conclusion ties into some of the other adjacent concerns that we have highlighted, mainly the cognitive overload for delegates and Maker holders to process all of these budget requests tied to the sensitivity of the protocol itself to the macro scenarios. We begged for a budget request process to consider these concerns, build a more resilient protocol, and produce budget requests that were easier to digest and organized in slightly different timings.   Overview of Implications and Next Steps1920×1056 268 KB   We talked about how Maker’s key risks were insolvency, which has happened once and probably will not happen again. Or it will happen one more time for the last time. Or either flipping, which in the flip scenario, of a super bullish market, if we are in an environment where we do not invest enough in growth, and we fall behind, then we lose our incumbency status. This is a big deal for the long-term profitability of the protocol. In the last G&R call, we had the discussion, got some preliminary ideas, and submitted a draft proposal for further discussion. And this is the point where we are.   Overview of Changes and Rationale1920×1080 110 KB   Fundamentally, what is a Core Unit Budget for?1920×1064 142 KB   We wanted to go over the main changes and rationale and explain what we thought about the MIP40 process. IceCube has this very concise way of illustrating, which speaks to how we want facilitators to think about their budgets. A CU budget should serve to grow revenues or improve the protocol’s operations—at least one of these two things.   MIP4c2-SP19: MIP40 Budget Process Amendment Subproposal1920×1050 175 KB   This slide outlines some of the main changes we are proposing in this new process. The first and most important one is to ask facilitators who are requesting a budget request to tie their CU budget more closely to the overall objectives of the DAO. We frame it as token holder primacy, and everything else will follow. This is something that facilitators were already doing because it was implied. In the new budget request proposal, there is an ask for facilitators to make this explicit so that we can shortcut the work. In some budget requests, you often see questions about how this benefits the proposal? What is the point of this line? What do you think about this? Do we need an X CU? If we clarify that the CU budget serves the objectives upfront, you remove a lot of the cognitive overhead both for the facilitator when developing the budget and for the token holders at the time of the value. Similarly, another aim is to simplify the decision-making process. We aim to provide a framework where nothing is implied, and everything is explicit. So facilitators can question themselves when producing the budget whether it adds value to the protocol. Maker holders can evaluate, analyze and compare whether this budget helps increase the token value. The final point is that one of our main motivators was to improve transparency and accountability for CU operations on an ongoing basis. One aim is to recommend how the CU budget proposals are structured. We want this to be clear and transparent for token holders to evaluate where the commitments are spending these operating expenses. For 12 months afterward, compare, contrast and review whether they spent where they said they would spend. Some of this is already in place. But particularly on the expensive side, we will be proposing more detailed charts of accounts that can help with the transparency without meaning that it is not a huge amount of extra work for the facilitators either.   MIP4c2-SP19:MIP40 Budget Process Amendment Subproposal/FAQs from the Thread1920×1047 268 KB   I will not read this slide out loud. We tried to summarize some of the FAQs from the thread. The High-Frequency Trading CU is not confirmed yet. It was an example that we thought would be useful so that people could see what the implications of this budget proposal were. There was a question on what we would do if the CU failed to return funds. At the end of the three-month budget window, there is an element of fund return. The only thing we can reasonably do as a CU in this decentralized governance structure is to flag it in the expense reports that we publish regularly and then let the community decide. This should leave it open. If, for example, there is a bullet payment in the fourth or fifth month that requires the budget to remain in the wallet, this is a good explanation, and it is just a matter of being upfront with the community. Are we adding much work to facilitators? This relates slightly to Wouter’s question about how we keep the barrier to entry low to the DAO. To paraphrase this question: how can we keep the DAO open for new participants? Indirectly, how does this budget proposal make it easier for facilitators? The answer to this is that being transparent and upfront about how a CU budget adds value to the protocol is a key prerequisite, without which it does not make sense for a new facilitator to join. The barrier to entry should be low, but it should also be clear that facilitating a CU is like running and owning a business. These are basic questions people ask a facilitator, and we are happy to help any prospective facilitators answer them. We understand it might be helpful to go back and forth. This is definitely within the mandate of the Strategic Finance team to exchange potential budget requests to help fine-tune them and identify the sources of value and bring them in the right way. But if the prospective facilitator cannot answer these questions, it is fair to ask whether this mandate would be better fulfilled by an existing team or through the grants program. How do we combat low-balling and over-estimating budgets? I want to come back a little bit to speak about how budgets should serve the objectives of the DAO and drive value for token holders. Because if you measure it by that metric, this concern melts as long as token holders are engaged and voting for the DAO’s benefit and protocol. If you commit to returns and accountability, then the size of the request does not matter. Whether that capital is being put to its best possible use matters; in other words, if you ask for a large budget, the return is fine, but the return hurdle will be higher. So the onus is on the facilitator to create, propose, and be accountable for a plan that can deliver the necessary return. If the expectations on the other side are low-balled, then it should be clear from the proposal that the money would be better spent elsewhere, maybe in another CU, or maybe in an investment? You can think of it as follows: do we add another engineer? Do we buy back tokens? Do we invest them in ETH? Or do we invest in a low-balled CU budget? These concerns should dissipate if you measure them in terms of the token holder’s value. Tying return expectations to a budget and keeping facilitators accountable is key to making this MIP process work. This is something that has been implied until now. Facilitators have always intended to deliver value to the protocol, but often, not making the direct return clear to token holders created many discussions that did not necessarily need to happen. We aim to provide a framework for all of the information that we believe is already there to organize it in a more easily digestible way for token holders. Then someone asked about pay-for-performance, which is similar to the idea of investing and putting capital to its best possible use. It is a great idea, but we will not wade into it in this MIP. We will potentially exchange some ideas about a new MIP to make a larger pay-for-performance component.   Overview of MIP4c2-SP191920×1054 167 KB   Overview of MIP4c2-SP191920×1048 162 KB   Overview of MIP4c2-SP191920×1083 149 KB   Overview of MIP4c2-SP191920×1078 247 KB   We have six or seven pages of slides where we have taken the existing MIP40 and the new MIP40, and we have an overview of the rationale and benefits. We will not go through all of it. I propose that we open the floor to questions. If a question pertains to a specific paragraph or section of the MIP, we can jump to that relevant slide.   Questions 24:21  David Utrobin: One of the budget amendment goals was to make it scalable and not as onerous to review. But it sounds like this framework adds a whole new layer of analysis around the performance aspect of CUs. Do you think that this is a necessary component? Or, if it is already implied, does it need to be explicitly a part of a budget? Or does it just add much extra work on top that does not equate to much value?  Adrian: I would like to address two elements of this question. The first one is the cognitive overhead of processing these budget requests. To tackle this, we have introduced the concept of a submission period. We concentrate all of the budget proposals into quarterly windows. Part of the problem is that with this monthly governance cycle, there is a tendency for budget requests to spring up haphazardly, making it difficult to evaluate, particularly in the context of other important governance issues that might be required. Forcing these requests into these windows also forces the facilitators to take a longer-term view for planning their activities. This is a good thing. The facilitators take responsibility on behalf of the token holders to absorb investment and conduct activities that add value to the protocol. Part of this responsibility involves a high degree of long-term planning, hence the Maker vesting, which is part of the CU compensation. We do not think it is necessarily a large overhead to ask people to stick to specific submission windows because the biggest benefit is for the people being asked to evaluate. Hopefully, this addresses 80% of your question. The other part is that there is a whole element of performance analysis. The problem today is that the framework implies this element. When you have an implied framework or structure, things worsen because you have to spend time explaining the rationale when it should be clear upfront. It does not necessarily mean more work by asking facilitators to do it. It means organized in a structured manner that allows Maker holders to evaluate more efficiently. In principle, it should reduce the time people spend on this to create and evaluate. I hope this answers your concerns.   Mark: I want to add to that quickly. These questions are more comprehensive than the existing MIP process, and any business owner should be able to answer them. It should not take you long to think about the value that you are creating, leading a team. The corporate business world routinely asks these questions. Suppose someone thinks a particular question or area is unclear. In that case, we are happy to talk through it with any prospective facilitators if they are having trouble doing a variance analysis or understanding what changes in this MIP. We are more than happy to help facilitate that process and try and provide some more detail on the reasonings and how you could answer these questions.  29:00  Wouter: I like the proposal. It is very on point to identify the missing structure in the existing MIP40. I agree that providing the structure might make it easier for facilitators to present the budget they want to request. My thoughts are more in the periphery and are typically about the next step and things like that. I have a lot more that we can discuss later on. One thing I want to comment on at this point is that the submission windows are my least favorite element of the proposal. There are two reasons. One is that I do not see how it would make the life of delegates easier to have a barrage of budget requests at one point. It might be easier for them to make a few budget requests every month rather than have them all at once. We already see this, and it is just the monthly cycle, that there is a significant variation in the workload when suddenly everyone is submitting a proposal. You have to process that all at once. The one advantage that I see with grouping them is that it may be easier to pick priorities. If there are three different budget proposals, they need to be compatible with each other when there is a budget cap. That might help with it. However, the budget windows overall might create this choking point for the workload of delegates. This is probably the most restricting one for facilitators of all the included elements. For example, waiting another three months is difficult if they just missed their deadline. It might have unintended consequences. I want to add that I agree that we need to structure the information in a way as easy as possible for delegates to process. But as we are scaling up, we will need to tackle that issue, in any case, in more structural ways. Another element that plays here is not just bandwidth in terms of the number of hours but also the available expertise. We are generally concerned that delegates may not be very well equipped to make good calls on specific budget line items. It is nothing against this proposal. We need to be mindful of this risk. If we create too simple, it is like a list of line items that the delegate goes through, like: do we need this one? Do we need that one? We must preserve enough independence of the CUs to determine the necessary expenses within their area of expertise. Sometimes you bump into the problem where for example, if PE proposes a budget. Then there is a high cost in security, there is a specific commentary on that line item, and we are driven towards cost-cutting in areas where we should not cut the costs. So delegates are restricted in two ways, the number of hours and expertise. We should structure the information to alleviate that as much as possible. We will need additional mechanisms to address that.  Adrian: Thanks, Wouter. Those are valid concerns. Paper mentioned in the chat one reasoning why delegates might welcome the submission window, which is basically to treat budget requests consistently as they might change from month to month. Related to this, Payton asked what happens if you need to work with ad-hoc in between cycles? This need may well occur. This is more of a question on the planning side. The facilitator has to ensure that the plans are done within the timeframe of the budget term. These budgets are set for some time between three to 12 months. There are enough submission windows that it should allow CU facilitators to make modifications along the way, provided that they do the job correctly upfront. We are trying to backload more of the planning work. Ideally, we would have fewer new budget requests short of like a major change in the macro-environment. Regarding explaining the different line items, the intention is not necessarily to get into the weeds unless the delegate necessarily wants to. The framework that we are proposing should also help the facilitators explain the line items. Ice Cube says the expense should help grow revenues or improve operations if you switch back to page four. In the case of your example, with the security budget, it is clear that it improves operations. People might balk at the size. However, then the facilitator has the opportunity to show: “No, actually, you need to invest these Dai here because you will improve the operations by making it more secure and avoiding a $20 million Dai loss in some other area”. Mark: To add to the budget window question. It is certainly something we are open to receiving feedback on. It was designed with the delegates and in conversations with delegates regarding cognitive overhead, having new budgets pop up constantly. This also ties significantly into how we financially plan as a DAO. If you have different budgeting periods and things are continually changing, it is not easy to plan a long-term financial strategy, especially allocating capital. One of the benefits of planning these specific periods is that we have a much better sense of our holistic expenses as a DAO and how we can allocate capital more effectively.    38:08  Someone: What happens if a CU misses its budget window, but its mission is critical, or if it is an unplanned event?  Mark: Regarding unplanned events, most CUs have a contingency buffer that should be sufficient to handle those unplanned events. If there is something above or a situation where a CU misses a budget window, we can undoubtedly add a modification for an emergency proposal to ensure the funds. We could account for that and manage that. Adrian: Today, budgets are already essentially padded. They all come with certain amounts in a contingency buffer for contingencies.    39:08  Payton Rose: Coming from the facilitators’ perspective, one of the things that gave us the confidence to submit a year-long budget is that we can always submit a budget again if there is something major we need to pivot to. Strict budget windows, especially for only twice annually for a CU, underestimate how quickly the space can evolve and things can change. At the same time, I can see why it makes it easier for delegates and financial planning. You have to balance those trade-offs. The crutch of my question comes from a meeting I had. Someone raised the point that the more mandatory regulations and restrictions we add to something to be considered a legitimate budget, the larger we will have to make every team that applies as a CU. Currently, CUs are our only natural way to distribute funds reliably. Perhaps we need to work on having other ways. The non-intended effect of this could be a bloating of CUs anytime they come to apply. It will no longer be financially feasible to have a unit of two or three people if one person will essentially be wrapping around all these different budget requirements before they submit. What can we do to ensure that we can still have nimble CUs that do not have to add a bunch of personnel since those tend to be the largest expense that we see as a DAO?  Wouter: I asked in the chat, how can we keep the barrier to entry low? We need to recognize that if the DAO is going to work well and efficiently, it needs to play on its strengths. One of the strengths is openness and the opportunity for people to learn and potentially fail and, as Payton said, to keep things nimble. This does not go against this proposal, per se. But it indicates that, as Payton mentioned, we may need additional structures to ease the slope. They mentioned grants. The issue with grants is that they are a whole lot less structured. Ideally, I would like us to think one step further and ask ourselves, how can we create an environment where beginning teams have this room to grow and become better? Maybe one part of the answer might be to add some expectations around the finality of the budget. For example, if you have a new team, perhaps the budget is not as strongly thought through as a very experienced team. But maybe we can have some trial period where they go ahead, but at the same time, there is the understanding that their budget allocation is less final. They can more easily withdraw again. It is kind of a grant but more structured. It helps to ladder up. The question is, what is optional? What is mandatory? One straightforward thing we can do is add some defaults to the added sections. For example, winding down a CU, we might define a default procedure that applies in 80% of the cases to reduce the significant hurdle that new facilitators might face; they do not know the DAO environment. As you mentioned, they may need help, your ability to provide support. But simply having a default might already help reduce the barrier to entry. So yes, similar sentiments.    44:46  Adrian: I want to counteract one perception that reducing CU budget performance evaluation to token holder value, growing revenues, and improving operations somehow raises the risk or makes it impossible for someone to try and fail. You described the ability to fail, which is very nicely put and something we like a lot, particularly in the space early. The ability to fail is helped with the structure and would be undermined by introducing more complexity. Let me explain. For example, if you compare an experienced operator submitting a budget proposal versus an inexperienced facilitator who is putting together a budget proposal, the delegates would evaluate them while taking that into account. And they would recognize that just for having attempted something and maybe having failed in the outcome of the mandate. A learning process makes it more likely for the next budget to succeed. Suppose you frame it in the context of growing revenues, improving operations, and generally increasing token holder value. In that case, it should be possible for a potential ambitious but inexperienced facilitator to put together a budget that could conceivably not achieve a team. They cannot submit a new budget proposal explaining how it can work and provide the plan. It is all about putting together plans and executing against them and then explaining what happened to the plan as it was executed. We also implemented grants or other CUs into this MIP40 proposal. I would be wary of introducing the concept of a shadow budget that could hide operating expenses and shelter them from accountability to the token holder. The MIP40 proposal should stop that because a CU’s grants or costs are also measured. If it increases the size of the expenses, it should attract accountability to that expense. The intent is to keep things simple. As a Strategic Finance CU, our role and mandate is to help new operators and new facilitators onboard. If someone has a good idea to compose the High-Frequency Trading CU that adds value to Maker and is with its objectives, we will spend time working with them, even if they have never done a P&L. Should they fail, they continue to have the same amount of energy for the protocol, the same amount of ambition, and they can demonstratively create a new plan and adapt and learn from their past mistakes. Token holders should be able to evaluate these, take them into account, and approve them.  Mark: I wanted to distinguish between openness and transparency. This MIP is about transparency. Given that all the budgeting and activity on the forums continue to ramp up, we need to have some of these baseline questions just answered upfront. So delegates do not have to go through every budget proposal and ask almost the same questions. Some MIPs come through with a very structured process, and some do something different that is outside the existing standard. We do not think this adds or reduces the openness of the protocol. When it comes to openness accessibility, this DAO is, if not the most open and accessible. It has got to be one of the top ones. You can get involved in a team by volunteering and part-time work. There are full-time opportunities. And for facilitators, you can go through the SES Incubation Program to get up to speed and understand how we do things here. Correct me if I am wrong. You guys can incubate a team for as long as it takes until you believe they are ready to launch their CU. And then, as it has already been covered, there is the grants program for ad-hoc specific projects.    50:19  Patrick: Question number one. Let us imagine that we, GovAlpha, have submitted a Dai budget, and the delegates have voted it down. The MIP, as it stands, from my reading of it, does not account for them being able to come back and resubmit, and they would have to wait for the next submission window. Is that something that we will look to address for these specific situations where budgets failed to pass governance? The second question is one that we have talked about internally. Have you thought about separating the voting for Dai and MKR budgets? Previously, what tends to happen is there is a Dai budget and an MKR budget, and they get bundled together as a MIPset under MIP40. We were very conscious when we submitted our budgets recently that we put them up separately so that governance could assess both on their merits rather than voting through an MKR budget because they wanted to support our Dai budget.  Adrian: Many questions were around the timings. It is a fair point. Mark: We have ranked-choice voting. There is an option to fund an expanded budget, continue funding the existing budget or reject the budget. So if the community rejects your budget, you would have to wait for the new submission window. But for existing CUs where the current team is providing value that is meeting the expectations of delegates and Maker holders, at the very least, you would see a continuation vote rather than a peer rejection. There will be more activity and hopefully more clarity regarding why that specific budget is outright rejected if there is a peer rejection.    52:39  Adrian: On Payton’s point, we may not have gotten to this point in his question about the larger CUs. It is not necessarily about the amount of expense itself. But it is about whether this capital is being put to its best possible use. So if CU wants to inflate to account for longer submission windows, for whatever reason, they will have to be accountable for the associated increase in results expectations to it. Maybe this is a pressure created by the submission window. Because if you submit a mega-budget, it will raise many questions about why you need it and whether it is the best possible use of the capital.  53:59  Mark: The second part of the question separated Maker and Dai budgets. It is something that the community is probably gone back and forth on. I would like to see them separate. But some people feel strongly about having it one way or the other. It is something we would like community feedback on to see, especially what the delegates and Maker holders believe is the appropriate path. There are somewhat reasonable arguments on both sides.  55:10  Payton: If we require a lot more work upfront for submitting a budget and also reporting and transparency after it is approved, and suddenly, you are creating a role that mostly has to focus on that, that is the facilitator role by default. But for smaller CUs, where the facilitator is trying to wear many hats that may no longer be viable if we had more regulation on top of what must be contained within certain proposals? Mark: These questions are the bare minimum that any CU should be able to answer. Most CUs are already thinking of these things and answering these questions when they go through the Incubation Program with SES. It is about being forthright and transparent, so delegates do not have to read through every proposal line by line to get the key information necessary to make a minimum decision. Honestly, if the MIP is a little long, we are happy to do educational sessions on how we populate. We did the example template with the High-Frequency Trading CU. But in reality, answering these questions should not take longer than an hour maximum. If CUs are thinking of all these things and need some guidance on how they should be asking for more budget in certain areas if they are looking for a budget investment, we are happy to have those conversations. Still, we do not see this as a lot of red taper administrative overhead on the end of the facilitators. Adrian: On a smaller business, or if the CU is smaller, will the justifications also be lower? The business or the CU will be less complex. Payton: The hours one has to spend maintaining budget requirements go much higher, which means you are more likely to hire a different hand, which will be the most expensive part of your budget. Mark: What do you mean by maintaining budget standards? Payton: Think about the requests. They include that information with how they would cut back their budget or spending within a bear market or some stretch goals that they might achieve. That is a simple question on its face. But when you think about it, now I have to think about what are the market scenarios that might cause this to happen. How does this affect my CU? With all respect, if you are only spending an hour additional to answer that question, you are probably not answering it very well. And then you have transparency, and returning requirements, which I am all for, and I very much support. However, it adds tasks and things that a CU must do to be considered eligible. And the more stuff you add on, the more hands you will have to hire to maintain the process.  Adrian: I want to dispel the idea that this MIP is asking for extra work because that is not the intention. The intention is to take work that is already taking place to put together these budget proposals and slide them into a structure that makes them easier to digest. An inexperienced writer may not know a template beyond GitHub and write a budget in the current unstructured way. A framework that tells them what to put in where should help them spend less time on it. Regarding the task of preparing for a bear market or bull market, it comes with the nature of the beast; we need to be able to adapt to volatile market environments. It is not necessarily something that needs to be maintained, updated, or done straightforwardly as the core budget. The Maker holders have asked for some explanations in the context of a bear market of what the protocol will do to reduce expenses, and pre-empting this shows that the CUs are ready for any eventuality rather than letting the protocol fall into losses. Wouter: There are some things there that could be optional. Having a default might already help. In general, I agree that most of these things in the proposal should be things that at least the facilitator should have thought about. But it could be the impression that this is worse than what it is. Like, “I will spend the week on it. And they will interrogate me about every line item of my budget, etc.” Part of the answer to keeping the barrier to entry low for the right participants might be to frame the communication more in terms of support and helping to structure things, rather than emphasizing too much the obligations. This may seem silly, but it makes a huge difference. For example, when we talk about openness, you send a different message than when telling someone we will help you structure a proper budget for your CU. We set you up for success instead of saying you should think about this long list of things before you even think about applying. We should never underestimate that point. It makes a big difference in practice.   Adrian: That is an excellent point, Wouter. That is our intention. The idea was to have hard requirements and much support. This is well within the mandate of our CU to help. We have financial backgrounds, each of us is familiar with how to put together budgets, we have put together budgets ourselves. This is something that we can help people who need it and ask for it. That is a very good point taken, and we will think of a way to frame within the structure of this MIP that this help is available and that it is not just a sink or swim situation. It sinks or swims, but we will help people float.  1:02:27  Thomas Flitter: I am glad to hear you addressing that. We just brought one consideration up, which was the consideration of a budget review committee. We are asking how do we find support for those who do not have a financial background and are responsible for doing these? That was the last slide before the open discussion, and it was one of the key elements or at least essential suggestions that were out there on the forum, talking about a budget review committee.  Adrian: Like IceCube, he is hard, but he is on our side. He will help us put together the best budgets.   David Utrobin: I want to express much gratitude to the Strategic Finance guys for putting this together, thinking through many of these things, and proposing. I appreciate it. Thomas Flitter: I also want to encourage everyone to visit the forum with these great ideas and thoughts. We have a link out there to make some comments before the formal submission on April 27th.  Adrian: This was the intention of giving people enough time to submit feedback and incorporate the feedback before the formal submission. But we wanted to emphasize the action and doing things since our last G&R call.    1:04:50  Wouter: I have two last points to illustrate what Payton is saying. For example, we already spent much time working on the budget without considering market conditions. Its relationship to the mandatory or optional nature of this one default might be to say: Well, if it is like a critical CU, this might already be my minimum viable operations. In the two scenarios, the answer might be that we cannot do this if this budget is not available. Even just pointing that out, there is already an improvement upon not addressing it. This is one example of how a default could help the facilitator make things easier. The other point I want to make, there are exceptions. For example, the Deco CU budget is very different in structure than all others. So one question we need to ask is, with this MIP40 in place, does it mean that this is no longer possible? That would be problematic. We need to think about exceptions too, and this, again, ties to, is this like the only standards? Is this mandatory for everyone? Is it a hard rule or a bit more nuanced than that?  Adrian: The most important hard rule we wanted to introduce was the concept of serving the token holder, growing the revenues of the protocol, and improving the operations, and then everything else should follow. This is the thinking behind this proposal. To the extent that they might need a different chart of accounts to explain their budget, I do not see why that should not be allowed in this MIP standard. The point is that facilitators are already thinking about this. They are putting together their budgets with the view to improving the protocol. We give people the benefit of the doubt as everybody is doing their best. And this structure should help them communicate clearly, and show how this value has been created for the token model. Everything else is more about the implementation and the detail and then structure to hopefully alleviate a lot of the work that some people have raised as potential issues.    1:08:25  Thomas Flitter: The point is that facilitators are already thinking about this. They are putting together their budgets with the view to improving the protocol. We give people the benefit of the doubt as everybody is doing their best. And this structure should help them communicate clearly, and show how this value has been created for the token model. Everything else is more about the implementation and the detail and then structure to hopefully alleviate a lot of the work that some people have raised as potential issues.   Credits  Kunfu-po produced this summary. Larry Wu produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/1UE98EVrk2I",
                        "https://youtu.be/1UE98EVrk2I?t=221",
                        "https://youtu.be/1UE98EVrk2I?t=415",
                        "https://youtu.be/1UE98EVrk2I?t=564",
                        "https://youtu.be/1UE98EVrk2I?t=783",
                        "https://youtu.be/1UE98EVrk2I?t=1461",
                        "https://youtu.be/1UE98EVrk2I?t=4068",
                        "https://youtu.be/1UE98EVrk2I",
                        "https://youtu.be/1UE98EVrk2I",
                        "https://youtu.be/1UE98EVrk2I?t=68",
                        "https://youtu.be/1UE98EVrk2I?t=221",
                        "https://youtu.be/1UE98EVrk2I?t=415",
                        "https://youtu.be/1UE98EVrk2I?t=564",
                        "https://youtu.be/1UE98EVrk2I?t=783",
                        "https://youtu.be/1UE98EVrk2I?t=1461",
                        "https://youtu.be/1UE98EVrk2I?t=1740",
                        "https://youtu.be/1UE98EVrk2I?t=2288",
                        "https://youtu.be/1UE98EVrk2I?t=2348",
                        "https://youtu.be/1UE98EVrk2I?t=2686",
                        "https://youtu.be/1UE98EVrk2I?t=3019",
                        "https://youtu.be/1UE98EVrk2I?t=3159",
                        "https://youtu.be/1UE98EVrk2I?t=3239",
                        "https://youtu.be/1UE98EVrk2I?t=3310",
                        "https://youtu.be/1UE98EVrk2I?t=3747",
                        "https://youtu.be/1UE98EVrk2I?t=3890",
                        "https://youtu.be/1UE98EVrk2I?t=4105"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.759314540911763
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/06/2022-22:28:55",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}