{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-taming-wildcat-stablecoins-paper-makerdao-vs-centralized-stablecoins/9416",
            "title": "[Discussion] \"Taming Wildcat Stablecoins\" Paper -- MakerDAO vs Centralized Stablecoins ",
            "index": 9416,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "stablecoin",
                "research",
                "dai",
                "academic-papers"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "12",
                    "time": "19/07/2021-01:25:07",
                    "content": "It’s making the rounds, so I wanted to share my thoughts about the research paper released ahead of the big meeting tomorrow. For those who haven’t read it and wish to do so, it may be found here. I will not get too far into the weeds in the main post – question me about details in the comments if anyone here is interested – but the main takeaways are this*   The paper discusses both legal and “economics” definitions of what it means to be a bank. The latter is likely to be in order to establish political cover for regulatory expansion. If you doubt that the paper is politically motivated, I will direct you to the title. “Wildcat” banking is a pejorative, and is typically used by those who have not studied the United States’ free banking era very closely.   The lack of citations with major economic historians on that era – and refusal to grapple with the narrative embraced by mainstream economic histories of the free banking era – confirms further that this paper is likely motivated by a regulatory agenda, and perhaps can be a window into the thinking of regulators. As someone who actually studied the era, the authors appear to be very under-read when it comes to the academic literature.   Maker is not in the crosshairs at all. It is not even clear regulators are aware of us, as all of the stable coins discussed in the paper are centralized. Naturally most of them are much smaller market capitalizations than DAI.   It is very important that we stop referring to Maker as a bank, particularly in public. Especially when this paper ensures that Maker fails the tests of what constitutes a bank even “economically” rather than legally. The key points here are that Maker does not custody deposits, it does not (as narrowly defined by the Supreme Court as providing money loans directly to a commercial entity with no intermediary) provide commercial loans, nor does it issue short-term debt. DAI is not redeemable for US dollars, so it is hard to imagine it being considered a short-term debt.   Maker also does not participate in money transmission or payments, which is the other major banking activity discussed in the paper.   The regulatory suggestions are not particularly onerous for Maker. The main ones being the requirement of a 1:1 reserve (Maker is currently collateralizing all DAI at far greater than 1:1), and perhaps a requirement to hold Treasuries and similar debt (a proposal already being discussed with the proposed MPCU). The final one is easy auditability, and we are already as open as possible with regard to that one.   The main point is that decentralized stablecoins are clearly not what is being discussed in policy circles. Whether that means we have more tacit approval or the information gap about crypto assets is so large that they simply don’t know we exist is hard to determine. A very important point is that this paper, which appears to be establishing a casus belli for regulation of pegged crypto assets, also provides Maker with ample cover to avoid the regulatory hammer. As long as we are consistent in our messaging that we are 1) NOT A BANK, 2) do not custody assets for customers, 3) only issue long-term debt, and 3) do not utilize fractional reserve lending practices, Maker should be well positioned to be the “regulation friendly” or “least bad” alternative to USDC, Tether, GUSD, Paxos, and others named in this paper. Until we have a marketing or legal CU onboarded, I ask that you remember the above talking points. We are being given – in writing – a way to avoid the “bank” title, both in the letter and spirit of the law. Maker could be materially harmed if we do not ensure we are consistent in messaging that we are fundamentally different from centralized stablecoins. *Assuming this paper, actually represents what regulators are thinking ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-vs-redemption-based-stablecoins-under-glass-steagall/10911",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-151-thursday-july-22-17-00-utc/9423/2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-15-22/9486",
                        "https://forum.makerdao.com/t/maker-relay-ep-54-en-espanol/9476",
                        "https://forum.makerdao.com/t/maker-relay-ep-54/9437"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.404114145658263
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#2",
                    "likes": "8",
                    "time": "19/07/2021-05:20:20",
                    "content": "I think Maker’s safest bet is 1) not to portrait itself as a bank AND 2) be very conscious of the banking regulatory environment changes. And even go one step further, where practical, 3) to align its risk policies and treasury to be in line with some core banking international standards (BIS and Basel accords): capital, liquidity, provision requirements. At “worst”, Maker becomes systemically important and regulation shifts to include us in the regulator’s eyesight. In which case, if we were proactive, we would be safe. At “best”, the regulatory environment never includes us (unlikely if we become systemically important) and we would be better off with a more solid balance sheet from having self enforced good capital and provision requirements than we left off. One thing I’ve learnt from my years in banking, don’t wait. Banking regulation changes quickly and only gets worse. Risk management is ALWAYS the regulator’s first target. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.781481481481482
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#3",
                    "likes": "9",
                    "time": "19/07/2021-07:42:31",
                    "content": "Thanks for bringing up this paper and the very important points regarding the differences between a centralized vs. decentralized stablecoin, and what, by definition, is a bank, and why Maker isn’t.     PaperImperium:  A very important point is that this paper, which appears to be establishing a casus belli for regulation of pegged crypto assets, also provides Maker with ample cover to avoid the regulatory hammer. As long as we are consistent in our messaging that we are 1) NOT A BANK, 2) do not custody assets for customers, 3) only issue long-term debt, and 3) do not utilize fractional reserve lending practices, Maker should be well positioned to be the “regulation friendly” or “least bad” alternative to USDC, Tether, GUSD, Paxos, and others named in this paper. Until we have a marketing or legal CU onboarded, I ask that you remember the above talking points. We are being given – in writing – a way to avoid the “bank” title, both in the letter and spirit of the law. Maker could be materially harmed if we do not ensure we are consistent in messaging that we are fundamentally different from centralized stablecoins.       williamr:  I think Maker’s safest bet is 1) not to portrait itself as a bank   There is one contradiction that I want to point out here, which we will need to wrap our heads around. Being decentralized doesn’t end with the smart contracts code. It very much applies to how we organize ourselves. And in this regard, there are two realities that we’ll need to deal with:   It makes perfect sense to draw attention to the arguments why Maker is not a bank, and to encourage people to think and talk in this way. I personally agree with these points a lot and will argue for them. However, a decentralized organization cannot have perfectly consistent messaging. That’s what makes it decentralized: it is not defined who is officially a part of Maker and who isn’t, and no one has the authority to enforce consistent messaging across the board. There will be different opinions. No one speaks for Maker, we only speak from our own perspective. Especially this sentence is a contradiction in terms: “Maker could be materially harmed if we do not ensure we are consistent in messaging that we are fundamentally different from centralized stablecoins.” The only way this consistent messaging can be ensured, is by being centralized. Which would make us more like a bank, not less.   This will apply to any marketing or legal core units too. These will just be groups that operate in the Maker ecosystem, and hopefully there will be more than one. They cannot officially speak for Maker. They can only argue from their own positions, describing the protocol and giving their own interpretation of it.   I hope these points do not come across as splitting hairs. Equally important to how the Maker protocol is conceptualized as a bank, or not a bank, is what decentralization means on the ground. Maker is one of the most decentralized protocols today and the community should be proud of this. But the general thinking of the governance community still reflects centralized thinking most of the time. Maker will only survive if it can get rid of this: if you don’t want to be bank, then don’t try to organize like a bank. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.13407738095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#4",
                    "likes": "6",
                    "time": "19/07/2021-08:03:39",
                    "content": "    wouter:  if you don’t want to be bank, then don’t try to organize like a bank   @wouter You’re spot on! I agree 100% with what you bring up here. I really see Maker as a bunch of independent serving nodes. All nodes serve the protocol in some capacity. Verticalisation of activities within one node imo is the equivalent of sending an invitation to the regulator to knock at your door. Saying that, nothing prevents risk teams to adopt some best practices within their own recommended parameters or policies that reflect in some capacity BIS requirements. That wouldn’t be centralisation. It’s simply a base feature of risk management. Not embedding it in risk would be equivalent of not having pragma solidity ^[some version]; in a solidity source file. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                }
            ]
        }
    ]
}