{
    "poll_list": [
        {
            "title": "Adjust DSR Spread Polling Cadence - February 24, 2020",
            "index": "1207",
            "option": "No",
            "supporting_mkr": "30,513",
            "highest_fraction": 0.98
        },
        {
            "title": "Adjust DSR Spread Polling Cadence - March 2, 2020",
            "index": "1207",
            "option": "Yes",
            "supporting_mkr": "27,471",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-reduce-the-frequency-of-the-dsr-spread-governance-poll/1207",
            "title": "Signal Request: Reduce the frequency of the DSR Spread governance poll ",
            "index": 1207,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "meta-governance",
                "dsr",
                "dsr-spread"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "4",
                    "time": "03/02/2020-18:01:12",
                    "content": "It’s been 2 weeks since the switch to the DSR Spread governance poll, and it seems consensus has formed on the 0% and 0.25% options. In the first week 0.25% gathered 72K MKR backing it (99.5% of votes) while in the second week there was a split between 0% and 0.25% with 0.25% narrowly winning. In both cases nearly 100% of the vote went to the 0% and 0.25% options which leads me to believe MKR holders want to keep the DSR close to the MCD SF on an ongoing basis. In order to reduce the effort required for engaged voters, I propose we reduce the frequency of the DSR Spread governance poll. I’ve listed some options below:     Keep the DSR Spread poll frequency at 1 per week One DSR Spread poll per 2 weeks One DSR Spread poll per 3 weeks One DSR Spread poll per 1 month One DSR Spread poll per 2 months One DSR Spread poll per 3 months Abstain (I want to see results) Abstain (I have no opinion) Abstain (I don’t feel I am knowledgable on the subject) Abstain (I disagree with the poll options) Abstain (I have a different objection)     0 voters     This is a multiple choice poll, vote for  everything  you are willing to vote for in an on-chain vote. Poll will close on  February 13th, 2020 at 11:00 AM EST to be reviewed during the weekly governance call.  ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-february-13-9am-pst-5-00-pm-utc/1259/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-february-27-9am-pst-5-00-pm-utc/1365/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-march-5-9am-pst-5-00-pm-utc/1391/2"
                    ],
                    "GPT-summary": "The author proposes to reduce the frequency of the DSR Spread governance poll, as consensus has formed on the 0% and 0.25% options. The author lists several options for reducing the frequency of the poll and invites readers to vote in a multiple-choice poll. The post does not contain any advertising or collaboration requests, and there is no third-party feedback on the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.518518518518518
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "2",
                    "time": "03/02/2020-18:09:21",
                    "content": "It would be great if somebody from Maker development could comment on the idea of using a fixed % of SF fees to pay the DSR interest rate. See Why SF = DSR ? Request for discussion ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "3",
                    "time": "03/02/2020-19:48:13",
                    "content": "There is one thing that could happen with a fixed % of the SF going to the DSR. As @SamM commented in another discussion we had regarding this coupling of the DSR to the SF via the DSR-SPREAD he has a real concern about the DSR rate going above the SF rate as this would cause people to max out the debt limit. One could easily see a situation where using a fixed % of the SF going to the DSR to lead to an effective DSR rate that is higher than the GSF.   (I looked at these scenarios and think they are managable if the rates are set to a utilization curve both on the borrow and supply sides.) I have some other issues regarding system control variables being grouped that can lead to similar unexpected operational hazards.   Example is using the DSR-SPREAD.    Lets say the DSR-SPREAD is 4% and the SF is 8%.    Dropping the SF to anything below 4% would REQUIRE the DSR-SPREAD to change otherwise the DSR rate would come up negative in such a governance vote. Which leads to a suggestion for governance no matter how these are polled for.  List governance changes and then the actual operational changes they are going to exhibit in the governance poll. Example SF 10%, DSR-SPREAD 2% means SF 10% and DSR 8%.   In the case  I give above where the SF is 8% and the DSR-SPREAD is 4% that if in the list of polling options for SF below 4% and DSR-SPREAD 4% that this would lead to a negative DSR rate and hence are invalid choices. It is exactly these kinds of details that people have to keep in mind when coupling important system variables, as ignoring that the DSR will change when the SF changes, may lead to unintended and unexpected system or behavioral consequences.  I am considering making a seperate post on this. My point here is that even with SF at 8% and DSR at 4% there could be a very real difference between lowing the SF from 8-4% that is vastly different than lowering the DSR from 4%-0% at the same time.   Contrast this same situation with the SF at 12%, DSR-Spread at 4% (SF=12, DSR=8) and lowering the SF to 8% (SF=8, DSR=4).   This 4% SF drop acts very differently as one lowers the DSR to 0 the other by 50% to 4%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.404861111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#4",
                    "likes": "1",
                    "time": "03/02/2020-20:04:21",
                    "content": "One thing to note is that the spread converts to the DSR via the formula: max(GSF - DSR Spread, 0) so it will never be negative. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "1",
                    "time": "04/02/2020-00:02:38",
                    "content": "@hexonaut I kind of hoped there would be a formula that would effectively limit the DSR to not be negative but still not sure how this would work with polls and executives. Is this now a general feature in the governance code that any DSR-spread value coupled with GSF that would lead to a negative DSR value effectively zero’s it (i.e. it is valid from a voting perspective even if the system just zero’s the DSR rate as a result)?? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7142857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#6",
                    "likes": "1",
                    "time": "04/02/2020-00:04:23",
                    "content": "Yes it would zero the result as per the wording in the governance poll that passed to make this switch. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "1",
                    "time": "04/02/2020-14:19:28",
                    "content": "So my opinion on this is that it doesn’t really matter a whole bunch at this stage. We still need to be voting weekly for the SF, voting a second time is very little extra friction. That said, in principle I agree with reducing governance overhead, so I also voted to reduce the voting to sensible intervals. The only options I didn’t vote for were 3 week intervals and 2 month intervals, as these intervals are non-standard choices that I think may confuse more than help, especially 3 weekly. I recognise that this is a fairly ridiculous reason to vote against them, but sue me, I like it when things are well structured and organised. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.179398148148148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#8",
                    "likes": "3",
                    "time": "04/02/2020-14:24:01",
                    "content": "It would be neat if I could vote on all the week’s polls with a single transaction. In fact, I’d like to see polls presented as a control panel, like https://www.shutterstock.com/image-photo/central-control-room-nuclear-power-plant-1054177697 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#9",
                    "likes": "3",
                    "time": "04/02/2020-22:04:32",
                    "content": "Huge fan of reducing cadence of the dsr spread. The whole point of the spread is that it should lower our cognitive overhead, and this is a great next step. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#10",
                    "likes": "0",
                    "time": "05/02/2020-14:14:11",
                    "content": "I agree with reducing the DSR poll interval but I’d like to see another vote instead - the threshold when the vote to increase the debt ceiling must be activated (utilization = 80% | 85% | 90%…). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#11",
                    "likes": "1",
                    "time": "07/02/2020-07:20:47",
                    "content": "I selected 1 week. While I agree with general idea of making this vote less frequent I think it is much to soon. We should wait until participation increases and result of vote stabilize. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#12",
                    "likes": "3",
                    "time": "14/02/2020-17:25:47",
                    "content": "The poll has now closed with a 53% majority support for “One DSR Spread poll per 1 month”. Due to “One DSR Spread poll per 2 weeks” coming in with 50% of the vote I had to make a choice between 2 options:  Run a governance poll with the normal Yes/No question. Run a governance poll with 3 options of 2 weeks, 1 month and status quo.  I opted for option 1 as option 2 runs the risk of a minority status quo vote incorrectly taking the win. This would happen in the case where the majority wants a DSR Spread reduction, but the Yes vote gets split such that status quo wins out. Ideally, I wanted to run this as a ranked choice poll to solve the problem of the vote split, but we do not have support for that (yet). I will be making a new thread soon to gather support for adding ranked choice to the governance portal in cases such as this where it is a clear win. Here is a description of the vote for @rich.brown to add to the voting portal:  Title: Should we reduce the frequency of the DSR Spread governance poll to once per month? Description: If passed, the frequency of the “Dai Savings Rate Spread Adjustment” governance poll will be reduced to one poll per month. The poll will only be added on the first Monday of every month. The relative start and end times for the poll will remain unchanged. Background and discussion: Signal Request: Reduce the frequency of the DSR Spread governance poll Options: Yes/No ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.137121212121213
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#13",
                    "likes": "2",
                    "time": "14/02/2020-20:28:33",
                    "content": "There was a 3% difference and you opted not to include 2 weeks? I don’t think that slim of a margin allows you to unilaterally make that decision in my opinion. Instead of allowing the on-chain poll to have the possibility of a split vote, you have taken it upon yourself to make that decision instead, which in my opinion is actually worse than if it was split. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 2.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#14",
                    "likes": "0",
                    "time": "14/02/2020-20:39:29",
                    "content": "The rules on this aren’t exactly clear as we haven’t had this situation before. My original thought process was similar to yours. Who am I to make this unilateral decision? I talked it over with @LongForWisdom and he gave me the view that since the poll is multiple choice it is not so much this option vs that option, but more the options that the majority are most okay with. Personally I don’t really like any of these decisions and would prefer ranked voting with 3 choices. I would say that if people don’t like my unilateral decision on this then by all means vote no. I don’t think this is a particularly contentious vote. If 1 / month is too infrequent we can always raise it again. I would like to make ranked choice available in the future to solve this type of problem. This is definitely not going to be the last poll with no clear winner. EDIT: Maybe a temporary alternative can be to run 2 polls? Status Quo vs DSR Spread Frequency Reduction and the second poll being 2 weeks vs 1 month. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.49780701754386
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#15",
                    "likes": "1",
                    "time": "14/02/2020-20:53:14",
                    "content": "Waiting to hear back from @rich.brown if we can do 2 polls. If we can then it should solve all the issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#16",
                    "likes": "0",
                    "time": "14/02/2020-21:41:09",
                    "content": "So to speak to this some. Both of these options have over 50% support. Meaning both of them would be valid ways forward. Given that one is slightly ahead, it makes sense to me to favor that one (even if the margin is small) I presented a couple of options for this:  One poll on-chain with both consensus options and the status quo. One poll on-chain with the highest consensus option vs the status quo. Have a second forum poll which was single choice between 2 weeks vs. 1 month to determine which the community favors.  Sams’s suggestion to have two on-chain polls is a fourth option that I didn’t consider. In my view Option 2 is still best here. The way to read the outcome of this poll is that over half of the community are happy to move to either a 2 week or 1 month cadence for the DSR poll. Since slightly more of the community are happy with a 1 month cadence, this is the option that is most likely to pass in an on-chain vote, and is therefore the option that should move on-chain. Putting both on-chain would set a precedent that I am slightly unsure about. What is the rule we would be following:  All options with greater than 50% go on-chain in some form? Options go on-chain if they are either win, or are ‘close to the winner’?  Would we still be advocating for both to go on-chain if one option had 70% and the other 50%? Probably not, imo, we would go for 70%. Which means rule 1 is a bit sketchy.  Rule 2 also seems sketchy for what I hope are obvious reasons. In this situation it may have been wiser to extend the poll for some time and attempt to bring a higher level of consensus to one of the >50% options. Obviously this has the downside of taking longer and asking for additional engagement though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.050892857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#17",
                    "likes": "1",
                    "time": "14/02/2020-23:25:26",
                    "content": "It is a tricky situation because you make a good point about if the difference was 50% vs 70%. This brings into question where the threshold is determined to be and who gets to decide that. The one thing I continue to come back to is the fact that these votes are such a small subset of the actual voters that I worry about how that translates to on-chain actions. By this I mean I’m not sure the forum votes will always be representative of what MKR voters ultimately want/decide. By keeping the most options open we can give MKR voters the greatest breadth of options while at the same time culling the options that are the most unpopular. I’m not sure what the golden rule on all this should be but I’m sure these conversations will continue evolving and as it stands right now it seems to be somewhat up to the poll creators discretion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.800945378151261
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#18",
                    "likes": "1",
                    "time": "15/02/2020-11:18:42",
                    "content": "I don’t really see an issue with running a >= 3 option governance poll if and when we get support for ranked choice voting. If not for this case then for one where two options exactly tie. Also, regarding what is the threshold to put both options on chain. In my view the forum poll consensus is a very rough mechanism to see what people like. There is no Sybil protection, and I don’t think we will be protected by good will forever. I think trying to come up with some rigid criteria that specifies what should and shouldn’t go on chain is not particularly helpful. I think it’s up to the poll creator to find that balance. If they do a bad job then their proposal should be voted down in governance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.057936507936508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#19",
                    "likes": "1",
                    "time": "24/02/2020-17:11:49",
                    "content": "Vote is up: https://vote.makerdao.com/polling-proposal/qmxvvzb6uei1jawvtxentsbreepfkuzsohaefpw6j4vpn5 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "1",
                    "time": "25/02/2020-15:01:07",
                    "content": "Interestingly, this is currently losing on-chain. Two large holders are currently voting against this change.  image840×372 17.3 KB  No idea if either of you are present on the forum, but it might be good to get some discussion going as to the arguments against this cadence change. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.178571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#21",
                    "likes": "0",
                    "time": "25/02/2020-16:00:49",
                    "content": "Hm, my speculation is that there are some small whales, who are diligent voters, who want to increase the DSR spread away from zero. There are also other larger MKR holders, who are not inclined to vote, who prefer the DSR spread at zero. So the diligent voters want the frequent opportunity to move the DSR spread away from zero. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#22",
                    "likes": "2",
                    "time": "25/02/2020-17:53:02",
                    "content": "I agree the one whale with 10k MKR is trying to do this. I’ve seen him vote for spreads of 2% and get denied by the other whales. I really wish we had some way to sign a message when you vote to give a reason for voting against. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#23",
                    "likes": "0",
                    "time": "26/02/2020-08:54:48",
                    "content": "    hexonaut:  I really wish we had some way to sign a message when you vote to give a reason for voting against.   That’s almost certainly very easy for the whale to do (i am quite certain they are technically proficient). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.22202380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#24",
                    "likes": "2",
                    "time": "26/02/2020-16:07:06",
                    "content": "I more meant a way to provide/display this in the governance UI. IE pick your choice and optionally add a message. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#25",
                    "likes": "2",
                    "time": "27/02/2020-00:22:05",
                    "content": "Well, 1 month is quite the commitment, on a topic that mkr voters have not been able to form consensus on yet.There’s been lots of volatility on it. (2 weeks would have more support, not sure if it’d get 50% support though) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#26",
                    "likes": "0",
                    "time": "27/02/2020-09:02:42",
                    "content": "I agree with those voting NO. There is too much ignorance when voting for various parameters and it’s better to be able to fix the system weekly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#27",
                    "likes": "1",
                    "time": "27/02/2020-09:02:46",
                    "content": "    hexonaut:  I more meant a way to provide/display this in the governance UI. IE pick your choice and optionally add a message.   If any whale would REALLY want to tell us his voting rationale, he would just need to login to the rocket chat or this forum and tell us.  Or just append rationale text  to the signed (voting) transaction message and i assume somebody would notice.  Also, voters adding messages might joke/troll a lot etc… We might get a high ratio of noise/signal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#28",
                    "likes": "0",
                    "time": "27/02/2020-20:38:37",
                    "content": "The one month frequency reduction has been voted down: https://vote.makerdao.com/polling-proposal/qmxvvzb6uei1jawvtxentsbreepfkuzsohaefpw6j4vpn5 As discussed in the Feb 27th governance call, I’m adding an additional vote to see if 2 weeks is desirable for frequency reduction.  Title: Should we reduce the frequency of the DSR Spread governance poll to once every two weeks? Description: If passed, the frequency of the “Dai Savings Rate Spread Adjustment” governance poll will be reduced to one poll every two weeks. The relative start and end times for the poll will remain unchanged. Background and discussion: Signal Request: Reduce the frequency of the DSR Spread governance poll Options: Yes/No ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-reduce-the-frequency-of-the-dsr-spread-governance-poll/1207"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#29",
                    "likes": "2",
                    "time": "28/02/2020-03:58:42",
                    "content": "Can we use this as a template for polls? It’s a direct copy of the source I need to enter into the admin tools. --- title: Adjust DSR Spread Polling Cadence - February 24, 2020 summary: In order to reduce the effort required for engaged voters, this proposal would reduce the frequency of the DSR Spread governance poll to once a month. discussion_link: https://forum.makerdao.com/t/1207 poll_rules: The voter may select to vote for one of the poll options or they may elect to abstain from the poll entirely options:    0: Abstain    1: Yes    2: No --- # Poll: Should we reduce the frequency of the DSR Spread governance poll to once per month?  If passed, the frequency of the \"Dai Savings Rate Spread Adjustment\" governance poll will be reduced to one poll per month. The poll will only be added on the first Monday of every month. The relative start and end times for the poll will remain unchanged.  This Governance Poll ([FAQ](https://community-development.makerdao.com/makerdao-scd-faqs/scd-faqs/governance)) will be active for three days beginning on Monday, February 24 at 5 PM UTC, the results of which may inform an Executive Vote which will go live on Friday, February 28, at 5 PM UTC.  ## Review  This proposal was discussed in the [forums](https://forum.makerdao.com/t/signal-request-reduce-the-frequency-of-the-dsr-spread-governance-poll/1207). Please review the [Video](https://www.youtube.com/playlist?list=PLLzkWCj8ywWNq5-90-Id6VPSsrk4OWVan), [Audio](https://soundcloud.com/makerdao/sets/governance-and-risk), [Transcript](https://community-development.makerdao.com/governance/governance-and-risk-meetings/transcripts) and the online [discussion](https://forum.makerdao.com/c/governance) to inform your position before voting.  ## Next Steps  - If this proposal passes, DSR SPread polls will be introduced into the voting portal during the first Monday of every month. ---  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.701515151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#30",
                    "likes": "3",
                    "time": "28/02/2020-13:20:53",
                    "content": "So to add some context to this, the reason we are adding the 2 weeks option on-chain is because it also had 50% of votes in favour and the preferred option (1 month) failed on-chain. This seems like a reasonable precedent to set: If there are multiple options with a majority greater than or equal to 50%, they should be put on-chain consecutively, ordered by size of majority (highest to lowest) until one one of the on-chain polls passes. We could think about doing these simultaneously in the future, but for the time being, the above precedent seems reasonable. If anyone has any comments on this, please feel free to discuss. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.444444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#31",
                    "likes": "0",
                    "time": "28/02/2020-20:42:24",
                    "content": "I opened a pull request: https://github.com/makerdao/community/pull/448 If you still prefer me to send the text on here I can do so. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#32",
                    "likes": "1",
                    "time": "06/03/2020-19:16:40",
                    "content": "Ah, assuming the current executive doesn’t pass, we finally got DSR spread locked at 0% for two weeks. I’m tired of watching 10k MKR keep trying to move the DSR spread away from 0%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving entirely negative feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#33",
                    "likes": "0",
                    "time": "09/03/2020-14:11:18",
                    "content": "Gah, how do I vote for the current hat to help prevent https://vote.makerdao.com/executive-proposal/set-the-dai-savings-rate-spread from passing? The current hat is not listed on https://vote.makerdao.com ",
                    "links": [
                        "https://vote.makerdao.com"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#34",
                    "likes": "1",
                    "time": "09/03/2020-14:52:20",
                    "content": "Hi @psychonaut , you can find the current hat on the chief.makerdao.com site, …by scrolling all the way to the bottom of the page you will see …dd170, and can click “vote this”, upon which you will see the MKR weight reflected above in the weights. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#35",
                    "likes": "0",
                    "time": "09/03/2020-14:54:58",
                    "content": "…we should have a discussion on the Governance call to determine if we want to show current hat in addition to current system parameters…and the new spell as well ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.227272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#36",
                    "likes": "1",
                    "time": "09/03/2020-14:55:17",
                    "content": "Poll for 2 week cadence has passed the on-chain vote with 27,470.99 MKR (100%) supporting yes. Closing this thread. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#37",
                    "likes": "0",
                    "time": "16/03/2020-14:55:21",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "422"
}