{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-adjust-the-zrx-and-knc-risk-premiums/3181",
            "title": "[Signal Request] Adjust the ZRX and KNC Risk Premiums ",
            "index": 3181,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "rates",
                "zrx",
                "knc"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "2",
                    "time": "11/07/2020-16:40:55",
                    "content": "While ZRX and KNC have been live as collateral types for some time, they have seen limited utilization. Currently there is 311,000 DAI from KNC and 11,000 DAI from ZRX, far below their 5 million DAI debt ceilings. Governance has shown a willingness to subsidize risk from certain collateral assets (ETH and BAT both at 0% risk premium). Extending this with incremental changes to the ZRX and KNC risk premia may lead to additional DAI generation and help the peg. The risk team prepared initial assessments which recommended the current parameters for each asset of 5 million DAI debt ceiling, 175% liquidation ratio, and 4% risk premium: ZRX Risk Assessment KNC Risk Assessment  Adjusting the ZRX Risk Premium     Greater than 4% 4% (current value) 3.75% 3.5% 3% 2% 1% 0%     0 voters      Adjust the KNC Risk Premium     Greater than 4% 4% (current value) 3.75% 3.5% 3% 2% 1% 0%     0 voters     Polls will run for ~2 weeks from July 11 to July 25. Please leave any thoughts or comments below! ",
                    "links": [
                        "https://forum.makerdao.com/t/knc-mip12c2-sp2-collateral-onboarding-risk-evaluation/2732",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-102-thursday-july-23-9am-pst-4-00-pm-utc/3246/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-101-thursday-july-16-9am-pst-4-00-pm-utc/3145/2"
                    ],
                    "GPT-summary": "The author of the proposal is requesting feedback on adjusting the risk premiums for ZRX and KNC as they have seen limited utilization. The risk team has provided initial assessments and the author is asking for thoughts and comments on the proposed changes through a poll that will run for two weeks.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.262175324675324
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/07/2020-17:45:53",
                    "content": "As a KNC Vault user I’m not sure that lowering the RP will have a large effect. Aave is the only other lending platform for KNC and borrowing USDC/DAI is over 6%. As for ZRX, compound also has that and suppliers are receiving 3.95% right now on top of what they get for borrowing DAI/USDC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.520833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#3",
                    "likes": "0",
                    "time": "11/07/2020-21:08:34",
                    "content": "Does that include COMP rewards?  It looks like ZRX is 2.38% supply side.  In practice, it would be good to be a few basis points below competition. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/07/2020-21:16:35",
                    "content": "I was referring to this https://compound.finance/governance/comp ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#5",
                    "likes": "10",
                    "time": "13/07/2020-14:33:02",
                    "content": "I voted to keep the status quo. If we are interested in subsidizing risk we should be doing so via a negative Base Rate, and not tweaking the individual Risk Premiums. Risk Premiums should reflect the amount of bad debt that the risk domain team believes we need to cover. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 3.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/07/2020-16:05:47",
                    "content": "Generally I agree, but in practice I don’t think BAT is less risky than ZRX or KNC and it has much looser risk parameters. Maker may want to similarly favor other non-custodial assets over USDC and WBTC. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#7",
                    "likes": "3",
                    "time": "13/07/2020-16:15:59",
                    "content": "The only reason BAT is at 0% is because it was part of the MCD launch and went with ETH SF when we dropped everything to 0 from Black Thursday. BAT should definitely be raised up to similar levels of KNC/ZRX. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#8",
                    "likes": "2",
                    "time": "13/07/2020-16:45:20",
                    "content": "BAT should be removed/ignored as a collateral in the system imo. So few people use it it’s honestly not worth governance bandwidth to change the risk parameters. And besides, raising the rate will only make it less significant as a collateral type. KNC has grown fast enough that it seems like it could be a promising collateral type if we lower the SF. I think there’s a balance to be had between fully compensating for risk and using the tools we have to incentivize people borrowing against these smaller assets. If an asset doesn’t have much demand, we should try to get people to use it, or we should remove it as collateral. It’s important to focus on high impact actions. If we had negative rates implemented, I would say BAT should even have a negative rate to get people to borrow against it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.149404761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#9",
                    "likes": "2",
                    "time": "13/07/2020-21:29:44",
                    "content": "Agree 100% with Hexonaut. Negative Base Rate is the place where adjustments should be made. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#10",
                    "likes": "1",
                    "time": "18/07/2020-01:46:06",
                    "content": "    befitsandpiper:  I think there’s a balance to be had between fully compensating for risk and using the tools we have to incentivize people borrowing against these smaller assets. If an asset doesn’t have much demand, we should try to get people to use it, or we should remove it as collateral. It’s important to focus on high impact actions. If we had negative rates implemented, I would say BAT should even have a negative rate to get people to borrow against it.   Kind of wanted to second this. There seems to be some appetite for KNC leverage and especially given the protocols current revenue situation it seems wise to bring in revenue where we can get it. Probably too late to get people to change their votes but would love to see some experimentation made to the KNC RP to see how it ultimately ends up affecting the amount of DAI borrowed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5928571428571425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#11",
                    "likes": "2",
                    "time": "21/07/2020-18:02:58",
                    "content": "Wanted to give this thread a quick bump. Voting in the signal polls will be open for 4 more days. If there is a clear consensus for change in one or both of the polls, I’ll work with governance facilitators to bring the poll on chain. If consensus is not reached, or the majority prefer to maintain the status quo, then no additional action will be needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.033333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#12",
                    "likes": "0",
                    "time": "24/07/2020-16:48:56",
                    "content": "From some of the discussion in this thread, I’ve decided to add a Signal Request to Raise the BAT Debt Ceiling and Adjust the Risk Premium.     [Signal Request] Adjust the BAT Risk Premium and Debt Ceiling Governance       KNC/ZRX Vaults were recently launched with 4% Risk Premiums and a 5m debt ceiling. BAT currently has a 0% Risk Premium and 3m debt ceiling. The main reason why Risk/Governance has decided to subsidize the BAT Vault in the past is because of its inclusion in the MCD launch.  Pros:   Stop subsidizing the BAT vault. The Risk Premium will be more in line with other collateral. More DAI can be generated from BAT  Cons:   A Risk Premium increase may make DAI generation from BAT too unattractive. Lower…     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.565476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#13",
                    "likes": "3",
                    "time": "25/07/2020-16:36:04",
                    "content": "I’ve closed the polls in this thread. A majority of participants voted to keep the current 4% risk premia for ZRX and KNC, so no changes are required. Thanks everyone for voting, and please take a look at the BAT signaling thread as well! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "0",
                    "time": "01/08/2020-16:36:05",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}