{
    "poll_list": [
        {
            "title": "Inclusion Poll for Declaration of Intent - Off-Chain Asset Backed Lender to onboard Real World Assets (MIP13c3-SP4)- October 12, 2020",
            "index": "3914",
            "option": "Yes",
            "supporting_mkr": "30,694",
            "highest_fraction": 1.0
        },
        {
            "title": "Add RWA-001 (6s Capital) as a Collateral Type - November 30, 2020",
            "index": "3914",
            "option": "Yes",
            "supporting_mkr": "54,786",
            "highest_fraction": 0.99
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip13c3-sp4-declaration-of-intent-commercial-points-off-chain-asset-backed-lender-to-onboard-real-world-assets-as-collateral-for-a-dai-loan/3914",
            "title": "MIP13c3-SP4 Declaration of Intent & Commercial Points - Off-Chain Asset Backed Lender to onboard Real World Assets as Collateral for a DAI loan ",
            "index": 3914,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "collateral",
                "collateral-onboard",
                "real-world-finance",
                "mips",
                "maker-representative",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#1",
                    "likes": "17",
                    "time": "01/09/2020-20:07:28",
                    "content": "MIP13c3-SP4 Declaration of Intent & Commercial Points - Maker Governance Intends to Utilize an Off-Chain Asset Backed Lender to onboard Real World Assets as Collateral for a DAI loan Preamble MIP13c3-SP#: 4 Author(s): Matthew V Rabinowitz (@mrabino1 or [email protected]) Contributors: n/a Status: Accepted Date Proposed: 2020-09-01 Date Ratified: 2020-10-27 --- Declaration Statement: Maker Governance Intends to Utilize an Off-Chain Asset Backed Lender to onboard Real World Assets into the Maker Protocol to borrow DAI and deploy in the “Real World”. Declaration to Replace: n/a  Specification Context and Motivation As the MKR protocol evolves and new collateral is added to the collateral portfolio, there is a direct need to diversify away from on-chain crypto assets and bring in uncorrelated “Real World Assets” (especially collateral that is backed with credit quality). Furthermore, in addition to bringing stability, an economically motivated independent real world party and sound legal structure will add liquidity to the DAI ecosystem helping to tame the DAI price and use market forces to pull it towards its reference currency, the US Dollar. In doing so, a series of legal structures will be used to secure protections for MakerDAO to allow the lending of DAI to LendCo (an off-chain asset backed lender). This DAI will be converted to USD, and the USD, along with equity that LendCo has and will continue to raise, will then be used by LendCo to provide secured loans to willing Borrowers (“BorrowCo”). Declaration MakerDAO desires to engage 6s, as an off-chain asset backed lender, to cause the addition of a new collateral type (real world assets) along with new roles that would need to be filled from a person(s) / entity nominated by MKR holders. As an off-chain asset-backed lender, 6s would then engage the MKR community in a compliant way to execute a revolving credit facility loan agreement to help bring DAI loans to the “real world,” complementing the business operations of 6s. 6s would then fundamentally put a revolving credit facility loan agreement inside a trust for the benefit of MakerDAO. As a result, MakerDAO will need to create a new role (or expand the roles of others) of a “Maker Representative(s)” as a person and/or legal entity that will be authorized to sign the legal documents necessary to set up the real world side of the transaction including, sponsoring the trust and engaging the regulated Trust Company that will serve as trustee of the trust. Please see the rest of this document for all supporting documentation, reference links, and associated historical posts. Supporting Materials   Introduction to 6s   How is this different?   The Maker Representative   The Legal Structure + Compliance   Core Operative Documents   Oracles   Liquidations   Capital Flow   Real World Asset module   Why is this important?   Time Horizon   Legal Structure Selection   6s Capital LLC (“6s”) / Maker Community (“MKR”)   Matthew Rabinowitz’s Bio   Projects First in Line   General Next Steps   Introduction to 6s 6s Capital LLC & 6s Capital Partners LLC (together “6s”), Delaware USA, along with any future international tax optimized feeder structures 6s works with multiple commercial real estate developers throughout the United States. Those developers build buildings that include a long-term lease. 6s provides secured loans equal to 100% Loan-to-Cost for construction and the underlying real estate acquisition until completion. Those buildings are customized (build-to-suits) and ground leases for Credit Tenant Leases. Specifically: Real-Estate —Commercial -----Credit Tenant Lease -------Single-Tenant Net Lease Construction Time Lapse for an already-completed project - Sample 6s was born during the COVID-19 banking credit squeeze when its sister company, 6s Development LLC, had challenges with banks no longer wanting to provide credit. The principals of 6s Development LLC have been doing Credit Tenant Lease development for 15 years and have built well over a thousand locations. 6s Capital LLC aims to permanently replace and ensure a future is built on a financial foundation of rock, not sand. None of the locations built by 6s Development have defaulted. How is this different? MakerDAO as a credit facility fundamentally provides credit in exchange for risk-adjusted ability to foreclose on assets used as collateral. In this context, MakerDAO would be bringing on “Real World Assets” as collateral, and in doing so, how liquidations would be caused/triggered needs to be adopted for this context. In the real world, a digital oracle to automate the decision of whether a “breach” has occurred that would then trigger a liquidation will not work. 6s and MKR governance* first must agree on the type of real world events that would trigger a liquidation of a loan to 6s. The most common would be a breach of a covenant by 6s. A digital oracle cannot walk into a court of law and file a breach of contract claim or a foreclosure claim against 6s. Only a “person” with standing to sue in Court can do that. MakerDAO and 6s can agree on the obligations/requirements/covenants and memorialize those terms in a vote, but those same agreed terms must next be memorialized in a written credit facility agreement that is signed by a real “person” to be enforced by law in the real world. (as opposed to purely numeric with a pricing oracle) or code. Note: As MKR Governance itself cannot execute a legal document, MKR Governance will need to appoint and nominate one (or more) “Maker Representatives” (natural persons or legal entity). The “Maker Representatives” will first sign the written agreements necessary to execute the understanding between 6s and MakerDAO and will require approval by a vote of MakerDAO governance members. This same authorized Maker Representative will be expected to carry out duties assigned to it by MakerDAO itself. For example, one responsibility will be to set up the trust and hire the trustee, which will require signed physical written agreements. Another duty will be informing the trustee what MakerDAO expects the trustee to do. Another duty might be to review the reporting/reports from 6s or the trustee of the trust to attest to the community whether or not 6s remains in compliance with the revolving credit facility agreement. Other duties will be general real world administrative matters that cannot be decentralized or automated on a blockchain. This representative will be an indemnified role. The Maker Representative • Appointed by MakerDAO • Given specific written authority by MakerDAO to take only particular actions approved by MakerDAO • Sign real world legal documents on behalf of MakerDao as needed to carry out the will of MakerDao in the real world with respect to the DAI being lent and the approved real world collateral being received • Represent the will and the rights of MakerDAO • Sponsor the formation of the Trust for the benefit of MakerDAO • Engage and instruct the Trust Company to be the Trustee of the Trust • Instruct the Trustee to execute the revolving credit facility agreement and other documents between the trust and LendCo in accordance with the authority approved by MakerDAO • Oversee movement for DAI from MakerDAO to the Trust (through a series of steps) • Oversee exchange of DAI to USD • Oversee Trustee actions • Review reports from 6s and/or trust and attest to the revolving credit facility agreement’s compliance by 6s and compliance of the trust agreement by the trustee to the MKR community. • If also a legal entity, the Maker Representative Entity (“MRE”) and the TFE could be the same. Further, it is the TFE that will provide the actual DAI to the Trust. Pursuant to the terms of the revolving credit facility agreement, 6s and MKR governance would agree on a set of reporting requirements that 6s would be required to deliver to a Maker Representative quarterly (with some spot inspection rights). Should 6s be in breach of the agreement, and all cure periods have expired, the Maker Representative would report this information to MakerDAO. After that, MakerDAO would and should liquidate the vault and instruct the Maker Representative to notify the Trustee to commence real world liquidation on 6s loans (which would then wind-down the affairs of 6s and sell any remaining assets). All USD proceeds would then be delivered to the Trust to repay the loan of 6s; the trustee would convert the USD to DAI and return the DAI to MakerDAO. The Legal Structure + Compliance Compliance includes, but is not limited to:  Annual audited financial statements of 6s Quarterly Independently reviewed financial statements List of all outstanding loans  In construction Performing Non-performing Equity Requirement Reports per loan    The Maker Representative’s role will be to report on compliance of 6s and execute the operative documents between 6s and MKR holders. However, MakerDAO could decide to assign other duties to the Maker Representative. Further, and subject to MKR consent, a legal entity is also recommended to hold a Maker Representative role, which may also be the Tax Favorable Entity (“TFE”), providing the DAI loan proceeds to the Trust, thus consolidating the two. Subject to legal & tax requirements, verification, and MKR discussion, a Cayman Islands legal entity may be recommended.  https://www.treasury.gov/resource-center/tax-policy/treaties/Documents/FINAL%20US%20-%20Cayman%20Islands%20-%20Cayman%20alternat.pdf Withholding exemptions to cross border interest payments. - Wagner Duys and Wood  Regardless of the jurisdiction, that Maker Representative Entity (“MRE”) would be the party authorized by MakerDAO to sponsor of the Trust and cause its formation and engagement with the Trustee, a regulated Trust Company. This Maker Representative Entity shall also serve as an administrative role (e.g., paying bills/questions about MKR governance, etc.). To clearly define the MRE role, MakerDAO should assign the MRE duties and approve them in the vote. Thus, all parties (6s, MakerDAO, the trustee, auditor, etc.) know precisely what the MRE can and cannot do on behalf of MakerDAO. Also, the trust agreement will include provisions stating that:  Underlying trust agreement cannot be changed without a vote from MakerDAO community with notice of the vote delivered to the trustee Underlying trust agreement cannot cause a liquidation without getting direction from the MakerDAO from etherscan.io or vote.MakerDAO.com  Underlying trust agreement allows that an MKR vote (vote.MakerDAO.com) can replace the MRE at its sole discretion and will notify the trustee of this change.  As contemplated, the Trust should have minimal taxation as the TFE / Maker Representative Entity would receive the taxable interest income. After the final jurisdiction of the TFE is determined, someone / some group in the community, in collaboration with Matthew Rabinowitz and with local counsel, will form the entity (or cause it to be created). The TFE will explicitly not be run / owned / affiliated with LendCo or its officers. Core Operative Documents  Revolving credit facility agreement (between 6s and Trust for benefit of MakerDAO) Promissory note and security documents (between 6s and Trust for benefit of MakerDAO) Trust Agreement (between the sponsor, the Trust and the Trust Company, as trustee and with MakerDAO and trust beneficiary.)  As this structure may exist for decades, a Trustee is being engaged to follow the Trust Agreement in the event of a 6s breach or MKR liquidation of the vault. This ensures that the liquidation proceeds are held “in-trust” in favor of the beneficiary of the Trust (which shall be the same smart contract as outlined above under how LendCo would repay its debt). Diagram of Operative Documents and Flow 722×402 40.9 KB 1141×1600 72.7 KB 2020-09-24_16-21-491148×1636 85.5 KB 2020-09-24_16-20-262222×1846 425 KB Oracles No data feed Oracle for this collateral type. However, the revolving credit facility agreement will have data reporting requirements maintained to remain in compliance and keep MKR governance from liquidating the vault. The Maker Representative shall be the “trusted” interface between 6s, the trustee, and the MKR governance. Fundamentally, this reporting shall comprise an “analog oracle.” The foregoing notwithstanding, the 6s team will actively communicate with the community in addition to the Maker Representative. Further, a Technical MIP is being submitted for review. Please see the reference section at the bottom of this document. Liquidations The Trustee (a regulated Trust Company) will follow the Trust Agreement and the revolving credit facility agreement established for this transaction. If given a liquidation signal from MKR governance, it will liquidate all assets pursuant to the revolving credit facility agreement and the trust agreement for the benefit of the trust beneficiary and deliver proceeds to pay down the Vault balance. Capital Flow   Mint new DAI to TFE   TFE lends DAI to Trust  Send DAI to a U.S. broker-dealer FBO the trust (Ethereum address) Trustee instructs broker-dealer to exchange DAI for USD inside the trust account with the broker-dealer Trustee instructs broker-dealer to transfer USD to a bank account in the name of the trust    Trust lends USD to LendCo (1*)  Send to title company in escrow for a closing between LendCo and its borrower    LendCo conduct lending operations and either repays the loans to the Trust or recycles the capital back into another approved scope transaction   LendCo repays the Trust in USD (1*)  Trustee wires USD to trust’s account with broker-dealer and instructions BD to exchange USD for DAI The Trust repays DAI to the TFE (Ethereum address)    The TFE repays DAI to the vault    Real World Asset module The below structure contemplates FIVE fundamental levers that MKR governance can control to influence LendCo’s behavior:  Aggregate Debt Ceiling Risk Premium - Interest Rate Scope (may be modified by MKR governance ratification of a LendCo request) Equity Requirement per LendCo transaction (may be modified by MKR governance ratification of a LendCo request) Liquidation  Given the operational business needs of LendCo and the possible (if not likely) need to tweak parameters for the benefit of DAI stability, the frequency surrounding modifications should be on a weekly cycle with proper forum posts in advance. Once the legal entities and legal contracts are in place, MKR Governance need only modify the five levers above to control / incentivize LendCo (regardless of how many BorrowCos are behind LendCo). Why is this important? This proposal for the community introduces a new market force to help stabilize the DAI ecosystem. Further, it is a natural counterbalance to helping push DAI to its reference currency, the US Dollar. By introducing an external economically incentivized third-party, further liquidity will be added using an approved “capital sink.”  It is critically important that any DAI that overflows into this structure for Real World Asset Backed Loans have the community’s pre-approval for credit quality. A “capital sink” or a “capital battery” in this context means a known holding “pool” for capital that has been / can be deployed with the known credit in an approved structure.  By implementing legal structures that help secure the MakerDAO from the “hit by the bus scenarios,” the DAI ecosystem will have an overflow value for excess DAI (when above $1) and a mechanism for encouraging repayment below $1. In doing this, a needed dampening effect is created that will help smooth out the DAI price. Graphical Objective 1362×1600 563 KB The above is achieved by using market forces and an economically motivated off-chain structure.  Every time the market price is above 1, an economically motivated off-chain party should mint DAI to deploy off-chain. In reverse, when DAI is below 1, that same party should seek to repay the debt. When DAI is materially above 1, that party is well motivated to scale-up operations to deploy capital in-bulk. That capital could be held off-chain for weeks / months / years.  Time Horizon This proposal does not have a time restriction on how long the DAI will be borrowed by the TFE / the Trust / LendCo (1*). Rather LendCo is economically incentivized to respond to market forces and deploy / repay capital accordingly. As such, if the market conditions continue, the overflow DAI may be deployed (and recycled) off-chain for months / years. This size of the overflow / capital sink is constrained by:  Community approved debt ceiling LendCo operations (scope) LendCo economics  Legal Structure Selection The combination of a bankruptcy remote Trust + an Operating LLC (as a Lender, LendCo) is needed for a few essential reasons:  MakerDAO is a collection of unknown people or legal entities. A legal construct is needed to give them standing in a Court of Law to enforce a contract. A Trust with MakerDAO as beneficiary meets this requirement. Legal precedence with a bankruptcy remote Trust  If the trustee goes bankrupt, the assets of the trust will not become part of the bankruptcy estate of the trustee. The trust assets will always be separate and held for the beneficiary MarkerDAO. Industry familiarity with how to liquidate real-estate assets should a liquidation be triggered The Revolving Credit Facility Agreement is commonplace for most large companies to access inexpensive costs of capital from a bank. A bank does not need a Trust to foreclose on assets in the event of a breach / liquidation. For MKR, since those rights are held by an unknown group, a Trust (above) is needed Concentration of compliance and audit requirements to LendCo Individually, a Trust structure is not new. The Revolving Credit Facility Agreement is not new. Pushing them together with MakerDAO as the beneficiary with an MKR community defined scope is novel. As a result of the above, from the big picture LendCo can borrow DAI / USD (1*) in significant scale without increasing the cognitive load on the MKR community / Maker Representative. The independent accountants handle the scale of transactions while the auditors ensure the books are being kept in accordance with GAAP. The Maker Representative then needs to review the aggregate work done by everyone else to attest to the community that things are in compliance.    The ending structure for 6s looks like(2*): 2020-09-24_16-34-322080×1168 171 KB (2*) as further described in the term sheet below. 2020-09-24_17-07-001410×1140 109 KB 6s Capital LLC (“6s”) / MakerDAO (“MKR”) 001-MIP132550×3300 640 KB 002-MIP13 22550×3300 678 KB 003-MIP13 32550×3300 742 KB 004-MIP13 42550×3300 707 KB 005-MIP13 52550×3300 708 KB 006-MIP13 62550×3300 659 KB 007-MIP13 72550×3300 698 KB 008-MIP13 82550×3300 625 KB 009-MIP13 92550×3300 693 KB 010-MIP13 102550×3300 666 KB 011-MIP13 112550×3300 648 KB 012-MIP13 122550×3300 501 KB Matthew Rabinowitz’s Bio Matt is an execution driven business strategy and corporate finance professional with overall responsibility for 6s Capital LLC including managing the financial resources (banking, financing, equity capital) as well as the financial service providers (accounting, audit, insurance and tax). He has run point on strategic planning / business development / creating strategic alliances / contract negotiation / SPV implementations & management including assisting in the overall strategy, negotiations and contract support for the large (~10GW) renewable energy consortium including Boone Pickens, Fluor Corp. BNSF Railways, ABB, and Siemens. Thereafter, he assisted in the overall strategy, negotiations and contract support for two Life Settlement Trust Certificate bond offerings. He co-managed for two private placement debt arbitrage pooled investment funds. To achieve the best pricing on debt securities, he co-founded and ran back office operations for both an SEC Registered Investment Advisor and a subsequently acquired FINRA Broker/Dealer. He co-managed an oil & gas SPV to acquire an operating oil field asset which was subsequently divested. Finally, he co-founded a commercial real-estate development firm and designed its corporate structure. Matt earned a Master in Business Administration from the University of Texas at Dallas and a Bachelor of Science in Electrical Engineering from Texas Tech University. Projects first in line The 6s team has identified two projects that have already cleared underwriting for financing after the above structure is put in place. Neither project has any construction/development risks. The two projects are both Ground Leases and have been “handed over” to the tenant. The Lease for each project is in force with the credit tenant on the hook to make rental payments with a store opening or date specific (whichever occurs first). No LOI or commitment to fund has been executed.   Transaction #1 Required Closing Proceeds: $3,700,000  (Last Appraisal: $5,620,000)    Transaction #2 Required Closing Proceeds: $5,200,000  (Last Appraisal: $7,140,000)    Both transactions will require refreshed appraisals prior to a possible closing.   Underlying Legal Documents   Documents are still being drafted and should be posted in this thread prior to the deadline for the final executive vote.   Note: The Trust Agreement will use the form provided by the selected corporate trustee. As one has not been finalized yet, we will provide a basic template; however, until a trustee is selected the “actual” draft cannot be provided. That said, we are proposing a Delaware statutory trust which means most of the terms of the trust agreement will come directly form the Delaware Trust Statute.   General Next Steps  Declaration of Intent (submitted) Community discussion / debate (RFC) Formal submission of proposals for Governance cycle Inclusion of polls for proposals Governance poll for proposals Executive vote for proposals (including the appointment of the Maker Representative(s)  If this proposal is accepted along with MIP21,  the initial debt ceiling would be voted on but would be conditionally set to zero following the Maker Representative report (below) 6s team then deploys the structure contemplated herein alongside with the Maker Representative     Once the Maker Representative & 6s report to the community that all legal documents / entities are completely in place, a second executive vote would be held to implement the first debt ceiling as agreed in the first executive vote.  With this final action, 6s would be able to borrow DAI pursuant the revolving credit facility agreement.    Relevant Links  MIP21: Real World Assets - Off-Chain Asset Backed Lender How MakerDAO can be a competitive lender in the Credit Tenant Lease marketplace Adding Real World Assets (“RWA”) as DAI collateral is a critical step for Maker to stabilize the peg... and in doing so, we change the world https://forum.makerdao.com/t/real-world-assets-ctl-document-roadmap-getting-started-v1/ Translucent Finance - Off-chain lenders Economics behind Real World Assets (\"RWA\") - Part 1 Economics behind Real World Assets (“RWA”) - Part 2 Delaware Code Online Real World Assets - Off-Chain Asset Backed Lender - FAQs - Google Docs FAQs based on commentary from the community CBRE - Q2 2020 Net Lease Investment 6s Capital - State of the Business [📄] Collateral Onboarding Call #8: Centrifuge + 6s Capital - Wednesday, September 16 17:00 UTC DoI - Off-chain Asset backed lender to onboard Real World Assets - Extended Q&A  Footnotes 1* - At present, it is unknown if the Trustee will require direct engagement to provide the loans from the Trust to LendCo to facilitate each closing or not. Further, it is unknown if the Trustee will allow the conversion of DAI to USD to be done at LendCo or if they will require that they do the conversion with an account that is in their name F/B/O the Trust. This Declaration of Intent is giving latitude for adjustment surrounding the flow of DAI / USD to meet the requirements of the Trust Company to be willing to serve as the Trustee of the Trust. ",
                    "links": [
                        "https://www.treasury.gov/resource-center/tax-policy/treaties/Documents/FINAL%20US%20-%20Cayman%20Islands%20-%20Cayman%20alternat.pdf",
                        "https://wagnerduys.com/resources/resource/withholding-exemptions-to-cross-border-interest-payments/",
                        "http://etherscan.io",
                        "http://vote.MakerDAO.com",
                        "http://vote.MakerDAO.com",
                        "https://forum.makerdao.com/t/mip21-real-world-assets-off-chain-asset-backed-lender/3917",
                        "https://forum.makerdao.com/t/how-makerdao-can-be-a-competitive-lender-in-the-credit-tenant-lease-marketplace/3521",
                        "https://forum.makerdao.com/t/adding-real-world-assets-rwa-as-dai-collateral-is-a-critical-step-for-maker-to-stabilize-the-peg-and-in-doing-so-we-change-the-world/3653",
                        "https://forum.makerdao.com/t/real-world-assets-ctl-document-roadmap-getting-started-v1/",
                        "https://forum.makerdao.com/t/translucent-finance-off-chain-lenders/3800",
                        "https://forum.makerdao.com/t/economics-behind-real-world-assets-rwa-part-1/3801",
                        "https://forum.makerdao.com/t/economics-behind-real-world-assets-rwa-part-2/3893",
                        "https://delcode.delaware.gov/title12/c038/sc01/",
                        "https://docs.google.com/document/d/1sf0NIib9z8YXVlsEgur4twjlBp4HhN8jCS_epHKKZYw/edit?usp=sharing",
                        "https://docs.google.com/document/d/1sf0NIib9z8YXVlsEgur4twjlBp4HhN8jCS_epHKKZYw/edit?usp=sharing",
                        "https://6s.capital/wp-content/uploads/2020/09/US-Q2-2020-Net-Lease-Investment.pdf",
                        "https://forum.makerdao.com/t/state-of-6s-business/4420",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-8-wednesday-september-16-17-00-utc/4062",
                        "https://forum.makerdao.com/t/doi-off-chain-asset-backed-lender-to-onboard-real-world-assets-extended-q-a/4296",
                        "https://forum.makerdao.com/t/mip21-real-world-assets-off-chain-asset-backed-lender/3917",
                        "https://forum.makerdao.com/t/doi-off-chain-asset-backed-lender-to-onboard-real-world-assets-extended-q-a/4296",
                        "https://forum.makerdao.com/t/6s-rwa001-a-document-roadmap/7413",
                        "https://forum.makerdao.com/t/maker-relay-ep-19-en-espanol/4981",
                        "https://forum.makerdao.com/t/maker-relay-ep-19/4975",
                        "https://forum.makerdao.com/t/mip21-activos-del-mundo-real-prestador-respaldado-por-activos-off-chain/4957",
                        "https://forum.makerdao.com/t/maker-relay-ep-20/5078",
                        "https://forum.makerdao.com/t/maker-relay-ep-20-en-espanol/5084",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-8-centrifuge-6s-capital-wednesday-september-16-17-00-utc/4062",
                        "https://forum.makerdao.com/t/rwa-last-2-months-review-updates-and-looking-forward/5225",
                        "https://forum.makerdao.com/t/rwa-resena-de-los-ultimos-dos-meses-actualizaciones-y-lo-que-viene/5272",
                        "https://forum.makerdao.com/t/rwa-001-erc20-token-smart-contract-domain-community-assessment/5363",
                        "https://forum.makerdao.com/t/sixs-rwa-001-collateral-onboarding-oracle-assessment-mip10c3-sp18/5378",
                        "https://forum.makerdao.com/t/sixs-rwa-001-collateral-onboarding-risk-evaluation/5352",
                        "https://forum.makerdao.com/t/maker-relay-ep-23/5419",
                        "https://forum.makerdao.com/t/clarity-on-adding-rwa-001-6s-capital-as-collateral-type-poll-vote/5429",
                        "https://forum.makerdao.com/t/mip21-edge-case-scenarios/5430",
                        "https://forum.makerdao.com/t/maker-relay-ep-23-en-espanol/5442",
                        "https://forum.makerdao.com/t/ns-drop-collateral-onboarding-risk-evaluation/5418/14",
                        "https://forum.makerdao.com/t/sixs-rwa-001-collateral-onboarding-oracle-assessment-mip10c3-sp18/5378/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-23/5914",
                        "https://forum.makerdao.com/t/weekly-mips-update-24/6052",
                        "https://forum.makerdao.com/t/weekly-mips-update-25/6092",
                        "https://forum.makerdao.com/t/mip41c4-sp1-facilitator-onboarding-real-world-finance/6226",
                        "https://forum.makerdao.com/t/solarx-mip6-application-uprets-solarx-industrial-real-estate-backed-loans/6718",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-pt-br-portugues/4891",
                        "https://forum.makerdao.com/t/maker-relay-ep-18-en-espanol/4882",
                        "https://forum.makerdao.com/t/maker-relay-ep-18/4881",
                        "https://forum.makerdao.com/t/poll-rwa-working-group-covenant-structure/4836",
                        "https://forum.makerdao.com/t/ost-1-mip6-collateral-onboarding-application-by-uprets-real-estate-backed-digital-security/4438/16",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-pt-br-portugues/4810",
                        "https://forum.makerdao.com/t/maker-relay-ep-17-en-espanol/4804",
                        "https://forum.makerdao.com/t/maker-relay-ep-17/4798",
                        "https://forum.makerdao.com/t/maker-relay-ep-16-en-espanol/4719",
                        "https://forum.makerdao.com/t/maker-relay-ep-16/4710",
                        "https://forum.makerdao.com/t/signal-request-approve-maker-representatives-as-an-oversight-role-for-real-world-assets-october-2020/4656",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-pt-br-portugues/4597",
                        "https://forum.makerdao.com/t/maker-relay-ep-15-en-espanol/4576",
                        "https://forum.makerdao.com/t/maker-relay-ep-15/4574",
                        "https://forum.makerdao.com/t/calling-community-members-to-be-a-maker-representative/4519",
                        "https://forum.makerdao.com/t/discussion-legal-structures-of-makerdao/4390",
                        "https://forum.makerdao.com/t/poll-rwa-working-group-centrifuge-model/4381",
                        "https://forum.makerdao.com/t/agenda-discussion-collateral-onboarding-call-8-wednesday-september-16-17-00-utc/4062/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-108-thursday-september-3-16-00-utc/3850/2",
                        "https://forum.makerdao.com/t/rwa001-a-custody-agreement/7724/6",
                        "https://forum.makerdao.com/t/guide-navigating-feedback-from-governance-and-the-greater-makerdao-community/8303",
                        "https://forum.makerdao.com/t/signal-request-should-real-world-asset-collateral-onboarding-be-prioritised-in-the-short-term/4075",
                        "https://forum.makerdao.com/t/week-14-dai-distributions-sourcecred-trial/4044",
                        "https://forum.makerdao.com/t/maker-relay-ep-11/4041",
                        "https://forum.makerdao.com/t/sientas-newsletter-no-1-weekly-updates-on-real-world-assets-in-defi/8306",
                        "https://forum.makerdao.com/t/executive-vote-request-raising-6s-rwa001-a-debt-ceiling/9893",
                        "https://forum.makerdao.com/t/mip73-pando-investment-grade-climate-assets-collateral-onboarding/14484",
                        "https://forum.makerdao.com/t/implementation-updates-for-real-world-assets-mip21-mip13c3-sp4-for-6s-capital/5059",
                        "https://forum.makerdao.com/t/6s-structure-updates/14528/5",
                        "https://forum.makerdao.com/t/next-steps-for-real-world-asset-onboarding-risk-parameters-for-the-recently-accepted-mip21-and-mip13c3-sp4-for-6s-capital/5052"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.501088238640106
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "3",
                    "time": "01/09/2020-22:05:50",
                    "content": "Excellent work !  Should the TFE be different from the Trust? The Trust is more of an executor of the agreement right? I’m not sure that having LendCo paying the Maker representative is a good idea. The interest rate ceiling will reduce Maker ability to keep the peg at 1 (from below). We can’t set punishing rate to reduce the amount of DAI outstanding and the contract can be stopped only after a 12 months notice. Liquidation has a 12 month suspension.  I assume it’s all standard but we should think of the implication on Maker. I would also ask for a due diligence on 6s companies. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.305357142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#3",
                    "likes": "2",
                    "time": "01/09/2020-22:13:34",
                    "content": "    SebVentures:  Should the TFE be different from the Trust? The Trust is more of an executor of the agreement right?   Yes. it should be different. The Trust is the lender to LendCo. The Trust borrows the DAI from the TFE.  The Trust is there as MKR holders need to have standing to enforce the agreements. Token holders cannot do that, a person can, a legal entity (e.g. a trust) can.     SebVentures:  I’m not sure that having LendCo paying the Maker representative is a good idea.   No dispute there.     SebVentures:  I would also ask for a due diligence on 6s companies.   No issue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.819196428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "02/09/2020-02:42:07",
                    "content": "Same question here as in the other thread. How would this facility be handled during an ES.?     MIP21: Real World Assets - Off-Chain Asset Backed Lender Conception       I am still trying to digest this so right now I only have one question.  IF (and I consider this becoming less and less likely for multiple reasons) an ES is activated exactly how would this facility be settled for DAI holders?  My concern here is that this particular facility will have to recify differently during an ES than other collateral types that are ‘non-binding’ in the sense that anyone owning DAI can redeem for their share of MCD assets within what 24-48hrs after an ES and that there i…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.274659863945578
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#5",
                    "likes": "1",
                    "time": "02/09/2020-03:40:51",
                    "content": "I think it depends if the system is redeployed or not. In a redeployment, I imagine the Trust would look for that signal, take no action, and the Vault would simply be ported over to the new system. In a non-redeployment world, I imagine the Trust could simply convert USD to USDC and pay that out to the former Dai holders. There are probably others with a more detailed answer to this than me, but it seems fairly simple so long as it’s contemplated in the agreements. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.52020202020202
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#6",
                    "likes": "2",
                    "time": "02/09/2020-09:10:11",
                    "content": "This is most interesting. My only comment is that we would probably need to write and agree on the Revolving Credit Facility Agreement and include very clear and objective criteria for when this agreement is breached. If it gets too complicated only a very minor subset of the community will be able to digest it with increased uncertainty regarding any voting as a result. Also, I kind of suspect you will burn through the suggested debt ceiling rather quickly. Possibly raise them a bit? Both thumbs up and I wish you all the best with this one! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1104166666666675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#7",
                    "likes": "3",
                    "time": "02/09/2020-09:15:45",
                    "content": "Thank you. The RCFA is based on the same agreements that the Fortune 1000 use. It is approximately 100 pages. I will be posting it in the thread for community review when counsel has finalized the customization I requested. Painfully, there is no good way to make the legal agreements “simple”… The critical component with the entire structure is that the agreements are binding and enforceable with a Court of Law. The goal is that not only can LendCo use this structure but the many that come after. It must be a “market” deal and look quite similar to what a LendCo would get from a bank. That is the direction I am pushing for the community. RE the debt ceiling, LendCo will for sure consume all of it within 90d. LendCo has a pipeline of an additional 30MM in debt needs in Q1 2021. The above said, personally I am not concerned about the  structure, legal enforceability or the process, but I have learned in my career that the best way to gain trust is simply to earn it and never to ask for it. So my plan is radical transparency with basically anyone that will sign a NDA (maker rep or not) to give direct oversight as we get started. I am thinking to keep that up for 6 months or so, so the community can hear from those folks to allow that debt ceiling to be raised to meet the LendCo needs. Very much appreciate the support ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.361842105263158
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#8",
                    "likes": "2",
                    "time": "02/09/2020-09:35:07",
                    "content": "@MakerMan excellent question… Following on with @g_dip 's comment, the Trust views the MKR tokens holders as the beneficiaries. The Trust is a legal entity with a Trust company as the Trustee. Unless they are specifically noticed, they will make the assumption that all is well and no “liquidation” has been instructed. So now insert the edge case of the Emergency Shutdown of the Maker protocol. It is also important to recognize there are fundamentally two scenarios for the ES. 1.) Something bad happened and the system needs to settle and relaunch. 2.) People are just done with the MKR protocol Case #1) The MKR token holders will relaunch… During the ES, the trustee cannot be noticed as MKR temporarily doesn’t exist. However, when it does re-launch, it can reconstruct and transfer the debt from ver A to ver B… This actually solves a huge issue as LendCo doesn’t technically ever know the difference… More importantly, the legal agreements between the Trust and LendCo have nothing to do with MKR re-launching. So there is NO scenario where LendCo gets free cash. The Trust always keeps the “gun to the head” of LendCo.  Further, it would not be advantageous to MKR (or LendCo) to have all of the LendCo assets liquidated (or practical) to then slam the market with DAI to deliver it. As the underlying intention is to relaunch, it is far better to “store” the off-chain capital much like a battery to be delivered and paid down in the future. In this edge case, this is the 99.999% case. Case #2) If Maker has not intention of relaunching for operations, the collective of then MKR holders will get together and relaunch for the sole purpose of triggering the liquidation for LendCo, and pursuant to the Trust agreement, LendCo must wind down its operations. gracefully.  This is the 0.0001% of this edge case. The MKR token holders will be listed as beneficiaries of the Trust, including successive re-launches of the Maker protocol. Upon a relaunch, the Trustee and LendCo will then each be notified of where to pay down debt. Trust law has handled the notion of successors for a long time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.700757575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#9",
                    "likes": "2",
                    "time": "02/09/2020-12:37:04",
                    "content": "Just one note - I think you’re using “MKR” and “Maker Protocol” synonymously, which can be a bit confusing. You’re saying “The Maker Protocol would temporarily cease to exist”, not MKR, right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.964285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#10",
                    "likes": "0",
                    "time": "02/09/2020-12:38:28",
                    "content": "You are correct. The ERC-20 (MKR) would continue to exist for sure. The protocol would be temporarily cease operations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#11",
                    "likes": "2",
                    "time": "02/09/2020-13:50:33",
                    "content": "I had to think about this really. I think my point here is the details of the ES DAI redemption mechanics.   In a quick relaunch basically the new MCD could roll the loan.  But what this means is that the borrower (LendCo offshore) would get new_DAI that would then be deposited into the old MCD which could be redeemed normally by DAI holders.   The problem is the case where MCD does NOT relaunch then basically what in my mind is required is a promissary token from (LendCo offshore) to redeem tokens with something of suitable value (USDC?).   The issue here is that basically the debt becomes an impaired obligation for DAI holders trying to redeem for the claims on assets that by contract have to happen over time.   This is making me think that to borrow LendCo has to deposit some kind of Token to represent the $$ value owed so that DAI holders can redeem for ‘something’ even if they have to wait to redeem again. I really want to hear someone from MCD development team comment on this. My point here is that every borrower deposits something (collateral) that DAI holders can redeem for ‘immediately’ after a system shut down.  Unless I am missing something I don’t see what DAI holders would be redeeming for.  I also think even if you were to create a token that represents ‘debt owed’ that given the terms of the agreements this becomes an impaired asset for the DAI holders.  (quite literally if MCD does not relaunch and the debt can’t be rolled into a new facility before redemptions start occuring there is nothing to redeem for). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.062710437710438
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#12",
                    "likes": "1",
                    "time": "02/09/2020-14:14:36",
                    "content": "    MakerMan:  In a quick relaunch basically the new MCD could roll the loan. But what this means is that the borrower (LendCo offshore) would get new_DAI that would then be deposited into the old MCD which could be redeemed normally by DAI holders.   In this structure, LendCo never wants to hold DAI. It will almost always sell it for USD to conduct operations. The only time it will have DAI is right before it pays down a vault balance.     MakerMan:   The issue here is that basically the debt becomes an impaired obligation for DAI holders trying to redeem for the claims on assets that by contract have to happen over time.    Correct. LendCo can operate with a “gun to its head”, but it cannot operate with a demand payment structure to fire sale everything at the drop of a hat. No one will ever deploy capital that way. There are multiple edge cases here.  If there is a liquidation If there is an emergency shutdown If both #1 & #2 happen at the same time and the system restarts Same as #3 but the system doesn’t restart  So:  As an operating business in the business of providing loans, if a liquidation is triggered, to maximize the proceeds of liquidation, a fire sale is NOT recommended for obvious reasons. It will take time to recover funds, and once recovered, the Trustee will cause those to be paid to MKR via the same mechanism that LendCo would use to pay down the vault. In an emergency shutdown, the Trustee has no clue it happened. LendCo from an operating perspective has no clue it happened. Only impact is that LendCo cannot cause new DAI to be minted. MKR holders gather, and relaunch and migrate the debt over to the new system. All the legal docs stay exactly the same. The debt outstanding didn’t change. LendCo winds down. The Trust holds the liquidated cash proceeds from the sale of LendCo assets in favor of the new launch of the Maker protocol (almost like updating a payment mailing address). Extreme edge case. I cannot see a scenario where the system doesn’t restart at all. This would imply all MKR token holders all throw up their hands and just walk away (and not one person decides to restart it). BUT if that where to happen, LendCo could not borrow any newly issued money. It would be able to continue its operations under the terms of the RCFA. When the RCFA would be paid back, all of the cash would sit with the Trust in favor of the beneficiaries until such time as a payment address could be determined.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4123569882498455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#13",
                    "likes": "0",
                    "time": "02/09/2020-15:18:16",
                    "content": "I believe you’re overthinking #2… All (former) Dai holders would have a token that represents a claim on the funds that will ultimately come in from the Trust. There will likely be market makers willing to bid on this token for a small discount. I imagine that Dai holders will just go to Uniswap or something to cash out to USDC if they don’t want to wait. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#14",
                    "likes": "0",
                    "time": "02/09/2020-15:23:28",
                    "content": "    g_dip:  There will likely be market makers willing to bid on this token for a small discount. I imagine that Dai holders will just go to Uniswap or something to cash out to USDC if they don’t want to wait.   Wouldn’t that token then be considered a security and would not be able to be given to DAI holders during ES? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#15",
                    "likes": "0",
                    "time": "02/09/2020-15:26:13",
                    "content": "No idea - not a lawyer  But mechanically speaking, I think the Trust would just pay out USDC to this address at some point in the future. How is ES handed in your model btw? Maybe there can be some cross pollination… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#16",
                    "likes": "0",
                    "time": "02/09/2020-15:52:49",
                    "content": "Should a liquidation occur, the payment that the Trust sends would go to repay the vault. The empowered Trustee used the Law and enforceable agreements to liquidate the assets of LendCo. There is no fractional ownership of the assets being sold / conveyed to token holders. All of the asset would be sold for cash. That cash is then sent to the beneficiaries of the Trust (MKR token holders). Full disclosure: I am not an attorney, but I don’t see any securities transactions here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#17",
                    "likes": "1",
                    "time": "02/09/2020-20:09:43",
                    "content": "Emergency Shutdown behaves differently than liquidations so this does need special handling. In short, when emergency shutdown happens, the DAO will allow every DAI holder to convert their DAI to the underlying collateral. We have been working on a solution (and thanks to @equivrel for sanity checking my proposal) that can address this that will work equally well for Centrifuge than for your proposal. @g_dip, you were right, there can definitely be cross pollination. A simplified example: 10 DAI have been minted, 5 were minted with 1 ETH as collateral and 5 DAI were minted to your credit facility, @mrabino1 against $5 worth of real estate. In ES this is what’s happening: Any user can cash out their DAI for the underlying collateral. If you own one DAI you can go to the DAO and you will get 0.1 ETH (1/10th of the ETH collateral) and you’re supposed to get $0.1 from your credit facility. The problem is: how can a DAI holder get their $0.1 from the trustees or from a lending SPV? The normal method that is currently supported by End (the smart contract that manages Emergency Shutdown) has a way that it can give you some of the collateral that was originally in the Vault. For security tokens (like Centrifuge’s) or the assets you’re talking about that exist completley off-chain, there is either no such token or you might not be legally allowed to own it (because you’re not an accredited investor). Without derailing this thread too much and taking it off topic, the answer lies in creating a specific contract that can trustlessly in a fully automated way can “give you the underlying collateral” which in that case most likely would either be just an equal amount of DAI or some other stablecoin. So you could get 0.1 DAI or 0.1 USDC for the fraction of your DAI that was backed by the real estate in your proposal. When I have a free moment I will write this down in a bit more detail and can show how this can work for both of our assets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.926219870664315
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#18",
                    "likes": "1",
                    "time": "02/09/2020-21:00:03",
                    "content": "While I think it is important to consider the edge cases here I think this topic can and should be broken into parts. I remembered that someone was working on a Emergency Shutdown report because I was working on an analysis but don’t know if there was such a report made.  I think it would be prudent to examine what an ES means not just in face of new collateral types but as a general matter of course of evolution of the Maker system. The implications of a Maker ES covering the entire space/system, whether or not RWA’s are added is important,   The whole topic of whether Maker should work to change the whole Emergency Shutdown mechanics into 'smart contract halting/maintenance approach’would be in order in another forum thread.   A MIP13 proposal really isn’t the place for general ES considerations even though there are real issues to address with RWA’s. In general I think this proposal is well thought out (even if somewhat complex in detail) and the Maker protocol desperately needs to grow asset classes, as well as DAI outstanding,.and RWA’s are great additions to do this.  I really want to see these RWA’s move forward and while I want to see this I also realize more work to evolve the protocol is required. I started work on doing an analysis of the ES as a possible attack vector on Maker as well as the entire DeFI system but never had time to finish a write-up and forum post opening up the subject for new discussion. I started with discussion on topics like using MKR seasoning to make it so no-one can just pop out 50K MKR to ES the system with a flash loan etc. Here is a new general ES discussion thread.     Revisit Emergency Shutdown topic Governance       I remember @Rich_Cuellar-Lopez started working on this topic but I don’t see that this got closed out due to inactivity.   My hope was to see a working group form on this and give a report.  I really think this topic needs a revisit and while I am posting this thread as a reminder I am not offering to spearhead this (family/work other issues too demanding of my time atm).  Here are the links to what I could drag up.          I want to say while this topic is a complex one that the community shou…     ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.307533863985476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#19",
                    "likes": "2",
                    "time": "02/09/2020-21:15:02",
                    "content": "I agree, ES is a non trivial topic and experimentation with RWA can be done without having the perfect solution. But the good news is that this is not a problem we can’t solve. And I’ve just wanted to outline my thoughts as to how above. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "4",
                    "time": "04/09/2020-01:14:43",
                    "content": "Hey @mrabino1, I’m just going to go through this and make notes as I pick them up. Hope it’s helpful.     mrabino1:  Declaration Statement: Off-Chain Asset Backed Lender to onboard Real World Assets into the Maker Protocol to borrow DAI and deploy in the “Real World”.   The idea of this statement is to be a sort of summary of the actual declaration. I’d suggest phrasing it in the form: “Maker governance intends to…” In this case I’d suggest something like: “Maker governance intends to onboard off-chain asset backed lenders using the structure detailed in this Declaration.” I think this is what you intend us to vote on, but if I’ve misunderstood, please adjust to your intention.     mrabino1:  Context and Motivation   Seems good. I would maybe try to reduce word-count, but fairly low-priority issue imo.     mrabino1:  Declaration Detail   I would try to make better use of multi-level headers here. With something of this length, I’d even be tempted to include something akin to a table of contents. Or at least an introductory paragraph describing the major sections and their importance.     mrabino1:  Specific Declaration of Intent   So there has maybe been some confusion here. You are writing this on behalf of MakerDAO itself, rather than on behalf of 6s. This declaration is something Maker Governance is declaring (if this proposal passes.) So for example, instead of phrasing this as:     mrabino1:  6s, as an off-chain asset backed lender, desires to engage with the MKR community to cause the addition of a new collateral type along with new roles that would need to be filled from a person(s) / entity nominated by MKR holders.   It should be phrased something like this: “Maker Governance  declares the intention to engage with 6s as an off-chain asset backed lender with the aim of adding a new collateral type and the new roles required to support this collateral type as detailed later in this proposal.” In this way, when the proposal is voted on, MKR Holders either agree to ratify the proposal and confirm the declaration as written, or reject it.     mrabino1:  6s works with multiple commercial real estate developers throughout the United States. 6s provides secured loans equal to 100% Loan-to-Cost for construction and the underlying real estate acquisition until completion for build-to-suits and ground leases for Credit Tenant Leases.   I appreciate that this is maybe super clear to someone who is more up to speed in the finance or business world. Can you describe what this means in practice in laymans terms? What is the loaned capital used for? Buying real-estate and constructing buildings to specifications provided by tenants?     mrabino1:  Further, rather than a digital oracle to automate the decision of whether a “breach” has occurred that would then trigger a liquidation, 6s and MKR governance* would enter into a revolving credit facility agreement whereby the obligations / requirements / covenants are laid out in written form enforceable in a Court of Law (as opposed to purely numeric with a pricing oracle) or code.   Is this still part of the high-level overview? It seems like a fairly drastic context switch. After this it seems to dive into the role of the Maker Representative. I don’t think this is wrong necessarily, but I do think the flow of this document is off at this point. Changing topic without having an additional header is bad imo, and makes it confusing to follow.     mrabino1:  Provide a brief history of the project:   Can this section just be combined with the ‘high-level overview of the project’? It’s at this stage I’m realising you’re following the questions in the MIP6 application form. In some ways this is good, because it means this declaration includes the required information. On the other hand, that format really wasn’t designed to fit into a proposal. I think if it were me, I would post the answers to the MIP6 questions in a separate document and then reference that document in this declaration of intent. I would probably aim to follow this structure with the attached term sheet documents as well. Provide them as supporting materials, but don’t include them directly in the text of this declaration.     mrabino1:  Matthew Rabinowitz’s Bio:   Again, I would maybe provide this as supporting material, but not directly inline. I think I’m going to stop there for the time being, for two reasons:  It’s late and I’m sleepy. The way this is structured makes it hard work to follow.  Regarding content, I’m having trouble engaging with it given the current structure and my general unfamiliarity with the concepts involved. I’d be happy to take another look once the structure has been cleaned up a bit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.673890692640693
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chris",
                    "index": "#21",
                    "likes": "3",
                    "time": "04/09/2020-03:14:05",
                    "content": "Neat proposal.  I am personally bullish on experimentation using all sorts of legal structures in order to get RWAs into the Maker collateral pool. Some questions though:   What’s the Trust Company and Administrator that you’re proposing to use for this? Seems like a crucial point to address as MakerDAO obviously needs to be able to evaluate its rights in case something should go awry and one or several of these borrowers cannot repay.   Could you please share a copy of the proposed a) Security Agreement between Lendco and the Trust, and b) the Operating Agreement for Lendco?   a. Given that the token that you’re proposing to deposit as collateral has no redemption rights, voting rights, or economic value I think its particularly important to better understand specifically what you mean when you say that “all” of Lendco’s rights will be irrevocably assigned to the Trust.  Where if I understand correctly, legal beneficiary of the trust will technically be a MakerDAO representative will the the sole beneficiary of the Trust (do I have that right?).  It might be nice to see some legal analysis on how this works, but I dont think this is a strict requirement provided that we can grok the Trust documents, Security Agreements. b.  I think we need to see the operating agreement to better understand the balance of rights between the financing that the DAO will provide and the preferred equity that you’re proposing to raise.  It might be nice to hear from and get the perspective of some of LendCo’s proposed or current preferred equity investors.   It kind of seems like a pretty precarious time for anyone to be investing in commercial real estate (see e.g. https://www.ft.com/content/e4b2302b-76c5-494a-8560-e6d24de9358f?list=intlhomepage) and while I don’t doubt that rising there is opportunity we definitely need to know more specifics about who, and where the borrowers you’re proposing to provide financing to. This list is nice but I think we need many more details about these projects.   To be clear you haven’t closed on any of these projects yet? We may want to kind of see you close on a few deals first to so that we can kind of familiarize ourselves with this process with some real world demonstrations of this model.   Like when you say “no speculative project risk” it kind of makes me a bit suspicious bc commercial real estate financing def seems risk af presently, and you’re proposal uses a lot of technical terms of art like “shovel ready” etc that we just generally dont understand.   On some level, it feels a bit like you’re asking us to play VC on a collateral types that are difficult for this community to reason about compared to say shitcoins, where ( I think ) the failure modes are pretty well understood.  Here, its a bit murkier as its not directly in our wheelhouse.   Who is conducting these appraisals and can we please see the appraisal documentation for these two proposed deals?    Having a really hard time understanding specifically what you mean here.  Could you please give us the ELI5? Like in one sentence, assume these borrowers go bankrupt or like rioters destroy the property they are proposing to build and they cant repay Lendco, could you presumably inflate the valuation of one of the loans that Lendco provides even though the property/lease/etc is worthless? Maybe if we could start with the worst case and if you could describe how you could fuck over the DAO by leaning on these “Gap Collateral Rights” that would be super helpful.   I have other nitpicky things re the actual amount of money you’re requesting (which seems high given the speculative nature of this project in terms of both the assets and the “consumability” of this collateral type), and the general inspection rights that you’re proposing to the DAO but these kind of seem ancillary to the questions above. (Re inspection rights: have you considered making this MakerDAO representative a unit holder in LendCo LLC? Like some extreme de minimus amount simply to preserve the statutory inspection rights in DE.  You could easily imagine any distributions paid out to this minority unit holder would be pledged to some charity like the free software foundation etc etc.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6054799697656845
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#22",
                    "likes": "4",
                    "time": "04/09/2020-16:32:31",
                    "content": "@chris Good questions. Many of your questions / comments may need a follow-up call (or a call from your attorney to mine). Let me start to address below.     chris:  What’s the Trust Company and Administrator that you’re proposing to use for this?   We are engaged with several Trustee attorneys at this point to get their recommendation. Wilmington Trust would be an ideal candidate. One has not been selected yet.     chris:   Seems like a crucial point to address as MakerDAO obviously needs to be able to evaluate its rights in case something should go awry and one or several of these borrowers cannot repay.    The borrowers engage with LendCo. If a borrower cannot repay, LendCo will foreclose on them. The primary time the Trust is used is when a liquidation event is triggered by MKR governance.     chris:   Could you please share a copy of the proposed a) Security Agreement between Lendco and the Trust, and b) the Operating Agreement for Lendco?    Legal drafts will be posted soon. Regarding the operating agreement, I need to get guidance from counsel. We need to find a way to get you / the community comfortable with the contents. That said, I am not running a public securities offering (and the operating agreement represents that security). I would be happy to have your attorney speak to mine to get the substance. Let me get back with you / the community on this point.     chris:  Given that the token that you’re proposing to deposit as collateral has no redemption rights, voting rights, or economic value I think its particularly important to better understand specifically what you mean when you say that “all” of Lendco’s rights will be irrevocably assigned to the Trust.   In the same context that LendCo would receive borrowed funds from the Trust (which it received from the Maker protocol), the Trust should only every provide a loan when it knows that it has some protection for providing that loan. In this case, the revolving credit facility agreement and the “cut through agreement” are the agreements that give the Trust comfort / assurances as to what the funds can be used for, the terms, etc…  So table the “cut through agreement” for a moment and go one layer down… LendCo will then only loan money to a BorrowCo when it consummates a transaction whereby LendCo sends money for a simultaneous close where by LendCo receives clean title to a senior lien w/ a promissory note, loan documents, assignments, assurances from the principals of BorrowCo etc. This part is exceptionally important. LendCo has to hope for the best and always plan for the worst. LendCo has to always make the assumption that every loan will default. This means LendCo might have to take over a project that for whatever reason didn’t get completed. Of course, all of the agreements that are executed in exchange for LendCo’s capital are to ensure and mitigate every conceivable risk from that happening. But in the worst case, if LendCo has to foreclose on the project and sue to the principals of BorrowCo to recover funds, it will. All of those “rights” and enforcements are in the deal book for that one loan (LendCo gets those rights in exchange for capital). Going back up a level, the “cut through agreement” allows the Trust (in the event of a liquidation) to push LendCo to the side and have the same ability as LendCo to step in the shoes of LendCo and foreclose on all of the borrowers. The important take away here is that for a Lender (LendCo). The Loans are the assets of the company. Those loans must be enforceable. And ALL of the rights that LendCo receives from each BorrowCo are unconditionally and irrevocably assigned to the Trust.  It is the only way the Trust can cause a foreclosure on LendCo’s assets EVEN IF LendCo files bankruptcy. LendCo is powerless to stop the Trust’s rights. Summary: LendCo has a gun to its head from the Trust. And LendCo puts a gun to the head of each of the BorrowCos (and their principals) to perform. Everyone is incentivized to repay the loans.     chris:  Where if I understand correctly, legal beneficiary of the trust will technically be a MakerDAO representative will the the sole beneficiary of the Trust (do I have that right?).   No. The Maker rep is a person / entity. The beneficiaries of the Trust should be Maker Token holders (or its successor in the event of an ES and relaunch).     chris:  It might be nice to see some legal analysis on how this works, but I dont think this is a strict requirement provided that we can grok the Trust documents, Security Agreements.   Note: The Trust Company will require us to use their “form” for the Statutory Trust agreement. Until a Trust company is selected, it is impossible to provide the live version. However, a Statutory Trust is driven by statute. So there shouldn’t be massive changes. The key components that will be unique will be A.) the beneficiary (above) and B.) The Liquidation trigger which is caused by MKR governance. (Fundamentally where to look on the blockchain to see if Vault has been triggered / cured / liquidated, etc.). The rest of the Statutory Trust should follow their form. As I wrote above, I am happy to also get on a conference call with you / your attorney to provide additional clarity.     chris:  I think we need to see the operating agreement to better understand the balance of rights between the financing that the DAO will provide and the preferred equity that you’re proposing to raise.   Important. I am not aiming to raise any equity from the community. I am not running a public offering. I am only looking for a revolver (debt) under terms. That said, fundamentally, there are two classes of equity and then debt. In terms of liquidation preference, the debt always gets paid back first. Thus the revolver (from the Trust) would be in first position, meaning any liquidated proceeds would pay the DAI loan first. then the preferred equity investors. and last, any money that is left over goes to the common equity. As I wrote above, I am happy to also get on a conference call with you / your attorney to provide additional clarity.     chris:  It kind of seems like a pretty precarious time for anyone to be investing in commercial real estate   This one specific area of commercial real estate (credit tenant leases) specific to those that have “recession resistant” tenants is not only doing decent during COVID-19, it is expanding rapidly. The triple-net lease space (or Ground Lease) is a unique area of commercial real-estate. If were intending to build movie theaters or high rise office towers, this would have exposure (and I don’t like exposure. I am always looking for how to de-risk the transaction). Important aspect is that we are not providing capital to the tenants. As a lender, LendCo lends money to developers that build the locations pursuant to an already executed lease (critical, as the tenant significantly de-risks the transaction). Thus the tenant is on the hook to pay rent once the location is built. Thus prior to close, we must also have a general contractor committed to build the location (along with GC mgmt oversight). The developer has his / her profit locked in the project and doesn’t make a dime of profit until he / she divests the project. The developer (aka BorrowCo) is well motivated having taken the development risk & construction risk to then divest the project. In doing so, they repay LendCo. LendCo can then repay DAI. The Tenant selection is an essential component to the mix. I bring up movie theaters for no other reason than the tenants outlined above have been intentionally selected, as they fit the narrative of recession-resistant / amazon-resistant. (critical) As outlined, the scope of operations of LendCo is initially agreed between the community and LendCo. After which the community may amend the operations of LendCo by ratifying a LendCo request. The proposed scope is constrained to no development risk with pre-defined tenants (known and researchable credit pricing) with known lease structures. No development risk means, that LendCo will not close on a transaction unless it has clean title to a senior lien on the underlying real-estate / an assignment of an enforceable credit tenant lease / an assignment of the engineering work / an assignment of the arch work / an assignment of the General Contractor (and commitment to build the location) / developer must have all of the permits & insurance / developer must have a GC engaged to do the work / the list goes one… but there are underwriting requirements that LendCo will follow before a dime of LendCo money is released for a given project. Stepping back: Banks provide capital (loans) for these projects across the country today. This is not new as they are secured senior lenders. Typically the borrower needs to raise corresponding equity (30% typically) to marry to the bank’s 70%. We are abstracting the equity raise from the borrower to LendCo such that it can then provide a 100% Loan-to-Cost to a willing borrower. In that case, the borrower just doesn’t need to raise equity. The objective is to have the equity consolidated at the core (LendCo) so we can scale operations. Summary: The objective is to have the risk profile for LendCo’s revolver, e.g. Maker, be the SAME as a bank.     chris:  To be clear you haven’t closed on any of these projects yet?   I have be directly involved in 11 of them on the borrowing side ($~35MM). No defaults. Some still under construction. More closing soon. 6s Capital is being setup to be a lender for an upcoming pipeline of transactions with a portfolio of pre-approved tenants.     chris:  Like when you say “no speculative project risk” it kind of makes me a bit suspicious   See comment above. LendCo does not take speculative risk. Developers take speculative risk. LendCo is the senior lender during construction / refinance. LendCo only closes on deals that been de-risked from developmental perspective.     chris:  On some level, it feels a bit like you’re asking us to play VC on a collateral types   Not related to VC risk at all. No speculative risk. Credit and construction risk. Both will be mitigated to the maximum extent possible. LendCo will have the senior lien on a portfolio of projects, thus we are then de-risking further by removing geographic risks, etc. At some point, LendCo starts to look like a bank, but it is not one.     chris:   Who is conducting these appraisals and can we please see the appraisal documentation for these two proposed deals?    It is industry practice that all loans require an independent appraisal that are certified (such appraisal is always ordered by the lender, not the borrower). LendCo never does the appraisal. Typically groups like BBG (https://bbgres.com/our-services/valuation/) would be used. LendCo will contract with a firm (like BBG) to generate an independent appraisal. I am happy to share the historic appraisals (and the needed updates) with the Maker Representative(s) prior to any contemplated closing.  Every loan that LendCo ever does must be well documented and packaged to show to an auditor during our annual audit of LendCo financial statements as well as Maker Rep inspection. That appraisal must be in that package. It provides one of the core metrics to base a Loan-to-Value constraint calculation.     chris:  Gap Collateral - Having a really hard time understanding specifically what you mean here.   Two angles to view Gap collateral.  1.) If LendCo has a recent independent appraisal that says a given project is worth $10MM, but the Borrower only wants to borrow $2MM (e.g. they have 10 acres of land, but the project is only using 1 of them). If LendCo has the senior lien on the project and all of the land, the difference is value that LendCo can claim as Gap collateral. In this case that would be up to $8MM.  2.) If LendCo makes it a requirement for BorrowCo to put up additional collateral (eg… they are a new developer with a minimal track record), in addition to a personal guarantee, LendCo may require them to post addition collateral (if cash, via a control agreement, no appraisal is needed). In the case of real-estate, a recent independent appraisal would be needed. To your comment on what are the things that could be done wrong, LendCo has discretion on constraints regarding its lending activities provided it doesn’t breach its equity requirements. However, changing the appraisal or ignoring the values would be a clear breach. LendCo would not survive an audit and most certainly not survive a Maker Rep inspection. MKR would then trigger a liquidation. There is a reason there is a gun to the head of LendCo. Further, there is a reason there is a gun to the head of BorrowCo. Put simply, economic incentives to perform and structure setup to protect the rights of the Lender (LendCo or the Trust). When everyone performs, everyone wins.     chris:  the actual amount of money you’re requesting (which seems high   To get a large name-brand known Trust company, a $15MM start is on the extremely low-end of the scale. If we go any lower, we cannot get Trust companies to want to be in a Trustee role. Further, this structure is designed such that the legal enforceability regardless of scale still protects MKR. By having a strict operating scope and a controlled list of tenants, MKR governance has a clear idea of the risk profile of the end tenant. By legal enforceability opinions from BorrowCo on each loan, and LendCo having an equity “buffer” that comes AFTER the Trust, the objective is to always keep the Trust exceptionally well protected.     chris:  and the general inspection rights   All of those inspection rights are contractually granted via and may be found in the Revolving Credit Facility Agreement  As outlined above, I am happy to get on a call and go over the above points and get your attorney in contact with mine to get additional comfort. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.539034762776374
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chris",
                    "index": "#23",
                    "likes": "2",
                    "time": "08/09/2020-01:26:34",
                    "content": "Thanks for getting back to me, let me chew on the above and get back to you with some follow up this week ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-15/4243",
                        "https://forum.makerdao.com/t/weekly-mips-update-14/4028",
                        "https://forum.makerdao.com/t/weekly-mips-update-19/4935",
                        "https://forum.makerdao.com/t/octobers-monthly-mips-governance-poll-is-live-go-vote/2842",
                        "https://forum.makerdao.com/t/weekly-mips-update-17/4746"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#24",
                    "likes": "2",
                    "time": "08/09/2020-12:36:36",
                    "content": "Great work- can you comment some more on what S6’s motivation is here?  Why is this worth the trouble for them?  Are they MKR holders or are they having trouble getting financing through traditional routes?  Just experimenting?  Or do they see real profit potential here? Thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#25",
                    "likes": "2",
                    "time": "08/09/2020-13:29:57",
                    "content": "@latelot 6s Capital is economically motivated. One of the more attractive aspects to the proposed structure is moving the control to MKR governance to allow for updates to scope, interest rate, equity requirements, and debt ceiling amounts without changing the legal contracts or the structure as a whole. Thus as 6s grows and adds a “new capital sink” that the MKR Governance approves, 6s can expand its model (with the associated compliance reporting staying virtually the same). Further, the time horizon (like other MKR vaults) doesn’t have a specific contemplated end date (except that the structure will terminate when the debt ceiling is zero and the amount outstanding is zero for more than a year). Thus, our interests are aligned with building a relationship that is built on rock for the long-haul.     latetot:  Why is this worth the trouble for them?   Excellent point. With an initial debt ceiling of 15MM, the economics of setting this entire construct up have about a 10 year break-even. It is painfully expensive upfront. That said, from the perspective of 6s, this is a strategic investment to be first and to demonstrate to the community over time why an increased debt ceiling is both justified and helpful. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.065340909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/charlesstlouis",
                    "index": "#26",
                    "likes": "0",
                    "time": "09/09/2020-17:12:18",
                    "content": "This proposal has now been moved to the Request for Comments (RFC) phase and will have a 1 month feedback period before being eligible for Formal Submission. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#27",
                    "likes": "1",
                    "time": "18/09/2020-09:51:18",
                    "content": "Updated a few section of the MIP based on community feedback. Including general rephrasing to be from the DAO perspective as well as a Footnote on the conditional nature of the future possible requirements of the Trustee. Term Sheet updates:  Revolving Facility Pay-down requirements Interest Rate variable controlled by MKR governance (MKR Risk Adjustment) LendCo Bank Requirements Trust Agreement requirements Expanded Tenants list (requested by a real-estate developer)  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#28",
                    "likes": "2",
                    "time": "18/09/2020-12:37:30",
                    "content": "In the past few weeks, I have had multiple calls with MKR holders, both large and small. A common theme has been the request for an extended Q&A session(s) and a step-by-step MIP walkthrough call in addition to the collateral on-boarding calls. As real-world assets as collateral are becoming a priority to help with the peg, I am proposing two zoom conference calls next week (and more as needed) to allow anyone from the community to ask questions about any part of the contemplated structure in the MIP and the business of lending capital in the credit tenant lease space. I propose starting these calls after MKR community call (Tuesday) and MKR governnace call (Thursday). Updated: DoI - Off-chain Asset backed lender to onboard Real World Assets - Extended Q&A ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.165584415584416
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#29",
                    "likes": "3",
                    "time": "01/10/2020-16:01:00",
                    "content": "This proposal has been moved to the Formal Submitted phase. While the proposal itself cannot change, please continue to ask questions publicly or privately. I will be scheduling another call(s) for extended Q&A next week. Topics will include, the technical implementation, the legal structures (and secured nature of the transaction), and the money flow and in general how and why it is a good fit for MakerDAO with regard to risk profile. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.964285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#30",
                    "likes": "3",
                    "time": "28/10/2020-10:47:41",
                    "content": "    mrabino1:  General Next Steps  Declaration of Intent (submitted) Community discussion / debate (RFC) Formal submission of proposals for Governance cycle Inclusion of polls for proposals Governance poll for proposals Executive vote for proposals (including the appointment of the Maker Representative(s)  If this proposal is accepted along with MIP21,  the initial debt ceiling would be voted on but would be conditionally set to zero following the Maker Representative report (below) 6s team then deploys the structure contemplated herein alongside with the Maker Representative     Once the Maker Representative & 6s report to the community that all legal documents / entities are completely in place, a second executive vote would be held to implement the first debt ceiling as agreed in the first executive vote.    This declaration of intent has now passed governance with an executive vote. General Next Steps / Status Report DONE:  Declaration of Intent (done) Community discussion / debate (done) Formal submission of proposals for Governance cycle (done) Inclusion of polls for proposals (done) Governance poll for proposals & Initial Maker Representatives (done) Executive vote for proposals (done)  PENDING / IN PROGRESS:  6s team then deploys the structure contemplated herein alongside with the Maker Representative (PENDING) Once the Maker Representative & 6s report to the community that all legal documents / entities are completely in place, a second executive vote would be held to implement the first debt ceiling as agreed in the first executive vote. (PENDING)  NOTE: With this final action, 6s would be able cause DAI to be minted and sent along the secured conduit to the Trust. (PENDING)    CURRENT REPORT: 6s is actively engaged with one primary trustee right now (and another as a backup). Our first hurdle has been a regulatory concern on behalf of the bank and the source of funds. Once this issue has been addressed to their satisfaction, 6s will engage with Trustee’s counsel to start on the Trust Agreement. Day for day slip right now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6515567765567765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/freehold",
                    "index": "#31",
                    "likes": "0",
                    "time": "15/11/2022-23:59:42",
                    "content": "I know this is very long after the fact but out of curiosity we’re there any Flossie’s or considerations for AML when off-ramping DAI to $USD and into senior secured lending positions with end borrowers? Seems like the only outstanding question in my mind. This is a super compelling use-case! Can’t wait to see more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3694444444444445
                }
            ]
        }
    ],
    "group_index": "2651"
}