{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/why-do-developers-join-crypto-web3-and-keep-contributing-to-the-space-insights-that-fuel-sustainable-developer-growth-strategies-at-makerdao/13194",
            "title": "Why do developers join crypto/Web3 and keep contributing to the space? Insights that fuel sustainable developer growth strategies at MakerDAO ",
            "index": 13194,
            "category": [
                "Core Units",
                "Sustainable Ecosystem Scaling"
            ],
            "tags": [
                "summary",
                "research",
                "developers",
                "x-ray"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Lenkla",
                    "index": "#1",
                    "likes": "15",
                    "time": "11/02/2022-17:57:49",
                    "content": "At @SES-Core-Unit we believe that for the crypto industry to truly reach its potential, we must be able to scale up and onboard significantly more developers and technical talent - in a sustainable, repeatable, and systematic way - regardless of crypto market cycles. MakerDAO contributors are at the heart of a healthy ecosystem and an important moat that we seek to actively grow and retain. Our research project X-Ray focuses exactly on that - collecting and analyzing data about developer talent, turning these insights into actions that can help us address both opportunities and bottlenecks. We’re excited to share with you our second major report on the developer journeys into and inside of crypto & Web3 ecosystems. This is a result of an ecosystem-wide effort reaching far beyond the MakerDAO community.** Thanks to this collaboration, we were able to collect responses from 519 developers, representing 140 crypto ecosystems and 20 different industries outside of crypto. For this update, we will focus heavily on the MakerDAO developer profile insights. Our path towards sustainable developer growth  Let’s begin by highlighting some of the findings that our research has surfaced & how we got here: In the previous X-Ray status update, we collected the most useful developer relation strategies & tactics across the funnel from the devrel experts. Through this benchmarking study, we have understood How we can tackle sustainable developer growth using different strategies. Now, Electric Capital’s developer research helped us to frame and understand What the problem/opportunity is for the ecosystem and Maker specifically. We can say with solid evidence that in 2021, many new developers crossed the chasm, and made the jump into crypto/Web3 contribution. Per the 2021 report, some 18K+ developers are now contributing to the space on a consistent basis. Both developer talent and capital are flooding into the crypto/Web3 ecosystem at a rapid pace, indicating growth. However, we see headwinds on the horizon.  Our recommendations for bringing more developers into crypto/Web3 are:  For MakerDAO specifically, developer growth is of particular importance and quite the challenge. Despite the incredible success of the Maker Protocol, the developer growth rate has been low compared to other ecosystems. The fact is, that as one of the most successful protocols in DeFi today, we lag behind in our ability to grow the developer community.  Electric Capital Developer Report 2021 DeFi s.1311920×1080 168 KB   What would MakerDAO be capable of with a large, steadily growing, developer community?  The final piece of the puzzle is to understand Why developers are onboarding into crypto/Web3 in general, and specifically related to MakerDAO. Our research progressed through the crypto/Web3 developer journey survey. Crypto/Web3 developer journey survey findings We have analyzed 519 responses and categorised them into 3 distinct developer profiles:   Crypto Curious developers (outside of crypto but interested to join full-time)  Current Crypto developers (contributing to crypto/Web3)  MakerDAO developers (past or present Maker protocol contributors)  For each of these profiles, we have mapped the developer journey consisting of 3 main stages:   Awareness (insights into crypto discovery, learning, interests, and AHA! moments)  Onboarding (insights into focused learning, top resources, tech & career bottlenecks, and AHA! moments)  Retention (insights into satisfaction, most loved & frustrating, and reasons for churn)  Key Takeaways Across the Journey for MakerDAO developers  MakerDAO developer profile1920×1080 289 KB  Let’s share the key takeaways, especially those relevant for the MakerDAO: Awareness Takeaways Being on the frontier of technology is the primary driver that has pulled developers into Crypto/Web3.  Screenshot 2022-02-08 at 15.53.111759×747 141 KB  Most current and crypto curious developers have discovered crypto through their social circles or popular social networks like twitter and reddit.  Screenshot 2022-02-09 at 18.26.411495×645 129 KB  The crypto AHA! moments for prospective crypto devs revolve around the tech’s vision, problems, and builders. For current crypto devs, problems, use cases, and builders ranked the highest. Onboarding Takeaways Once developers are committed to a crypto career, they have clear goals in terms of learning the technology. While the top goals “understand what was possible to build with tech,” and “build a dapp” are common for all, prospective devs were focused on “getting a job” while current devs wanted to “understand how the tech executed on the values/ethos of crypto.” The values and ethos of the technology are tied very closely with the things that matter the most to its builders. The majority of developers also said they lacked the resources when onboarding into the ecosystem. For current crypto devs, “up-to-date documentation\", “how tech guides” and \"crypto career-specific information” were absent. MakerDAO devs shared that onboarding bottlenecks could be further alleviated by “making it easier to find all the documentation and the context, in which it fits” together with “better explanations of Maker concepts and hands-on help aimed at newcomers.” However, the team, community, and the breadth of documentation are mentioned as the strengths in MakerDAO’s onboarding process. It is worth bearing in mind that the technical conviction does not mirror career conviction. Many current crypto devs were facing “uncertainty around the longevity of the industry\" (fortunately not as common anymore), “lack of technical knowledge,” and “a steep learning curve.”  Screenshot 2022-02-08 at 16.23.461763×757 192 KB  For MakerDAO devs, there is an additional set of hurdles that they have to overcome. Specifically the “protocol complexity”, “previous commitments”, and “feeling of being intimidated by the skilled team and the community.”  Screenshot 2022-02-08 at 16.26.181749×733 158 KB  Retention Takeaways We also found that developers in crypto are very satisfied with their careers. The averages for all crypto developers being 8.4. When segmented to developers that work within DeFi the score reduced slightly to 7.9. We were really pleased to see the MakerDAO developer satisfaction average a very high 9.2.  Screenshot 2022-02-08 at 16.40.051748×715 118 KB  We also asked developers what are the most frustrating aspects of working in the crypto industry. The answers centered around the “uncertainty of regulation”, “hype from speculators,” and “negative crypto narratives in the media.”  Screenshot 2022-02-08 at 16.42.291748×724 153 KB  Frustrations specific to MakerDAO developer/contributor experience include \"coordination, collaboration & knowledge sharing among core units” and the aspects in which “the documentation & learning materials could be improved.”  Screenshot 2022-02-08 at 16.46.311754×510 209 KB  We also looked to understand Why Maker developers stopped contributing to the project. The top reason was “leaving to start their own project”, showcasing the caliber of developers that have worked on the Maker protocol over the years (Maker Mafia ). A smaller number of developers left for reasons that should be evaluated and tracked over time to ensure the health of the developer community at MakerDAO. (We have only scratched the surface here, so please feel free to explore the findings more closely in the long report further linking to 3 distinct developer profiles.) Insight without action is wasted effort just as action without momentum is wasted energy  Screenshot 2022-02-08 at 16.52.181754×949 136 KB  The insights gathered so far helped us first identify and then refine the strategic opportunities. Having the tactical ways to solve challenges and act on insights identified, we have to get the ball rolling. The SES team is using the X-Ray insights actively to inform its current and future initiatives. For instance, when it comes to developer awareness and the strategic opportunities that we see, the SES initiative of incubating outreach core units (like Marcomms CU) will greatly benefit from the insights that we have gathered. Similarly, when it comes to developer onboarding and the strategic opportunities we see, the SES initiative of incubating Maker Academy core unit is already benefiting from the insights we have gathered. We have published the insights gathered from developer research, shared more about the refined strategic opportunities, along with the SES initiatives that were informed by these insights both on the SES blog and presented them at the status update call. We invite you to explore these resources in your preferred format and pace, and welcome your feedback and questions. You can find our work and contacts at ses.makerdao.network/xray   X-Ray team, @Lenkla @Haiku @teep ** We want to thank our generous ecosystem partners for incentivising the research by providing conference tickets to: Spagett-ETH (3), ETHRio (3), ETHCC (2), and Devcon (1). Big thanks goes to Strategic Happiness CU for providing 10 Maker swag care packages. Appreciation for help with distributing the survey goes to BanklessDAO, GitcoinDAO, DAOmasters, PrimeDAO, Questbook, Buildspace, Developer DAO, MetaGammDelta, ETHDenver, DystopiaLabs, ETHGlobal, LisCon, L2Beat, ETHworks, 1inch, Autonolas, influential people in the space, and all the friends that wanted to help us! Lastly, big THANK YOU goes to all participating developers for dedicating their time and sharing their experiences with us for the sake of reaching sustainable developer growth in the crypto & Web3 ecosystems.  ",
                    "links": [
                        "https://ses.makerdao.network/xray",
                        "https://drive.google.com/file/d/1FGfIdQBRTOG0kYPsNwFOGCMQw7xi9eSJ/view?usp=sharing",
                        "https://medium.com/electric-capital/electric-capital-developer-report-2021-f37874efea6d",
                        "https://medium.com/electric-capital/electric-capital-developer-report-2021-f37874efea6d",
                        "https://app.pitch.com/app/presentation/72d0ff81-20ef-403e-bd48-ab79d0393f5b/316bfd9a-4ff5-459b-9762-3a86ebe8e54a",
                        "https://app.pitch.com/app/presentation/72d0ff81-20ef-403e-bd48-ab79d0393f5b/94b76da8-7fac-49cd-9a9e-183f38cb922c",
                        "https://app.pitch.com/app/presentation/72d0ff81-20ef-403e-bd48-ab79d0393f5b/7c258e9b-3b67-4627-a7a2-9fd7b1d8a6c1",
                        "https://app.pitch.com/app/presentation/72d0ff81-20ef-403e-bd48-ab79d0393f5b/1c566242-70c3-4459-84d8-410f0551a883",
                        "https://ses.makerdao.network/xray/strategic-opportunities",
                        "https://www.youtube.com/watch?v=mdybsuf3w8I&t=1s",
                        "https://ses.makerdao.network/Why-do-developers-join-crypto-Web3-and-keep-contributing-to-the-space-9c3166edc7a04d998dd142b1ead659fe",
                        "https://www.youtube.com/watch?v=BwsrYY2zlJQ",
                        "https://ses.makerdao.network/xray",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-10-17-2022/13292",
                        "https://forum.makerdao.com/t/scaling-web3-workforce-towards-a-decentralized-impact-based-talent-hiring-solution/17785",
                        "https://forum.makerdao.com/t/escalar-la-fuerza-laboral-de-web3-hacia-una-solucion-de-contratacion-de-talento-descentralizada-y-basada-en-el-impacto-traduccion/17806"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.88534240969115
                },
                {
                    "author_link": "https://forum.makerdao.com/u/manomad",
                    "index": "#2",
                    "likes": "3",
                    "time": "13/02/2022-04:02:51",
                    "content": "Great job!!! Congrats to all the team! I strongly believe we should extend this amazing analysis to the decision process of a developer right before joining MakerDAO - when a developer has 3 offers on the table -  (not in general or in other DAOs) and also (at least) during the 3 first months of a developer life within MakerDAO. I have some ideas to share! Bravo!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3525958994708995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "4",
                    "time": "14/02/2022-15:48:53",
                    "content": "Wowzers this research is super informative! Thank you Lenkla. Hopefully Maker Academy can help with some of the obstacles of onboarding new Devs and others alike into MakerDAO.     Lenkla:  Frustrations specific to MakerDAO developer/contributor experience include \"coordination, collaboration & knowledge sharing among core units” and the aspects in which “the documentation & learning materials could be improved.”   Totally! It feels like this has been an ongoing concern for years now. Personally, I’m Looking forward to the alignment of this DAO—and perhaps the reasons why a United vision has not come into fruition is because:  everyone is working remotely we are scattered across the globe the pandemic does not help with in-person-meetings which can lead to more results, CUs bonding, efficiency, and a united vision. remote mandated actors meetings seem to not result in much alignment (can’t get much done in 1 hour) perhaps remote mandated actors meeting are too crowded add to that the communication to the community via the Forum is too complex/opaque which leads to community members making their own assumptions Delegates + MKR token owners are operating blind folded and have no idea of the vision the mandated actors have agreed upon (if any) or they create their own opinions on a sole vision, as opposed to a united vision, while Core Units push forward a different vision.  Okay, maybe I went too far beyond the intended subject, but hopefully you get my drift.  I really believe one motivating and important factor that is missing is a united vision and getting new Devs and other hires to buy-into that vision. And one way that can be accomplished is by bonding together, in-person and showcasing why we are All passionate about MakerDAO. Getting to know each other is super important. While we All have different views and believes, being together and talking things out will help scale this DAO. I totally believe in the concept of human interaction, with the hope that once we aligned and scale such vision, everything will eventually be Automated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.500891265597147
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teep",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/02/2022-17:25:11",
                    "content": "Thanks for taking the time to leave some thoughts @flipflopflapdelegate! We are working with Maker Academy to ensure the output from these results are harnessed to make their content as impactful as possible. Your point around vision being a key motivating factor for contributors came up repeatedly through our results and is very relevant as we seek to increasingly bring contributors over from “traditional” spaces into Maker. We completely agree with the points you make and it’s good to see you bring up some specific examples! We believe some of these align directly with a couple of the Strategic Opportunities identified from our research. Specifically: (2) Facilitate connections between new and existing developers, using Web3 as common ground - fostering the creation of a cohesive DAO culture. As well as: (4) Reduce confusion and create contributor clarity through a focal point developer/contributor website - harnessing decentralization while reducing disorganization. While these are developer-focused for the purpose of the work at X-Ray, we also believe that work on these areas will be beneficial for the contributor community at large at MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.078803339517624
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#5",
                    "likes": "2",
                    "time": "22/02/2022-00:33:51",
                    "content": "Thanks for taking the time to put this together! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "23/05/2022-00:34:12",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}