{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/real-world-assets-as-a-vampire-attack-on-crypto/17480",
            "title": "Real World Assets as a Vampire Attack on Crypto ",
            "index": 17480,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#1",
                    "likes": "22",
                    "time": "27/08/2022-18:15:42",
                    "content": "I’ve generally taken the crypto-native approach with MakerDAO and have advocated against taking on collateral that exposes us to unnecessary or existential legal risk. I want to elaborate on some thoughts regarding the implementation of Real World Assets (RWA) at Maker that I believe not only harms Dai in the long-run, but potentially leeches much of the value away from crypto. Contrary to scaling our protocol, RWA’s as implemented draw value from Dai holders and return it to the TradFi industries we’re trying to disrupt. First we should discuss the mechanics behind a RWA collateral type at MakerDAO. When a new RWA is onboarded to the protocol, a single new ERC20 token is minted to represent the outstanding value of the loan and then collateralized into the system. In the event of an emergency shutdown, this token is distributed to Dai holders in proportion to the amount of Dai being backed by the debt. You can think of this token, therefore, as a receipt or IOU for the RWA loan that was issued. If the system is re-launched afterward, the idea is that users would be able to either deposit this token into the new system and await repayment, or a secondary market may develop for those wishing to collect the outstanding debt through other means. In either case, it’s important to remember that Dai backed by RWA’s is effectively backed by debt represented by IOUs and subject to whatever legal environment and agreements that they are a party to. The value of this collateral is therefore based only on the speculative value that it will be repaid with interest. I’ve made an attempt to demonstrate the mechanics of a RWA transaction in the following illustration, but the general idea is that a borrower will approach MakerDAO with a borrow request, as an example, for 100 million Dai. That request is evaluated and, if approved, is onboarded as a new collateral type. As mentioned above, that collateral is effectively an IOU to Dai holders representing the obligation of the borrower to repay the loan. This leaves an IOU for 100m Dai that is held as backing for the 100m new Dai that is minted and sent to the borrower. In this example, we’ll assume that the borrower is using the PSM to convert their Dai into USDC, they’ll pass the newly minted Dai through the PSM, which burns 100m Dai from circulation and sends 100m USDC to their wallet. At this point there’s effectively no change in aggregate Dai supply and there’s 100m less USDC in the PSM. The USDC will ultimately be passed through Coinbase/Circle, where the net result is that there’s 100m less USDC in existence and 100m additional dollars in the bank. At the end of this cycle, the net result is that the RWA borrower is ahead 100m Dai and Dai holders retain an IOU with a face value of 100m, there is no net change to total Dai supply as a result of this operation.  Screenshot from 2022-08-27 14-21-191402×720 130 KB  At this point, Dai holders and Maker governors are completely at the mercy of various and often hostile jurisdictions to effectuate repayment of the IOU’s. MakerDAO is not a bank but would need to explain it’s lending practice in jurisdictions where banking and lending is potentially highly regulated and traditional institutions are favored. The recent and tiring saga of Real World Finance at MakerDAO should give MKR holders some hesitation that aggressive collection would be available to it when push comes to shove. Furthermore, a large institution that is able to successfully convert an IOU to dollars is strongly incentivized to work with and encourage authorities to have Dai added to international sanction lists, which would effectively discharge their debt by precluding them from transacting in Dai. Pardon the Dumb and Dumber metaphor here, but Maker holders are sitting on a suitcase full of bearer assets with their own liquidity and value within the crypto ecosystem. Maker holders should avoid allowing Dai to become too heavily backed by RWA loans lest they, like Lloyd Christmas, end up replacing all of the real value with spurious IOU’s of questionable long-term value. Since net Dai is neither created nor destroyed with RWA transactions, they do not scale the protocol as many have promised. We need to see them for what they are, which are vehicles for transferring value away from cryptoassets and back to the TradFi institutions that are borrowing from the protocol. When the time is right, these borrowers will not hesitate to pull the rug from MKR and Dai holders by seeking sanctions and booking a profit in the real world while leaving Dai holders undercollateralized and unable to liquidate IOU’s. This will set the industry back for years, if it recovers at all.  ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-13-traduccion/17681",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-13/17677",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/14",
                        "https://forum.makerdao.com/t/signal-request-mkr-pro-rata-vesting-community-sentiment-poll/17350/48",
                        "https://forum.makerdao.com/t/real-world-assets-como-un-ataque-vampiro-a-cripto-traduccion/17563",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-25-31-de-agosto-del-2022/17644"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.620461104552014
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#2",
                    "likes": "0",
                    "time": "27/08/2022-18:38:24",
                    "content": "I fully support your point of view, RWA if it comes to fruition (which I am a faithful follower) should not exceed the budget of 25% of Maker and DAI, but if we apply this assumption to Maker activity currently, the sanctions towards USDC would be at the door of the day, at any moment Coinbase or Circle can be considered as unreal value and be sanctioned, or even worse, DAI backed USDC can be sanctioned, if we see according to sanctions we will always live in fear that we will be sanctioned late early. And there is clearly talk of the United States market, which is quite detailed, but there are many countries that need loans or companies from different countries that are not directly governed by the rules of the American Treasury, in the same way it is still quite difficult to reach an agreement and it is an uncertain future, but it should at least be taken into consideration ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8954545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/08/2022-18:50:09",
                    "content": "Thanks for the post. I agree on all key ideas and the general skepticism (as of now 2022, things might change in 3-4 years) on RWAs within Maker.     brianmcmichael:  At the end of this cycle, the net result is that the RWA borrower is ahead 100m Dai and Dai holders retain an IOU with a face value of 100m, there is no net change to total Dai supply as a result of this operation.   This seems correct to me.     brianmcmichael:  Since net Dai is neither created nor destroyed with RWA transactions, they do not scale the protocol as many have promised.   I am less sure about this conclusion though. If Maker becomes an attractive lender (forget for a sec that this is a bad idea for MakerDAO), then there will be a natural market incentive to fuel the system by converting USDC to DAI, by PSM. This would increase the total amount of DAI in the market. As in your discussion, what really gets sucked out from crypto at each loan is the USDC. In other words: for each 100m USD loan, we have:  100m DAI generated  (+100m DAI)  100m DAI converted to USDC using PSM  (-100m DAI)  100m USDC going to coinbase and getting converted to USD  (-100m USDC)   For (2) to work, we need a constant influx of USDC into the PSM => creation of DAI => growth of DAI. Remark: if this ‘creation of DAI’ with USDC/PSM can be considered an actual ‘growth of the protocol’ is another topic of discussion, of course. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.331140350877193
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#4",
                    "likes": "13",
                    "time": "27/08/2022-18:59:39",
                    "content": "Scaling comes from generating a profit off these real world loans, which allows us to share revenue with Dai holders through mechanisms like the DSR. That is what will drive demand for Dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#5",
                    "likes": "1",
                    "time": "27/08/2022-19:01:12",
                    "content": "Another option is fix some fee on the usage of the PSM (at least in the direction USDC => DAI), so that we, at the very least can profit from being a “USDC wrapper”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.2750000000000004
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#6",
                    "likes": "0",
                    "time": "27/08/2022-19:16:14",
                    "content": "Exactly, although the only thing that looks wrong is the move from Defi to TradFi, which is somewhat right, and then in a hypothetical case that they freeze the assets in TradFi, if that thought of “sanction” will always be there, it could also happen to us without RWA ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.044642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#7",
                    "likes": "1",
                    "time": "27/08/2022-19:26:32",
                    "content": "    iammeeoh:  Another option is fix some fee on the usage of the PSM (at least in the direction USDC => DAI), so that we, at the very least can profit from being a “USDC wrapper”.   I’ve advocated elsewhere that it’s time to increase the tin on the PSM to reduce demand for more USDC by the system. Only when the PSM is empty or close to empty would we want to increase the tout value to start slowing the exit of USDC. For now though, a 1 Dai → 1 USDC exchange rate out of the PSM, while adding friction on the side of onboarding USDC, is the most orderly solution we have to slowing the beast that has consumed us. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.078571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#8",
                    "likes": "6",
                    "time": "27/08/2022-19:42:26",
                    "content": "    brianmcmichael:  Since net Dai is neither created nor destroyed with RWA transactions, they do not scale the protocol as many have promised.   This is sort of like saying, when someone mints DAI from ETH-A and then cashes proceeds out to their bank (swap through PSM for USDC, send to coinbase, send ACH to their bank account), net DAI circulating is the same so there is no scaling. Sure circulating supply remains the same but Maker’s revenue generating asset base increases (replace PSM-USDC earning nothing with ETH-A earning something). Still definitely a positive, as it improves Maker’s financial condition, regardless of lack of impact on DAI supply.     brianmcmichael:  We need to see them for what they are, which are vehicles for transferring value away from cryptoassets and back to the TradFi institutions that are borrowing from the protocol.   I don’t think extending credit to the real world economy is negative. People need financing for homes, small businesses, autos, and tons of other things. There’s definitely some yuck factor having this pass through traditional bank systems that can be fairly corrupt, but I don’t think this means we should restrict credit flows to only leveraging crypto. This is a large part of why defi gets a bad wrap - being a circular money game that doesn’t allocate funding towards things that improve the lives of regular people.     brianmcmichael:  When the time is right, these borrowers will not hesitate to pull the rug from MKR and Dai holders by seeking sanctions and booking a profit in the real world while leaving Dai holders undercollateralized and unable to liquidate IOU’s.   Agree that there could be some negative incentives at play here working with large incumbent financial institutions. But I doubt that any potential sanctions or regulatory action would allow them to book the loans as a profit and avoid repayment. These assets ultimately belong to DAI holders, and governments rugging retail to give free money to large banks is probably too big of a narrative violation even for the US or EU. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-august-2022/17615"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.879535905271199
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#9",
                    "likes": "6",
                    "time": "27/08/2022-19:51:23",
                    "content": "    monet-supply:  This is sort of like saying, when someone mints DAI from ETH-A and then cashes proceeds out to their bank (swap through PSM for USDC, send to coinbase, send ACH to their bank account), net DAI circulating is the same so there is no scaling.   I’m not saying this at all. In this case we have an objectively valuable asset on our books that can be liquidated to recapitalize the protocol. We have no such guarantee with IOU’s.     monet-supply:  being a circular money game that doesn’t allocate funding towards things that improve the lives of regular people.   The dream is that we’d build a circular economy that would improve the lives of people without the need for the legacy banking system.     monet-supply:  Agree that there could be some negative incentives at play here working with large incumbent financial institutions. But I doubt that any potential sanctions or regulatory action would allow them to book the loans as a profit and avoid repayment.   We agree to disagree here. Sanctions mean that they legally will not be allowed to repay us. And it’s naive to think they’ll just come out and say they’re doing it to help the borrowers. They’ll say we’ve been facilitating illicit funds and no one of influence will question it. The market cap of Société Générale S.A. alone is 40 times higher than that of MKR. We are a small fish and not politically significant enough to think that we can’t be shut down by regulators without a second thought. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.71468253968254
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#10",
                    "likes": "1",
                    "time": "27/08/2022-19:54:16",
                    "content": "If Maker gets sanctioned, it won’t matter to Dai holders if the collateral is Eth or USDC. You aren’t legally allowed to move your Dai or redeem any vaults. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#11",
                    "likes": "2",
                    "time": "27/08/2022-19:56:56",
                    "content": "    CodeKnight:  If Maker gets sanctioned, it won’t matter to Dai holders if the collateral is Eth or USDC. You aren’t legally allowed to move your Dai or redeem any vaults.   In certain jurisdictions. The protocol still has innate value for crypto leverageurs who wish to keep assets on-chain. Tornado Cash still works. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.035714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#12",
                    "likes": "4",
                    "time": "27/08/2022-20:07:56",
                    "content": "Developers who work on it will get arrested, while MKR and Dai holders in various jurisdictions will have to write off their assets or get arrested too. Meanwhile, crypto leveragers are going to just move to another protocol or exchange where they won’t potentially face jail time and MakerDAO will die.  There is no shortage of entities providing on chain leverage.     brianmcmichael:  Tornado Cash still works.   No, it doesn’t. Tornado Cash requires other people to mix your assets with and that dried up the moment it was sanctioned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#13",
                    "likes": "3",
                    "time": "27/08/2022-20:51:38",
                    "content": "    CodeKnight:  Developers who work on it will get arrested, while MKR and Dai holders in various jurisdictions will have to write off their assets or get arrested too.   Yes. Nation states are in the decline, and we’re all seeing them become increasingly more violent and unreasonable in their throes. Tornado Cash will survive them, and if we do Dai right, we can too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.982142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#14",
                    "likes": "1",
                    "time": "27/08/2022-20:51:41",
                    "content": "I fully support you, Tornado Cash is simply an evil that needed to be overcome, but I can disagree that it no longer works, since the DAI TVL sanction in the protocol has risen and remained at 2021 levels  IMG_20220827_1649491080×1094 87.5 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 0.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#15",
                    "likes": "8",
                    "time": "27/08/2022-22:33:08",
                    "content": "    brianmcmichael:  Yes. Nation states are in the decline, and we’re all seeing them become increasingly more violent and unreasonable in their throes. Tornado Cash will survive them, and if we do Dai right, we can too.   This might not be a popular take but it’s important to be realistic: if there is some kind of truly coordinated regulatory crackdown on all of DeFi, the industry cannot survive. DAI may well continue to technically function, but it will be an irrelevant pariah bereft of users. I personally don’t find this ‘post-apocalypse survivor’ vision for Maker very inspiring. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8647186147186146
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#16",
                    "likes": "1",
                    "time": "27/08/2022-22:34:33",
                    "content": "    Matt_NZ:  if there is some kind of truly coordinated regulatory crackdown on all of DeFi, the industry cannot survive.   This is the way I tend to see it as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#17",
                    "likes": "3",
                    "time": "27/08/2022-22:59:14",
                    "content": "    Matt_NZ:  I personally don’t find this ‘post-apocalypse survivor’ vision for Maker very inspiring.   The difference between you and me is that you think of the fall of the industrial era nation-state as an apocalypse and not as an inevitable part of the path of human history. Do you want to be a part of creating what comes next, something better, or do you want to help prop the old thing up? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.892857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#18",
                    "likes": "8",
                    "time": "28/08/2022-00:46:56",
                    "content": "Lots to chew on in this thread, lot of great discussion.     brianmcmichael:  the fall of the industrial era nation-state as an apocalypse and not as an inevitable part of the path of human history.   I think this type of thinking is counter-intuitive to executing on the latter part of this post. To actually “build something better” requires a cathedral building mindset, as in you’re building something that you may never see the completion of. To address an unpredictable event as large as the failure of the nation-state seems a step too far. I think what you’re saying is that you want to account for it as a risk, build the foundational platform necessary to mitigate such an event, and then monitor closely. The counter-proposal to this doesn’t dismiss this, but simply would say that other approaches can be taken simultaneously, without having to focus the entire project on only this event. Especially when considering this could be a 100-year timeline before the event realized. EDIT: Adding a more substantive response. You’re placing the entire emphasis of the protocol on a world that doesn’t exist today. If not broad payments usage, what is the underlying value Dai can anchor upon? This is more succinctly addressed in the other post, around the path to making Dai a usable currency. To bet purely on decentralized economies is as risky as relying on adversarial legal systems IMO. The net positive of Dai loans, wherever the end product goes, is in the earned revenue and the growing asset side of the balance sheet. Swapping DAI for USDC via the PSM is a mechanism for reducing net liabilities; is  this really any different from the DSR, other staking proposals, or any monetary policy that encourages negative Dai cashflows for savers? I view the PSM as a tool akin to FX reserves, which is obviously useful with a tight exchange rate. RWA “tokens” are much more than Lloyd Christmas IOUs (although we’re definitely at the “our pets heads are falling off” stage of the industry). Enforcement and responsibility can be incredibly complex - legacy institutions, offshore financial centers, and international participants have been playing these games for years before crypto has. You could even avoid legal claims in US jurisdictions and denominated in US dollars all-together if you really wanted too. It’s not a one size fits all and there’s a lot more here that we as a community haven’t dug into yet. Its worth mentioning, that even with zero RWA, Maker would not be immune to the blacklist fallout that sanctions can bring. @elidco says it better than I. “What if he shot me in the face?” does come to mind… ",
                    "links": [
                        "https://forum.makerdao.com/t/the-real-legal-risks/17207/37"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.498568534178999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#19",
                    "likes": "7",
                    "time": "28/08/2022-10:19:31",
                    "content": "Technically, it’s an IOU not to the lender (that wouldn’t repay as it is not legally binding) but to orphaned entity like RWA Foundation which sits in Cayman (for MIP65 it ill be BVI). Those places have a key value proposition in their rule of law and legal system. It is unclear they would rug MakerDAO for a few billions. This construct allows us to use the legal system to recoup defaulting investments. Speaking of IOU (and DAI is no more than an IOU, an unsecured debt of MakerDAO), it is telling that governance is discussing rugging DAI holders by breaking the peg and YOLOing the balance sheet in speculative assets (ETH). I do agree that RWA, at this stage are used to invest our balance sheet, not to increase circulating DAI. At the same time, it is our current problem for the last 2 years. Increasing DAI demand will come from DSR and creating a robust payment system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.704545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#20",
                    "likes": "1",
                    "time": "28/08/2022-11:18:14",
                    "content": "    brianmcmichael:  The difference between you and me is that you think of the fall of the industrial era nation-state as an apocalypse and not as an inevitable part of the path of human history. Do you want to be a part of creating what comes next, something better, or do you want to help prop the old thing up?   I greatly admire the intent and efforts behind this thread. I think the immediate need is to focus on how to even survive the “apocalypse”, whatever the subjective definition of that is, let alone be able to build something better subsequently. I don’t take that for granted, especially how things have been playing out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.909090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#21",
                    "likes": "2",
                    "time": "28/08/2022-13:59:05",
                    "content": "You are absolutely right, I do not see it feasible to undo the collaterals and focus fully on Ethereum, less in a bear market that surely has not touched the floor,     SebVentures:  Increasing DAI demand will come from DSR and creating a robust payment system.   Why not create a Fintech and make DAI serve as a payment method with international cards? Placing it in a country with the lowest means of regulation is not risky, since they seek the creation of small investors. The government on duty will not want to eliminate a Fintech that is the only way out to acquire things from abroad, it is an organic way to get TradFi money, turn it into DeFi and vice versa, and there are no competitors in that field, at least here in Latin America ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.049319727891156
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#22",
                    "likes": "0",
                    "time": "28/08/2022-14:48:55",
                    "content": "RWA are a good way to invest DAI and generate a yield on idle DAI to reinvest in the protocol but IMO it should not exceed a small portion of total DAI (<3-5% range of total DAI supply). Additionally since the total addressable market is very large and deep expertise is required for each deal, instead of being open to all markets and opportunities there needs to be a clear market niche and vision to go after. E.g. It could be ESG related initiatives (i.e. clean money) initiative starting in a target region or country (that views crypto favorably). That way the team can be built around in a much more structured manner, develop market knowledge and reduce existential risks. At this point, given the recent team struggles in RWA and lack of strategic vision, it might be best to place it in the back burner before it disrupts other priorities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.7559523809523805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#23",
                    "likes": "10",
                    "time": "28/08/2022-17:34:30",
                    "content": "I find myself agreeing with many of the pro/con viewpoints in the above posts. As having supported the integration of RWA with Maker since March 2021, I can say, with all honesty, that the current RWA program does nothing too interesting. I mean, the Delaware statutory trust is not, in any way, a new invention and real estate lending and loan participations are fairly standard. Even Wall Street has gotten into the “Clean Money” thesis. Sure, I am proud of what we have accomplished with HVB and others, but it is not yet  transformative. I think, however, that the above discussions truly miss a key feature of what Maker can achieve in the RWA space when combined with blockchain. IMHO - Maker should leverage its privileged position as the issuer of DAI to promote the digitization, financialization, and commoditization of new real world assets - assets that start digitally native, are tied to oracles (internet of things), and can, as a result of the first two, be more fungible. With DAI pegged to the US dollar, Maker can most assuredly create value on a geographically broad and inclusive basis given the wide-spread acceptance of the dollar. MKR should not be viewed as a low-cost source of capital. Frankly, that is the source of many of the issues surrounding RWAs - many projects view Maker as a low-cost of capital and as their ticket to start-up success or continuation as a business. I know this as a fact as I had, late in 2021, proposed MD Irradiance as a MIP6 applicant for construction-only solar finance (long-since put into hibernation since I thought I could add more value by supporting Maker directly). Maker has a privileged position in the crypto-space. It can choose to remain a niche-crypto product. Or it can leverage its position and create new value. I cannot conclude that new value creation equates to a “vampire attack on crypto”. And as President Franklin D. Roosevelt said during his first inaugural address in 1933 - [L]et me assert my firm belief that the only thing we have to fear is . . . fear itself - nameless, unreasoning, unjustified terror which paralyzes needed efforts to convert retreat into advance.\" We should harness Maker’s position to advance . . . not retreat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.913547237076648
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#24",
                    "likes": "3",
                    "time": "28/08/2022-20:53:29",
                    "content": "This is a great post and I agree that the real value of Maker and RWA comes from actually taking finance to the next level, not just arbing crypto with wall street. That is even more clear now, since this direction of innovation could take us into “Physically resilient” territory such as RWA collateral we can remotely turn on/off and as a result liquidate the cryptographic key rather than the physical thing itself. Just hypothetically I’d be curious to hear  your personal opinion on this: Do you think it’s realistic that Maker can convince american politicians that we should be subject to special rules that means we would be allowed to both scale our reliance and dependence on the american legal and financial system as the backend to a product we provide (for profit, but with major public good upside such as Clean Money) to any end users anywhere in the world that needs it, even e.g. north korea or iran if they decide to use it, without being subject to sanctions or countermeasures? That is, Maker would be treated like a kind of global utility like linux rather than like a financial institution. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.606834975369458
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#25",
                    "likes": "2",
                    "time": "28/08/2022-21:03:18",
                    "content": "    SebVentures:  it is telling that governance is discussing rugging DAI holders by breaking the peg and YOLOing the balance sheet in speculative assets (ETH)   What a minute… didn’t you propose essentially this with Makershire Hathaway? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#26",
                    "likes": "1",
                    "time": "28/08/2022-21:12:49",
                    "content": "I think it would take an awful lot of lobbying.  There are reports of massive lobbying efforts underway in the general crypto space but I don’t know specifically what, if any, has been undertaken towards defi. It wouldn’t surprise me if there are a few. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TechnoSyndicator",
                    "index": "#27",
                    "likes": "4",
                    "time": "29/08/2022-01:38:22",
                    "content": "Even if you could achieve that status, financial utilities are subject to the impact of regionally imposed sanctions. Take SWIFT for example, the network respects requests for excluding sanctioned countries banks because not respecting those requests would result in the network itself (and its officers) being sanctioned instead. This is how much of the global regulation works, by downstream consequence rather than direct application. US FATCA works the exact same way, the threat of taxing participation US Dollar transactions forced most of the western world to comply with a US financial reporting and documentation law that had zero jurisdiction in their countries. Maker, at least for the medium term, obviously would not be particularly useful without access to US Dollars OR any of the currencies that interact with US Dollars (which is almost all of them…). Hence compliance with western regulations (including the US) will be needed as the network scales and becomes regulator-relevant. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.194444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#28",
                    "likes": "2",
                    "time": "29/08/2022-03:15:48",
                    "content": "In the long run I think this is highly doubtful without changes to the core protocol as I described here. In the very short term, the only plausible way may be to push compliance to the on/off ramps and be positioned more as an open utility/messaging protocol but you’d likely run into exactly what @TechnoSyndicator said above because there is no way to prevent sanctioned entities from interacting with DAI and creating their own on/off ramp in non-OFAC compliant countries with the current protocol. If DAI usage was decentralized and widely distributed, and the core was unable to be shut down, then maybe. Bitcoin and Ethereum have survived bans (for now) because of their censorship resistance and large global liquidity. I think by now they’re both too entrenched that the US is unlikely to ban them entirely at this point because it would be very unfavourable. Remember that both the protocols and native assets have been used by criminals and sanctioned entities, and OFAC has not sanctioned every Bitcoin or Ethereum address. Only specific ones. Importantly, this is because illicit funds can be tracked on those networks and blocked at on/off ramps effectively. DAI is no different in this regard for now. If this wasn’t the case then I think sanctions would be inevitable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.222832722832723
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#29",
                    "likes": "4",
                    "time": "29/08/2022-03:23:10",
                    "content": "    rune:  Do you think it’s realistic that Maker can convince american politicians that we should be subject to special rules that means we would be allowed to both scale our reliance and dependence on the american legal and financial system as the backend to a product we provide (for profit, but with major public good upside such as Clean Money) to any end users anywhere in the world that needs it, even e.g. north korea or iran if they decide to use it, without being subject to sanctions or countermeasures? That is, Maker would be treated like a kind of global utility like linux rather than like a financial institution.   This answer is absolutely yes; but it can’t be achieved through “convincing American politicians” or the formation of “special rules” for Maker. As with everything, there’s a “game within the game” that needs to be played. It is a political one, but politics is a story of narrative and fundamental truth, and we have the whole history of international economics to learn from. TLDR: First, Dai has already established itself fundamentally as a software protocol first and foremost, which then outsources compliance responsibilities to the MetaDAO. In the early stages of the Endgame, it incentivizes systemic reslience and economic revenue, above all else. The tangible changes to the Endgame come down to the narrative that is communicated and prioritizing diverse high-value market opportunities over arbitrary target allocations. Compliance doesn’t need to occur within the core protocol The Endgame structure allows us to make these assumptions about Maker:  Maker is a low-level protocol that exerts control over the core components of Dai, a stable value price instrument. The core principles of the protocol - permissionless, credibly-neutral, decentralized - are also the core value offerings in enabling a high-degree of efficiency and reliability. Higher-level usage of Dai that operates at the level of intermediary suppliers or end-users are distinctly separate entities from the core protocol. Any interface between higher-level entities and the core protocol is objectively and transparently managed, with as much separation as possible.  As long as these assumptions are adhered too, there is no reason to adopt compliance or regulatory mechanisms into the core of the protocol. The only relevant scrutiny would be in the interface with the MetaDAOs, but it’s fairly easy to imagine how any potential impact could be minimized. To maintain this requires narrative support more than anything, but it supports almost all existing models of software and technology policy that exist. MetaDAOs who oeprate in poltiically relevant areas are still subject to compliance, but given the economic incentives, they’d have every reason to avoid this. More on this later. The path to political adoption is the path to economic adoption Because Ethereum is decentralized infrastructure, Dai is inherently competing as an international currency. You can use a currency competition framework to understand how to exert influence over other political economies. The principles I’m describing here are mostly adapted from Benjamin Cohen’s work, Currency Power. Being as brief as possible, Dai’s prospective value as an international currency is based on it’s usage in financial markets, trade, and as an international reserve. The latter obviously being the king prize of currencies, the pathway to royalty is in progressively establishing Dai as a principle vehicle for economic activity. As with any currency, this is ultimately based on how domestic and international markets perceive it’s reliability and accessibility. Most people here have a good understanding of how the protocol supports these two characteristics (and an understanding why the core principles previously mentioned do so as well), so it’s more important to discuss how a currency climbs the pyramid from niche to negotiated. The key emphasis is on the ability for Dai to facilitate “mutually beneficial” economic activity with other markets. You can’t necessarily coerce adoption within foreign systems, but you can incentivize it. By continuing to provide efficiency and usability, across a wide spectrum of valued activity, there is little reason to cut off Dai usage and flows. The Endgame can simply prioritize market value and allow the politics to play itself out Irrationality is abundant at all levels of politics, so you can’t rule out the possibility of a ban, but you can hedge your bets. Pro-active narrative control, strong use cases, and a timeline of consistent reliability and accessibility makes it really hard to imagine how Dai would somehow be devoid of economic value and face a coordinated global ban. The history of international politics, especially international finance, is that of opportunitistic market dynamics and if Dai simply can provide, it will find favor somewhere. That somewhere can serve as the foothold to strive for larger currency status, but that will be for a future conversation… On the dollar peg…today’s market place is ruled by the US dollar, and despite good reasons otherwise, there is no way to avoid this in the short-term. This may preclude a MetaDAO based exclusively in North Korea or objectively pursuing active debasement of the United States, but I find it hard to believe these will be the only use cases worth pursuing. Especially if the incentives are hardcoded into the tokenomics correctly, there will be no game-theoretic reason for MetaDAOs to pursue anything but the most valuable use cases, and certainly not the ones most likely to face an OFAC sanction. As this climate changes, MetaDAOs will adapt too. The politics requires that the exchange rate to the dollar must be considered. There is simply no way around the global dollar system. But given a few years of effective revenue generating activity, continued growth in the decentralized economy, and further political development - there is no reason Dai and crypto aren’t seen more favorably in open account countries than not. In light of this perspective, the current proposal on the Endgame places arbitrary limits on the type of collateral pursued outside of decentralized collateral. The number of 25% of the balance sheet in politically-exposed collateral is probably correct, but the limit should probably end there. Given appropriate incentives and skin in the game, MetaDAOs can manage their own issues, including liquidity and compliance, in order to succeed best. If it goes the other way, then mitigate the losses best you can and advance to whatever the next Bird Stance is. But to avoid the primary opportunities in the market because of a perceived vampire attack is essentially cementing Dai’s status as a niche currency. If that’s the decision to make, so be it, but I’m genuinely glad we had this discussion first… I think @christiancdpetersen said it best.     christiancdpetersen:  We should harness Maker’s position to advance . . . not retreat.   ",
                    "links": [
                        "https://www.researchgate.net/figure/The-Currency-Pyramid_tbl1_271215490",
                        "https://forum.makerdao.com/t/the-path-of-compliance-and-the-path-of-decentralization-why-maker-has-no-choice-but-to-prepare-to-free-float-dai/17466/45",
                        "https://forum.makerdao.com/t/endgame-plan-timeline-to-free-floating-dai/17529/8"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.668424958059104
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#30",
                    "likes": "2",
                    "time": "29/08/2022-03:45:55",
                    "content": "    brianmcmichael:  Furthermore, a large institution that is able to successfully convert an IOU to dollars is strongly incentivized to work with and encourage authorities to have Dai added to international sanction lists, which would effectively discharge their debt by precluding them from transacting in Dai.   While I don’t think you can rule out irrationality anywhere, I think this is a very pessimistic stance. If this were the case, why haven’t Tether’s banks done this with the DOJ all over their ass? Answer: because they can make more money by being complicit and are in jurisdictions where they have more flexibility on complying with US reach. They want to avoid killing the golden goose. The banks are incentivized to have those deposits, especially if they are sticky. It enables them to make more money while taking on less risk. No doubt there could be some shady banks. Counterparty risk is a thing and Tether has seen this too. But this is why you’d want to work with banks in countries that have a good legal system, ensure that the incentives are aligned, and that the use of the RWA proceeds are compliant with regulations. As @Khan said above you’d “hedge your bets” and diversify the counterparties. One thing I’ve learned the hard way when navigating banking and crypto over the years is money talks. Banks are in the business of money and the more you have, the more they’re your friend. The bigger risk to RWA is by far assessing deals and ensuring borrowers don’t default, or recovering assets of they do. Not that a proper sized bank in a good jurisdiction confiscates the $100M. Even in the extreme case you illustrate, in Canada and the US, you have a right to due process in court and if the sanction was incorrectly applied you can get your name stricken from the sanctions list and assets released. Not sure about other jurisdictions but I would assume there are more where this is also the case. I echo everything @Khan said above.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.072580645161291
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#31",
                    "likes": "2",
                    "time": "29/08/2022-05:23:43",
                    "content": "No it isn’t. I invite you to read the proposal again. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#32",
                    "likes": "2",
                    "time": "29/08/2022-22:16:29",
                    "content": "There’s a third way where @brianmcmichael’s dream becomes real. If the nation state and supranational monetary power structures are imploding, and if they are crumbling under the weight of their own corruption, greed, ignorance, trickery and deception… and if the survival of crypto to this point could be viewed as evidence that indeed the empire has been defeated by the wheels turning in wheels, but we just don’t fully see it yet… might it be smart to play for all the cards? Isn’t that our obligation rather than retreat into obscurity? Make concessions now to gain greater advantage later. Playing by the rules as needed and where appropriate with a long term plan to make DAI TBTF (Too Big To Fail) means we survive, the pendulum of history swings back toward liberty and self determination and prosperity for all and the laws get remade in our image. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.665584415584416
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#33",
                    "likes": "2",
                    "time": "30/08/2022-07:54:18",
                    "content": "    ACREinvest:  Make concessions now to gain greater advantage later. Playing by the rules as needed and where appropriate with a long term plan to make DAI TBTF (Too Big To Fail) means we survive, the pendulum of history swings back toward liberty and self determination and prosperity for all and the laws get remade in our image.   I mean… this is where I sit.  The counter argument is that by playing along and conforming to existing regulations DAI would become corrupted and/or too engrained to change to be more censorship resistant. I personally think this is less likely if you’re too big to fail vs. being banned when you’re small and under more scrutiny for enabling sanctions avoidance. But it’s pretty hard to put a probability to either scenario right now. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2159391534391535
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#34",
                    "likes": "1",
                    "time": "28/02/2023-18:50:38",
                    "content": "    Khan:  The Endgame structure allows us to make these assumptions about Maker:  Maker is a low-level protocol that exerts control over the core components of Dai, a stable value price instrument. The core principles of the protocol - permissionless, credibly-neutral, decentralized - are also the core value offerings in enabling a high-degree of efficiency and reliability. Higher-level usage of Dai that operates at the level of intermediary suppliers or end-users are distinctly separate entities from the core protocol. Any interface between higher-level entities and the core protocol is objectively and transparently managed, with as much separation as possible.  As long as these assumptions are adhered too, there is no reason to adopt compliance or regulatory mechanisms into the core of the protocol. The only relevant scrutiny would be in the interface with the MetaDAOs, but it’s fairly easy to imagine how any potential impact could be minimized.   Feels like a good time to revisit the reply above by @khan to @rune asking:     rune:  Do you think it’s realistic that Maker can convince american politicians that we should be subject to special rules that means we would be allowed to both scale our reliance and dependence on the american legal and financial system as the backend to a product we provide (for profit, but with major public good upside such as Clean Money) to any end users anywhere in the world that needs it, even e.g. north korea or iran if they decide to use it, without being subject to sanctions or countermeasures? That is, Maker would be treated like a kind of global utility like linux rather than like a financial institution.   in light of:    MIP55c3-SP16: Phoenix Labs-Spark Lend launch   Spark Lend will bring to Maker a new decentralized application that will integrate with Maker’s strategic services (D3M, PSM, and DSR) into one front end to attract more crypto users and help to bootstrap the creation of the SubDAO communities. As presented in our roadmap, we want to start with a simple front-end that will allow the Maker Community to evaluate the growth of the product and according to it and based on the Community feedback, we could launch new features and products in the future. If MIP55c3-SP15, MIP116: D3M to Spark Lend , and this SPF are approved, we will be ready to launch Spark Lend by April 2023 and maintain it for up to one year. All products created by Phoenix Labs will belong to MakerDAO, including the smart contracts, the Front End, and all intellectual property.   and hard knocks MakerDAO is taking for being tossed up with the Oasis/Jump situation:   coindesk.com – 24 Feb 23    Oasis Exploits Its Own Wallet Software to Seize Crypto Stolen in Wormhole Hack The High Court of England and Wales ordered the crypto platform to reclaim the stolen funds.      We believe there is absolutely a path for Maker Core to be treated like a global utility rather than a financial institution. We agree with @Khan that this path is not one of convincing U.S. politicians or paying lobbyists. Success depends on smart moves which we think the Endgame Constitution outline very well. Proceeding with the current fully integrated thrust and timeline for Phoenix Labs in direct conflict with such prudent design and processes in place as outlined in the Endgame plan, would be a terrible mistake. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip55c3-sp15-phoenix-labs-initial-funding/19733",
                        "https://forum.makerdao.com/t/mip116-d3m-to-spark-lend/19732",
                        "https://www.coindesk.com/business/2023/02/24/oasis-exploits-its-own-wallet-software-to-seize-crypto-stolen-in-wormhole-hack/",
                        "https://www.coindesk.com/business/2023/02/24/oasis-exploits-its-own-wallet-software-to-seize-crypto-stolen-in-wormhole-hack/",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/106"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.697260822510822
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#35",
                    "likes": "0",
                    "time": "28/02/2023-19:04:21",
                    "content": "Spark Protocol will not have a multi-sig in control of user funds. The pause proxy is admin on all functionality. The Oasis situation doesn’t apply to Maker due to the GSM delay + requiring a DAO vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                }
            ]
        }
    ]
}