{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - RFA (RFA - Canadian Federally Regulated Mortgage Originator) - September 19, 2022",
            "index": "17303",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "53,386",
            "highest_fraction": 0.56
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip6-application-rfa-canadian-mortgage-originator/17303",
            "title": "MIP6 Application: RFA - Canadian mortgage originator ",
            "index": 17303,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "impact-:-medium",
                "mips",
                "centrifuge",
                "banking",
                "residential-mortgages",
                "rmbs",
                "canada"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#1",
                    "likes": "10",
                    "time": "17/08/2022-14:39:10",
                    "content": "Collateral Application - RFA Background Information 1. Who is the interested party for this collateral application?  RFA is a Canadian financial services platform founded in 1996 by a team of seasoned real estate and finance professionals. Beginning as an early pioneer and controlling investor in Canadian Commercial Mortgage-Backed Securities (CMBS), over the last 25 years RFA has grown into a robust group of real-estate focused lending and operating platforms (both debt and equity) through strong capital relationships and persistent innovation in transaction structuring and acquisitions. The company has been involved in more than $20B in commercial real estate deals with institutional capital across Canada, and its residential mortgage origination operation has over $25B of mortgages under administration. In 2019, RFA acquired a Schedule I Canadian Bank. As of May 2022, RFA directly employs around 170 Canadians across three primary offices in Toronto, Calgary and Vancouver; across platforms that RFA and its investors own or control, the employee count is over 5,000.  2. Provide a brief high-level overview of the project, with a focus on the applying collateral token.   RFA is requesting a $95M Dai Maker Vault to fund the senior secured (A) tranche of a $100M 1yr RMBS debt facility.  RFA will retain the entirety of the $5M Dai junior tranche (B) of the debt facility.    RFA’s intent is to launch a token-based securitization using the Centrifuge protocol with an initial pool of single-family Canadian mortgages (“1yr RMBS”), split into a senior tranche (A) and junior tranche (B), where the senior tranche will make up 95% ($95M Dai) of the debt facility, and the junior tranche will make up 5% ($5M Dai) of the debt facility.  We anticipate the average rate on the pool of loans to be between ~5-6% dependent on timing of pool allocation. A tranche to MakerDAO to carry a yield of approximately ~3-4% (dependent on market conditions at the time) B tranche to RFA to carry a yield of approximately ~12-15% (dependent on market conditions at the time)    The facility will contain approximately 275 fixed-rate, first-lien residential mortgage loans. Each loan is secured by a first mortgage or hypothec on the mortgagor’s fee simple residential real property in Canada.  All mortgages in the pool will be underwritten in accordance with Guideline B-20, Canada’s residential underwriting standard set by its federal banking regulator, OSFI. All residential mortgages held on the balance sheets of federally regulated banks are required to be B-20 compliant. The loss rate for this category of mortgages in Canada has never exceeded the 5% buffer of the junior tranche. Even during the 2008 Global Financial Crisis this category in Canada performed with limited losses. Weighted Average Life is approximately 12 months Average Credit Score is approximately 685 Average Loan Size is approximately $350,000 USD Average total debt service ratio (TDS) is 45%    Dwelling Exposure (approximates):  Condominium: 10% Rental: 10% Single family residential: 80%    Geographic Exposure (approximates):  Ontario – 65% British Columbia – 25% Alberta – 7% Other – 3% (Nova Scotia, Saskatchewan, Manitoba, Newfoundland and Labrador)    RFA Origination Pipeline:  Over $1 billion of this product (1 year RMBS) annually and can significantly scale if appetite exists for this funding channel. Originate approximately $4 billion annually in both insured and uninsured 5 year residential mortgages (5 year RMBS) RFA hopes to expand in the future with pools ranging in different sizes, duration and asset classes.    3. How long has the project been live in production?  RFA was founded in 1996 and the residential mortgage lending platforms (launched and acquired) have been originating residential mortgage loans since late 2007.  4. Provide a brief history of the project.  RFA has consistently shown itself to be a professional and ethical actor over its 30-year history, and has a fantastic reputation across Canada and the US for conducting itself in such a way. RFA’s ownership structure is as a private group of companies, owned and operated by a relatively small group of investors and operators who have been working together for several decades. The 2019 acquisition of its Banking platform—a rarity in Canada—has only increased RFA’s focus on governance to satisfy stakeholders across its board, investors, and various regulators. Governance and the security of customer deposits are the federal banking regulator’s two top priorities for Schedule I Banks in Canada (OSFI website with list of Regulated Banks). Because RFA as a group shares a name with the Bank, it is held to the highest standards. As a company, RFA invests a significant amount of resources (both human and monetary) into these areas. RFA has been involved in asset backed commercial paper both as an investor and originator for decades; RFA views innovation on new rails of Web3 and DeFi can help pave the path for the rest of traditional finance to a more efficient securitization model for real world assets.  5. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.  RFA’s Mainnet deployment will be accessible via tinlake.centrifuge.io  Technical documentation about Tinlake can be found here: GitHub - centrifuge/tinlake: bringing individual, non-fungible assets to DeFi   Asset Information 6. What type of asset is it? (e.g. store of value, currency, commodity, capital asset, governance token etc.)  Single family Canadian Residential Mortgages  7. How is the asset used and does it give any rights to holders? (e.g. financial claims, dividends, governance rights)  The asset is a full recourse loan on the Canadian Residential properties. If a Canadian lender forecloses on a home with negative equity, it can file a deficiency judgment against the borrower, which allows it to attach the borrower’s other assets and even take legal action to garnish the borrower’s future wages. In the United States, it has a mix of recourse and non-recourse laws that vary by state, but even in recourse states, the use of deficiency judgments to attach assets and garnish wages is infrequent. The full recourse feature of Canadian mortgages results in more responsible borrowing, fewer delinquencies, and significantly fewer foreclosures than in the United States.  8. What is the market cap for the asset?  In the third quarter of 2021, the total value of mortgage debt outstanding in Canada amounted to nearly 1.55 trillion Canadian dollars.  9. Where does exchange for the asset occur? Provide exchange data on market liquidity, volume and order book depth.  As of March 2022 the Canadian RMBS and MBS market was over 500 billion CAD: https://content.ftserussell.com/sites/default/files/benchmarking_the_canadian_mortgage-backed_securities_market_final_v3.pdf   10. Is the asset settled on chain (trustless) or off chain (trusted)?  The loans will be brought on-chain in the form of RWAs and securitized through the Centrifuge protocol. Investments in the security are settled on-chain. We will adhere to the best practices applied both technically and legally to RWAs with guidance from both MakerDAO and Centrifuge.  11. If offchain (trusted) settlement: describe what are the involved entities, process and estimated time.  N/A  12. List any possible oracle data sources for the proposed collateral type.  N/A  13. List any parties interested in taking part in liquidations for the proposed collateral type.  Our vision is to work with MakerDAO to establish a long-term liquidity solution for this asset class. After completing this first transaction, we plan to work with and leverage the balance sheets of the larger banks in Canada to provide a liquidity backstop, if and when MakerDAO requires the need to move into “cash”. These loans are already bought and sold by the major banks in Canada on a regular basis, providing a deep pool of liquidity. By establishing sensible deal economics for a “liquidity put”, we believe these banks wouldn’t hesitate to buy these assets when needed. We see this as a huge win for scaling, but also in allowing MakerDAO to work with longer duration assets, and perhaps most importantly familiarizing and onboarding additional legacy financial institutions as partners. This asset in TradFi is extremely liquid and the ability to move in and out of positions combined with the derivative markets for hedging requirements shows that there is sufficient demand to replicate these structures onchain.  Business Questions 14. What is/are the expected use case(s) of the Dai generated by the vault?  Working with MakerDAO to establish a Dai facility will provide RFA an alternative source of liquidity to enable an expansion of RFA’s mortgage origination business in Canada. By accessing funding at a competitive cost of capital, RFA is able to achieve two major goals:  Passing on a more advantageous rate directly to the Canadians end customers of the mortgage loans. Provide a wider array of services and products to the Canadian housing market.   Allow RFA to compete with larger Tier 1 banks by leveraging the MakerDAO partnership to enable improved cost and efficiency  15. What is the amount of Dai expected to be generated against the collateral and what is the timeline? Is there a commitment on a minimum amount of Dai to be generated?  Initial tranche is proposed to be a $100M pool where MakerDAO would participate in $95M Dai and RFA would provide the first loss $5M. The timeline is approximately 12 months (duration of the asset) and RFA commits to use all $95M Dai immediately upon availability.  16. What are the strategic benefits for MakerDAO in onboarding the collateral?  From the beginning of our conversations, we’ve been encouraged by what we believe is clear alignment:  MakerDAO wants to diversify Dai’s collateral base and increase Dai usage around the globe; MarkerDAO wants to diversify its regulatory and geographical concentration. RFA wants to diversify its funding and liquidity with a new capital provider with scale; Real estate is one of the largest asset classes in the world; Canada is a preeminent Western democratic economy with a stable rule of law; RFA is an institutional group regulated at provincial and now federal levels with its banking license; MakerDAO can therefore issue Dai at scale in one of the largest asset classes in the world, in one of the safest countries in the world, with an institutional, highly regulated entity; RFA gets access to new and flexible capital to continue to grow and innovate financial services on Web3 rails.   For this partnership to really make sense for RFA, we envision this relationship reaching north of a billion dollars over time—and we can scale that up as fast as the community is willing to go. Why is RFA coming into DeFi?  The regulated banking industry in Canada is fundamentally an oligopoly of 6 major banks (“the big 6”) with a long tail of roughly 30 more (there are only ~35 federally regulated Schedule 1 Banks in all of Canada, compared to thousands in the U.S.). After RFA acquired its license in 2019 the group began to strategize how we could truly compete in Canada. On the one hand, RFA lacks the scale of large Canadian players; but on the other, RFA has always punched above its weight through smart structuring, deep capital relationships, a first principles approach and trying to always develop strategic, capital, and technological advantages that allow us to compete. But the reality is that access to cheaper capital is the most important element to scaling a Bank efficiently to profitability. Our cost of capital is much higher to what our large competitors can achieve through customer deposits and significant scale. We also still rely on the big 6—leveraging their deposit boards for funding and leveraging their capital markets groups to acquire our originated assets for liquidity. Depending on those you’re trying to disrupt is not a sustainable strategy, and so we continually look elsewhere for structural advantages.    Legal Questions 17. What are the legal risks associated with the tokens? We intend to use a structure that will substantially eliminate legal risks for MakerDAO such as the trust arrangement discussed here, here and here. The final details of the legal structure will be shared with MakerDAO and with counsel to MakerDAO at a later stage. Existing known details of the transaction structure are provided below:  Full Recourse Loan: If a Canadian lender forecloses on a home with negative equity, it can file a deficiency judgment against the borrower, which allows it to attach the borrower’s other assets and even take legal action to garnish the borrower’s future wages. The initial as well as any subsequent asset transfers from RFA to the securitization SPV will be implemented via a “true sale” transaction documented in a Sales and Purchase Agreement (the “SPA”). The SPA will include, amongst others, representations and warranties by RFA (e.g. title, capacity, validity of claim, etc.) with regards to the underlying assets. The securitization SPV will own the underlying loans. The SPV will enter into a service agreement with Centrifuge to get support from Centrifuge while using its open and decentralized infrastructure.  The SPV will tokenize the underlying loans into NFTs and will add those NFTs to Tinlake as collateral. The SPV will utilize Tinlake to issue DROP and TIN backed by the pool of NFTs that are locked in Tinlake. MakerDAO and RFA will purchase the DROP and TIN tokens (Senior and Junior, respectively) The SPV will enter into a servicing agreement with the Asset Originator (RFA).    18. (Optional) Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? 19. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. 20. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. 21. Is issuance of the asset decentralized (trustless) or centralized (trusted)? 21.a. If centralized/trusted: by which legal entity, type of entity and jurisdiction?  The legal entity will be RFA and the jurisdiction will be Canada.  Technical Questions This MIP6 proposes to utilize the MIP21 and MIP22 collateral integration process, as previously used by other issuers via Centrifuge. 22. Link any available audits of the project. Both procedural and smart contract focused audits.  Centrifuge has conducted several audits of its technology stack, and they can be found here. MakerDAO PECU and OCU have previously performed assessments of various MIP22 collateral implementations, such as here and here.  23. Has the token (and/or supporting protocol) been formally verified?  No, the Centrifuge protocol has not been formally verified.  24. Does the asset follow a token standard? (E.g. ERC20, ERC721, ERC1400)  Yes, the underlying tokens in the Tinlake application use the ERC20 standard.  25. Is the asset, or asset balances, controlled by a central actor, or group of actors (e.g. through a multisig, or DAO)?  No, the tokens are issued through the Tinlake Pools smart contracts.  26. Does the token have whitelist or blacklist functions? If so, what is the process for utilization and what stakeholders are involved?  Tinlake pool investors must be whitelisted, which is facilitated through the KYC process, detailed here.  27. Can the token implementation be upgraded/changed? If so, what is the process and what stakeholders are involved?  Tinlake Pools are not upgradable and require a new deployment to change.  28. Does the token contain rebasing logic?  Tranche tokens are allocated based on investments/redemptions into a Tinlake pool and determined by the pool’s on-chain epoch and solver mechanism.  The following questions apply to RWA collateral onboarding applications only: 29. Provide (a) proposed legal structure for transaction, including: type of legal entities, (offshore/onshore, form (trust, corporate, other)) and jurisdiction(s) of legal entities, and (b) likely funds flow (Dai => Fiat => Dai). Please see response above to Question 17. 30. Provide details on the organizational structure of the interested party, beneficial ownership, governance/control, key personnel, capital/funding resources and past financial performance.  RFA is a large private group of companies operating across the real estate landscape within Canada. We will provide a detailed overview during due diligence with the Core Unit. However, in the interim you can find an up to date financial snapshot of our Schedule I bank, RFA on our regulators website as it’s publicly available and updated regularly.  Financial Data for Banks    31. Provide detailed summary of the proposed economic terms of the transaction, including, without limitation: commitment term, principal amount, interest rate, frequency of principal and interest payments, disbursement schedule, equity amount, funding ratios (equity/debt pro rata, equity first, etc.), collateral security, coverage ratios, currency (if not Dai) and other material terms. The quality of the proposed economic terms will be a consideration for the prioritization process. This is for guidance purposes as specifics will depend on market dynamics at time of pricing.  1600×571 182 KB  32. Identify in reasonable detail the risks associated with this collateral application and the underlying asset(s) and proposed mitigants (if any). The risk summary should address, without limitation and to the extent relevant: market risks, commercial risks (e.g., diversification, credit, etc.), interest rate risks, legal and regulatory risks, general industry risks, competition, etc.  The loss rate for this category of mortgages in Canada has never come close to exceeding the 5% buffer that is provided through RFA purchasing the first loss piece of this pool, including the 2008 global financial crisis.  Why didn’t Canada have a banking crisis in 2008 (or in 1930, or 1907, or …)?    This is a very standard asset class with limited risks to all parties and we believe as close to zero risk as possible for the senior tranche that MakerDAO will hold.  Chart, bar chart Description automatically generated876×834 87.8 KB   33. Outline the applicant’s underwriting guidelines/policies, origination strategy (marketing, sales, channels), servicing strategy (charge-offs, collections), and historical asset performance.  All mortgages in this pool will be written to our federal regulator guidelines for mortgages that can be held on Schedule 1 Bank balance sheets in Canada.  B-20 guidelines   We partner with the largest mortgage servicing company in Canada, who has over 130b in AUM that they service. In the last 3 years we have had zero defaults that led to a loss and currently our book has less than 0.10% in 30 days arrears.  34. Outline the applicant’s risk monitoring and operations guidelines/policies (e.g., charge-offs, collection, recovery provisions, data collection and technology, etc).  Our risk department is within our federally regulated institution and is in real time monitoring our assets on our balance sheet and our current originations. Below is a list of metrics we are required to report on, and the frequency of these reports: Reporting Requirements for Deposit-Taking Institutions  The intention is to work with Centrifuge to develop a dashboard with updated analytics of the loan portfolio.  35. Describe the regulatory regime applicable to the underlying asset (if any) and the applicant’s legal and compliance program relating thereto.  RFA is regulated through both provincial and federal regulators to the highest standard in Canada. Residential mortgages are the largest asset class in Canada and are thus regulated to the highest degree, as their potential impact on the economy and stability of Canada is high.  36. Identify any 3rd party persons likely to be relied upon by the applicant to implement the transaction (legal, accounting, servicers, trustees, etc.).  We will leverage the support of the Centrifuge team and their protocol along with our legal counsel and accounting partners. Other third parties such as trustee, verification agent, conversion agent will be defined later in the process.  ",
                    "links": [
                        "https://www.osfi-bsif.gc.ca/Eng/wt-ow/Pages/wwr-er.aspx?sAll=1",
                        "http://tinlake.centrifuge.io/",
                        "https://github.com/centrifuge/tinlake",
                        "https://www.statista.com/statistics/1208589/value-of-mortgages-outstanding-canada/",
                        "https://content.ftserussell.com/sites/default/files/benchmarking_the_canadian_mortgage-backed_securities_market_final_v3.pdf",
                        "https://forum.makerdao.com/t/centrifuge-update-cornerstone-agreement-complete-to-onboard-rwas-to-maker-with-centrifuge-successful-collaboration-with-incubating-lts/15005/5",
                        "https://forum.makerdao.com/t/what-is-a-trust-indenture-what-is-an-indenture-trustee/14697/5",
                        "https://forum.makerdao.com/t/progress-update-on-the-legal-structure-for-centrifuge-rwa-vaults/13307",
                        "https://mips.makerdao.com/mips/details/MIP21#motivation",
                        "https://mips.makerdao.com/mips/details/MIP22#motivation",
                        "https://github.com/centrifuge/security/tree/master/audits",
                        "https://forum.makerdao.com/t/ns2drp-ns-drop-mip22-token-smart-contract-domain-team-assessment/5517/1",
                        "https://forum.makerdao.com/t/ns-drop-collateral-onboarding-oracle-assessment-mip10c3-sp21/6178",
                        "https://docs.centrifuge.io/use/onboarding/",
                        "https://www.osfi-bsif.gc.ca/Eng/wt-ow/Pages/FINDAT.aspx",
                        "https://www.nber.org/papers/w17312",
                        "https://www.osfi-bsif.gc.ca/Eng/fi-if/rg-ro/gdn-ort/gl-ld/Pages/b20_dft_let.aspx",
                        "https://www.osfi-bsif.gc.ca/Eng/fi-if/rtn-rlv/fr-rf/Pages/dti_req.aspx",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/27",
                        "https://forum.makerdao.com/t/justincase-delegate-platform/11721/97",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/63",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/24",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/119",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/15",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/6",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/24",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/52"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.452034406565655
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "6",
                    "time": "14/09/2022-11:37:19",
                    "content": "Wanted to give this MIP6 proposal more visibility as the opportunity to Diversify RWA exposure to Canada  is very interesting. Does the author and Centrifuge @spin @Khan @ctcunning plan to move this MIP forward, or will you folks wait to see if this can take the route of the Centrifuge and BlackTower Arranger model via the Endgame? Assuming MKR token owners approve the Endgame pivot. Thanks in advance. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#3",
                    "likes": "6",
                    "time": "14/09/2022-16:55:49",
                    "content": "Thanks for the nudge @flipflopflapdelegate. We’d like to see this pushed forward to the community greenlight phase. We believe RFA is a strong institutional partner and they are prepared to bring a compelling deal to meet the needs and desires of the DAO. This deal brings otpimal risk-adjusted returns, geographic diversification, access to a large and liquid debt market through a federally regulated deal partner, and the ability to scale and build this asset class by offering a long-term liquidity backstop solution (something incredibly necessary for RWA collateral in stablecoins). For these reasons, I believe this is a quality deal that is worth taking to the next step of deeper due diligence by domain teams. Given the lack of a Real-World Finance core unit and the other topics in the community lately, this has not had the engagement we would have liked. Pushing to a community greenlight vote will be a useful forcing function for the community to evaluate the merits of the MIP6 given what is written today. Should the community decide to move RFA forward, all parties are prepared to begin having the longer conversations about how and where this would fit into the Endgame plan and the long-term plans of the DAO. @pylec and his team are long-term focused partners and, regardless of the outcome, I believe a community vote is the best way to give them an indication of how the DAO feels about this opportunity. For all of these reasons, we want to see this go to a community greenlight. @Recognized-Delegates @collateral-core-unit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.142006802721088
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#4",
                    "likes": "2",
                    "time": "14/09/2022-17:24:24",
                    "content": "Thanks for the ping @khan. It is an interesting proposal and I do hope we can get some proper analysis and discussion on it. Are these loans issued in USD or CAD? And if CAD, how is exchange rate risk hedged? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#5",
                    "likes": "5",
                    "time": "14/09/2022-17:24:35",
                    "content": "I have spent quite a bit of time with @pylec and team understanding their position in the market and core businesses. They are indeed professional and quality folks. They’ve thus far been conciliatory in locating a product/exposure that genuinely addresses a need at Maker. RFA would serve as a strong institutional partner who would fulfill an HVB-like role (out-of-the-box RWA yield) and provide exposure to Canada, a strong market. Best to consider RFA as a quality counter-party who we want to keep close. Manage uncertainty with regard to Maker’s intentions/org. design as needed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.690476190476192
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#6",
                    "likes": "2",
                    "time": "14/09/2022-17:44:12",
                    "content": "Great question. We would see these assets view Maker in USD. Therefore RFA dealing with the currency hedge / risk and complexity. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#7",
                    "likes": "1",
                    "time": "14/09/2022-18:05:53",
                    "content": "Was RFA around in 2008? How did the loans perform then? What level of defaults were experienced and how did this affect senior capital at all? How did the team’s composition change since then? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#8",
                    "likes": "2",
                    "time": "14/09/2022-18:21:37",
                    "content": "RFA was around in 2008, however more on the commercial real estate side of things and we owned a large amount of CMBS and we were actually big buyers of CMBS during that time.  We did not experience any loses. The Canadian real estate market didn’t have the meltdown that the rest of the world saw. This is the best article to help explain. Canadian real estate is very safe asset class.    NBER    Why didn't Canada have a banking crisis in 2008 (or in 1930, or 1907, or ...)? Founded in 1920, the NBER is a private, non-profit, non-partisan organization dedicated to conducting economic research and to disseminating research findings among academics, public policy makers, and business professionals.      Being federally regulated we are constantly monitoring our portfolio and reporting to our regulators and investors. We are extremely proactive with our portfolio and have not experienced any losses in over $25b of originations. Having the junior note being 5% there has never been a time in Canadian history where this asset class experienced that level of losses such that it would hit into the senior tranche. Hope that answers your question. ",
                    "links": [
                        "https://www.nber.org/papers/w17312"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.87202380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#9",
                    "likes": "2",
                    "time": "15/09/2022-13:41:22",
                    "content": "Thanks, that’s good information. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#10",
                    "likes": "2",
                    "time": "18/09/2022-18:59:02",
                    "content": "    pylec:   Geographic Exposure (approximates):   Ontario – 65% British Columbia – 25% Alberta – 7% Other – 3% (Nova Scotia, Saskatchewan, Manitoba, Newfoundland and Labrador)    Commenting in a personal capacity. Thanks for an interesting and complete proposal. After an initial read through, and reviewing from a credit risk perspective. My main concerns would be with respect to your credit risk assessment and whether a junior capital buffer of 5 % would be enough moving forward. Agreed that based on historical information the 5% would seem adequate … but there is a high probability of the Canadian Real Estate market seeing some significant adjustments. A you probably know the cost of housing with Q2 easing by the US fed, as well as the Covid crisis have significantly driven up the cost of housing in the key Geographic hubs of B.C. and Ontario. In addition the move to remote work has had an impact on real estate demand in both major and rural population centres. To the extent that the Market is significantly overpriced and real estate experts at credible financial institutions are calling for a major market adjustments. Noting that the Canadian market has not faced such an adjustment in the past few decades - and given large expected interest rate increases is there any analysis available that simulates the adequacy of Junior Capital buffer under say a 20% downturn in prices and significant increases in mortgage rates.  As I assume to a large extent the key risk here is mortgage refinancing risk at the end of term. Also, adding for context and for the utility of other MKR token holders some recent reports on the Canadian Housing Market from credible institutions.    RBC Thought Leadership – 7 Sep 22    Housing The cooling trends that emerged this spring are still firmly in place across Canada’s housing markets. Early reports from local...  Est. reading time: 4 minutes       chrome-extension://efaidnbmnnnibpcajpcglclefindmkaj/https://www.desjardins.com/ressources/pdf/pv220811-e.pdf    PwC    Outlook for Canada’s housing market What’s on the horizon for residential real estate in 2021?      ",
                    "links": [
                        "https://thoughtleadership.rbc.com/higher-interest-rates-weigh-down-on-canadas-housing-markets/?_ga=2.41593696.334794991.1663527287-1441706872.1663181199",
                        "https://www.desjardins.com/ressources/pdf/pv220811-e.pdf",
                        "https://www.pwc.com/ca/en/industries/real-estate/emerging-trends-in-real-estate-2021/housing-market-outlook.html",
                        "https://www.pwc.com/ca/en/industries/real-estate/emerging-trends-in-real-estate-2021/housing-market-outlook.html"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.550435540069686
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#11",
                    "likes": "5",
                    "time": "18/09/2022-20:41:27",
                    "content": "Hey thanks for the post and a clear explanation on concerns around the Canadian housing market.  I think there is no debate that the real estate sector across both the US and Canada are in for a correction.  How big that correction is going to be is highly debated by very credible, intelligent people on both sides.  Canada has already seen a roughly 15-20% correction in a lot of Canadian markets and mortgage rates have already seen an incredible uptick of almost a tripling in mortgage rates. A few points:  Canadian Full Recourse loans is a big differentiating factor to how mortgages are done in the US.  The result is that Canadians pay their mortgage before anything else.  Because nothing is off limits to the lender if you don’t pay your mortgage. We have been renewing mortgages across our company consistently over the last several months with no increase in arrears or defaults. The Canadian economy and employment remain strong and while borrowing costs are going up, most Canadians will be able to tighten up on other areas to ensure that mortgage payment gets covered. We have a very large risk group that monitors our ECL (Expected credit loss) models and monitoring our $25b book of mortgages extremely closely to ward off any adverse trends in our portfolio.  We aren’t seeing anything that concerns us. Junior buffer increase - happy to discuss increasing if we collectively feel that the senior tranche is taking on a greater amount of risk for the yield being received.  I want to reiterate that RFA is looking to become a major strategic partner building a long term relationship with MakerDAO.  However, I stand by my statement that we have never seen loses in this mortgage product come even close to 5%. In our underwriting we are regulated by our federal government on risk metrics required in order to hold this asset on our balance sheet and the key metrics we site to show the safety of this asset is our TDS (total debt service ratio) not exceeding 45% and our LTV (Loan to value) not exceeding 80%.  Due to these key metrics even when we see a huge downturn in real estate prices or a significant increase in borrowing costs the industry rarely see any significant losses due to the conservative and regulated nature of our underwriting guidelines (B-20 underwriting guidelines).  Even when markets move 20% it still means that the vast majority of borrowers have positive equity in their homes. Another issue to highlight around the Canadian housing market is our severe lack of supply.  The Canadian government has signaled that immigration is going to be closer to 400,000 - 500,000 people a year for the next few years.  This is very significant in the context of housing and why a lot of experts feel that even though the housing market may soften and cost of borrowing is going up that housing markets have so much demand that prices will remain strong.  I hope this helps and look forward to digging into this level of pool level detail with the core units to get everyone comfortable and that the risk / reward ratio meets expectations for all parties. Thanks Colin ",
                    "links": [
                        "https://forum.makerdao.com/t/build-your-makerdao-alm-model/18730/15"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9459250894033495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fumoffuXx",
                    "index": "#12",
                    "likes": "0",
                    "time": "20/09/2022-11:37:36",
                    "content": "    pylec:  We have a very large risk group that monitors our ECL (Expected credit loss) models and monitoring our $25b book of mortgages extremely closely to ward off any adverse trends in our portfolio. We aren’t seeing anything that concerns us.   Hellos, Can i check whats the probability assumption based on the ECL calculation being (ECL = Probability x Potential bad debt) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.353571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#13",
                    "likes": "1",
                    "time": "20/09/2022-13:59:00",
                    "content": "Good morning - our ECL calculation is done by one of the major four consulting firms as an independent third party.  It is a very complex calculation with a lot of inputs from both economic data and also our entire AUM book.  Our ECL output is usually around the 10-20bsp range - I think important to also consider the arrears rate that the major insurers provide, which on our bucket of mortgages is usually below 10bsp.  Hopefully this further highlights why the 5% Junior piece is more than enough to shield MakerDAO from any loses.  However, as mentioned earlier happy to crack open the ECL model in detail with the Core Units during due diligence and make sure everyone is comfortable.  Thanks - Colin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.570454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#14",
                    "likes": "8",
                    "time": "20/09/2022-14:57:49",
                    "content": "Hey just chiming in here. I met @pylec in person last week, and we had some great chats about the Canadian banking scene. I can’t speak to the details of this deal, but getting more jurisdictional diversity is a good thing imo. It makes sense to pass this greenlit, and further investigate the merits of this deal. Whether this proceeds under the current structure or under the metadaos I think we should continue to signal that we are willing to do business. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.607142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/puniaviision",
                    "index": "#15",
                    "likes": "1",
                    "time": "22/09/2022-16:03:36",
                    "content": "What will RFA do with the Dai generated? Is it sold or exchanged for another stablecoin through a local centralized exchange partner? Do you keep the Dai on your balance sheets? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#16",
                    "likes": "2",
                    "time": "22/09/2022-18:32:58",
                    "content": "We would be converting DAI into Canadian dollars to help fund these mortgages.  I look forward to the day where I can hold crypto on my balance sheet without being significantly penalized.  hope that helps.  thanks - Colin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#17",
                    "likes": "0",
                    "time": "22/09/2022-21:30:29",
                    "content": "What are typical financing terms in the real world for this collateral in terms of advance rate and interest rate? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#18",
                    "likes": "1",
                    "time": "22/09/2022-21:32:40",
                    "content": "These mortgages have a 12 month WAL?  Does that mean they must be refinanced within a year or so? Is there any principal amortization? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#19",
                    "likes": "1",
                    "time": "22/09/2022-22:41:15",
                    "content": "Financing terms are changing very frequently with the constant rate increases in Canada.  The aim is to build a portfolio with the core units that meet tradfi economics.  RFA believes that the only way to truly scale RWA is to make them as close to tradfi economics as possible.  Again we’re in this for the long term building of the ecosystem and not the 1 off trade.  Depending on when this deal gets done will depend on what the real world rates in tradfi are - however, the delta of what the average coupon rate of the pool is to what the senior and junior tranches are earning are in line with what typical financing terms would be in tradfi. Yes these mortgages have a 12 month average weighted life, meaning that usually around 90 days before maturity we’re in contact with the borrowers to discuss renewal terms. Payments on these mortgages are a combination of principle and interest.  Interest only loans fall outside of the B-20 guidelines, meaning that interest only loans wouldn’t be able to be held on regulated balance sheets. hope that answers your questions colin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.022619047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#20",
                    "likes": "0",
                    "time": "22/09/2022-23:37:51",
                    "content": "Thanks for info on the deal rates What are the typical advance rates for financing such a pool of mortgages in the real world?  95% advance rate sounds rather high ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3933333333333335
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#21",
                    "likes": "2",
                    "time": "23/09/2022-00:00:18",
                    "content": "These are very safe assets and banks can hold these on their balance sheets with 20/1 leverage or 95/5.  Again I’m trying to mirror as close as possible tradfi to defi, otherwise it’s not sustainable.  Ideally defi in the short term should aim to beat tradfi to onboard institutions and get them across the chasm to the grow the space and eventually the defi premium subsides.  However, I’m aiming more for proof of concept to show that this channel can work.  Colin ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#22",
                    "likes": "1",
                    "time": "23/09/2022-00:18:58",
                    "content": "Thanks Can you point to bank capital charge numbers on this stuff? Why do borrowers take such a short term mortgage and face refi risk in about 1 year? How does refi  risk factor into your risk analysis? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#23",
                    "likes": "1",
                    "time": "23/09/2022-00:48:59",
                    "content": "Have a look at this for leverage ratio info on banks - osfi-bsif.gc.ca/Eng/fi-if/rg-ro/gdn-ort/gl-ld/Pages/LR22.aspx have a look at this for capital adequacy for this asset - number 98 is focused on residential real-estate risk ratio - https://www.osfi-bsif.gc.ca/Eng/fi-if/rg-ro/gdn-ort/gl-ld/Pages/CAR22_chpt4.aspx you take a banks leverage ratio than apply the capital ratio.  Note that these ratio’s vary between banks - bigger banks get better capital and leverage ratios generally. Why do they take 1yr mortgages - generally these are for people who want flexibility and who believe their circumstances are likely to change - for the better.  Often these borrowers hope they can graduate to a better credit and lower rate in 1yr. Refi risk is not a factor for such short term loans.  As up front fee and penalties deter from re-finances within the term. hope that helps - some of the leverage stuff is pretty complex so apologies for just sending through links but would be challenging to explain in this format. ",
                    "links": [
                        "https://www.osfi-bsif.gc.ca/Eng/fi-if/rg-ro/gdn-ort/gl-ld/Pages/CAR22_chpt4.aspx"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#24",
                    "likes": "6",
                    "time": "30/09/2022-14:54:22",
                    "content": "As a Canadian deep in FinTech & crypto and very familiar with the regulatory, legislative and banking environment in Canada and globally, this would be a monumental milestone for Maker, Canada and the industry at large if passed. I actually had an intro call with @pylec and another member of his team today (I reached out to them based on this MIP). How they are thinking about the space is very impressive! RFA having both a strong long standing mortgage business, owning a bank themselves (very hard to be a bank in Canada), and willing to do something like this is very very rare. To put this in context I’ve probably spoken with ~100 commercial, central banks and regulatory bodies around the world over the last 3 years about crypto and there are literally < 15 banks I’ve come across globally that are even remotely willing to entertain something like this today and < 5 today that have the regulatory capability, vision, business case and technical understanding to do something like this. While the vote to greenlight this is very close to a pass/fail, anyone supporting the growth of Maker’s RWA mission should be supporting this to green light IMHO. While some have abstained or voted “no” due to lack of clarity with Maker’s future roadmap (which is understandable), I think it is still worth green lighting purely because of how large a step forward it can be for the industry to demonstrate productive real world benefits that aren’t purely speculative, in a properly risk managed and regulated structure. Even if it doesn’t complete, the signalling alone is massive. Most of the other RWA MIPs (other than the HVB MIP6) lack these benefits as most of the other MIPs are still crypto native businesses that lack adequate regulatory coverage (at least in the eyes of regulators and legislators) and the activity is still speculative or more in that direction. After spending years dealing with regulators, legislators and financial institutions pushing for support of crypto, contrary to what some might think, rapid integration into TradFi with organizations that are properly regulated and supportive of the Maker ethos actually reduces the likelihood of overly aggressive regulatory action precisely because of the systemic risk aggressive action could pose. The key is to move fast with the right players. Integrating with RFA for properly regulated real world mortgages is a rare opportunity that would be a big miss not only for Maker but for advancement of crypto in general if this doesn’t pass. If this doesn’t pass due to lack of clarity re: internal Maker strategy, then I would advocate that this gets put back up for a vote once the roadmap is more clear. I have nothing to gain from this personally. Simply calling it what it is based on the experience I’ve had fighting this uphill battle. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.664314058956917
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#25",
                    "likes": "6",
                    "time": "30/09/2022-15:48:07",
                    "content": "    ekryski:  Anyone supporting the growth of Maker’s RWA mission should be supporting this to green light IMHO. While some have abstained or voted “no” due to lack of clarity with Maker’s future roadmap (which is understandable), I think it is still worth green lighting purely because of how large a step forward it can be for the industry to demonstrate productive real world benefits that aren’t purely speculative, in a properly risk managed and regulated structure.   +1 to this. For delegates and others concerned about the prospect of regulators targeting Maker, this prospective integration with RFA is exactly the kind of signal we should be sending: that we are the kind of operator that large real-world institutions want to do business with, and can drive real-world economic activity (the opposite of the crypto ponzinomics that so many regulators justifiably take issue with). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.017410714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/puniaviision",
                    "index": "#26",
                    "likes": "1",
                    "time": "30/09/2022-15:58:08",
                    "content": "    pylec:  We would be converting DAI into Canadian dollars to help fund these mortgages. I look forward to the day where I can hold crypto on my balance sheet without being significantly penalized. hope that helps. thanks - Colin   Given the deepest market for Dai is on Uni V3 and, even then, you can only get $16M depth at 2% slippage, are you not worried about the costs of converting Dai to CAD? A huge supporter of the proposal in general! This is a huge step forward not only for Maker, but finance in general. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9296875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#27",
                    "likes": "3",
                    "time": "30/09/2022-20:33:45",
                    "content": "Hey good question - I’ve talked with several people around this and I don’t see it as being a huge issue.  We don’t need to convert it all in one trade - if it takes us a few days or even weeks it’s not that big deal.  I’m prepared for the challenge that all the obstacles and hurdles that arise from this process will bring.  it’s hard doing things for the first time but I don’t see anything that can’t be overcome! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.544270833333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pylec",
                    "index": "#28",
                    "likes": "4",
                    "time": "30/09/2022-20:37:31",
                    "content": "Thanks for the comments guys - this hits the nail on the head for us.  I see this greenlight as a door opening to work together.  Nothing is guaranteed but we’re keen on building a long relationship with MakerDAO and figuring out how best to work together.  Maybe that’s not this asset or not the right duration, we’re happy to figure out the right collaboration for all parties.  Entities like RFA entering this space is what we need and I hope we can get a few more votes so that we can continue to build with MakerDAO and take the space of RWA’s one collective step further. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.567460317460317
                },
                {
                    "author_link": "https://forum.makerdao.com/u/puniaviision",
                    "index": "#29",
                    "likes": "2",
                    "time": "30/09/2022-21:34:16",
                    "content": "Love it, and can’t wait to see this happen! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#30",
                    "likes": "10",
                    "time": "03/10/2022-09:05:25",
                    "content": "As this greenlight poll comes to a close, I encourage folks to pass it. Not only is it solid collateral from a reputable originator but I think that adding RFA is a brilliant political chess-move at this particular time. The combination of HVB/RFA as collateral signals to regulators an intent to integrate, as opposed to evade. It seems as though regulators will continue dealing with crypto relatively indiscriminately, at least until they get jammed up in the courts. Crypto protocols are bugs and regulators will squash whichever they can. So how does a bug adapt to these conditions? Well, he might attach himself to an animal that regulators do care about, a family pet perhaps. If Maker can make itself not only systemically relevant but systemically relevant to a system that regulators actually care about, then it is in a much stronger operation position. Ultimately, unless we’ve lost complete faith in regulators’ fidelity, the job is to protect consumers and fairness. With, for example, 100MM vaults out to both HVB and RFA, that’s 200MM of real world businesses in America and Canada relying on DAI and the system that governs its risk. And two member banks who’ve generated reputations in their respective economies and driven hundreds of millions of value. I’d think twice before hurting the consumers/businesses (who my job is to protect) or these banks who’ve acted in good faith for decades, and by association Maker, if I were them. I know this argument is not the most popular within certain parts of this community. Lose censorship-resistance, increase trust assumptions, vectors for attack, lose control at the protocol level etc. And all that is right. But I do wonder if in hindsight small compromises on those purist assumptions were just the sacrifices we needed to bridge ourselves beyond this chaotic period. Just need to survive. One method would be to go underground. The other would be to bend the knee ever so slightly. I have no idea who’s gonna underwrite this beast because it certainly ain’t gon be me. But it is truly an incredible testament to the Maker token holders, core units, community, Centrifuge, and the rest of the ecosystem that two regulated North American banks are, despite the uncertainty at Maker and in markets, keen to get something done with us. As is Anchorage, Coinbase, Silicon Valley Bank etc. Unthinkable two years ago. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.881547619047619
                }
            ]
        }
    ],
    "group_index": "1599"
}