{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/proposal-discussion-cryptos-s-p500-a-decentralized-benchmark/12327",
            "title": "Proposal Discussion - Crypto's S&P500, a Decentralized Benchmark ",
            "index": 12327,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/dribai",
                    "index": "#1",
                    "likes": "0",
                    "time": "22/12/2021-07:22:43",
                    "content": "We believe that a currency can never achieve the status of Universal Currency, but a pure unit of value can. We are building that unit of value: The Unit. We are creating a crypto-native community-managed indexed unit of account to replace “stable coins” in the long term. Currently, we use The Unit to benchmark portfolios. Later we will also launch a gamified fund pegged to The Unit. Defi projects now use USD as the unit of value. However, USD is a fiat currency foreign to our space. So why are central banks’ currencies continuously used as a measure of value even in our space? Right now, USD is the glue that brings all projects together. But should a closed source currency be the focus of our attention? We think it shouldn’t. Instead, an indexed unit of value that’s not a currency is needed to unite all of our networks. Even though there will be a The Unit DAO aiding the development of The Unit, The Unit will be able to be replicated and maintained by everyone. The Unit is an index including the most significant portion of the crypto market. Our newly redesigned website, https://www.theunit.one, describes what we are doing in more detail. We propose a token swap to help fund the development of The Unit and tighten our partnership. We can discuss the details of the token swap below. You are also able to join the whitelist for our IDO here The Unit. Benefits to MKR hodlers:  MKR holders participating in this proposal will receive an airdrop from The Unit governance. MakerDAO governance will receive a reward swapping tokens with an earlier stage project like ours, opening itself for potential gains.  Join The Unit Community through our whitelist page: The Unit ",
                    "links": [
                        "https://app.theunit.one/whitelist",
                        "https://app.theunit.one/whitelist"
                    ],
                    "GPT-summary": "The post explains the concept of The Unit, a crypto-native community-managed indexed unit of account that aims to replace stable coins in the long term. The author proposes a token swap to fund the development of The Unit and invites readers to join the whitelist for their IDO. A 3rd party could give constructive criticism or ask questions about the proposal, while the author is advertising the proposal and explaining its details.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.804812834224599
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "3",
                    "time": "22/12/2021-13:12:46",
                    "content": "I am sorry but I recommend against token swap or investment as Maker Governance has more to lose than gain from this. And It’s never late to re-evaluate once they launch and grow significant enough. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dribai",
                    "index": "#3",
                    "likes": "1",
                    "time": "23/12/2021-00:35:46",
                    "content": "Thank you @Doo_StableLab! I think Maker has a lot to win, but I understand your position. We are committed to the space and will keep working to improve our offering and attract a partnership with MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#4",
                    "likes": "0",
                    "time": "23/12/2021-05:28:38",
                    "content": "How is this different from TokenSets with the appropriate tokens included or DPI if you only care about DeFi tokens? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dribai",
                    "index": "#5",
                    "likes": "0",
                    "time": "23/12/2021-08:42:24",
                    "content": "@AstronautThis: It differs in many ways: The Unit is a rules-based community-aided benchmark for all crypto. On each layer-1 network, the pool compositions of the fund that follows The Unit index will look different. We are creating a benchmark for the whole space, a way of replacing current stablecoin(fiat) benchmarks once the market matures. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "0",
                    "time": "23/12/2021-17:12:00",
                    "content": "It appears to me what ‘The Unit’ is proposing to be is like an ETF.    The point is that such instruments have to be backed by holding assets that have strong correlations to the index pricing components ‘The Unit’ will be constructed from.    If it doesn’t do this then it will require huge capital to manage the price of all the floated liquidity of “The Unit”.   Think of it like a PEG price that floats around because there is no underlying. My questions are two fold. Is the treasury of “The unit” going to hold underlying assets that reflect ownership stakes in weighting components according to weight. (like a weighted index fund) What pricing oracles are going to be used?    It seems like the whole issue here will be oracle costs on all of your underlying and either buying or selling components to maintain valuation weighting of the treasury backing “The Unit” as an index. Frankly my reaction to the above is for “The Unit” to come back after it establishes itself.   Also it is my impression that “The Unit” isn’t going to be a stable anything but will price float all over the place and owning the Unit will be like owning a OIL or a S&P ETF. What is a useful unit of value is going to be a difficult metric and the only reason the USD is preferred is because almost all other units of account or trading happen in those particular units of value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.397727272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dribai",
                    "index": "#7",
                    "likes": "0",
                    "time": "25/12/2021-12:31:43",
                    "content": "Thank you, @MakerMan, for your questions! Yes, the treasury of The Unit will hold the underlying assets of The Unit index, and we are partnering with Chainlink to create the data feeds necessary to run The Unit. Thank you also for the feedback. We will keep the community updated with the progress on our side. Originally, the community would likely price The Unit using traditional benchmarks. Still, as the crypto space becomes the world’s financial system in the coming decades, The Unit will have a great chance to become the pricing benchmark. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.979166666666666
                }
            ]
        }
    ]
}