{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/hashing-gov-polls-and-process-mips-onchain/2506",
            "title": "Hashing Gov Polls and Process MIPs onchain ",
            "index": 2506,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#1",
                    "likes": "5",
                    "time": "14/05/2020-16:57:28",
                    "content": "In the Governance Call on 14/05/2020, the MIP process was discussed further and, in particular, the necessity of having Process MIPs (and not just technical MIPs) go all the way to an executive vote on chain was discussed. Here is the tl;dr Reasons for Executive  Legitimacy Visibility Auditability Alignment of MIP and Governance cycles - i.e. having Process MIPs go through a separate route to ratification may cause havoc here.  Issues with Executive Votes  LFW’s application for Core Personnel Onboarding has passed the Inclusion Poll, and seems likely to pass the coming Governance Poll. However, it then needs pass an Executive, and garnering > 60k MKR in an early-week vote may prove challenging. It adds cognitive overhead for MKR holders, who now have to vote even more often. Regular executives without regularly active votes can decrease the security of the hat.  Hashing MIPs While the reasons for having Process MIPs go all the way to Executive Votes seem far more compelling than the issues this presents, it seems that we should at least create a hash of the document detailing the Process MIP being voted on, so that there is a clear, decentralised audit trail to add to the verifiability and legitimacy claims. We could use the same solution to make sure all governance polls are hashed on chain, rather than relying on the GitHub audit trail as we currently do. Currently, polls are created here and then displayed on the voting portal when @rich.brown works his magic. The thrust of this forum discussion is to identify the clearest and easiest way to hash these .md files and reference them onchain. @Kurt_Barry recommended this, so perhaps he can weigh in? Bonus Points: If you have other ideas of how to ratify Process MIPs without requiring an Executive, please feel free to discuss them here. ",
                    "links": [
                        "https://github.com/makerdao/community/tree/master/governance/polls",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-may-21-9am-pst-4-00-pm-utc/2579/2"
                    ],
                    "GPT-summary": "The author of the post explains the necessity of having Process MIPs go all the way to an executive vote on chain. They also discuss the issues with executive votes and propose hashing the document detailing the Process MIP being voted on to add to the verifiability and legitimacy claims. The post also invites other ideas of how to ratify Process MIPs without requiring an Executive. A 3rd party could give constructive criticism, audit and review the proposal, or ask questions about it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.791666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jparklev",
                    "index": "#2",
                    "likes": "5",
                    "time": "14/05/2020-18:39:04",
                    "content": "It has been poorly documented, but a quick note that polls are actually already hashed and available on-chain. To create a new poll, one must call the createPoll method on the polling contract1 wherein a hash of the poll document’s text (ie the content of one of those .md files on GitHub) is emitted as a part of the PollCreated event. So, to verify the poll document text you see on the UI, you could download the raw document (using the button shown below), hash it, and compare it to what was emitted on-chain. Screen Shot 2020-05-14 at 2.29.07 PM1632×256 4.75 KB It might also be worth noting that, in principle, GitHub is not a required for this to work. The document could just as easily be hosted on ipfs, aws, etc, and checked against the hash emitted on-chain. 1 links: mainnet polling contract, kovan polling contract  ",
                    "links": [
                        "https://github.com/makerdao/symbolic-voting/blob/1bbd80f6a625ca8cb7135f1bbe8945c9fc27efc2/src/polling.sol#L4",
                        "https://etherscan.io/address/0xF9be8F0945acDdeeDaA64DFCA5Fe9629D0CF8E5D",
                        "https://kovan.etherscan.io/address/0x518a0702701BF98b5242E73b2368ae07562BEEA3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.607663170163171
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#3",
                    "likes": "3",
                    "time": "14/05/2020-19:38:47",
                    "content": "Ok cool - love finding little easter eggs like this. Note, though, that this is only the case for Polls, and not Executive Votes afaict. @charlesstlouis maybe we then hash the process MIP at the Governance Poll stage, and reference that hash in the executive vote. Is there a better way to secure this attestation @Kurt_Barry? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4732142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kurt_Barry",
                    "index": "#4",
                    "likes": "2",
                    "time": "14/05/2020-21:46:52",
                    "content": "A simple sha3 hash of the documents should be sufficient. The main open question in my mind is whether or not we’d like to deploy a dedicated contract to store hash+short description for MIPs, major design decisions, etc. Just having this in the spells is very disorganized at best. Logs are probably fine for polls, which don’t last very long anyway, but storing more lasting and important things explicitly in one place might have convenience and transparency payoffs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.11701388888889
                }
            ]
        }
    ]
}