{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/can-we-get-a-consolidated-list-of-open-cu-career-postings-within-the-dao/10064",
            "title": "Can we get a Consolidated List of Open CU Career Postings within the DAO? ",
            "index": 10064,
            "category": [
                "Miscellaneous",
                "Site Feedback"
            ],
            "tags": [
                "core-unit"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "15",
                    "time": "29/08/2021-16:55:05",
                    "content": "All, Not sure who operates the forums but would LOVE to see a consolidated list of Job Openings in the DAO (organized by CU with job descriptions) posted on the forums. As it stands, it’s time-consuming for someone who is intimately familiar with the forums to navigate to each CUs budget page to see what jobs are available and even then, the listed positions are not current. I am envisioning this as something at the top of the page that is quite clear and visible. As I’ve mentioned before I think our #1 objective at this stage is to attract and retain talented individuals who can contribute to the DAO. We need to let people know the DAO is hiring! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "2",
                    "time": "30/08/2021-13:23:33",
                    "content": "At the moment there is the Talent Acquisition CU’s Maker recruiting site:    MakerDAO    Careers - Jobs - MakerDAO Careers - Jobs - MakerDAO      They are still being incubated as a CU, but that’s one place I suggest other facilitators post job listings. The other location to look out for in the future(i expect) will be the old makerdao.com/careers site, once it is handed off and all the access/process/permissions are sorted out. There is also the forum’s help wanted section, which isn’t used very much. I agree, it is very fragmented and we should bring all of these together in a single location. Perhaps to start, my team can create a stickied forum thread in the help wanted section that lists all of these. ",
                    "links": [
                        "https://makerdao.recruitee.com/",
                        "http://makerdao.com/careers"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1988095238095235
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#3",
                    "likes": "3",
                    "time": "30/08/2021-13:38:11",
                    "content": "This is the issue though - had no idea the talent acquisition team was working on anything or had a site, and I doubt most others knew as well I would much rather have a banner or link on the top of the forums than a stickied thread which would not be visible from the forum home page. There’s a ton of white space at the top - plenty of room for something . Seems like something that would be quite easy to add.  image1518×710 105 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.777777777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#4",
                    "likes": "1",
                    "time": "30/08/2021-13:42:53",
                    "content": "For now I made this thread anyway https://forum.makerdao.com/t/where-to-find-opportunities-at-makerdao/10076/3 I will talk to long/govalpha about the banner and see what they think. In fact, @LongForWisdom @prose11 @Elihu any thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "0",
                    "time": "30/08/2021-14:06:58",
                    "content": "They definitely advertise on LinkedIn, as I’ve seen openings scrolling through there ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#6",
                    "likes": "2",
                    "time": "30/08/2021-15:04:07",
                    "content": "    Aes:  This is the issue though - had no idea the talent acquisition team was working on anything or had a site, and I doubt most others knew as well   I had no idea either. Maybe putting up a yellow banner that users can exit out of would be better at attracting talent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NH98",
                    "index": "#7",
                    "likes": "2",
                    "time": "30/08/2021-17:54:16",
                    "content": "Wow I didn’t even know this page existed. Is the internship position for SES still available? @juan ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#8",
                    "likes": "2",
                    "time": "30/08/2021-18:46:40",
                    "content": "So generally feel that too many banners can get distracting, but a job positions page seems like a good one to have access to. Could we put the links into our existing banner? Only real issue I see if accessibility to the list, as both the LinkedIn page and Recruiting Page rely on specific actors to maintain it. I don’t think this represents a huge issue, but ideally IMO all the Core Units would be able to update a recruiting page themselves when they have positions open. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#9",
                    "likes": "0",
                    "time": "30/08/2021-18:50:20",
                    "content": "    prose11:  ideally IMO all the Core Units would be able to update a recruiting page themselves when they have positions open.   Totally agree. In the meantime I will make sure to update the thread I made with all sources I can find. I sent an email to all the facilitators this morning asking about their job posting practices. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#10",
                    "likes": "1",
                    "time": "31/08/2021-08:15:32",
                    "content": "    NH98:  the internship position for SES still available      MakerDAO    Business Analyst / Intern / Entry-level position - SES - MakerDAO Business Analyst / Intern / Entry-level position - SES - MakerDAO      ",
                    "links": [
                        "https://makerdao.recruitee.com/o/business-analyst-intern-entrylevel-position-ses"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "4",
                    "time": "31/08/2021-10:46:39",
                    "content": "I’d perhaps like to see a careers page on the homepage (MakerDAO | An Unbiased Global Financial System). Feels like that would be a more appropriate place for a list. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#12",
                    "likes": "2",
                    "time": "23/10/2021-20:00:16",
                    "content": "Definitely. Who has access to the site that can make that happen? Also - I would like to see a forum section above ‘Updates’ and ‘Governance’ that says something like “The DAO is hiring! Open Positions Here!” Within this forum section, each Core Unit can have their own thread that contains a list of open careers with job description, responsibilities, etc etc. What do we have to do to make this happen? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#13",
                    "likes": "1",
                    "time": "24/10/2021-19:35:47",
                    "content": "The other thing that we might need are openings for whole teams or Core Units.  Given the failure of the MakerLabs CU, there is an opening for a team to create non-USD versions of DAI. We probably need a US-focused legal CU.  There are probably other major projects that we could brainstorm. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.913194444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#14",
                    "likes": "0",
                    "time": "25/10/2021-02:23:57",
                    "content": "@manomad : ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/manomad",
                    "index": "#15",
                    "likes": "4",
                    "time": "25/10/2021-11:45:06",
                    "content": "Hello guys, this is Mano (facilitator for MakerTalent CU). We started on Sept 1st and we have been introduced to all the CUs 2 weeks ago (SES Sessions). During November, we will be meeting representatives of each CU to be able to forecast 2022 hiring needs. If you have specific ideas or thoughts on the talent field that you want to share, use this channel: Suggestion BOX or we can also discuss them in our Forum!!! Have a great day! Mano PS: our MIP will be submitted around xmas 2021. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/manomad",
                    "index": "#16",
                    "likes": "1",
                    "time": "03/11/2021-18:22:31",
                    "content": "PD2: As @Davidutro said, all the openings that we are currently handling are posted here: https://makerdao.recruitee.com/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}