{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/nov-16-2022-executive-contents/18747",
            "title": "Nov 16, 2022 - Executive Contents ",
            "index": 18747,
            "category": [
                "Updates",
                "Notices"
            ],
            "tags": [
                "executive"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#1",
                    "likes": "4",
                    "time": "10/11/2022-16:19:48",
                    "content": "The Executive Vote proposed for Nov 16th which CES, GovAlpha and PE will work on will include the following scope:  MIP65 parameter changes Based on this poll, CES will craft a spell with the following parameter changes for RWA007-A:  Maximum Debt Ceiling (line): 500 million DAI. (Currently at 250M DAI) Target Available Debt (gap): 100 million DAI. (Currently at 50M DAI) Update DOC variable as a new Resolution No 5 has been published to instruct the counterparties to execute more transactions to purchase assets. Monetalis has also amended a few older resolutions which have no material impact on the deal, but require housekeeping. More information can be found here.  Current DOC hash: QmRLwB7Ty3ywSzq17GdDdwHvsZGwBg79oUTpSTJGtodToY IPFS link: https://ipfs.io/ipfs/QmRLwB7Ty3ywSzq17GdDdwHvsZGwBg79oUTpSTJGtodToY  Forum link: MIP65 Monetalis Clydesdale Documentation HQ  New suggested DOC hash: QmejL1CKKN5vCwp9QD1gebnnAM2MJSt9XbF64uy4ptkJtR IPFS link: https://ipfs.io/ipfs/QmejL1CKKN5vCwp9QD1gebnnAM2MJSt9XbF64uy4ptkJtR     The poll in fact changes the technical implementation that was announced during the initial executive vote for MIP65 vault deployment: Maker Governance - Proposal Monetalis Clydesdale (RWA007-A) Onboarding, Funding Ambassador Program SPF, Core Unit MKR Streams and Transfers - October 5, 2022 The original executive suggested 2 vaults:  RWA007-A vault with 250M DAI debt ceiling used to invest through Bank Sygnum RWA007-B vault with 250M DAI debt ceiling used to invest through Baillie Gifford.  Now, all the 500M DAI will be invested through Bank Sygnum making the deployment of a secondary vault (RWA007-B) unnecessary, hence the parameter changes executive is suggested on the currently deployed RWA007-A vault.  rETH Debt Ceiling Instant Access Module The rETH Ilk was onboarded in the Maker protocol according to this executive with a max. debt ceiling (line) of 0 DAI. Now that the Oracle Core Unit has achieved quorum on the rETH price feeds, the oracle is ready to be used in the Maker protocol, hence, we are going to make the following parameter changes in rETH ilk as defined in the gov poll:  line: 5 million DAI gap: 3 million DAI ttl: 8 hours   Housekeeping - Chainlog naming convention improvement When deploying the MIP65, CES introduced a new set of inputConduit contracts which swap USDC for DAI and then routes the DAI to the Urn in case of paying back principal or to the RwaJar to account for the yield generated. The naming of this contracts in the chainlog are not consistent enough and we will execute the following change:  Change RWA007_A_INPUT_CONDUIT_URN to `RWA007_A_INPUT_CONDUIT Change RWAXXX_A_INPUT_CONDUIT_JAR to RWAXXX_A_JAR_INPUT_CONDUIT    Housekeeping - DOC variables from RWA008-A and RWA009-A The RWA Liquidation Oracle smart contract contains a DOC variable which is set on vault onboarding. This variable is an IPFS hash which points to a list of legal documents that define the facility being deployed in the real world. Amendments, non material ones, and material ones are done throughout the lifecycle of the facility. We the aim of transparency we want to update the DOC variable of 2 vaults:  RWA008-A - SocGen Current DOC hash: QmdfzY6p5EpkYMN8wcomF2a1GsJbhkPiRQVRYSPfS4NZtB IPFS link: https://ipfs.io/ipfs/QmdfzY6p5EpkYMN8wcomF2a1GsJbhkPiRQVRYSPfS4NZtB Forum link: SG Forge (SocGen) Risk Assessment - #15 by christiancdpetersen New suggested DOC hash: QmZ4heYjptvj3ovafADJpXYMFXMyY3yQjkTXpvjFPnAKcy IPFS link: https://ipfs.io/ipfs/QmZ4heYjptvj3ovafADJpXYMFXMyY3yQjkTXpvjFPnAKcy  Why is the update needed? Current DOC points to a PDF which is a draft containing TBC wording, in substance it is the same as the final. The final version was posted by Will in the forum thread for the risk assessment. For extra context we are storing the full forum thread and the link to the document as well in the IPFS hash.  RWA009-A - HVB Current DOC hash: QmQx3bMtjncka2jUsGwKu7ButuPJFn9yDEEvpg9xZ71ECh IPFS link: https://ipfs.io/ipfs/QmQx3bMtjncka2jUsGwKu7ButuPJFn9yDEEvpg9xZ71ECh Forum link: Huntingdon Valley Bank: Transaction Documents on Permaweb - #11 by christiancdpetersen New suggested DOC hash: QmeRrbDF8MVPQfNe83gWf2qV48jApVigm1WyjEtDXCZ5rT IPFS link: https://ipfs.io/ipfs/QmeRrbDF8MVPQfNe83gWf2qV48jApVigm1WyjEtDXCZ5rT  Why is the update needed? Current DOC points to a forum thread with links to documents without signatures and signatures are available now in the latest forum post. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-documentation-hq/17923#mip65-establishment-and-deployment-instructions-4",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-documentation-hq/17923/8",
                        "https://ipfs.io/ipfs/QmRLwB7Ty3ywSzq17GdDdwHvsZGwBg79oUTpSTJGtodToY",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-documentation-hq/17923",
                        "https://ipfs.io/ipfs/QmejL1CKKN5vCwp9QD1gebnnAM2MJSt9XbF64uy4ptkJtR",
                        "https://vote.makerdao.com/polling/QmSfMtTM#poll-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-monetalis-clydesdale-rwa007-a-onboarding-funding-ambassador-program-spf-core-unit-mkr-streams-and-transfers-october-5-2022#proposal-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-reth-technical-onboarding-enable-starknet-dai-bridge-fees-october-26-2022#proposal-detail",
                        "https://vote.makerdao.com/polling/QmfMswF2#poll-detail",
                        "https://ipfs.io/ipfs/QmdfzY6p5EpkYMN8wcomF2a1GsJbhkPiRQVRYSPfS4NZtB",
                        "https://forum.makerdao.com/t/sg-forge-socgen-risk-assessment/15638/15",
                        "https://ipfs.io/ipfs/QmZ4heYjptvj3ovafADJpXYMFXMyY3yQjkTXpvjFPnAKcy",
                        "https://ipfs.io/ipfs/QmQx3bMtjncka2jUsGwKu7ButuPJFn9yDEEvpg9xZ71ECh",
                        "https://forum.makerdao.com/t/huntingdon-valley-bank-transaction-documents-on-permaweb/16264/11",
                        "https://ipfs.io/ipfs/QmeRrbDF8MVPQfNe83gWf2qV48jApVigm1WyjEtDXCZ5rT",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-november-2022/19023",
                        "https://forum.makerdao.com/t/ces-update-october-november-and-end-of-2022-forecast/19050",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-october-2022/18650",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/135"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.484043088694252
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/11/2022-16:21:39",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}