{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-possible-unintended-consequences-of-psm-reduction-in-stablecoin-liquidity-pools/5380",
            "title": "[Discussion] Possible unintended consequences of PSM: reduction in stablecoin liquidity pools ",
            "index": 5380,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion",
                "pegstab-module"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/OneBiteLawnOrder",
                    "index": "#1",
                    "likes": "2",
                    "time": "28/11/2020-19:30:54",
                    "content": "I haven’t seen much discussion about how the PSM, if implemented, would effect stablecoin liquidity pools. People have talked about how the PSM could be detrimental in the long run by “taking the meat off the bones” for peg arbers. It seems to me that putting the DAI price on narrow rails would also reduce the incentive for liquidity providers to put liquidity in stablecoin pools like the Curve Y and 3Pool. If someone can swap from a stablecoin to DAI with no slippage except for the PSM spread wouldn’t that drastically reduce the volume through the Curve stable pools? Are we intending the PSM to eat Curve’s lunch? Or is the goal to set the PSM spread so that stablecoin liquidity pools still play an important role market making within that spread? I think that the stablecoin pools are an important sink for DAI and will help absorb DAI supply in the long run. I guess I’m just questioning the wisdom of competing directly with Curve with the PSM. Maybe we get the best of both worlds by keeping the PSM spread fairly wide? I’m still thinking of all the implications here so wanted to get a conversation started before we start voting on the PSM parameters. ",
                    "links": [],
                    "GPT-summary": "The author of the post is discussing the potential unintended consequences of implementing the PSM on stablecoin liquidity pools. They are questioning whether the PSM would reduce the incentive for liquidity providers to put liquidity in stablecoin pools like the Curve Y and 3Pool. The post is asking for feedback and starting a conversation about the implications of the PSM on stablecoin liquidity pools.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.431818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#2",
                    "likes": "1",
                    "time": "28/11/2020-20:10:43",
                    "content": "I mean just like Curve didn’t eliminate stablecoin - stablecoin trading on Uniswap (even before the launch of UNI), my guess is they will co exist. Also, it’s about innovation. Curve or others will adjust their strategies to PSM if it impacts them severely. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#3",
                    "likes": "2",
                    "time": "28/11/2020-21:27:33",
                    "content": "I think curve is more impacted by a dai != 1 Dollar than by the PSM. You will still have traffic passing by curve as it is going to be between both limit. Even with 1.0001 PSM 0.01% curve will still have traffic. Don’t forget curve algo works the best for two tokens which are exactly at the same price. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneBiteLawnOrder",
                    "index": "#4",
                    "likes": "0",
                    "time": "28/11/2020-21:48:39",
                    "content": "Yes but in your example the max spread in the PSM would be 0.02% which undercuts Curve’s 0.04% fee. It would be cheaper to trade DAI with the PSM than to even pay the fee on Curve let alone incur slippage on larger trades. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "1",
                    "time": "28/11/2020-22:04:30",
                    "content": " Gas plays a lot at this price, and PSM is not efficient. Cross coin will be 0.04 Curve can cut it is price. They have way more coins than what PSM will have, because they are more efficient to manage unpeg coin. PSM at 0.001 will bring a lot of risk on Maker. Imagine usdc loses its peg.  PSM is efficient to bring the peg back, but I don’t believe it will serve more purpose. Maybe marginally but not more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.678571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#6",
                    "likes": "1",
                    "time": "29/11/2020-12:25:44",
                    "content": "    OneBiteLawnOrder:  the max spread in the PSM would be 0.02% which undercuts Curve’s 0.04% fee   So in the last on-chain poll there was 0.1% tin proposed, which means max spread would be 0.2%, higher than Curve’s 0.04% fee. It is true though that slippage will be smaller for larger trades through PSM. But gas costs on the other hand probably higher as @alexis mentioned. I think Curve liquidity will still stay there because LP yield consists of CRV yield farming rewards, which PSM doesn’t offer. Also it isn’t quite clear which stablecoins do we intend to include in the PSM and in what proportions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.515625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "28/02/2021-18:25:51",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}