{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/badges-are-live-in-the-maker-forum/4503",
            "title": "Badges Are Live In The Maker Forum! ",
            "index": 4503,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#1",
                    "likes": "13",
                    "time": "01/10/2020-15:38:10",
                    "content": "The Maker community is extremely excited to announce the arrival of our new Badges! Created by members of the Community Development team to help personalize interactions between community members in the Maker Forum, the first release includes 33 badges that can be earned for taking actions relating to Dai and Governance. IF there are badges you know should be released that you are not receiving, please post about it in our Github, here. Badges in Discourse, the software used to power the Maker Forum, are normally used for likes on posts and receiving feedback on your posts but our new Badges enable community members to demonstrate their participation in various aspects of MakerDAO. Read on to learn more about what badges are available, how they were created, and where you can go to redeem them.  1200×670 375 KB    MakerDAO Community Badges    Governance  |177.43746910528915x232650×850 569 KB   Governance Polls On-chain polling is used to understand the sentiment of token holders toward implementing and changing risk parameters. Vote on a Governance Poll to unlock this achievement. This badge is tiered; vote on another 5, 10, 20, 50, 100 polls to redeem all (currently) available.  |169x220.031874818893041218×1593 448 KB   Executive Votes Governance is able to implement progressive changes while protecting the system from unintended changes, using Continuous Approval Voting. Vote on an Executive Proposal to unlock this achievement. This badge is tiered; vote on another 5, 10, 20, or 50 Executive Proposals to unlock all of the badges!   Dai   |189.53637770897825x249650×850 459 KB   Send 10 Dai Sending Dai is the backbone of the decentralized ecosystem. Send 10 Dai (from your compatible web3 wallet) for gifts, rent, or returning the favor to unlock this achievement. This badge is tiered, send 20 or 100 Dai to redeem the next badges!  |187x245.95496058711606650×851 833 KB   Bite an Unsafe Vault In order to keep Dai stable, MKR holders need to ensure collateral can be swiftly swapped to repay Dai debt. Help maintain the system by biting a vault that is below the required collateralization ratio to unlock this achievement. This badge is tiered; bite another 10, 50, or 100 vaults to redeem further badges!  |208x272.2414201183433650×850 569 KB   Accrue 1 Dai in the DSR Accruing Dai in the Dai Savings Rate (DSR) is a great way to earn while maintaining the value of your holdings. You can start accumulating with Dai from an exchange. Accrue 1 Dai by locking Dai in Oasis Save to unlock this achievement. This badge is tiered, the next levels are earning in DSR for 3 months and for 6 months.  |199x259.11194927421841137×1487 385 KB   Bid on a Collateral Auction Once unsafe vaults are bitten, the collateral is swapped for Dai to pay back the outstanding debt. Bid on a collateral auction from a liquidated vault to unlock this achievement. This badge is tiered; bid on another 5, 10, or 25 auctions to unlock further achievements!   Making The Badges  The Badges are created using a modified version of ERC721 based on a special form of non-fungible tokens (NFTs) called Unique Non-Transferrable NFTs (NTNFTs). Like NFTs, NTNFTs can’t be divided into parts the way “regular” cryptocurrencies can. Unlike NFTs, however, NTNFTs can’t be transferred from one address to another after they’ve been distributed.  BadgesFlowChart1502×735 82.7 KB  The goal of this project is to increase community engagement by gamifying interactions between the people of MakerDAO. Badges aren’t just a fun way to tell how different community members participate in MakerDAO, they provide a basis for different forms of coordination around things like leaderboards, vote delegation, and communication in the Maker Forums. To learn more about this project and how the badges are created, please visit the Readme on Github.   How to Redeem Your Badges  These badges are now available for redemption via the Maker Forum. Redeeming badges does tie the address(es) used to participate in MakerDAO and use Dai to the username you use in the Maker Forum. The risk is that a researcher can deduce the likelihood of an address and username being connected based on the badges claimed. Here’s how to claim your badge(s):  1317×425 45.2 KB    Click on your avatar at the top-right corner of the page.   Click your username in the top-left corner of the pop-up menu.   Select “Preferences.”   At the bottom of the “Preferences” page is a button that says “Import Maker Badges.”    Click “Import Maker Badges.”   Connect to MetaMask and sign the transaction.   Signing the transaction unlocks your badges, the signing address qualifies. You do have to use the same wallet that is connected to the Governance Portal. You may need to refresh the page. Signing the contract twice won’t cause an issue but won’t change the status either. You should receive a notification with a link confirming you’ve received your Badge(s). Please note that it may take several minutes for the system to process your claim. That’s it!   Finding the Badges   Click the 3-bar menu icon next to your picture/name in the top right corner. This opens a small menu that includes a “Badges” button.   1244×394 23 KB  Select “Badges” to see all of the badges that are available as well as ones you’ve already obtained. Clicking a specific badge on this page will display all of the users who have obtained the badge.  |624x298.533442938487441348×646 87.6 KB   Share Your Feedback Have comments, questions, or other feedback you’d like to share? Leave it in the comments below or reach out to the #community-development channel on Maker Chat. You can also report bugs or other issues on our Github, here. ",
                    "links": [
                        "https://vote.makerdao.com/polling",
                        "https://vote.makerdao.com/",
                        "https://oasis.app/save",
                        "https://github.com/rrecuero/open-proofs",
                        "https://github.com/naszam/maker-badges",
                        "https://forum.makerdao.com/",
                        "https://staging-forum.makerfoundation.com/my/preferences/account",
                        "https://vote.makerdao.com/",
                        "https://github.com/andersonmmi/discourse-maker-badges-theme-component/issues",
                        "https://forum.makerdao.com/t/a-maker-community-2020-summary/5848",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-112-thursday-october-1-16-00-utc/4391/3",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-113-thursday-october-8-16-00-utc/4505/5",
                        "https://forum.makerdao.com/t/the-official-welcome-thread/771/43",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-112-thursday-october-1-16-00-utc/4391/5",
                        "https://forum.makerdao.com/t/create-nft-for-the-mkr-community/11415/5",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.031204906204906
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "1",
                    "time": "01/10/2020-15:54:38",
                    "content": "When I click the “Claim Maker Badge” button, nothing happens. I’m using Firefox 75 on Ubuntu Focus. I’ve used metamask on this browser many times so I doubt that is the issue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/web3developer",
                    "index": "#3",
                    "likes": "1",
                    "time": "01/10/2020-16:11:51",
                    "content": "Thank you for letting us know about this behavior and the environment. We’ll try to reproduce this behavior and patch it! Try using Chrome in the meantime. If the component is working properly, you’ll see user feedback and errors immediately below the redemption button. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shane",
                    "index": "#4",
                    "likes": "2",
                    "time": "01/10/2020-16:15:12",
                    "content": "Great work! I have claimed some badges (send DAI), but I’m fairly certain I have earned some of the other badges that are not showing up on my account. Some examples of ones that I am unable to claim:  Vote on an Executive Proposal Vote on a Governance Poll Vote on 2 consecutive Governance Polls  For some additional data, my votes on these have come in the last two rounds of governance and executive polls. Does this seem like an issue or is there something I may be misunderstanding? I’d be happy to provide additional data if needed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.157738095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "3",
                    "time": "01/10/2020-16:17:58",
                    "content": "    web3developer:  Try using Chrome in the meantime. If the component is working properly, you’ll see user feedback and errors immediately below the redemption button.   Google chrome worked fine. Badges were claimed  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/web3developer",
                    "index": "#6",
                    "likes": "3",
                    "time": "01/10/2020-16:23:31",
                    "content": "If you have used different accounts for those activities, connect and sign with those accounts to collect the rest. If that’s not the case, the developers can do some research to discover the root of the issue. If you don’t mind, drop by https://github.com/andersonmmi/discourse-maker-badges-theme-component/issues and open an issue. Include the address(es) that are qualified for badges and any logs from the inspector you can get ahold of if you can. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shane",
                    "index": "#7",
                    "likes": "2",
                    "time": "01/10/2020-16:24:44",
                    "content": "    web3developer:  If that’s not the case, the developers can do some research to discover the root of the issue.   Will do. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#8",
                    "likes": "4",
                    "time": "01/10/2020-16:31:45",
                    "content": "This is really really really cool. Good work guys. I’m pumped! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shane",
                    "index": "#9",
                    "likes": "0",
                    "time": "01/10/2020-16:42:58",
                    "content": "@web3developer I am confirming and writing up an issue, but have one question. According to this site, I have not participated in any executive votes. I may be missing something fundamental, but does going on vote.makerdao.com and sending a transaction to vote not enough?    mkrgov.science    Maker Governance Dashboard      Example voting transaction that I would assume have earned me the badge: 0xb2ad8c452dde387b72f56b6c6e70c23197b3190ff7aa543a8e0c3e97c51010e3. ",
                    "links": [
                        "https://mkrgov.science/voting-history",
                        "https://mkrgov.science/voting-history",
                        "https://etherscan.io/tx/0xb2ad8c452dde387b72f56b6c6e70c23197b3190ff7aa543a8e0c3e97c51010e3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shane",
                    "index": "#10",
                    "likes": "2",
                    "time": "01/10/2020-16:46:32",
                    "content": "(For some reason I am unable to edit my last message so I will continue it here) Somehow that site now does show my history. See below. Given that I do have a history of voting on that site, would you imagine I technically should have badges? Here is my address to try on that site if you want: 0x92e5a4b202f57b3634d6352fbabba9cf2908a14a Maker Governance Dashboard Voting Confirmation: https://mkrgov.science/voter/0x92e5a4b202f57b3634d6352fbabba9cf2908a14a ",
                    "links": [
                        "https://mkrgov.science/voter/0x92e5a4b202f57b3634d6352fbabba9cf2908a14a"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/web3developer",
                    "index": "#11",
                    "likes": "1",
                    "time": "01/10/2020-16:48:12",
                    "content": "That sounds like it should have been enough. The issue is likely on our side. I’ll ask the merkle service devs to troubleshoot it. @scottrepreneur and @naszam, any ideas? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/web3developer",
                    "index": "#12",
                    "likes": "2",
                    "time": "01/10/2020-17:36:21",
                    "content": "Tracking on issue #21  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#13",
                    "likes": "2",
                    "time": "01/10/2020-17:37:35",
                    "content": "Do these badges have any utility in the forum? Eg private executive voter lounge, or signal requests only available to folks who have voted in polls? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/web3developer",
                    "index": "#14",
                    "likes": "3",
                    "time": "01/10/2020-17:47:42",
                    "content": "Anyone filing issues at https://github.com/andersonmmi/discourse-maker-badges-theme-component/issues, please be advised that you don’t have to reveal your address or logs that contain your address if you want to maintain pseudonymity. Only reveal your address in a bug report if your control of that particular address is already public knowledge. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/web3developer",
                    "index": "#15",
                    "likes": "4",
                    "time": "01/10/2020-17:50:35",
                    "content": "We haven’t added any features like that yet. We do intend to take user feedback and requests and channel them through the CDIP process in order to extend web3 interactivity on this forum. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scottrepreneur",
                    "index": "#16",
                    "likes": "4",
                    "time": "01/10/2020-18:33:07",
                    "content": "Hey Shane, I found a bug in the proxy lookup logic. Will get this fixed and update you. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#17",
                    "likes": "2",
                    "time": "01/10/2020-18:55:13",
                    "content": "Wow, this looks cool and fun to play with!  I’m curious to see who will be first to collect them all ! EDIT: my bet is on @reuptaken !    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.115625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hyman",
                    "index": "#18",
                    "likes": "3",
                    "time": "01/10/2020-20:23:34",
                    "content": "I like the badges, this is very neat ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/reuptaken",
                    "index": "#19",
                    "likes": "2",
                    "time": "02/10/2020-11:30:12",
                    "content": "LOL, I doubt that. I couldn’t even claim my badges. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#20",
                    "likes": "1",
                    "time": "02/10/2020-18:40:19",
                    "content": "    JerryAG:  Redeeming badges does tie the address(es) used to participate in MakerDAO and use Dai to the username you use in the Maker Forum. If you’re not comfortable with this association being made public, please don’t attempt to claim any badges.   Where can I see i.e. your wallet address used to claim your badges? Did anyone calculate how much it costs to claim all badges (@ 100 gwei for example) and what skills are required besides using a wallet + web UI? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/web3developer",
                    "index": "#21",
                    "likes": "4",
                    "time": "13/10/2020-04:47:55",
                    "content": "Hey @bit, There’s no direct mapping of usernames and addresses persisted by the redemption process. The tie is of a statistical nature, such that a researcher can deduce the exact likelihood of a given user controlling a set of addresses through a quantitative analysis of the badges awarded to a username. Redeeming badges through the discourse interface does not incur a gas cost. There are corresponding NFT’s being developed through CDIPs 18 & 29 and gas fee mitigation techniques are being explored to reduce costs before deployment to production. Wallet and Web UI skills should be sufficient for all redemption operations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#22",
                    "likes": "0",
                    "time": "05/11/2020-20:29:46",
                    "content": "could it be that getting the badges from the preferences is not working anymore? when clicking the “import badges” button i get a 404 on GET https://3nsc1491ed.execute-api.us-east-1.amazonaws.com/dev/dev/discourse?username=ultraschuppi&address=....in my browsers dev-console… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#23",
                    "likes": "1",
                    "time": "07/11/2020-01:11:32",
                    "content": "Forwarded to Badges squad just FYI. We’ll dig into this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#24",
                    "likes": "1",
                    "time": "16/11/2020-19:04:05",
                    "content": "Any update on the import badges functionality? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#25",
                    "likes": "0",
                    "time": "16/11/2020-23:54:03",
                    "content": "Working on fixing up some dev pipelines. When was the last time you tried to redeem? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tbone",
                    "index": "#26",
                    "likes": "0",
                    "time": "17/11/2020-00:04:50",
                    "content": "cheers, last week and about 5 hours ago. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#27",
                    "likes": "0",
                    "time": "17/11/2020-00:05:50",
                    "content": "Gotcha! Ok. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Chao.Pan",
                    "index": "#28",
                    "likes": "0",
                    "time": "17/11/2020-00:33:14",
                    "content": "Super cool ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.708333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#29",
                    "likes": "0",
                    "time": "17/11/2020-03:06:10",
                    "content": "i have the same issue ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#30",
                    "likes": "3",
                    "time": "09/12/2020-14:43:15",
                    "content": "btw: claiming the maker badges works again  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#31",
                    "likes": "0",
                    "time": "09/12/2020-16:20:01",
                    "content": "Good to hear! There was a misplaced dev/dev that was a the problem for some. The working group meets Friday to double check for more addresses and set badges up for success. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#32",
                    "likes": "1",
                    "time": "09/12/2020-16:37:50",
                    "content": "It works !!! thanks for fixing it  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#33",
                    "likes": "1",
                    "time": "09/12/2020-17:16:13",
                    "content": "Is there a way to disable the lower count badges of the same type so that I can show off the higher count ones more prominently?  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#34",
                    "likes": "0",
                    "time": "09/12/2020-17:25:52",
                    "content": "I believe that’s an admin function within discourse. So, yes it’s possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#35",
                    "likes": "0",
                    "time": "10/12/2020-05:57:00",
                    "content": "How to add more associated wallet addresses. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#36",
                    "likes": "0",
                    "time": "10/12/2020-06:23:46",
                    "content": "Just claim with all your wallet sequentially. Should work out of the box ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#37",
                    "likes": "0",
                    "time": "10/12/2020-08:41:18",
                    "content": "It seems that the badges of other wallet addresses have not been successfully imported ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shane",
                    "index": "#38",
                    "likes": "0",
                    "time": "10/12/2020-15:34:14",
                    "content": "Because of the DSChief v1.2 migration, existing cold/hot wallet links have to be broken and new links must be created. How are badges handled in this case? Specifically, will the “consecutive votes” continue if:   Both the hot and the cold wallets are the same on the new DSChief?   The hot wallet is the same but the cold wallet is different on the new DSChief?   The cold wallet is the same but the hot wallet is different on the new DSChief?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.717329545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#39",
                    "likes": "4",
                    "time": "25/01/2021-20:05:44",
                    "content": "Hi folks! Just a quick update you might see reduced functionality on badges for a week or two. We’re making some upgrades on the backend and will update everyone when they’re restored. If you’re super curious about them or have ideas/suggestions, my rocketchat is always open @tim.black ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.708333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#40",
                    "likes": "0",
                    "time": "26/01/2021-07:27:38",
                    "content": "@twblack88 I am getting a bit worried about privacy concern. What attack vectors are there for finding out about identities? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#41",
                    "likes": "0",
                    "time": "26/01/2021-16:07:30",
                    "content": "I believe privacy concerns are answered above? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#42",
                    "likes": "0",
                    "time": "22/04/2021-12:49:19",
                    "content": "Woot my first badge important was successful! But I would love to get some badges for all the ETH I’ve spent to vote  Is there any reason it’s able to see my DAI transaction but not my voting history? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.072916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#43",
                    "likes": "2",
                    "time": "22/04/2021-12:52:57",
                    "content": "congrats mate! voting on polls/exec seems not to work properly right now… experienced the same ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.80952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#44",
                    "likes": "6",
                    "time": "22/04/2021-16:26:15",
                    "content": "The team is working on redesigning the contract, interface, designs, and challenges. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#48",
                    "likes": "0",
                    "time": "20/06/2021-03:32:04",
                    "content": "My badges do not seem to be correctly being granted. I’ve voted on multiple polls and executive votes and it doesn’t seem to see them, but does see that I’ve sent some very low amount of DAI. Any idea how to fix this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#49",
                    "likes": "2",
                    "time": "21/06/2021-18:27:09",
                    "content": "We’re working on a redesign, new architecture, updated contracts, and will be happy to test them with you once their in a ready state. Which should be in a few weeks.  Right now they don’t properly grant/display/redeem because they don’t properly count. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8729128014842304
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#50",
                    "likes": "0",
                    "time": "21/06/2021-18:36:24",
                    "content": "Awesome, thanks my man!     twblack88:  Right now they don’t properly grant/display/redeem because they don’t properly count.   Those do seem like fairly crucial features  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.279761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#51",
                    "likes": "2",
                    "time": "21/06/2021-19:36:35",
                    "content": " it’s a long adventure through subgraphs and discourse plugins that will get a nice write-up on the new version. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.143939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#52",
                    "likes": "1",
                    "time": "13/11/2022-14:12:27",
                    "content": "FYI @twblack88 not sure of the status of this feature but tried to import badges and my front end (chrome and brave) are generating this error  SCR-20221113-cn71490×298 57.3 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#53",
                    "likes": "1",
                    "time": "13/11/2022-23:44:21",
                    "content": "Consider it dead until it’s API gets a refresh and we deploy a Frontend. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Freakytainment",
                    "index": "#54",
                    "likes": "0",
                    "time": "14/11/2022-22:40:17",
                    "content": "It’s cool to see the introduction of badges, just like it is on other smart contracts forum. If I claim the badges would they appear on my discourse profile, and what’s the use of the badges we hold? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.732142857142857
                }
            ]
        }
    ]
}