{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/scd-mcd-migration-feedback/909",
            "title": "SCD-MCD Migration Feedback ",
            "index": 909,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "feedback",
                "mcd-migration",
                "user-research"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "2",
                    "time": "04/12/2019-01:13:06",
                    "content": "Given that the Maker SCD to MCD migration is a pretty big topic and lots of people have been coming around to relay problems with the migration I thought perhaps we should have something up where people can focus their migration issues. I also wondered if it would be a good idea to poll people regarding their migration experience.  I assume all people participating in this have opened at least one CDP. Here is a example questionnaire.  Were you able to migrate your CDP successfully Y/N? If you migrated successfully how would you rate your experience in a 1-10 (10 easy, great fast, intuitive stress free, 5 I did it, but consumed a bit more time somewhat stressful, 1 horrible, took way too much time, not intuitive, stressful). If you have not migrated please check off the reasons. a)   lack of SAI liquidity  y/n b)   technical issues with wallet, website, browser, etc. y/n c)   can’t pay the fees currently y/n d)   other (please list) Did the migration cause you concern or stress y/n Would you recommend to someone else to use Maker y/n If you answered no to 5)  did the migration experience cause you use other decentralized services? Do you still plan on owning or holding DAI? y/n  This is just an idea.   Feel free to comment or elaborate. I could not find a category for this (user feed back) so left it empty. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.028985507246377
                }
            ]
        }
    ]
}