{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/makerdao-is-not-a-stablecoin-protocol/2422",
            "title": "MakerDAO is not a stablecoin protocol ",
            "index": 2422,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "meta-governance",
                "alignment"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#1",
                    "likes": "1",
                    "time": "09/05/2020-05:31:34",
                    "content": "I think a lot of grief MKR holders are receiving is largely due to public perception that MakerDAO is building a stablecoin (synthetic) protocol, when in fact it is building a credit and risk management protocol. If you are not of the same view as me, here are some long-form thoughts I’d appreciate feedback on:   github.com   OliverNChalk/essays/blob/master/DeFi/WhatIsMakerDAO.md # What is MakerDAO A lot of MakerDAO's supporters and critics think it is simply a stablecoin protocol. In this article, I go over the core MakerDAO components, the $MKR token, and why MakerDAO is not primarily a stablecoin but rather a decentralized credit system.  ### MakerDAO System Overview There are a few core components in the MCD (Multi-Collateral DAI) system:  - Vaults: Borrowers can access $DAI loans by posting collateral  - $MKR: Governance & buyers of last resort  - $DAI: Synthetic USD  And we also have some core actors:  - Vault owners, access liquidity against worthy collateral  - $MKR Holders    - Take on systemic risk (risk of MKR dilution)    - Recipients of system earnings    - Right to govern risk parameters  - $DAI Holders    - Seek USD exposure    - Potentially paid to hold $DAI (via the DSR: Dai Savings Rate)  Most people only see a stablecoin when they look at $DAI but the real innovations here is the credit protocol that lets businesses and individuals access liquidity against their assets (liquid or illiquid). This system has the potential to scale massively as a credit enabling protocol, not so much as a stablecoin.     This file has been truncated. show original      I think this mismatch between what the public perceives MakerDAO as and what MakerDAO actually is, should be actively addressed. ",
                    "links": [
                        "https://github.com/OliverNChalk/essays/blob/master/DeFi/WhatIsMakerDAO.md",
                        "https://github.com/OliverNChalk/essays/blob/master/DeFi/WhatIsMakerDAO.md"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.103741496598639
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "3",
                    "time": "11/05/2020-10:12:15",
                    "content": "Sure, I’ll bite.     OliverNChalk:  I think a lot of grief MKR holders are receiving is largely due to public perception that MakerDAO is building a stablecoin (synthetic) protocol   Hard to blame people for this. This has been the messaging from the beginning.  …why MakerDAO is not primarily a stablecoin but rather a decentralized credit system  It’s both, but the stablecoin is the USP. I disagree that it’s primarily a decentralized credit system.  This system has the potential to scale massively as a credit enabling protocol, not so much as a stablecoin.  Disagree strongly with this, and furthmore, if it is true, then we’re in serious trouble. Neither side of the Protocol works correctly without the other. If we only scale one of the two sides, the imbalance causes the both sides to behave sub-optimally, which is seen in deviation of DAI from the $1 peg.  Too much credit = breaking below peg. Too many stablecoin users = breaking above peg.   MakerDAO is not a capital-efficient protocol for the leveraged trading of liquid assets, this should be obvious from the various design choices in the system…  Mostly agree here, it’s not the best for leverage. Though it does have some advantages. It’s worth mentioning that the 150% ratio isn’t fixed, so it can become more capital efficient. Slow oracle & liquidations is actually an advantage in some ways. It gives leverage seekers 1 hours notice before they are liquidated, so I would disagree that there is a higher liquidation risk. (Though I agree that liquidations are generally less efficient.)  Thankfully, the community is now discussing reducing the debt ceiling but this incident showed much of the community still does not properly understand the system they are attempting to govern  Based on this post, I’m not sure that you understand it fully either. You cannot just print DAI without worrying about stablecoin demand. You claim that the credit side of the balance is the primary one, but if you just scale DAI supply through additional collateral types and there isn’t enough demand to absorb that DAI then you just end up with DAI getting inflated. Suddenly the credit side is way less attractive when you only get 0.8 DAI for your dollar. TLDR: The protocol isn’t primarily anything, both sides of the balance (stablecoin demand and decentralized credit demand) are essential and neither can operate without the other. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.470238095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/05/2020-13:49:43",
                    "content": "Thank you for the feedback, glad you decided to bite , to address your thoughts:  Disagree strongly with this, and furthmore, if it  is  true, then we’re in serious trouble. Neither side of the Protocol works correctly without the other. If we only scale one of the two sides, the imbalance causes the both sides to behave sub-optimally, which is seen in deviation of DAI from the $1 peg.  Too much credit = breaking below peg. Too many stablecoin users = breaking above peg.   This is true of any synthetic/futures platform and MakerDAO is no exception. In Maker, DAI minters pay DAI holders funding. The system doesn’t currently support a scenario where DAI holders can pay DAI minters funding, this means that the system forces “shorts” (minters) to pay “longs” (holders) funding, which differs from every other good synthetic protocol (including perps here) that I am aware of. The reason this is a problem is that we can find ourselves in a situation like the one we are in now where we cannot incentivize CDP holders (shorts) sufficiently and this DAI is trading above the peg. Now, the reason Maker doesn’t support a negative DSR is two-fold:  Tech limitations (DSR variable is unit instead of int + DSR not globally applied). Negative DSR would violate the social contract of 1 $DAI = 1 $USD.  So given the limitation that we cannot incentivize CDP holders with negative rates, the short side (CDP holders) is indeed more important than the long side (DAI holders).  Based on this post, I’m not sure that you understand it fully either.  You cannot just print DAI without worrying about stablecoin demand.  You claim that the credit side of the balance is the primary one, but if you just scale DAI supply through additional collateral types and there isn’t enough demand to absorb that DAI then you just end up with DAI getting inflated. Suddenly the credit side is way less attractive when you only get 0.8 DAI for your dollar.  This is why we introduced the DSR, so that we could encourage rational actors (arbitrageurs, market-makers etc) to come in and purchase DAI to earn the risk-free interest rate it provides. In terms of capital efficiency, it is also much easier to raise the DAI price than it is to lower it (150% collateralization for shorts vs. 100% for longs). Maker could scale to billions without a single retail holder. However, the reverse is not true unless we introduce a negative DSR (which I don’t think is without its drawbacks) Now, I am super bullish on DAI as a stablecoin, it is currently the only viable USD synthetic I am aware of. It is also an amazing utility, like most synthetics, for higher-level products to build on top of. Having DAI available to DeFi benefits the ecosystem greatly but DAI will soon have to compete with other synthetics and so it seems rational to focus on where we have our edge (enabling unique and sometimes illiquid collaterals to draw DAI).  Mostly agree here, it’s not the best for leverage. Though it does have some advantages. It’s worth mentioning that the 150% ratio isn’t fixed, so it can become more capital efficient. Slow oracle & liquidations is actually an advantage in some ways. It gives leverage seekers 1 hours notice before they are liquidated, so I would disagree that there is a higher liquidation risk. (Though I agree that liquidations are generally less efficient.)  I think this is a moot point. Yes, you may be able to make MakerDAO slightly more attractive for margin traders but you will never have a solution that is competitive with other centralized and decentralized architectures that focus on higher marketcap, liquid collaterals. The 1-hour window is not a free lunch, i.e. it does not simply provide a benefit to CDP holders at no cost to MKR holders. As I am sure you are aware, if the price of ETH moves below the collateralization ratio before the oracle updates, arbitrageurs will be able to open undercollateralized loans and walk away with the difference as profit (at the cost of MKR holders). The cost arbitrageurs impose on MKR holders maps identically to options pricing, if you assume a Premium of zero and a Quantity of debt_ceiling - current_debt, that is that arbitrageurs pay nothing to get access to Maker (permissionless) and that the maximum amount of undercollateralized DAI they could mint is the difference between DAI in circulation for the collateral and the debt ceiling. I don’t have the math skills to solve this option’s strike price but what matters is that it’s non-zero and scales exponentially as we lower the collateralization ratio: 150% Collateralization:  - Strike: 2/3 * ETHUSD  - Expiry: 1 Hour  - Quantity: debt_ceiling - current_debt  110% Collateralization:  - Strike: 0.9091 * ETHUSD  - Expiry: 1 Hour  - Quantity: debt_ceiling - current_debt   The second option here imposes a much larger systemic cost on MKR holders which will need to be recovered via a larger risk premium charged on the lower-collateralization version of ETH. So my point that Maker’s current architecture is fundamentally not designed for high margin trading stands (and the 1-hour window is the reason why. no i am not proposing we move the window). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.840541422048271
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/05/2020-17:46:04",
                    "content": "I think the stablecoin part is important. It’s more than a credit system. You can look at the other secondary market lenders, aave and compound. The big difference is that maker has it’s own stablecoin that people borrow. The DAI stablecoin ecosystem is a key part of Maker. Also, yes the protocol isn’t the best for high leverage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.241666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "0",
                    "time": "11/05/2020-17:50:38",
                    "content": "You make some good points. Thanks for clarifying your initial post. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#6",
                    "likes": "0",
                    "time": "17/05/2020-14:51:46",
                    "content": "    OliverNChalk:   Tech limitations (DSR variable is unit instead of int + DSR not globally applied). Negative DSR would violate the social contract of 1 $DAI = 1 $USD.    I added an “Are DAI Holders Necessary” section to clarify my position a little more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.038194444444445
                }
            ]
        }
    ]
}