{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/monthly-strategy-review-process-review-discussion-public-call-on-10-26-21-1-30pm-utc/11183",
            "title": "Monthly Strategy Review - Process Review & Discussion (Public Call on 10/26/21 1:30PM UTC) ",
            "index": 11183,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "summary",
                "meta-governance",
                "core-unit",
                "public-call",
                "pubcall-:-strategic-review",
                "quarterly-review"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "13",
                    "time": "25/10/2021-22:26:53",
                    "content": "All, As Rune discussed during last week’s G&R call, there are some issues we need to address as the DAO scales. The current perception, right or wrong, is that CUs are black boxes and there is little transparency and accountability after a CU has been approved. Existing reporting is highly fragmented, lacks standardization, and is spread across the forum in various places. As Maker has decentralized, it feels like we lack a core mission and clear strategy - though the former is being actively discussed and voted on. In order for the DAO to be successful, we need to align on Maker’s most important KPIs, understand what’s driving them, and how we can collaborate as a community to continually improve them and overcome any challenges or roadblocks we face. The plan for this call will be to review the drafted deck, align on KPIs, and begin formalizing the process and scope.  Once the community is aligned on the deck, we will have a monthly one-stop-shop for discussing and analyzing the DAO’s strategic plan and how we’re executing against it. If you would like to join part one of the conversation, please join the below zoom from 1:30 - 2:30 PM UTC to discuss!    Zoom Video   Join our Cloud HD Video Meeting Zoom is the leader in modern enterprise video communications, with an easy, reliable cloud platform for video and audio conferencing, chat, and webinars across mobile, desktop, and room systems. Zoom Rooms is the original software-based conference...      Meeting ID: 737 5357 5505 Passcode: RWF22 @LongForWisdom @prose11 @PaperImperium @flipflopflapdelegate @rune @Derek @Real-World-Finance @juan @wouter @Nadia @MarianoDP @Primoz @NikKunkel @MakerMan @twblack88 @monkey.irish @Davidutro @iammeeoh @Planet_X ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-would-you-like-to-see-makerdao-move-in-the-general-direction-indicated-by-the-post-the-case-for-clean-money/10932",
                        "https://us04web.zoom.us/j/73753575505?pwd=UjNvTXRzRmd0dEFGQ0huWUhLNm5lQT09",
                        "https://us04web.zoom.us/j/73753575505?pwd=UjNvTXRzRmd0dEFGQ0huWUhLNm5lQT09",
                        "https://forum.makerdao.com/t/recurring-strategy-reviews-next-steps-key-focus-areas-poll/11650",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-21st-october-28th/11262",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2021/11914",
                        "https://forum.makerdao.com/t/product-strategy-thinking-about-growing-makers-market-share/11242",
                        "https://forum.makerdao.com/t/mip41c4-sp28-facilitator-onboarding-strategic-finance-sf-001/11939",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-11-18/11713",
                        "https://forum.makerdao.com/t/under-construction/12274/12",
                        "https://forum.makerdao.com/t/dai-supply-growth-and-risk-metrics/11704"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681337535014006
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#2",
                    "likes": "2",
                    "time": "25/10/2021-23:24:18",
                    "content": "This is great, @Aes . I’ll try to make it. Next time please try to give us a little bit more time to organize our agendas, since I wouldn’t want to miss this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.390625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "2",
                    "time": "25/10/2021-23:36:46",
                    "content": "Will attempt to make it for second half. Luckily I know there are slides so anyone like me can get up to speed asynchronously unless you really need to hear @Aes’s melodious narrations ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#4",
                    "likes": "5",
                    "time": "26/10/2021-00:42:13",
                    "content": "Added to the public calendar and #meetings channel in Discord. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#7",
                    "likes": "4",
                    "time": "26/10/2021-20:33:54",
                    "content": "This full call is now available on the MakerDAO Youtube channel for review:      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#8",
                    "likes": "1",
                    "time": "26/10/2021-22:18:34",
                    "content": "If you didn’t watch it, the TLDR is that it’s more like a rehearsal for a Monthly Strategy Review. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#9",
                    "likes": "3",
                    "time": "27/10/2021-11:12:17",
                    "content": "@monkey.irish on point at 42:30  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#11",
                    "likes": "8",
                    "time": "27/10/2021-19:06:01",
                    "content": "Wasn’t able to stay long at the call, but now I finally got time to watch the whole video. Overall I love this initiative, there’s a clear need for a “state of the union” type overview that basically shows whether things are on track or not, and the various successes that have been achieved recently. A one stop shop where current or prospective MKR holders can go to see how the decentralized workforce is performing, and see how they are forecasting future performance. I would argue it’s not a good idea to make it a monthly thing though, ultimately this format of covering everything is not able to go much in depth, but will quickly consume huge amounts of bandwidth for the teams to deal with this every month. I would suggest we have an approach where every quarter we have updates like this that focus on each core unit and go deep on them, where the audience is meant to be more specialized delegates and community members that have spent the effort to get a deeper understanding on the specific subject, or just have an interest in that particular area - and in particular there needs to be a voter committee for each subject that is directly involved in receiving the update and also using it as an opportunity to provide feedback so there is a feedback loop between MKR holders and core units, not just one way communication. So towards the end of every quarter we’d have a collateral onboarding status update, RWA update, risk update, etc etc. Basically where each budget is reviewed and delivered results and ongoing results are communicated and quantified, using a standardized format meant to really surface the critical data points that matter for decision making and resource allocation. Then after having gone through each of these core unit specific updates, then there is a final global “mkr holder update” that follows the format AES presented here, which is meant to summarize all the outcomes of each of the individual calls and present it as a quarterly update to regular MKR holders basically as a way for them to determine whether they think value is being delivered, This could possibly also be an entry point where something can pique their interest and drive them to start diving deep on one of the topics they’ve seen, after which they could join voter committees or similar and the next indepth quarterly update for the core unit they are interested in. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3247863247863245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#12",
                    "likes": "0",
                    "time": "27/01/2022-01:06:42",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}