{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp20-facilitator-onboarding-for-starknet-engineering-core-unit-sne-001/9782",
            "title": "MIP41c4-SP20: Facilitator Onboarding for StarkNet Engineering Core Unit (sne-001) ",
            "index": 9782,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "sne-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#1",
                    "likes": "4",
                    "time": "10/08/2021-20:54:10",
                    "content": " MIP41c4-SP20: Facilitator Onboarding, Starknet Engineering Core Unit  Preamble MIP41c4-SP#: 20 Author(s): @badgerofthe9d, Ohad Barta Contributors: Derek Flossman, Maciek Kaminsky, Kris Kaczor, Marc-Andre Dumas, Ohad Barta, @badgerofthe9d Tags: core-unit, cu-sne-001, facilitator Status: Accepted Date Applied: 2021-08-09 Date Ratified: 2021-09-27   Sentence Summary MIP41c4-SP20 onboard @badgerofthe9d as facilitator for the Starknet Engineering Core Unit (SNE-001)  Specification  Motivation I have a genuine interest and respect for the Maker protocol and deFi in general. The decentralization of the financial system is a topic I have been passionate about since 2009. In 2011 I wrote two master’s theses on the subprimes crisis and the lack of transparency in transactions and packaging of structured debt products. Ten years later, Maker protocol developed and showed incredible traction on a fundamental building block to solve some of those issues and allow a more open, transparent, and fair financial system. I am (strangely) passionate about risk management and debt products. I started my career doing valuation of high yield debt portfolios in traditional finance, then built debt models for project finance, then built a risk management company for crypto assets, then built a lending product with a crypto custodian. Maker protocol on layer 2, and specifically on Starknet, has a huge potential to help Maker scale through lower gas fees and faster minting/transactions. I also believe there is a massive opportunity to improve the user experience (liquidation, trading timelines, collateral ratio) with Starknet. I am both grateful and motivated to be working with a team of Engineers familiar with both Maker and zk proofs to make it happen.  Core Unit ID SNE-001  Facilitator name and information  Name: @badgerofthe9d  Forum: @badgerofthe9d  LinkedIn: NA ETH Address: TBD   Facilitator Commitment In addition to facilitating the Ways of Working, Team Rituals and the Core Unit Mandates as outlined in the Starknet Engineering Core Unit MIP, the following describes my commitment and actions as the Protocol Engineering Core Unit Facilitator, to;   Serve as a point of contact between the Starknet Engineering Core Unit, the Governance community and other facilitators to ensure a cohesive understanding of team deliverables and progress.  Represent the team in weekly community calls Work with the community and act as a triage point to collate new community requests and share awareness with the team Continue to be active on the Maker Forum and Rocket Chat as an easily reachable point of contact    Help define and own the framework to define the exact scope of the Maker protocol that will be ported over Starknet, looking specifically at the dimensions below. My role is to assure the right people are having the right discussions to make this happen.  Necessary functions to be ported over Methods to compute necessary system-level and asset-level risk metrics Impact on risk governance, DAI peg, collateral management, collateral, surplus auctions, and emergency shutdown Sequencing of the development    Propose quantitative analyses to investigate vectors of improvements of the protocol once it will be on Starknet, specifically around liquidation process and oracles. Analyses will be presented to the community for discussion and will be focused on improving the user experience.   Remove the administrative workload for the Protocol Engineering Core Unit to enable them to focus on the tasks they have committed to deliver.  Facilitate goal planning sessions, external team integrations & meetings, help with technical smart contract/module/documentation tasks Communicate expectations for all ongoing tasks in/outside of the team Maintain the team budget, accounting and overhead management    Maintain planning documentation detailing accomplishments, current work, planned work and upcoming targets to ensure line of sight, clarity, transparency and broad project awareness.  Document quarterly objectives and key results to help steer planning and prioritization Maintain an active team backlog of tasks detailing team progress Maintain a community facing backlog representing workstreams    Scale the team to deliver on the mandated objectives in alignment with the budget proposal.  Build specializations within the team to facilitate targetted focus and increase deliverables Work with the team to streamline the interview and onboarding process     Facilitator Credentials   Oracle and reference price logic: Led the Research team at Merkle Data to build a reference price (out of 30 exchanges trade data) with a certainty index and a manipulation index. The reference price was calibrated to be stable during flash crashes and stress-tests. Consulted for an Oracle project on their filtering logic to define what the reference price is to distribute rewards.   Risk analytics: Former CEO of Merkle Data, sold to Anchorage. Led a research and product team to build a risk and surveillance solution for managing intraday and daily risk. Built stress-test scenarios for spot and options portfolios.   Crypto product design (flow of funds and information): Former head of payments at Anchorage. PM crypto-native credit card network built for Visa. Integrated Merkle Risk product to build the lending and margin product.   Smart contract trade execution: Consulted for a Defi company to build an execution service across Defi protocols to abstract away from each smart contract’s price update logic.   Product Management and Technical project facilitation: PM on dozen of projects in and outside of the crypto space.   ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp19-adding-the-starknet-engineering-core-unit-sne-001/9745/15"
                    ],
                    "GPT-summary": "The post is a proposal for the onboarding of a facilitator for the StarkNet Engineering Core Unit. The author explains their motivation and commitment as the facilitator and outlines the necessary functions to be ported over to StarkNet. The post also includes the facilitator's credentials and commitment to remove administrative workload for the Protocol Engineering Core Unit. A 3rd party could extend to the proposal, give entirely positive feedback, or ask questions about the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Interoperability and Scaleability",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.6579336383313645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "2",
                    "time": "13/09/2021-21:03:57",
                    "content": "   PaperImperium Delegate Platform   I have abstained from Ratification Poll for StarkNet Engineering Core Unit, SNE-001. I intend to vote yes or no when I have more thoroughly developed opinions.   @PaperImperium What factoids would help inform your opinion? I’m excited to see Maker collaborate with StarkNet. From what I’ve heard, StarkNet at dydx has been a success. Are you concerned about the way that the funding is split 50/50 between StarkWare and MakerDAO? How was the Maker work for Optimism and Arbitrum funded? ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmesWgnC#poll-detail",
                        "https://medium.com/starkware/dydx-now-on-mainnet-c21c84d8e342",
                        "https://forum.makerdao.com/t/mip39c2-sp19-adding-the-starknet-engineering-core-unit-sne-001/9745",
                        "https://forum.makerdao.com/t/announcing-the-optimism-dai-bridge-with-fast-withdrawals/6938",
                        "https://forum.makerdao.com/t/makerdaos-timeline-for-launching-dai-on-arbitrum-one/10100"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "13/09/2021-21:13:22",
                    "content": "    psychonaut:  @PaperImperium What factoids would help inform your opinion?   This is mostly a case of me not having had the time to go through everything and make sure I understand it. Luckily the poll doesn’t close for quite a while. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pyramidmaker",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/09/2021-21:26:49",
                    "content": "@PaperImperium  Thank you for sharing. We are available to answer your questions either here or on Rocket Chat. My handle is @louismerkle ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/12/2021-21:27:01",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}