{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/monetary-theory-maker-cannot-easily-change-the-quantity-of-its-monetary-base-only-the-composition/9521",
            "title": "[Monetary Theory] Maker Cannot Easily Change the Quantity of its Monetary Base, Only the Composition ",
            "index": 9521,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "meta-governance",
                "monetary-policy"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "7",
                    "time": "26/07/2021-14:31:10",
                    "content": "TL;DR Maker is fundamentally less unstable than all other major stablecoins, because the temptation of capital controls (especially imperfect ones) is not available to us. This not only gives us the differentiation of relying solely upon free market mechanisms to maintain our peg, it also means we will never be able to attempt at scale to control both our monetary base and maintain a fixed peg to the USD. The trade off, of course, is that Maker is largely held hostage to the whims of capital flows when it comes to increasing or decreasing the size of the DAI supply. NB: This has significant implications as to the long-run safety of competing stablecoins, and a well-accepted underpinning of monetary theory as to why we should be regulated less vigorously. Background One of the core challenges for MakerDAO is to maintain the par value of 1 DAI = 1 USD on the open market. While several tools have been developed to maintain the fixed exchange rate on both sides of the peg – notably the DSR and the PSM – there is still a need to find methods of stabilization that can reduce reliance upon the DSR in the event of regulatory or solvency limitations, and that can allow the PSM to be used more as a trowel for fine-tuning and less as a dump truck that has to move large loads. The main reason to avoid reliance upon the PSM alone is the composition of Maker’s “foreign reserves.” A major challenge is that while the market currently believes MakerDAO’s commitment to the peg to be credible, thereby lowering the costs of maintaining it, extreme market volatility and congestion on Ethereum can cause large swings that have to be absorbed in real time by the PSM. To date, this has worked well, but has resulted in the PSM holding more than it needs to buffer against short-run volatility. Additionally, without a blockchain presence of actual USD, this leaves the Maker Protocol with the extra intermediary currency of USDC, which has a non-zero credit risk. Maker Has No Capital Controls – Other Stablecoins Do One of the reasons Maker is so unique in the stablecoin world is that it is a survivor of a difficult start-up test for coins that cannot use capital controls. Our fellow large-cap stablecoins are backed by redeemability, and also often contain the ability to blacklist or otherwise impair the flow of capital. This is why they can change the size of their monetary base, because if their own peg becomes endangered, they can – to varying degrees of success for varying amounts of time – utilize capital controls to prevent flight back to USD. This means that they are able to both maintain their 1:1 peg with the USD and enact monetary policy to alter the size of their monetary base. It should be noted that the imperfect nature of the capital controls of Tether, USDC, Paxos, et al, means that they are in the long run very risky propositions. Redemptions can be halted, wallets blacklisted, in some cases the coins can be burned. But the robust offering of secondary marketplaces means that there will always be a true “free market” exchange rate somewhere in DeFi for easy reference. This means that there is the temptation of these entities to simultaneously attempt to control the size of their monetary base, utilize capital controls, and maintain a 1:1 peg with the USD. Historically, these always end in collapse, as the balance-of-payments between the currencies becomes unsustainable. It is pure conjecture at the moment, but we may be witnessing Tether grappling with this problem right now – they cannot both control the size of their monetary base and maintain the 1:1 peg indefinitely without the use of capital controls. For Tether in particular, shrinkage of their monetary base means a potential liquidity crisis since they cannot conjure money from thin air when the peg is under downward pressure. Examples in the past of this kind of crisis are the Asian financial crisis of the 1990s and Argentina in the 2000s. There are also algorithmic stablecoins, which attempt to influence market price through a variety of mechanisms. We don’t need to discuss the merits or demerits of them here, but they amount to capital controls as well, impairing or subsidizing flows of capital by holders of their coin. Maker stands alone as a true “free market” stablecoin that has survived to scale. The maintenance of the fixed exchange rate, coupled with a purposeful lack of ability to enact capital controls on holders of DAI – no halts of redemptions for fiat, no blacklisting, no taxes/subsidies to alter velocity in the open market to maintain peg – means that Maker has no real control over the speed at which DAI grows. At least, not through the changing of parameters – this is why the Growth CU is so important in opening up new sources of demand. Maker has had the fortunate historical accident of experiencing balance-of-payments with USD that makes Maker a source of “direct foreign investment” in dollar-denominated assets. If Maker was a nation, this would be equivalent to its citizens loaning money to the dollarized world, as opposed to a nation that was a net debtor. With the PSM (or any other passive open market operation), this means that the demand for DAI required the purchase of foreign reserves. Lacking an actual way to access USD, we currently use USDC. It is important to note that there is no way to unwind the PSM on purpose, at least in aggregate across all PSMs (of which we only have one at the moment). We can alter the composition of these “foreign reserves,” but cannot alter the quantity without causing problems for the peg. Our monetary base will move in a one-to-one correspondence with our “foreign reserves” of dollars, dollar-denominated assets, and dollar-equivalents. Intuitively, this should give the reader two main reactions: One of relief that our reserves are such a large part of the monetary base that the peg is very safe. And one of nervousness that we will have to rely on stimulating organic demand for DAI via low vault rates/high DSR rates should our reserves ever become too depleted to defend the fixed exchange rate. Looking forward With regards to all of our competitors, no algorithmic coins have managed to gain much traction. If they do, they will be similarly hobbled as fiat-backed coins. Tether, USDC, and other redeemable coins will ultimately have to either institute capital controls or take a passive view of managing the size of their monetary base. Alternatively, they can abandon their peg and float a free market exchange rate. Given the imperfect nature of the controls available to different stablecoins, those controls may have limited effectiveness or limited durations of effectiveness. If those managing each of those coins does not realize this early, they run the risk of a collapse and then forced devaluation to restore a free market equilibrium. Maker, by contrast, is forced by design to rely upon free market mechanisms to maintain its peg. This removes the temptation for us to attempt to use capital controls, which is good. It means at least some avenues of monetary policy are unavailable to us that are likely to lead to collapse. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.134499212908303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "26/07/2021-18:22:43",
                    "content": "https://tether.to/tether-responds-to-bloomberg-article/     PaperImperium:  Alternatively, they can abandon their peg and float a free market exchange rate.   Yea, I’d be careful betting against Circle/Coinbase — their game plane is firing on all cylinders at the moment. Strategically they are well positioned. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "26/07/2021-19:20:31",
                    "content": "    flipflopflapdelegate:  Yea, I’d be careful betting against Circle/Coinbase   The reserves at Circle did not strike me as particularly concerning. Tether on the other hand? If there were more Tether on Aave, we could literally deposit (a bit more than half of) our USDC, borrow Tether, ask to redeem, and they would have to halt redemptions. Good luck with the peg then. They disclosed ~3% actual cash reserves, so the only thing saving them is that no one can borrow $2b in Tether to short it, apparently. It actually doesn’t even matter whether their commercial paper is going bad or not – that’s a solvency issue. From a liquidity standpoint, they’re really susceptible to speculators. Presumably the reason this hasn’t happened yet is that no one wants to be the first one to stick their head out to short heavily in this method in case they actually are incredibly solvent and can borrow against those assets to defend their peg. They do hold some Treasuries, but that their reverse repo notes are nearly equivalent to their cash position in the May disclosure suggests that their cash came from borrowing against most of their Treasuries already. Tether looks to be in a very precarious position financially, even all of their underlying assets are 100% safe and sound. I would be surprised if they do not have to halt or delay redemptions or some other action in the next 6 to 12 months. Whether that will cause a devaluation is, of course, not assured. It is notable that Maker is not able to get into this position because we never mint unbacked DAI and we cannot institute capital controls. Our commitment to the fixed dollar peg pretty much ties our hands and makes us be responsible. Other stablecoins rely upon financial repression or good management. The latter never lasts forever. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.684375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "0",
                    "time": "26/07/2021-23:30:18",
                    "content": "Perhaps. Seems like there’s a lot of Stablecoin FUD going around today. Personally I don’t like to wish ill will on competition. But it’s sort of comforting seeing Goldman seek a DeFi ETF. I guess they’re not afraid, or they just fade the noise better than most.   twitter.com    Martin Köppelmann @koeppelmann    Has anyone done a serious analysis about what happens in Defi world if one of the major stable coins for whatever reasons goes to 0?   7:44 PM - 26 Jul 2021           87                7            ",
                    "links": [
                        "https://twitter.com/koeppelmann/status/1419745500455178240",
                        "https://twitter.com/koeppelmann/status/1419745500455178240",
                        "https://twitter.com/koeppelmann/status/1419745500455178240"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.37797619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "1",
                    "time": "26/07/2021-23:36:35",
                    "content": "I don’t think any of the major ones will go to zero. That really is what you like to call “FUD.” But a devaluation is a real possibility. Even Tether is not worth zero unless the centralized entity backing it goes bankrupt. That’s another great thing about DAI — holders would even in a worst case scenario get to pick the corpse clean instead of some company’s bond holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.342261904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GuyB",
                    "index": "#6",
                    "likes": "1",
                    "time": "27/07/2021-08:55:08",
                    "content": "    PaperImperium:  From a liquidity standpoint, they’re really susceptible to speculators.   The 3% reserve is a concern, but the friction entailed in moving money into and out of USDT is a more immediate one. With Dai, auctions complete within minutes or hours. I don’t know what the process is with USDT, but I imagine it takes hours to days, at least, to deposit/mint or withdraw/burn. It’s just not possible to keep up in the short-term when there’s unusual market activity. That’s the same of course for Maker - no stablecoin can react in real time - but there are greater built-in delays for USDT, as well as the reserves problem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.777777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "1",
                    "time": "27/07/2021-13:43:20",
                    "content": "    GuyB:  That’s the same of course for Maker - no stablecoin can react in real time - but there are greater built-in delays for USDT, as well as the reserves problem.   The good news is that no one has ever acted in real time. Even the fed funds rate is really a distribution of rates throughout the day, and with much less automation than an automated facility like the PSM. In the case of redeemable coins, very few offer instantaneous flows, and that’s probably not a problem. The likeliest place they will run into problems is that they seem to think – judging from the recent CNBC interview – that 24 hours of redemption liquidity is sufficient and even worth boasting about. Anyways, this thread was not to make many predictions about Tether. It is mostly the first attempt to begin to articulate why – based on widely accepted economic theory – Maker is less fragile than the other stablecoins in the market. Regulation is coming, and it’s important we don’t get treated as though Maker is as risky as an issuer who has more temptation and more ability to make bad decisions than we do. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.779924242424243
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#8",
                    "likes": "3",
                    "time": "28/07/2021-16:40:30",
                    "content": "    PaperImperium:  Maker is less fragile than the other stablecoins in the market.   I find it incredible that in times of black swans, DAI does not depreciate like other currencies, but rises from $1 to $1.004. This shows the tremendous interest of traders or communities in DAI. But yes, MakerDAO is not to be taken as a small player, it is already 6 billion DAI, all organically produced. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                }
            ]
        }
    ]
}