{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/fpi-indice-de-precios-al-consumo-traduccion/15439",
            "title": "FPI (\\xc3\\xadndice de precios al consumo) (traducci\\xc3\\xb3n) ",
            "index": 15439,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "translate",
                "cpi"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "2",
                    "time": "30/05/2022-02:13:46",
                    "content": "Lanzada el 9 de abril, es la primera stablecoin que replica el índice de precios al consumidor (IPC) de Estados Unidos. El Frax Price Index es un protocolo nuevo y único dentro del ecosistema de Frax. Centrado en su propia stablecoin nativa (FPI) y token de gobernanza (FPIS), el sistema se ajustará cada mes de acuerdo con un oráculo del Índice de Precios al Consumidor en la cadena, de modo que los titulares de la FPI aumentarán su valor denominado en dólares cada mes de acuerdo con el aumento del IPC informado. Para ello, obtiene un rendimiento de la tesorería del FPI subyacente, creada a partir de los usuarios que acuñan y canjean FPI con FRAX. El token Frax Price Index Share (FPIS) es el token de gobierno del sistema, que también tiene derecho al señoreaje del protocolo. El exceso de rendimiento se dirigirá desde la tesorería a los titulares de FPIS, de forma similar a la estructura de FXS. En los momentos en los que la tesorería del FPI no genere suficiente rendimiento para mantener el aumento del respaldo por FPI debido a la inflación, se podrán acuñar y vender nuevos FPIS para aumentar la tesorería. Dado que el protocolo se lanza desde el ecosistema Frax, el token FPIS también dirigirá una parte variable de sus ingresos a los titulares de FXS. Cálculo de la inflación El FXS utiliza la tasa de inflación no ajustada de 12 meses del IPC-U, comunicada por el Gobierno Federal de los Estados Unidos: Consumer Price Index Summary - 2022 M04 Results Un oráculo especializado de Chainlink consigna estos datos onchain inmediatamente después de su publicación. La vinculación del FPI sigue la tasa de inflación de 12 meses mencionada y se vincula a ella en todo momento desde el contrato de reembolso del FPI. Por lo tanto, al comprar stablecoins FPI por otro activo (como ETH) el comerciante está tomando la posición de que el poder adquisitivo del FPI está creciendo más rápido en el tiempo que el ETH vendido. Si vende FPI por ETH, el operador está tomando la posición de que el crecimiento de ETH está superando la tasa de inflación del IPC del dólar estadounidense.  FPI_FPIS1725×423 37.6 KB  Es tan frágil como el FRAX, es como una extensión del FRAX, ya que está colateralizado al 100% por el FRAX, y el FRAX está colateralizado en un 89,25% en criptoactivos, y el otro 10,75% algorítmicamente, no está sobrecolateralizado como Dai.  FRAX collateral860×424 23.8 KB   FRAX1725×424 52.5 KB  Me encantaría que Dai sacara su versión de forma robusta y segura, sería la mejor cobertura cripto ideal para estos tiempos de incertidumbre financiera. El problema es cómo aplicarlo sin dañar o desestabilizar algunas tuercas del sistema Maker y luego perjudicar a todos en el futuro.  Original  ",
                    "links": [
                        "https://forum.makerdao.com/t/fpi-consumer-price-index/"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.125
                }
            ]
        }
    ]
}