{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/data-insights-core-unit-status-update/12117",
            "title": "Data Insights Core Unit Status update ",
            "index": 12117,
            "category": [
                "Core Units",
                "Data Insights"
            ],
            "tags": [
                "din-001",
                "status"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/tmierzwa",
                    "index": "#1",
                    "likes": "4",
                    "time": "09/12/2021-15:12:20",
                    "content": "  The first month of operations was mostly focused on setting up the Core Unit business and technical environment and moving the data and services from Token Flow to dedicated CU infrastructure. Effective 1st November, team members who previously worked for Token Flow Insights became engaged directly by the CU for time spent on CU business (Piotr - 100%, Tomek - 25% FTE).   The technical migration is mostly completed and we are now switching existing GUIs to new data sources. By the end of the year we plan to be fully decoupled from the previous environment and operate independently, using dedicated AWS and Snowflake subscriptions.   Once this is complete, the only commercial link to Token Flow Insights will be the provision of data feeds under contract. The CU is able to switch data providers to an alternative supplier if it is deemed by the CU that a superior alternative exists. This can be switched at will - there are no long-term contracts in place with Token Flow Insights in order to maintain flexibility for the CU.   After assessing all options, the CU decided to postpone the incorporation of a distinct legal entity hosting the Core Unit and temporarily operate in a decentralized mode. We plan to reevaluate this as soon as we get a full understanding of the required legal framework and actual costs and risks. Because our initial budget included a one-off amount of 10,000 DAI for incorporation and it was already paid to the CU multisig, we plan to return this to the Pause Proxy using the precedent set by GovAlpha and will add the transaction hash in comments below when this has been completed.   Other things that we delivered in November include:  fixing critical bugs and small tweaks in MCD Vaults Tracker   delegates status reporting for GovAlpha CU gas consumption reporting for StarkNet CU voting bird’s-eye view for Growth CU    We organized a round of interviews with Core Units that are the biggest consumers of our data to understand their requirements and plans. Based on their feedback we have prepared the initial roadmap for the next few months. The roadmap is available here and will be constantly updated with current status and new requirements.   The most important next product will be the full history of MCD Protocol system parameters. This dataset will provide a detailed overview of all changes made in any of general and ilk-related parameters (similar to makerburn.com but with a history and relation to specific spells). First prototype should be ready before Christmas and we plan to release it publicly in January.   A few smaller things that we plan to deliver until Christmas are related to the Data API. Under the hood we are switching to a new API framework which will be easier to maintain and will make life much easier for those that use the existing endpoints.   ",
                    "links": [
                        "http://beta.mcdstate.info",
                        "https://data.makerdao.network/1e78082086f44107877f194f0e35e0e8?v=bd06bd01cc624d7585970d93433181bc",
                        "https://makerburn.com/#/big-table",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-december-2021/12692"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.605075757575757
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/03/2022-15:13:01",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}