{
    "poll_list": [
        {
            "title": "MIP10c15-SP4 Governance Poll to Appoint Gitcoin as Oracle Light Feed - June 15, 2020",
            "index": "2811",
            "option": "Yes",
            "supporting_mkr": "7,629",
            "highest_fraction": 0.95
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c14-sp4-proposal-appoint-gitcoin-as-a-light-feed/2811",
            "title": "MIP10c14-SP4 Proposal: Appoint Gitcoin as a Light Feed ",
            "index": 2811,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-lightfeed-sp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/owocki",
                    "index": "#1",
                    "likes": "5",
                    "time": "11/06/2020-16:14:36",
                    "content": " MIP10c14: Subproposal to Appoint Light Feed  Preamble MIP10c14-SP#: 4 Author(s): Kevin Owocki <[email protected]> Contributors: Kevin Owocki <[email protected]> Status: Formal Submission Date Proposed: 2020-06-10 Date Ratified: <yyyy-mm-dd>   Specification  Organization  Name: Gitcoin Website: https://gitcoin.co  Github: GitHub - gitcoinco/web: Grow Open Source  Number of Employees: 16 Email: [email protected]  Incorporated: A subsidiary of Consensys AG, based in Switzerland Domiciled: Switzerland Number of employees: 16 When was the organization founded?  Gitcoin was founded in May 2017, and folded into the Consensys Mesh in November 2017. Who are the major investors in your organization? Consensys AG How much funding has the organization raised either privately or through a token sale?  About $3mm from Consensys AG Please provide public references for the above where possible:     Gitcoin - Build and Fund the Open Web Together    Gitcoin - Build and Fund the Open Web Together Connect with the community developing digital public goods, creating financial freedom, and defining the future of the open web.         Medium – 11 Apr 18    Gitcoin Joins ConsenSys, Announces Pilot Projects ConsenSys is announcing today that it has added the Gitcoin project to its mesh of projects. Launched in September, Gitcoin is one of the…  Reading time: 5 min read          $35.3m in  Results    $35.3m in  Results Gitcoin is transparent by design.  Here are some stats about our suite of OSS incentivization products.       Introduction Gitcoin’s mission is to grow open source and help devs find new economic opportunities. There are many ways to do this, and gitcoin offers a few different products to enable this:  Virtual hackathons: Online & worldwide. Sponsors post prizes, and people compete to earn them by building stuff to the specifications. Grants: A better way to fund innovation in your ecosystem. Grantees can create a fundraising page for “the great work they’re already doing” in the space, then raise $$$ for that work. Ethical ads via CodeFund: An advertising network that respects your privacy. Codefund allows you to monetize your audience without selling them out.   Community  What has your organization contributed to the crypto community?  We have delivered almost $5mm worth of funding to OSS devs in the Ethereum community. $35.3m in Results | Gitcoin  Successful products, services, tools, libraries, thought-leadership     Gitcoin's Products.    Gitcoin's Products. At Gitcoin, we build products that allow for better incentivized collaboration                         in the realm of open source software       I’ve also given talks at ETHDenver, ETHBerlin, Devcon, etc. public-speaking Archives - The World As Perpetual Beta  How will the Maker Community benefit from your inclusion as a Light Feed?  We will be faithful & responsible stewards of the data passed into the MKR Oracle system. Note that DAI/SAI are some of the most used tokens on the Gitcoin platform!  We have a rational economic incentive to keep the price data clean & good!  Quarterly Leaderboard: Top Tokens | Gitcoin  Changelog  Reformatted preamble  ",
                    "links": [
                        "https://github.com/gitcoinco/web",
                        "https://gitcoin.co",
                        "https://gitcoin.co",
                        "https://media.consensys.net/gitcoin-joins-consensys-announces-pilot-projects-f5a0955de9d6",
                        "https://media.consensys.net/gitcoin-joins-consensys-announces-pilot-projects-f5a0955de9d6",
                        "https://gitcoin.co/results",
                        "https://gitcoin.co/results",
                        "https://gitcoin.co/results",
                        "https://gitcoin.co/products",
                        "https://gitcoin.co/products",
                        "https://owocki.com/public-speaking/",
                        "https://gitcoin.co/leaderboard/tokens?cadence=quarterly&keyword=all&product=all",
                        "https://forum.makerdao.com/t/signal-request-temporarily-process-oracle-proposals-through-the-weekly-governance-cycle/2801",
                        "https://forum.makerdao.com/t/set-of-oracle-proposals-included-in-july-3rd-executive-vote/2977",
                        "https://forum.makerdao.com/t/fix-gitcoin-feed-key-replacement-on-manausd-oracle/4233"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Identity and reputation systems",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.927774365274365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/06/2020-20:10:25",
                    "content": "Do you need a Manager in Switzerland I’ll go there anytime! I tough you were in boulder Colorado, are you going to expand  ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.055555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/owocki",
                    "index": "#3",
                    "likes": "1",
                    "time": "11/06/2020-20:23:07",
                    "content": "I am physically in Colorado, but the legal entity is Swiss  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/06/2020-20:38:31",
                    "content": "Ah, understand! I like the area, i really need to try Germany highway autobahn ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#5",
                    "likes": "2",
                    "time": "15/06/2020-07:53:47",
                    "content": "MIP10c15: Subproposal to Appoint Feed (OT) Preamble MIP10c15-SP#: 4 Author(s): Nik Kunkel Contributors: Status: Formal Submission Date Proposed: 2020-06-14 Date Ratified: <yyyy-mm-dd>  Disclaimer MIP10 is meant to handle all of the Oracle related actions. Unfortunately MIP10 has inconsistencies and doesn’t conform to the monthly governance cadence that the Maker Improvement Proposal framework is built around. This has generated a backlog of Oracle proposals. While MIP10 is refactored to conform to the regular MIP process, Oracle proposals such as this one will utilize the more liberal weekly governance cycle. While strictly speaking this makes them not subproposals, they are included in the subproposal archive as a point of provenance to serve as a paper trail. Specification Introduction If ratified, this subproposal would appoint Gitcoin as a Light Feed. Feeds submit data to the Oracles for the prices of assets. They are an important part of ensuring that the Oracles are reliable and secure. Only entities with strong credentials that the community trusts should be permitted to be an Oracle Feed. Organization  Name: Gitcoin Website: https://gitcoin.co  Github: https://github.com/gitcoinco/web  Number of Employees: 16 Email: [email protected]  Incorporated: A subsidiary of Consensys AG, based in Switzerland Domiciled: Switzerland When was the organization founded?  Gitcoin was founded in May 2017, and folded into the Consensys Mesh in November 2017. Who are the major investors in your organization? Consensys AG How much funding has the organization raised either privately or through a token sale?  About $3mm from Consensys AG Please provide public references for the above where possible:     Town Square    Town Square Learn, earn, & connect with great developers on the Gitcoin Town Square          Medium – 11 Apr 18    Gitcoin Joins ConsenSys, Announces Pilot Projects ConsenSys is announcing today that it has added the Gitcoin project to its mesh of projects. Launched in September, Gitcoin is one of the… Reading time: 5 min read           $4.9m in  Results    $4.9m in  Results Gitcoin is transparent by design.  Here are some stats about our suite of OSS incentivization products.      Light Feeds Reputation  Does the organization have a strong reputation in the crypto community?  Yes. Gitcoin dates back to 2017 and has had a strong presensce within the ecosystem for fostering collaberation and innovation. Most notably it has created a coordination platform for sustainable funding for open source initiatives. This is critical for the Ethereum community which is based on the principles of open source and distributed work between remote entities.  What contributions has this organization made to the crypto ecosystem?  Most notably it has created a coordination platform for sustainable funding for open source initiatives. This is critical for the Ethereum community which is based on the principles of open source and distributed work between remote entities. Gitcoin Grants provide a unique combination of benefits including: empowering developers to monetize their open source contributions enabling projects to incentivize developers to learn and hack on their platform allowing employers to vet potential candidates through real deliverables creating a method for crowdsourcing features and applications desired by a community  Would including the organization as a Light Feed instill a sense of trust in the Oracles?  It is the opinion of the Oracle Team that Gitcoin has a trustworthy reputation in the community and would further reinforce the reputation of the Maker Oracles.  Are there any public accusations of misconduct? How severe and numerous are they? Have they been confirmed?  The Oracle Team was not able to find any record of confirmed cases of misconduct on account of the organization nor its executive staff. Verification  Were sufficient public-facing resources provided or found that confirm the information in the application?  Yes, public records were able to verify most of the provided information.   Was the applicant honest with respect to:   the investors   The Oracle Team was able to verify the acquisition by Consensys in November of 2017 through press releases issued by Consensys.  how much funding was raised  The Oracle Team was not able to find any public figures relating to the amount of funding raised that would confirm or deny the $3M figure quoted by the applicant.  the number of employees  The Oracle Team was able to verify the majority of employees through their LinkedIn profiles which were conveniently linked to in the Gitcoin About Us page. A small number did not cite Gitcoin nor Consensys as their employer on LinkedIn but had other publically logged connections to Gitcoin that would indicate involvement.  the location of incorporation & domicile  The Oracle Team was able to verify that Consensys AG is registered and domiciled in Zug, Switzerland at address Gartenstrasse 6, 6300 Zug via Zefix.  Given the applicant’s major investors, is there a risk adding this Light Feed would give a single investor too much influence over the Oracle protocol?  Not at the moment, though this is something the community needs to monitor moving forward as Token Sets (formerly Set Protocol), Infura, and Gitcoin are all owned at least in part by Consensys.  Given the incorporation and domicile location of the organization, is there a risk adding this Light Feed would give a single jurisdiction too much influence over the Oracle protocol?  Not currently, but similar to the above. Since Consensys is domiciled in Switzerland the exposure to Swiss regulators increases the more Consensys-subsidiary Feeds get added. Identity  Did the Oracle Team get in contact with the organization to confirm their application?  Yes, the Oracle Team spoke to the founder of Gitcoin over video conference who is listed on Gitcoin’s website. Cost-Benefit  Given the ratio of Dark Feeds : Light Feeds, does the Maker Protocol benefit from adding another Dark/Light Feed at this time?  Yes.  Given the extra cost of appointing a new Feed, does the benefit of the marginal security / marginal trust in the protocol exceed the cost?  Yes. Oracle Team Recommendation The Oracle Team recommends that Maker Governance ratify the proposal to appoint Gitcoin as a Light Feed for the Maker Oracles. Gitcoin is an established member of the Ethereum tribe on a mission to create sustainable funding for open source. Dai is an integral part of the Gitcoin platform. Since its inception grants totalling $2,214,536 Sai/Dai have been awarded accounting for over 70% of all awarded grants. There is a clear alignement of incentives between Gitcoin providing trusted pricing data to the MakerDAO Oracles and Gitcoin’s dominating use of Dai on its platform. The Oracle Team was able to verify most of the information provided by Kevin in the MIP10c14 Light Feed application. No confirmed cases of misconduct related to the organization were found. Changelog  reformatted preamble  ",
                    "links": [
                        "https://github.com/gitcoinco/web",
                        "https://gitcoin.co",
                        "https://gitcoin.co",
                        "https://media.consensys.net/gitcoin-joins-consensys-announces-pilot-projects-f5a0955de9d6",
                        "https://media.consensys.net/gitcoin-joins-consensys-announces-pilot-projects-f5a0955de9d6",
                        "https://gitcoin.co/results",
                        "https://gitcoin.co/results",
                        "https://gitcoin.co/about",
                        "https://www.zefix.ch/en/search/entity/list/firm/1266173"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.754126897199186
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#6",
                    "likes": "1",
                    "time": "16/06/2020-04:52:05",
                    "content": "Governance Poll is live. https://vote.makerdao.com/polling-proposal/qmpstgclb4lnlptwuufhyyxsh1rdah4mayxdyctfxbpmhk ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/owocki",
                    "index": "#7",
                    "likes": "2",
                    "time": "17/07/2020-02:23:53",
                    "content": "Hey all, I’m kind of embarrassed to admit I accidently destroyed my maker light feed cloud server and I didnt have a backup. The specifics are not something I care this group cares about but I am happy to tell (I specced the server as a Ubuntu 1804 cloud server with only 8 GB of disk space, of which 7.5 GB was Ubuntu (or installed files like omnia/nix/ssb.   I ran out of disk space.  When I tried to triage the server, I accidently corrupted the boot file.  Then I lost access to the server and the secrets it contained when I rebooted it and thereby had no open SSH connections). The TLDR is I need need my Feed key swapped from 0xa4188b523eccecfbac49855eb52ea0b55c4d56dd 0x77eb6cf8d732fe4d92c427fcdd83142db3b742f7 ; I’ve got a new server running on the latter key. Any questions let me know. Apologies for the inconvenience & Thanks for understanding in advance @owocki ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.068181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/owocki",
                    "index": "#8",
                    "likes": "0",
                    "time": "17/07/2020-16:25:05",
                    "content": "I just signed this message: { “address”: “0x77eb6cf8d732fe4d92c427fcdd83142db3b742f7”, “msg”: “I am kevin owocki and I verify I want to change my maker lightfeed address to this address.”, “sig”: “0x6829f69a5a531f6b815016884823ffcb60c80e8cc0de34f3e2ddd7ae18f365f600d89e718f84fb526d24d3c93588a8ac4da073c7ac4475d258dbb9ddeb99062f1c”, “version”: “2” } and posted it with this keypair 0x77eb6cf8d732fe4d92c427fcdd83142db3b742f7 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#9",
                    "likes": "2",
                    "time": "22/07/2020-19:59:23",
                    "content": "Hi Kevin, no problem we can have them swapped in the Executive Vote that goes out this Friday. Be sure to backup your key in the future. Also thank you for providing the signed message, I think this is a practice going forward that we should adopt as part of Feed Onboarding to verify key ownership. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/owocki",
                    "index": "#10",
                    "likes": "1",
                    "time": "22/07/2020-21:32:44",
                    "content": "Thanks!  I backed up my new key to my password manager.  I wont make this key management mistake again  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.482954545454546
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c14-sp6-proposal-appoint-mycrypto-as-a-light-feed/3383",
            "title": "MIP10c14-SP6 Proposal: Appoint MyCrypto as a Light Feed ",
            "index": 3383,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-lightfeed-sp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/409h",
                    "index": "#1",
                    "likes": "5",
                    "time": "26/07/2020-22:00:17",
                    "content": " MIP10c14: Subproposal to Appoint MyCrypto as a Light Feed for the Maker Oracles  Preamble MIP10c14-SP#6:  Author(s): Harry Denley Contributors: Jordan Spence, Mia Alexander Type: Process Component Status: Proposed Date Proposed: 2020-07-13 Date Ratified: <yyyy-mm-dd>   Specification  Organization  Name: MyCrypto Website: https://mycrypto.com  Github: MyCrypto · GitHub  Number of Employees: 15-20 Email: [email protected]  Incorporated: 2018 Domiciled: Delaware C Corp When was the organization founded? 2018 Who are the major investors in your organization?: Polychain, ShapeShift, BoostVC, Ausum Ventures, Mick Hagen, Chance Du, Lily Liu, Albert Ni How much funding has the organization raised either privately or through a token sale?: $4 Million Please provide public references for the above where possible: Our First Funding Round!. Now, we’re even more dedicated to… | by MyCrypto | MyCrypto | Medium    Introduction Motivation for running a Light Feed MyCrypto has provided infrastructure for the Ethereum blockchain for many years, and are one of the few teams to do so. We love the Maker team, and our engineers are experienced, reliable, and eager to learn more and contribute to Maker’s goals in this arena!  Community What has your organization contributed to the crypto community? MyCrypto provides a client-side, open-source interface to the Ethereum blockchain that allows users to access and manage their ETH & ERC20 tokens, and interact with smart contracts directly, among many other things. We also provide infrastructure with an Ethereum node, alongside Infura and Etherscan. Successful products, services, tools, libraries, thought-leadership   MyCrypto.com (mycrypto.com) MyCrypto Desktop App (download.mycrypto.com) MyCrypto Beta (beta.mycrypto.com) MyCrypto Overflow (overflow.mycrypto.com) CryptoScamDB (cryptoscamdb.org) MyCrypto Medium (MyCrypto – Medium)  How will the Maker Community benefit from your inclusion as a Light Feed? MyCrypto has a solid track record of providing valuable products, resources, and infrastructure to the community. Many don’t realize it but we’ve been running our own infrastructure since 2017. This runs in our blood! We believe that we’d be a valuable addition to the others who are participating.  Changelog  List of updates  ",
                    "links": [
                        "https://github.com/MyCryptoHQ",
                        "https://medium.com/mycrypto/our-first-funding-round-9acf048c9d05",
                        "http://MyCrypto.com",
                        "http://mycrypto.com",
                        "http://download.mycrypto.com",
                        "http://beta.mycrypto.com",
                        "http://overflow.mycrypto.com",
                        "http://cryptoscamdb.org",
                        "http://medium.com/mycrypto",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-103-thursday-july-30-4-00-pm-utc/3318/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Identity and reputation systems",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.178228021978022
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#2",
                    "likes": "4",
                    "time": "04/08/2020-09:14:45",
                    "content": "MIP10c15: Subproposal to Appoint Feed (OT) Preamble MIP10c15-SP#: 6  Author(s): Niklas Kunkel Contributors:  Type: Process Component Status: RFC Date Proposed: 2020-08-04 Date Ratified: <yyyy-mm-dd>  Specification Introduction If ratified, this subproposal would appoint MyCrypto as a Light Feed. Feeds submit data to the Oracles for the prices of assets. They are an important part of ensuring that the Oracles are reliable and secure. Only entities with strong credentials that the community trusts should be permitted to be an Oracle Feed. Organization The following information was provided by MyCrypto in their MIP10c14 application and verified by the Oracle Team to the best of its ability. * Name: MyCrypto * Website: https://mycrypto.com * Github: https://github.com/MyCryptoHQ * Number of Employees: 15-20 * Email: [email protected] * Incorporated: 2018 * Domiciled: Delaware C Corp * When was the organization founded? 2018 * Who are the major investors in your organization?: Polychain, ShapeShift, BoostVC, Ausum Ventures, Mick Hagen, Chance Du, Lily Liu, Albert Ni * How much funding has the organization raised either privately or through a token sale?: $4 Million * Please provide public references for the above where possible: https://medium.com/mycrypto/our-first-funding-round-9acf048c9d05  Light Feeds Reputation  Does the organization have a strong reputation in the crypto community?  MyCrypto, is recognize as one of the pioneers of the Ethereum ecosystem, dating back to its MyEtherWallet origins. Many crypto-natives can trace their crypto origin story back to generating their first Ethereum wallet through MyCrypto. MyCrypto was one of the first to recognize the dire state of UX and lack of education in the Ethereum ecosystem and adopted a design philosophy centered around these cornerstones. This has rightfully earned them a strong trusted reputation.  What contributions has this organization made to the crypto ecosystem?  MyCrypto provides a client-side, open-source interface to the Ethereum blockchain that allows users to access and manage their ETH & ERC20 tokens, and interact with smart contracts directly, among many other things. MyCrypto also provides infrastructure with an Ethereum node, alongside Infura and Etherscan.  Would including the organization as a Light Feed instill a sense of trust in the Oracles?  MyCrypto is a long-standing and trusted member of the Ethereum community whose inclusion as a Light Feed would be valuable addition to the circle of trust backing MakerDAOs Oracles.  Are there any public accusations of misconduct? How severe and numerous are they? Have they been confirmed?  The Oracle Team makes no deliberation on whether any inappropriate activity occurred. In the pursuit of full transparency, the fork from MyEtherWallet is something Maker Governors may want to consider. Here are the two published first-hand accounts from Taylor (MyCrypto) and Kosala (MEW). It’s important to acknowledge the team behind MyEtherWallet team transitioned to MyCrypto in the aftermath of the dissolution of MyEtherWallet LLC. Verification   Were sufficient public-facing resources provided or found that confirm the information in the application? The Oracle Team was able to identify the existence of the Delaware C Corp MyCrypto through the Delaware Division of Corporations Register with file number 6673533 and registered on 12/6/2017. There is a minor discrepancy here as the applicant claimed to be incorporated in 2018   Was the applicant honest with respect to:  the investors The Oracle Team was able to confirm the investors from both the source provided by the applicant as well as external sources including Polychain, ShapeShift, BoostVC, Ausum Ventures, Albert Ni, Mick Hagen, Chance Du, and Lily Liu  how much funding was raised the number of employees the location of incorporation & domicile    Given the applicant’s major investors, is there a risk adding this Light Feed would give a single investor too much influence over the Oracle protocol? The Oracle Team does not see any conflict of interest arising from amount of influence any single investor may have.   Given the incorporation and domicile location of the organization, is there a risk adding this Light Feed would give a single jurisdiction too much influence over the Oracle protocol? The Oracle Team does not see any issue with regards to jurisdictional influence accrual that adding MyCrypto would pertain.   Identity  Did the Oracle Team get in contact with the organization to confirm their application? Yes the Oracle Team talked directly to Taylor Monahan the Founder and CEO of MyCrypto.  Cost-Benefit   Given the ratio of Dark Feeds : Light Feeds, does the Maker Protocol benefit from adding another Dark/Light Feed at this time? The Oracle Team believes that an additional Light Feed from an esteemed company like MyCrypto is appropriate given the current number of Dark Feeds relative to Light Feeds.   Given the extra cost of appointing a new Feed, does the benefit of the marginal security / marginal trust in the protocol exceed the cost? As the Maker Protocol is scaling in size both in terms of deposits as well as outstanding Dai supply, it requires a greater and greater security threshold. Adding a new Light Feed at this point time seems prudent.   Oracle Team Recommendation Given the stellar reputation MyCrypto has built up not just as an infrastructure provider, but as a core member of the Ethereum community and industry-leader in the education and UX domains the Oracle Team highly recommends the Maker Governance community consider appointing MyCrypto as a Light Feed for the Maker Oracles. ",
                    "links": [
                        "https://www.reddit.com/r/ethereum/comments/7wgnds/official_myetherwallet_statement/",
                        "https://icis.corp.delaware.gov/ecorp/entitysearch/NameSearch.aspx",
                        "https://jobs.polychain.capital/companies",
                        "https://www.crunchbase.com/funding_round/mycrypto-series-a--d1c7877a#section-investors",
                        "https://www.boost.vc/portfolio",
                        "https://www.ausum.vc/portfolio",
                        "https://www.crunchbase.com/person/albert-ni#section-overview",
                        "https://www.crunchbase.com/person/mick-hagen#section-overview",
                        "https://www.crunchbase.com/person/chance-du#section-overview",
                        "https://www.crunchbase.com/person/lily-liu-0251#section-personal-investments",
                        "https://forum.makerdao.com/t/maker-relay-ep-7/3630",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-104-thursday-august-6-4-00-pm-utc/3469/2",
                        "https://forum.makerdao.com/t/weekly-polls-2020-08-10/3627"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.039755766621439
                },
                {
                    "author_link": "https://forum.makerdao.com/u/409h",
                    "index": "#3",
                    "likes": "1",
                    "time": "01/09/2020-18:20:18",
                    "content": "{   \"address\": \"0x3cb645a8f10fb7b0721eabae958f77a878441cb9\",   \"msg\": \"We are MyCrypto and our Feed key is 0x3CB645a8f10Fb7B0721eaBaE958F77a878441Cb9\",   \"sig\": \"0x2c44efe54f05f7c20194d339005085129e8ec8e24ffa53045529082a62e91dea25fb8dbb0746473976a509aa28ab550880772dda702085111d4bc2377f95bd131c\",   \"version\": \"2\" }  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/09/2020-13:50:56",
                    "content": "verified!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c14-sp5-proposal-appoint-argent-as-a-light-feed/3015",
            "title": "MIP10c14-SP5 Proposal: Appoint Argent as a Light Feed ",
            "index": 3015,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-lightfeed-sp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/itamarl",
                    "index": "#1",
                    "likes": "9",
                    "time": "02/07/2020-14:55:00",
                    "content": "Hi everyone, Itamar from Argent here. Below is our proposal to add Argent as a Light Feed Price Oracle to MakerDAO. Let us know if you have any questions and thank you for your consideration!  MIP10c14: Subproposal to Appoint Light Feed  Preamble MIP10c14-SP#: 5 Author(s): Itamar Lesuisse Contributors: Status: Formal Submission Date Proposed: 2020-07-02 Date Ratified: <yyyy-mm-dd>   Disclaimer MIP10 is meant to handle all of the Oracle related actions. Unfortunately MIP10 has inconsistencies and doesn’t conform to the monthly governance cadence that the Maker Improvement Proposal framework is built around. This has generated a backlog of Oracle proposals. While MIP10 is refactored to conform to the regular MIP process, Oracle proposals such as this one will utilize the more liberal weekly governance cycle. While strictly speaking this makes them not subproposals, they are included in the subproposal archive as a point of provenance to serve as a paper trail.  Specification  Organization  Name: Argent Labs Limited Website: https://www.argent.xyz  Github: argentlabs · GitHub  Email: [email protected] Incorporated: United Kingdom Domiciled: United Kingdom Number of employees: 23 When was the organization founded? 4 December 2017 Who are the major investors in your organization? Paradigm, Index Ventures, Creandum How much funding has the organization raised either privately or through a token sale? $16m in equity funding Please provide public references for the above where possible. References for funding: Cityam Companies House Crunchbase    Introduction Motivation for running a Light Feed We want to actively support important projects in the Ethereum ecosystem, making them more robust and reliable. Maker Oracles are significant infrastructure that we believe we have the resources and technical talent to contribute to.  Community What has your organization contributed to the crypto community? Argent has built a simple and safe wallet for consumers. This has pioneered non-custodial crypto without seed phrases or gas (we use meta-transactions), and with security measures such as daily transfer limits and whitelisting contacts. In addition Argent provides easy access to integrated Dapps, including Maker DSR and, soon, Maker Vaults. In recent months we’ve seen significant adoption of DAI from users in Latin America. Argent’s smart contract architecture is open source. Aside from our core wallet, we also developed Hopper, an open source privacy mixer, before handing it over to the community for further development. Successful products, services, tools, libraries, thought-leadership  You can find our wallet here: https://www.argent.xyz/. Our smart contracts are open source and available here: https://github.com/argentlabs/argent-contracts/tree/master. Our blog: https://www.argent.xyz/blog/. Some recent talks: https://www.youtube.com/playlist?list=PLv2mJCRJoTfPH1rYCWLMzs4j8Eu8kLHpb   How will the Maker Community benefit from your inclusion as a Light Feed? We comprise a strong technical team of experienced engineers and PhDs, who have been building secure crypto products for a mass audience for two years. The team would add geographic diversification too: it is based across Europe, from Northern Ireland to Bulgaria, Spain to Slovenia. ",
                    "links": [
                        "https://github.com/argentlabs",
                        "https://www.cityam.com/sequoia-crypto-fund-paradigm-makes-first-europe-investment-with-london-startup-argent/",
                        "https://beta.companieshouse.gov.uk/company/11093638/filing-history",
                        "https://www.crunchbase.com/organization/argent",
                        "https://www.argent.xyz/",
                        "https://github.com/argentlabs/argent-contracts/tree/master",
                        "https://www.argent.xyz/blog/",
                        "https://www.youtube.com/playlist?list=PLv2mJCRJoTfPH1rYCWLMzs4j8Eu8kLHpb",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-99-thursday-july-2-9am-pst-4-00-pm-utc/2944/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.773065476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#2",
                    "likes": "2",
                    "time": "12/07/2020-06:11:01",
                    "content": "Preamble MIP10c15-SP#: 5 Author(s): Nik Kunkel Contributors: Type: Process Component Status: RFC Date Proposed: 2020-07-02 Date Ratified: <yyyy-mm-dd>  Specification Introduction If ratified, this subproposal would appoint Argent as a Light Feed. Feeds submit data to the Oracles for the prices of assets. They are an important part of ensuring that the Oracles are reliable and secure. Only entities with strong credentials that the community trusts should be permitted to be an Oracle Feed. Organization The following information was provided by Argent in their MIP10c14 application and verified by the Oracle Team to the best of its ability. Name: Argent Labs Limited Website: https://www.argent.xyz Github: https://github.com/argentlabs Email: [email protected] Incorporated: United Kingdom Domiciled: United Kingdom Number of employees: 23 When was the organization founded? 4 December 2017 Who are the major investors in your organization? Paradigm, Index Ventures, Creandum How much funding has the organization raised either privately or through a token sale? $16m in equity funding Please provide public references for the above where possible. References for funding: [Cityam](https://www.cityam.com/sequoia-crypto-fund-paradigm-makes-first-europe-investment-with-london-startup-argent/) [Companies House](https://beta.companieshouse.gov.uk/company/11093638/filing-history) [Crunchbase](https://www.crunchbase.com/organization/argent)  Light Feeds Reputation   Does the organization have a strong reputation in the crypto community? Argent is a premiere mobile wallet with integrations spanning from the Dai Savings Rate to Compound, Aave, Uniswap, Kyber, and more. It also features a novel Guardians mechanism to restore wallet access in the case of lost keys. It has experienced immense growth in the past year through paying users gas fees, a clever growth hack.   What contributions has this organization made to the crypto ecosystem? Argent has created a feature rich mobile wallet cover the end to end spectrum of fiat onboarding all the way to DeFi dapps interactions, all packaged up in an intuitive and easy to user interface. Argent has enabled crypto to be exposed to a whole new subset of individuals across the world whose only access to the internet is through their mobile phone. Where other wallets such as TrustWallet and Coinbase Wallet have stagnated, Argent has rapidly innovated and established itself as the premiere mobile wallet in just under a year by shipping new integrations almost monthly.   Would including the organization as a Light Feed instill a sense of trust in the Oracles? Argent is a respected and trusted organization in the Ethereum ecosystem and their inclusion as a Feed would incite users to trust Maker’s Oracles more.   Are there any public accussations of misconduct? How severe and numerous are they? Have they been confirmed? Oracle Team was not able to find any evidence of malicious conduct.   Verification   Were sufficient public-facing resources provided or found that confirm the information in the application? Yes Argent provided numerous sources backed by credible organizations.   Was the applicant honest with respect to:   the investors   how much funding was raised The Oracle Team found over a dozen sources via a simple Google Search confirming the investors as well as the amount raised   the number of employees The Oracle Team found 25 individuals on LinkedIn claiming to have current or past associations with Argent.   the location of incorporation & domicile The Oracle Team was able to confirm the existence of Argent Labs Limited registered in the United Kingdom at address 9th Floor 107 Cheapside, London, United Kingdom, EC2V 6DN through the U.K. Companies House Register with Company Number 11093638 and registered on 4 December 2017 as stated in Argent’s application.   Given the applicant’s major investors, is there a risk adding this Light Feed would give a single investor too much influence over the Oracle protocol? The Oracle Team finds no issue with including Argent whose major investors include Paradigm, Index Ventures, and Creandum, and whose largest shareholders are Julien Gregoire Georges Niset (Cofounder & Chief Science Officer), Gerald Goldstein (Cofounder), and Itamar Lesuisse (Cofounder & CEO) are all employees of Argent Limited.   Given the incorporation and domicile location of the organization, is there a risk adding this Light Feed would give a single jurisdiction too much influence over the Oracle protocol? No.     Identity   Did the Oracle Team get in contact with the organization to confirm their application? Yes, the Oracle Team spoke to Itamar over video conference who is listed on LinkedIn as the CEO. This is further confirmed by the U.K. Companies House register   Cost-Benefit   Given the ratio of Dark Feeds : Light Feeds, does the Maker Protocol benefit from adding another Dark/Light Feed at this time? Yes, the Maker Protocol currently has 15 Dark Feeds and 9 Light Feeds. Adding another Light Feed would further balance the ratio.   Given the extra cost of appointing a new Feed, does the benefit of the marginal security / marginal trust in the protocol exceed the cost?   Yes, the Maker Protocol currently has 24 Feeds. Adding another Feed would marginally increase Oracle security and resiliency. Oracle Team Reccomendation  Was the applicant honest with the data they provided?  The Oracle Team did not find any inconsistencies in the information provided by the applicant. ",
                    "links": [
                        "https://www.linkedin.com/search/results/people/?facetCurrentCompany=%5B%2211414677%22%5D",
                        "https://beta.companieshouse.gov.uk/company/11093638",
                        "https://beta.companieshouse.gov.uk/company/11093638/officers",
                        "https://forum.makerdao.com/t/weekly-polls-2020-07-20/3275"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.725080776711212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/craig",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/08/2020-14:42:52",
                    "content": "Hi, its Craig from Argent here…just posting our signed message… Message: We are Argent and our Feed key is 0x130431b4560Cd1d74A990AE86C337a33171FF3c6 Signature: 0x360856f8a9e121864121c83be1c844f7b225f97478560249d07937a332705ecf6f297a1bd4f20aad24d5bd074d60dc60e35ff4442a93b36eb282d4f64d5949461c Cheers! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cmooney",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/09/2020-13:50:33",
                    "content": "    craig:  Signature: 0x360856f8a9e121864121c83be1c844f7b225f97478560249d07937a332705ecf6f297a1bd4f20aad24d5bd074d60dc60e35ff4442a93b36eb282d4f64d5949461c   verified!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2421"
}