{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/preguntas-para-las-core-units-sobre-los-activos-intangibles-para-revision-y-comentarios-traduccion/16712",
            "title": "Preguntas para las Core Units sobre los activos intangibles - para revisi\\xc3\\xb3n y comentarios [Traducci\\xc3\\xb3n] ",
            "index": 16712,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "daif-001",
                "intangible-asset",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#1",
                    "likes": "5",
                    "time": "20/07/2022-14:31:08",
                    "content": " Preguntas para las Core Units sobre los activos intangibles - para revisión y comentarios Los activos creados y mantenidos por la financiación de MakerDAO deberían convertirse por defecto en bienes públicos para toda la DAO. Ciertamente puede haber situaciones en las que este no sea el caso, y los derechos de los activos se compartan con o se den a un stakeholder específico porque la DAO se beneficia de otras maneras de la financiación que proporciona. Sin embargo, en estos casos debe ser transparente para la Gobernanza de Maker que esto está sucediendo y por qué. Mientras que una core unit puede apoyar que los activos producidos utilizando la financiación de MakerDAO por defecto son bienes públicos para toda la DAO, puede olvidarse en el trabajo diario de asegurar que esto se cumpla plenamente. Para evitar que las operaciones de la DAO se pongan en peligro debido a que los derechos de los activos desaparecen cuando una CU/facilitador se retira, hemos redactado una serie de preguntas para garantizar que se centre la atención en evitar que un solo operador pueda controlar importantes activos y canales de comunicación de MakerDAO. Compartimos estas preguntas aquí para que las revise y comente la comunidad en general. Si tienes una opinión al respecto, por favor, pon un comentario en este mes @Core-Facilitators @Recognized-Delegates  Preguntas Estas preguntas están pensadas para ser formuladas cuando el MIP de una Core Unit ha sido publicado en el RFC, a menos que estos puntos ya estén cubiertos en la presentación del RFC. Las core units existentes deberán responder a las mismas preguntas la próxima vez que presenten un presupuesto para la aprobación de la gobernanza o en un momento anterior…  ¿Se ha familiarizado con la Política de Marca de Dai & Maker, para saber cómo utilizar los nombres y logotipos de Dai, Maker y MakerDAO? ¿Qué tipos de activos tangibles e intangibles vas a producir con la financiación recibida de MakerDAO? ¿Los activos producidos con la financiación de MakerDAO estarán disponibles como bienes públicos para toda la DAO?  Específicamente: ¿Se aplicarán licencias apropiadas de Open Source Software/Creative Commons a los activos producidos? ¿Se asignarán los derechos de autor de esos activos a la DAI Foundation, que tiene el mandato de salvaguardar los activos intangibles de MakerDAO?  ¿Integrará el [Asistente del Acuerdo de Licencia de Colaboración de la DAI Foundation] (https://cla.daifoundation.org/) en sus repositorios de Github?   ¿Se pondrá a disposición del público el material/código fuente de los activos? ¿Cómo? Además del MakerDAO Forum y MakerDAO Discord, ¿qué canales de comunicación tiene previsto utilizar su core unit para comunicarse en nombre de MakerDAO de acuerdo con su mandato? ¿Te asegurarás de que los sitios web de publicación/comunidad, el correo electrónico y algunas cuentas y los dominios DNS y ENS asociados utilizados para la comunicación oficial de MakerDAO para los que tienes derechos de gestión de contenidos son propiedad de la Fundación DAI para garantizar el control final de la gobernanza Maker sobre quién utiliza estos canales?   Si registra alguna marca para representar las soluciones financiadas por MakerDAO, ¿transferirá esas marcas a la DAI Foundation para su custodia?   Esta es una traducción libre del topic Questions for Core Units about intangible assets - for review and comment de @sorenpeter Créditos: Traducción @Brigith238 - Revisión @FuchoCrypto ",
                    "links": [
                        "https://cla.daifoundation.org/",
                        "https://forum.makerdao.com/t/questions-for-core-units-about-intangible-assets-for-review-and-comment/16334"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.083333333333333
                }
            ]
        }
    ]
}