{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/my-response-to-unacceptable-behaviour/17028",
            "title": "My response to unacceptable behaviour ",
            "index": 17028,
            "category": [
                "Discontinued Categories",
                "Real World Finance"
            ],
            "tags": [
                "rwf-0x",
                "archive-rwf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#1",
                    "likes": "9",
                    "time": "05/08/2022-09:40:59",
                    "content": "Continuing the discussion from MIP39c2-SP34: Creating RWF0x from a Split of RWF-001:    MIP39c2-SP34: Creating RWF0x from a Split of RWF-001   My proposal to form RWF-0x results from my conclusion that, after working as a team for nearly a year, myself, @eumenes and @teej can efficiently and effectively (and we have already done) execute on a Real World Asset vision supported by the Maker token holders.   Hi community You would have seen the post written by Christian about me. On a personal level I have to say that I was disappointed about the post but I cannot say that I was surprised. I have been an active contributor in this community for a couple of years now and you know that I am not someone to air dirty laundry in public. My focus is and always has been on delivering value to the community and this doesn’ stop today. It is also an open secret that @christiancdpetersen, @Eumenes, @teej and I have different views about what constitutes proper professional conduct and performance. In spite of these differences, I proposed a gentleman’s solution by suggesting they create their own CU and present their own value proposition to the community via the normal MIP39 to MIP41 process. In response to this offer my professionalism and reputation were attacked and I am not going to stay silent. Why you might ask, was I not surprised about Christian’s post? This has been brewing over a couple of months now but over the past week or so I was repeatedly contacted by Teej trying to coerce me into handing him, Eric and Christian a significant percentage of the RWF CUs budget and the facilitatorship. Failure to do so I was repeatedly threatened, would see them proceed with the offboarding process. An isolated incident, you might think? Unfortunately no. I have lost count of the number of times I was contacted by borrowers and counterparties over the last few months informing me about aggressive, rude and sometimes abusive and inflamatory behaviour towards them by members of the team. Why did I not let them go at that time you might ask? The operational risk to the DAO was deemed too high as some key onboarding initiatives were close to being finalised, i.e. SocGen and HVB. I tried to act in the best interest of the DAO by focusing on delivery and closing these projects as soon as possible. During this time the team was micromanaged and delivered the onboardings on time. But surely this is it? See for yourselves and make up your own mind… I am sharing a small selection with you for starters. Whilst reading, maybe ask yourself:  If you were a Maker Token holder, would you like your protocol to treat its clients like this and do you really think this will attract and retain clients long term? If you were a borrower/ counterparty, would you like to do business with people who insult you? If you were a delegate, would you trust people that insult you? If you were a company or Core Unit facilitator, would you hire contractors that behave aggressively? Would you be comfortable letting aggressive contractors be the face of your business?  In any professional environment, be it a DAO, a corporate, an SME, etc. there are certain standards of civil and respectful interaction that all three have repeatedly disregarded. Letting the team go is not vindication, it is a way of dealing with repeated unacceptable behaviour. [REMOVED CLEAR SIGNS OF REPEATED MISBEHAVIOUR]  @Recognized-Delegates @rune @nikolai @Allan_Pedersen @Peter_Pando @Dori @OasisProTeam @RWAC @g_dip @spin @cass @Khan @BlockTower ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967/12",
                        "https://forum.makerdao.com/t/short-take-exciting-news-and-opportunity-for-rwa-teams/16849",
                        "https://forum.makerdao.com/t/unblocking-the-stalled-short-term-bonds-revenues-generating-initiatives/17073",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-12/17264",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-12-traduccion/17270"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.39436507936508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GWintery",
                    "index": "#2",
                    "likes": "13",
                    "time": "05/08/2022-10:32:51",
                    "content": "This drama already looks exhausting to me. And showing these discord chats does say something about the ones leaking it too @williamr. These I assume are supposed to be a closed off private group conversations. It would probably be more constructive if you could get our current clients to express what you have claimed regarding their behaviour, rather than this mudslinging. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#3",
                    "likes": "17",
                    "time": "05/08/2022-10:50:28",
                    "content": "In my eyes, leaking private messages like that disqualifies you from leading any team in the future, RWF or not. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#4",
                    "likes": "2",
                    "time": "05/08/2022-10:58:38",
                    "content": "I have decided to delete the screenshots regarding repeated misbehaviour to all stakeholders in order to reduce the drama so we can just move on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/08/2022-11:03:31",
                    "content": "Thanks, I do appreciate that! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#6",
                    "likes": "7",
                    "time": "05/08/2022-11:38:16",
                    "content": "Well, MakerDAO. You wanted “real world finance”. You got “real world finance”. This IS “real world finance”. I have shared the deleted screenshots here because they are very critical in understanding what is really happening inside RWF. Members of RWF said horrible and hateful things about Maker’s token holders, delegates, founders, community, and and even Maker’s RWF lenders themselves. The awful disdain that they show for the community in these chats is completely indicative of a Wall Street “bro” culture. Honestly it’s not surprising at all given what we all know about the deceitful world of TradFi that most of us have been trying to escape for years. WIth this type of character on display, what do you really think is going on behind the scenes in these deals? Do you completely trust these humans to be honest, act with integrity and put the DAO first when large financial incentives are placed in front of them to entice cheating? This kind of stuff is the exact reason that I’ve been vocal against RWF in MakerDAO. A new RWF CU will not fix this. This is RWF culture. You can’t extract human nature from humans and you inevitably end up with “The Times 03/Jan/2009 Chancellor on brink of second bailout for banks” all over again. A DAO is supposed to be a “decentralized, autonomous organization” that provides strict rails for humans to ride on. RWF simply does not belong in a DAO due to the fact that it cannot operate on these rails and the fully transparent ethics that they require. You may be thinking… “Well, I’ve said some nasty stuff in private chats too. They should get a pass.” The difference here is their job. RWF is responsible for operating with integrity in a black box environment, putting together deals with TradFi lenders and (most importantly) acting honestly. Due to the nature of RWF, nobody in this DAO has the kind of incentive that RWF CU has to cheat. This is an existential problem with hosting this kind of activity inside of a leaderless DAO. The unavoidable incentives combined with this small glimpse into human nature should preclude RWF activity entirely. MakerDAO saw RWF as a viable shortcut for survival, but now it’s apparent that it’s a cancer that’s spreading fast. Rational MKR holders, I know you’re out there. It’s time for MakerDAO to close the chapter on RWF before this culture engulfs the entire DAO. We can do so much better than this. Let’s move on from this mistake. It won’t be easy, it will be painful, but these are simply the characteristics of real decentralization. If we don’t take measures to end RWF now, we will lose this DAO to the bankers and regulators within a year. If you are a MKR holder and you want the DAO to begin shifting back towards decentralization and autonomy, then now is the time to rise up. Delegate, vote, and be ready for some hard work ahead. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.227107076596873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#7",
                    "likes": "31",
                    "time": "05/08/2022-12:50:31",
                    "content": "@ChrisBlec I would urge you to remove these private chats for the following reasons and I have also asked @gov-comms-core-unit to do this by flagging this post   These are private discussions copied from private chats and private channels, which should in my eyes never be released on a public forum without the permissions of the people involved.   They are embarrassing to MakerDao and establish a precedent that any private communications held by Core Unit Contributors or any community member in their discords or in other private channels are not sacred.   You are drawing your conclusions without having any context surrounding these discussions, in fact I would argue the opposite in some cases, as I suspect some of these discussions are in relation to perceived conflicts of interest the arrangers may have in respect to some of these deals.   I think every community member of MakerDao should abide by some level of professional integrity, and the disclosure of these messages in my eyes violates that integrity.   Note, I am not indicating that we shouldn’t be investigating this behaviour - but a public forum is not the place to discuss this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.989583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GWintery",
                    "index": "#8",
                    "likes": "27",
                    "time": "05/08/2022-13:00:07",
                    "content": "Good job on making decisions based on very limited context and damaging screenshots. I have no strong opinions on who is wrong or right here, but you seem to be using this to further your own agenda, and making conclusions to support those. Generalizing stereotypes also tells me more about you as a person. RWF is an inevitable part of making blockchain and MakerDAO relevant to the world as we know it. Removing RWF honestly tells me that you are against what the DAO believes in and where it wants to go, as it has been stated that this is the goal for a long time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.933150183150183
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#9",
                    "likes": "9",
                    "time": "05/08/2022-13:13:01",
                    "content": "well, admittedly culture is a tricky thing to handle. culture is adequate as long as it does the job for an acceptable price. one could argue that culture in the military is quite harsh, but in many cases it’s adequate for the task. evidently, there was a culture clash between Will & the rest. question: how did Will end up hiring and retaining other guys? abusing clients is unacceptable, although I’d like to hear about that from the clients. however, sometimes Wall st ‘bro’ culture fails (Lehman) and sometimes it’s a tool that works – at the end of the day somebody has to arrange deals: capitalism works on borrowed capital and Maker wants to be part of this. btw, one could argue that Wall st. ‘bro’ culture is hardly worse than Silicon Valley ‘bro’ culture. who knows what’s going on in devs’ private chats? but they do the job. Maker can’t lock itself in the virtual/crypto/meta world. real value is created in the real world. Maker should learn to build bridges/interfaces to the real world. here I’d like to reiterate my point that there might be one more superfruitful source of organic growth for Maker: tokenising & collateralising Physical Metaverse, like products of digital design and fabrication: a natural middle ground and a bridge between the worlds of purely virtual assets like crypto or gaming and purely real world assets tokenised by entities like arrangers in a trustful manner. This could bring real world assets onchain (although different ones) in a trustless manner without risking decentralisation. incidentally this culture clash could be an excellent test case for metaDAOs: multiple mDAOs with radically different cultures could exist in parallel, compete for clients, maybe some of them will fail, maybe not. without sacrificing Maker core integrity. UPD: just to state the obvious: private correspondence should not be published. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.412250384024578
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#10",
                    "likes": "6",
                    "time": "05/08/2022-13:26:19",
                    "content": "Internal unresolved conflict reflects poorly on CU leadership and humilliating them in a public forum is another affirmative action to that statement. In essense a CU facilitator is in charge of setting the vision and strategy but also in creating a workculture that fosters professionalism and respect. Either your hiring process is broken and you truly hired problematic members or… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#11",
                    "likes": "8",
                    "time": "05/08/2022-14:07:07",
                    "content": "If you click on the orange pencil at the beggining you can still see everything cuz was edited. Never the less, yeah, speaks very bad from not just the ppl in the screenshots but from the guy who posted them, looks like a angry and jealous girlfriend with screenshots.  Is NOT PROFESSIONAL from anyone to share this stuff, or you share your conversations with your brother/mom/dad, etc ???     ChrisBlec:  I have shared the deleted screenshots here   I encourage you to delete this too Chris, doesn’t help anyone, honestly seems you want to put more drama over MakerDAO. At the end this just show that within Maker we need to really know who’s gonna work for us with a good track on his/her back. In fact, @williamr I would encourage you to delete the whole post and do another a little bit more PROFESSIONAL. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.379166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fig",
                    "index": "#12",
                    "likes": "8",
                    "time": "05/08/2022-14:08:38",
                    "content": "This is messy and I don’t like it. While color is important for delegates to make informed decisions, the sharing of privileged messages causes distrust - not just for current CU’s, but also for prospective facilitators. While I believe in the mantra, don’t say it unless you’re ok with your mom reading it - this behavior of voluntarily sharing closed-off messages is dangerous and dirty. As for the behavior of facilitators themselves, YES, they should act with a sort of professionalism. Folks are being compensated at levels equivalent or greater than large companies - they should act like it. Discord can encourage a sense of casualness which becomes slippery fast. I would disagree with the statement below:     pvl:  however, sometimes Wall st ‘bro’ culture fails (Lehman) and sometimes it’s a tool that works – at the end of the day somebody has to arrange deals: capitalism works on borrowed capital and Maker wants to be part of this.   Lehman didn’t fail because of “bro culture” it failed because of incorrect lending practices and underwriting. “Bro culture” - whether thanks to finance or tech, will be ubiquitous in crypto; it is the epitome of a hybrid of the two. Just look at our demographics … This attitude will exist, however, it is a question of separating it and isolating it from work. This is a job. Take it seriously. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.66031746031746
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#13",
                    "likes": "2",
                    "time": "05/08/2022-14:14:12",
                    "content": "Honestly this is a defamation lawsuit against these “cockroaches” @teej @Eumenes @christiancdpetersen are obviously unprofessional and disreputable people. Community, these individuals and Im sure others are being paid by the ecosystem and these chats are like forum chats.This is the problem here.These are cu chats not private chats.I hope these individuals are removed from the ecosystem permanently.Being compensated and openly trying to damage rwa deals. All that have been defamed please dm me as I believe the defamation here are serious lawsuits.  This is incredible data. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.190476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#14",
                    "likes": "4",
                    "time": "05/08/2022-14:16:59",
                    "content": "A lot of drama and very little substance these days in MakerDAO. How sad. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.140625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#15",
                    "likes": "3",
                    "time": "05/08/2022-14:22:24",
                    "content": "part of ‘bro’ culture, imo, is arrogance, hubris and bravado, especially towards ‘outsiders’. shortage of humility. it’s common for closed ‘elite’ groups. btw, there’s plenty of hubris in DeFi => TradFi and web3 => web2 it could be fuel for pioneering moves, for the job done. sometimes this leads to miscalculated risks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#16",
                    "likes": "2",
                    "time": "05/08/2022-14:24:27",
                    "content": "I will Vote No on Anything involving @teej and other bad actors @christiancdpetersen @Eumenes.Voting No.Toxic behavior ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.937500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#17",
                    "likes": "1",
                    "time": "05/08/2022-14:39:07",
                    "content": "@GWintery Why would current clients say anything with this toxic behavior publicly.It is a lose lose.I noticed the professionals are staying quiet.This crew should have been fired a long time ago.Think about it, when someone posts a “canceling” occurs from these bad actor former CU members.Makes no sense to post and go into the muck and mire they represent and some forum members want these posts within the cu to be removed.more canceling.delegates I would strongly encourage you to separate from these individuals permanently.this is toxic ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.683333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LegalG",
                    "index": "#18",
                    "likes": "2",
                    "time": "05/08/2022-14:42:22",
                    "content": "I would add also no wonder RWA has been such a failure with this group and LOVE group involved.Let’s see who is mired with these bad actors.this may be tip of iceberg or rats nest.seriously those defamed please reach out.there is significant defamation by @christiancdpetersen @teej @Eumenes and I believe they all reside in the States so should be quite a show. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.858333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#19",
                    "likes": "6",
                    "time": "05/08/2022-14:50:35",
                    "content": "Wow. Do not listen to the shills and keep these materials up, Chris! Everyone should read this silliness. The messages are funny, sad, pathetic and frankly, unprofessional. So much for “professionalizing” Maker, no? The DAO should not give one more dime/peso/shekel/Dai to these clowns. Tosh (Douche9.0!) Haha. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.928571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#20",
                    "likes": "7",
                    "time": "05/08/2022-15:40:50",
                    "content": "I’m deeply saddened by this turn of events. RWF was supposed to be the crown jewel. Now we have two parties slinging the worst kind of accusations at each other and very little way to establish the truth. I urge all of the parties involved to put their animosities aside, come clean about what is and what is not, and work towards a bright future for the DAO, which is worth sooo much more than the petty complaints I can discern in these posts. Please, let’s behave like gentlemen and do good business. We’ll all be happier for the outcome. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8172348484848495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#21",
                    "likes": "16",
                    "time": "05/08/2022-15:41:55",
                    "content": "    pvl:  how did Will end up hiring and retaining other guys?   I hired the whole team. I was fired and Will (who was a team contributor at the time) was put in place by MKR holders. @williamr was well aware of who they are having work with them significantly. Those are guys who delivers and want the best for MakerDAO. They got us SocGen and HVB. RWA are hard and it is fierce you have no idea. Anons like @LegalG (which many believe from UDHC) or @Tosh9.0 (big proponent of 6S) can publicly insult, attack credibility and make legal threats of the workforce in order to pass their collateral. And no one opposing. Take that for a few months and see if you can keep cool. The space is hard and toxic. Toxicity was a community decision and is part of the MakerDAO culture (maybe it’s a DAO thing). It can stop when community wants. PS: btw some top level members can freely call some respectable borrowers “trash” and “abomination” in a public settings. Back then, @williamr didn’t bring lack of professionalism. Good for him, he was given the facilitator position 2 days after. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.066666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#22",
                    "likes": "5",
                    "time": "05/08/2022-15:52:24",
                    "content": "    ChrisBlec:  If we don’t take measures to end RWF now, we will lose this DAO to the bankers and regulators within a year.   RWA has been repetitively voted on as one of the key product strategies by a portion MKR tokenholders. Your remarks would be more informative and allowed for constructive feedback if you shared data, evidence or referrals that agree with your strong opinions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.854166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#23",
                    "likes": "16",
                    "time": "05/08/2022-16:12:15",
                    "content": "I encourage the community to bifurcate our current business of real world assets (the collateral not the team) and the actions of actors in our ecosystem. The community can decide on the appropriate course of action for those actors. My sole concern if for the execution of our strategies and work around RWAs. As I’ve posted prior, there are a large team of collateral stakeholders involved with onboarding and managing our collateral. This team is highly qualified and we are competent to assess situations and fill gaps. At the moment, the gap is having qualified third parties to do the work. This is manageable and the only drawback is that is might delay the implementation of some of the work in progress. If MakerDAO plans to have RWAs as part of our future, we’ll need a strong group of leaders to put a plan together and manage the messaging and transition of whatever we decide to do as a DAO. Core Units are decentralized but I encourage all of the facilitators and delegates to come together, put a plan in place, then execute. I am willing to participate in this. As I mentioned on several calls, CES has the business acumen and experience to manage whatever “crisis” may be playing out relating to the onboarding of collateral, crypto native or real world assets. I would ask the community to identify the key areas and focus on solutions around those areas. For me, the following needs to be addressed:  Business continuity RWF actors and actions Clear direction on real world asset work  Please…let’s put the drama and personal attacks aside and get to work on creating solutions and solving problems. Generating revenue for the protocol has to be the #1 priority. Let’s go do that! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.680385487528344
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#24",
                    "likes": "3",
                    "time": "05/08/2022-16:19:07",
                    "content": "The number 1 problem I see is gatekeepers preventing some RWAs from being onboarded and others getting the VIP treatment. Professional real world asset arrangers would help, but at the moment there is no clear straightforward path to apply and be approved even if you have the financials and structure in place. We have to make a better on-boarding process from the ground up that circumvents any lobbying for or against a particular borrower. A backroom of elites deciding for the good of everyone else can’t be the solution. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4226190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#25",
                    "likes": "2",
                    "time": "05/08/2022-16:31:50",
                    "content": "Couldn’t agree more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#26",
                    "likes": "3",
                    "time": "05/08/2022-16:41:46",
                    "content": "@GovAlpha-Core-Unit as this posts has so much bad words, curses and not good behavior want it to be flagged if possible. As this went too far at this point, and this is an open question, don’t you guys think Maker should Incubate a RWA team under Growth Core Unit? Those guys are doing nice and good deals, and seems they know how to hire good people, just an idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/welsh",
                    "index": "#27",
                    "likes": "2",
                    "time": "05/08/2022-17:27:54",
                    "content": "How can this be dealt with if not in public.  This is one of the major costs of a DAO, that governance is handled in public.  Its similar to dealing with offboarding (i.e. firing) contributors.  These types of issues require candid, frank, and often painful discussions.  In a typical organization this would be handled behind closed doors.  DAO’s don’t seem to have that luxury.  So we need to either get comfortable with dealing with this type of stuff in public, or accept that more centralization is necessary and setup private forums for delegates/whales to deal with this stuff. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.069940476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#28",
                    "likes": "2",
                    "time": "05/08/2022-17:31:39",
                    "content": "Oh please, Seb. Asking hard questions is insulting now? Stop the self-victimization/gaslighting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.770833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#29",
                    "likes": "2",
                    "time": "05/08/2022-18:04:28",
                    "content": "    monkey.irish:  RWF actors and actions   I agree with all of what you said (& think this one I am quoting is the lowest priority of the 3 needs to be addressed), but on this topic, I think it would be best for the DAO if both sides brought forth more pertinent hard info / evidence. We need to avoid the situation where we are forced to take one side’s word over the other’s. For instance, williamr says he micromanaged the team through HVB and SocGen. rwf-0x seems to disagree with that statement. This should be something that could be substantiated by the side that speaks the truth. Hopefully. As always, my independent thoughts & not representative of SFCU. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.652777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#30",
                    "likes": "4",
                    "time": "05/08/2022-19:10:47",
                    "content": "Wow the behavior by @teej @christiancdpetersen and @Eumenes is beyond despicable. My issue isn’t just based on how they have carried out their remarks which in itself was beyond disgusting for any organization, but how they also seem to disregard the community, delegates, and the rest of us maker holders in such a toxic manner. Seeing the phrase cockroaches slung so many times really makes me want to see them not be a part of the future of this protocol personally. While I’m sure they did deliver on a few aspects, what kind of precedent are we setting if we allow such cancerous activity to continue in RWF? Did we not learn from the failures of other organizations when you allow such behavior to not only run freely, but for us to encourage it by handing them a new core unit? They should be punished for their actions, not rewarded. This confirmed many of my own personal beliefs as a long time lurker as I awaited the progress on various proposals, and as a maker holder who’s been wanting to see us take on interesting initiatives. This honestly really saddened me to see their behavior since I really wanted to believe otherwise. I think those that are choosing to ignore it are a part of the problem, since it’s beyond clear these individuals have no place at maker. Do we just need to pretend to the holders everything is fine and dandy while meanwhile they shit talk all of us in the background? I would argue since this IS a DAO, transparency is everything since we should see this behavior first hand. Why should they feel like they can move against the interests of the community or set up plans for sabotage for greenlit proposals simply because they don’t agree with them? As a result, I support their terminations after seeing this. I wasn’t sure at first based on their own forum detailed post as to what happened since it seemed shocking. But after reviewing this information, it’s painfully obvious who’s at fault here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.66361531986532
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#31",
                    "likes": "12",
                    "time": "05/08/2022-19:15:11",
                    "content": "I suggest we just move on and stop with the grandstanding. People talk shit in private what else is new. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.893939393939394
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#32",
                    "likes": "4",
                    "time": "05/08/2022-19:16:15",
                    "content": "Seriously man! This reflects poorly on the toxic environment created at the Facilator level…First getting to this point, exposing co workers, allowing it to happen and ultimately creating this unproductive drama (even though some might enjoy it for entertainment) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.479166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#33",
                    "likes": "1",
                    "time": "05/08/2022-19:17:35",
                    "content": "If they talk shit in private then it should be fine for us to see with full transparency how they talk shit about us too. They work for the maker holders. It’s not different from working for shareholders of any traditional business. If I talk bad about my employer or shareholders, there is a reasonable expectation that the organization has oversight and can/will not tolerate that behavior. The arguments being made here about it being protected is a joke quite frankly ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.925925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#34",
                    "likes": "1",
                    "time": "05/08/2022-19:17:36",
                    "content": "Yeah agree Will should not have shared these private convos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#35",
                    "likes": "0",
                    "time": "05/08/2022-19:19:44",
                    "content": "A serious organization would not leak private conversations to the entire organization, they would have private conversations with the individuals and the members would face consequences (reduced salary to termination) and create a plan to either correct the behaviour or find another solution. This is totally different. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#36",
                    "likes": "2",
                    "time": "05/08/2022-19:20:23",
                    "content": "Feel free to paste all your DMs in here. I’m sure there’s nothing bad you’ve ever said…  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#37",
                    "likes": "2",
                    "time": "05/08/2022-19:21:34",
                    "content": "This is a case of a DAO at work though. Does Maker have an HR department? No? Well when William took action after Christian posted about it, most were shocked including me. He laid out his case as to why he let them go and to me it seems totally in line with ANY other job you have elsewhere ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#38",
                    "likes": "1",
                    "time": "05/08/2022-19:22:17",
                    "content": "Do I work for Maker? No? Exactly. Would I DM shit on a company owned channel about my employer and their shareholders and expect no repercussions? No? Exactly ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#39",
                    "likes": "2",
                    "time": "05/08/2022-19:23:55",
                    "content": "You must have never held a job then. Most people talk shit about their bosses in private. It’s a way to vent. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#40",
                    "likes": "2",
                    "time": "05/08/2022-19:24:57",
                    "content": "I serve as an executive at a top technology company in SF so I beg to differ. You want to vent sure, but not in company mediums. That’s what Blind is for. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Colin_F",
                    "index": "#41",
                    "likes": "1",
                    "time": "05/08/2022-19:27:19",
                    "content": "So you do talk shit about your employer. Basically what you’re saying is do whatever you want just don’t get caught. That’s a pretty loose moral stance ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.966346153846154
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#42",
                    "likes": "1",
                    "time": "05/08/2022-19:31:44",
                    "content": "No what I’m saying is people arguing we shouldn’t see the posts and what they said is laughable. Why? Why is that speech protected? They said it so why not hold them accountable to their words? It’s baffling to me how much people are jumping to protect them. You want to talk shit? Go ahead, but own your words You post on Blind then that’s again your decision but at least that has to be only seen by people who work for that given organization too in an anonymous setting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#43",
                    "likes": "4",
                    "time": "05/08/2022-19:33:31",
                    "content": "All the screenshots are is venting, I dont see anything in there which would lead me to believe they are acting in a self-interested, acting like this externally or posing reputational risk. They are only internal people in the conversations… What in there has caused damages to MKR? Leaking them is causing more harm than anything in those chats ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Colin_F",
                    "index": "#44",
                    "likes": "0",
                    "time": "05/08/2022-19:36:31",
                    "content": "    GeorgeM:  You want to talk shit? Go ahead, but own your words   Exactly!! You want them to own it BECAUSE it’s been made public… Which shouldn’t have happened. It’s protected because it wasn’t on any of the public access channels (discord or the forum). It was leaked. By that very definition it is wrong. I’m sure if you aak some of your top tech company lawyers they’ll have something to say ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.161458333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#45",
                    "likes": "1",
                    "time": "05/08/2022-19:38:09",
                    "content": "Leaked to who though? The community that they work for? Where is the accountability? If he had not shared it, would there not have been questions regarding why he let them go? Isn’t this the very proof we as the community ask for? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Colin_F",
                    "index": "#46",
                    "likes": "0",
                    "time": "05/08/2022-19:40:32",
                    "content": "So public lynching is the way forward? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#47",
                    "likes": "1",
                    "time": "05/08/2022-19:42:47",
                    "content": "Not saying that, but I’m also arguing the opposite hasn’t worked either. Maybe a private forum between delegates holders and core units. Regardless, the argument that the community should not be aware of how maker members represent our project is unacceptable ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#48",
                    "likes": "1",
                    "time": "05/08/2022-19:44:23",
                    "content": "Maker is for the community, and doesn’t have the traditional setup of having HR, direct structure and what not for there to be a clear process. The argument that lack of transparency is the solution is just plain wrong ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.485714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Colin_F",
                    "index": "#49",
                    "likes": "0",
                    "time": "05/08/2022-19:46:51",
                    "content": "But core units are business entities on their own. They should have processes for running their business! Not publicise in a manner that reads “I bitch slapped these people because they talked some shit” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#50",
                    "likes": "2",
                    "time": "05/08/2022-19:48:37",
                    "content": "Did you see how the termination statement was handled? They are trying to spin up another RWF CU. Imagine I get terminated from my job and I go to the company and say actually give me my own team. Purely laughable ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Colin_F",
                    "index": "#51",
                    "likes": "0",
                    "time": "05/08/2022-19:59:07",
                    "content": "Look. We can go around in circles on this. But let me put it to you this way. This thread is guaranteed to show up in the crypto media. How is that gonna help the Maker protocol? How is anyone supposed to trust doing business with Maker? The point is, those messages should not have been made public. If we really care about the protocol, we should at least think about that ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GeorgeM",
                    "index": "#52",
                    "likes": "2",
                    "time": "05/08/2022-20:11:00",
                    "content": "Sure, but simultaneously letting such bad actors continue to exist within our protocol is equally damaging long term. What prospective partner of ours in their right mind would post about their bad dealings here? They would get questioned by the community as they would ask for evidence as well. So again, we ask for the evidence - but when we get it, we throw our arms up. If we can’t own what we are, then what is this DAO for? Is the forum just a charade? We are a DAO, DAOs can have problems just like any other org structure, and unless we want to hide it from the maker holders and community, I’m not sure the solution is to brush it under the rug. If another mechanism existed for William to communicate why said individuals were terminated, I’d understand and agree. But at the moment, the forum is what we have, there is no centralized control over this kind of process (I.e HR) and people asking for evidence received it in this thread which I appreciate as a holder. He didn’t like their conduct, he fired them. They then pushed to go around him and open a new CU. Is this the culture we want to foster? It’s straight mutiny That being said, my whole point has been if you had this conduct done in any other organization that has their chats handled via Slack, Teams, Discord etc. it would be flagged and you would be punished. The difference with us is as soon as he terminated them (aka the punishment), we asked why since we are the holders and have the right to know. If he can’t provide the evidence they can paint a different narrative than what reality is. Since Maker is a community owned and driven project, I’d argue that the transparency here is warranted. People should act professionally behind closed doors. There are also ways to professionally vent without calling holders and delegates various names. That just reeks of inexperience. I believe in our protocol, I believe in our community, and I think we can move past this like so many of the other crises in the past. That being said, action was taken and I agree with it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0801467051467055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dbkcan",
                    "index": "#53",
                    "likes": "2",
                    "time": "05/08/2022-21:13:49",
                    "content": "    welsh:  How can this be dealt with if not in public. This is one of the major costs of a DAO, that governance is handled in public. I   This could be dealt with in a closed-door meeting just as Maker has done before due to concerns about privacy and confidential information - much like some of the Collateral meetings that have been held to date - where attendance is by invitation. As far as I know, there is no rule in MakerDao, that every meeting must be public and open. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/9"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1484375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#54",
                    "likes": "2",
                    "time": "05/08/2022-21:41:18",
                    "content": "Great idea and a good lesson to takeway from this. Probably a virtual call (by invitation that anyone can also request an invite) to discuss this type of conflicts would be a great way to maintain conflict in the DAO and not expose this drama to the media… Without an HR department, we should as a community write a guide or playbook to deal with this situation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.833333333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Colin_F",
                    "index": "#55",
                    "likes": "0",
                    "time": "05/08/2022-21:43:53",
                    "content": "    GeorgeM:  we asked why since we are the holders and have the right to know   Didn’t know that. Could you share a link to the post please? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/welsh",
                    "index": "#56",
                    "likes": "1",
                    "time": "05/08/2022-22:05:19",
                    "content": "I don’t see how that works within the context of this situation (as @GeorgeM summarized above). This might be an option in the future before things get to this state, but when you have CU contributors being fired and then making a MIP to take budget from a group that they were fired from, I’m not sure how you avoid airing the dirty laundry to the world when you are asking all MKR holders to vote on the issue. ETA: Don’t want to minimize the damage this causes to the DAO and its contributors.  It may be that a whale/delegate only forum is the way to go, but that is a big change to DAO structure so should be a last resort IMHO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.392857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#57",
                    "likes": "2",
                    "time": "05/08/2022-23:49:32",
                    "content": "There’s no reason think that saying harsh things about people in private is correlated with low job performance. I’d guess it’s very common to complain if you think other people are doing a bad job or making your work more difficult. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.115625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#58",
                    "likes": "11",
                    "time": "06/08/2022-02:20:51",
                    "content": "    lyt:  I think it would be best for the DAO if both sides brought forth more pertinent hard info / evidence.   A general response: On this particular point, it would be important to know what the community and DAO wants to achieve. If that can be listed and agreed upon, I would bring in a professional NVC mediator and drive toward that outcome. In my experience, when conflicts occur and information is gathered from participating parties, it only shows that each played their own role and have responsibility for their actions. The data gathering tends to continue to polarize the bystanders. Until the community decides what it wants, we’ll be stuck in a counterproductive cycle. Let’s figure out what is needed, propose it, learn from it, and move on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.329545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#59",
                    "likes": "10",
                    "time": "06/08/2022-08:21:28",
                    "content": "    Hasu:  In my eyes, leaking private messages like that disqualifies you from leading any team in the future, RWF or not.   @Hasu cut the man some slack . This has been a hard time for many of us. The majority of our core contributors are far beyond their breaking points. I went on discord without autocorrect after being up days (might have actually been 100hrs awake tbh), stressing about the existential future of this project I and many others have invested years of their lives into. I even was argumentative with you that day! And that’s despite the two of us never having exchanged any words prior. I did my best to be respectful, attacking your ideas, not you (as best as I could), but I’m far from proud of how I handled that day. Can you really blame someone like @williamr  here for falling down the same rabbit holes of hopelessness and futility and reaching a breaking point? @williamr is a top-notch person. In the past, he has selflessly offered to help out with the smallest gestures, and I still hold him in high regard today. Under the circumstances ya…, maybe his delivery was not what would be tolerated on wall street, but this industry is filled with pioneers taking on untold personal risks with little to no guidance and meager pay… all sacrifices we make to be part of building a better future. We ALL cycle through very bad days… no one expects you to “own” all your wrongs the day of. Allow people some time to collect and process their thoughts. Nothing wrong with admitting later on… “hey, u know… while I do stand by my beliefs… my delivery was not okay, and apologies for my unprofessionalism. I will do better.” And then… go from there. We all got burned by CP, but none of that has to repeat. Just my rambles of six thoughts   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.756293402777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pcfreak30",
                    "index": "#60",
                    "likes": "5",
                    "time": "06/08/2022-10:22:17",
                    "content": "Hello, first I am not any token holder but I found this thread and as simple end user I feel I have to give my 2c. First I pretty much agree with @GeorgeM. There could be better ways to disclose some of this, but it needs to be public given it is about someones “work”. There is another term I think for this at times, whistleblower. Maker DAO is transitioning back to a corporation from my POV. It is already over 60% backed by USDC, and thus is not decentralized. To me, that makes me question WTF the DAO even exists for. A DAO is about decentralization and operating as a community. You can task certain people as being leaders for X, Y, or Z, but if you are going to try to bring in corporate culture and ideals of what is professionalism, you are going onto a slippery slope to just becoming what you are running away from. A related example is I found that uniswap is asking for 70M USD for 3 years to create a foundation. they are a decentralized trading protocol… The trend of DAO’s creating legal entities is not always bad, but it can very easily cause centralization and make the DAO null and void. It can also create a point of centralization/failure for goverments/censorship. While that is not the issue in this thread, it is all related to the mentality that to treat what you do in the DAO as a real job, you must act like its a corporation with all the BS culture and politics that can go with it, including having to walk on egg shells with anything you say. Sure you don’t want to act like an ass to anyone, but to do things decentralized, means to do it all openly. And decentralization can create human inefficiencies vs centralized economy of scale, but to be grass roots, you need that decentralization, else there is 0 point in having the DAO at all. This is a POV from a community user of the wider web3/crypto ecosystem. Kudos. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.56609977324263
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#61",
                    "likes": "6",
                    "time": "06/08/2022-12:34:45",
                    "content": "That seems like a decent plan. I can’t speak for the community, but for myself:  Business continuity, progressing with the deals we want to continue with Damage control for Maker’s reputation Making sure we don’t lose funds or investments here, which would likely include contacts and unique processes developed Minimizing opportunity costs  These are my personal top priorities. I think the wider governance needs to sit down and ask other tough questions shortly. Namely what kind of conduct can be accepted and when.Also, what kind of redundancies and checks and balances are probably needed to make decentralized RWF deals viable for the DAO in the long term, and how to avoid gatekeeping and single points of failure. These are not simple questions and will take time to get right. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.561067019400353
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pvl",
                    "index": "#62",
                    "likes": "9",
                    "time": "06/08/2022-12:43:03",
                    "content": "seems like MakerDAO needs some dispute resolution mechanism, which is badly missing as of now ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Colin_F",
                    "index": "#63",
                    "likes": "1",
                    "time": "06/08/2022-14:01:20",
                    "content": "Feels like the way to build a DAO is to form all CUs that can carry out the functions of a centralised organisation without having people proposing them, minus the parent organisation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#64",
                    "likes": "7",
                    "time": "06/08/2022-14:34:38",
                    "content": "    pcfreak30:  Maker DAO is transitioning back to a corporation from my POV.   We were briefly heading in that direction, but it seems like all is well now tbh. —- The truth is, MakerDAO is one of the most successful, longest-standing projects in the space. Of all the projects that have come and gone… we still stand! For the time being, we walk the line between profitable, breakeven, and operating at a small net loss. This far into a bear market? I can probably count on one hand how many protocols in our space come to even operatIng at beak even. Yes, Maker is undeniably one of the most successful projects in the space, even now. The trade-off? We’re governed by 4CHAN  … but all things considered, we keep it together pretty well! I find it hard to believe the rest of the world runs on some drastically different model than ours. 4chan governance is rampant on this planet. The only difference is that their lunacy is calculated and happens behind closed doors. It’s pretty incredible to see anything on this planet operational. as Jordan Peterson says: “It’s a miracle the lights stay on!!”   MakerDAO    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.05787037037037
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#65",
                    "likes": "6",
                    "time": "07/08/2022-06:23:28",
                    "content": "The Maker protocol is a ~10B DAI credit system, not a pub in North west London. Tokenholders did not put me in this position to be loved by the community or to be complacent with misbehaviour. They put me here to make the hard choices when those needed to be done, even when unpopular, so long as those choices were in the best of their interests or those of their stakeholders e.g. clients, delegates etc. This is a professional setting and needs to be regarded as such. The sample of activities related to REPEATED and regular misbehaviour was carried out during the performance of the contractors duties, not outside of it in a pub or other non professional setting. Should I had not shared a very small sample of the misbehaviour (I repeat this was a tiny sample of the documentation), I would have been accused of “hearsay”, “my feelings”, “I think” etc. Instead, the samples were a clear display from the primary source i.e. the contractors themselves. No one forced them to misbehave, repeatedly, in a professional setting. They did so at will. It was upon on me not to be complacent with it, defending hence the long term interest of tokenholders. Hard choices are not always popular. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#66",
                    "likes": "2",
                    "time": "07/08/2022-13:21:54",
                    "content": "Ok, so as far as business continuity and conflict resolution what are you going to do moving forward? I hope you’re not going to say business as usual given the way things played out and might continue to play out if nothing changes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BananaSoap",
                    "index": "#67",
                    "likes": "3",
                    "time": "07/08/2022-15:14:37",
                    "content": "    pcfreak30:  First I pretty much agree with @GeorgeM. There could be better ways to disclose some of this, but it needs to be public given it is about someones “work”. There is another term I think for this at times, whistleblower. Maker DAO is transitioning back to a corporation from my POV. It is already over 60% backed by USDC, and thus is not decentralized. To me, that makes me question WTF the DAO even exists for.   I disagree. The ‘whistleblower’ was the manager who has used his ability to terminate workers at will. Whistleblowing in organizations is necessary as a safety check to go around hierarchy, when there is hierarchy stopping action. What hierarchy is there to go around when the leaker is the person at the top of the business unit? You do not need to coddle somebody who has accepted a position of responsibility.     williamr:  Why did I not let them go at that time you might ask? The operational risk to the DAO was deemed too high as some key onboarding initiatives were close to being finalised, i.e. SocGen and HVB.   The manager has had plenty of opportunities to witness these comments, react to them or take action privately. Apparently he has decided that business needs justified perceived misbehavior. I also dont agree on this perception but that is another point.     williamr:  Tokenholders did not put me in this position to be loved by the community or to be complacent with misbehaviour.       williamr:  I would have been accused of “hearsay”, “my feelings”, “I think” etc.   I dont understand this thought. If the manager had fired workers and forum posters had accused the manager of being unfair, I dont think the correct response is to leak private conversations. By his own story the manager is not expecting to make friends or be loved with the community. So why sell-out the team to avoid being unpopular? On top of it his last message it sounds like he is threatening to share more. No organization would tolerate something like this. It also does not look like it has worked. My opinion is that  if williamr thought his team was not suitable for him which is fair and can happen, he should have hired a new team. Why didn’t he do this? if he spotted things he thought were wrong behavior he should have tried to stop it. why did he not react to try to stop it? If he thought business was more important than stopping what he thought was wrong behavior, he should have benchmarks for what size of business potential can excuse a particular level of behavior. Could he share those benchmarks? If he feels that he cannot manage an internal dissagreement with his team he should still not have sold out his team like that. What will it say about the quality of new team members if they accept working with the same kind of threat when they get hired? If he feels that he needs constant approval from forum posters to do his job, the forum posters should be the ones doing the job and his position is unnecessary      aburban90:  @Hasu cut the man some slack . This has been a hard time for many of us. The majority of our core contributors are far beyond their breaking points.   People who are not workign for the DAO probably will not see this so clearly. williamr is a business unit manager. if he is not able to meet the demands of managing a business unit team he should not accept to be the bussiness unit manager. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.634400826446281
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#68",
                    "likes": "15",
                    "time": "07/08/2022-15:41:45",
                    "content": "Dear community, I had planned not to get involved for my own sake, but I cannot stand still and observe the public shaming of the community against targets that are not in a position to defend themselves. Anonymous public shaming, in addition, resides for me pretty much at the very bottom of the ethical pyramid. If Dante Alighieri would have lived in the 21st century, I am sure he would have reserved a very specific circle for anon public shaming professionals at the very bottom of his inferno. As an incubated facilitator of a Lending Oversight Core Unit - ultimately not voted in, I have been heavily involved with the team over the last many months and have been part of the channel where those conversations happened. I will abstain to comment the portions of the conversations shared because it is absolutely not my style nor professional habit to comment private information that have been shared without consent. Those conversations happened in private chat rooms (not in formal communication channels of the DAO) and, given the context they happened in, I personally didn’t feel the absolute urgency to break respect and professionalism in order to leak them to a broader audience. The facilitator @williamr didn’t feel either at the time. I do not endorse this quality of language, at all, but I am humble enough to recognise my own mistakes and the awkward position I would be in if 100% of my private conversations about business would be leaked in public. Surely, I am not alone. I would like, however, to ask the following questions to @williamr:  Why has the facilitator decided to keep confidential those most severe misbehaviours for several weeks or months?  How has the facilitator felt comfortable in letting those misbehaving actors deal with extremely important counterparties over those many weeks? It is my direct experience (I am sure this can be confirmed by the prospective borrowers as well as other CU members) that the facilitator has rarely participated to those meetings due to personal reasons - his behaviour hardly qualifies as micro-management  Why has the facilitator not opted for sharing those extremely severe allegations in public ahead or contextually to the termination of those individuals? Or, more in general, has there been any structured process to raise->discuss->debate->ossify any remark with the individuals or with the group as a whole?  What is the plan of the facilitator to a) bring to conclusion, and b) continue the monitoring, of those extremely strategic exposures given that no team is currently in place and those individuals (especially our legal advisor @christiancdpetersen) are in possession of exclusive, material, non-public information?  I have numerous inputs to provide about the performance of the CU members (namely @christiancdpetersen, @Eumenes, @teej) as well as the facilitator @williamr. Some of those remarks had been already shared privately with members of the community, including delegates, in due course. They were shared under confidentiality and this confidentiality has been respected. Those people know that the tensions within the CU do not come as a surprise, although the modality those have been shared do. As @Juan mentioned in a separate thread, as part of the incubator’s job description was the drafting of a first audit report for the RWF CU. I have mentioned this before this situation escalated. I am committed to provide this report but, given that I have no MKR official endorsement, my sensitivity about the situation, and the already heated context of the LOVE vote, the report will be shared with @SES-Core-Unit and I will leave them the freedom to do of this information what they please. Those comments represent my opinions solely as a member of the community and do not constitute advice of any type. I would truly appreciate if the community wouldn’t drag me as well into this quarrel. And I am available to reply to any question over one of the next G&R calls. However, I will not reply to any question on this forum as I strongly disagree with the modality of this process. Regards, Luca ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.558743169398907
                },
                {
                    "author_link": "https://forum.makerdao.com/u/decentralized",
                    "index": "#69",
                    "likes": "0",
                    "time": "07/08/2022-15:57:42",
                    "content": "Wow - what leadership skills. You whistleblowed on your own employees … as opposed to managing the situation as a leader would do. A great example of exemplry leadership., which raises the question as to who is responsible for accepting an outstanding people leader as yourself to lead a CU with a budget of $7mm dollars … NOT I would recommend the best course of action is for you to man up and resign, before us MKR token hodlers proceed to offboard you … why?   You selflessly choose to defend yourself, by publishing private confidential information to justify the firing of employees at the cost of smearing the reputation of the DAO …   You dont provide any evidence that u warned these people through official messaging or email correspondence that they should stop this behavior or u made any attempts to remedy this - for all I know if we saw the complete threads - maybe u were promoting this behaviour? A prof manager/leader/facilitator would have done this …   U dont provide any evidence, except your word - that external parties complained   Seems to me u only fired these people when they questioned ur leadership and chose to ask the community to onboard a new unit due to ur inability to lead and manage the RWF CU.   Seems like as u had no evidence as a professional leader/faciltitor, as u had no better evidence to demonstrate that ur firing is justified - instead u decide to find snippets of private discussions that would justify ur decision - for all we know u photoshopped this information …   The best course of action is for u to be offboarded or save the trouble and RESIGN.   what world are u living in that u think any potential new employees are going to work for a unit u lead ?   lets recognize that the employees u fired would have an easy case to hire and continue RWF notwithstanding ur mudslinging. As everyone knows that they are the people who completed innovative real world deals and not u .   Actually - hoping that they will be smart enough to sue u for defamation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.990576951783848
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Katie",
                    "index": "#70",
                    "likes": "7",
                    "time": "07/08/2022-18:11:07",
                    "content": "t’s heartbreaking to see what Maker has become.  Let’s please get back to being a high performing protocol and organization.  This is sad. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Colin_F",
                    "index": "#71",
                    "likes": "0",
                    "time": "07/08/2022-19:24:11",
                    "content": "Bloody hell… the level of self-plugging is painful to watch. Do yourself and everyone else a favour and move on. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#72",
                    "likes": "5",
                    "time": "07/08/2022-22:41:13",
                    "content": "    BananaSoap:  People who are not workign for the DAO probably will not see this so clearly. williamr is a business unit manager. if he is not able to meet the demands of managing a business unit team he should not accept to be the bussiness unit manager   @BananaSoap, I completely agree with you. As facilitators, we’re really meant to be held to a higher standard of conduct. How I acted, how @williamr handled this… it’s not professional. Especially for a very front-facing team like business integrations with the “real world.” That said… I really invite you, or anyone, to try to find talented people insane enough to accept the completely uncharted territories of legal risks associated with being a facilitator. It’s a complete grey zone. A few years down, will some three-letter agency come knocking on our doors?  You have to have at least a few loose screws to take on that kind of role. The RR isn’t exactly there. The “professional” candidate you’re looking for… he/she can go get a 6-7 figure comp in the traditional world, avoid all the risks, and sleep well at night. From my interactions w/ @williamr in the past, he is a great, well-intentioned guy with integrity and competence. That doesn’t necessarily excuse his conduct here, but does it warrant blacklisting him? Personally, no matter how egregious someone’s behavior was, I prefer to give everyone a chance before placing them on the blacklist. Pretty much everyone deserves a chance to reflect on their actions, own what they did, admit where they were wrong, apologize, and course correct for the future. Refusal to admit wrongdoings and own mistakes? On to the blacklist u go! (You’d think it’s a gameable filter, but I’m always surprised to see how many just refuse to accept any kind of blame. Content Production is a prime example.) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4838440692099235
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Colin_F",
                    "index": "#73",
                    "likes": "1",
                    "time": "08/08/2022-12:04:50",
                    "content": "    aburban90:  Pretty much everyone deserves a chance to reflect on their actions, own what they did, admit where they were wrong, apologize, and course correct for the future.   This, so much this. Thank you @aburban90 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#74",
                    "likes": "9",
                    "time": "08/08/2022-13:16:59",
                    "content": "    aburban90:  Personally, no matter how egregious someone’s behavior was, I prefer to give everyone a chance before placing them on the blacklist. Pretty much everyone deserves a chance to reflect on their actions, own what they did, admit where they were wrong, apologize, and course correct for the future   Thank you. In all honesty I don’t get the kind of blood lust I see in this thread from time to time. My questions are: How does the CU plan to continue operations with minimum damage to the DAO and its partners? How will all involved handle the strife like adults with a common goal? How will we make sure this doesn’t lead to wider contagion by straining the entire workforce further? I want to look ahead and see a clear path here. What makes an organization great is not the ability to avoid mistakes, but what it does when they inevitably occur. How fast it gets up, dusts itself off and comes back stronger, leaner and with renewed purpose and poise. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.765625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Thetistyx",
                    "index": "#75",
                    "likes": "0",
                    "time": "11/08/2022-06:13:04",
                    "content": "Hmmm interesting problem. TradFi regulators require all business correspondence when they want to get to the bottom of professional conduct. In the same vein do MKR token holders have the right to see all communications on Maker messaging servers? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.107142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#76",
                    "likes": "0",
                    "time": "09/11/2022-06:13:14",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}