{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/if-your-core-unit-is-going-to-be-legendary-you-better-have-an-edge/7917",
            "title": "If Your Core Unit Is Going To Be Legendary, You Better Have An Edge ",
            "index": 7917,
            "category": [
                "Core Units"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "4",
                    "time": "08/05/2021-18:55:07",
                    "content": "If my favorite Thought Leader could write the Maker Community a letter: “To win in business you need to do more than to play the game well. You need the edge. So how do you get the edge? You remain on constant alert. You continuously learn from your experiences as well as others, so you can make your business win no matter how fluid the situation gets. The edge is about shaping things by taking the initiative rather than being a reactor. And it’s about keeping your offense on the field as much as you can while forcing your competition to play defense, always. When you have the edge you realize that the business you’re in, is not just about you and your team and the rules and how they are defined today. It’s about the competition around you and your determination to win. In our conversation, Marc Cuban describes this as kicking your own ass. So how do you kick your own ass to sharpen your edge? There are many ways but 3 stand out in particular. The first is Will. Will power involves two things. The first is the willingness to prepare. And the second is the grit to see things thru. Marc Cuban said that legendary Indiana basketball Coach Bobby Knight once told him, “lots of people have the desire to win, maybe even the will to win. But very few people have the will to prepare to win.” You can’t just will your way to victory without having a plan that plays to your strength and your competitors weaknesses. Having the will to prepare to win means having clear goals. It also means getting real about identifying obstacles and problems that stand in your way. Which leads to the second key part of the edge. Focus. In any startup or any business, there’s a battle being fought that above all battles, is the one you must win. The one that maters more that all the others. As the leader you must make sure you know which battle this is and that you focus on winning it above all other things. As a leader you should only be focus on how to fight this one battle that comes to your Core Units. If there’s other battles that matter too, delegate. And Even then, Mark Cuban said to have a single leader for every battle. Someone who can bring the same level of maniacal focus and intensity. Which brings me to the third part of the Edge, constant competitor awareness. In our discussion Mark emphasized that you always want to think how a giant competitor can put you out of business. If your as a reader of this post and are leading a Core Unit right now and you don’t have an answer to this question, you’re subjecting your Core Unit to unacceptable risk. It’s easy in the early days to think that our product (DAI) is great before we have competition gunning for us. But we shall always ask, “how can a company enter our Market and crush us?” —Mike Maples, Jr. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.483809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "11/05/2021-15:52:23",
                    "content": "\" Stay on the cutting edge. Once you’ve gained a competitive advantage, your work is far from complete. To be successful, you will need to continuously maintain your competitive advantage. After all, your competitors are not going to sit back and allow you to steal their market share.\" Great write-up here from 2015 based on Michael Porter’s book on Competitive Advantage:   linkedin.com    How to Gain a Competitive Advantage in Business To have a competitive advantage, you must create an edge over your competitors. In the aggressive business world, especially in today’s economy, every advantage counts to establish your business in the top of your industry.      ",
                    "links": [
                        "https://www.linkedin.com/pulse/how-gain-competitive-advantage-business-bugra-goncaloglu/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.03125
                }
            ]
        }
    ]
}