{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip41c4-sp13-facilitator-onboarding-oracles-core-unit/8046",
            "title": "MIP41c4-SP13: Facilitator Onboarding, Oracles Core Unit ",
            "index": 8046,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "rfc",
                "core-unit",
                "mip-set",
                "ora-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#1",
                    "likes": "18",
                    "time": "13/05/2021-01:01:44",
                    "content": " MIP41c4-SP13: Facilitator Onboarding, Oracles Core Unit  Preamble MIP41c4-SP#: 13 Author(s): Niklas Kunkel Contributors: N/A Status: Accepted Date Applied: 2021-05-12 Date Ratified: 2021-06-28   Sentence Summary Onboards Niklas Kunkel as the Facilitator of the Oracle Core Unit.  Paragraph Summary The Oracle Core Unit (OCU) is responsible for developing and administrating the Oracle Protocol. Oracles are a critical component of securing the Maker Protocol to ensure positions are sufficiently collateralized. The OCU is essential to ensure the Oracles can adapt rapidly to scale the Maker Protocol in a responsible manner. A key focus of the OCU is to monetize the Oracle Protocol and build out a business around it. This enables the DAO to subsidize its own Oracle expenditures, and ultimately turn Oracles from a cost-center into a profit-generating arm of MakerDAO. Real World Assets (RWA) in particular, are a highly promising vertical the business side of the Oracle is targeting.  Specification  Core Unit Name Oracles Core Unit  Motivation Having started on my MakerDAO journey working for the DAO and then later the Maker Foundation, it brings me great joy to say I’m returning to the DAO. It’s incredible to see how far the Maker Protocol, Dai, and in particular the DAO has come. Our shared values of a: decentralized, censorship-resistant, transparent, and open stablecoin, governed by a community, have led us to where we are today. And they will lead us further still into the future, as MakerDAO takes the next step in its evolution. I’m excited to contribute to that vision, to secure the protocol, to innovate, and help guide the Maker Protocol forward as it begins the herculean task of disrupting the traditional financial sector.  Facilitator Name and Information Name: Niklas Kunkel Forum:@NikKunkel R/C: @Nik ETH Address: TBD  Facilitator Commitment In addition to the Core Unit Mandate as outlined in the Oracle Core Unit MIP39, the following describes my commitment and actions as the Oracle Core Unit Facilitator, to; Serve as a liason between the Oracle Core Unit, the Governance community and other core unit facilitators to ensure a cohesive understanding of team deliverables and progress. Represent the Oracle Core Unit in weekly community calls, the Maker Forum, Rocket.Chat, and Oracle Core Unit Discord. Communicate continuously with the community and core unit facilitators to ensure transparency and big picture alignment. Responsibly scale out the Oracle Core Unit to fulfill its mandate, while constantly reviewing and revamping internal processes that buckle. Collaborate with other core units and be flexible enough to sacrifice short-term core unit goals for the greater good of the Maker Protocol. Ensure knowledge-sharing is part of the DNA of the Oracle Core Unit to minimize bus factor and diminish the effects of the asynchronous communication barrier experienced by multi-timezone remote organizations. Foster a working environment within the Oracle Core Unit built on mutual trust, respect, and integrity. Carefully observe the changing landscape in the ecosystem to adapt product direction and strategy.  Facilitator Credentails Experience At Maker Joined MakerDAO in January of 2017 Positions:  Lead the Backend Services Team at the Maker Foundation Lead the Oracle Domain Team since its inception  Achievements:  Architected DS-Proxy, a widely used industry standard with over 600,000 deployed instances. Co-developed MatchingMarket (now Oasis Trade) which was the first DEX with on-chain order matching. Created an API for MatchingMarket (now Oasis Trade) Contributed to developing Sai the precursor to MCD Developed a market-making bot for Dai Architected the Oracle Protocol used in MCD Created MIP10 governance processes for administrating the Oracle Protocol Added support for new collateral types to the Oracle Protocol Planned and Executed Feed Migrations to update the Oracle Protocol Wrote the Collateral Onboarding Oracle Assessments on behalf of the Oracle Domain Team Architected the prototype of the Keg payments module Architected the Uniswap LP Oracle Organized and Oversaw audits on behalf of the Oracle Domain Team Have spoken at over two dozen conferences, universities, and enterprises on behalf of the Maker Foundation including Devcon, ETH Denver, UC Berkeley, Stanford, MIT, and UC Santa Barbara.  Experience Prior to Maker IBM  Kernel Developer for TPF, a System Z Mainframe Operating System, which processes the majority of global credit card transactions and airline/hotel reservations Architected the blockchain (HyperLedger Fabric) component of a supply chain finance application which was presented at LinuxCon 2016  Synopsys  Optimized hardware place & route formal verification tool (Formality Ultra) to decrease run-time by 21%   Related Documents MIP39c2-SP12 Oracles Core Unit MIP MIP40c2-SP12 Oracles Core Unit Budget Proposal Oracle Core Unit Launch Pad Session ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-sp12-adding-oracles-core-unit/8048",
                        "https://forum.makerdao.com/t/mip40c3-sp15-modify-oracles-core-unit-budget/8047",
                        "https://www.youtube.com/watch?v=niWT5wk2MNo",
                        "https://forum.makerdao.com/t/weekly-mips-update-41/8892",
                        "https://forum.makerdao.com/t/weekly-mips-update-40/8759",
                        "https://forum.makerdao.com/t/maker-relay-ep-46/8312",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-11-oracles-core-unit-ora-001/8415",
                        "https://forum.makerdao.com/t/mip39c2-sp13-adding-oracles-core-unit/8048",
                        "https://forum.makerdao.com/t/maker-relay-ep-46-en-espanol/8358",
                        "https://forum.makerdao.com/t/weekly-mips-update-37/8309",
                        "https://forum.makerdao.com/t/maker-relay-ep-45-en-espanol/8141",
                        "https://forum.makerdao.com/t/maker-relay-ep-45/8127",
                        "https://forum.makerdao.com/t/mip40c3-sp75-modify-oracles-core-unit-budget-ora-001/16397",
                        "https://forum.makerdao.com/t/weekly-mips-update-42/9010"
                    ],
                    "GPT-summary": "The post is a proposal for onboarding Niklas Kunkel as the Facilitator of the Oracle Core Unit. The proposal explains the responsibilities of the Oracle Core Unit and the motivation behind the proposal. The author also outlines their commitment and credentials for the role. The post does not ask for feedback or advertise the proposal, but a 3rd party could extend to or collaborate on the proposal.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Community and engagement",
                        "Board composition",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.80496632996633
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#2",
                    "likes": "13",
                    "time": "13/05/2021-02:17:16",
                    "content": "I’m confident in saying that there’s no one on the planet more qualified to run this CU than Nik. He’ll get the job done. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#3",
                    "likes": "4",
                    "time": "08/06/2021-22:44:35",
                    "content": "I am moving this MIP to Formal Submission. @charlesstlouis @Davidutro @blimpa ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}