{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/governance-at-a-glance-march-26-april-1-2021-now-forum-at-a-glance/7276",
            "title": "Governance at a Glance: March 26 - April. 1, 2021 - *Now Forum at a Glance!* ",
            "index": 7276,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "gov-at-a-glance",
                "forum-at-a-glance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "7",
                    "time": "01/04/2021-15:13:00",
                    "content": "Forum at a Glance! The one stop shop for finding out what’s being discussed by governance right now. Links reflect my view of the most noteworthy activity in the governance, risk and oracles categories right now. Disagree? Think something should be added? Leave a reply or a pm. Three Point Summary ‘What do I need to know as an MKR Holder this week?’  Total DAI supply above 3B!   The Surplus Buffer will cross 20M DAI for the first time today Weekly VWAP for DAI down to $1.001   ICYMI - Announcements ‘All I know is someone said something important…’   @SebVentures and the Real-World Finance Team published an article on (Crypto) Banking 101   Catch up on the MKR Compensation conversation and consider joining the newly announced working group!   Active Discussions ‘What’s going on? You think what?! You’re 100% wrong, and here’s why…’ Core Unit Mandate Overlap - @Planet_X points to overlap within Core Unit mandates, inviting community discussion on the process of decentralization. Business strategy and evaluation framework for Business-like Core Units - @SebVentures builds on the above thread and invites conversation on how Core Units can be evaluated.  Seeking Consensus ‘Yo, do you even signal?’ [Signal Request] Petition Letter to A16z - Voting Ends Soon! Following a previous discussion, @iammeeoh is looking to gather consensus around a petition for a16z to get involved in governance.  Ongoing Initiatives ‘Oh my god, this is taking ages, why can’t things be simple?’  Collateral Calls - Calling all Projects!  @juan sets up a signup thread for projects wishing to present on the bi-weekly collateral call. Know any potential collateral partners that want to present? Refer them here. Collateral Status Index - Confused about the current status of the various collateral types that have been discussed recently? Check out this post to find out the status and current position of each within the onboarding process. Weekly MIPs Updates - @Davidutro and @charlesstlouis bring the latest updates in the world of MIPs. MakerDAO Standard Governance Processes - @LongForWisdom writes a brief overview of the currently operating governance processes in the Maker community. Confused between Signals, Declarations and MIPs? Look no further. The Official Welcome Thread - A welcome and introductions thread. Not strictly speaking governance, but if anyone new or old wants to introduce themselves, now is your chance!  Help Wanted ‘Oh %#$?, we need a doodad, and we need it now.’ Wanted: Risk Domain Monitoring Tools  - @Primoz puts out a call for additional support to produce monitoring tools for the risk team. Grants are available. Wanted: Join the Summary Team - @Davidutro asks for anyone interested in producing call summaries get in touch. Grants available. We could always use help reviewing MIPs in the Request for Comment phase ",
                    "links": [
                        "https://forum.makerdao.com/t/framing-a-framework-for-mkr-compensation-wednesday-march-31-17-00-utc/7200",
                        "https://forum.makerdao.com/latest",
                        "https://forum.makerdao.com/t/core-unit-mandate-overlap/7210",
                        "https://forum.makerdao.com/t/business-strategy-and-evaluation-framework-for-business-like-core-units/7218",
                        "https://forum.makerdao.com/tag/active-signal",
                        "https://forum.makerdao.com/t/signal-request-petition-letter-to-a16z/7181",
                        "https://forum.makerdao.com/t/proposal-petition-letter-to-a16z/7025",
                        "https://forum.makerdao.com/t/governance-initiatives/1347",
                        "https://forum.makerdao.com/t/collateral-calls-calling-all-projects/3715",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/tag/mips-update",
                        "https://forum.makerdao.com/t/makerdao-standard-governance-processes/4298",
                        "https://forum.makerdao.com/t/the-official-welcome-thread/771/4",
                        "https://forum.makerdao.com/c/comm-dev/help-wanted",
                        "https://forum.makerdao.com/t/wanted-risk-domain-monitoring-tools/4168",
                        "https://forum.makerdao.com/t/wanted-join-the-summary-team/4318",
                        "https://forum.makerdao.com/tag/rfc",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-135-thursday-april-1-17-00-utc/7206/5",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/24",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-135-thursday-april-1-17-00-utc/7206/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.451264576264576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "08/04/2021-15:13:16",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}