{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/reseach-paper-the-crypto-banking-system/16862",
            "title": "Reseach Paper - The Crypto Banking System ",
            "index": 16862,
            "category": [
                "Resources",
                "Research"
            ],
            "tags": [
                "research",
                "alm",
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "22",
                    "time": "27/07/2022-20:25:02",
                    "content": "I’m publishing a work done during my free time but related to MakerDAO. The idea is to trigger thought and discussion from the community. The Crypto Banking System original post – This article dives into the foundations that are needed to build a financial system on top of decentralized finance (DeFi). While there is an explosion of innovation in DeFi, most of it is used for circular speculation. We focus here on the needed components to create a useful financial system to finance the real economy. The chart below, based on the work of Zoltan for the Shadow Banking System, provide an high level overview of the Crypto Banking System. It is also an extension to the work done in Crypto Banking 101 and Crypto-banking vs shadow banking. On the right, we have ultimate lenders (households with excess savings, financial institutions, sovereign wealth funds, …), agents with excess cash that could be used (for a cost, the interest rate) to finance ultimate borrowers (households with a mortgage, small and medium enterprises, big corporations, governments) on the left.  As you can see in the chart, while native crypto-assets (think ETH, BTC, …) are in the legend, they appear nowhere. It is by no means complete and further work will analyze the place of crypto-assets. You can also consider Cash being a crypto-currency and, assuming real-world assets are using the same unit of account, it would work the same. As we will see, the keys components of the Crypto Banking System are the followings:   creation of deeply liquid tokenized bonds representing real-world credit (private credit and public markets).  core infrastructure of a market-based economy with decentralized exchanges and repo markets, the crypto market. intermediation of saving and lending with crypto-banks that operate in maturity transformation.   The need for new primitives DeFi being build on a trustless basis, most lending is against a collateral. The key component of a good collateral is deep liquidity. One should be able to liquidate in size and quickly without affecting the price too much. The main collaterals used in DeFi currently are ETH and WBTC. Both are highly volatile (hence asking for a high haircut), quite limited in supply, and are speculative. They might well be the collateral of the future but, currently, they are not convenient. Therefore, we need to introduce a new type of collateral. Gold could be an example, it is already tokenized (PAXG) but it didn’t get much traction. If we look at TradFi, the collateral of choice migrated from mercantile bills to government bonds.  Public credit tokenization The first area to source a liquid collateral is to onboard public markets on-chain. Corporates are issuing bond that are traded and rated by credit rating agencies. Governments issues bonds as well that are highly liquid and rated. Contrary to crypto-assets, those asset are more stable meaning more efficiency for collateral usage. In TradFi those instrument are considered safe and liquid enough to be included in High Quality Liquid Assets. Public market tokenization would simply have some public securities on the asset side and issue token (with probably 1:1 relationship). To achieve greater liquidity securities of the same kind can be pooled or ETFs can be onboarded directly (until the underlying are on-chain and can be pooled on-chain).  One example is Backed Finance that is working with MakerDAO to tokenize the iShares $ Treasury Bond 1–3yr UCITS ETF.  Private credit tokenization If we stay at the public credit stage, there would be plenty to use as collateral for a few years, but this isn’t creating a better system as it would exclude households and small and medium enterprises (SME) from funding. The solution lies in securitization in which an intermediary pool those illiquid assets (loans are not tradable) and issue two class of tokens, a senior piece and a junior piece. The credit enhancement of the junior tranche provide safety and easier price discovery for the senior tranche as well as force the intermediary to have “skin in the game”. Ideally this senior piece would have to be rated by credit rating agencies. The pooling should also be big enough and transparent enough to encourage a strong liquid market for the senior part.  Two examples of such tokenization are New Silver, which is in the fix-and-flip loan business (technically not for households yet) and FortunaFi which is in the revenue-based finance space aggregating loans from many asset originators.  Scale and liquidity trumps everything One key point, both on the public part and the private one, is to target such a scale that a liquid market forms. Fragmentation of liquidity is to be avoided. As a first data point, during March 2020, bonds ETF have shown to be way more liquid that their underlying as showed in the chart below. Some research also suggest that such pooling reduce the impact of fire sales.  Pricing and Liquidity of Fixed Income ETFs in the Covid-19 Crisis of 2020 One issue during the GFC is that illiquid securitization was used as collateral, sometimes without a haircut. When the crisis got serious, higher haircut were applied or such collateral just excluded from repo markets.  See Securitized Banking and the Run on Repo It is therefore of paramount importance to have a few of very liquid and very transparent instrument to support the crypto-banking system instead of an endless list of less liquid, harder to understand instruments. Not displayed in the Crypto-Banking System are the bonds issued by on-chain protocols and DAOs, either secured by crypto-collateral or not (see the Capital Structure for DAOs article). Pooling those will indeed allow the creation of another liquid and transparent bond instrument. With those deep and liquid primitives, we would be able to construct a sounds crypto-market.  The crypto-market At the heart of the Crypto-Banking System, lies the crypto-market which provide deeps pools of liquidity (both for trading and short-term funding).  The crypto-market composed of decentralized exchanges and money markets (click to enlarge) The crypto-market itself is composed by two sub-markets, one for trading (decentralized exchanges or Dex), and one for short-term funding (money market). Both of those markets should be governance-minimized and to the best extend possible immutable contracts. It should be trustless, permissionless and non-custodial. There are three kinds of operators of the crypto-market: the value investors, the speculators and the arbitragers. The whole stability of the system is provided by value investors. Those can be individual, DeFi institution (like cryptobank or insurance protocol) or TradFi investors. For simplicity, let’s assume they allocate their assets to a predefined asset allocation (e.g. 50% Cash, 50% Bonds). They will deposit some of those assets into a decentralized exchange to passively let the market arbitrage their position to keep the exposure constant. They will also get trading fees on top (contrary to TradFi where keeping a constant allocation is a service for a fee). They would also be able to deposit their unused liquidity and some bonds into money markets to let other actors borrow them for a fee (again improving value investors returns while TradFi custody is at a cost). Arbitragers (hedged dealer books) are here to provide efficient markets by providing more liquidity for small spread. If the price for a investment grade bond move significantly, they can borrow some in the money market swap it for some treasury bond of similar maturity (to hedge their interest risk) and some higher credit risk bonds (to hedge their credit risk). Those bonds will be used as collateral on the money market to finance their borrowing of bonds. Those arbitragers will also be able to provide liquidity on options protocols and provide an orderly market for on-chain ETF (by arbitraging the ETF price with the underlying). Finally, the speculators will be actors willing to take more risk (non-hedged) than arbitragers when a speculative profit opportunity arise by being long one asset and short another. An example is to be long treasury bonds and refinancing those position on the money market to get leverage when an speculator think the yield curve is too steep (or the reverse just as well) . By speculating, they provide a price discovery mechanism and try to achieve efficient markets. By centralizing (pun intended) the liquidity to those crypto-markets instead of sitting idly in wallets, the Crypto-Banking System can achieve more fluidity, at a lower cost and lower complexity, than traditional markets. The Bond primitive was already designed to be highly liquid by being an aggregation of lower liquidity instruments (i.e. corporate bonds and mortgages), the crypto markets are providing a way to use most of the market cap of those primitives as trading liquidity or funding facilitators (and nothing prevents Dex to use Money Markets in the background for their liquidity). To add even more efficiency, we need to add a new player, the cryptobanks.  Towards fractional-reserve crypto-banks As defined currently, the Crypto-Banking System is composed of Bonds instruments and Cash instruments. We have seen that Bonds are composed on tokenized pooled private credit and public markets instruments. But what is Cash?  Defining Cash in the Crypto Banking System In a simplified version, fiat-backed stablecoins are simply $1 on-demand liabilities backed by Treasury bills (or bank deposits). Such a backing allows stablecoins to be redeemed at any time (on-demand) without any liquidity issue. Currently the spread between those two (which is the t-bill rate) goes fully to the stablecoin issuer (or distributors), nothing goes to the stablecoin holder. That is probably going to change but, by construction, the interest rate given to stablecoin holders will be limited by the t-bill rate.  At scale such a system might be adverse for credit intermediation. Indeed, if stablecoins are the new bank deposits, it will reduce the scale of the latter and diminish credit creation by traditional banks. This is where cryptobanks are coming into play.  Solving the liquidity preference and expanding the money supply There is a fundamental mismatch between ultimate borrowers that need to borrow long term and ultimate lender who have a liquidity preference. As you can see below, most ultimate lenders are holding cash, possibly large amount of it. While it is unlikely to get a shortage of state deficits, it would not allow to finance economic activities enough and cause economics limitations.  To solve this problem, fractional-reserve banking was introduced as a way to extend the supply of cash based on long-term lending (see my article How Money Works). As depicted in the chart below, a small amount of fiat-backed stablecoin can be expanded to a larger amount with fractional-reserve banking thanks to an intermediary, the cryptobank. The cryptobank issue a stablecoin considered money-like by creditor as convertibility to a fiat-backed one (the reserve) is possible. But, and that’s the catch, there is not enough reserves for redeem all stablecoins at one. History shows that it leads to bank run when trust is reduced but that the banking system can operate for many years without runs on the banking system, even in recessions. You can also check the article Crypto-banking 101 for more details.  Money creation in the Crypto-Banking System Crypto-banking is neither traditional banking (bank holding illiquid loans), nor market-based banking (no maturity transformation there), nor shadow banking (illusion of market-based maturity transformation). Crypto-banks hold highly liquid assets as a mean of defense against bank runs.  Conclusion As we have seen, creating a robust crypto financial system requires three components: tokenized real-world credit (Bonds), robust crypto markets, trading and lending (to provide deep liquidity and price discovery) and crypto-banks to provide maturity transformation. At the time of writing, crypto markets are still imperfect but working (Uniswap for lending and Aave as a money market). Yet, we are critically missing the Bonds part. Rails are there, but they are mainly used for speculation. Crypto-banks like MakerDAO are already integrating with money markets with tools like the D3M. MakerDAO is also helping creating the Bonds primitives both on the private credit side with Centrifuge than of the public market side with Backed and the proposal to onboard up to 1 billion $ of short-term bonds. We have never been so close to get a robust Crypto Banking System. ",
                    "links": [
                        "https://www.newyorkfed.org/research/epr/2013/0713adri.html",
                        "https://cryptobanking.network/crypto-banking-101/",
                        "https://cryptobanking.network/crypto-banking-differences-with-traditional-and-shadow-banking/",
                        "https://cryptobanking.network/wp-content/uploads/2022/07/crypto-banking-system.png",
                        "https://www.coingecko.com/en/coins/pax-gold",
                        "https://www.bis.org/basel_framework/chapter/LCR/30.htm?tldate=20191231&inforce=20191215",
                        "https://cryptobanking.network/wp-content/uploads/2022/07/image-59.png",
                        "https://backed.fi/",
                        "https://forum.makerdao.com/t/mip-6-declaration-of-intent-invest-in-short-term-bonds-proposal-for-implementation/16185/1",
                        "https://makerdao.com/",
                        "https://www.ishares.com/uk/individual/en/products/287340/ishares-treasury-bond-1-3yr-ucits-etf",
                        "https://ecgi.global/sites/default/files/working_papers/documents/finalkrahnenwilde.pdf",
                        "https://cryptobanking.network/wp-content/uploads/2022/07/image-60.png",
                        "https://newsilver.com/",
                        "https://www.fortunafi.com/",
                        "https://www.bis.org/publ/work975.htm",
                        "https://cryptobanking.network/wp-content/uploads/2022/07/image-61.png",
                        "https://cryptobanking.network/wp-content/uploads/2022/07/image-62.png",
                        "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1440752",
                        "https://cryptobanking.network/capital-structures-for-daos-in-defi/",
                        "https://cryptobanking.network/wp-content/uploads/2022/07/image-64.png",
                        "https://www.blackrock.com/us/individual/products/239756/ishares-growth-allocation-etf",
                        "https://www.federalreserve.gov/econres/ifdp/files/ifdp1334.pdf",
                        "https://en.wikipedia.org/wiki/Liquidity_preference",
                        "https://cryptobanking.network/wp-content/uploads/2022/07/image-66.png",
                        "https://cryptobanking.network/how-money-work/",
                        "https://research.stlouisfed.org/publications/review/1989/05/01/bank-runs-and-private-remedies",
                        "https://cryptobanking.network/crypto-banking-101/",
                        "https://cryptobanking.network/wp-content/uploads/2022/07/image-67.png",
                        "https://uniswap.org/",
                        "https://aave.com/",
                        "https://makerdao.com/",
                        "https://forum.makerdao.com/t/discussion-direct-deposit-dai-module-d3m/7357",
                        "https://centrifuge.io/",
                        "https://backed.fi/",
                        "https://forum.makerdao.com/t/mip-6-declaration-of-intent-invest-in-short-term-bonds-proposal-for-implementation/16185",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-may-june-and-july-2022/17037",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/9",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-28-de-julio-03-de-agosto-del-2022/17139"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.604724549643905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#2",
                    "likes": "3",
                    "time": "28/07/2022-19:26:51",
                    "content": "This is well written and easy to read. Thanks Seb. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Porter_Smith",
                    "index": "#3",
                    "likes": "3",
                    "time": "29/07/2022-14:26:29",
                    "content": "Enjoyed reading this, thanks for sharing! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "3",
                    "time": "29/07/2022-15:32:58",
                    "content": "very good stuff, Seb as usual. the need for high levels of liquid assets as defense for bank runs is a serious challenge.  Maybe Maker can offer DAI holders returns for locking up their funds for fixed periods to create a longer and more stable liability structure? Otherwise it may be tough to compete on capital efficiency with real world lenders, particularly banks with all the support vs bank runs.  Perhaps there is also value in having a payment rail product? some excellent quotes: Crypto-banks hold highly liquid assets as a mean of defense against bank runs. But, and that’s the catch, there is not enough reserves for redeem all stablecoins at one. that it leads to bank run when trust is reduced but that the banking system can operate for many years without runs on the banking system, even in recessions . ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.861408730158731
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#5",
                    "likes": "7",
                    "time": "29/07/2022-16:43:26",
                    "content": "    Eumenes:  Maybe Maker can offer DAI holders returns for locking up their funds for fixed periods to create a longer and more stable liability structure?   teaser:  image1150×488 11.6 KB  And yes, so far the system is less resistant than a governement-backed one. But we are smarter. The system also relies on mark-to-market which is also a problem. One problem at a time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/humancapitol",
                    "index": "#6",
                    "likes": "1",
                    "time": "30/07/2022-00:35:05",
                    "content": "Great read - awesome to see the TradFi analogues so clearly laid out. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.166666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deepakghadge",
                    "index": "#7",
                    "likes": "2",
                    "time": "31/07/2022-04:19:45",
                    "content": "Great content Seb. Whilst it is difficult collateralize a physical asset like gold or land which needs a lot more robust process. The asset can be anywhere on this planet depending on the borrower. The challenge that crypto exchanges and crypto currencies are facing is to maintain stability, though we speak about distributed and decentralized somewhere there needs to be a forum to make things stable just as a overlaying governing council for the crypto players, it will bring some stability and best practices, they will not have control on any of the exchanges or they cannot infuse any regulation. It is just a professional community layer which advices all the players. The new age finance is still complex to the bottom of the pyramid, we need to make things easy for this section of the society so mass adoption happens and then regulators will align with the crypto community. Hope this makes sense. these are my personal opinion. Enjoyed reading it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2134986225895315
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#8",
                    "likes": "0",
                    "time": "31/07/2022-14:43:51",
                    "content": "   highnoteplatform.com   Highnote: The world's most modern card platform Realize your embedded card vision.       Screen Shot 2022-07-31 at 7.35.45 AM1213×742 103 KB  The future is embedding earning, saving, spending, and insuring/hedging at the same time. ",
                    "links": [
                        "https://highnoteplatform.com/platform"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/WaterLily",
                    "index": "#9",
                    "likes": "0",
                    "time": "26/08/2022-16:45:14",
                    "content": "It is a significant problem to maintain high amounts of liquid assets as a bank run defense. To build a longer and more reliable liability framework, perhaps Maker might provide DAI holders rewards for locking up their money for predetermined amounts of time? Otherwise, it might be difficult to compete with real-world lenders on capital efficiency, especially banks with all the support versus bank runs. Perhaps having a payment rail product is worthwhile as well? Crypto-banks maintain a large amount of highly liquid assets as a buffer against bank robberies. The problem is that there aren’t enough reserves to redeem all of the stablecoins at once. that when trust is diminished, bank runs result, but that the financial system may continue to function. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.704642857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "24/11/2022-16:45:37",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}