{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/introducing-dssgovrewards/5394",
            "title": "Introducing DssGovRewards ",
            "index": 5394,
            "category": [
                "Governance"
            ],
            "tags": [
                "incentives",
                "rewards"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "37",
                    "time": "29/11/2020-16:39:46",
                    "content": "I’ve created a repository called dss-gov-rewards which houses the contracts to enable paying out rewards to MKR locked in governance. Why? Maker security relies on binding MKR holders to the consequences of their votes. This assumption is broken for MKR that is borrowed on a lending platform. We have solved the most extreme version of this with flash loans, but the underlying problem remains. Fundamentally, Maker is not secure if there is more MKR available to borrow than there is locked in Chief/DssGov. The simplest and probably most robust way to solve this is to pay people to lock their MKR in chief and thus keep their MKR off the market. Implementation dss-gov-rewards is a lightly modified rewards contract from the UNI LP pool rewards. MKR IOU tokens can be deposited in, and you get rewards out. Both the staking and rewards tokens are arbitrary, so this can be used for rewards in either DAI or MKR depending on what governance wants to do. Additionally because this is a separate module from dss-gov, it can be deployed for the current Chief as well as DssGov. I’ve also added DaiRewardsDistributor as an example of how rewards can be done via the keg module. The idea here is to siphon off some % of the MKR burn and redirect it to rewards. The nice thing about this is we can adjust that % to control for how much of a ratio we want of MKR on the market vs locked in governance. Alternatively the rewards can be made in MKR as well if the community desires. Another bonus of this module sitting completely outside governance is that we can upgrade it very easily. We simply shut off rewards to the existing contract and switch them to a new contract. IOU tokens are completely opt-in to whichever contract they want, so people will move over naturally. This may be useful in the case where DeFi liquidity pools start automatically depositing into rewards (similar to what Compound does with Dai and the DSR). Security This module is using code that has already been audited and tested in production, so it should be safe to use. Additionally, since it is sitting outside the core Maker system, and only interacts with the IOU tokens there is limited room for catastrophic bugs. Worst case scenario we can just turn off the reward stream and we burn a few days of revenue. Discussion Looking for feedback on the route governance wants to take with this. Do we want to distribute rewards in MKR or DAI? Should we divert some portion of the MKR burner into rewards (% of profit) or should we pull it as a fixed operating cost? What % of profit should be used? Should we target some ratio of MKR on the market vs locked in governance. Please note that I’m expecting for historical reasons the Foundation cannot comment or be involved with this project. ",
                    "links": [
                        "https://github.com/makerdao/keg",
                        "https://forum.makerdao.com/t/weekly-sourcecred-distribution-payout-increase/5546",
                        "https://forum.makerdao.com/t/thoughts-on-allowing-mkr-defi-liquidity-providers-to-vote/6112/2",
                        "https://forum.makerdao.com/t/brainstorm-2021-mission-and-objectives/5809/12",
                        "https://forum.makerdao.com/t/mip49-governance-rewards/6331/65",
                        "https://forum.makerdao.com/t/mip49-governance-rewards/6331/76",
                        "https://forum.makerdao.com/t/mip42-proposed-compensation-addendum-for-makerdao-contributors/6138/5",
                        "https://forum.makerdao.com/t/mip26-dssgov-governance-contract-redesign/4589/30",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-122-thursday-december-17-16-00-utc/5608/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-121-thursday-december-10-16-00-utc/5468/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-25-en-espanol/5680",
                        "https://forum.makerdao.com/t/maker-relay-ep-25/5671",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-120-thursday-december-3-16-00-utc/5357/4",
                        "https://forum.makerdao.com/t/personal-guided-tour-to-understanding-makerdao/5563",
                        "https://forum.makerdao.com/t/maker-relay-ep-23/5419",
                        "https://forum.makerdao.com/t/presentamos-dssgovrewards-autor-original-hexonaut/5404",
                        "https://forum.makerdao.com/t/mip49-staking-rewards/6331"
                    ],
                    "GPT-summary": "The author introduces a new repository called dss-gov-rewards, which contains contracts to enable paying out rewards to MKR locked in governance. The post explains the rationale behind the proposal and how it works. The author is seeking feedback on whether rewards should be distributed in MKR or DAI, how much of the MKR burner should be diverted into rewards, and what ratio of MKR on the market vs locked in governance should be targeted. The author also notes that the Foundation cannot comment or be involved with this project.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.455161218092252
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "5",
                    "time": "29/11/2020-17:01:21",
                    "content": "This is awesome Sam! TY! Finally we can move 1 step forward to incentivizing the dedicated and devoted MKR community. Personally I would advocate for payments w/DAI via the burner — just my early thoughts. Will be interesting to see what the community thinks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.725
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "8",
                    "time": "29/11/2020-18:02:43",
                    "content": "I think paying DAI as kind of dividend as a % of operating profit if fine Issuing MKR will complicate stuff and will be odd when at the same time we burn MKR. If it’s not too complicated, issuing them with stability (operating expense) would be cool. We can start small and increase it to be a dividend aristocrat on which the Maker Community can take retirement on  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#4",
                    "likes": "10",
                    "time": "29/11/2020-18:11:03",
                    "content": "Personally I agree with issuing DAI instead of MKR for a couple reasons.  We eliminate some auction inefficiency. I prefer giving individuals the option to buy more MKR instead of forcing them to. Human nature is a part of this equation, and I can see more hype being driven by dividend payout analogues. The burner can be a little abstract, but I think most people understand getting cash.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#5",
                    "likes": "8",
                    "time": "29/11/2020-18:16:04",
                    "content": "What would you say to the people concerned about tax implications (hence the engineering of the buyback mechanism to begin with). I hear this argument the most (from Americans) and hope it doesn’t create too much friction in this methodology being implemented. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#6",
                    "likes": "6",
                    "time": "29/11/2020-18:26:03",
                    "content": "Dividends and taxes are something we should consider, but they are not the main reason behind this module. The main reason is to secure the system against having too much MKR on the market. This is a classic prisoners dilemma game theory problem where individual defectors (MKR holders who loan their MKR) are rewarded with interest on their MKR. The only way to prevent this in my view is to give them a better offer. So yes taxes are unfortunate depending on your politics, but I don’t see any other way to solve this. Keep in mind I suspect we may not need to go very high to beat the market. Aave offers 1.25% interest on MKR, so with 29M in fees / year we would only need to run the rewards at 20% of the burner to match that. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.161
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lix",
                    "index": "#7",
                    "likes": "5",
                    "time": "29/11/2020-18:43:59",
                    "content": "Love this. I think rewards in DAI out of the surplus is great for future rewards. Can we do a retroactive reward via MKR inflation to all previous MKR staked in chief similar to how uniswap rewarded early LPs? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.027777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#8",
                    "likes": "1",
                    "time": "29/11/2020-19:32:31",
                    "content": "@hexonaut fantastic! You are on fire!       Thanks! I also agree with most of you that paying in DAI makes a lot sense.     Aaron_Bartsch:  What would you say to the people concerned about tax implications (hence the engineering of the buyback mechanism to begin with). I hear this argument the most (from Americans) and hope it doesn’t create too much friction in this methodology being implemented.   @hexonaut, just an idea, but would it be possible to have a ‘blacklist’ of some sort, so if some MKR holder doesn’t want to be rewarded, they can still lock their MKR in Chief/DssGov without having to incur in taxable events (such as the reward)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.482142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#9",
                    "likes": "5",
                    "time": "29/11/2020-19:54:10",
                    "content": "    iammeeoh:  @hexonaut, just an idea, but would it be possible to have a ‘blacklist’ of some sort, so if some MKR holder doesn’t want to be rewarded, they can still lock their MKR in Chief/DssGov without having to incur in taxable events (such as the reward)?   Technically this is probably do-able, but black lists of any kind make me nervous in crypto. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.433333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#10",
                    "likes": "5",
                    "time": "29/11/2020-20:05:22",
                    "content": "As far as I understand the IOY is staked. So if you don’t want to get rewards you just do nothing. If you want to get rewards you have to stake the IOY. The governance is still working as it is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#11",
                    "likes": "4",
                    "time": "29/11/2020-20:07:49",
                    "content": "Ah yes you are correct @alexis. You need to opt into rewards. You can still do voting without rewards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#12",
                    "likes": "2",
                    "time": "29/11/2020-20:14:16",
                    "content": "Excellent! This seems to answer @Aaron_Bartsch question completely then. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vikpkb",
                    "index": "#13",
                    "likes": "3",
                    "time": "29/11/2020-20:24:19",
                    "content": "@hexonaut  This is great,  I hold less than 10 mkr never participated in voting but now im going to , when can we expect rewards in the mainnet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#14",
                    "likes": "2",
                    "time": "29/11/2020-20:31:20",
                    "content": "There is a dependency of getting the keg deployed, but after that it’s very straight forward to add. January or February seems like an achievable target, but that depends on the SC team schedule. The UI would also need to be put in place. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#15",
                    "likes": "8",
                    "time": "29/11/2020-20:59:10",
                    "content": "Great work Sam! Out of curiosity I checked how much Maker would need to spend yearly to match Aave’s current MKR yield. The yield there is 1.24% and if we were to match it on current $180m MKR locked inside voting contract, Maker would need to spend 2.2m DAI yearly. Actually the yield on Aave is probably even higher if you consider borrowing DAI on MKR and farming it. Yields on Balancer and Uniswap are much higher, but you need to include ETH to provide liquidity. Obviously the idea is to attract some additional voters, but we shouldn’t fool ourselves that the yield will be tempting, unless huge share of burn is used to reward voting. I do think this is going to be positive addition. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.163636363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#16",
                    "likes": "1",
                    "time": "29/11/2020-21:01:37",
                    "content": "I am not too sure, it seems already integrated. But we probably don’t want contract to call get rewards to avoid farming on it and reduce attack surface. How is it going to work with the reward duration? Ok gotcha, We first need to build a sort of reserve than send this reserve as reward for a period of time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#17",
                    "likes": "2",
                    "time": "29/11/2020-21:48:55",
                    "content": "2.2M / year seems very doable. We are currently burning well over that. I was expecting this to be on the order of 20% or so of the burn which doesn’t seem like a whole lot to me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#18",
                    "likes": "4",
                    "time": "29/11/2020-22:03:21",
                    "content": "I would love to explore this further as well. While I totally agree with the spirit of this, if enough of the surplus is being distributed via this mechanic it’s going to introduce a major inefficiency. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#19",
                    "likes": "5",
                    "time": "29/11/2020-23:34:21",
                    "content": "What will the gas efficiency of these rewards be? This will add a lot of overhead, resulting in less value for MKR holders. Less effect on big holders but it’ll effect smaller holders more. A more efficient way is doing a vault type style where you get automatic compounding of MKR. Rewards are in MKR and get automatically compounded. The exchange rate just slowly ticks up. [And possibly for tax efficient as a capital gain instead of dividend] ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#20",
                    "likes": "3",
                    "time": "29/11/2020-23:54:15",
                    "content": "    Primoz:  Out of curiosity I checked how much Maker would need to spend yearly to match Aave’s current MKR yield. The yield there is 1.24% and if we were to match it on current $180m MKR locked inside voting contract, Maker would need to spend 2.2m DAI yearly. Actually the yield on Aave is probably even higher if you consider borrowing DAI on MKR and farming it. Yields on Balancer and Uniswap are much higher, but you need to include ETH to provide liquidity. Obviously the idea is to attract some additional voters, but we shouldn’t fool ourselves that the yield will be tempting, unless huge share of burn is used to reward voting. I do think this is going to be positive addition.   I agreed with that first, and then I think you can mitigate this idea.Of course you don’t want to be “too low”.So you want to offer something interesting otherwise people will just put their tokens elsewhere. BUT on the other side if you offer yield higher than other platform you will attract more people. In a way it’s good, but you also bring the risk to see more people voting just to get reward, without taking time before taking a decision. When you have fewer rewards, you have fewer votes. But at least those votes are made by involved members. ps: I have to admit that i don’t know everything about Maker DAO and how you are planning to reward people. Will you need to stake AND vote, only stake … If someone has as link to a topic speaking about that would be amazing.     Jiecut:  A more efficient way is doing a vault type style where you get automatic compounding of MKR. Rewards are in MKR and get automatically compounded. The exchange rate just slowly ticks up. [And possibly for tax efficient as a capital gain instead of dividend]   I also agree with that, I think reward in MKR is better. As people will be able to compound and also gain \"power\"on their votes. If they want to swap and get DAI they are , of course free to do it. But i like the idea to be part of a DAO and be reward in gouvernance token. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0917832167832175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#21",
                    "likes": "6",
                    "time": "30/11/2020-00:52:37",
                    "content": "I support MKR as a reward. Our goal is to reduce the number of MKR tokens in the market to improve Maker security. Also, using MKR tokens as a reward will not cause legal issues such as taxation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#22",
                    "likes": "1",
                    "time": "30/11/2020-07:35:06",
                    "content": "    hexonaut:  MKR locked in governance   huge thumbs up on this one @hexonaut - big step forwards But let’s be clear what this is buying us: this will increase the amount of MKR locked in governance, it will not necessarily increase the amount of MKR that actually votes, nor will it increase the number of brains involved in Maker governance. So while applauding your initiative I have an immediate upgrade request: will it be possible to bolt staking onto this? Each time a MKR holder votes, 1% or so of the MKR is locked up. This MKR is then returned after a year or so with interest. This will increase actual voting, not just stuffing the governance contract. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.357142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#23",
                    "likes": "2",
                    "time": "30/11/2020-09:01:24",
                    "content": "    hongbiao_li:  using MKR tokens as a reward will not cause legal issues such as taxation.   I don’t see why MKR change anything versus DAI from a taxation perspective, both are proceeds/dividends. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#24",
                    "likes": "1",
                    "time": "30/11/2020-10:07:11",
                    "content": "    Planet_X:  But let’s be clear what this is buying us: this will increase the amount of MKR locked in governance, it will not necessarily increase the amount of MKR that actually votes, nor will it increase the number of brains involved in Maker governance.   I agree. This DssGovRewards is going to be a very valuable tool, but still we need to discuss on how to implement things correctly to achieve properly our intended goals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#25",
                    "likes": "7",
                    "time": "30/11/2020-11:08:55",
                    "content": "You are right this is only to solve the issue of controlling how much MKR is out on the market. There are additional planned features for DssGov such as vote locking. Because the foundation can’t be involved and the rewards module can be used for chief as well it made sense to me to release it as a separate component. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "3rd party giving additional information on proposal"
                    ],
                    "Sentiment": 5.607142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Homo_Economicus",
                    "index": "#26",
                    "likes": "4",
                    "time": "30/11/2020-11:50:30",
                    "content": "The disadvantage of rewards in DAI (coming from collected fees) is that they will be negatively correlated with MKR price/Marketcap (in % terms). E.g. to match the current 1.2x% yield on AAVE, on current 180m USD of MKR locked inside voting contract, Maker would need to spend 2.2m DAI yearly, but this 2.2m DAI will be only 0.6% yield if the MKR price doubles. As you can see, the “problem” is as MKR price will rise the rewards (in % terms) will decrease, but this doesn’t apply to money market protocols like AAVE or Compound. So if/when the MKR price increases significantly we will be back where we were, the rewards will be negligible in comparsion to interest rate offered by money market protocols. This problem doesn’t apply to rewards coming from MKR supply inflation, because as the MKR price rises (or decreases), the rewards do too (in $ terms). Both types of rewards have its pros and cons and in my opinion some % combination of both is superior to either alone. E.g. when MKR price is low: [80% burn, 20% DAI rewards], 0% MKR supply inflation/rewards, when MKR price is very high: [0% MKR burn (surplus buffer increased), 0% DAI rewards], 100% of rewards coming from MKR supply inflation (for example 1% supply inflation). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#27",
                    "likes": "3",
                    "time": "30/11/2020-18:16:36",
                    "content": "Yes, it’s a bit of an overestimation to say that this yield will be tempting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#28",
                    "likes": "3",
                    "time": "01/12/2020-00:19:33",
                    "content": "Alternative Name: Maker Savings Rate ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/s_ben",
                    "index": "#29",
                    "likes": "2",
                    "time": "02/12/2020-03:56:18",
                    "content": "    Aaron_Bartsch:  What would you say to the people concerned about tax implications (hence the engineering of the buyback mechanism to begin with). I hear this argument the most (from Americans) and hope it doesn’t create too much friction in this methodology being implemented.   I’ve been getting paid primarily in crypto for a couple years (in the US), much of it in DAI. If there’s no appreciation (as in stablecoins), I just treat it like normal income. I believe this is the standard treatment. No issues yet. This is not tax advice. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#30",
                    "likes": "2",
                    "time": "02/12/2020-05:39:42",
                    "content": "this is cool what about paying out rewards in MKR with a very high APY, like 50-500% so that any MKR that is not in governance is effectively diluted out of the system faster than any AMM fees can compensate for? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.93
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#31",
                    "likes": "3",
                    "time": "02/12/2020-08:58:58",
                    "content": "Was thinking there could be some unintended consequences here. First, stated goals are:  Reduce borrowable MKR (to prevent malicious use) Encourage voting participation (raise threshold for malicious actions)  Imagine we create this rewards contract for staking governance Maker IOU token (call it GovMKR) to earn Dai. First, some MKR holders will prefer continue maximizing MKR value (as pure MKR burning does), so if they get Dai they’ll want to reinvest it into MKR.  However, like other rewards “farming” activities, that can be laborious and expensive at small scale.  Therefore we should expect to see something like a yMKR yearn vault which fixes that problem with scale, as it does for other rewards farming, and automates re-investing in MKR. Some MKR holders will do that to maximize rewards even though it means giving up voting rights! So either the vote is effectively delegated (e.g. to YFI holders) or, the yMKR vault might be designed to just not vote at all. In the former case, the original goal of making MKR unavailable to borrow (for system security) is potentially undermined.  Depending on how the vault is designed, it might still allow a malicious user to vote with all the pooled MKR.  In the later case, it has the effect of making voting impossible, which also leaves the system less secure, since at least some MKR holders might have voted. What if the staking contract rewards in MKR instead of DAI? This might be a bit better actually. Now, the same person who wants to continue maximizing their MKR value can just deposit to the voting contract and stake their GovMKR to increase their MKR balance. Since there’s no need to harvest Dai and reinvest, there’s no need for a yMKR vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.1561755952380945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#32",
                    "likes": "0",
                    "time": "02/12/2020-11:10:00",
                    "content": "If we don’t want farming we just need to forbidden contract to call the staking method or introduce an allowed list on it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#33",
                    "likes": "3",
                    "time": "02/12/2020-12:33:32",
                    "content": "You are correct in that there is nothing we can do from a technical perspective to prevent liquidity pools from putting the MKR into the rewards contract due to the permission-less nature of the blockchain. However, there are a few mechanisms we can use to keep this number low.  It takes time and effort to build a contract which pools liquidity, and inserts that liquidity into MKR rewards. We make it very clear we do not want this, and present a credible threat that we will just redeploy the contract if the liquidity on these markets becomes too liquid or possibly start using a blacklist if that ends up being easier. It’s a bit of a cat and mouse game, but I think we have the upper hand. MKR holders should be aware of the dangers of lending out their MKR. Rewards can help to reduce the chance of defection from any individual, but ultimately it’s up to them.  In any case we need a tool to combat high APYs on lending markets. The lending rates are not super high right now (~1% on Aave), but imagine if that goes up to something like 5%+. I could see a situation where the trade offs of listing your MKR on the market is too high for the individual to resist with an “everyone else is doing it, so I might as well too” mentality. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.172117794486216
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#34",
                    "likes": "1",
                    "time": "02/12/2020-15:22:23",
                    "content": "@hexonaut you can control if it is a contract or an simple address. Curve does it by checking the transaction origin, I am not sure if there is more technics. Also it is safer as most of the attack needs an orchestration of calls.   github.com   curvefi/curve-dao-contracts/blob/87d4b30e55870f874191849f203855b38af67f69/contracts/VotingEscrow.vy#L185  @externaldef apply_smart_wallet_checker():    \"\"\"    @notice Apply setting external contract to check approved smart contract wallets    \"\"\"    assert msg.sender == self.admin    self.smart_wallet_checker = self.future_smart_wallet_checker@internaldef assert_not_contract(addr: address):    \"\"\"    @notice Check if the call is from a whitelisted smart contract, revert if not    @param addr Address to be checked    \"\"\"    if addr != tx.origin:        checker: address = self.smart_wallet_checker        if checker != ZERO_ADDRESS:            if SmartWalletChecker(checker).check(addr):                return        raise \"Smart contract depositors not allowed\"       ",
                    "links": [
                        "https://github.com/curvefi/curve-dao-contracts/blob/87d4b30e55870f874191849f203855b38af67f69/contracts/VotingEscrow.vy#L185"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9458705357142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#35",
                    "likes": "1",
                    "time": "02/12/2020-15:35:36",
                    "content": "Ah great idea, yes this is a step we could do. Although it does prevent getting rewards to a proxy address. I’m inclined to start this out with the simplest version and layer in protection as necessary. Redeploying the contract is very straight forward to do, and we will need to do so anyways when we switch to DssGov. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.766666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#36",
                    "likes": "0",
                    "time": "02/12/2020-15:38:45",
                    "content": "You can either add a white list or not. I believe the easyway and risk less way is to create a modifier method with just the required check in it. Worse case scenario it is the same as the uniswap one. No input no output. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/idgm5",
                    "index": "#37",
                    "likes": "1",
                    "time": "04/12/2020-21:05:15",
                    "content": "“Theoretically” when this proposal can be submitted for voting? I imagine that it could come after the migration of DSChief v1.2 concludes, but what could be an estimate? 2021 Q2? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#38",
                    "likes": "11",
                    "time": "04/12/2020-21:21:03",
                    "content": "Q1 2021 is reasonable imo. I can deploy it myself once the keg is up. All governance has to do then is turn on the funds. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Uncle",
                    "index": "#39",
                    "likes": "1",
                    "time": "07/12/2020-21:06:29",
                    "content": "Uncle adds that this will decrease the FUD from Degen Spartan ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/shane",
                    "index": "#41",
                    "likes": "2",
                    "time": "07/12/2020-23:58:45",
                    "content": " Technically this is probably do-able, but black lists of any kind make me nervous in crypto.  I agree with this 100%. One comment that I would like to add is as follows: If someone has held onto and voted with their MKR for over a year, they may be able to claim long-term capital gains (tax-friendly) when selling at a later time. If this system (as I understand it) is implemented, then this user will either have to (a) trigger a taxable event to continue voting or (b) stop voting. If this user’s tokens’ value is high enough, and they believe it will continue to rise, I would suspect that they choose (b). It is unclear how many MKR voters are in this category, but if the number is relatively high (compared to the number of current voters), this could be detrimental to the voting system’s strength. I do not think a decision should be made based on tax jurisdictions, but I think it should be considered. Edit: Additionally, if more migrations were required (such as DSChief v1.2 Migration) at a later time that caused the IOU token to be deposited and a new, upgraded one withdrawn (thus triggering a taxable event), then the user mentioned above is even more likely to chose option (b) above. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.802693602693603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#42",
                    "likes": "0",
                    "time": "08/12/2020-09:51:45",
                    "content": "Seems way more complicated, first you need to get all addresses, than remove the flash minted one, probably remove the rented one. Some people can use a new address everytime. Some people can have had they address compromised and move they assert to another address. Then you have to provide the founding. Currently the founding will be voted and taken from the reserve. If you want to reward previous vote we need to mint MKR and change the way as the module works. Basically a new module needs to be developed on top of this one. When uniswap did it, they put a lot of effort in it. Also the amount here is not that important, we are talking about 1.5M of reward a year. To compensate people that let MKR inside the hat instead of using balancer ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.678030303030303
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joshuad31",
                    "index": "#43",
                    "likes": "4",
                    "time": "08/12/2020-15:52:03",
                    "content": "Hello, I’ve acquired MKR over the past 18 months or so because I believe in stablecoins and I could understand about 60% of the whitepaper.  Now things have become a great deal more complex and I’m out of my league but I hold too much MKR to easily exit.  This proposal is something I feel would help alleviate the problems with AAVE. Everyone wants yield. The security of the protocol shouldn’t require people to be altruistic. Instead the protocol should provide yield if needed for the sake of security. I know everyone is busy but if someone can explain to me how I can use my resources to champion this change I’m willing to pay them for their time.  I’ll pay 0.15 ETH per hour to better understand this and other proposals affecting the MKR ecosystem. If someone wants to contact me they can always send an email to my_username @yahoo.com or my_username @gmail.com Thank you Joshua ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.045138888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#44",
                    "likes": "3",
                    "time": "08/12/2020-18:13:05",
                    "content": "If you have  specific questions, this forum is also here for this reason. Not need to pay to better understand a DAO. Just ask your questions ! And you will have a better answer here, at least if someone say something wrong or not completely correct, someone else can add something ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.229166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#45",
                    "likes": "3",
                    "time": "08/12/2020-19:27:37",
                    "content": "Great example why we need voter delegation to be more nimble and efficiently improve the DAO. Getting from not understanding anything about Maker DAO to understanding every governance proposal in and out is very challenging and time-consuming. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#46",
                    "likes": "8",
                    "time": "08/12/2020-19:38:48",
                    "content": "Speaking of voter delegation. I have added a contract to the repository that will enable us to issue rewards to delegates who are actively voting as well. This doesn’t need to be a huge % of the profits (maybe 1-2%), but can encourage good voting behaviour. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#47",
                    "likes": "1",
                    "time": "08/12/2020-20:02:24",
                    "content": "yes it’s a good idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vikpkb",
                    "index": "#48",
                    "likes": "1",
                    "time": "08/12/2020-20:27:51",
                    "content": "make this happen. tell us what to do! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#49",
                    "likes": "3",
                    "time": "08/12/2020-20:29:25",
                    "content": "The delegate rewards can go up right away when DssGov is deployed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joshuad31",
                    "index": "#50",
                    "likes": "0",
                    "time": "08/12/2020-20:34:45",
                    "content": "Of course yes… but sometimes you just need an initial personal touch to provide the context to things.  I’m really looking for a guide more than a definite answer. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joshuad31",
                    "index": "#51",
                    "likes": "0",
                    "time": "08/12/2020-20:37:45",
                    "content": "    hexonaut:  a contract to the repository that will enable us to issue rewards to delegates who are actively voting as well. This doesn’t need to be a huge % of the profits (maybe 1-2%), but can encourage good voting behaviour.   I know that some feel there are security concerns with regard to delegate voting but if you want more MKR to actively engaged in governance you need to consider all potential options.  I would very much like to support any improvement that would enable delegate voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.138095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#52",
                    "likes": "1",
                    "time": "08/12/2020-20:44:05",
                    "content": "It’s up to you of course. If you have money to spare , it’s your money  Just telling that people here will be happy to help, and it can also help other users. We can also imagine creating a FAQ, or a specific post, where people can ask “random”  question, and others answers when they have time. And after several weeks/months we could organize question and answers and create a nice FAQ coming from users ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.2749999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#53",
                    "likes": "0",
                    "time": "08/12/2020-23:25:00",
                    "content": "An FAQ would be a great resource and it would save a lot of time rehashing old material. YFI has a hackmd page where users can post questions and as people find the answers to those questions they are resolved. It makes for an interactive learning resource. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Voltaire",
                    "index": "#54",
                    "likes": "8",
                    "time": "09/12/2020-20:08:13",
                    "content": "Rewards should probably be in MKR and not Dai. Dai is already above peg, so sending Dai as rewards to a staking contract where there probably won’t be a high velocity of usage will lead to Dai sitting dormant and potentially lost over time, which keeps upward pressure on Dai price. Flaps put more Dai on the market immediately which helps the peg, so as long as less value is being issued to governance participants than is being burned in auction. Additionally, if you want to reward MKR holders for performing in the governance process, the best way to do that would be to increase their relative weight of voting power by issuing more MKR to them. Then it’s up to them at that point whether they want to compound their voting weight or sell to something else. But if the assumption is that they’re being rewarded for good governance, they should probably be given the opportunity to govern more. From a tokenomics perspective, staked MKR will probably stay staked and stay off the market for a while anyways. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.428787878787878
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Malgaph",
                    "index": "#56",
                    "likes": "0",
                    "time": "09/12/2020-23:09:16",
                    "content": "This staking of MKR combined with burning should lead to an increase in perceived scarcity of the product as well as reduced volatility in its price discovery. I agree with the reward of MKR the other problem I have is how much of the burned supply should be given as rewards(20% or 10%) as well as how are the rewards divided up is it out of the total MKR that have voted or total MKR supply? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Adam_Skrodzki",
                    "index": "#57",
                    "likes": "2",
                    "time": "10/12/2020-15:43:03",
                    "content": "The idea is great and I love that it emerged from an independent community member. I hope It will find It’s way to governance poll and later to executive voting. That would be great example of DAO in practice. On a devil’s advocate note. If we reduce liquidity (that is a whole idea of this extension) wouldn’t it naturally increase price violality and, as an extension of that, possibility of price manipulation. I remember last black swan when price of MKR dropped from somewhere around 600 to 200 in matters of hours because there was bad debt to pay off. I this kind of event would happen again wouldn’t be price swing even bigger ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#58",
                    "likes": "0",
                    "time": "10/12/2020-16:07:27",
                    "content": "I believe the reduction of liquidity will not be affected in liquidity pools since ROI is much higher. It is more intended to affect the secondary lending markets ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ben_Lilly",
                    "index": "#59",
                    "likes": "0",
                    "time": "11/12/2020-03:59:15",
                    "content": "Dividend aristocrat. If people care about price appreciation it helps to have a narrative form around your token. Being an income generator is one to get around as there aren’t many out there… especially from the larger cap. I’m referring to DAI and not in terms of receiving MKR. I do worry about liquidity issues arising as a poster just a few spots above me alluded to. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.300000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MKR1",
                    "index": "#60",
                    "likes": "4",
                    "time": "11/12/2020-23:35:45",
                    "content": "It is important to consider that we may not be competing with 1.25% interest on Aave. I suspect the main motive for depositing MKR on Aave is to add leverage. Example: $10,000 MKR deposited on Aave $2,500 USDT debt drawn $2,500 USDT > ETH ETH goes up 100% in a year $2,500 debt paid off $2,500 profit I understand there is an interest rate on that debt, but ETH can go up a lot more than 100% and this is just a simple example. In this example, the user did not care about the 1% he was earning from depositing MKR on Aave. He only cared about the 25% APY he earned by using his debt for leverage. So if Maker were to offer 1.5-2% for depositing into the Gov contract, it may not draw in many people at all during a bull market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#61",
                    "likes": "2",
                    "time": "12/12/2020-01:04:39",
                    "content": "This would be my concern as well. As someone currently doing exactly this I will take the bet that my leveraged MKR long will accrue more value than the amount of MKR I would receive in voting rewards. Now of course this isn’t to say that different people have different risk appetites and so I’m sure adding the rewards will still be a net positive for voter participation, but lets not delude ourselves that this will solve all of these problems (nor may we ever). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.792929292929293
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#62",
                    "likes": "0",
                    "time": "12/12/2020-10:02:57",
                    "content": "I think it is possible to add  into the reward contract at anytime, if we want to top it up. I believe it is a beginning. But you are right. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.309523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/David_Meister",
                    "index": "#63",
                    "likes": "1",
                    "time": "12/12/2020-10:25:39",
                    "content": "bull markets don’t mean no drawdown on the way up image1782×788 312 KB ETH looked like it was in a pretty decent bull trend going in to the start of the year, lots of people trying to mint DAI to jump on board with leverage got wiped out by the massive drawdown at on the left side of this diagram sure by the end of the year we are up way over 100% but you need to have not taken out a heavily leveraged price action bet before the drawdowns to have benefited from any of that - otherwise maybe you got your ETH liquidated at $0 to an opportunistic keeper in march i know there will always be people just using DAI minting as a big ETH leverage machine, but i hope we can move past normalising such behaviour, or thinking of it as the main use case for a CDP - it’s a bad look to an outsider, especially if regulators are looking for a simple ‘bad guy’ narrative to make life hard for stablecoins personally i put my DAI from my CDP towards real estate and real world projects, and i know others who have done similar as the terms and rates are typically better than what a bank will offer for a mortgage - in this case the interest rates do matter, but 2% is still reasonable ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.120265151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vikpkb",
                    "index": "#64",
                    "likes": "1",
                    "time": "16/12/2020-11:26:40",
                    "content": "So its been 17 days where do you think we are heading will it happen or it dies here as idea. AFAIK most of the people are excited for DssGovRewards to happen but we are all small holders. Any big bag holders showed any interest or gave some feedback to you personally. Apart from tax is there anyother reasons they don’t what this to happen. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#65",
                    "likes": "5",
                    "time": "16/12/2020-12:08:35",
                    "content": "This will almost certainly happen pending a governance vote to confirm. Right now we are blocked on the keg which is blocked on the smart contracts pipeline in general. There’s lots to do, and limited resources to get it done. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.692857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ratchet5000",
                    "index": "#66",
                    "likes": "8",
                    "time": "04/01/2021-16:01:04",
                    "content": "This is perhaps imo the highest impact proposal that is active on the forums at the moment and thus should be prioritized. It solves two chief issues:   Low voter participation in MakerDAO. Especially considering the ETH gas fees right now.   Unexciting tokenomics driving unexciting token price, which drives unexciting sentiment and unexciting token price. Even though MakerDAO is the undisputed king of Defi in terms of TVL, the “unexcitement” is causing the MKR token to have some of the lowest P/E ratios and TDV/TVL ratios in the sector (for example, MKR compared to AAVE, 34 vs >10000, 0.17 vs 0.69). This stems from a flawed tokenomics model, even if the core business is sound.   I also suspect long term that sentiment of a network/token will also drive usage of said network/token (in layman’s terms “whales shilling their bags”, whales including individuals and VCs). Hence even though, as mentioned, MakerDAO still has the highest TVL in Defi, dominance in terms of the percentage of TVL in defi captured by MakerDAO is idling near all time lows. If this continues the TVL crown may not stay with MakerDAO for much longer even if total Dai goes to new all time highs. MKR cannot continue to rest on its first-mover advantage laurels and continue using a tokenomics model that is quantifiably lagging new entrants, so I’m glad this is under discussion. Nonetheless, I hope there is an update on getting this to an executive vote soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.413503163503163
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#67",
                    "likes": "2",
                    "time": "04/01/2021-18:09:54",
                    "content": "    ratchet5000:  Nonetheless, I hope there is an update on getting this to an executive vote soon.   100 agree with you. Seems to be a lot of enthusiasm regarding this post. Maybe time to move forward ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#68",
                    "likes": "1",
                    "time": "04/01/2021-18:20:49",
                    "content": "    vikpkb:  AFAIK most of the people are excited for DssGovRewards to happen but we are all small holders.   Gas costs might not be fun for small holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#69",
                    "likes": "0",
                    "time": "19/02/2021-18:54:29",
                    "content": "While I understand that much of the code has already been written, I do want to present an alternative incentive structure that may have the same outcome but also may (subject to local tax situations which are different for everyone) be equally tax efficient as the current construct. While acknowledging the objective is to encourage voting and maintain the hat, another method instead of causing the equivalent of a dividend would setting forth an options model. The option model being that based on how long your MKR is locked in the governance contract that you (or the delegated MKR) would accrue an option to acquire MKR at a discount. This discount would be controlled by governance. Further, the notion that you have locked your MKR also would start a weighted average on the MKR strike price.  (e.g. locking in early… and locking for a long-time is the objective). Then only when the option is exercised the protocol would “mint” new MKR … and my understanding of tax law would be that the discount received would be taxable (but it was deferred). Key points on the above is that it would require some decently complex coding (though compared to DSS it “should” be easier) but it would further align interests of the DAO to reward voting… thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.913078149920255
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#70",
                    "likes": "0",
                    "time": "19/02/2021-19:06:16",
                    "content": "Couldn’t you easily change it so that you lock your MKR and then when you want to unlock that’s when you receive the accrued rewards so you don’t get taxed until you choose to withdraw? Is that still not tax efficient enough? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#71",
                    "likes": "0",
                    "time": "19/02/2021-19:07:49",
                    "content": "    Aaron_Bartsch:  so you don’t get taxed until you choose to withdraw? Is that still not tax efficient enough?   I wouldnt make it a hard requirement… it might be nice to have that option sit on the sidenline … ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.513888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#72",
                    "likes": "0",
                    "time": "19/02/2021-19:08:06",
                    "content": "Not sure how tax law works for claiming rewards tokens, but technically speaking that is basically what happens already. You call the function which gives you the DAI rewards whenever you want. They aren’t in your wallet until you call that function (or withdraw). ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#73",
                    "likes": "1",
                    "time": "19/02/2021-19:09:16",
                    "content": "Right, that’s what I thought. Thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#74",
                    "likes": "0",
                    "time": "19/02/2021-19:10:50",
                    "content": "We really should get some tax counsel to look at this… but from my seat, options tax is usually treated different… (e.g. you could give staff a bonus… clearly taxable… however, granting stock options are incentives without tax that are deferred until the staff member exercises the option… as it is an option to participate in the company)… the thinking is that by acquiring MKR it would hopefully be treated the same way… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#75",
                    "likes": "4",
                    "time": "19/02/2021-19:14:56",
                    "content": "I just want to bring up that every other major crypto protocol that is our competitor has streamed rewards and we’re the only ones that are getting pushback on taxes from Americans. I really don’t want us to lose our competitive advantage because of a loud minority of users. I personally have nothing against finding tax friendly options, I’m just worried that it’s more of a distraction that will make us lose out to others. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6953125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#76",
                    "likes": "0",
                    "time": "19/02/2021-19:16:45",
                    "content": "    Aaron_Bartsch:  loud minority of users   the hallmark of a community…   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#77",
                    "likes": "0",
                    "time": "19/02/2021-19:18:54",
                    "content": "What is your opinion on being competitive in a global market? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#78",
                    "likes": "0",
                    "time": "19/02/2021-19:21:49",
                    "content": "    Aaron_Bartsch:  What is your opinion on being competitive in a global market?   First, we are no worse than we are right now… second, do it the tax optimized way that meets the requirements with minimal tax implications… and then the rest of the market will switch their model also. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.529761904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#79",
                    "likes": "2",
                    "time": "19/02/2021-19:22:45",
                    "content": "So, be a leader in pioneering tax optimized options for token rewards. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#81",
                    "likes": "0",
                    "time": "23/03/2021-14:57:24",
                    "content": "There are wrinkles to this. Giving a discounted strike price wouldn’t work for the purpose you described, because that discount would be taxed as income at the time of grant. Startup options are granted under a board approved plan with a strike price that is greater than or equal to the fair market value of the stock at the time of grant. Granting an at the money option would potentially be able to work, but it would require a deeper analysis and doesn’t seem to solve the issue you are trying to solve here. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#82",
                    "likes": "1",
                    "time": "23/03/2021-15:26:20",
                    "content": "cant comment with certainty on how the tax laws work today or in other countries… specific to the US, and this was 20 years ago in my corporate days, granting of the options wasnt taxable… exercising them was (provided the recipient made money from it)… as there was a window of expiration where it would become worthless… the good ole’ days… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#83",
                    "likes": "0",
                    "time": "23/03/2021-15:46:32",
                    "content": "Right, but those grants were for a strike price at or greater than the current FMV at time of grant. Here you are talking about granting a strike price below the FMV. That’s income right off the bat, even in the startup context. It would also disqualify your ISO treatment for US tax purposes and make it a non qualified stock option. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3392857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#84",
                    "likes": "2",
                    "time": "23/03/2021-19:16:12",
                    "content": "    Gaucho:  That’s income right off the bat   This is my understanding as well. I think you’d be better off issuing at FMV and altering the number of contracts you issue rather than the strike price (which should always be at or over the FMV). Obligatory “not tax advice” blah blah blah ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#85",
                    "likes": "1",
                    "time": "23/03/2021-20:04:04",
                    "content": "Agreed. Another lever is the exercise period of the option. Longer exercise periods are much more valuable than shorter, since you can take a wait and see approach to the price action without any cash outlay. That’s why LEAPS have such a high time premium. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#86",
                    "likes": "0",
                    "time": "23/04/2021-20:42:54",
                    "content": "This proposal will solve disengagement.  I’m in favor of having a constant yield for locking MKR in governance, and supplementing that with a small bonus each time the holder votes; a second bonus could be given if it turns out the vote went the way they voted. Thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#87",
                    "likes": "6",
                    "time": "24/04/2021-07:30:40",
                    "content": "    ccc:  and supplementing that with a small bonus each time the holder votes; a second bonus could be given if it turns out the vote went the way they voted. Thoughts?   I disagree with this, looks like a prediction market, and one might voto for what “they think will win” as opposed to what “they think is right”. The only incentive for voting should be to do the overall good of the protocol. I think the delegation functionalities that are going to be introduced soon will help a lot already. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#88",
                    "likes": "1",
                    "time": "24/04/2021-12:36:46",
                    "content": "Delegation should do a great deal for the majority of voter apathy. This is the most efficient way to engage in governance of the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#89",
                    "likes": "0",
                    "time": "25/04/2021-01:41:43",
                    "content": "You can’t expect people to act altruistically all the time. That being said, I agree; delegation will do a great deal of good. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KriptoHayat",
                    "index": "#90",
                    "likes": "0",
                    "time": "25/04/2021-17:18:37",
                    "content": "delagation may be considered. we can encourage users here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#91",
                    "likes": "0",
                    "time": "25/07/2021-23:18:53",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}