{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/fear-respect-and-influence-within-makerdao/11398",
            "title": "Fear, Respect, and Influence within MakerDAO ",
            "index": 11398,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "32",
                    "time": "03/11/2021-15:48:07",
                    "content": "   MIP41c5-SP2: Facilitator Offboarding (RWF-001)   Any contributor should “respect and fear” any MKR holder. They’re the ones with skin in the game.   So Juan made this comment recently as part of a larger post in the Facilitator Offboarding thread. I don’t want to put the focus too much on Juan though, since this is a sentiment I’ve seen come up a few times, from a few different people. So please take this as a wider commentary on culture within the DAO and the relationship between MKR Holders and Core Unit Contributors.  Fear I want to be clear up front that I don’t think fear should be a component of any healthy relationship, be it between individuals, groups, whatever. A community in which one group fears another is not a healthy community, a workplace where one group fears another is not a healthy (or productive) workplace. Fear distracts people from the jobs they are being paid to do, and leads them to spend more effort on covering themselves, protecting themselves, and building powerbases such that they no longer need to fear. In a word, it leads to politics. Fear is one of the worst parts of some traditional organizations, and is something that I personally will not tolerate if it becomes a norm within MakerDAO. When it comes to ‘any MKR Holder’ it’s also nonsensical. There is frankly no reason to fear any individual MKR Holder because they hold no individual authority. I believe that MKR Holders as a collective fundamentally should not give contributors to the DAO reason to fear them for the reasons above. It degrades productivity, and will result in a lack of transparency. If people are afraid of what you will do with information about them, they will not provide you with that information.  Respect More nuanced is the issue of respect within MakerDAO. Respect is generally agreed to be something that must be earned. Taking this definition, it is ridiculous to say that contributors owe respect to every MKR Holder. What is important (and I believe that generally MakerDAO is fantastic at this) is that everyone within this community respects each others humanity. The default should always be to engage with each other politely and respectfully regardless of who is holding MKR, who contributes time to the DAO and people who are new or external to the core community. This comes back to a principle I’m very fond of, which is to ‘assume good faith.’ The assumption should always be that the person engaging with you is coming to you in good faith. However. Individuals are ultimately responsible for their own actions. Behave well, honorably, and respectfully to others regardless of their status relative to your own, and you will find yourself gaining the respect of others. Behave otherwise, and you will find that people come to lose that respect in you. There is no special quality that makes MKR Holders exempt from the social consequences of their actions. There are many MKR Holders I respect deeply, there are others that I do not, this is a natural and reasonable response to engaging with other human beings. No one is owed respect separate from their actions.  Influence What is important to the functioning of MakerDAO is that all involved respect and abide by the process of collective governance. Together MKR Holders possess power over Core Units, but only collectively and through the operation of the agreed governance processes. The example of the unhappy man at the DMV comes to mind, complaining about the wait and shouting:  I pay my taxes! I’m your boss, you work for me!  The man is correct (abstractly), but he is not permitted to have his way and skip the line because the DMV serves all citizens, not just this one man. It is fundamentally incorrect for an individual citizen to fire an elected member of a government, because it undermines the power of the electorate as a whole. This is also true within MakerDAO. Contributors serve all MKR Holders, regardless of their relative MKR weight. Individual MKR Holders do not have the authority to dismiss individuals elected to position by MakerDAO governance processes because it undermines the collective power of all MKR Holders. This is critical for everyone in the DAO to keep in mind, both elected individuals, and MKR Holders. Many individuals within MakerDAO possess influence over the community, whether due to their actions, their positions, or their reputation. This is entirely natural and is an unavoidable consequence of humans working together. But influence is not the same as authority. Individuals in the DAO can ask you to do something, they can try to convince you to do something (and since you are respecting each other as human beings you should genuinely consider it), but they cannot force you to do something. This is how it should be. This is what makes it different. This is what makes it better. ",
                    "links": [
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-28th-november-4th/11441",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/maker-relay-ep-70-en-espanol/11569"
                    ],
                    "GPT-summary": "The post discusses the culture within MakerDAO and the relationship between MKR Holders and Core Unit Contributors. The author explains that fear should not be a component of any healthy relationship and that respect should be earned. The post also emphasizes the importance of collective governance and the fact that individual MKR Holders do not have the authority to dismiss individuals elected to position by MakerDAO governance processes. The post does not advertise the proposal, nor does it extend to the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.453006881178522
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#2",
                    "likes": "9",
                    "time": "03/11/2021-16:14:34",
                    "content": "I was making a reference to:    MIP41c5-SP2: Facilitator Offboarding (RWF-001)   Everybody respects you and even fears you. You have tremendous power. You need to be aware of that.   I’m not going down the dialectics path. The Protocol belongs to the MKR holders. We’re accountable to them.  I agree (more or less) with everything else you said, @LongForWisdom. Not sure if there’s much to discuss regarding what you said, to be honest.  Maybe we should try to improve Governance by expanding and trying to solve these:    MIP41c5-SP2: Facilitator Offboarding (RWF-001)   Feedback in a DAO  Giving feedback in a DAO is extremely hard.  There is no anonymity (some people create burners/socket-puppets) There is a disconnect (at least some) between the forum and the on-chain polls There is a lot of noise and “drama” People tend to listen more to positive feedback than negative feedback    Feedback in general  I’ve seen over and over again Core Units / to-be Core Units minimizing the feedback received and being surprised with particular outcomes of the MKR holders. Usually, instead of taking the feedback, the comments are flagged as bullying/flaming/disrespectful. Advice to anyone in any DAO: when the immune system kicks in, listen (this is not that easy because of the noise). Contributors / Core Units should be proactive in getting alignment from the Delegates / MKR holders / Governance (talk to your Facilitator if this is not happening).    ",
                    "links": [
                        "https://forum.makerdao.com/t/mip41c5-sp2-facilitator-offboarding-rwf-001/11306/27"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4574214365881035
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "6",
                    "time": "03/11/2021-16:43:53",
                    "content": "    LongForWisdom:  assume good faith   On a philosophical note, you have paraphrased the title of one of my favorite introductory books on psychotherapy, No Bad Parts. This book frames the idea a little differently, though, because the “people” are different aspects of your own personality, similar to how the mind was presented in the film Inside Out 2015. However, the principle is the same whether we’re talking about inner parts or outer colleagues. I guess my point is that the assumption of good faith forms the bedrock of mental health. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Inside_Out_(2015_film)"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.985576923076923
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "3",
                    "time": "03/11/2021-19:43:23",
                    "content": "I just watched a video suggested by @rune in another post and I think it is shockingly appropriate to our current discussion. I think it is also in line with what @juan meant by “respect and fear” for MKR holders. The following link points to a particularly instructive moment (min 29:42) which is very relevant to us:      Quote:  Swift relief (aka firings) is the price of giving autonomy to battlefield commanders (aka CU facilitators).  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.186666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tru_Greg",
                    "index": "#7",
                    "likes": "0",
                    "time": "04/11/2021-11:08:02",
                    "content": "Hear hear! A great one @LongForWisdom. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Pookums",
                    "index": "#8",
                    "likes": "0",
                    "time": "07/11/2021-18:02:00",
                    "content": "Hey, just got into holding Maker because it seemed like a good entry.  What’s going on here is a classic case of FUD.  It is a tale old as crypto. The Dai volume in circulation is skyrocketing.  So at this precise time, let’s flood FUD onto multiple online platforms at the same time-- Not just this forum but also Reddit, Twitter, and I’m sure there’s others. What’s insulting is that they think “regular” people can’t see through what they’re doing.  But, just so you know, we’re out here cringing! But also buying the dips, so whatever. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/purrfection",
                    "index": "#9",
                    "likes": "2",
                    "time": "07/11/2021-21:24:51",
                    "content": "For me, this one really hit the spot. Thank you  @LongForWisdom If there is ever a “Best of forum.makerdao” in the future, I hope this will be there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "07/02/2022-03:24:55",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}