{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/what-happens-if-dai-loses-its-peg-and-goes-to-2-for-example/5973",
            "title": "What happens if DAI loses it's peg and goes to $2 for example? ",
            "index": 5973,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/BlueCat",
                    "index": "#1",
                    "likes": "0",
                    "time": "08/01/2021-14:56:17",
                    "content": "So, please bare with me and imagine this scenario. At 15th Jan, NYAG decided Tether is fraud and/or Tether is unbacked throwing the full power of the US government against it. Tether obviously loses it’s peg and starts racing to $0, that wouldn’t be huge deal but it’s in every DEX AMM pool with other stables So let’s make this simple example in AMM DAI/USDT pool, USDT goes to 0 and DAI goes to $2 Suddenly people that have borrowed $300 worth of DAI against $1000 worth of ETH (at relatively safe margin level of 300%+) Owe $600 instead of $300. At the same time other with riskier margin levels get liquadated and ETH price dumps as well, causing even the safe guy above being under collaterized with $600 worth of DAI against $100 worth of ETH (if ETH drops 90%) Wouldn’t that crash the whole system? And not just makerdao of course but pretty much everything? I realize this is unconfirmed black swan FUD at this point, but black swans do happen from time to time and I just woud like to know if the above scenario is ralistic if that does happen, your thoughts? ",
                    "links": [
                        "https://forum.makerdao.com/t/gobernanza-de-un-vistazo-14-01-2021-autor-original-prose11/6073",
                        "https://forum.makerdao.com/t/governance-at-a-glance-2021-01-14/6048",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-en-espanol-feliz-2021/6035",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-happy-2021/6016"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.628787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#2",
                    "likes": "3",
                    "time": "08/01/2021-16:26:41",
                    "content": "There are few things that will fight to keep the 1:1 peg with USD (e.g., the PSM and the USDC-B vault type, etc) but let’s assume also USDC goes to 2usd… which seems realistic in your scenario. Well, in case of such systemic disaster, and hopefully before DAI reaches 2usd, somebody (anybody with more than 5k MKR, I believe) can trigger a “Emergency ShutDown”. The effect of this is to immediately halt the MKR system. All DAI in circulation will be swappable with the underlying assets, etc (more details on ES are available in the MakerDAO docs). So MakerDAO would ‘halt’ but of course, everything else in DeFi would go trough a very significant turmoil, with almost unpredictable consequences. Remark: (Un)Fortunately the ES system, is the only component of MakerDAO that has never been tested live (I believe, or perhaps only partially with the move from SAI to DAI). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.374562937062937
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlueCat",
                    "index": "#3",
                    "likes": "0",
                    "time": "08/01/2021-16:45:48",
                    "content": "Hm that is good and reassuring to know! Actually another user in another thread reminded me that your debt is denominated in DAI, and hence DAI price against the USD doesn’t matter. So if DAI goes to 2, and you owe 30 DAI, for makerdao that is like owing 30, is that so? If that’s true only the other risk is left, collaterial price dump. But we’ve seen that happen already, while wasn’t pretty, we survived. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.964285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "1",
                    "time": "09/01/2021-02:45:29",
                    "content": "    iammeeoh:  Well, in case of such systemic disaster, and hopefully before DAI reaches 2usd, somebody (anybody with more than 5k MKR, I believe) can trigger a “Emergency ShutDown”.   50K MKR to ES the system unless something has changed. I have considered ES a possible protocol and DAI attack scenario for some time now especially since hitting $1B.  A full halt on Maker would basically lock up a chunk of assets and make DAI minting impossible with implications for the PEG and all DAI/asset trading pretty quickly.   As far as I know there is no way to reverse out an ES.  The contracts would have to be redeployed (ala SCD-MCD like a MCD1-MCD2 transition) and collateral withdrawn, redeposited etc.   I think this is like a nuclear bomb for borrowers btw.  Given network congestion currently one could expect gas to easily hit 1000gwei and some significant market turmoil. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609848484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#5",
                    "likes": "0",
                    "time": "09/01/2021-17:58:13",
                    "content": "So in this case, Debt Ceilings would get maxed out because it would be profitable to buy collateral, mint DAI and sell it. Governance would need to raise Debt Ceilings to increase DAI supply. Mainly relying on stablecoins if there was this much demand. Also note, users get liquidated based on the USD price, doesn’t matter if DAI price spikes. They’ll just have to sit tight with their positions or add some more collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8601190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "0",
                    "time": "09/01/2021-20:55:46",
                    "content": "    MakerMan:  50K MKR to ES the system unless something has changed.   Yes, sorry, I said 5k but I was wrong. It’s 50k MKR (~5% of all MKR) indeed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/01/2021-22:49:23",
                    "content": "    MakerMan:  I have considered ES a possible protocol and DAI attack scenario for some time now especially since hitting $1B.   Yeah, ES is quite scary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlueCat",
                    "index": "#8",
                    "likes": "0",
                    "time": "11/01/2021-10:50:24",
                    "content": "Just to confirm, if you have 30 DAI debt and you are at 300% collaterization level, and DAI price jumps to $2 you are still at 300% if we accept that ETH price stays the same? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#9",
                    "likes": "0",
                    "time": "11/01/2021-11:46:17",
                    "content": "Yes, because MakerDAO in its computations always considers 1DAI=1USD. It does not care about what the market think. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "12/04/2021-17:46:18",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}