{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ses-weekly-status-update-incubation-content-refresh/14207",
            "title": "SES Weekly Status Update: Incubation Content Refresh ",
            "index": 14207,
            "category": [
                "Core Units",
                "Sustainable Ecosystem Scaling"
            ],
            "tags": [
                "ses-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "5",
                    "time": "25/03/2022-03:17:56",
                    "content": " SES Weekly Status Update: Incubation Content Refresh  1920×1080 122 KB   This Week’s Topic: Incubation Content Refresh  Join us here! on 2022-03-25T15:30:00Z  On this week’s SES Weekly Status Update, we will share an update on the development of our Incubation Program’s content creation. As shared in past updates, SES is using lessons learned from the first year of operations and refocusing the incubation program on preparing and producing facilitator candidates (vs. incubating entire core unit teams). Supporting this process is Maker Academy, an incubating core unit that will graduate under the current structure of the incubation program. The team are currently working on introducing a best-in-class educational platform, purpose-built for MakerDAO. Leveraging this collaboration, SES aims to produce  educational content that will not only improve our incubator, but also reduce MakerDAO’s barriers to entry once it’s publicly made available. Add the SES Status Update Call to your calendar  Other Updates  960×540 55.5 KB   Incubator News  960×540 73.6 KB    Chaos Labs has begun drafting their MIP set. The team’s focus has shifted from technical development of their solution to preparing for their governance campaign. Learn more about their agent and scenario based testing infrastructure by watching this recording of their Core Unit Overview.  Maker Academy is deep in development, both of their educational platform and content. They are making progress towards releasing their platform’s beta for community feedback. The Legal and Transaction Services Core Unit (LTS) presented their Core Unit Overview on last week’s SES Weekly Status Update. Watch the recording here, and engage in the ongoing conversation with this forum post summary.   With the Community!  960×540 31.8 KB   22.03 Focus On #7: RWA Lending Principles Recording Live!  23.03 Focus On #8: Data Insights Core Unit Update Recording Live!  Contacts  960×540 56.3 KB   Links  Discord Drive Notion   @ses-core-unit ",
                    "links": [
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=NnYzMnYxZG9jOWwwY3FlcWduODdxcmNqZDRfMjAyMjAzMjVUMTUzMDAwWiBtYWtlcmRhby5jb21fM2VmaG0yZ2hpcGtzZWdsMDA5a3RuaW9tZGtAZw&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://youtu.be/wx_VGBrQBx8",
                        "https://youtu.be/xcnMPrNy9BI",
                        "https://forum.makerdao.com/t/ses-incubation-announcement-legal-and-transaction-services-core-unit-lts/14192",
                        "https://forum.makerdao.com/t/focus-on-7-rwa-lending-principles/14000",
                        "https://youtu.be/0PHMxH9zsR4",
                        "https://forum.makerdao.com/t/focus-on-8-stkmkr-staking-tokenomics-revision/14001",
                        "https://youtu.be/uGvBI_L9jaI",
                        "https://discord.gg/h64CXspejc",
                        "https://drive.google.com/drive/u/1/folders/0AFnWIfR4at7jUk9PVA",
                        "https://ses.makerdao.network/",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-march-2022/14712"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.578977272727272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "23/06/2022-03:18:34",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}