{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/need-more-explanation-on-vote-proposals/1386",
            "title": "Need More Explanation on Vote Proposals ",
            "index": 1386,
            "category": [
                "Governance"
            ],
            "tags": [
                "feedback",
                "concerns",
                "vote-participation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#1",
                    "likes": "8",
                    "time": "02/03/2020-06:00:40",
                    "content": "One of the biggest issues facing Maker is voter apathy.  One of the reasons for this is because there is scant information on the pros and cons of each proposal.  When reading about a proposal, what I see is “Please review the video, audio and the online discussion to inform your position before voting.”  Clicking on any of those links just takes me to the complete library of videos and discussion threads.  I have a day job that I work 45 to 50 hrs per week.  I would like to participate more in the votes but I don’t have time to wade through all the archives to find out what was said about the particular proposal I’m reading about.  Please make it easier for us to vote intelligently.  If I don’t understand what I’m voting for, I simply won’t vote.  Just my 2 gwei. ",
                    "links": [],
                    "GPT-summary": "The author of the post is expressing concern about the lack of information available on vote proposals for Maker. They are asking for more accessible and concise information to be provided to voters, so they can make informed decisions without having to spend excessive amounts of time researching. The post also includes constructive criticism and a request for clarification on the current system.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.722222222222223
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "2",
                    "time": "02/03/2020-11:48:51",
                    "content": "Hey @Tarpmaster thanks for highlighting this issue. Could you maybe expand on what medium or format would be best for you to review? If you are looking for a list of pros and cons, ideally the linked signaling thread should include these in the OP for review, with discussion below. Would you prefer for it to be summarized in audio or video form? Viewed as a summary? etc. I produce a resource called Governance at a Glance which is updated weekly, it includes a three point summary and links and brief descriptions of the active discussions and signals happening for that week. If you have feedback over how this could be more useful to you I’d love to hear it. Recently @adrianhacker-pdx has been producing Maker Holders Dai-gest, the latest of which can be found here which I believe is a significant improvement in terms of content than the previous versions. I recognise that we don’t have signaling threads for most of the regularly scheduled votes, so I can see where you might be missing some information here. I would really love to make this easier for you and for everyone else that can’t commit a large amount of time to the project, so please share any more detail or ideas that you can. ",
                    "links": [
                        "https://www.reddit.com/r/MakerDAO/comments/fakll8/mkr_holder_daigest_week_9_2020/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.524801587301587
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#3",
                    "likes": "3",
                    "time": "02/03/2020-15:56:40",
                    "content": "Thank you for your thoughtful response.  For sure, the links you just provided are helpful and some people have put a lot of time into creating those resources.  They are mostly “lookbacks.”  A couple of other comments.  There are now many places where one can go to get info on MakerDao and current discussions.  You have Twitter, Reddit, MakerDao.com, these forums, Maker Chat, vote.makerdao.com, YouTube plus a bevy of 3rd party content producers.  These forum threads seem to be where the action is now but I would submit that very few people actually subscribe to this forum like I have.  So, all this discussion isn’t even getting to the MKR masses, IMO.  I’ve been involved with Maker since way back before it was launched and it’s not easy to stay where the action is. It used to be Reddit.  Then MakerChat.  Then, you had to post in the correct group in MakerChat.  Somewhere along the way, everything moved to these forums.  I used to try to keep up with it all.  It became too onerous.  Also, discussions around governance, while incredibly important, can become quite tedious. What I would like to see are a few reasons why someone might vote for the different options in a polling or executive vote right at the vote site.  It doesn’t have to be exhaustive.  Last night, I went to vote.makerdao.com to see what’s up for vote.  It looks to me like there is an executive vote for \"Activate the Debt Ceiling Adjustments and Set the Dai Savings Rate Spread.  When I click on that, I see that the vote is to:  Lower the Sai Debt Ceiling - Cool.  I’m in favor of that. Set the Dai Savings Rate Spread to 1% - Cool.  I’m good with that. Lower the Dai ETH Debt Ceiling by 20 million to 130 million Dai - What?  This looks like we want to lower the debt ceiling.  Why in the world would we want to do this?  So, I click on that hyperlink and I’m taken to another poll with links to more resources.  I can take an hour to read the Migration Risk Construct, Governance Risk Framework, watch a video and so on.  I don’t want to do that so I go back to the vote at hand.  Under “Review,” I see “This change was discussed in the Governance call on Thursday, Feb 27.  Please review the Video, Audio, and the online discussion to inform your position before voting.”  My preference at this point is to review the online discussion.  I don’t have time right now to watch a video or listen to an audio. So, I click on the “discussion” link and it takes me to the forum topics.  Which one of these talks about the THIS particular vote?  It’s not obvious to me.  If I click on “video,” I see all these governance videos.  Sorry, but I would rather watch paint dry than watch another one of these.  Even so, let’s say I want to be a good steward and I’ll watch a couple of minutes of discussion if it will help me with this vote.  All I see is Ep. 75, Ep 74, Ep. 73…  Which of these is from Feb 27?  I can’t tell.  Yeah, I could go to Youtube and try to find it and then try to figure where in that video this vote issue is addressed but by this time, I’m done.  I gotta get back to work.  I think you get my point.  We seem to have a binary option of either letting the MKR voters do all the voting directly or to delegate our voting by proxy.  I would suggest that there is an in-between option.  We MKR voters could do a better job voting if the relevant info was readily available on the vote site.  I want to see recommendations from the Maker team for each vote and maybe some brief pros and cons for each selection.  I realize that the team doesn’t want to “guide” the vote.  However, I want this guidance.  Without such guidance, the only other alternative for me is to just delegate my vote. Btw, I still don’t know why we would want to lower the debt ceiling or if I’m even reading that correctly.  So… I just won’t vote today.  Sigh. ",
                    "links": [
                        "http://vote.makerdao.com",
                        "http://vote.makerdao.com"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.672405372405373
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#4",
                    "likes": "2",
                    "time": "03/03/2020-01:12:32",
                    "content": "Hey tarpmaster, thanks for bringing this to our attention. This is extremely valuable feedback for me, and I couldn’t agree more. I think this was just a blindspot on my side. While the voters deal with voter apathy, on our side occassionally we get bogged with too much overhead. I’m gonna look into what we can do about this (maybe a summary thread each week with some bullet points / justifications for the proposed weekly votes, or maybe more accurate links to the relevant discussions if they’ve already occurred elsewhere.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.171875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#5",
                    "likes": "1",
                    "time": "03/03/2020-04:32:09",
                    "content": "Thanks, Cyrus.  As you’re putting together the notes at each vote, keep in mind that it can be easy to have unintended consequences.  Not everybody knows the desired result of raising or lowering the SF or the DSR.  It’s easy for people to get it backwards in their head.  I still have to think, “OK, I want the DSR fee to go up because the price is shooting past $1.00.  DSR will cause more people to mint Dai.  By increasing the SF, we can tighten supply and help bring the price back down closer to $1.00.”  It’s not a bad idea to have some fundamentals like that pinned on the vote page (assuming I got all that right). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.998236331569665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#6",
                    "likes": "0",
                    "time": "04/03/2020-00:19:36",
                    "content": "So to correct you, You want to decrease the SF if the price is shooting over $1. When you tighten supply, it makes the price go up, when you loosen the price goes down because of more supply. Regarding DSR, DSR fee going up adds more demand for DAI (price goes up too). If the DSR goes down, less demand for DAI, downward pressure on DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.522222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#7",
                    "likes": "1",
                    "time": "04/03/2020-00:47:56",
                    "content": "I think you are correct but I’m not following the explanation.  How does decreasing the SF tighten supply?  A lower SF encourages people to mint Dai.  Yes, I was wrong about DSR.  People earning interest due to higher DSR are not the ones minting Dai. So, these comments would be helpful to people like me.  I’m sure I’m not the only one who gets this wrong sometimes. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.732142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#8",
                    "likes": "1",
                    "time": "04/03/2020-14:57:24",
                    "content": "I agree with @Tarpmaster that the explanation of the proposals is not presented well. For example - let’s take the latest exec vote. I’d like to see the following (this is just a rough format - it should be polished): The Maker Foundation Interim Governance Facilitator has placed an Executive Vote into the voting system, which will enable the community to approve the following alterations to the protocol:  Lower the Dai ETH Debt Ceiling by 20 million to 130 million Dai  Explanation: The MakerDAO risk team suggests to lower the DC because…[reasons here: 1-2 sentences]. Additional Links: [Poll] [Debt Ceiling Policy] [Discussion] …   Set the Dai Savings Rate Spread to 1%  Note: This will set the DSR to 7%    Explanation: The suggested DSR rate is determined weekly by the majority of voters. Additional Links: [Poll] [About DSR] [Discussion] [The DAI Peg] … There should be a page (“The DAI Peg”) where even an occasional DAI user can easily see whether DAI was off the peg or on the peg for the last week in order to know what to vote for. I don’t think it’s enough to link to https://dai.stablecoin.science/ or http://dai.descipher.io/ which provide just piled charts and some median number. I’d very much like to see transcripts of the meetings but I guess that was too much work so that practice was abandoned long time ago. ",
                    "links": [
                        "https://vote.makerdao.com/polling-proposal/qmewwftkvpcnqzmfrskryenlpqj4qqxqtzi9djxa8k9wn3",
                        "https://dai.stablecoin.science/",
                        "http://dai.descipher.io/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.901282051282052
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "2",
                    "time": "04/03/2020-16:05:45",
                    "content": "The difficulty with having explanations directly in the voting system is that someone has to be trusted to write them in an unbiased manner. I wouldn’t mind this sort of thing being on the forum, where alternative viewpoints can be added, points can be challenged, etc. But having it on the voting portal gives it weight and makes it difficult to challenge directly.     bit:  I’d very much like to see transcripts of the meetings but I guess that was too much work so that practice was abandoned long time ago.   I would really appreciate if you could communicate points like this one in a more respectful manner. Wanting transcripts is great and fine, but please don’t imply laziness on behalf of the community, Foundation or contributors for failing to produce this. The fact is, there are lots of things that need doing, and money available to people that want to do them, unfortunately we still lack contributors. It’s also worth noting that summaries exist, and can be found here: https://community-development.makerdao.com/governance/governance-and-risk-meetings/summaries/episode-75 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.973809523809523
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#10",
                    "likes": "0",
                    "time": "04/03/2020-17:44:19",
                    "content": "I wouldn’t overstate the harm in biased explanations.  At present, people are just not voting.  Which is worse?  I’m sure you can find someone(s) to give objective viewpoints.  I want to know what the team thinks.  Just list some basic pros/cons/outcomes for each selection.  Perhaps one day, much of this can be more formulaic and the things we vote on are completely different.  But right now, we are relying on people to decide things like SF and DSR rates. For what it’s worth, I didn’t read @bit 's comment as being disrespectful. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.62987012987013
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#11",
                    "likes": "0",
                    "time": "04/03/2020-18:44:26",
                    "content": "    LongForWisdom:  The difficulty with having explanations directly in the voting system is that someone has to be trusted to write them in an unbiased manner.   I agree with that in general but in this case - one person (@cyrus) or the risk team made that decision and it would be helpful if he/they explained why. If there is no particular reason then the link to the document describing the DC policy should be displayed.     LongForWisdom:      bit:  I’d very much like to see transcripts of the meetings but I guess that was too much work so that practice was abandoned long time ago.   I would really appreciate if you could communicate points like this one in a more respectful manner.   I don’t think that sounds disrespectful - I just wanted to state the facts. I agree that it is not necessary to transcribe the videos when the “Summaries/Episodes” (https://community-development.makerdao.com/governance/governance-and-risk-meetings/summaries) exist. I didn’t know they existed. I always just checked the transcripts page and saw that nothing new appeared there. It would be helpful to add one line at the top of the transcripts page: “Due to … the transcripts are no longer produced. Please see the Governance and Risk Meeting summaries here.” I also suggest that the folowing line is changed on the executive vote page: This change was discussed in the Governance call on Thursday, February 20. Please review the Video, Audio, Summary and the online discussion to inform your position before voting. If the summary is not available when the vote starts - the sentence below could follow: The Summary of the Governance call will be available shortly here. If we want even better UX, the link to the Summary could appear when it becomes available  ",
                    "links": [
                        "https://www.youtube.com/playlist?list=PLLzkWCj8ywWNq5-90-Id6VPSsrk4OWVan",
                        "https://soundcloud.com/makerdao/sets/governance-and-risk",
                        "https://community-development.makerdao.com/governance/governance-and-risk-meetings/summaries/episode-75",
                        "https://forum.makerdao.com/c/governance",
                        "https://community-development.makerdao.com/governance/governance-and-risk-meetings/summaries"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.003832442067736
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "0",
                    "time": "04/03/2020-19:17:48",
                    "content": "    bit:  I don’t think that sounds disrespectful - I just wanted to state the facts   That’s fair, but there are more diplomatic ways of doing so, something like: “I’d very much like to see transcripts of the meetings, I noticed they haven’t been updated recently, is someone still working on this?” There is no need to make assumptions about the reason they no longer exist.     bit:  I agree that it is not necessary to transcribe the videos when the “Summaries/Episodes” (https://community-development.makerdao.com/governance/governance-and-risk-meetings/summaries) exist. I didn’t know they existed.   Oof, that’s unfortunate, that means we’re still not doing a good job of communicating which resources are available and where they are. We’ll have to try and publicise this stuff more. You may be right regarding the transcripts. To be honest if they are no longer being produced, and we only have the old ones it might be better to just remove them all together.     bit:  If the summary is not available when the vote starts - the sentence below could follow: The Summary of the Governance call will be available shortly here.   This is a good suggestion, thank you. ",
                    "links": [
                        "https://community-development.makerdao.com/governance/governance-and-risk-meetings/summaries"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.373809523809523
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianhacker-pdx",
                    "index": "#13",
                    "likes": "0",
                    "time": "04/03/2020-22:22:31",
                    "content": "@bit @Tarpmaster @LongForWisdom  What do you all think about a description like the following.  This is an example for the Dai stability fee adjustment: Poll Opened: March 2, 2020 Dai Stability Fee Adjustment Voters can choose the Dai stability fee to be set any where between 4% and 12%. About the Dai Stability Fee:  The MakerDAO system is designed to cover excess outstanding loan amounts that may not be covered by the liquidation of collateral.  Although this is highly unlikely, it would most likely result from a situation that is unforeseeable.  This fee covers the amount of inflation during the time the loan is made, administrative costs of the Foundation, and a credit guarantee fee for Maker Holders who are acting as guarantors of the loan.  This fee covers the risk and the risk of risk being risky. For the voter to decide:  A prudent fee to ensure system stability in the event that collateral no longer holds enough value to cover outstanding loans. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianhacker-pdx",
                    "index": "#14",
                    "likes": "0",
                    "time": "04/03/2020-22:42:55",
                    "content": "Here’s an example of the DSR.  The spread is a little unclear though.  @LongForWisdom, can you clarify a little bit what the spread is?  Is it a range? The Docs don’t seem to mention the DSR spread specifically, just the DSR. Poll Opened:  March 2, 2020 Dai Savings Rate Spread Voters can choose the Dai Savings Rate spread to be set anywhere between 0% and 4%. About the Dai Savings Rate:  When the value of Dai goes too far off track from the $1 set-point, adjusting the savings rate is one mechanism for price correction: • If the market price of Dai is above 1 USD, MKR holders can choose to gradually decrease the DSR, which will reduce demand and should reduce the market price of Dai toward the 1 USD Target Price.    • If the market price of Dai is below 1 USD, MKR holders can choose to gradually increase the DSR, which will stimulate demand and should increase the market price of Dai toward the 1 USD Target Price.  For the voter to decide:  A prudent spread for the DSR to be adjusted to be able to respond quickly to the value of Dai going above or below $1. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.398809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#15",
                    "likes": "1",
                    "time": "05/03/2020-00:44:00",
                    "content": "Yes, I agree that it is a bit unclear what the spread is.  I think I know but it should be crystal clear. I like what you did in the text box.  The only thing I would add and some color around the current state of the Dai peg.  I also still feel that, somewhere, there should be a recommendation from someone either on the Maker team or closely involved with it.  I know some will cringe at that but why shouldn’t the people closest to the project be allowed to recommend? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianhacker-pdx",
                    "index": "#16",
                    "likes": "0",
                    "time": "05/03/2020-00:49:14",
                    "content": "Well that inherently goes against the idea of decentralization if you are getting recommendations or biased opinions from the Foundation.  However, perhaps there are some resources out there that could provide some training on the data analysis.  Let me look into it.   That being said, you can always err on the side of caution and in my opinion, that’s never a wasted vote :). Also, whenever we take ownership of something, part of that ownership is the responsibility to dig and locate resources and info.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#17",
                    "likes": "0",
                    "time": "05/03/2020-09:34:38",
                    "content": "The main issue with the Maker Foundation team giving a recommendation is that the Maker Foundation was set up with the specific goal of eventually closing it’s doors and turning over control fully to the community as part of a process of gradual decentralization. Coming to rely on the Foundation for information on how to vote is dangerous because they won’t always be there to provide that information (also centralization risk, etc). Regarding the DSR Spread, @hexonaut is the best person to expand on this. That said, my understanding is that the spread shouldn’t be seen as a monetary policy tool. It’s more of a business-strategy lever to control growth of the system. Lower DSR spread equates to more growth, higher DSR spread equates to more immediate profit (leading to MKR burn.) The current situation is that the DSR is a system parameter that is controlled by two levers, the stability fee lever, and the DSR Spread lever (which is an ‘indirect-lever’ that doesn’t 1-1 correspond to a system parameter). We voted to implement the following relationship: DSR = SF - DSR Spread There is more information under the DSR Spread tag. I believe it was also mentioned in some G&R meetings (there was a presentation!), but I don’t think they are tagged correctly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.337121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#18",
                    "likes": "1",
                    "time": "05/03/2020-13:53:02",
                    "content": "    LongForWisdom:  Lower DSR spread equates to more growth, higher DSR spread equates to more immediate profit (leading to MKR burn.)   I like to view the DSR Spread as a dividend. If it is zero, then our startup (MakerDAO) does not pay a dividend because it is still too small and uses all funds to fuel growth. If the DSR spread is greater than zero - then we are paying something but IMO 1-2% is still too little to have any effect on the MKR price (unlike stock dividends). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#19",
                    "likes": "1",
                    "time": "05/03/2020-14:32:47",
                    "content": "Yep, that’s also a good way of thinking about it. I agree that it won’t have any major affect on MKR price in the short-medium term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.90625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#20",
                    "likes": "0",
                    "time": "05/03/2020-16:13:00",
                    "content": "    LongForWisdom:  The main issue with the Maker Foundation team giving a recommendation is that the Maker Foundation was set up with the specific goal of eventually closing it’s doors and turning over control fully to the community as part of a process of gradual decentralization.   I get that.  It doesn’t have to be someone on the Maker team.  Just please give some thought to how to communicate more analysis to the vote.  Someone like a Cyrus or Vinesh are going to have clear ideas on how these votes should go.  I am interested in hearing some of this analysis before voting.  I don’t care who it comes from, how it’s presented or from where.  Staying silent in the interest of decentralization is only going to lead to unintended consequences.  We all have a couple of clear objectives.  We want (1) people to vote and (2) people to vote intelligently.  You have to assume that the voters do not have an economics background.  MKR voters can be professors, clergy, musicians, doctors, or any other profession and can be from anywhere in the world.  I prefer having the ability to vote myself with proper info over delegating to someone else.  However, if I don’t have the proper info or if it is too inconvenient to get to, I would rather just delegate. This is just feedback from a lay person who wants an easier voting process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.49702380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tarpmaster",
                    "index": "#21",
                    "likes": "0",
                    "time": "05/03/2020-16:18:07",
                    "content": "    adrianhacker-pdx:  That being said, you can always err on the side of caution and in my opinion, that’s never a wasted vote    That assumes you know how you’re voting.  If I vote for a higher DSR so we can bring the price in closer to the peg, is that a conservative vote or a risky vote?  The example I started with is that there is a proposal to lower the ETH debt ceiling.  That makes no sense to me on the surface but I would like to understand why it’s presented in the first place.  As a lay person, try finding the answer to that question.     adrianhacker-pdx:  Also, whenever we take ownership of something, part of that ownership is the responsibility to dig and locate resources and info.    Disagree.  This sort of misses the point.  We are asking people to vote and to vote often.  Voter “turnout” will be persistently low if we have to “dig and locate resources and info.” Edited for misspelled word. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.75
                }
            ]
        }
    ]
}