{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/ces-april-2022-update/14999",
            "title": "CES April 2022 Update ",
            "index": 14999,
            "category": [
                "Core Units",
                "Collateral Engineering Services"
            ],
            "tags": [
                "cu-update",
                "ces-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#1",
                    "likes": "3",
                    "time": "06/05/2022-07:47:59",
                    "content": "CES has switched to a monthly update cadence and a new format with the aim to make it easier to understand and deliver more details on the work delivered. Please, let us know if you like it. If you prefer a video format, we provided our first Quarterly Update a few weeks ago which covers similar topics as this monthly update. If you want more details, read along.  1600×733 112 KB  Roadmap: collapse version - only milestones. Timelines in these updates only include technical scope from CES CU. Most projects include work from other CUs and those timelines are not displayed in these updates.  Collateral Onboarding Let’s start with hard value delivery: New collateral ready to be onboarded!  COD3 - On Chain Collateral Onboarding   1600×733 90.2 KB    EPIC: Onboard wstETH-B ilk As voted by governance, the onboarding of wstETH-B Ilk has been approved and CES timely coordinated with PECU on executing the Spells for Goërli and Mainnet:  Delivered goerli contracts and spell to PECU: Onboard WSTETH-B by lollike · Pull Request #244 · makerdao/spells-mainnet · GitHub  Delivered mainnet contracts and spell to PECU: Onboard WSTETH-B by lollike · Pull Request #244 · makerdao/spells-mainnet · GitHub   This case has been used to agree on the process, deliverables and timings between the 2 teams to assure safe and timely collaboration during Spell crafting as this is a delicate task in the Maker protocol. wstETH-B is planned for the executive vote on Wednesday May 11th.  EPIC: cDAI Technical Assessment The next D3M prioritized integration for a lending protocol is the Compound D3M. In this collateral onboarding, PECU will perform the integration which requires a refactoring of the original D3M Aave implementation to make it scalable. CES is performing and has published the cDAI Token Assessment to the community in the forums as usual.  COD2 - Off Chain Collateral Onboarding CES long-term main focus remains on supporting RWF on onboarding collateral to the protocol in order to bring more non-crypto correlated assets to back DAI.   1600×668 84.4 KB    EPIC: Société Générale OFH Onboarding Implementation has been finalized after discarding the previous implementation which included a wrapper to the OFH token which was deemed not fully compliant by the SocGen legal team. A new vanilla MIP-21 implementation is ready, has been reviewed by PECU and SocGen Devs are using it in our CES Goërli environment. We have taken the chance to make some improvements:  Improve the deployment of MIP21 collateral by creating a RWA token factory to automate the minting of the RWA MIP21 token and transfer it to the SocGen address during the Spell execution which avoids human error prone steps and potential liabilities on members transferring tokens. This will be reusable for future MIP21s. Improved the full repayment flow to avoid DAI stuck in the RWAUrn contract. We’ve added a helper contract which provides an estimation on outstanding debt for a future timestamp which tells SocGen how much DAI to repay as in MIP21 cases, the borrower - SocGen - needs to send DAI to the inputConduit contract and, at a later stage, DIIS Group - Security Agent - pushes the DAI to the RWAUrn, and finally SocGen calls wipe() to pay the debt. These 3 steps differ in time and the outstanding debt increases by the second, hence knowing upfront a good estimate of the debt improves the user experience and reduces extra coordination efforts across SocGen and DIIS Group. This can be reused for future MIP21s as well.  GUI improvements: display error when RPCs are down, display N/A for numeric values when data cannot be fetched, improve Vault Info section, avoid “pushing” to 0x address and added internal monitoring in case the website is down.  Not everything is coding heads down, supporting the overall onboarding process and operations is a must as well. CES worked on the following areas:  Liaised with LTS on drafting a Runbook (operational manual) for SocGen. Provided updated instructions and supported SocGen Devs to interact with their vault in the CES Goërli environment. Shared an end to end video demo to SocGen where the GUI is showcased.  CES has delivered implementation for 2️ new collaterals for the protocol (SocGen and wstETH), but preparation for the next priorities is also happening in parallel as follows:  EPIC: HVB Technical Assessment As agreed on the Collateral Management Offchain (CMOFF) calls, we have coordinated a kick off meeting to inform the HVB Technical Assessment that CES will deliver in the weeks to come.  EPIC: Maple Finance Technical Assessment With the participation of GRO, PECU, RWF, LOVE and LTS; CES has started checkpoints every 2 weeks with Maple Finance to coordinate the overall onboarding process. This is a new onboarding which implies using a D3M technology customized for providing a Credit Line to a specific Maple Finance Liquidity Pool. We are coordinating with PECU on the technical work:  Maple will code the integration which will be overseen by PECU. CES will perform the LP Token Technical Assessment and onboarding process compliance.  Maple Finance has identified a Pool Delegate and RWF, LOVE, LTS and GRO are discussing the next steps on this part of the process. A new MIP6 application for the specific Pool Delegate has been recommended and agreed upon to inform the DAO on the specifics of this loan. These discussions and agreements cement the baseline for growing this partnership further in the future as Maple’s protocol evolves and our relationship growths accordingly.  COD1 - COB Process The collateral onboarding (COB) process has experienced challenges since last year. The pipeline has been stuck and clarity around prioritization has been lacking. Market situation has changed and so has Maker, from the Foundation to a DAO in constant evolution. During Q1/Q2 we have committed to deliver a First revision of the Collateral Onboarding process. Details follow:   1600×275 38.7 KB    EPIC: Collateral Onboarding Process Revamp Two ratified proposals have been delivered. These proposals aim to fine tune the filtering tasks during the collateral onboarding process. In the early days, any collateral that delivered stability fees was good for the protocol, at first only ETH was used as collateral to mint SAI (DAI predecessor). As the protocol evolved, so did the market. Not every collateral fits MakerDAO’s growth objectives and running costs nowadays, hence more details about the proposals, a business case of sorts is needed. MIP6c3-SP2: Modify the collateral application to extend and refocus the initial set of questions a collateral application should answer in order to inform token holders that vote so as to better assess the good fit of such collateral has been ratified. In the same line of thought for Real World Assets, the RWF-001 Core Unit put out MIP4c2-SP18: MIP67 Amendments to define the criteria for assessing what a good RWA means for MakerDAO where CES provided input, as well as publishing a MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding forum post which does a similar job for the crypto-native collateral applications. The above is the background work that was needed before execution. CES moved forward with execution by:  Answering to 50+ MIP6 applications on the forums requesting the project applying to provide information according to the recommended guideline metrics that we have published in order to assess the business case for these collaterals to be onboarded into the protocol. We coordinated with RWF-001 CU so they perform a similar action on 10+ RWA applications that need to update their information to comply with MIP67. Improving the new Collateral Status Index (CSI) spreadsheet with new data points, statuses and a new update cadence. Collateral Management Onchain (CMON) and Collateral Management Offchain (CMOFF) take place weekly with a cross functional team of CU members who discuss new collateral that needs to be prioritized among other bigger long-term initiatives.  In order to deliver communication assets to clarify the changes happening CES delivered:  Updates to the https://collateral.makerdao.com/ site by reducing content duplication and updates to reflect the current process in the Getting Started and Governance and Collateral Onboarding sections of the site. This information will evolve as the Phase II of Collateral Onboarding Process Revamp happens during Q2. We have also aligned on the scope to update the Smart Contracts Domain section and include SAS CU to publish documentation about Keepers.  @Monkey.irish also did an AMA on Collateral Onboarding process and prioritization to provide more details on the process updates.  Lastly, but necessary for completeness, we were ratified as an official Smart Contract Domain Team in the DAO MIP7c3-SP7: CES Domain Team Onboarding which fully enables CES to execute software development to be deployed on the Maker protocol.  Collateral Maintenance  CMD1 - Collateral Operations   1600×275 38.4 KB    EPIC: Scope Collateral Maintenance During CMON meetings stakeholders have agreed that Risk CU will publish a Signal Request based upon the MIP6 Recommended Guideline Metrics for Onchain Collateral Onboarding for collaterals that are no longer fitting such definition and are not considered long term strategic.  General Updates  CMO1 - CU Management & Operations   1600×339 40.6 KB    EPIC: CES Budget Cycle As usual, a new April 2022 Budget Summary has been published.  EPIC: CES Operations As part of our mandate and daily work, improving Developer Experience is a key element which CES takes seriously and spans across several work streams. An improvement on the dss-deploy-scripts has been merged which fixes an issue preventing a smooth makerDAO environment deployment for testing purposes. David Krett @dbkcan started on the CES team and onboarded quickly into the Maker protocol by deploying his own Maker env, executing his first Technical Assessment tasks and providing insights on the RWA lending industry to the team. Please welcome Mabel Tong @zmtong to the CES team!  She started on May 2nd as the new Collateral Program Manager. Mabel is a corporate veteran with over 20 years of program/project management experience in a Fortune 500 company and most recently in Bank of China leading their IT PMO. She is a seasoned Project Management Professional (PMP), Certified Scrum Master (CSM), with hands-on practice in Agile coaching. She first bumped into crypto in 2019 and became mesmerized by the technology and underlying ideology. By joining MakerDAO, she hopes to bring a structured approach in the defi environment while stripping the cumbersome routines of TradFi.  Previous Sprint Updates  CES Sprint Update #1 (2022/Q1 - Jan 31st to Feb 11th 2022) CES Sprint Update #2 (2022/Q1 - Feb 14th to Feb 25th 2022)  CES Sprint Update #3 (2022/Q1 - Feb 28th to Mar 11th 2022) CES Sprint Update #4 (2022/Q1 - Mar 14th to Mar 25th 2022)  Questions❔ Join our Discord and engage with us! JOIN NOW ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmaE5doB#poll-detail",
                        "https://github.com/makerdao/spells-mainnet/pull/244",
                        "https://github.com/makerdao/spells-mainnet/pull/244",
                        "https://forum.makerdao.com/t/compound-d3m-compound-protocol-cdai-erc20-token-ces-domain-team-assessment/14993",
                        "https://diis-group-ui-goerli.vercel.app/",
                        "https://vote.makerdao.com/polling/QmTGxRjL",
                        "https://vote.makerdao.com/polling/QmWt5fov#poll-detail",
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503",
                        "https://forum.makerdao.com/tag/csi-update",
                        "https://collateral.makerdao.com/",
                        "https://www.youtube.com/watch?v=NJsmZL6mRcc",
                        "https://vote.makerdao.com/polling/QmVAD1ZD",
                        "https://forum.makerdao.com/t/mip6-recommended-guideline-metrics-for-onchain-collateral-onboarding/14503",
                        "https://github.com/monkeyirish/ces-core-unit/blob/master/reporting/budget-monthly/2022-04-01.md",
                        "https://github.com/makerdao/dss-deploy-scripts/pull/115#pullrequestreview-928940943",
                        "https://forum.makerdao.com/t/ces-sprint-update-1-2022-q1-jan-31st-to-feb-11th-2022/13273",
                        "https://forum.makerdao.com/t/ces-sprint-update-2-2022-q1-feb-14th-to-feb-25th-2022/13514",
                        "https://forum.makerdao.com/t/ces-sprint-update-3-2022-q1-feb-28th-to-mar-11th-2022/14033",
                        "https://forum.makerdao.com/t/ces-sprint-update-4-2022-q1-mar-14th-to-mar-25th-2022/14451",
                        "https://discord.gg/n7tNRyVYQz",
                        "https://forum.makerdao.com/t/ces-may-2022-update/15825",
                        "https://forum.makerdao.com/t/ces-june-2022-update/16485",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-april-2022/15217",
                        "https://forum.makerdao.com/t/ces-july-and-august-2022-update/17817",
                        "https://forum.makerdao.com/t/ces-september-2022-update/18304",
                        "https://forum.makerdao.com/t/ces-update-october-november-and-end-of-2022-forecast/19050",
                        "https://forum.makerdao.com/t/ces-update-january-2023/19783"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.678983154526632
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/08/2022-07:48:22",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/harbor-update-april-2022/14715",
            "title": "Harbor Update April 2022 ",
            "index": 14715,
            "category": [
                "Updates"
            ],
            "tags": [
                "htc-drop",
                "rwa-004",
                "harbor-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nystateofmlnd1",
                    "index": "#1",
                    "likes": "4",
                    "time": "20/04/2022-21:53:39",
                    "content": " Banner India1584×396 75 KB  Maker Community, This month we are pleased to announce an expansion of our trade finance operations to India. This announcement comes after Harbor’s recent geographic expansion into Mexico in February and is part of the strategic roadmap to build Harbor’s global platform for SME’s. The scope of Harbor’s offering in India will be receivables finance for the 63 million MSME sized businesses which represent 40 percent of all Indian export volume. India’s MSME segment represent 45 percent of industrial production and contributes around 30 percent to India’s GDP which is forecasted to be 8.4 trillion USD by 2030. More details can on our expansion be found here:   Global Trade Review (GTR) – 20 Apr 22    SCF firm Harbor expands into India Receivables and supply chain finance (SCF) provider Harbor has announced it is expanding into India, as it works to roll out its offering to businesses in developing markets. The Miami-headquartered company is launching its India operations through a...  Est. reading time: 2 minutes       Other updates:   Origination in our key markets remains strong. Fiscal year in India was March 31st, great timing for our official launch in the market.   Pool Value peaked at 5.7 million DAI in March   Current Maker utilization sits at 1.48 million DAI   As always, please feel free to contact us with any questions here in the forum or at [email protected]. Bryan Maloney ",
                    "links": [
                        "https://www.gtreview.com/news/on-the-move/scf-firm-harbor-expands-into-india/",
                        "https://forum.makerdao.com/t/rwf-001-monthly-update-april-2022/15024"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.961805555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/07/2022-21:54:08",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/fortunafi-update-may-2022/15772",
            "title": "Fortunafi Update - May 2022 ",
            "index": 15772,
            "category": [
                "Updates"
            ],
            "tags": [
                "fortunafi",
                "fft1-drop",
                "rwa-005"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Fortunafi",
                    "index": "#1",
                    "likes": "7",
                    "time": "13/06/2022-18:30:02",
                    "content": "Pool Value: 5.8 million DAI Maker Utilization: 4.2 million DAI Debt Ceiling: 15 million DAI Stability Fee: 4.50% Pool Updates As of May 31, 2022, the Pool held ten (10) loans with a total value of approximately $5.8 million. An additional loan was made to an existing borrower during May, in the amount of $50,000. The borrower is a small yet profitable SaaS business that has more than doubled its revenues in the past year. This brings the total number of assets added to the Pool during 2022 to four (4) new loans, for a total invested amount of $2.7 million. During March, the Pool had its first loan paydown, in the amount of $500,000. The borrower paid full principal and accrued interest, resulting in the payoff of its two (2) related asset NFTs. Despite good performance from the borrower, due to the variable nature of revenue-based loans, the overall IRR on the loan of approximately 11.5% was slightly below the Pool’s target of 15%. As a result, a small amount of accrued interest to the asset NFTs is being written off. This small impact is comfortably absorbed by the junior (TIN) tranche, while the loan’s return more than covered the required return on the senior (DROP) tranche. New Asset Originator In our continued efforts to add high-quality assets to the Pool, while improving diversification, we are onboarding a new Asset Originator (“AO”). As a part of this process, we have updated the Pool’s Executive Summary (“ES”) and are notifying all Pool investors and the Maker community. Follow this link to view the updated ES and subscription document. Please note that due to a confidentiality agreement we are currently not allowed to publicly announce the name of the new AO. For this reason, the linked ES is partially redacted. Existing investors in the Pool and the RWF Team have received a non-redacted version. The onboarding process and the changes to the ES will take effect twenty-eight (28) days after this posting. The Pool will benefit from a new source of assets and an increased ability to source from a larger variety of underlying borrowers. The new AO currently has monthly originations running at $40-60 million, creating plenty of investable capacity for the Pool. We also want to highlight that capacity available in the Pool’s Maker Vault will not be used for these new assets. Due to Pool mechanics, and to the benefit of Maker, the new collateral will still back the Vault, but usage amount of the line will be limited to assets originated by Corl - the AO that has been reviewed by the RWF Team and passed the approval process when the Pool was first launched. To summarize, this means that (1) Maker will benefit from greater diversification and more collateral backing the Vault, however, (2) as more capital enters the Pool to support growth in deployment to the new AO’s assets, Maker’s exposure relative to the size of the Pool could decline over time (this dynamic may change should Maker approve Vault usage for this new AO). We hope to work with the RWF Team on the approval process of this new AO for the Maker Vault. There is great potential for scale in terms of Maker’s ability to deploy capital, which would contribute to the mission of increasing RWA exposure as well as increasing profit generation in a sensible manner. Fortunafi Team ",
                    "links": [
                        "https://forum.makerdao.com/t/actualizacion-de-fortunafi-mayo-2022-traduccion/15896",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.462949465500486
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/06/2022-21:35:37",
                    "content": "    Fortunafi:  As of May 31, 2022, the Pool held ten (10) loans with a total value of approximately $5.8 million   Do you happen to have updated figures after May 31, 2022 ? Thanks for the post! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fortunafi",
                    "index": "#3",
                    "likes": "2",
                    "time": "13/06/2022-22:47:07",
                    "content": "Hi @MFeinberg , Currently we’re at 10 assets with a total value of approximately $7 million. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/06/2022-23:44:29",
                    "content": "Thanks Hugo/Nick. Given the contractionary economic/financial conditions across the board, could you provide an outlook for Saas/E-commerce revenue-based finance? Are we seeing any delinquencies at any of the usual suspects of originators? Any weakness in top-line of publicly traded SaaS business as of Q1? Any contraction/lay-offs at RBF originators with which you have familiarity? (of the Pipe, Corl, and Uncapped ilk). I’d categorize end-obligors as selling a product/service that is, to a large extent discretionary. As rates rise and debt becomes more expensive to service/difficult to raise, lay-offs spread from high-flying, venture-reliant tech to normal big business, and consumer balance sheets weaken, I’ve got to imagine these sorts of businesses may struggle before others. B2C e-commerce would presumably suffer as consumers focus towards gas, food, medicine, and vice. B2B SaaS might suffer as companies batten down the hatches and flip through their bull-market menus of non-critical SaaS subscriptions. This latter suggestion also hinges on the nature of the subscription service—lot of stuff a start-up will cut prior to instrumental software, of course. Seems all is well in vault-land for the moment…this hopefully continues. The properties of the loans themselves is, all things considered, is pretty good. On the Saas side, customers are locked into contracts and the notes are short term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.395975056689343
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/06/2022-23:46:52",
                    "content": "I think cash flow negative businesses dependent on future equity funding are likely most at risk What are you seeing with this risky subset? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "0",
                    "time": "14/06/2022-00:13:50",
                    "content": "    teej:  B2C e-commerce would presumably suffer as consumers focus towards gas, food, medicine, and vice.   The CFO of BofA might take the other side of that trade: consumers are spending and in great shape, loan growth is good, credit quality is improving Source From my window view consumer spending is pretty healthy… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#7",
                    "likes": "1",
                    "time": "14/06/2022-00:25:47",
                    "content": "I certainly hope you’re right but don’t like the chimera of increasing debt service costs on consumer credit (cards + BNPL) and looming lay-offs. Labor market is tight af for the moment though. The cure for high prices is high prices. Who’s going to buy a linen polo if they can’t fill-up the car at the pump? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6414285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/06/2022-00:43:09",
                    "content": "    teej:  looming lay-offs. Labor market is tight af for the moment though.   Those lay-offs will mostly come from Tech Startups and PLCs that are yet to be profitable (like Uber/Tesla). Well-established Tech companies like Salesforce, Apple, etc., won’t need to cut their workforce; alternatively, consumer staples & the service industry are both desperately seeking to hire. Not enough Airport staff–Airlines and Hotels are overbooked; while American infrastructure remains in desperate need of builders. As far as Gas Prices, we both know this is not 1970’s when public transportation was unreliable, or a time when alternative options were not available. You couple that with the excitement from people to finally move (have freedom) beyond this pandemic, I don’t see $6, $7, $8, or $9 per gallon slowing people down. But time will tell. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.484487734487734
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fortunafi",
                    "index": "#9",
                    "likes": "0",
                    "time": "14/06/2022-00:59:12",
                    "content": "Hi Teej, There’s certainly some uncertainty given the current market environment and the overall negative sentiment.  That being said, consumer spending and credit growth remain strong for now.  Retail sales in the U.S. have continued to grow at high single digits, and Redbook index growth remains in the low double digits, despite the tough 2021 comps!  When looking at small business lending default rates in general ( in the U.S.), we still haven’t seen an increase reflected in data from our relationships in the space, securitization deals we’re familiar with, or even from SBA data (Small Business Administration). Nevertheless, we remain cautious on any new originations, while also looking forward to the potential opportunity a tighter lending environment may bring.  It’s possible that good, cash flowing businesses that were previously able to access cheaper capital may see their options reduced.  Some of this will be a result of “throwing the baby out with the bath water” as more conventional lenders simply step back without trying to discern between good and bad risks.  That could present us with great, less risky opportunities while in the middle of a risk averse environment.  We’ll see. We do believe that SaaS and subscription/contracted revenue businesses should demonstrate a higher degree of stability or resilience, which is why close to 90% of the pool is exposed to such businesses.  It’s also the reason we like this new AO we’re onboarding, as over 90% of their originations fall into such categories.  Many such businesses can often cut off growth spending and immediately generate tremendous amounts of cash. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.475224466891133
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fortunafi",
                    "index": "#10",
                    "likes": "0",
                    "time": "14/06/2022-01:16:00",
                    "content": "Hi Eumenes, I think you’re right that such businesses are at higher risk.  As I mentioned in the response to Teej,  SaaS and subscription/contracted revenue businesses should be more resilient.  Couple of real examples that highlight your point, that have come across our desk recently:   an ecommerce business that has been around since 2015.  Seems to be decently managed and introduced some innovative tech.  Unfortunately, despite good financial decisions (no silly debt), they’ve been running on equity raised several years ago but have never been profitable.  Covid hurt them and revenues have been in decline since 2020.  Time is running out and there’s little fat to cut.  A recession may hit this business very hard and new equity is unlikely to be found.   a SaaS subscription business for consumers.  Very popular and grew for several years.  Benefitted from Covid and revenues started to decline in 2021 due to “Covid hangover”.  Cash burn driven by ad spend and some contracted labor.  Existing subscriber retention rate is very good.  If they go into emergency mode they can cut most of the ad-spend and half of the labor cost, instantly, generating a potential up to 40% of current revenues in cash and easily paying off existing obligations.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.695137886804553
                },
                {
                    "author_link": "https://forum.makerdao.com/u/teej",
                    "index": "#11",
                    "likes": "0",
                    "time": "15/06/2022-02:05:47",
                    "content": "    teej:  Are we seeing any delinquencies at any of the usual suspects of originators? Any weakness in top-line of publicly traded SaaS business as of Q1? Any contraction/lay-offs at RBF originators with which you have familiarity? (of the Pipe, Corl, and Uncapped ilk).   Thanks very much Hugo (presumably). Could you please answer the above? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.21
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fortunafi",
                    "index": "#12",
                    "likes": "1",
                    "time": "16/06/2022-15:05:52",
                    "content": "When looking at small business lending default rates in general ( in the U.S.), we still haven’t seen an increase reflected in data from our relationships in the space, securitization deals we’re familiar with, or even from SBA data (Small Business Administration). Revenue growth for large, publicly traded SaaS companies remained pretty solid in the 1st quarter of the year. As far as layoffs, we haven’t seen anything specific beyond the layoffs in tech that are being announced.  Some large banks may slowing hires or laying off a few people in mortgage lending departments (saw that Wells Fargo is apparently cutting ~100 people). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.962912087912088
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "14/09/2022-15:06:43",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/harbor-update-may-2022/15598",
            "title": "Harbor Update May 2022 ",
            "index": 15598,
            "category": [
                "Updates"
            ],
            "tags": [
                "htc-drop",
                "rwa-004",
                "harbor-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/nystateofmlnd1",
                    "index": "#1",
                    "likes": "3",
                    "time": "03/06/2022-19:08:51",
                    "content": " Harbor Pool Updates  Maker Utilization: 788K DAI, 2mm DAI expected utilization in June Pool Value: 3.65mm DAI at month end, back to ~5mm DAI in June  Although utilization is a bit down, new originations have picked up in May since the launch of our Indian operations in April. Primarily, the scope of origination in India is receivables finance for SME exporters. Receivables Finance provides diversification to the portfolio and allows for exposure to investment grade obligors. Harbor plans to replicate our origination strategy and enter a few more key markets this year. Geographic diversification will also help mitigate some of the risks around supply chain disruptions triggered by Covid lockdowns, most notably the current situation in Greater China. Market Conditions Shipping times, material and component scarcity and production shutdowns continue to ripple up and down the supply chain. Working capital gets tied up in production and in transit inventory which creates a liquidity squeeze. We are seeing this firsthand with new and existing counterparties in the portfolio. We touched on this briefly last month in our market recap. Its likely that these issues will be short lived as demand and production capacity start to normalize at the latter part of this year. In the meantime, we will continue to assess the supply chain disruptions and the impact on our portfolio. Opportunities and Growth “Every problem is an opportunity in disguise.” – John Adams The divide between buyers and suppliers’ requirements when it comes to payment terms continues to widen to cope with longer operating cycles. Harbor’s trade finance programs satisfy these requirements for buyers and suppliers alike. That said, we see a lot of opportunity to finance these trade flows, especially those coming out of emerging markets. In the coming months we’ll be expanding into new markets and we look forward to sharing with the community. As always, please feel free to contact us with any questions here in the forum or at [email protected]. ",
                    "links": [
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.618566618566618
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/09/2022-19:09:31",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/fortunafi-update-june-july-2022/17089",
            "title": "Fortunafi Update - June/July 2022 ",
            "index": 17089,
            "category": [
                "Updates"
            ],
            "tags": [
                "fortunafi",
                "fft1-drop",
                "rwa",
                "rwa-005"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Fortunafi",
                    "index": "#1",
                    "likes": "4",
                    "time": "08/08/2022-13:17:32",
                    "content": "Pool Value: 7.0 million DAI Maker Utilization: 5.4 million DAI Debt Ceiling: 15 million DAI Stability Fee: 4.50% Pool Updates As of July 31, 2022, the Pool held eleven (11) loans with a total value of approximately $7.0 million.  One new loan was added to the pool during June, in the amount of $1.25 million.  The borrower is a subscription business offering a suite of marketing services.  Their customer base includes businesses in various stages of growth, from start-ups to large established brands, and operating in a wide range of sectors.  Recent acquisitions have added new services to their suite, which are being integrated into their platform and creating cross-selling opportunities to its vast client-base. Market Commentary Delinquencies in small business lending remain under control.  As an example, securitization pools of small business lenders, such as Ondeck and Kapitus, continue to show low delinquency levels below 3-4%. The U.S. consumer has continued to spend at a healthy pace, with year-on-year (“YoY”) growth of personal expenditures remaining positive.  Recent Redbook Index readings also show strong YoY growth in same store sales of retailers.  Mastercard’s SpendingPulse data tells a similar story as of July. Real Personal Consumption Expenditures (YoY)  344x1111440×464 21.4 KB  Redbook Index  337x160723×343 3.45 KB   579×855 62.5 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-july-2022/16954"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.965367965367966
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "06/11/2022-13:17:59",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/ces-june-2022-update/16485",
            "title": "CES June 2022 Update ",
            "index": 16485,
            "category": [
                "Core Units",
                "Collateral Engineering Services"
            ],
            "tags": [
                "cu-update",
                "ces-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#1",
                    "likes": "9",
                    "time": "11/07/2022-08:55:10",
                    "content": "CES June 2022 Update  1600×609 84.5 KB  Roadmap: collapse version - only milestones. Timelines in these updates only include technical scope from CES CU. Most projects include work from other CUs and those timelines are not displayed in these updates.  TL;DR  HVB Onboarding Governance poll went live and executive spell is in preparation. Société Générale User Acceptance Test with SocGen Forge Devs and DIIS Group (Security Agent) was executed successfully. Governance Onboarding Poll is being drafted and will go live soon. Offboarding 5 Ilks (UNI-A, UNIV2DAIETH-A, UNIV2WBTCETH-A, UNIV2UNIETH-A, and UNIV2WBTCDAI-A) has started. rETH onboarding technical implementation is ready. Awaiting oracle improvements. A review of the Technical Assessment and implementation will be done as rETH has published protocol updates. MIP65 project kicked-off internally with all involved CUs and Technical Assessment is in progress. PAXG MIP6 Application has been set to status “Will not do”. More details in the MIP6 forum thread. Weekly CMON and CMOFF meetings merged into a single monday meeting. A new monthly CMON and CMOFF meeting was established to discuss longer term initiatives.   Collateral Onboarding  On Chain and Off Chain Collateral Onboarding   1600×1052 127 KB    EPIC: HVB Technical Assessment and HVB onboarding An addendum to the Technical Assessment was published in the forum which is a response to mitigating counterparty and single point of failure risks. The onboarding governance poll went live on the Governance site. The first of 4 executive spells for this deal is in preparation.  EPIC: Société Générale OFH Onboarding An User Acceptance Test was organized during June and executed successfully on July 5th. This exercise included the 2 actors operating vault smart contracts: SocGen Forge developers and DIIS Group (Security Agent) who used the UI that was developed for this deal. The onboarding governance poll is being drafted and will go live soon.  EPIC: rETH Onboarding The technical implementation for the rETH collateral onboarding was finalized. We are awaiting Oracle’s improvements before CUs move on with the Executive Spell. During July, CES will review the Technical Assessment and implementation as rETH protocol has published an update which might impact the onboarding.  Collateral Management  1600×856 124 KB   EPIC: Collateral Offboarding The Executive Spell to offboard UNI-A, UNIV2DAIETH-A, UNIV2WBTCETH-A, UNIV2UNIETH-A, and UNIV2WBTCDAI-A Ilks was crafted and executed successfully. Liquidations have started as planned. The communication process specified on MIP62 was followed and coordination efforts were facilitated by @zmtong curing the CMON weekly meetings.  EPIC: Deliver MIP65 Technical Assessment As part of MIP65, CES has taken the steps to:  Execute a project kick-off meeting internally with all the CUs involved. Started drafting a Technical Assessment which will be published as usual in the forums.  Since this project does not involve onboarding any new collateral to the protocol, we consider these activities as Collateral Management activities. The coordination will remain happening in the CMOFF meetings and CSI will be used to provide visibility on the work updates on a weekly basis as with other projects.  Program Management  1600×436 54.7 KB  A response to the PAXG MIP6 application was posted on the forum as decided during the CMON meetings. The CMON and CMOFF meetings which used to happen respectively on mondays and wednesdays have been merged into a single meeting taking place on mondays. A new monthly meeting was established to discuss CMON and CMOFF longer term initiatives.  General Updates  CU Management & Operations  Published the June 2022 Budget Summary  CES Presentation on the Open Decentralized Voter Committee | June 29, 2022    Previous Sprint Updates  CES Sprint Update #1 (2022/Q1 - Jan 31st to Feb 11th 2022) CES Sprint Update #2 (2022/Q1 - Feb 14th to Feb 25th 2022)  CES Sprint Update #3 (2022/Q1 - Feb 28th to Mar 11th 2022) CES Sprint Update #4 (2022/Q1 - Mar 14th to Mar 25th 2022) CES April 2022 Update CES May 2022 Update  Questions❔ Join our Discord and engage with us! JOIN NOW ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmQMDasC#poll-detail",
                        "https://github.com/clio-finance/official-spells-goerli/blob/feat/onboard-HvB/src/Goerli-DssSpellCollateralOnboarding.sol",
                        "https://diis.makerdao.dev/",
                        "https://github.com/clio-finance/official-spells-goerli/tree/feat/spell-retha-goerli-with-oracle",
                        "https://vote.makerdao.com/executive/template-executive-vote-core-unit-mkr-transfer-and-advancing-collateral-offboardings-june-29-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP62",
                        "https://mips.makerdao.com/mips/details/MIP65",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&range=E13",
                        "https://forum.makerdao.com/t/paxg-pax-gold-mip6-collateral-application/2584/14",
                        "https://github.com/monkeyirish/ces-core-unit/blob/master/reporting/budget-monthly/2022-07-01.md",
                        "https://www.youtube.com/watch?v=yO0i2bP_UZM",
                        "https://forum.makerdao.com/t/ces-sprint-update-1-2022-q1-jan-31st-to-feb-11th-2022/13273",
                        "https://forum.makerdao.com/t/ces-sprint-update-2-2022-q1-feb-14th-to-feb-25th-2022/13514",
                        "https://forum.makerdao.com/t/ces-sprint-update-3-2022-q1-feb-28th-to-mar-11th-2022/14033",
                        "https://forum.makerdao.com/t/ces-sprint-update-4-2022-q1-mar-14th-to-mar-25th-2022/14451",
                        "https://forum.makerdao.com/t/ces-april-2022-update/14999",
                        "https://forum.makerdao.com/t/ces-may-2022-update/15825",
                        "https://discord.gg/n7tNRyVYQz",
                        "https://forum.makerdao.com/t/ces-july-and-august-2022-update/17817",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923",
                        "https://forum.makerdao.com/t/ces-september-2022-update/18304",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/ces-update-october-november-and-end-of-2022-forecast/19050",
                        "https://forum.makerdao.com/t/ces-update-january-2023/19783"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.465167984189724
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/10/2022-08:55:55",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/ces-may-2022-update/15825",
            "title": "CES May 2022 Update ",
            "index": 15825,
            "category": [
                "Core Units",
                "Collateral Engineering Services"
            ],
            "tags": [
                "cu-update",
                "ces-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/M_C",
                    "index": "#1",
                    "likes": "6",
                    "time": "15/06/2022-19:15:09",
                    "content": " 1600×609 86.4 KB  Roadmap: collapse version - only milestones. Timelines in these updates only include technical scope from CES CU. Most projects include work from other CUs and those timelines are not displayed in these updates.  TL;DR  sETH2 Technical Assessment published with outcome: High risk. CMON stakeholders agreed to not invest in more assessment work until the mitigations are put in place by the sETH2 protocol. Maple Finance and HVB Technical Assessments are in the feedback round and will be published soon. The on-chain poll for offboarding 5 Ilks passed and PECU, GovAlpha, GovComms and CES are coordinating towards an executive vote for the week of june 22nd approx. CES CU supported SGF Devs on testing operations for the vault deployed on the CES Goërli environment.  CSI daily updates and weekly summary forum posts were executed as expected. The CMON and CMOFF stakeholder meetings involve CSI updates and decisions as well as digging into a new internal implementation sheet to further coordinate onboarding activities.   Collateral Onboarding  On Chain and Off Chain Collateral Onboarding   1600×1318 213 KB    EPIC: sETH2 Technical Assessment The token technical assessment was published in the forum with risk analysis as HIGH and guidance on mitigating these risks were provided to the protocol. CMON stakeholders decided that it is not worth continuing executing assessments (Risk and Oracles) under the current circumstances and the status for this MIP6 application was set to Postponed as detailed here.  EPIC: Maple Finance Technical Assessment A thorough protocol and pool token technical assessment has been completed and circulated internally for feedback with RWF, LTS, incubating LOVE and PECU and later shared with Maple Finance. Publishing is expected to happen in the upcoming days. More information about other updates from this deal can be found in the weekly LTS updates.  EPIC: HVB Technical Assessment and HVB onboarding The technical assessment is on the feedback stage. Publishing is expected to happen in the upcoming days. Implementation of this collateral onboarding started using a MIP21 with minor modifications:  Removing the inputConduit as this is not needed in the HVB deal setup. Adding a new RwaJar contract which is a dss-blow fork. This will be used to repay the fees accrued which will be paid to the Surplus Buffer. The principal repayment will be done directly to the RWAUrn. This setup eases the accounting for RWA MIP21 deals and will become the standard for these money flows. A new job to the keeper network will be created in order to interact with the RwaJar.  More information about other updates from this deal can be found in the weekly LTS updates.  EPIC: Société Généralé OFH Onboarding Throughout the month of May we supported the SGF developers while they were performing tests on operating the vault that is deployed in the CES Goërli environment. We remained in touch in our weekly status calls. Final steps are being coordinated.  Collateral Management  1600×486 64.8 KB  Following the process defined in MIP62, CES published a Signal Request for offboarding 5 Ilks that are not profitable anymore. In coordination with GovAlpha the corresponding 5 governance on-chain polls were published and token holders decided the 5 Ilks must be offboarded. CES used this as a driver to more formally define the offboarding activities that need to happen. A new internal Maintenance sheet outlines the process, responsibilities and timelines to execute successfully the full process.This is reviewed and updated when needed during the weekly CMON meetings. The spell and coordination work with PECU, GovAlpha, GovComms, TechOps and CES is ongoing and expected to finalize with an executive vote on the week of June 22nd approx.  Program Management 1600×337 41.7 KB   As we have staffed our team, we have progressively evolved how we structure our work among ourselves and the tasks that we have at hand. The Collateral Onboarding Process (COB) milestones and epics have been redefined. During May, a hand over on a set of responsibilities has been executed:   CSI daily updates and weekly forum post are managed by @agtaghoyjr with support from @zmtong  CMON and CMOFF meetings are led by @zmtong  from SES. A new internal Implementation sheet was created and aligned across CUs which details the overall steps to onboard collateral for each collateral tech ( gemJoins, D3Ms, MIP21, etc) that MakerDAO has available. This internal sheet aims to avoid miscommunication and is a tool for time planning and project management which serves as an extension of the CSI which remains an overview for the community.  With the aim to facilitate the understanding of the onboarding process and make it a self-service approach a new Quick Start Guide was published among small improvement to the overall collateral.makerdao.com   General Updates  CU Management & Operations   1600×377 45 KB    EPIC: CES Budget Cycle  Published the May 2022 Budget Summary    Previous Sprint Updates  CES Sprint Update #1 (2022/Q1 - Jan 31st to Feb 11th 2022) CES Sprint Update #2 (2022/Q1 - Feb 14th to Feb 25th 2022)  CES Sprint Update #3 (2022/Q1 - Feb 28th to Mar 11th 2022) CES Sprint Update #4 (2022/Q1 - Mar 14th to Mar 25th 2022) CES April 2022 Update  Questions❔ Join our Discord and engage with us! JOIN NOW ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-offboard-uni-univ2daieth-univ2wbtceth-univ2unieth-and-univ2wbtcdai/15160",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672",
                        "https://forum.makerdao.com/tag/csi-update",
                        "https://forum.makerdao.com/t/seth2-token-smart-contract-technical-assessment/15283",
                        "https://forum.makerdao.com/t/seth2-collateral-onboarding-application-mip6/14371",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672&range=A61",
                        "https://forum.makerdao.com/t/incubating-legal-transactional-services-lts-weekly-update/14977/7",
                        "https://forum.makerdao.com/t/incubating-legal-transactional-services-lts-weekly-update/14977/7",
                        "https://mips.makerdao.com/mips/details/MIP62",
                        "https://forum.makerdao.com/t/signal-request-offboard-uni-univ2daieth-univ2wbtceth-univ2unieth-and-univ2wbtcdai/15160",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672",
                        "https://forum.makerdao.com/tag/csi-update",
                        "https://collateral.makerdao.com/quick-start-guide",
                        "https://collateral.makerdao.com/",
                        "https://github.com/monkeyirish/ces-core-unit/blob/master/reporting/budget-monthly/2022-05-01.md",
                        "https://forum.makerdao.com/t/ces-sprint-update-1-2022-q1-jan-31st-to-feb-11th-2022/13273",
                        "https://forum.makerdao.com/t/ces-sprint-update-2-2022-q1-feb-14th-to-feb-25th-2022/13514",
                        "https://forum.makerdao.com/t/ces-sprint-update-3-2022-q1-feb-28th-to-mar-11th-2022/14033",
                        "https://forum.makerdao.com/t/ces-sprint-update-4-2022-q1-mar-14th-to-mar-25th-2022/14451",
                        "https://forum.makerdao.com/t/ces-april-2022-update/14999",
                        "https://discord.gg/n7tNRyVYQz",
                        "https://forum.makerdao.com/t/ces-july-and-august-2022-update/17817",
                        "https://forum.makerdao.com/t/ces-june-2022-update/16485",
                        "https://forum.makerdao.com/t/ces-september-2022-update/18304",
                        "https://forum.makerdao.com/t/ces-update-october-november-and-end-of-2022-forecast/19050",
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-mayo-del-2022/16043",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-may-2022/15932",
                        "https://forum.makerdao.com/t/ces-update-january-2023/19783"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4209517045454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/09/2022-19:16:08",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "984"
}