{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-adjust-eth-b-line-iam-ceiling/5731",
            "title": "[Signal Request] Adjust ETH-B line (IAM-Ceiling) ",
            "index": 5731,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "collateral",
                "eth-b",
                "iam",
                "sig-status-rejected",
                "dc-iam"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "4",
                    "time": "18/12/2020-20:51:32",
                    "content": " Overview Since IAM was activated for ETH-B on Monday, the DC has almost doubled in the first four days (from 10 MM on Monday to to 18.5 MM at 2020-12-18). Looks like the appetite for people minting day with a lower CR but a higher SF seems quite high. We do have a lot of headroom since the line for ETH-B is at 50 MM, but next onchain poll is 3.5 weeks away - so why not start preparing for that  Next onchain-poll will likely happen on January 11th and a lot of people might be half-active/in-active in the next weeks, so I thought it makes sense to start the signal right now  Pros  more fees collected more DAI in circulation   Cons:  increased exposure to ETH volatility   line adjustment Here are a few polling options with +50%, +100%, +200%. Please note that this is the IAM-DC, so if you are not familiar with the Instant Access Module - here is the MIP.     150 MM (+200%) 100 MM (+100%) 75 MM (+50%) 50 MM (no change) Abstain     0 voters      Next Steps Poll will run until January 7th 14th and depending on the result will move on-chain assuming the outcome of the poll deems it necessary  Update As expected raising the ceiling might have significant impact on the exposed risk and therefor potentially on the SF as well. Keeping the poll open for another week. Please have a look at the discussion, especially at @Primoz comment. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip27-debt-ceiling-instant-access-module/4625",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-b-line-iam-ceiling/5731/15",
                        "https://forum.makerdao.com/t/rates-changes-proposal-6-jan-2021/5948/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-26-en-espanol/5768",
                        "https://forum.makerdao.com/t/maker-relay-ep-26/5759",
                        "https://forum.makerdao.com/t/lets-get-dsr-above-0-again/6166",
                        "https://forum.makerdao.com/t/governance-at-a-glance-2021-01-07/5959/5",
                        "https://forum.makerdao.com/t/governance-at-a-glance-2021-01-07/5959"
                    ],
                    "GPT-summary": "The author of the post is proposing an adjustment to the ETH-B line (IAM-Ceiling) and is seeking feedback from the community through a poll. The post also acknowledges potential pros and cons of the proposal and provides options for the polling. Additionally, the author provides an update on the discussion and extends the poll for another week. A third party provides constructive criticism in the comments section, highlighting potential risks and suggesting further analysis.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.257908163265306
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/12/2020-20:53:03",
                    "content": "I will also create a signal request tomorrow (?) about adding a new WBTC-Vaulttype with IAM with a lower LR and a higher SF - i think ETH-B proves that people are totally willing to pay more fees for getting a better LR and we should support this as it helps to bring more DAI on the market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.74025974025974
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#3",
                    "likes": "3",
                    "time": "18/12/2020-21:00:18",
                    "content": "Not sure if we should be increasing ETH-B exposure with the current liquidation system. Will be interesting to see the Risk teams take. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#4",
                    "likes": "0",
                    "time": "18/12/2020-21:01:42",
                    "content": "also keep in mind that IAM makes sure that the DC is not maxed out directly, as the DC gets upped only every 12h by 5 MM (at least with the current configuration): Maximum Debt Ceiling (line): 50 million DAI Target Available Debt (gap): 5 million DAI Ceiling Increase Cooldown (ttl): 12 hours  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/12/2020-21:08:18",
                    "content": "to be on the safe side I would not touch the gap and the ttl but apart from that I am not feeling uncomfortable with raising the line ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#6",
                    "likes": "3",
                    "time": "19/12/2020-00:15:40",
                    "content": "I think @Primoz will have to weigh in on this because I think we’ll have to increase the SF if we push the line past 50M. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#7",
                    "likes": "1",
                    "time": "19/12/2020-02:13:56",
                    "content": "If the debt ceiling of ETH-B exceeds 50 million, we must increase SF accordingly, which is necessary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#8",
                    "likes": "11",
                    "time": "19/12/2020-07:39:34",
                    "content": "Max Debt Ceiling that were based on thresholds where Risk Premium start reaching double digit values, in case of ETH-B around 14% at 50m. At current debt exposure Risk Premium would be around 6%. Rates Group did propose SF increase to 5% for this reason last week and this should be implemented when executive passes. We’ll monitor situation and react at next possible executive. We are noticing though that ETH-B users are a bit more risk taking versus ETH-A (apart from lower collateralization levels used, they also seem to be using less collateral buffer to protect against getting liquidated). Since the box parameter is only 15m, this might be becoming an issue. Potentially we should also revaluate if box of 15m is still appropriate. This limiting factor is probably one of the biggest hurdles right now that makes me a bit uncomfortable against increased portfolio risk exposures despite higher compensation from fees. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.471088435374149
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#9",
                    "likes": "0",
                    "time": "21/12/2020-17:39:47",
                    "content": "The problem with increasing eth b vault type to double digit interest rates is that we are punishing early adopters for new customers and the end result could ultimately lead to a loss of revenue. I’d prefer to cap eth b vault to a debt ceiling that matches market rates and create a new vault type for further rate increases. I understand however this implies more work for SC domain teams and I’m not entirely sure how a new vault type affects auctions efficiency/liquidity in case of liquidation ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.421717171717172
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#10",
                    "likes": "0",
                    "time": "21/12/2020-17:53:34",
                    "content": "    mario:  I’d prefer to cap eth b vault to a debt ceiling that matches market rates and create a new vault type for further rate increases.   How does this reduce our risk w.r.t. to liquidations? If Eth vaults with a fixed low LR gets liquidated it does not matter if it is eth-B or eth-c ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.295454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#11",
                    "likes": "0",
                    "time": "21/12/2020-18:02:20",
                    "content": "I mean whatever the market rate is, determine the cap on the DC. Further increases that imply higher rates to cover risk to be integrated through a new vault type with a different rate and so forth. That way you keep the customers and can adjust your premium accordingly through the new vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1751893939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#12",
                    "likes": "1",
                    "time": "28/12/2020-15:49:57",
                    "content": "update: we are now at 39MM dai-from-eth-b, if we stay with the current velocity we are going to hit the DC at the end of this week ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#13",
                    "likes": "1",
                    "time": "03/01/2021-06:43:30",
                    "content": "update: we lerped up to the upper boundary of 50 MM ceiling, 45MM DAI minted. have been a little optimistic with my prediction, but lets see what happens today  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.53125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "4",
                    "time": "04/01/2021-00:00:54",
                    "content": "I’m not seeing a lot of consensus in this poll so far. Please remember that you can vote for multiple options. I also feel like this is one of the situations where voters should consider modifying their votes based on the input from the Risk team. It’s naturally hard to tell if this is happening, but yeah, worth consideration if you haven’t thought about your vote since you made it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.135416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#15",
                    "likes": "12",
                    "time": "06/01/2021-20:53:17",
                    "content": "I don’t particularly like increasing ETH-B DC at this stage to be honest. One reason is that until liquidations 2.0 are released we are relying on 15m box parameter which is very low considering current DAI debt exposure and this is particularly dangerous for ETH-B. I am not sure if we have good argument to increase box, but it would be very beneficial knowing that we have more support from keepers and increase it. Second reason is low Surplus Buffer and the outcome of the Poll where people aren’t necessarily in favour of increasing it. We can’t have Surplus Buffer representing 0.3% of DAI debt and meanwhile aggressively increasing debt exposure of both ETH-A and riskier ETH-B. Third, are we ok to come into situation where debt exposure to ETH-B increases towards 100m and then realize we need higher SF to compensate for risk? Are we going to be ok by suddenly charging 10% or more for ETH-B? We had similar situation with YFI-A and it didn’t turn out good. Fourth, I know nobody wants to miss on new DAI mint, but ETH-B users could very well be same users who would use ETH-A otherwise. It is possible Maker is stealing users from Compound and Aave currently with ETH-B, but don’t forget that Maker has OSM and others don’t, so these people might prefer to use Maker even at slightly higher LR. This is only speculation though. Fifth and lastly, maybe we should just slightly press brakes during this insane growth. But it’s me representing Risk so maybe I am too cautious for some. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-10th-2021/6046",
                        "https://forum.makerdao.com/t/signal-request-debt-ceiling-adjustments-11th-jan-2021/6005"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.529119318181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#16",
                    "likes": "2",
                    "time": "06/01/2021-21:23:44",
                    "content": "I think you are alright we need to consider that as fast as it went up, it can go down even faster and the ETH-B is not really the type of vault we want to have wildly open during this type of event. Thanks for being this too cautious guy. Changed my vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.144444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#17",
                    "likes": "0",
                    "time": "06/01/2021-21:44:58",
                    "content": "    Primoz:  Third, are we ok to come into situation where debt exposure to ETH-B increases towards 100m and then realize we need higher SF to compensate for risk? Are we going to be ok by suddenly charging 10% or more for ETH-B? We had similar situation with YFI-A and it didn’t turn out good.   Agree with this, much preferable, even if it takes more time to create a new vault type with the same LR and higher SF in order to avoid a similar situation as with YFI, difference is ETH holds 75% of our revenue. If it cannot be done I’m fine keeping it at 50m ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.317676767676767
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#18",
                    "likes": "2",
                    "time": "06/01/2021-22:00:55",
                    "content": "After seeing how the ETH have gone easily from $750 to $1200 in almost no time, the speed of that movement and current market behaviors, I’m starting to worry much more about a big market correction to occur at anytime, I don’t see at this point a 25% or even 30% correction in less than 24h like something rare, that’ll be more than back in March? Not saying not to adjust the ETH-B line later after proper assessment by the risk team has been done, but in this precise moment, it is a huge risk IMO. Added to Primoz points above: I changed by vote to no. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.845238095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#19",
                    "likes": "0",
                    "time": "06/01/2021-22:09:37",
                    "content": "I think if we are going to do an ETH-B line increase it should be married with a larger SF increase as well as a substantial surplus buffer increase. That should be enough to satisfy all parties I think. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#20",
                    "likes": "0",
                    "time": "06/01/2021-22:12:46",
                    "content": "That is as long as the 20% gap in the LR invested exceeds the gap in the rates which with the new parameters it’s 3%.If not people will switch to eth A ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.215909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#21",
                    "likes": "0",
                    "time": "06/01/2021-22:15:09",
                    "content": "Is that the quantified opportunity cost of the additional 20% buffer? Thought it was more abstract than just that based on risk profiles. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#22",
                    "likes": "1",
                    "time": "06/01/2021-22:19:05",
                    "content": "Yes, that 20% extra capital you get to invest generates a 3% extra cost on the total debt, not much for short term trading or perhaps if you factor in moon shot targets on leveraged crypto but a number to take into account if, for example you are simply providing stablecoin liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.916666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#23",
                    "likes": "4",
                    "time": "06/01/2021-23:21:25",
                    "content": "So I’m going to say we need to push this poll back a week (targeting a poll on the 18th if still necessary.) The reasons for this are:  Risk is pushing back pretty heavily, and I want to give them a chance to speak to this in the governance and risk meeting tomorrow prior to the poll closing. I’d also like people to have a chance to change their votes after the meeting. The poll was put up during the holiday break, and Risk (and me) didn’t give it the priority it perhaps should have had until the new year, once lots of people had voted. This is largely my fault, in retrospect it might have made more sense to disallow signals over the holiday period as well.  Apologies for the last minute change of plans. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.450324675324675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#24",
                    "likes": "0",
                    "time": "07/01/2021-09:15:16",
                    "content": "You can add that context changed too, with the bull running last couple of days. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#25",
                    "likes": "0",
                    "time": "10/01/2021-05:45:19",
                    "content": "Agreed, currently a lot of demand for ETH-A. It’s better to concentrate our efforts on ETH-A as the place to ‘spend’ our risk exposure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#26",
                    "likes": "0",
                    "time": "13/01/2021-12:38:52",
                    "content": "bumping this one up again - please have a look at your options and consider compromise-options as well. otherwise we might end up in no change (which is an option btw) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#27",
                    "likes": "5",
                    "time": "14/01/2021-14:25:17",
                    "content": "Given there is no majority here at the resolution date (even after discounting abstain votes + possible sybil votes). This poll will not be moving on-chain at this time. I know the risk team is paying a lot of attention to ETH-B, and should the risk profile change positively in the future, I’m sure they will suggest or support an increase. Welcome to the community @Francois_Bastien @12573 @Christian_Schneeweis @beerthemoose @beepidibop @Zarevok  Please consider engaging on a deeper level in the future when voting. It’s difficult to tell whether votes from newer accounts are legitimate without further information to go on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.792929292929293
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#28",
                    "likes": "0",
                    "time": "15/01/2021-02:05:38",
                    "content": "You’re joking, totally! Obviously, you just need a simplest algorithm to make a decision. Only 26% + 8% supported no change and abstain. Majority supported to increase.  Then, you could pick up the solution (150MM) that having most supporters or you can cautiously pick up the solution (100MM) if you think there’s no one having 2/3 supporters. I wonder how many voters have never used ETH-B vault. Unfortunately I am using it with the automatic management DefiSave but your decision mechanism sucks!     [Signal Request] Adjust ETH-B Debt Ceiling Signal Requests       Most importantly, use more algorithms but not human beings’ meetings/discussions to manage vaults. There’re more and more automatic vault management tools and they need fast solution when ETH’s price drops or increases pretty fast. You definitely know how blockchain market is sophisticated today.  Marking it yellow or red is a common way to help users to make a better choice, when a vault is almost drain.  If there’re no DAI available then it should be listed with some striking signal and should…      ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.038043478260869
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#29",
                    "likes": "2",
                    "time": "15/01/2021-04:41:48",
                    "content": "So while it’s true that only 26% voted explicitly for no-change, this poll was multiple choice, meaning that everyone was able to vote for as many options as they agree with. The outcome where a majority of people didn’t support any individual option indicates a lack of consensus in the community on a path forwards. In this case the status quo wins by default. The reason for taking this approach is that it prevents contentious changes proceeding on-chain, and should encourage compromise and reduce division in the community. The downside to this approach is that sometimes people end up frustrated that things don’t move quite as quickly as they might have done otherwise. Though on the bright side, this may result in the community being united in their frustration towards me (and hopefully other future Governance Facilitators). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.774305555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#30",
                    "likes": "0",
                    "time": "15/01/2021-06:10:31",
                    "content": "    Derek98:  but your decision mechanism sucks!   Thanks for making my Friday more entertaining. Actually @LongForWisdom is taking the decision mechanism highly seriously, it is just that the signal request has slightly too many options. @ultraschuppi there is clearly sentiment for increasing the debt ceiling, could you be bothered to reissue the signal request (it is sort of your baby) with fewer options so that it is easier to get to 50% ? Maybe leave the exact debt ceiling increase to the rates team? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.5874999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#31",
                    "likes": "2",
                    "time": "15/01/2021-07:25:42",
                    "content": "Since I created this little disaster I guess I need to follow up on this  First of all: we don’t have IRV in the voting portal right now, so as of now, we cannot go for multiple options on the onchain poll. So it is obvious that we would need to select the option with the most votes. So far, this has only been done if this option got a majority - which is not the case in this signal.     Planet_X:  Actually @LongForWisdom is taking the decision mechanism highly seriously, it is just that the signal request has slightly too many options.   Actually I don’t think it is about having too many options, it is about voters not really considering options that they are willing to accept as well (next to their preferred choice). This is exactly the same issue as we experienced on-chain as well: If you are not willing to compromise, the whole thing could resolve into “status quo remains”. I have to admit that the description of this poll was not really clear on that - apologies for that. Will try to do that better next time. I really don’t like the habbit of “voting until I get what I want to have”, but yes - there seems to be a majority for increasing the line for ETH-B. So here is my offer: If i don’t get shut down I am going to set up a new signal with one option. This one option will probably include new risk parameters - will sync up with @Risk-Core-Unit before so everybody knows about the implications. WDYT? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.601790690152759
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#32",
                    "likes": "0",
                    "time": "15/01/2021-07:26:12",
                    "content": "    LongForWisdom:  Though on the bright side, this may result in the community being united in their frustration towards me (and hopefully other future Governance Facilitators).   i cannot see how this is on the bright side mate  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.59375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#33",
                    "likes": "2",
                    "time": "15/01/2021-09:39:02",
                    "content": "Why do we allow new forum accounts with 5 min of read time to signal on anything? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#34",
                    "likes": "0",
                    "time": "15/01/2021-09:45:57",
                    "content": "also my fault: i could easily have restricted polling-participation to a higher trustlevel. learned about this, will do it better next time. sorry ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.683333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#35",
                    "likes": "0",
                    "time": "15/01/2021-10:02:16",
                    "content": "@ultraschuppi I don’t think this is standard protocol for signal requests. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#36",
                    "likes": "5",
                    "time": "15/01/2021-11:56:07",
                    "content": "    ultraschuppi:  i cannot see how this is on the bright side mate    Because unity!     rema:  Why do we allow new forum accounts with 5 min of read time to signal on anything?       ultraschuppi:  also my fault: i could easily have restricted polling-participation to a higher trustlevel. learned about this, will do it better next time. sorry       Jiecut:  @ultraschuppi I don’t think this is standard protocol for signal requests.   So this is something I’m going to starting thinking about a little. I don’t see a significant downside in preventing TL0 users from participating in signal polls. TL1 is easy to achieve with a small amount of effort, but I expect it will weed out those that are setting up new accounts solely to vote without commenting or engaging more deeply. The downside to this is that it requires the signal author to select the correct options. For this reason I don’t think I want to make it a strict requirement (I can see people forgetting to set the option and I don’t want to reset polls that have been up for a few days on those grounds.) I have no objection to signal authors limiting voting to TL1+ though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.806081649831649
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#37",
                    "likes": "3",
                    "time": "19/01/2021-14:29:15",
                    "content": "Sorry for coming back so late to this topic, I needed some time to digest. I withdraw my previously posted offer to run a follow-up signal. The reason behind it is very simple: since I initially posted this signal request I got convinced that raising the line-DC for ETH-B is just not a good idea. The risks we are taking here weight a lot stronger than the additional benefits we get. I usually tend to be more on the “let`s grow like hell!”-side and I think I still am, but the reasons I heard from the risk-perspective changed my mind on that topic. All the DAI-from-ETH that we could get out of raising the line-DC from ETH-B can also come from ETH-A, there is an urgency exec running right now to raise the DC of ETH-A to 1B), so there are ways to move forward. While I was feeling responsible as being the initial creator of the signal, it does not mean that this topic is done. If there is someone willing to take over the initiative: please start a Signal on your own. I know how I would vote  Thanks for participating in the discussions, thanks a lot especially to @Primoz @hexonaut @LongForWisdom and @SebVentures for changing my mind and helping me on my decision ",
                    "links": [
                        "https://vote.makerdao.com/executive/increase-eth-a-and-wbtc-a-debt-ceilings?network=mainnet#proposal-detail"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.111920426065163
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#38",
                    "likes": "0",
                    "time": "19/01/2021-16:53:59",
                    "content": "    ultraschuppi:  Thanks for participating in the discussions, thanks a lot especially to @Primoz @hexonaut @LongForWisdom and @SebVentures for changing my mind and helping me on my decision   This makes it sound a little like we brainwashed you  In all seriousness, if anyone wants to continue signaling on ETH-B, please feel free to do so. If a change gets a majority in a signal poll, I will put it on-chain (barring veto from @Risk-Core-Unit which may or may not happen in that circumstance). I would encourage everyone to take into account that @Risk-Core-Unit doesn’t recommend a change at this time when voting, though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.866071428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#39",
                    "likes": "0",
                    "time": "19/01/2021-17:49:48",
                    "content": "I guess it’s too late. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#40",
                    "likes": "0",
                    "time": "19/01/2021-18:18:43",
                    "content": "Yes it’s funny. There’s some guy who just generated 5 hundred DAI!  Now you can see the perfect number: 0.00 / 50.00M. BTW, this perfect pair often shows up. If he finished his plan, then he had to paid about 6x DAI. ETH-B is dead for months (discontinuously). Now ETH-A is dry and another urgent proposal will be passed weeks later… ETH-B really sucks. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.454861111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#41",
                    "likes": "1",
                    "time": "19/01/2021-19:23:18",
                    "content": "    LongForWisdom:  This makes it sound a little like we brainwashed you    Sorry that was really not my intention. You (and others) have influenced me on my only remaining point to continue on that signal: that It should be my duty to follow up since I started that fire - and this is just not right: anybody can continue on it (and who knows, maybe at some point later on we might be in a different risk setting so it could even be me) and I don’t need to continue on a mission I no longer believe in. Hope that clarifies it ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.668526785714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#42",
                    "likes": "1",
                    "time": "19/01/2021-22:53:06",
                    "content": "When is the timeline for liquidations v2? I also would love to see the ETH-B line increased, but it sounds like for technical reasons this is not really feasible rn. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek98",
                    "index": "#43",
                    "likes": "0",
                    "time": "21/01/2021-03:12:32",
                    "content": "Technical reasons? Sounds like it gets stuck for a long long time.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#44",
                    "likes": "0",
                    "time": "20/02/2021-13:12:33",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}