{
    "poll_list": [
        {
            "title": "Ratification Poll for Adding MakerLabs Core Unit (SNUNK-001) - October 11, 2021",
            "index": "9425",
            "option": "No",
            "supporting_mkr": "40,776",
            "highest_fraction": 0.61
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c2-sp21-adding-makerlabs-core-unit/9425",
            "title": "MIP39c2-SP21: Adding MakerLabs Core Unit ",
            "index": 9425,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "core-unit",
                "eurdai",
                "skunk-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "21",
                    "time": "19/07/2021-14:00:55",
                    "content": " MIP39c2-SP21: Adding MakerLabs Core Unit  Preamble MIP39c2-SP#: 21 Author(s): @colrad, @urbanisierung, Tim Schuppener (@ultraschuppi) Contributors: - Tags: core-unit, cu-skunk-001, mandate Status: Rejected Date Applied: 2021-07-19 Date Ratified: <yyyy-mm-dd>   Sentence Summary MIP39c2-SP21 adds MakerLabs Core Unit for building and validating MVPs.  Specification  Motivation Good, new products usually emerge from high-risk endeavours. In the world of traditional software engineering, building a Minimum Viable Product either validates or invalidates your product idea. However, real validation is gained from the market when the MVP is released to the public. Real validation is not the promise to use the product but only the product usage itself. While the current setup of the Maker DAO allows for incremental and low-risk improvement of the existing product, the current framework is not set up for pursuing revolutionary product ideas. Therefore we propose a new MakerLabs Core Unit that implements new product ideas spanning across the full stack of decentralized technologies. Having full technological responsibility inside a single Core Unit would give MakerLabs the autonomy to move fast and ultimately test and validate new ideas early.  Responsibilities The MakerLabs Core Unit Team responsibilities essentially revolve around the rapid implementation of new product ideas grounded in solid full-stack engineering practices, including iterative product improvements to find Product Market Fit.   Picking up a new product idea and a fast implementation of an MVP. A wide collection of diverse ideas already exists that can advance the Maker Ecosystem at different levels. The selection for the implementation of the next product lies with the Core Unit in discussion with the Maker Community.  Make the product available and ensure easy entry. Implementing the MVP is only the first step. A product can only be used if it is accessible to a broad user base. This applies to both technical prerequisites and user experience. Technical barriers for users have to be low, and the product needs to be designed for usage without reading long documentation.  Validation and quick iterations based on user feedback and metrics. The most important tool to validate a product is measuring and processing feedback. This involves the use of various channels of direct and indirect user interaction to obtain all the necessary information. The result of validation is binary: Product Market Fit achieved or not.   Team The MakerLabs Core Unit will have a flat management structure led by the facilitator who answers to the community of MKR holders. This Core Unit is being proposed as a single team. Our team has already bootstrapped a couple of products and teams and brought them to market. After solving all the hard problems, we moved over to the next mission. This experience and familiarity with Maker will allow us to be effective from Day 1, with little lead time, no need to recruit heavily and bring an established working process.  Core Unit ID SKUNK-001  Core Unit Name MakerLabs  Core Unit Mandate  Product Implementation Quickly develop new product ideas into usable MVPs.  Products are focused on increasing the Maker Ecosystems value and usability to end users. The scope of the products would be strictly separated from the Maker Protocol. We want to build products upon the Maker Ecosystem, not modify or change but instead leverage what other Core Units e.g. Protocol Engineering or Oracles are building.   Deployment MVPs end up being deployed to test and production environments. Move fast and break things is usually not something you would want to hear in the Maker Ecosystem. We will apply it on test environments but will switch to risk-capped innovation measures on production environments:  Risk to MKR value will be limited to whatever MKR holders find appropriate Risk borne by early adopters will be limited to whatever MKR holders find appropriate   Full Stack Engineering MakerLabs Core Unit will build all aspects of a product.  Smart Contracts User Frontends Metrics   Validation  User Feedback Measure, measure, measure Quick, small iterations to improve the product based on new insights If a product idea is successfully validated, MakerLabs Core Unit will propose plans for the next steps  The first product we’d like to tackle is eurDai. From deploying the eurDai Contracts, to building a eurDai wallet to metrics measuring its success or failure. ",
                    "links": [
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/45",
                        "https://forum.makerdao.com/t/what-core-units-does-the-dao-need-next/13594/44",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-152-thursday-july-29-17-00-utc/9553/5",
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-18-makerlabs/10678/4",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-18-makerlabs/10678",
                        "https://forum.makerdao.com/t/weekly-mips-update-51/10079",
                        "https://forum.makerdao.com/t/weekly-mips-update-50/9992",
                        "https://forum.makerdao.com/t/weekly-mips-update-49/9890",
                        "https://forum.makerdao.com/t/weekly-mips-update-48/9757",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765/17"
                    ],
                    "GPT-summary": "The post proposes the addition of a new MakerLabs Core Unit for building and validating MVPs. The proposal explains the motivation behind the new unit, its responsibilities, team structure, and mandate. The post also mentions the first product the unit plans to tackle, eurDai. The post receives constructive criticism and questions from third parties, but there is no advertising or entirely positive/negative feedback.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Smart contract updates",
                        "Community and engagement",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.589154089154089
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/07/2021-14:14:23",
                    "content": "I like this. What is the initial thought about transitioning successful products out of this CU? Or will successful products stay within this CU? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "1",
                    "time": "19/07/2021-14:18:53",
                    "content": "    ultraschuppi:  If a product idea is successfully validated, MakerLabs Core Unit will propose plans for the next steps   The primary purpose is about prototyping new product ideas and the very last step on the happy path is to propose a plan how to move forward. Maybe naive, but I guess that if something works pretty good there will always be someone interested in picking it up. But let’s cross that bridge when we get there  ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.357438016528926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#4",
                    "likes": "4",
                    "time": "20/07/2021-05:13:49",
                    "content": "Hi @ultraschuppi - exciting proposal you have here! thumbs up for taking on eurDai right away I have some questions, forgive me if some of them are not so smart:  When you say Minimum Viable Product (MVP) do you mean testnet viable, or mainnet viable? Is this a sort of a “Space-x method”? Crash and burn is certain, but you iterate really fast towards something that works? If you add a frontend to a MVP (as you plan), are you not quite close to the real thing? When you complete the MVP, who will take over and do the rest?  Why not do the rest of the job while you are on it? What is lacking here - will or patience?  and now for the interface questions:  Which groups are you going to interface with? I guess PE will be involved at some point or not? Could SKUNK do some of the tasks that PE would normally do as a sort of apprentice program? Will SKUNK be a good match with GROW? You could do proof of concept work? That is MVP anyway? Again - take some of the workload off PE? How about RWA? There are now 4 or 5 possible methods for getting into US Treasuries - is this something SKUNK could support? Is SKUNK willing to do collateral applications? Like the less painful ones to start?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.539328231292517
                },
                {
                    "author_link": "https://forum.makerdao.com/u/colrad",
                    "index": "#5",
                    "likes": "8",
                    "time": "20/07/2021-10:52:00",
                    "content": "Hi @Planet_X Thank you for your great questions! Even though I’m not as well versed with the Maker Community as @ultraschuppi, I hope I can clarify some of them.     Planet_X:  I have some questions, forgive me if some of them are not so smart:  When you say Minimum Viable Product (MVP) do you mean testnet viable, or mainnet viable?    If your friend says “It’s a great product!”, then that is certainly nice to hear but no real validation. We think validation can only be proven when people commit to the product. Be it money, by paying for it. Or be it time, by using it. Therefore we have to deploy the MVP to the mainnet. We believe validation can never happen on testnet.     Planet_X:   Is this a sort of a “Space-x method”? Crash and burn is certain, but you iterate really fast towards something that works?    I like this “Space-X” analogy but I think there is a major difference. Early Space-X and similar projects like ITER and Manhattan would have failed because the goal is technically not feasible or too expensive. Software engineering has the great advantage that it’s pretty cheap. The greatest challenge in new software projects is to make something people want, or more precisely make something people want to pay for. So a crash and burn for MakerLabs is not spending 12m on an exploding rocket. But in the end having a rocket that nobody wants to use. Therefore we want to build rockets very fast/cheap and measure if people actually want to use the rocket. If we can prove that people are actually paying for rockets, other teams can step in and build even greater and more efficient rockets.     Planet_X:   If you add a frontend to a MVP (as you plan), are you not quite close to the real thing?    I tend to disagree. Let’s look at something like Facebook. One could argue that the original thefacebook, marketed to College Students was a MVP. But the Facebook we have today is completely different to thefacebook of 2003. The differentiation between MVP and the real thing is even more important for the financial products we are building.  Auditing and hardening the Smart Contract would slow us down. We want all our MVPs to be risk-capped. Supporting the Product for millions of users would drain our small team of all resource Marketing the Product is not something that lies within our expertise Exploiting a market opportunity, going down the rabbit hole of optimization, would lead us away from what we do best. Building and validating unproven Products.  Transforming a MVP to the real thing, is usually an endeavour bigger than building the MVP. This would include all the auditing/hardening work, removing the risk-caps, building an infrastructure for support and monitoring … and adding new features. Maybe even transforming the Product to adjust it to changing customers needs.     Planet_X:   When you complete the MVP, who will take over and do the rest? Why not do the rest of the job while you are on it? What is lacking here - will or patience?    There are typically 2 types of strategies: exploration and exploitation. We as a team draw the most satisfaction from exploration, this is something we excel at. Other people and teams on the other hand are great at exploiting existing market opportunities. There are a lot of exciting product ideas in the maker community that sound worth pursuing. We want to validate them and then come back to the community with either “Great Idea and it found adoption” or “Great Idea but nobody is really using it” In both cases the community can then decide on how to move forward. Even in the case of a successfully validated Product, the community could decide not to move forward (because it does not match the vision of Maker …) Or the community could decide to grant a Budget for exploiting the opportunity more deeply. In the case of an unsuccessful validation the community could propose adjustments for revalidation or decide to drop it for good. We see MakerLabs as a tool for the Maker Community to explore and validate Product Ideas. As any tool we serve one specific purpose. Like a skrewdriver we excel at driving screws but we are less efficient at driving nails.     Planet_X:  and now for the interface questions:  Which groups are you going to interface with? I guess PE will be involved at some point or not?    We will interact with all interfaces that are necessary to implement the MVP. This also means that we have no limitations in the technology stack and may also implement smart contracts (for example). However, in order to move forward as autonomously as possible, we would like to act independent of other Core Units and request as little support as possible from other Core Units. We picked eurDai as the first product because:   We think we can implement it without changes to PEs domain   We probably don’t need to make profound adjustments to the smart contracts   We like the product idea and think it is worth pushing forward.   Some people in the Maker Community want eurDai but nobody has proven that it will be used       Planet_X:   Will SKUNK be a good match with GROW? You could do proof of concept work? That is MVP anyway? Again - take some of the workload off PE?    The inherent difference between PoC and MVP is that PoC usually proves the technical feasibility. MVP proves the market feasibility. If there are topics that call for a MVP (user/market validation) and contain changes to the existing Maker Smart Contract then MakerLabs would be glad to create Pull Requests to the PE repository. But I think before this can happen, MakerLabs has to prove itself to PE and the Maker Community, that we can write sound and safe Smart Contracts and that we would not be a burden to PE.     Planet_X:   How about RWA? There are now 4 or 5 possible methods for getting into US Treasuries - is this something SKUNK could support?    We haven’t thought so much about RWA topics so far (and eurDai will probably suck some time anyway) - I wouldn’t reject any topic without digging into it.     Planet_X:   Is SKUNK willing to do collateral applications? Like the less painful ones to start?    I don’t think we would add great value to collateral applications. At least for me, adding new collateral types seems like a proven process done by the Risk Team, Oracles and PE. It’s like adding a new Feature to an already great Product. From my point of view this falls in the exploitation category and therefore would be outside of MakerLabs domain. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.921658596272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#6",
                    "likes": "0",
                    "time": "25/08/2021-06:58:32",
                    "content": "Oh Em Gee!   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#7",
                    "likes": "6",
                    "time": "25/08/2021-09:35:19",
                    "content": "A small comment with regards to:     colrad:  I don’t think we would add great value to collateral applications. At least for me, adding new collateral types seems like a proven process done by the Risk Team, Oracles and PE. It’s like adding a new Feature to an already great Product.   Speaking from experience in the PE team, I have seen that engaging newer members into the collateral onboarding process has been one of the quickest ways to get them up to speed on system interactions, tests, and to build an awareness of various protocol dependencies - it’s not so much that they add value to the process - in cases it slows down the process, which is fine because the longer term value outweighs the short term. In saying this, I’m not suggesting that you become a collateral onboarding team, but just thought I’d share the value we have had in integrating people into this weekly (now fortnightly) ritual as a safe proving ground. Perhaps a similar process, even if you wanted to do it independently, may be of value. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.894612794612795
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#8",
                    "likes": "5",
                    "time": "02/09/2021-06:43:50",
                    "content": "I’m torn. This proposal keeps me debating myself (not in a good way).  On the one hand…    I believe in the ability of @ultraschuppi (I’ve spent a lot of hours contributing with him and I can attest to his values, intelligence, and commitment. I have spoken a couple of times with the rest of the team, and my general impression only improved. We could not onboard these individuals faster: this team is already Maker.   But on the other…     Show me the mocks! (or a support team)  I would expect a team building MVPs to have:  UX Researchers Designers Prototypers A product manager and I’m probably forgetting more roles, but I haven’t prototyped in what feels like a lifetime.    PS, I get a similar feeling when the brilliant minds from @Protocol-Engineering work on a front end, a MIP, or a proposal. We need to enable the smarter ones to spend as much time as possible working on tough problems.   A clear purpose: scaling Maker Is this a group of smart people telling us that they need direction (speculation)? Again: are we wasting brilliant minds playing with toys (or MVPs) instead of focusing on the next big problem? What are the areas that we need to focus on to scale Maker?   The drawer of old toys I’m afraid (speculation again) that we are going to end up with a bunch of tools that people might like, but:  we don’t have the bandwidth to maintain them (taking this statement to the extreme, we might be creating a problem) not a lot of people use it (niche tools) are not a full product (yes, I know what MVP stands for, but still)   But decentralization…   If the smartest doctor wants to focus on plastic surgery instead of longevity*, there’s not a lot we can do. We can only make sure that the incentives are in the right place. As mentioned: if this team wants to work on creating 3D NFTs for Maker, we should probably let them, but… argh.   *) I reserve the right to change this bad analogy for a better one.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.678004535147393
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#9",
                    "likes": "13",
                    "time": "02/09/2021-08:00:56",
                    "content": "Not sure there is a need to speculate here.  MakerDAO wants eurDAI. In my view, there is a consensus that it is a big opportunity for MakerDAO but competition is coming. MakerLabs will work on eurDAI. It will most likely take a long time just to get started.  @ultraschuppi has shown the willingness to do whatever it takes for the DAO. We need someone to write signal requests, he does the jobs (countless times). Figuring out the rates, guess who created the MakerDAO Open Market Committee (quite useful to understand what is needed for eurDAI). His entrepreneurial mindset is what we need for such a project. The team is already productive with the delegates analytics UI. Cost is under control.  ",
                    "links": [
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://delegates.makerlabs.one/polls"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#10",
                    "likes": "8",
                    "time": "02/09/2021-10:39:55",
                    "content": "    juan:    Show me the mocks! (or a support team)  I would expect a team building MVPs to have:  UX Researchers Designers Prototypers A product manager and I’m probably forgetting more roles, but I haven’t prototyped in what feels like a lifetime.    PS, I get a similar feeling when the brilliant minds from @Protocol-Engineering work on a front end, a MIP, or a proposal. We need to enable the smarter ones to spend as much time as possible working on tough problems.   While I agree that in the long run we may need dedicated people specializing in those functions, I absolutely disagree on the need to get them into the team right now. Sure you need the capabilities (up to a certain level) to start the show - but we already have them in the current team. I would not hire a full time UX Researcher, Designer, Product Manager at the very beginning of this CU. Let’s start small and grow (if needed) by the time we realize it makes sense to get someone specialized on board. Too many cooks spoil the broth.     juan:    A clear purpose: scaling Maker Is this a group of smart people telling us that they need direction (speculation)? Again: are we wasting brilliant minds playing with toys (or MVPs) instead of focusing on the next big problem? What are the areas that we need to focus on to scale Maker?   I’d argue that an MVP is a valuable tool, not a Toy. (Else no Company in their right mind would build MVPs) When you say Maker should fix the “big Problems” to “scale Maker”, then I agree. But this is not the purpose of MakerLabs. The purpose of MakerLabs is to find new Opportunities in a professional manner. The question is: Does the Maker Community deem an opportunity exploring CU important or not.     juan:    The drawer of old toys I’m afraid (speculation again) that we are going to end up with a bunch of tools that people might like, but:  we don’t have the bandwidth to maintain them (taking this statement to the extreme, we might be creating a problem) not a lot of people use it (niche tools) are not a full product (yes, I know what MVP stands for, but still)    The only difference between science and fucking around is writing it down - Mythbusters That’s why we think defining a threshold that sets a level for “achieved Product Market Fit” beforehand is so important. I’d like to think of it like a pop-up store. Let’s test Unicorn-poo flavoured Icecream, set up a Store for a limited amount of time and measure sales. If it’s beyond a predefined threshold then we open an even bigger, permanent store. If not we close for good … sorry to the 15 very satisfied customers that enjoyed our product but you are not enough to support our business case. MVP’s are like pop-up stores. They should not live very long. Either they transform into a big beautiful Butterfly or they should be put down. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.650190570299266
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#11",
                    "likes": "6",
                    "time": "02/09/2021-11:18:25",
                    "content": "Again, and maybe my post wasn’t clear enough: this team is gold. We need them on board.     SebVentures:  Not sure there is a need to speculate   Speculation arises when things are not clear (or de-risked).     SebVentures:  MakerDAO wants eurDAI . In my view, there is a consensus that it is a big opportunity for MakerDAO, but competition is coming.   It’s called MakerLabs, not EURDai Core Unit. I would be much more inclined to vote for a Core Unit that has the latter name. I would even throw in some grant money to do previous research before working on this (SES might have offered this  ).     SebVentures:  The team is already productive with the delegates analytics UI .   I’m sure they can also write poetry for the DAO and be productive, but these guys are WAY smarter than that UI (the ones that can write smart contracts smart).  @ultraschuppi, you’re one of the smartest persons that I know. I know that you can do UIs (or research, or the long list of et ceteras that you’re proposing (you can probably become a successful TikTokker if you set your mind to it  )). I also know that you will do whatever you like doing best (and that’s perfectly fine). I also know that I will support you in your future endeavours. TL;DR:  more focus (ideally on a big problem) more focus (ideally doing what you do best) I will support you regardless. <3  ",
                    "links": [
                        "https://delegates.makerlabs.one/polls"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.582298136645964
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#12",
                    "likes": "10",
                    "time": "05/10/2021-15:04:25",
                    "content": "we would like to push this to Formal Submission please   image1143×857 69.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#13",
                    "likes": "5",
                    "time": "05/10/2021-15:11:08",
                    "content": "Best team FS push award goes to MakerLabs !!!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#14",
                    "likes": "0",
                    "time": "12/10/2021-16:27:51",
                    "content": "I really had to look here. The point here is that when it comes to new business ventures and longer term plans and projects this would have to be well integrated into Growth and coordinate quite a bit with PE (can it be done, how, etc.)    The idea for this to be a separate group with its own funding and lack of high level deliverable metrics and reporting means it should actually start off as a sub-group under one of the CUs and Growth seems a natural place. Frankly I want to hear from @Nadia on whether she thinks she wants another completely independent CU group doing long term planning or whether she would prefer MakerLabs actually be a sub-group under GROWTH CU which honestly is where I think this should sit. I want to vote no to this for the above reasons, but without real input or validation here will simply will abstain. One point - I too feel like the members chosen are valuable members of the DAO, I just think organizationally such a group should sit under GROWTH because everything these guys are going to come up with is basically going to land in GROWTH CU lap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.715454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#15",
                    "likes": "3",
                    "time": "12/10/2021-16:58:16",
                    "content": "    MakerMan:  Frankly I want to hear from @Nadia on whether she thinks she wants another completely independent CU group doing long term planning or whether she would prefer MakerLabs actually be a sub-group under GROWTH CU which honestly is where I think this should sit.   This is dangerous: are you asking a CU-facilitator to support or not the generation of a new CU (possibly with some intersections) and/or to include it or not in her own?  It’s ok in this specific case, since @Nadia is a healthy member of the community and would not respond out of self-interest, but in general we should avoid this type of setup imho. We want to promote decentralisation of CUs as much as possible while keeping a reasonable efficiency. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.712121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#16",
                    "likes": "1",
                    "time": "12/10/2021-17:49:28",
                    "content": "We already have an incubation program with SES if someone wants to go that route. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#17",
                    "likes": "1",
                    "time": "12/10/2021-19:06:15",
                    "content": "    iammeeoh:  This is dangerous: are you asking a CU-facilitator to support or not the generation of a new CU (possibly with some intersections) and/or to include it or not in her own   This is ‘dangerous’.  Seriously?  We ask for other CU input on a number of topics - why not ask a CU whose work will be impacted by another whether she would rather have another CU or just a budget to hire for the specific task of ‘long term growth’. My point here is Growth may already have some long term plans.  Now they may not be setup to do the eurDAI - that is fine.   If this was the only thing this CU was tasked with I would be asking why do we need a CU for it, rather than just some bounties being put up for design, implementation and let biz sell it.    Instead this CU having that as its first task also wants longer term funding for doing longer term growth stuff.    Personally if I was the CU of growth I’d feel a bit slighted this group didn’t approach me first for a grant and/or discuss whether it makes sense to have a different CU since these two units are likely going to have overlap.  I have no clue of what internal discussions go on… I have said before I think multiple CUs for redundancy and quality assurance is a good thing.  But given there is no model for how to shop tasks between such units or who manages authorities with the responsibilities I don’t see how this doesn’t turn into a bit of a management mess. Sure we can let more CUs fly but frankly when a new CU is being proposed that has significant overlap with another I consider it courtesy to at least have people who will be affected weigh in one way or another.  I consider communication ‘healthy’, decentralization actually means higher levels of communication not less. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.60239898989899
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#18",
                    "likes": "9",
                    "time": "12/10/2021-23:00:13",
                    "content": "Growth’s mandate is to grow Maker’s distributions channels through partnerships. This is why our focus by now is on:  creating alliances with new players in the PSM (Paxos’s PSM has generated almost 500m DAI, and they are working on the integration of DAI in their APIs that will open new rails for DAI) The institutional vault product (which will help Maker to increase the TVL of ETH and wBTC, increasing DAI in the market) And the integration with companies from all over the world helping us to increase DAI awareness and creating channels for people to access DAI.  We are constantly thinking about what other initiatives we can do. Crypto is a continuously changing environment, and to be successful with our mandate, we have to understand what’s happening around us and create a Maker flavor for that (DAI+Gamers, DAI+NFTs, DAI+Institutions…). Some time ago, @MarianoDP posted an open question to the community about products that could help us create a Maker Nation. It is out of our mandate to have a dev team that could work on that, but we can bring the ideas to the Maker community and try to find out there, teams doing something similar and convince them to integrate the Maker vision by creating a partnership with them. I think we (Growth team and the community in general) have a lot of ideas of what products we want to see as part of that Maker Nation. Besides what Mariano posted, these are other things we asked for in the last ETHOnline hackathon:  An auction keeper implementation to further decentralize and democratize auction participation. A GUI for PSM on IPFS and/or PSM bridge: So we could link our PSM’s and do any type of swap we are capable of doing. A user that has Pax, for example, could swap to USDC or vice versa by just paying the tin to get Dai, and then in the same transaction, it would put Dai into the other PSM and getting the token. The tout is zero going out anyways. A furocombo-like web for arbitrage with PSM and Flash Mint. An optimistic roll up test environment to facilitate the testing of L2 code. Extra points for leveraging Dapptools.  Because of the complexity of Maker and as we haven’t been actively participating in hackathons, none of the teams worked on that. So, my thoughts about the Maker Nation products:  I love the idea I think having more products around Maker will help us to grow It would be great to create more documentation and resources (like a wishlist of products) to have more people building around Maker The scope of these products has to be very well defined and let the community decide if we want a product that takes one month or six months to be built. euroDAI is an excellent solution, still, there are other ideas around, ones more simple than euroDAI, of course with less impact, but I think that’s up to the community to decide. If that’s the product we decide to build, I don’t know how an MVP will work, and I don’t know if we as Growth can go outside and talk with partners about a euroDAI that hasn’t been audited. I trust in @ultraschuppi  skills for this. I have seen how he’s always thinking about how to bring new things to Maker  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.851515151515152
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#19",
                    "likes": "7",
                    "time": "13/10/2021-10:41:12",
                    "content": "I would highlight that this Core Unit is currently not passing due to @PaperImperium voting against it. Below is his reasoning.    PaperImperium Delegate Platform   No on Maker Labs Core Unit . This application seemed a bit rushed, and I encourage the applicants to reapply after some more time to build a road map or even consider an incubation with SES. EuroDAI would be very valuable, but it would be such a critical product that it probably needs active assistance from veteran PE members, and a plan for the maintenance of that new product – it has the potential to be so valuable that we really need to get execution correct the first time. But this needs an articulated way to hand off new products without abandonment or adding them to the PE Core Unit’s duties.   First on a “bit rushed” part, the discussion started in February (Declaration of Intent and the eurDAI thread). The Declaration of Intent was voted in April (a case where bureaucracy killed momentum). You might have missed that as it was happening before you joined. Moreover, @ultraschuppi is a consistent contributor and everyone can get an opinion on the value he created for the protocol (Autonomous MakerDAO member, MOMC member, signal request master, …). Secondly, the whole idea of gating the CU to PE, Growth, and/or SES is centralization. PE doesn’t see eurDAI as a priority (which makes 100% sense, which is why eurDAI is awesome to get a new CU started). Are we saying that eurDAI (something community approved) will never see the light even when sounds people are ready to work on it? Finally, there is a belief that this CU will launch the project and move on no matter what and it will be PE role to clean the mess. This is short-sighted. @ultraschuppi showed to be responsible. We need entrepreneurs like him. I think the proposal is here, take it or leave it. I encourage people to voice their opinion on the poll. Currently, it’s not passing because it seemed a bit rushed. Scientific governance in action  . ",
                    "links": [
                        "https://vote.makerdao.com/polling/QmV44i6E?network=mainnet",
                        "https://forum.makerdao.com/t/mip13c3-sp10-declaration-of-intent-eurdai/6766",
                        "https://forum.makerdao.com/t/discussion-eurodai/6521/31",
                        "https://vote.makerdao.com/polling/QmVkrQjY?network=mainnet#vote-breakdown",
                        "https://forum.makerdao.com/t/working-group-autonomous-makerdao-closed/8320",
                        "https://forum.makerdao.com/t/discussion-eurodai/6521/31",
                        "https://vote.makerdao.com/polling/QmV44i6E?network=mainnet#vote-breakdown"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7400731452455585
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#20",
                    "likes": "3",
                    "time": "13/10/2021-10:48:25",
                    "content": "    SebVentures:  Currently, it’s not passing because it seemed a bit rushed   I will refer you to the recent launch video session and the discussion there. There is nothing wrong with taking a month to build out more details on how to hand off large projects, or to pivot to pure R&D of smaller products. As I stated in my communication about my current votes, I encourage the applicants to flesh out the business plan a bit more. My apologies for not paying more attention to this earlier in the process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.64935064935065
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#21",
                    "likes": "1",
                    "time": "13/10/2021-11:41:51",
                    "content": "@Nadia - Thank you so much for some perspective here.   My only issue here was to have some perspective from Growth on adding the MakerLabs because of how closely your functions overlap unit and it sounds like you like the idea.   I really want to thank you for taking the time on the additional ‘color’ in this reply. I agree @ultraschuppi and team is a great choice to head this and based on the discussion I will formally change my vote to yes to support this initiative. I really want to express a concern with all these CU applications that if/when Maker revenues drop Maker is going to be caught between a rock and a hard place on funding which may likely mean selling MKR from reserves.    Lets hope it doesn’t come to this, but given the growth in expenses here (all CUs are asking for more heads, and funding to go with this, and on top of this we are adding more CUs).   I don’t have formal numbers here but I have a real concern that expenditure growth is going to grow too much. I want to echo @PaperImperium discussion point with respect to other CU request funding growth for these CUs for them to give a report back about whether they are actually banking any of this funding that is unspent or the more likely scenario they are coming up short and using forward funding to cover back dated salaries/expenses.  It was my hope that these CUs with extra funding wouldn’t just spend it but actually work to save some and I would like on top of actual expense metrics to track unused funding so the DAO can get a real handle on what is going on with expenses overall.    The real problem here is lack of incentives not to spend and to ask for constantly increasing budgets and head counts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.709077380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/simonkp",
                    "index": "#22",
                    "likes": "0",
                    "time": "18/10/2021-05:54:40",
                    "content": "I’ll start by saying that this is a critical Core Unit to have for Maker’s future success. Through implementation and measuring of smallest possible prototypes for new ideas, any organisation must ensure they have a pipeline of new proven solutions to provide the basis for growth in future years. Basically keep agile, nimble and ready for change through experimentation, especially in this crazy space we are in where things change from month to month. A few people brought up a concern of who to hand over the prototype project after its completion by MakerLabs. In my opinion this is a non-issue, as @colrad has covered in the call as well - if its valuable to the users and Maker’s growth, it’ll be in the community’s interest to find a way to continue running with the project. If it’s not valuable the project gets dropped, simple. To determine this, MakerLabs needs to be able to demonstrate that the prototype (eurDai in this case) provides value to the audience it was designed for. And this hasn’t really been covered - how this will be accomplished and what metrics exactly will be used? However the application seems a little two-faced - “We’re not eurDai CU but we’re gonna work on that, if that doesn’t work we’ll ask community for ideas”. So another question is - will this CU be prepared to go ahead with some other project, not eurDai - potentially voted by the community, from the start? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.327556818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#23",
                    "likes": "2",
                    "time": "18/10/2021-10:47:11",
                    "content": "    simonkp:  if its valuable to the users and Maker’s growth, it’ll be in the community’s interest to find a way to continue running with the project. If it’s not valuable the project gets dropped, simple   Perhaps I just have always been skeptical of this tautology. My experiences with polls last week only confirmed my own biases. DAOs are just a bunch of people. People make mistakes, have divergent opinions and incentives, have limited resources. I see a lot of “if the MKR holders/community want X, they will vote accordingly.” It’s a sort of Efficient Market Hypothesis of DAOs. Do we think the community actively didn’t want to disburse payrolls and budgets for several weeks back in July? Maybe. Probably not? Anyway, I’m just not a fan of saying, “if it has value, the future selves of DAO members will put in a lot of work to realize it and act accordingly.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.134199134199134
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#24",
                    "likes": "6",
                    "time": "25/10/2021-17:42:42",
                    "content": "Thanks everybody for going on this journey with us and helping us during the last couple of months from the idea of eurDai to this Core Unit proposal. It was an interesting ride and we certainly learned a lot during that time. Unfortunately it didn’t work out the way we hoped. We decided during the last two weeks we are not going to iterate on the proposal and just ditch it. cheers, @colrad @urbanisierung, @ultraschuppi ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.345238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#25",
                    "likes": "3",
                    "time": "25/10/2021-23:26:18",
                    "content": "    ultraschuppi:  we are not going to iterate on the proposal and just ditch it    Is there a “dislike” button?  I’ll see you around. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#26",
                    "likes": "2",
                    "time": "26/10/2021-07:45:25",
                    "content": "Will you or someone else be working on eurDAI? I hope that idea doesn’t die because of this vote. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp32-adding-makerlabs-core-unit-budget/10108",
            "title": "MIP40c3-SP32: Adding MakerLabs Core Unit Budget ",
            "index": 10108,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "skunk-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "6",
                    "time": "01/09/2021-14:44:21",
                    "content": " MIP40c3-SP32: Adding MakerLabs Core Unit Budget MIP40c3-SP#: 32 Author(s): @colrad, @urbanisierung, Tim Schuppener (@ultraschuppi) Contributors: Tags: core-unit, cu-skunk-001, budget, dai-budget, mkr-budget Status: Rejected Date Applied: 2021-09-01 Date Ratified:   Sentence Summary MIP40c3-SP32 adds the budget for the MakerLabs Core Unit, SKUNK-001.  Specification  Motivation We estimate this budget for the MakerLabs Core Unit to successfully implement and validate MVPs for the Maker ecosystem. More details about the scope and content of the Core Unit can be found here. We’re proposing the following budget to deliver on our mandate. This includes, but is not limited to  Implement, Deploy, and Validate  MVPs in the Maker ecosystem.  Budget Considerations MakerLabs does not have a specific product as its mission. It is rather about implementing and validating different ideas that can help the Maker ecosystem. For this reason, this budget proposal is not for a specific product but instead for setting up a team that is capable of implementing MVPs. If costs for a specific product arise during implementation or at the time of deployment, this additional budget will be requested. The following considerations have been taken into account when building the proposed budget:  A competitive salary in-line with industry standards A competitive benefits package in-line with industry standards A high travel budget, in order to fund attending crypto conferences and team offsites which are critical for remote teams to build interpersonal relationships; vital for collaboration and retention. A healthy contingency in case budget estimates are significantly off   Budget The budget for the MakerLab Core Unit consists of three elements:  a monthly budget covering the expenses - 82.6k DAI an initial setup budget for setting up the core unit - 54.8k DAI an upfront lump-sum to guarantee continuous operations - 247.8k DAI  This budget secures a team of 3 full-time employees as well as covers all operational costs listed below. This budget will continue on a rolling basis until modified or cancelled by Maker Governance. At the end of the calendar year, all unused funds will be returned to the Maker Protocol. Should the MakerLabs Unit shutdown, all unused funds will be returned to the DAO immediately.     Component Setup Monthly Budget     Employee Salaries  EUR 37,500 → DAI 44,250   Employment Taxes, Insurances  EUR 9375 → DAI 11063   Travel  EUR 3000 → DAI 3,540   Legal and Operating expenses EUR 30000 → DAI 35,400 EUR 2000 → DAI 2,360   Tools/Services/Devices EUR 9000 → DAI 10,620 EUR 600 → DAI 708   IT Services  EUR 1000 → DAI 1,180   Contingency  EUR 5,347 → DAI 6,310   Corporate Income Tax EUR 7410 → DAI 8,744 EUR 11,176 → DAI 13,188   One time setup EUR 46410 → DAI 54,764    Total Monthly Budget  EUR 69,998 → DAI 82,599     Budget Details  Total Employee Costs The team has 3 full-time developers, one of them also doing the Facilitator role. The total cost of an employee includes salary, all benefits (including healthcare), and taxes. This has been calculated by scaling salaries by 25%. This premium is likely an overestimation, and the realized cost is expected to be lower.  Travel (stolen from MIP40c3-SP15) Conferences and team offsites have been critical in the Maker Foundation’s history of fostering interpersonal relationships and generating trust. These are vital qualities in a company’s culture that improve collaboration, productivity, and retention. Conferences in particular also serve a multitude of purposes. Employees are educated about the bleeding-edge technologies in the industry, and can apply that knowledge within the MakerLabs Core Unit. This budget would cover flights, lodging, nourishment, team-activities, and conference passes.  Legal Coverage for legal costs including entity creation, legal officer/company insurance, as well as monthly and annual financial reporting.  Tools/Services/Devices New team members will need to be provided with laptops for the duration of their employment and licenses for essential productivity tools.  IT Services Any services, such as infrastructure providers (hosting providers, IPFS nodes, …) or third-party services, such as services for tracking and evaluating user interactions are essential for the implementation of software products.  Contingency As with any new endeavor, especially in an industry innovating as quickly as ours, there are many unknowns when it comes to estimating budget requirements, as well as unexpected costs that arise from time-to-time. The contingency represents 10% of the total budget and is there to act as a safety buffer.  Corporate Income Tax From our current understanding about taxation of income from a DAO the legal entity will be subject to pay income tax on all DAI distributions we convert to FIAT. We still hope there is another way of dealing with that, in this case this position will become different.  Budget Distribution The budget is to be distributed on a monthly basis to the MakerLabs Core Unit Multisig, which is an instance of a Gnosis Safe multisig. Note that the Maker Protocol retains full administrative control of the funds in the MakerLabs Core Unit Multisig. To start, the multisig has 3 signers (see below) with a quorum of 2. This ensures that no rogue member is able to control the funds.  Budget Implementation Distribution will be manual until a best-practice distribution method has been adopted by a majority of core units.  Initial Setup   54,800 DAI will be transferred to 0x89C5d54C979f682F40b73a9FC39F338C88B434c6 (teamwallet.makerlabs.eth) on 2021-11-10   Lump Sum   247,800 DAI will be transferred to 0x89C5d54C979f682F40b73a9FC39F338C88B434c6 (continuity.makerlabs.eth) on 2021-11-10   Monthly Payments   991,200 DAI will be streamed to 0xb179F0760B1f1D71A447B8c37BBF5ef99E4dF6c9 (teamwallet.makerlabs.eth) starting 2022-01-01 and ending 2022-12-31 at a rate of $82600 DAI per month.   MakerLabs Core Unit Multisig Ownership: This multisig (teamwallet.makerlabs.eth → 0xb179F0760B1f1D71A447B8c37BBF5ef99E4dF6c9) will consist of the three members of the MakerLabs Team:   @urbanisierung → urbanisierung.makerlabs.eth → 0x02012c3943ee2DEe32FAA35105F4E6bd2bCE6978   @colrad  → colrad.makerlabs.eth → 0x02012c3943ee2DEe32FAA35105F4E6bd2bCE6978   @ultraschuppi → schuppi.makerlabs.eth → 0x2eC2331809F63B64ea1F4f34b51D992fc0D3E683   This multisig conforms to the requirement ratified by Maker Governance in MIP47.  Conditions - Continuous Operation To ensure 3 months of continuous operation in the event of emergency shutdown or protocol issues or to defund/undeploy the Core unit, the MakerLab Unit is requesting an upfront lump-sum of $247.8k to sit in a multisig controlled by a set of 5 Core Unit Facilitators.  Calculation: The lump sum is the equivalent of 3 months of expenses.  Rationale: If normal protocol operation is not possible due to emergency shutdown or other protocol failure, these funds will be used to ensure employment resources get the system back up and functional. This will also be used in case the DAO wants to tear down the Core Unit to allow the corresponding legal entity to properly lay off the employees according to local law. At the conclusion of the year, the lump sum will remain in the multisig for the following year and may be increased at that point in time due to team growth or the need for an increased runway. Note that this multisig is NOT controlled by Maker Governance but rather exclusively by a set of Core Unit Facilitators. This is intentional to protect the funds in the event of a governance attack. Governance can indirectly transfer these funds back through a consensus of Core Unit Facilitators.  Details:  MakerLabs Emergency Multisig - continuity.makerlabs.eth → 0x89C5d54C979f682F40b73a9FC39F338C88B434c6  Designated Contact: @ultraschuppi - schuppi.makerlabs.eth → 0x2eC2331809F63B64ea1F4f34b51D992fc0D3E683  Quorum - 3/5 Signers:   @SebVentures → 0x0D61C8b6CA9669A36F351De3AE335e9689dd9C5b   @LongForWisdom → 0x66f40F044E0e2F77bB746e3275E82e88dCBA2D69   @Nadia → 0xc8E6c287F6c127AFE5e4CB30bC440607b44c35f8   @Derek → 0xe3a76328edE8Fd61d5fA7840b878Dd69cdfD67d8   @ultraschuppi → 0x2eC2331809F63B64ea1F4f34b51D992fc0D3E683      MKR Vesting The MakerLabs Core Unit is proposing to apply the SES - MKR Incentive Plan, a linear interpolation model to utilize salary to calculate the amount of MKR each individual will vest. We want to apply one modification, removing Repricing and Renewal. We propose this modification to remove uncertainty for MKR Holders and suppress MKR Price speculation in the Team.     Property Value     MKR/USD lock-in Price (New) Trailing 6 month average   MKR/USD lock-in Price (OG) MKR = $ 3072 (26.02.2021 - 26.08.2021)   Biannual MKR Amount Initial Annual Incentive Value (USD) / MKR/USD lock-in Price   Vesting Period 3 years   Cliff Vest 12 months   Vesting Schedule After cliff has expired, the Biannual MKR amount vests every 6 months and is distributed on Jan/Jul 1st (assuming the Core Unit starts working in January 2022).   Manual Repricing no   Auto-Renewal no   MKR After 1 Year 1 FTE / TEAM 51.64 / 154.93   MKR After 3 Years 1 FTE / TEAM 154.93 / 464.79     ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP40c3SP15",
                        "https://gnosis-safe.io/app/#/safes/0xb179F0760B1f1D71A447B8c37BBF5ef99E4dF6c9/",
                        "https://gnosis-safe.io/app/#/safes/0x89C5d54C979f682F40b73a9FC39F338C88B434c6/",
                        "https://gnosis-safe.io/app/#/safes/0xb179F0760B1f1D71A447B8c37BBF5ef99E4dF6c9/",
                        "https://gnosis-safe.io/app/#/safes/0xb179F0760B1f1D71A447B8c37BBF5ef99E4dF6c9/",
                        "https://forum.makerdao.com/t/mip40c3-sp15-modify-oracles-core-unit-budget/8047",
                        "https://gnosis-safe.io/app/#/safes/0x89C5d54C979f682F40b73a9FC39F338C88B434c6/",
                        "https://docs.google.com/document/d/1oV0E_Eet-sLZ9Gr6jHAi7cPuSOHs2XiMGxwYpnzRLZE/edit#",
                        "https://forum.makerdao.com/t/core-unit-launch-pod-sessions-session-18-makerlabs/10678"
                    ],
                    "GPT-summary": "The post is a proposal for adding a budget for the MakerLabs Core Unit, SKUNK-001. The proposal explains the motivation, budget considerations, and budget details. The post also includes information about the team, travel, legal coverage, tools/services/devices, IT services, contingency, and corporate income tax. Additionally, the post provides details about the budget distribution, implementation, initial setup, and lump sum. Finally, the post proposes the application of the SES-MKR Incentive Plan for the MakerLabs Core Unit.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Smart contract updates",
                        "Privacy, Security and risk management",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.411851164708308
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "1",
                    "time": "08/10/2021-21:21:24",
                    "content": "Can you break down the initial start up expenses a bit? Does that cover hardware or office space or other things? Also, was there a specific reason why 3 months was chosen for the continuous operation fund? If the protocol can’t pay out for 3 months, I’m not sure we will need anyone’s services at all. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.766203703703703
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#3",
                    "likes": "2",
                    "time": "11/10/2021-12:06:41",
                    "content": "    PaperImperium:  Can you break down the initial start up expenses a bit? Does that cover hardware or office space or other things?   We estimated  35.4k for setting up the legal framework (legal entity + lawyer costs) 3x 3.5k for hardware and on top of that 19% of corporate income tax      PaperImperium:  Also, was there a specific reason why 3 months was chosen for the continuous operation fund? If the protocol can’t pay out for 3 months, I’m not sure we will need anyone’s services at all.   The fund serves two purposes:  in case of emergency shutdown or other protocol issues the fund is going to be used to ensure continuous operations of the CU (similar to the budget proposal of Protocol Engineering) if there is a CU shutdown/defunding happening with less than 3 month notice, the funds are being used to pay the expenses of the CU for another 3 months.  Please bear in mind that in both cases the fund acts as a last-resort-budget, so it is quite likely it is never used or just partially used. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.992063492063492
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "0",
                    "time": "11/10/2021-12:24:13",
                    "content": "    ultraschuppi:  35.4k for setting up the legal framework (legal entity + lawyer costs)   Is this mostly because of the 25k Euros of “seed capital” required to start a GmbH? If so, can that amount be applied against the rest of the budget? I’m not familiar with German laws, but presumably there’s not a limitation on how to use that funding? Also, is that money going to be taxed as income? Won’t you need to have the cash before starting the GmbH, which would make it personal income that you then place into the GmbH as paid-in capital? Sorry if I missed something obvious – I’ve never started a business in Germany, so perhaps I’ve asked some questions that aren’t very smart. But I would appreciate some help, if only because it’s always interesting to learn about how other jurisdictions work! Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.387436224489796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#5",
                    "likes": "2",
                    "time": "11/10/2021-15:52:37",
                    "content": "    PaperImperium:  Is this mostly because of the 25k Euros of “seed capital” required to start a GmbH?   Most of it, yes. The rest of it for notaries and other kinds of law-and-tax-related people who hold up their hands.     PaperImperium:  If so, can that amount be applied against the rest of the budget? I’m not familiar with German laws, but presumably there’s not a limitation on how to use that funding? Also, is that money going to be taxed as income? Won’t you need to have the cash before starting the GmbH, which would make it personal income that you then place into the GmbH as paid-in capital? Sorry if I missed something obvious – I’ve never started a business in Germany, so perhaps I’ve asked some questions that aren’t very smart. But I would appreciate some help, if only because it’s always interesting to learn about how other jurisdictions work!   Oh, don’t worry. There is no such thing as unsmart questions about German tax law. I have to admit all the talks I had in the last weeks about this domain are the most pressing point on why I would refrain from this CU proposal in the first place  Edit: noteworthy not the session I had with @layerzero today! So yes, the seed funding seems to be a chicken-and-egg-problem. Most probably we will need to have the funding before the GmbH starts to exist. In this case, we will just go with our personal FIAT to do that. Then it is likely no corporate tax will apply (but maybe something different - most probably personal income tax, which is even higher!). It is hard to find somebody who likes to give legal advice without getting an upfront bribepayment. In any case - and this will be applied to any item on the budget proposal - if we need less DAI we will not put the money secretly into our own pockets, but instead return. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4639496927803375
                }
            ]
        }
    ],
    "group_index": "43"
}