{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/airdrop-for-makerdao-sourcecred-peoples/5916",
            "title": "Airdrop for MakerDAO Sourcecred peoples ",
            "index": 5916,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/dunks411",
                    "index": "#1",
                    "likes": "3",
                    "time": "05/01/2021-03:47:23",
                    "content": "Hi all, Adept Camp DAO is launching an algo stablecoin called JAM  We are planning on airdropping a bunch of AC tokens (that can be used to farm JAM (no need to provide liquidity just stake them)  to all the communities that use sourcecred including MakerDAO  plus a few extra communities too. Aragon is one of those communities for example. Just wanted to let you all know and maybe try and liaise with someone from here as well. Hope its ok that we send you all some tokens!?!  The plan is to grab all the addresses from a communities sourcecred instance and airdrop prorata (according to cred score?). It’s kinda an experiment in ways to do “fair launch” as opposed to letting people farm with stablecoins like basis.cash and other forks have been doing. Also since we are attempting to make sourcecred a central part of how we operate we want to kinda make a splash with other communities that are also using sourcecred. And of course we hope that some of those awesome people end up contributing etc to Adept Camp! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.690625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#2",
                    "likes": "0",
                    "time": "05/01/2021-09:29:15",
                    "content": "Is it this project ? : https://unifierdao.medium.com/minimum-viable-unifier-dao-4c603fd23316 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/dunks411",
                    "index": "#3",
                    "likes": "0",
                    "time": "05/01/2021-09:51:35",
                    "content": "Oh shoot. That’s actually meant to be a draft post! Not published. But yeah that is the general idea. There is this :https://adept.camp/ which also needs a ton of updates. And we have a discord which is pretty active considering its a really new project. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.303030303030303
                }
            ]
        }
    ]
}