{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/purpose-2-0-endgame-clean-money-and-nuclear-energy/18421",
            "title": "Purpose 2.0 - Endgame, Clean Money and Nuclear Energy \\xe2\\x9a\\x9b ",
            "index": 18421,
            "category": [
                "Governance"
            ],
            "tags": [
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "9",
                    "time": "19/10/2022-10:15:10",
                    "content": " Primer on spark and meta The Endgame Plan grew out the original Case for Clean Money, which was itself focused on the critical importance of “Spark” in DAO governance. Spark is the drive, interest and commitment by an individual to the DAO, and it grows out of the purpose and vision of the DAO itself, as well as the spark of other individuals in the DAO. It’s the thing that drives individuals to act according to the shared interests of the community, rather than their personal interest. Spark can also be thought of as the opposite of corruption. In Endgame terms spark is the result of good meta, while corruption is the result of bad meta. Every DAO immediately runs into the issue of spark as soon as its time to vote, since voter apathy and adversarial/biased voting is one of the greatest challenges to making DAO governance work. Spark is ultimately what drives someone to spend time out of their day, and sometimes even pay gas fees, to vote in a governance process where they see no direct benefit from putting in the work, but only share the benefit with all token holders including the free riders that don’t bother voting. When it comes to the decentralized workforce, spark matters even more. There are endless ways workforce members can choose to extract rather than add value to the DAO, and maximally extracting value is usually in their rational self interest. Spark in the workforce is what prevents this simple incentive from killing off the DAO due to corruption and selfishness.  Spark comes from a shared purpose beyond personal enrichment A key assertion of the Case for Clean Money, and the Endgame Plan, is that in order to develop a good meta that generates spark, the purpose of a DAO must go beyond simply making money and making token holders rich. Personal enrichment isn’t a shared purpose, but an individual purpose, so having that as the driving ethos promotes corruption rather than spark. Ultimately spark is about the individual giving up their personal interest in favor of the shared benefit of all stakeholders in the DAO. To generate spark, the DAO in turn must have a purpose that similarly gives up the direct, local, short term interest of the DAO, in favor of the shared interest of a broader group.  The challenges of Clean Money 1.0 The idea of the original Case for Clean Money was that Maker could use its massive potential for allocation of collateral to real world assets, to ensure that climate aligned investment was promoted to the point where it could make an impact in trying to avert the looming global climate disaster. This would mean going above and beyond the ESG crowd and the borderline greenwashing it promotes, and look at direct measurable impacts that could then be included (somehow) in the risk and decision making frameworks for allocating RWA collateral. All of this could then be verified through the open governance process and the transparency of blockchain technology. Not only would this help generate spark and provide security for Maker Governance, but it would also help with regulatory risk by providing a compelling reason for governments and regulators to support decentralized DeFi projects like Maker interacting with regulated Real World Assets. In practice two major developments have changed these assumptions:  Extreme complexity of RWA First, was not understood how complicated and political the process of onboarding “complex RWA” proposals, that are of the private credit-like type whose bespoke and customizable nature could also facilitate giving Maker an edge in climate impact with its collateral allocation. In practice it proved to be nearly impossible due to the complexity of such assets and the focus shifted towards simpler and more realistic onboarding of easily understood assets such as government bonds. This was still just attempting to copy a process that already exists in the real world. It would be orders of magnitude more complicated to attempt to build from scratch a new “clean collateral” framework that would directly measure climate impacts and reflect it in risk parameters.  Regulatory deterioration Secondly, the window of opportunity that would allow Maker to significantly impact the trajectory of crypto regulation closed with the disappointing lack of tangible progress in the last crypto bubble (including Maker’s inability to deliver on Clean Money). Instead of recognition as a promising technology that could help solve humanity’s problems, crypto became further branded as good for nothing other than scams and bubbles, exemplified by the collapse of Terra, Celsius and 3AC. This narrative has now defined a new wave of crypto regulation done “their way” as regulators have lost faith in the crypto ecosystems ability to self regulate. Both of these developments make the original proposed implementation of the Clean Money suboptimal. However, as it was the main direct mechanism meant to generate clear shared purpose that goes beyond personal enrichment, not to mention the general existential reasons to support climate action, a simpler and more realistic approach to Clean Money must be integrated into all the other elements of the equilibrium of Endgame.  Purpose 2.0 Clean Money 2.0 needs to be put in a proper Endgame context. The climate crisis is a unique moment of a severe and unprecedented existential risk for humanity, but it will only last for at most a few centuries, after which it will be over one way or another. For that reason, Clean Money by itself cannot be a permanent reliable source of purpose for Maker in the Endgame. Instead, we introduce a more flexible and adaptive model that can provide purpose and public goods for many different social impact causes, while also boosting the MetaDAOs brands, meta and governance readiness. The idea is in two parts.  MetaDAO level charity The first part is a new mechanism that applies to all MetaDAOs: 0.25% of the total MetaDAO token supply is emitted each year and put into a special charity account controlled by MetaDAO governance. To compensate, the yearly emissions for DA/ETHD/MKR yield farming is reduced from 3% per year to 2.75% per year. The MetaDAO governance process then can choose how to allocate these charity funds, and financially support one or more purposes that fit with, and contribute to strengthen, their general meta and brand. Experimentation and creativity is encouraged, as each MetaDAO can try pursuing different avenues for delivering high impact or creating public value in ways that may be overlooked today. While many of the core business functions of a MetaDAO typically have to be well run and managed by the MetaDAOs internal teams, the charity function can be left to the community to a much greater extent since often it can just be reduced to having community members vote about which charity to send funds to. This is a by itself a good community development activity, promoting a meta of active governance participation by token holders who care about shared purpose. If the MetaDAO doesn’t use the charity funds, or abuses them (such as by attempting to transfer it for non-charitable purposes, burning it, investing with it etc) then the funds are seized by Maker Core and used to benefit the MetaDAOs that do perform proper charity. In some cases the MetaDAO may also suffer a penalty for attempted abuse. This is regulated by the Ecosystem Scope similar to other forms of MetaDAO disputes. The outcome is that MetaDAOs are incentivized to learn how to allocate charity funds well, in a way that gives them a net positive internal benefit such as better and stronger meta, as well as positive branding effects. This is only possible if the community’s decisions are primarily driven by a genuine desire to do good and have a positive impact on the world. As a result it should be a major net benefit to humanity.  Maker Core level charity At the Maker Core level, there is also a Charity Pool. This pool is funded with 2000 MKR of emissions per year, and controlled by Maker Governance. To reduce the complexity of Maker having to directly micromanage and deploy the charity funds towards open ended proposals, they are instead distributed through a yearly “MetaDAO Charity Competition”.  MetaDAO Charity Competition Each year the Ecosystem Scope retrospectively evaluates the charity programs of each MetaDAO, monitoring for impact, creativity, novelty, efficiency etc. Based on this, a shortlist of the highest ranking MetaDAOs is created, and MKR holders then vote for a winner. The winner receives the entire yearly pool of 2000 MKR, and is then able to use this pool for their charity initiatives the following year. Since the MetaDAOs that are most effective at using their charity funds will have developed ways to generate intangible value from their charity efforts already, this results in a real financial incentive for MetaDAOs to compete with each on standing out as the best, creating a dynamic “arms race” of social impact. Beyond all the amazing social impact and public good that will benefit humanity, a second order effect will also create a more dynamic and gamified experience of how the MetaDAOs view themselves and each other. The dynamic of the MetaDAO charity competition can create rivalries, narratives, legends and myths amongst the MetaDAOs, and it will be a part of the decentralized governance process that will be mostly spearheaded and run by regular token holders and enthusiasts voluntarily participating in governance, rather than paid professionals, which is an extremely valuable habit to nurture.  Bootstrapping Purpose 2.0 Before we get to the Endgame state of Purpose 2.0, the MetaDAOs need to be fully bootstrapped and have functional charity processes and token emissions systems that allow them to operate it at scale with token voting. While waiting for this to come online, Maker also has a commitment to deal with the immediate existential crisis of climate change through Clean Money, and the solution to both of these elements can be implemented as Clean Money 2.0  Clean Money 2.0: Carbon neutral collateral + promoting the Nuclear Renaissance The first requirement of Clean Money 2.0 is that it must be simple and not get in the way of RWA processes by introducing brand new concepts or complexity. The second requirement is that it must prioritize the internal benefits to the meta of the Maker community, rather than prioritize influencing regulatory developments. It should of course still be seen as an important factor in proving Makers value to society, but this should not be the main goal. The solution suggested here is a two fold approach: First a simplified version of Clean Collateral, which is simply modelled on the standard simple ESG approach of using exclusion lists. Maker Core can maintain an exclusion list of certain unsustainable industries and business practices and then screen out the validity of any collateral that violates the exclusion list in some form. This is a common practice used by ESG frameworks and is relatively easy to implement, and to find good starting points for. An extension of the exclusion list approach is the focus that the Endgame Plan already has on maximizing Staked ETH as collateral. Since ETH 2.0, Staked ETH happens to be near carbon neutral by default, making it even easier and simpler to get the entire Dai collateral portfolio compliant as carbon neutral. However, just getting Maker carbon neutral isn’t going to help avert the looming collapse of society, it will just slightly slow it down at best. Clean Money is about giving people a way to save the world just by changing how they hold their savings, and that means funding things that will outcompete and eliminate the fossil fuel industry. The MetaDAO Charity Pools for Protectors already provide a strong solution that will pull in this direction, since the Protectors will be incentivized to find ways to turn good meta into value, they will naturally look for ways to expand this advantage beyond just their Charity Pool, and will be able to flexibly find ways to have positive impacts with their RWA collateral without needing any intervention from Maker Governance. But Maker itself must use its global scale and powerful economic potential to make its own mark in the short term, as the global climate disaster is too big of an existential threat to ignore for a project that aspires to be a provider of stability and fundamental infrastructure. There now exists a very interesting opportunity to both make a meaningful difference while also not overextending Maker Governance: Supporting the advocacy of nuclear power as the completely neglected but most important short term measure of the sustainable energy transition. The Ukraine war and the disastrous reality of climate change has finally opened the door to the world changing its mind on nuclear, a turning point for humanity called the Nuclear Renaissance and the only realistic avenue left for averting global collapse. To learn more about this, and especially learn about the common lies and misconceptions that exist about nuclear in an accessible format, you can watch the TED talk below.      Nuclear power is an essential part of the sustainable economy as it is the only form of clean energy that can deliver base load at scale - that is it can run and be relied on in the situations where the intermittent clean energy sources (solar and wind) are off. Batteries can to some extent help deal with intermittency, but in practice it is uneconomical to scale it for winter grid base load and also the batteries are needed for the global scale electrification of most transportation infrastructure on earth. All avenues must be pursued, including both batteries and nuclear energy, and right now humanity is completely neglecting nuclear energy. Nuclear energy can also deliver a lot of important benefits that go beyond electricity including heating, clean hydrogen production, catalyzation of other chemical processes, scalable desalination (which is critically important to deal with climate change induced drought) and much more. And it is incredibly safe compared to the extremely dangerous fossil fuel technology that it replaces. Nuclear and safety: the surprising truth - Energy For Humanity During the Purpose 2.0 bootstrapping phase Maker can deliver above and beyond the Clean Money promise by using the Charity Pool funds to donate to support nuclear advocacy groups that can help spread these simple truths, such as Nuklearia Impressum/Spenden | Nuklearia, which recently helped prevent the disastrous shutdown of 3 pristine clean energy producing nuclear reactors in Germany. Solar, Wind and batteries are already being produced at full capacity and have difficult marginal economics which means that Maker can’t easily use it’s RWA muscles to have a major impact unless we are willing to lose money or take excess risk, or we are very smart about and have very flexible governance (this is possible for MetaDAOs, and incentivized through Purpose 2.0 as explained above, but not realistic for Maker Core). Nuclear advocacy on the other, can achieve massive global impacts with just relatively small donations that go towards education and advocacy to overcome all of the broken misconceptions and hostile memes planted by the fossil fuel industry. Once the Maker community itself learns to see through the lies and misconceptions about nuclear energy, contributing to its broad adoption will become a key source of internal meta and purpose, as there is simply no higher social impact activity that is possible today. It is the ideal starting point for the Purpose 2.0 system, as it gives MKR holders a narrow scope with minimal complexity that delivers on Clean Money. Over time as the climate crisis is hopefully improved through a global Nuclear Renaissance that gets us on a realistic path to outcompete and eliminate all use of fossil fuel worldwide, the MetaDAOs will be ready to engage their own charity programs. Maker can then transition its Charity Pool towards the Endgame state of Purpose 2.0 by supporting the MetaDAO Charity Competition as described above. ",
                    "links": [
                        "https://www.energyforhumanity.org/en/briefings/energy/nuclear-power-and-safety-the-facts/",
                        "https://nuklearia.de/impressum/",
                        "https://forum.makerdao.com/t/relay-semanal-20-de-octubre-28-de-octubre-del-2022/18703",
                        "https://forum.makerdao.com/t/governance-and-risk-212-thursday-october-20-at-17-00-utc/18427/3",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/22",
                        "https://forum.makerdao.com/t/proposito-2-0-endgame-dinero-limpio-y-energia-nuclear-traduccion/18578",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-octubre-2022/18516",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/26",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/21",
                        "https://forum.makerdao.com/t/monetalis-concerns/18900/2"
                    ],
                    "GPT-summary": "The author explains the Endgame Plan, which is a proposal for DAO governance. The plan focuses on the importance of \"spark\" in DAO governance, which is the drive, interest, and commitment by an individual to the DAO. The author proposes a new mechanism that applies to all MetaDAOs, which is a charity account controlled by MetaDAO governance. The author also suggests a simplified version of Clean Collateral and promoting nuclear power as the most important short-term measure of the sustainable energy transition. The post includes constructive criticism of the original Case for Clean Money and the challenges of implementing it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.680039360441147
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "2",
                    "time": "19/10/2022-18:27:18",
                    "content": "Writing as a community member, not an officlal ISCU communication.     rune:  Once the Maker community itself learns to see through the lies and misconceptions about nuclear energy, contributing to its broad adoption will become a key source of internal meta and purpose   Clean money as a broad goal makes sense. It is evergreen, in the sense of universally and continually relevant. On the other hand, nuclear energy is controversial and will likely remain so. I personally think nuclear is a dead-end and wasted investment compared to true renewables. You claim that the community can reach consensus about nuclear power by way of learning. I’m not opposed to education. I think your proposal could be made more appealing by including an evaluation of specific solutions and not assuming that nuclear dominance is fait accompli. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.770833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#3",
                    "likes": "3",
                    "time": "20/10/2022-17:32:06",
                    "content": "    rune:  Nuclear advocacy on the other, can achieve massive global impacts with just relatively small donations that go towards education and advocacy to overcome all of the broken misconceptions and hostile memes planted by the fossil fuel industry   This bit confused me. Nuclear power has some of the wealthiest backers in the world. Billionaires like Bill Gates, Jeff Bezos and Peter Thiel have put significant money into it. 3.4 billion last year. Elon Musk and  Marc Andreessen are publicly advocating for it. Nuclear advocacy groups raise millions a year in funding. These entities have far more money and reach than MakerDAO. How are we going to make a significant impact that they can’t? Source: Bloomberg - Are you a robot? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.072916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#4",
                    "likes": "1",
                    "time": "29/10/2022-15:39:40",
                    "content": "After thinking about it, I have come around on this idea. If the ultrarich and VCs are big on nuclear power, then MakerDAO may be able to attract big investors by tying its brand to nuclear power. Advocacy is also high impact on brand awareness and we can treat this as a marketing expense. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party advertising proposal"
                    ],
                    "Sentiment": 5.825
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#5",
                    "likes": "2",
                    "time": "29/10/2022-21:40:48",
                    "content": "One of the best areas for charitable funding is education and the provision of tools for educational materials to communities in extreme poverty or without educational institutions that provide quality educational content. Charitable funds could be blended into a quadratic fund to further social objectives ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.587962962962964
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#6",
                    "likes": "6",
                    "time": "08/11/2022-13:20:43",
                    "content": "Here are some good links that helps make sense of why exactly nuclear is so incredibly important. The bottom line is that solar and wind isn’t as good or useful as we have been led to believe, mainly for ideological reasons. The biggest problem with wind and solar is that it doesn’t scale well, and gets more expensive over time as we run out of the massive quantities of easily accessible raw materials needed to produce them. So it’s possible to build some, but its unrealistic to have it replace all or significant parts of the fossil fuel infrastructure - which also helps it gain favour with the powers that be. It is simply not a real threat. Meanwhile, nuclears biggest benefit is that it has seemingly infinite potential to get cheaper and more powerful as it is scaled up and the science develops further. Replacing all fossil fuel infrastructure with mass nuclear makes perfect sense scientifically and economically, but this potential for scalable clean energy is sadly held back by hostile and restrictive regulation driven by misguided ideology and fossil fuel interests. Profitability of wind turbines: https://www.bloomberg.com/news/articles/2022-11-07/wind-giant-rues-promise-that-renewable-power-could-be-free?utm_medium=social&utm_source=twitter&utm_campaign=socialflow-organic&cmpid%3D=socialflow-twitter-energy&utm_content=energy Great twitter thread on the hidden copper and overall raw material issue:   twitter.com    B.F. Randall ⚛ ⛏ ⚡ @Mining_Atoms  COPPER🧵redux. I live near one of the largest copper mines on earth (Kennecott Utah Copper - KUC). I helped manage a smaller copper mine for 8 years. Observation: Wind/Solar/Battery Proponents & ESG bean-counters are completely out of touch with copper mining & production. https://t.co/F50u6rRxDp   10:09 PM - 23 Oct 2022           16K                5.3K            And here is a resource on the economics of nuclear power in general, looking at the past, present and future:    What is nuclear?    Economics of nuclear power Why are nuclear reactors expensive? Complexities due to radiation hazards are the crux. Learn what it is about nuclear reactors that causes them to generally cost a lot, and what can be done to reduce the cost      IMO the weird situation that nuclear is in is exactly where Clean Money can make a difference. Instead of greenwashing and faking environmental concern, we can push the needle in the place where it is really needed, and where it is clear there is a tragic misallocation of resources and attention. The traditional financial or political system would never be able to take a stand like this and will simply barrel off the cliff burning diesel to dig up billions of tons of copper. With Maker, DeFi and open decentralized governance we have an opportunity to make decisions based on rational analysis of the facts and science focusing on real impact that matters rather than just following emotions, politics and gaslighting. ",
                    "links": [
                        "https://twitter.com/mining_atoms/status/1584306032653717505",
                        "https://twitter.com/mining_atoms/status/1584306032653717505",
                        "https://twitter.com/mining_atoms/status/1584306032653717505",
                        "https://t.co/F50u6rRxDp",
                        "https://twitter.com/mining_atoms/status/1584306032653717505",
                        "https://whatisnuclear.com/economics.html",
                        "https://whatisnuclear.com/economics.html"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.438255417422084
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#7",
                    "likes": "1",
                    "time": "08/11/2022-18:12:55",
                    "content": "I think this is one of the more exciting and important dimensions of the Endgame - as a supporter of the original Clean Money proposal last year, I still believe there is massive scope for Maker to lead the way among crypto protocols in climate-aligned finance. Of course, the devil will be in the detail, but it was excellent to hear the Viridian Cluster team in the G&R call last week emphasise ‘arresting climate change’ as a priority in their strategy. Hopefully future MetaDAOs adopt similar positions. Finally, there’s a lot of merit in the role of a Charity Pool to provide funding towards climate-related charities - including nuclear advocacy (which I agree is vital) and hopefully other charities too. I predict that some in Maker governance will balk at having emissions of 2000 MKR per year (about ~$1.5m at present price) for charity, but that seems like money well spent to me. For skeptics, Vitalik wrote a nice blog on the value of legitimacy in crypto projects which I found pretty compelling, including the benefits of supporting underfunded public goods in the real world. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-214-november-03-at-17-00-utc/18637",
                        "https://vitalik.ca/general/2021/03/23/legitimacy.html",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/29"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.003787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#8",
                    "likes": "1",
                    "time": "08/11/2022-21:08:14",
                    "content": "@rune @Matt_NZ @cryptenthusiastic Nuclear power is undergoing a resurgence for a number of reasons. Firstly, it is an emissions-free energy source that can support the transition to cleaner ways of producing power, which also include wind and solar energy. A combination of public and private investment is supporting the development of different SMR systems. Bill Gates’ TerraPower is installing its first small modular reactor in a town in the US state of Wyoming with historic links to coal mining. Another company, NuScale, is developing a range of next-generation reactors at the Idaho National Laboratory, having created the first commercial small modular reactor design to receive official US approval. They are safer and less exposed to dangers like earthquakes and meltdowns than traditional large-scale reactors. As with all nuclear power plants, they don’t emit greenhouse gases, meaning they support global efforts to reach net-zero emissions. Importantly, SMRs can also be safely turned off and restarted, unlike conventional plants. Traditional nuclear reactors take many years to bring online and require many decades of use to produce a return on the high capital costs needed to build them. Small modular reactors, on the other hand, can be prefabricated, making manufacturing, shipping and installation simpler and swifter.   World Economic Forum    Small reactors could make nuclear energy big again. How do they work, and are... Nuclear power is undergoing a revival as countries move to decarbonize and boost energy security. Small modular reactors are driving it. What are they?      Or look to donate/invest in nuclear fusion research and development. For Example, LPP Fusion https://wefunder.com/lppfusion/ With only millions invested, they have made more progress than projects with billions. They are closer to the goal of producing net energy than any other private fusion company. The generators that they are developing would provide decentralized, reliable and secure energy that can reach everyone in the world, completely replacing fossil fuels and freeing up trillions of dollars in annual energy cost for other uses. ",
                    "links": [
                        "https://www.weforum.org/agenda/2022/10/nuclear-power-power-plant-smrs-clean-energy/",
                        "https://www.weforum.org/agenda/2022/10/nuclear-power-power-plant-smrs-clean-energy/",
                        "https://wefunder.com/lppfusion/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.332210884353742
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#9",
                    "likes": "5",
                    "time": "09/11/2022-02:36:56",
                    "content": "For some of you (cough cough @rune) advocating the use of a MetaDAOs tokens as collateral or even supporting MKR as collateral, probably a good idea to read CZ’s latest thread re FTT:   mobile.twitter.com    CZ 🔶 Binance @cz_binance  Two big lessons:   1: Never use a token you created as collateral.   2: Don’t borrow if you run a crypto business. Don't use capital \"efficiently\". Have a large reserve.  Binance has never used BNB for collateral, and we have never taken on debt.  Stay #SAFU.🙏   10:05 PM - 8 Nov 2022           55K                9.2K            Tldr – it’s a batshit crazy idea and you support at the system’s peril. ",
                    "links": [
                        "https://mobile.twitter.com/cz_binance/status/1590103159506341888?s=20&t=TWp-85Z_bV9nsciuoDoM_g",
                        "https://mobile.twitter.com/cz_binance/status/1590103159506341888?s=20&t=TWp-85Z_bV9nsciuoDoM_g",
                        "https://twitter.com/search?q=%23SAFU",
                        "https://mobile.twitter.com/cz_binance/status/1590103159506341888?s=20&t=TWp-85Z_bV9nsciuoDoM_g"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.886904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "2",
                    "time": "09/11/2022-16:41:39",
                    "content": "    Tosh9.0:  https://mobile.twitter.com/cz_binance/status/1590103159506341888?s=20&t=TWp-85Z_bV9nsciuoDoM_g   Agreed! Please let’s make the right decision on mip84c10-sp1. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip84c10-sp1-modify-emulated-surplus-buffer-upper-limit/18315"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#11",
                    "likes": "2",
                    "time": "09/11/2022-18:51:20",
                    "content": "Maker is rather questionable on #2 2: Don’t borrow if you run a crypto business. Don’t use capital “efficiently”. Have a large reserve. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.2857142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#12",
                    "likes": "2",
                    "time": "09/11/2022-20:03:57",
                    "content": "The problem for nuclear power is the market is getting worse for it every year. Nuclear plants have high fixed costs and no marginal costs.  They want to run very high capacity factors. That works decently in a fossil fuel heavy grid, where the nuclear plant can operate as baseload power and have natural gas, whose primary cost is fuel, serve as a backup. It works badly in a renewable heavy grid, where supply is highly variable and the nuclear plant can’t rely on a 95%+ capactiy factor. Unfortunately for nuclear, most grids are onboarding renewables and any new plant is going to be facing a grid that is regularly saturated with wind and solar. This will skyrocket the cost per KWH of nuclear plants and any technological advancement will need to be massive to outpace the declining revenue energy producers are facing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.97844696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#13",
                    "likes": "2",
                    "time": "09/11/2022-20:05:50",
                    "content": " In addition to those great words of wisdom from CZ, I highly recommend everyone take a stroll through LBRY’s Twitter timeline and consider the applicability to Endgame plans of the specific facts  persuading the court that an illegal unregistered securities offering took place. Facts we are now on notice about and will be held accountable to know. See Tweets since the summary judgement news in SEC’s favor was announced on 7 November: https://twitter.com/LBRYcom Now consider how many more of these     do you need to course correct before it is too late. Oh wait, here’s another one. The next day, 8 November, we heard from the US Treasury Department with an update on the Tornado Cash situation. Is it comforting they no longer are targeting software for sanctioning? No, not really. We all know it is meaningless to sanction “code.” So, they have learned how better to sharpen their knives and put the world on notice that even though: “OFAC has not designated Tornado Cash’s individual founders, developers, members of the DAO, or users, or other persons involved in supporting Tornado Cash AT THIS TIME” (emphasis mine)… the Tornado Cash “person” referred to is an organization AND: “Tornado Cash’s organizational structure consists of: (1) its founders and other associated developers, who together launched the Tornado Cash mixing service, developed new Tornado Cash mixing service features, created the Tornado Cash Decentralized Autonomous Organization (DAO), and actively promoted the platform’s popularity in an attempt to increase its user base; and (2) the Tornado Cash DAO, which is responsible for voting on and implementing new features created by the developers.” (emphasis again mine) The issue of KNOWLEDGE AND COMPLIANCE WITH LAWS is a matter of competency, credibility, and accountability. Whatever are the business or social ambitions of the community - we cannot proceed with any plan and NOT account seriously, transparently and responsibly for things that are FACTS FACING US. Whether you like the reach of the United States and its laws and its enforcement powers is beside the point. That reach and that power is a force to be reckoned with one way or another. ACREinvest has no interest or agenda for our participation in this community at this point other than to help save this project from destruction by its own hands if that’s possible. Read it for yourselves: 1095. Who is the Tornado Cash “person” that OFAC designated pursuant to E.O. 13722 (“Blocking Property of the Government of North Korea and the Workers’ Party of Korea, and Prohibiting Certain Transactions with Respect to North Korea”) and Executive Order (E.O.) 13694 (“Blocking the Property of Certain Persons Engaging in Significant Malicious Cyber-Enabled Activities”), as amended? Answer A “person” subject to designation under E.O. 13722 or E.O. 13694, as amended, includes an individual or an entity, defined as “a partnership, association, trust, joint venture, corporation, group, subgroup, or other organization.” Once OFAC has determined that a person is subject to sanctions, OFAC adds that person to the Specially Designated Nationals and Blocked Persons List. OFAC designated the entity known as Tornado Cash, which is a “partnership, association, joint venture, corporation, group, subgroup, or other organization” that may be designated pursuant to IEEPA. Tornado Cash’s organizational structure consists of: (1) its founders and other associated developers, who together launched the Tornado Cash mixing service, developed new Tornado Cash mixing service features, created the Tornado Cash Decentralized Autonomous Organization (DAO), and actively promoted the platform’s popularity in an attempt to increase its user base; and (2) the Tornado Cash DAO, which is responsible for voting on and implementing new features created by the developers. Tornado Cash uses computer code known as “smart contracts” to implement its governance structure, provide mixing services, offer financial incentives for users, increase its user base, and facilitate the financial gain of its users and developers. OFAC has not designated Tornado Cash’s individual founders, developers, members of the DAO, or users, or other persons involved in supporting Tornado Cash at this time. However, all Tornado Cash property and interests in property are blocked, and U.S. persons cannot transact with Tornado Cash or deal in its property and interests in property, absent authorization from OFAC. See FAQs 1077 and 1078. Date Released November 8, 2022 Source: 1095 | U.S. Department of the Treasury ",
                    "links": [
                        "https://home.treasury.gov/policy-issues/financial-sanctions/faqs/1077",
                        "https://home.treasury.gov/policy-issues/financial-sanctions/faqs/1078",
                        "https://home.treasury.gov/policy-issues/financial-sanctions/faqs/1095"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.017700817700818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#14",
                    "likes": "0",
                    "time": "09/11/2022-20:32:22",
                    "content": "    CodeKnight:  where supply is highly variable   And battery tech has continued to charge ahead. ",
                    "links": [
                        "https://www.youtube.com/watch?v=uwnXwEudh_U"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#15",
                    "likes": "1",
                    "time": "09/11/2022-21:08:25",
                    "content": "We don’t always agree but certainly seeing eye-to-eye on this one, Eric. Douche 9.0 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "09/02/2023-03:09:17",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}