{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/leaked-copy-of-us-draft-bill-shows-defi-and-daos-under-regulatory-lens/16450",
            "title": "Leaked copy of US draft bill shows DeFi and DAOs under regulatory lens ",
            "index": 16450,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "legal",
                "regulation",
                "dao-impact"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "7",
                    "time": "08/07/2022-16:26:29",
                    "content": "Did you all see this ? Worth a read imo…    Cointelegraph    Leaked copy of US draft bill shows DeFi and DAOs under regulatory lens While the policies are indeed strict, many experts were quick to point out that it is only a draft bill at this point.      As the article points out, the definition of DeFi still seems vague but this is coming whether we like it or not. ",
                    "links": [
                        "https://cointelegraph.com/news/leaked-copy-of-us-draft-bill-shows-defi-and-daos-under-regulatory-lens"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.633333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#2",
                    "likes": "1",
                    "time": "09/07/2022-14:39:41",
                    "content": "Indeed! This is a good Tweet thread about it https://twitter.com/arjunmahadevan/status/1545079976399077377?s=20&t=4M4TSEDNoLctp1nbARSL5A I’ll take this opportunity to mention that commodities regulation under the CFTC is a core practice area of @DaveringtonPLLC. Thought I’d mention it here in light of MIP55c3-SP5: Interim Chief Legal Officer. Just sayin. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip55c3-sp5-interim-chief-legal-officer/15981"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/07/2022-15:06:22",
                    "content": "Duly noted!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#4",
                    "likes": "5",
                    "time": "09/07/2022-15:46:17",
                    "content": "I think this was already shared a while back, or at least other similar rumors/leaks. I would expect it to ultimately leave some sort of way for Maker to integrate with US crypto markets and remain decentralized. The requirement to “register” or disclose stuff may not necessarily mean full scale backdoor centralization. But on the other hand some kind of blanket ban / attempt to take backdoor control of defi is something we have always expected and should be prepared for. Maker will should always choose decentralization at whatever the price. Dai is entrenched enough that it wouldn’t be a death sentence to have it banned from US exchanges, or even all centralized crypto exchanges, and most of our tech is in place to the point where we could move to a world where all core units and contributors are anonymous. Ultimately there are some powerful tools we have available to deal with a US/EU de facto ban of decentralization: Staked ETH, Dai generated from MKR, MetaDAOs with decentralized frontends and decentralized business models, crypto friendly jurisdictions like UK and UAE, and finally, if it comes to it, depegging from USD by implementing TRFM. I think it is obvious we should break the USD peg before we irreversibly centralize the Maker protocol, if it ever comes to that. We’re here to create unbiased and decentralized money and can never betray that goal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.564236111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#5",
                    "likes": "1",
                    "time": "09/07/2022-15:56:49",
                    "content": "Yes this could be the same draft, but the space has had more time to go through it all, as have regulators. In any event, I think it would be a shame to lose out on the US and EU for obvious reasons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#6",
                    "likes": "2",
                    "time": "09/07/2022-16:00:20",
                    "content": "Absolutely, and this is where lobbying efforts helps, which the broader Maker ecosystem does have some very good resources dedicated towards. Another thing that’s gonna help is to show regulators and more important regular people (i.e. voters) that DeFi and Dai can provide real value to the world, not just be big ponzi. This is where Clean Money and paying off with tangible and verifiable impact such as renewable energy funding can make a real difference if we can establish a narrative that cuts through the noise. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.388333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#7",
                    "likes": "0",
                    "time": "09/07/2022-18:48:17",
                    "content": "Yes and there is at least one “DAO” dedicated to lobbying. Andrew Yang founded https://www.lobby3.io/ which, from what I know, is supposed to help onboard the folks in Washington. I did not mint the token although I did reach out to see if they were looking for in house counsel. But the idea is to inform the politicians. We have a ways to go but many of us are trying. Once everything shakes out in terms of the legislation in the U.S. I am hoping that we get guidance as opposed to the enforcement first mindset. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                }
            ]
        }
    ]
}