{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-resubmit-inclusion-poll-for-mip12c2-sp4-lrc-collateral-onboarding/3692",
            "title": "Signal Request: Resubmit Inclusion Poll for MIP12c2-SP4 - LRC Collateral Onboarding ",
            "index": 3692,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "collateral-onboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "2",
                    "time": "16/08/2020-17:20:23",
                    "content": "Last week the LRC Inclusion Poll failed to pass with 17k MKR saying “No” vs 800 MKR saying “Yes”. However, this 17k came from one voter vs 7 unique yes’. https://mkrgov.science/poll/255 It’s hard to say the motivations of this one No voter but due to the crazy yield farming and gas prices going on lately I feel this poll deserves another shot. Therefore I am asking the community to signal whether we should re-add this poll into next Monday’s (August 24th) votes. Should we resubmit Inclusion Poll for MIP12c2-SP4 - LRC Collateral Onboarding on Monday, August 24th, 2020?     Yes No Abstain     0 voters     I will run this poll until 2020-08-23T16:00:00Z as it should be easy for @LongForWisdom to resubmit. If he has objections I will end earlier for him to review as well as make sure there is decent community participation to reach consensus. I look forward to your comments and participation. Edit: Based on @LongForWisdom’s guidance, this signal request (if passed) would set the expectation to the working group that the community would like to see LRC resubmitted into next months governance cycle. ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-mips-update-13/3906",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-106-thursday-august-20-4-00-pm-utc/3657/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-8/3712",
                        "https://forum.makerdao.com/t/weekly-mips-update-12/3710"
                    ],
                    "GPT-summary": "The author of the post is requesting feedback from the community on whether to resubmit an inclusion poll for LRC Collateral Onboarding. The post also addresses the failure of the previous poll and the potential reasons behind it. The author is running a poll until August 23rd and is looking for community participation and comments.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 4.868589743589744
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "3",
                    "time": "16/08/2020-19:17:49",
                    "content": "The subproposal in question would be up to the author (@NikKunkel) to resubmit. Alternatively, I believe someone else could take over authorship, provided Nik and @charlesstlouis agree. I wouldn’t say this is a signal that requires an on-chain vote (as the subproposal itself carries an on-chain vote.) Given how few addresses voted in the LRC inclusion poll, I don’t think it’s unreasonable to submit it again for September and hope for more turnout and a positive outcome. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.878787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "0",
                    "time": "16/08/2020-19:21:58",
                    "content": "Is there no way to still get it into this months governance cycle if we include it in polling next week? I’m all for re-including it in September but was hoping by signalling we could get it onboarded by the end of the month. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "4",
                    "time": "16/08/2020-19:43:46",
                    "content": "We could use the weekly cycle, but I think that sets a really bad precedent for governance so there would have to be a very good reason for me to consider allowing it (which I don’t think really exists given the proposed debt ceiling on LRC is only 3 million.) As a general rule, if something is voted out of the monthly cycle at the inclusion stage, it seems a bit scummy to allow a re-vote in the same month because the community didn’t like the outcome. To some extent, I’d also like larger MKR voters to see this as a relatively low-cost lesson and hopefully an incentive to vote more consistently in on-chain polls. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#5",
                    "likes": "3",
                    "time": "16/08/2020-19:45:06",
                    "content": "Fair enough. Great rebuttal. I defer to your governance expertise. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "0",
                    "time": "26/08/2020-15:01:49",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "1",
                    "time": "26/08/2020-15:02:41",
                    "content": "LRC is planned to be re-submitted into the September Governance Cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}