{
    "poll_list": [
        {
            "title": "Should we add MANA to the Maker Protocol? - May 25, 2020",
            "index": "2320",
            "option": "Yes",
            "supporting_mkr": "29,480",
            "highest_fraction": 0.91
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mana-mcd-application-by-decentraland/2320",
            "title": "[MANA] - MCD Application by Decentraland ",
            "index": 2320,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "mana"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Agustin",
                    "index": "#1",
                    "likes": "6",
                    "time": "02/05/2020-01:18:34",
                    "content": "Hey DAI community, We at Decentraland would like to put in an application to have MANA accepted as collateral in Multi-collateral DAI. I’ve included our application below - please let me know if you have any question. Thanks for the support! Agus  1. Who is the interested party for this collateral application? The Decentraland Foundation, established under the laws of the  Republic of Panama, in its capacity as holder of the intellectual property assets of Decentraland. Since the launch of the platform, a Decentralized Autonomous Organization (DAO) has been created through which the control of the platform is in the hands of the MANA holders and LAND owners 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. Decentraland is the first-ever decentralized virtual world. Being decentralized is not a side detail, but core to the platform’s value proposition. In this context, decentralization means that the world is in the hands of its users, which include artists, builders, game developers, and enthusiasts, and they have the final say on the policies of the world. MANA is the currency of Decentraland. At the inception of the MANA token, the total supply was 2,805,886,393. Due to its utilization and burn in the Districts Terraform, LAND auctions, and purchases, trades, and fees in the marketplace, that figure has been reduced to around 2,197,924,865 as of April 2020. 2. Provide a brief history of the project. Initially ideated in 2015, Decentraland has been consistently growing through the efforts of its community of creators who also take part in regular creative events. Aside from the scenes, games, art installations, and many more features that make up what is known as the ‘metaverse’, Decentraland is also a model of decentralized ownership and decision-making and a steward of the development of the Ethereum ecosystem. The virtual world consists of a decentralized ledger for land ownership, a protocol for describing the content of each land parcel, and a peer-to-peer network for user interactions. Land in Decentraland is permanently owned by the community, giving them full control over their creations. Users claim ownership of virtual land on a blockchain-based ledger of parcels. Landowners control what content is published to their portion of land, which is identified by a set of cartesian coordinates (x,y). Land is a non-fungible, transferable, scarce digital asset stored in an Ethereum smart contract. It can be acquired by spending MANA. Decentraland opened its gates to the public on February 20, 2020. Not just the culmination of years of hard work, the launch was the beginning of the next major phase of the Decentraland project: handing over control to the community and expanding its reach to all corners of the physical world with the creation of the DAO. 3. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Whitepaper:  https://decentraland.org/whitepaper.pdf  Documentation:  https://docs.decentraland.org  Source code:  Explorer:  Source: https://github.com/decentraland/explorer  Live: https://play.decentraland.org    Catalysts (decentralized content & communications):  Source: https://github.com/decentraland/catalyst  Live: https://catalyst-monitor.now.sh/    Smart contracts:  List: https://contracts.decentraland.org/links  Source of the key ones:  LAND & Estates: https://github.com/decentraland/land  Marketplace: https://github.com/decentraland/marketplace-contracts  Bids (Marketplace): https://github.com/decentraland/bid-contract  Wearables: https://github.com/decentraland/wearables-contracts  ENS: https://github.com/decentraland/avatars-contract    Aragon DAO:  Live: https://mainnet.aragon.org/#dcl.eth  Explainer: DAO Explainer  Diagram:        4. Link any available audits of the project. Both procedural and smart contract focused audits. We audit all the smart contracts we publish (the list is pretty long: https://contracts.decentraland.org/addresses.json) Please find attached the ones we were able to collect:  2017.07 MANA - conducted by Zeppelin 2018.12 Land Auction - conducted by Coinfabrik 2019.01 Marketplace & Bids - conducted by Nomic Labs 2019.03 Marketplace Auction - conducted by Nomic Labs 2018.06 LAND Registry - conducted by LevelK 2018.08 Estates Registry - conducted by LevelK 2018.09 Marketplace V2 - conducted by LevelK 2018.12 Land Auction - conducted by an Independent Researcher 2019.01 PassThrough Contract - conducted by an Independent Researcher 2020.01 ENS Avatars - conducted by an Independent Researcher 2020.03 NFT Donation - conducted by an Independent Researcher  We’re checking with the authors if it’s OK to make the not linked documents public: please don’t share externally before we can give you green light. 5. Link to any active communities relating to your project.  Discord (https://discord.gg/sBwfJn) Twitter (https://twitter.com/decentraland) DCL Plazas (dclplazas.com) DCL Blogger (https://twitter.com/DCLBlogger) Marketplace (market.decentraland.org) Reddit (https://www.reddit.com/r/decentraland/) Decentraland University (https://discord.gg/ubp7yF) DCL Core (https://dclcore.com/) Steemit (https://steemit.com/@decentraland) Blockfolio The Blockrunner (https://discord.gg/AgPExR) Telegram (https://t.me/DecentralandTG) DCL RU (https://t.me/decentraland_ru) Facebook page (https://www.facebook.com/decentraland) Facebook Decentraland group (https://www.facebook.com/groups/mana.decentraland/) Facebook MANA group (https://www.facebook.com/groups/Decentraland/)  6. How is the applying collateral type currently used? MANA is used in the Decentraland Marketplace (market.decentraland.org) to trade digital assets. MANA is also used to transact in-game, and to vote for changes and developments in Decentraland, via the DAO. 7. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? The MANA smart contract is not controlled by any organization. 8. Where does exchange for the asset occur?  Alterdic Bancor Network Bibox Binance Bitfinex Bitkub Bitsdaq Bitso Bittrex BW.com Cat.Ex Coinbase Pro CoinEx Dex-Trade DragonEX Exrates Gate.io HitBTC Huobi Global Huobi Korea IDEX KuCoin Kyber Network LATOKEN LiteBit.eu Livecoin Lukki Exchange Mercatox MXC OKEx OKEx Korea Omgfin P2PB2B Poloniex Radar Relay TOPBTC Uniswap Upbit VCC Exchange WazirX WBF Exchange ZB.COM ZG.com  9. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. N/A 10. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. N/A 11. (Optional) List any possible oracle data sources for the proposed Collateral type. Binance would be the best option as it has the most real volume. 12. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. N/A ",
                    "links": [
                        "https://docs.decentraland.org/",
                        "https://github.com/decentraland/explorer",
                        "https://play.decentraland.org/",
                        "https://github.com/decentraland/catalyst",
                        "https://catalyst-monitor.now.sh/",
                        "https://contracts.decentraland.org/links",
                        "https://github.com/decentraland/land",
                        "https://github.com/decentraland/marketplace-contracts",
                        "https://github.com/decentraland/bid-contract",
                        "https://github.com/decentraland/wearables-contracts",
                        "https://github.com/decentraland/avatars-contract",
                        "https://mainnet.aragon.org/#dcl.eth",
                        "https://docs.google.com/document/d/100Nn1NTxluM96LiCD1ItMs7PboYMjHeFMP8NfDBB1nU/edit?ts=5e3c185f",
                        "https://contracts.decentraland.org/addresses.json",
                        "https://blog.zeppelin.solutions/decentraland-mana-token-audit-ee56a6bca708",
                        "https://blog.coinfabrik.com/decentraland-security-audit/",
                        "https://medium.com/nomic-labs-blog/decentraland-audit-report-a7465c8eb14c",
                        "https://medium.com/nomic-labs-blog/decentraland-audit-report-ad8cb2a3cd48",
                        "https://discord.gg/sBwfJn",
                        "https://twitter.com/decentraland",
                        "http://dclplazas.com/",
                        "https://twitter.com/DCLBlogger",
                        "http://market.decentraland.org/",
                        "https://www.reddit.com/r/decentraland/",
                        "https://discord.gg/ubp7yF",
                        "https://dclcore.com/",
                        "https://steemit.com/@decentraland",
                        "https://discord.gg/AgPExR",
                        "https://t.me/DecentralandTG",
                        "https://t.me/decentraland_ru",
                        "https://www.facebook.com/decentraland",
                        "https://www.facebook.com/groups/mana.decentraland/",
                        "https://www.facebook.com/groups/Decentraland/",
                        "http://market.decentraland.org/",
                        "http://BW.com",
                        "http://Gate.io",
                        "http://zb.com/",
                        "http://ZG.com",
                        "https://forum.makerdao.com/t/collateral-status-index/2231/13",
                        "https://forum.makerdao.com/t/mip12c2-sp3-domain-work-requirements-for-the-onboarding-of-mana/3139"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Community and engagement",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.668791893590281
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#2",
                    "likes": "2",
                    "time": "02/05/2020-22:26:57",
                    "content": "Thank you for submitting this application. I am no whale, but even as MKR krill, I am concerned that projects are neglecting to give us the entire picture of relevant information during the on-boarding process. For instance, why did Decentraland merely put “N/A” when asked about the legal or regulatory positioning of MANA. An answer like that raises my eyebrows and leads me to believe one of two things: (1) Decentraland will not reveal their internal regulatory positioning on MANA or (2) Decentraland has not analyzed its token from a legal and regulatory perspective. (1) and (2) are troublesome for different reasons, but in the interest of time, let’s review some other MANA-specific matters that MKR holders should understand. Agus, can you please answer the following questions:   Decentraland did an “ICO” in August 2017 that highly likely sold MANA to persons based in the United States. Has the Securities and Exchange Commission contacted the project regarding that sale (which came after the SEC released the DAO report in July 2017)? If so, are those conversations ongoing? Did they conclude?   If the SEC did not contact Decentraland in connection with your ICO, please state so.   Please indicate whether Decentraland (including the Foundation and its predecessor entities) has interacted with any regulatory agency (including but not limited to the CNV, UIF, CVM)? If Decentraland has had contact with any regulatory agency, please state (a) the regulatory agency; (b) when those interactions occurred; and © the conclusion of those discussions.   Who controls the MANA smart contract? Are its administrative keys held by developers employed (employees) by or contracting with (independent contractors) the Decentraland Foundation?   How much MANA does the Decentraland Foundation hold?   If the Decentraland Foundation does hold MANA, does it continue to sell MANA to finance its operations?   Does the Decentraland Foundation have a defined time horizon?   This is the tip of the iceberg of things in my head, though I do not doubt that others in the forum have similar thoughts. I hope these questions start to bring out data points that MKR holders need to know in order to have a fruitful discussion about MANA (as well as other, more exotic collateral types). It’s our community and our DAO, and we have to protect it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1309523809523805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#3",
                    "likes": "1",
                    "time": "05/05/2020-17:43:50",
                    "content": "@Agustin The silence here is deafening. You and your team should be able to provide answers to the above, but if that is too much for Decentraland, perhaps MANA is an inappropriate asset for consideration. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/05/2020-18:23:22",
                    "content": "In fairness to decentraland, many of the above concerns apply to Maker as well (e.g. no kyc to prevent US persons from bidding in recent debt auctions) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/05/2020-18:53:27",
                    "content": "This is a collateral on-boarding application for Decentraland, so we should focus on MANA. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#6",
                    "likes": "0",
                    "time": "06/05/2020-05:25:48",
                    "content": "A few follow up questions for Agus – answers to the following are essential to further analyze the risk associated with potentially including MANA as a collateral type. What services does the Decentraland Foundation currently provide to the MANA Network? Has the Decentraland Foundation always supported the development, operation, and maintenance of the MANA Network? How does the Decentral Foundation fund its operations? How much MANA is owned by the Foundation’s directors, employees, or any of its affiliates? Does the Decentraland Foundation participate in any activities to increase or decrease the quantity of MANA? How many non-Decentraland Foundation affiliated people actively work on the MANA Network? If there are non-Decentraland Foundation affiliated companies contributing services, what will the Decentraland Foundation do if those services are discontinued? How would the Decentraland Foundation respond to a proposed hard fork of Ethereum? What happens with Eth 2.0? To what extent does the value of MANA tokens depend on the continued existence and functionality of the Decentraland Foundation? On what frequency does the Decentraland Foundation communicate with exchanges regarding the secondary market activity of MANA? What is the substance of those communications? To the extent the Foundation communicated with the Crypto Ratings Council about the MANA rating (3.75 on the CRC’s Howey rating system), what was the substance of those communications? On the CRC’s website, it states that Decentraland (a “private company based in Beijing”) is involved in “ongoing development\" of the Decentraland network. What is the role of this China-based company(“Decentraland China”) now? Does the Panamanian Foundation own it? If not, who does? Please clarify the connection, if any, between Decentraland China and the Decentraland Foundation. The CRC’s website mentions that the Decentraland team raised $24mm (in ETH) during its August 2017 ICO. Were all those funds spent to build the MANA Network? If funds remain, is Decentraland China, the Decentraland Foundation or both using those monies to continue building the MANA Network? Does Decentraland China or the Decentraland Foundation (or any Decentraland affiliate) participate in the burning of MANA? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.098214285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaulDirac",
                    "index": "#7",
                    "likes": "2",
                    "time": "06/05/2020-15:37:19",
                    "content": "Hi there! My name is Paul and I am a huge fan of Decentraland and a small MKR holder. I am very interested in this project moving forward, specially because these two projects are part of a small set of projects I follow closely: both started before Ethereum, both have mechanics around burning, so I see a lot of potential in each of them. I think I have some answers for these questions.  I am concerned that projects are neglecting to give us the entire picture of relevant information during the on-boarding process.  Could you be so kind as to elaborate why is this relevant based on MIPs 6~12? MANA is not controlled by anyone: MANA can’t be issued, paused, or is under the control of any entity. It’s owned by a Crowdsale Contract which is owned by a self-destructed contract. There is no other special rule or function that allows for any contract state modifications other normal ERC20 functions.  For instance, why did Decentraland merely put “N/A” when asked about the legal or regulatory positioning of MANA.  Those questions have an “optional” label on the form next to them. As for the large balances: The Decentraland Foundation has a vesting smart contract for 222 million mana (about 10% of the total supply). This concession started in February and will release tokens linearly in the next 10 years. Its address is 0xa3a90cacfd83ea4b114d5d7a24b54b42f670af94. Source: https://decentraland.org/blog/announcements/decentraland-next-steps-for-2020/ The DAO (https://mainnet.aragon.org/#dcl.eth) has a similar vesting contract, with the same terms. The contract can be found here: 0x7a3abf8897f31b56f09c6f69d074a393a905c1ac Best, Paul – PS: Let’s keep it civilized and under good netiquette, shall we? I understand that “deafening silence” are strong words coming from a recently created account that took 72 hours to reply the original post. Pinging after 24 hours is a little harsh.  The silence here is deafening. You and your team should be able to provide answers to the above, but if that is too much for Decentraland, perhaps MANA is an inappropriate asset for consideration.  Let’s all assume you are taking back these allegations and questions about the team’s goodwill and the merit of the application. As you said, let’s focus on MANA. ",
                    "links": [
                        "https://etherscan.io/address/0xdf861993edbe95bafbfa7760838f8ebbd5afda9f",
                        "https://etherscan.io/address/0xa3a90cacfd83ea4b114d5d7a24b54b42f670af94",
                        "https://decentraland.org/blog/announcements/decentraland-next-steps-for-2020/",
                        "https://mainnet.aragon.org/#dcl.eth",
                        "https://etherscan.io/address/0x7a3abf8897f31b56f09c6f69d074a393a905c1ac"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.871693121693122
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "1",
                    "time": "06/05/2020-15:58:53",
                    "content": "    Tosh9.0:  I am concerned that projects are neglecting to give us the entire picture of relevant information during the on-boarding process.   These threads are more meant to be an introduction rather than an exhaustive list of information. Though of course you are welcome to politely enquire further. If domain teams decide to work on the asset, the assumption is that they will dig up a lot of this information as part of that process. If you do feel like there hasn’t been enough information disclosed, you will have multiple chances to vote against the collateral type being added to the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#9",
                    "likes": "0",
                    "time": "09/05/2020-21:14:49",
                    "content": "Hi Paul!  Could you be so kind as to elaborate why is this relevant based on MIPs 6~12?  Happy to elaborate. Many other projects that conducted ICOs in manners similar to or the same as Decentraland have negotiated and settled with the SEC to take their tokens out of regulatory crosshairs (Sia and EOS are two prime examples). Projects that have not done that operate within a cloud of uncertainty, and I believe it is fair for Decentraland, if they want us to consider MANA, to understand any regulatory pressures they may be facing. I’m not passing judgment either way, but it strikes me as something the community should know (answers to my regulatory outreach and status questions) before we decide to onboard a new collateral type. If we don’t perform the due diligence and allow a collateral type in that could complicate things for the DAO, that will be on our hands.  MANA is not controlled by anyone: MANA can’t be issued, paused, or is under the control of any entity. It’s owned by a Crowdsale Contract which is owned by a self-destructed contract. There is no other special rule or function that allows for any contract state modifications other normal ERC20 functions.  Does any entity or individual have the administrative keys to that contract or the “self-destructed” contract?  Those questions [legal and regulatory] have an “optional” label on the form next to them.  Yes, I saw that, but in my position as an MKR holder, I would like to know if they have this information. Please note that the assets we let onboard may cause problems later on. For instance, if MCD has assets that are securities and those securities are auctioned off without the involvement of a broker-dealer, that could be an issue.  As for the large balances: The Decentraland Foundation has a vesting smart contract for 222 million mana (about 10% of the total supply). This concession started in February and will release tokens linearly in the next 10 years. Its address is 0xa3a90cacfd83ea4b114d5d7a24b54b42f670af94. Source: https://decentraland.org/blog/announcements/decentraland-next-steps-for-2020/  Thank you for this color.  PS: Let’s keep it civilized and under good netiquette, shall we? I understand that “deafening silence” are strong words coming from a recently created account that took 72 hours to reply the original post. Pinging after 24 hours is a little harsh.  I’m afraid I have to disagree with how you classified my earlier responses. The critical point here, regardless of the subjectively perceived tone, is the information I requested. I do not believe that it is too much to ask a project to provide timely responses to the community given what they are asking us to do. To be fair, Decentraland is not the only project that has put forth incomplete materials. I get that we are all going through this unique process for the first time, so we should give people the benefit of the doubt. But we must still ask tough questions. ",
                    "links": [
                        "https://etherscan.io/address/0xdf861993edbe95bafbfa7760838f8ebbd5afda9f",
                        "https://etherscan.io/address/0xa3a90cacfd83ea4b114d5d7a24b54b42f670af94",
                        "https://decentraland.org/blog/announcements/decentraland-next-steps-for-2020/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.843478337380777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#10",
                    "likes": "3",
                    "time": "14/05/2020-08:51:38",
                    "content": "Oracle Team Collateral Onboarding Evaluation V1.0.5 Author: Niklas Kunkel (Oracle Team) Contributors: Date: 05/14/20 Explanation of the Oracle Team Collateral Onboarding Methodology Economic Impact How much Dai can be expected to be generated against MANA? Concrete Data: Token Contract Address: 0x0F5D2fB29fb7d3CFeE444a200298f468908cC942 Circulating Token Supply: 1,370,162,956 MANA Token Market Cap of Circulating Token Supply ( TMC ): $48,903,545 USD Total Number of Holders: 38,276 Token Distribution: Top 20 holders hold 57.5% of Circulating Token Supply Avg Collateralization Ratio of Maker Protocol ( avgCR ): 361.38% Assumptions:   Assume a reasonable minimum collateralization ratio ( minCR ) based off empirical values in collateral portfolio. Since MANA is likely to be at least as risky as ETH/BAT, let’s assume  minCR = 150%.   Market Cap Utilization ( MCU ), the amount of the TMC that can reasonably expect to be deposited in the Maker Protocol, is bounded by empirical values in collateral portfolio. Currently the lowest and highest MCU in the Maker Protocol are [0.73%, 3.73%]   Formulas: Estimated Lower Economic Impact = TMC * MIN(MCU) / avgCR  Estimated Lower Economic Impact  = $48,903,545 * .0073 / 3.6138 = 98,786.84 DAI  Estimated Upper Economic Impact = TMC * MAX(MCU) / minCR Estimated Upper Economic Impact  = $48,903,545 * .0373 / 1.5 = 1,216,068.15 DAI  Due to the average of the estimated lower and upper economic impact, the Oracle Team is assigning MANA a Low Economic Impact label Given the distribution of token holders relative to the total number of token holders, how many users with significant sums of the proposed collateral are we reasonably targeting with this integration? ~350 people (90th percentile) Technical Complexity Determine how complex integrating Oracles for this collateral type would be and how long it would take to implement such a solution. Is a solution currently not possible because of a key missing component? There is no immediate indication that MANA would be hard to support from an Oracle perspective. Are there enough high quality data sources available to construct a reliable, resilient, and secure Oracle for the proposed collateral asset? Yes,  there are a reasonable number of quality exchanges we can query price data from if we want to go in that direction. Can the current tooling support the types of data sources that are needed? Yes, the sources are simple to integrate. Can the current tooling support the types of data modeling that are needed? Yes, the median model is already supported in the Oracle stack. Does adding these features interfere with ongoing or planned development of new tooling on the Oracle Team roadmap? No this should be fairly simple to add and won’t interfere with longterm projects in a meaningful way. What dependencies (both technical and system), risks, costs, and latency are added to the Oracle Protocol as a function of these added features? No added dependencies, risks, costs, nor latency associated with adding support for MANA to the Oracle stack. Does adding these features require work from other stakeholders such as the Smart Contracts Team(s)? No. How long would it take to design, implement, test, and deploy such a solution? About 1 week to develop and test. Given the simple nature of the MANA integration the Oracle Team considers this a low technical complexity project. Evaluation The combination of Economic Impact mapped against the Technical Complexity of onboarding a new collateral type can paint a picture of whether an Oracle Team ought to accept, decline, or defer a collateral onboarding application.      Low Technical Complexity High Technical Complexity     Low Economic Impact maybe decline   High Economic Impact accept maybe    Low Economic Impact x Low Technical Complexity => maybe Reccomendation The combination of low economic impact and low technical complexity to implement an Oracle is pointing the Oracle Team to tentatively accept the MANA onboarding application should the governance community decide to greenlight. If other collateral onboarding applications start to emerge with similar technical complexity but significantly higher potential to generate Dai the Oracle Team may defer the work on MANA to a later point in time. ",
                    "links": [
                        "https://etherscan.io/token/0x0f5d2fb29fb7d3cfee444a200298f468908cc942"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.350924477129296
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#11",
                    "likes": "1",
                    "time": "14/05/2020-19:56:31",
                    "content": "    NikKunkel:  Since ZRX is likely to be at least as risky as ETH/BAT   Ummm… do you mean MANA? Otherwise - I really like this template and am sending you hugs kudos Nik! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.546875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#12",
                    "likes": "0",
                    "time": "14/05/2020-22:38:35",
                    "content": "yes, yes I do  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#13",
                    "likes": "0",
                    "time": "17/05/2020-15:32:30",
                    "content": "@Agustin It’s been over two weeks since Decentraland’s initial post and the community is still waiting for responses from your team. If we don’t receive some color from you (especially about Decentraland’s legal and regulatory strategy and interactions with the SEC), considering MANA for on-boarding is premature. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#14",
                    "likes": "1",
                    "time": "17/05/2020-17:41:55",
                    "content": "Who is asking for this information besides you? I wouldn’t blanket the “community” in this. Do you have an affiliation with the Foundation that you require legal clarity to move forward with onboarding? The Oracle/Risk Domain teams are responsible for determining whether these collaterals are going to be greenlit or not. This is not to say legal clarification is not appreciated or helps to make informed decisions, rather your request seems rather demanding when I’m not sure it’s warranted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#15",
                    "likes": "0",
                    "time": "17/05/2020-17:52:12",
                    "content": "MANA is listed on CoinbasePro (who presumable concluded it was not a security before listing) and its primarily used at this point to purchase decentraland NFTs (commodity-like usage). I’m personally not too concerned with potential legal issues. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#16",
                    "likes": "0",
                    "time": "27/05/2020-04:26:09",
                    "content": "Whether my requests are warranted is not up to you or me. I am simply trying to ask pointed questions of projects where they either don’t answer or hand wave away complex issues. And I think these inquiries are bearing fruit – look at how KNC and ZRX highlighted their views on legal status and regulation. Those projects are being forthright with us, as we should expect. All I am saying is that we should expect teams to at least acknowledge and try to address our questions if they come to the forum and request that we onboard their collateral, especially given the risks involved for the DAO and the positive impact (in price action or market visibility) we can have on those assets by on-boarding them to MCD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.948051948051948
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#17",
                    "likes": "0",
                    "time": "27/05/2020-04:27:21",
                    "content": "Good things to point out re their listing on Coinbase Pro. Another interesting point would be to know if Decentraland is preparing any more product roll outs or if they are going to wind down and turn development over to their community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.930555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#18",
                    "likes": "1",
                    "time": "12/06/2020-15:14:47",
                    "content": "Nice tracking tool for the amount of MANA being burned: https://manaboard.now.sh/ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                }
            ]
        }
    ],
    "group_index": "2324"
}