{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/reflections-on-marketing-and-governance-from-the-marcomms-core-unit-vote/9523",
            "title": "Reflections on Marketing and Governance from the Marcomms Core Unit Vote ",
            "index": 9523,
            "category": [
                "Governance"
            ],
            "tags": [
                "core-unit",
                "cpm-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/GuyB",
                    "index": "#1",
                    "likes": "11",
                    "time": "26/07/2021-16:46:58",
                    "content": "The Strategic Marcomms CU ratification vote was a controversial one, and the proposal ultimately was not passed. Writing a post like this at a time like this may easily be dismissed as resentment. I’d characterize my response as phlegmatic rather than bitter, and will try to remain as constructive as possible. I planned to write much the same even if the vote passed. I’m away for a few days from tomorrow and wanted to post before I leave, so please excuse any rough edges. There are two areas I want to cover: Suggestions around Marketing, and feedback on Issues of Governance (which is very different from suggesting the vote was invalid). I’ll keep it as brief as possible. Marketing Some consensus is slowly emerging around what the DAO wants in terms of marketing, but there’s a long way to go. One of the areas under discussion is whether CUs should manage their own marketing, or have the option of drawing on a dedicated CU. Some of the following points have already been made by others, but wherever on the spectrum MakerDAO ends up, some coordination across core units will always be necessary:   Branding needs to be the same across the DAO, or we will look amateurish. This might be handled by the Dai Foundation or another CU, if not a Marcomms CU. Workshops with the community would be useful to clarify the brand collectively.  Coordinated content marketing is vital, or else CUs will end up competing for the same keywords and undermining each others’ SEO efforts. To overlook this ignores the importance of content marketing and search traffic, i.e. Google. There has to be a way for CUs to access economies of scale, and not just because many CUs won’t want to do their own marketing. PR is about relationships as well as practicalities. Successful marketing professionals may have spent years developing trusted relationships with journalists and other contacts in the space. Those are non-transferable and expecting every CU to start that process from scratch is a non-starter.  I have not seen any credible suggestions around 2 and 3. Budget has additionally been a point of contention. It would help to decide the total budget allocated to marketing and for CUs/proposals then to work within that. Governance In an ideal world, votes would only be placed in the system once it had been established that a successful outcome was highly likely. In this instance, after their first proposal was rejected, SMCU worked extensively with the community to gather feedback and establish consensus around the latest proposal. The vote was effectively decided by two large MKR holders, one of which (~20k MKR) came as a surprise. The other (~8k MKR) was more predictable but highlighted some issues of process. Delegation is designed in part to allow CUs to work transparently with Delegates to build effective consensus before votes go live (see “Improved Efficiency and Direction”). One of the most grating episodes of this vote has been the campaign launched against the CU by a future Delegate after the vote went live, based on the specious argument that members of the team couldn’t be bothered to market a major development while working at the Foundation. (It is a spectacular cognitive dissonance that the Maker Foundation – a well-funded organization, with visionary leadership, the pick of the world’s top DeFi talent at its disposal, highly experienced legal counsel, and responsible for bootstrapping the Maker Protocol in which the proposed delegate himself is a significant stakeholder – should have unaccountably dropped the ball in this regard.) DMs and posts to explain the background to that decision were simply ignored. Since I don’t want to turn this into another needless negative campaign thread I will end by noting that making governance more transparent and efficient is a very achievable goal, if there is the will for it; by asking larger MKR holders to engage with proposals earlier rather than later, or else to delegate their MKR to someone who will; by encouraging anyone on the fence about becoming a Recognized Delegate to do so; and respectfully requesting that those who ask for the confidence of the community as Recognized Delegates aim for a higher standard. ",
                    "links": [
                        "https://winstonchurchill.org/resources/quotes/the-worst-form-of-government/",
                        "https://forum.makerdao.com/t/delegation-and-makerdao/9429",
                        "https://forum.makerdao.com/t/delegate-i-will-vote-no-on-the-ratification-poll-for-strategic-marcomms-core-unit/9335",
                        "https://forum.makerdao.com/t/recognised-delegate-code-of-conduct/9384"
                    ],
                    "GPT-summary": "The author reflects on the Strategic Marcomms CU ratification vote, which was not passed. The author provides suggestions around marketing and feedback on issues of governance. The author suggests that there needs to be coordination across core units for branding, content marketing, and PR. The author also suggests that votes should only be placed in the system once it has been established that a successful outcome is highly likely. The author encourages larger MKR holders to engage with proposals earlier rather than later and to delegate their MKR to someone who will.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.881182561219874
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "25/10/2021-22:47:20",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}