{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/can-the-surplus-buffer-be-used-to-reduce-dais-stablecoin-dependence/7015",
            "title": "Can the surplus buffer be used to reduce DAI's stablecoin dependence? ",
            "index": 7015,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#1",
                    "likes": "2",
                    "time": "13/03/2021-08:11:10",
                    "content": "In this thread, we discussed how maintaining a tight peg requires significant stablecoin reserves that folks arbitrage in and out of. From what I see there, nobody really likes having that much USDC in the PSM but it is seen as a necessity for the medium term. The other thread here has a discussion on the surplus buffer with many raising the concern that it does nothing i.e. we have millions of DAI sitting idle. I wonder if it’s worth thinking of the surplus buffer as an alternative/complement to the PSM. That is, whenever we have an oversupply of DAI, we increase the surplus buffer and this acts as a DAI sink. Typically, this happens during a bull market when we also need the surplus buffer to increase anyway. When we have an undersupply of DAI, we burn MKR using the DAI from the supply buffer and it acts as a DAI source for the market. A rough estimate on the first linked thread said we require around 20% of outstanding DAI available in the PSM to ensure the peg stays where we want it. Perhaps it is worth asking the following questions  How much deviation from $1 is acceptable for DAI price over, say, a one week period? For example, are we okay with a consistent 1% deviation? Given an answer to 1., how much minting/burning capacity do we need? Presumably, the 20% answer came about in the other thread with some deviation in mind. Are changes to the surplus buffer large enough to achieve 2. while also serving the role of reducing risk to MKR holders?  ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-adjust-the-surplus-buffer-march-april-2021/6979/11"
                    ],
                    "GPT-summary": "The author proposes using the surplus buffer as an alternative or complement to the PSM to reduce DAI's stablecoin dependence. The post raises questions about the acceptable deviation from $1 for DAI price over a one week period and the necessary minting/burning capacity. The post also asks if changes to the surplus buffer can achieve the goal of reducing risk to MKR holders.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.879535147392291
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/03/2021-16:53:54",
                    "content": "    AstronautThis:  How much deviation from $1 is acceptable for DAI price over, say, a one week period? For example, are we okay with a consistent 1% deviation?   In order to be widely used it should be lower than retail transaction costs. Suppose you can have a deposit at a bank where you can get the same money back when you need it and one where you can get from 99% to 101% of your deposit. Which one would you choose?     AstronautThis:  When we have an undersupply of DAI, we burn MKR using the DAI from the supply buffer and it acts as a DAI source for the market.   With 0.5% (SB/DAI outstanding), this is not a big difference. Not sure we want to have 20% of capital, that wouldn’t be super effective.     AstronautThis:  That is, whenever we have an oversupply of DAI, we increase the surplus buffer and this acts as a DAI sink.   Not sure how you do that. We can arb the DAI price on the downside as long as we have USDC inside the PSM-USDC-A. Then we need to raise SF in order to make borrower close their positions. You can remove the USDC component either by having DAI-USDC Uniswap LP or stuff like term loans, fyDAI (but it’s not clear if that can help to fine-tune the DAI price). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.601190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/03/2021-11:15:48",
                    "content": " In order to be widely used it should be lower than retail transaction costs. Suppose you can have a deposit at a bank where you can get the same money back when you need it and one where you can get from 99% to 101% of your deposit. Which one would you choose?  I see what you’re saying but what I mean is that asking for DAI to be exactly $1 is probably not the right requirement to impose on DAI. It is a soft peg but the question is how soft? If we define this “service standard” (it can be 0.1%, 0.01% or whatever the community feels is appropriate), then we can also know roughly what resources we need to ensure DAI stays in that peg. Asking for an exact price with no variance allowed means we need infinite ability to absorb shocks in demand and supply. The 20% capital was just a number thrown out earlier - the correct number depends on the peg’s allowed deviation and might be a lot less.  Not sure how you do that. We can arb the DAI price on the downside as long as we have USDC inside the PSM-USDC-A. Then we need to raise SF in order to make borrower close their positions.  What I meant here is just a supply control lever. If DAI is more expensive than $1, we want to increase the supply of DAI. If the surplus buffer is contracting, then we are releasing DAI from it and it goes into the open market (since we need to purchase MKR to burn). On the other hand, if DAI is below $1, we want to lock up DAI and this happens since the surplus buffer expands. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.100407268170426
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "1",
                    "time": "14/03/2021-14:46:41",
                    "content": "    AstronautThis:  I wonder if it’s worth thinking of the surplus buffer as an alternative/complement to the PSM.   I actually thought about using the Surplus Buffer as a way to reimburse Vault users for Gas Fees. Similar to what Balancer did in February, the Balancer community approved 30,000 BAL tokens to be used to fund an ETH gas reimbursement intiative. It was only whitelisted for the usual token swaps, ETH, WBTC, DAI, USDC, and BAL. I wonder if we use the SB for whitelisted Vaults if that would add to DAI issuance… This is why I am a big proponent of raising the Surplus Buffer to $80M, IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "13/06/2021-20:47:22",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}