{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/a-case-for-lower-interest-rates/572",
            "title": "A case for lower interest rates ",
            "index": 572,
            "category": [
                "Governance"
            ],
            "tags": [
                "alignment",
                "rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#1",
                    "likes": "0",
                    "time": "03/10/2019-22:33:51",
                    "content": "Our revenue is the product of the weighted average stability fee and the supply of DAI. In general if we can put DAI supply on an upward trajectory it would improve the outlook of MKR. DAI supply peaked before the stability fee was raised from 3.5% to 7.5% around March 21st of this year. The rate has come down from its peak at 20.5% and is now 10.5%, but we are still well out of growth territory. Today, the most-effective return on DAI comes from repaying new CDPs. So, it is no wonder that the supply of DAI is not growing. Current returns on DAI:  Repay CDP: 10.5% dYdX: 8.66% Compound: 8.25% Nexo: 8%  It seems that if we were to lower the stability fee to 7% that we could see a return to upward growth, as DAI is strongly demanded by DeFi, without sacrificing too much revenue. ",
                    "links": [],
                    "GPT-summary": "The author of the post is making a case for lowering the stability fee of DAI to increase its supply and improve the outlook of MKR. The post explains the current returns on DAI and suggests that lowering the stability fee to 7% could lead to an increase in DAI supply without sacrificing too much revenue. The post also invites feedback and questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.321338383838384
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#2",
                    "likes": "1",
                    "time": "04/10/2019-10:26:25",
                    "content": " stability fee is already getting lowered you never mentioned dai/usd peg you only mentioned supply APR, what about borrow APR? if there is enough demand, supply will follow  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/10/2019-21:02:54",
                    "content": "    jernejml:  you only mentioned supply APR, what about borrow APR?   dYdX supply APR is the number to beat; if it costs less to make DAI than you can get, you would make DAI to meet demand.     jernejml:  if there is enough demand, supply will follow   That’s the idea. But high interest rates increase the required demand for supply to follow. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.991666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/10/2019-23:42:45",
                    "content": "    wjmelements:  That’s the idea. But high interest rates increase the required demand for supply to follow.   Dont higher interest rates require increased demand for CDPs (debt) for supply growth? Increased dai holding demand beyond supply available means a movement of the peg above 1$. In that case the stability fee is lowered to spur dai creation to match the over demand. Your post completely ignores the peg braking in the recent past. How can that not be mention in a post relating to lowering stability fee? Sorry to sound harsh but its a real question. In the past cheap debt inflated supply beyond what demand could match and mkr holders had to increase the stability fee to reduce the attractiveness of cdps, thus lowering supply to meet demand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.273076923076923
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#5",
                    "likes": "0",
                    "time": "04/10/2019-23:45:33",
                    "content": "I agree though increasing revenue is important. Increasing demand to force a lower stability fee seems alot safer than artificially lowering the stability fee to entice debt creation (and more revenue). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#6",
                    "likes": "0",
                    "time": "05/10/2019-01:05:27",
                    "content": "Why are you comparing Maker’s stability fee to lending platforms’ supply rate? One is something borrowers pay and the latter is what lenders receive. These are two completely different user groups with completely different incentive behaviours. Am I missing something here? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#7",
                    "likes": "0",
                    "time": "05/10/2019-01:18:37",
                    "content": "    Aaron_Bartsch:  Why are you comparing Maker’s stability fee to lending platforms’ supply rate?   Because, if the rate at which you can lend out DAI is greater than the cost of creating DAI, the supply of DAI will increase until the arbitrage opportunity disappears. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/10/2019-17:17:16",
                    "content": "There would be more dai on the market, but rates on dxdy would go down. You would weaken the peg and probably decrease mkr burn yield.  I see it differently. The better the peg, the more usable dai becomes, which leads to more demand. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.537037037037036
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#9",
                    "likes": "0",
                    "time": "05/10/2019-20:11:06",
                    "content": "    jernejml:  You would weaken the peg   I haven’t seen any evidence that higher interest rates mean a stronger peg. On the contrary, DAI was least-stable after the increase described in the OP.     jernejml:  rates on dxdy would go down   Yep. Rates would also go down for our competitors, which have gained in market share under our tight monetary regime. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.44781746031746
                }
            ]
        }
    ]
}