{
    "poll_list": [
        {
            "title": "Ratification Poll for MIP40 Budget Process Amendment (MIP4c2-SP19) - May 9, 2022",
            "index": "14250",
            "option": "Yes",
            "supporting_mkr": "86,683",
            "highest_fraction": 0.92
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
            "title": "MIP4c2-SP19: MIP40 Budget Process Amendment ",
            "index": 14250,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "budget",
                "core-unit-budget",
                "sf-001",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#1",
                    "likes": "12",
                    "time": "27/03/2022-17:57:58",
                    "content": " Introduction and Request Hello. Please find below a draft proposal for a MIP40 amendment under the rules of MIP4. The post consists of:  The MIP4c2-SP19 components for RFC (below) The MIP40 amendment proposal Relevant subcomponents MIP40c3 [EXAMPLE] An illustrative example of a fictional core unit budget request using the new template  Please let us know your comments on the below proposal. We will collect feedback and incorporate ahead of a formal submission at the beginning of the next governance cycle on 04-May-2022. There will be a call on 30-Mar-2022 to discuss this subproposal, and we encourage you to attend and share your views and comments: Issue Discussion Call #5 | Budget Modification Process Thanks in advance for your time.   MIP4c2-SP19: MIP40 Budget Process Amendment  Preamble MIP4c2-SP#: 19 MIP to be amended: MIP40 Title: Budget Framework Replacement Author(s): @Aes, @adcv, @SebVentures Contributors: @LongForWisdom, @madshills, @MakerMan Tags: MIP40, budget Status: Accepted Date Applied: 2022-03-27 Date Ratified: 2022-05-23 Dependencies: MIP0, MIP16 Replaces: MIP40 Forum URL: https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250 Ratification Poll URL: https://vote.makerdao.com/polling/QmXVjbWG   Specification  Motivation As the DAO has grown, it has been increasingly challenging to track budgets, review proposals, approve spend, and hold Core Units accountable for achieving their mandate and managing their expenses. For the DAO to grow long-term, it is critical that MKR holders be able to evaluate and compare Budget Proposals with minimum cognitive overhead. Within this revised MIP, Core Units and proposed Core Units are required to submit standardized, transparent, and clear financial information. Budget Proposals must clearly serve a revenue-driving or supporting business purpose in line with the Objectives of the DAO. Operating expenses should aim to:  Drive sustainable revenue growth, and/or Support ongoing and new business effectively  with at least a greater impact than the size of the increase in expenses requested. The aim is to clarify upfront as much information as possible to reduce, paradoxically, the amount of work required in putting the Budget Proposal together. It should also aid comparability and help MKR holders digest the information in a suitable way.  Amended MIPs and Components This MIP4 revises MIP40 as well as related subcomponents MIP40c1, MIP40c2, MIP40c3 and MIP40c4  Amendment Pull Request https://github.com/makerdao/mips/pull/534  Relevant Information  Updated requirements Following this revision, a MIP40 Budget Proposal must:  Include a Budget Term, with Start Dates and End Dates Describe how the Budget Proposal clearly supports the strategic or organizational Objectives of the DAO and should demonstrate, over the length of the Budget Term, either  The potential for revenue growth The potential for a tangible improvement in operational efficiency   Provide a timeline for specific deliverables over the course of the Budget Term List expenses by type, per the Chart of Accounts and Core Unit Operating Expense Budget Template  Also, describe how much of the budget is to be utilized towards ‘ongoing’ fixed services and how much is applied to one-time type services/events (planned/unplanned/contingency)   Disclose full-time equivalent headcount by month Explain how this Core Unit could guarantee minimally viable business continuity if the approved Budget Proposal was operating during a:  Bear/Superbear context: 10%/20% lower Bull context: With corresponding objectives oriented around stretch targets   Define how the Core Unit will be wound down in the event of a Governance vote to defund it, with accompanying rationale (period, use of funds, return of funds)  Describe what costs will be paid during this period and what costs will not be paid for Describe how funds will be returned to the DAO Describe one-time expenses that would be needed to wind down the core unit. This also should be included in the one-time expenses to spin up.   Be submitted during a budget submission window  Quarterly (March, June, September, or November Governance Cycles)     Post-Budget Approval Once a budget has been approved, it is highly recommended that expense reports are published to the relevant governance section of the forums with a budget-20XX tag. Actual expenses should be reported on a monthly basis, following the reporting recommendations outlined by SF and SES. Core Unit Facilitators are encouraged to leverage internal and external tools to facilitate communication with MKR holders and to update reporting standards according to evolving DAO needs dynamically. Finally, Core Units are also encouraged to respond to ad-hoc requests on operating expenses and Core Unit performance that MKR holders or delegates may ask for at any given time. If an already approved Core Unit is requesting a >10% increase in budget, the new budget proposal must include:  Variance analysis by expense type comparing proposed vs. existing budget, including spend and headcount a. Variances of >10% require disclosure of driver(s) Detailed business case if spend increases by >x% or >y$ a. Explain why the DAO should make this investment b. What problem does making this investment solve? c. Why is now the right time to make the investment? d. Detailed incremental deliveries expected as a result of increased investment Business continuity budget in case the modification proposal is not approved   Return of Excess Funds Every three months starting September 30th, 2022, Core Units will be required to return all funds in excess of three months of budget, defined as the most recent three months budget proceeding the return fund date (e.g., for June 30th deadline, April, May, and June budgets will be used). Exempt are funds destined for any outstanding payments for specific projects that the budget was originally approved for. Calculation Example: Core Unit A’s budget is 100,000 Dai per month for 12 months. If the actual spend by the end of the budget period is 600,000, then the minimum that must be returned to the DAO is 300,000. Budget Remaining - (3 * Monthly Budget) = Minimum Amount to Return 600,000 - (3 x 100,000) = 300,000 Transfers should be made to the DssBlow contract, simply send a standard ERC20 Dai transaction: 0x0048fc4357db3c0f45adea433a07a20769ddb0cf ",
                    "links": [
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment-subproposal/14250/3",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment-subproposal/14250/4",
                        "https://forum.makerdao.com/t/issue-discussion-call-5-budget-modification-process/14226",
                        "https://github.com/makerdao/mips/pull/534",
                        "https://docs.google.com/spreadsheets/d/1qB1MIPCkZfdkuHSNk1udhscvTjg-mIBo/edit#gid=1506071077",
                        "https://docs.google.com/spreadsheets/d/1dyrRelt5X5kD8CyRd6inyKXZV9PwF4RExPLgK3PQIRE/edit?usp=sharing",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-16-de-mayo-del-2022/15241",
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
                        "https://forum.makerdao.com/t/weekly-mips-update-87/15220",
                        "https://forum.makerdao.com/t/governance-and-risk-189-thursday-may-05-17-00-utc/14965/2",
                        "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
                        "https://forum.makerdao.com/t/reporting-for-strategic-finance-core-unit-april-2022/15146",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-09-de-mayo-de-2022/15089",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://forum.makerdao.com/t/weekly-mips-update-86-may-9-2022/15058",
                        "https://forum.makerdao.com/t/weekly-mips-update-85/14914",
                        "https://forum.makerdao.com/t/governance-and-risk-187-thursday-april-21-17-00-utc/14708/2",
                        "https://forum.makerdao.com/t/weekly-mips-update-84/14786",
                        "https://forum.makerdao.com/t/weekly-mips-update-83/14673",
                        "https://forum.makerdao.com/t/mip40c3-sp95-modifying-sidestream-auction-services-core-unit-budget-sas-001/19737",
                        "https://forum.makerdao.com/t/weekly-mips-update-82/14570",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-3/14549",
                        "https://forum.makerdao.com/t/governance-and-risk-184-thursday-march-31-17-00-utc/14314/2",
                        "https://forum.makerdao.com/t/march-2022-reporting-for-strategic-finance-core-unit-march-2022/14512",
                        "https://forum.makerdao.com/t/weekly-mips-update-81/14443",
                        "https://forum.makerdao.com/t/weekly-mips-update-80/14274",
                        "https://forum.makerdao.com/t/governance-and-risk-185-thursday-april-07-17-00-utc/14464/2",
                        "https://forum.makerdao.com/t/mip40c3-sp87-modify-the-sustainable-ecosystem-scaling-core-unit-budget-ses-001/18339",
                        "https://forum.makerdao.com/t/mip40c3-sp85-modify-sidestream-auction-services-core-unit-budget-sas-001/18253",
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://forum.makerdao.com/t/very-informal-poll-mkr-cash-out/15786/3",
                        "https://forum.makerdao.com/t/relay-semanal-24-30-de-mayo-de-2022/15594",
                        "https://forum.makerdao.com/t/weekly-relay-may-24-30-2022/15488",
                        "https://forum.makerdao.com/t/amended-mip40-important-information-for-core-units/15450",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/65",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/20",
                        "https://forum.makerdao.com/t/weekly-mips-update-88/15329",
                        "https://forum.makerdao.com/t/relay-semanal-10-16-de-mayo-de-2022/15289",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/17",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/75"
                    ],
                    "GPT-summary": "The post presents a draft proposal for a MIP40 amendment under the rules of MIP4. The proposal aims to standardize, clarify, and make transparent the financial information of Core Units and proposed Core Units. The author requests feedback on the proposal and provides a timeline for specific deliverables over the course of the Budget Term. The post also includes relevant information, such as the updated requirements for a MIP40 Budget Proposal and the post-budget approval process.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Board composition",
                        "Change to proposal pipeline",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.709310762612649
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#2",
                    "likes": "3",
                    "time": "27/03/2022-17:58:13",
                    "content": " MIP40: Budget Process Framework MIP# 40 Title: Budget Framework (Replaced with MIP4c2-SP19) Author(s): @Aes, @adcv, @SebVentures Contributors: @LongForWisdom, @madshills, @MakerMan Tags: MIP40, budget Status: RFC Date Applied: 2022-03-xx Date Ratified:  Dependencies: MIP0, MIP16 Replaces: MIP40   Sentence Summary MIP40: Budget Framework contains a framework for managing budgets and modifying them in the DAO Primitives State MIP.  Paragraph Summary MIP40: Budget Framework contains a framework for managing budgets and modifying them in the DAO Primitives State MIP. The Framework includes features to provide transparency and clarity for Governance when making decisions around budgets and a design that enables a high degree of flexibility in implementing payment structures for the Core Units.  Component Summary MIP40c1: Budget Framework Gives an overview of the most critical characteristics of Budgets. MIP40c2: Composition of a Budget Describes the components of a Core Unit Budget proposal. MIP40c3: Adding/Modifying Core Unit Budget Process Describes the process for adding a budget to a new Core Unit or modifying the Core Unit’s existing budget. MIP40c4: Budget Implementation Details Provides clarity on how the budget payouts are addressed from a practical perspective once approved.  Motivation The Budget Framework MIP allows Governance to manage Budget Proposal requests for new and existing Core Units in a standardized way. The motivation is to promote transparency regarding the use of MKR-holder funds and increase fairness in the capital allocation decisions Governance must make. Facilitators should be able to manage their plans dynamically, for instance, depending on changing market conditions, in order to achieve the Objectives of the DAO. The Framework can help Governance guide a given Core Unit, as they could vote (or not) to attach multiple budgets to a Core Unit, each with a different, more specific objective.  Specification / Proposal Details  MIP40c1: Budget Framework Budgets are used to fund the work defined by the Core Units chosen by Maker Governance. A budget is attached to a Core Unit and is meant to be used only for that Core Unit. The Facilitators of each Core Unit administer core Unit budgets. Once a budget has been approved, Facilitators will be encouraged to file correctly tagged expense reports to the appropriate subsection of the governance forums. Actual expenses should be reported on a monthly basis, following reporting recommendations outlined by SF and SES. Facilitators are further encouraged to leverage internal and external tools to improve communication with MKR holders and to dynamically update reporting standards according to evolving DAO needs. If a Facilitator is offboarded from their Core Unit, quits, or goes missing, the budget will continue to be available to pay out according to its Budget Implementation to allow the Core Unit to continue with long-term operations as much as possible. See MIP41c6 for details on this process. Budget Proposal requests must be submitted during a Budget Submission Window. New Core Units can be submitted quarterly (March, June, September, or November Governance Cycles).  MIP40c2: Composition of a Budget Core Unit Budgets can have multiple entries. Having multiple budget entries, each with its implementation and breakdown, enables more advanced compensation and funding structures to be created if desired. Each entry must at least include each of the below elements:  Budget Term  Start Date is no later than 3mos after the formal submission date End Date is no later than 12mos after the Start Date   Increasing Value to Maker Tokenholders  Should demonstrate, over the length of the Budget Term either the potential for revenue growth and/or the potential for a tangible improvement in operational efficiency   Roadmap and Objectives  Provide a timeline for specific deliverables over the course of the Budget Term   Reporting Transparency  List expenses by type, per the Chart of Accounts and Core Unit Operating Expense Budget Template  Also describe how much of the budget is to be utilized towards ‘on-going’ fixed services, and how much is applied to one-time type services/events (planned/unplanned/contingency) Disclose full-time equivalent headcount, by month   Contingency Planning  Explain how this Core Unit could guarantee minimally viable business continuity if the approved Budget Proposal was operating during a Bear/Superbear context: 10%/20% lower  Facilitators should formulate operational budgets capable of operating at lower funding levels Facilitators are encouraged to transparently communicate with collaborators regarding potential impact on compensation during downturns   Explain how this Core Unit could operate if the approved Budget Proposal were operating during a Bull context: With corresponding roadmap oriented around stretch targets   Unwinding and Defunding  Define how the Core Unit will be wound down in the event of a Governance vote to defund it, with accompanying rationale (period, use of funds, return of funds)  Describe what costs will be paid during this period and what costs will not be paid for, including but not limited to:  Finishing current initiatives. Handing initiatives off to another unit Archiving initiatives   Describe how funds will be returned to the DAO Describe one-time expenses that would be needed to wind down the core unit.  This also should be included in the one-time expenses to spin up Detail how the Core Unit will treat non-DAI funds, including MKR, whether vested or not, during the offboarding     Submission Period  Budget Proposals should be submitted during a budget submission window  Quarterly (March, June, September, or November Governance Cycles)     Considerations for Budget Modifications  If an already approved Core Unit is requesting a >10%[TBD] increase in budget, the new budget proposal must include:  Variance analysis by expense type comparing proposed vs existing budget, including spend and headcount Variances of >10% require disclosure of driver(s)   Detailed business case to justify the increase in investment  Explain why the DAO should make this investment What problem does making this investment solve? Why is now the right time to make the investment? Detailed incremental deliveries expected as a result of increased investment     Considerations for Unwinding and Defunding  Reducing DAO overhead is critical, so managing an offboarding must execute with grace and clarity Please itemize which costs need inclusion for winding down or which will return to the DAO (eg., travel etc.) To conduct a smooth unwinding, it’s suggested to have a 2 of 3 multisig with the ex or interim facilitator executing the wind down   MIP40c3: Adding/Modifying Core Unit Budget Process Once a MIP40c3-SP subproposal passes, the Governance Facilitators or the MIP Editors will update the domain state MIP (MIP38) accordingly. This is a technical process component that can have on-chain effects that alter the Maker Protocol’s state. When subproposals generated from this component reach the executive vote stage of the MIPs cycle, the executive vote must include a technical state change to authorize the budget implementations specified in the subproposal to draw funds from the Maker Protocol.  Proposal Parameters   Minimum Feedback Period: 1 Month.  Minimum Frozen Period: 1 Week. Ratification Polls for MIP40c3 subproposals involving a Core Unit Budget Modification will have different requirements to MIP51c2. Instead of binary voting, they must use ranked-choice voting, with the options as follows:  A: Approve existing budget only (Business as usual) B: Approve increased budget C: Reject budget D: Abstain    In order for this Ratification Poll to conclude successfully and the contained proposal(s) move to Accepted status, each of the following conditions must be true:   A or B vote-weight must exceed C vote-weight when the poll closes. Winning vote-weight must exceed the Minimum Positive Participation value of 10,000 MKR when the poll closes.  MIP40c3 subproposals must use the template located at MIP40c3-Subproposal-Template.  MIP40c4: Budget Implementation Details Once a Budget Proposal is approved, the Core Unit’s Facilitators can begin drawing payments to fund their Core Unit according to their Budget Implementation. The Budget Implementation defines when and how the Core Unit Facilitators will receive the funds that make up their budget. This budget implementation standard to be used is available on this forum post. Variations from this standard must be explained. The Budget Implementation is binding. It should be understood to directly authorize the proposed funds to be drawn from the funding source (either the Maker Protocol or a treasury contract controlled by Maker Governance). Core Unit Budgets are paid out through Budget Implementations, which are smart contracts authorized by Maker Governance to draw funds from the Protocol. It can also be a manual (not smart contract-based) pre-approval by Governance. Maker Governance can explicitly turn a budget implementation off. Budget Implementations create a scheduled rate or transfer of funds taken from the Protocol and given directly to the Core Unit’s Facilitators. Advanced Budget Implementations can be used for more innovative cases, such as incentive payments or unpredictable expenses. They can be implemented in various ways, such as relying on multi-sig access or dependent on system variables such as Protocol auctions, Dai supply or Stability Fees.  Different Fund Types The Budget Implementation could draw funds from the Protocol in various ways, depending on the implementation’s objective. It could draw Dai from the Surplus Buffer and other sources, such as Governance owned smart contracts or reserves that are compatible with Budget Implementations. Printing MKR through this MIP is only allowed if the MKR is to be distributed with a programmed time-lock of at least 12 months. Budget Implementations that don’t verifiably distribute MKR with at least a 12-month time lock cannot be proposed through this MIP.  Return of Funds Every three months starting September 30th, 2022 Core Units will be required to return all funds in excess of three months of budget, defined as the most recent three months budget proceeding the return fund date (e.g. for September 30th deadline, July, August, and September budgets will be used). Exempt are funds destined for any outstanding payments for specific projects that the budget was originally approved for. Calculation Example: Core Unit A’s budget is 100,000 Dai per month for 12 months. If actual spend by the end of the budget period is 600,000, then the minimum that must be returned to the DAO is 300,000. Budget Remaining - (3 * Monthly Budget) = Minimum Amount to Return 600,000 - (3 x 100,000) = 300,000 Transfers should be made to the DssBlow contract, simply send a standard ERC20 Dai transaction: 0x0048fc4357db3c0f45adea433a07a20769ddb0cf ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1dyrRelt5X5kD8CyRd6inyKXZV9PwF4RExPLgK3PQIRE/edit?usp=sharing",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250/3",
                        "https://forum.makerdao.com/t/core-unit-budget-implementation-standardization/10758",
                        "https://forum.makerdao.com/t/discussion-rethinking-budgeting-for-cus/14410"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.493973166313592
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#3",
                    "likes": "3",
                    "time": "27/03/2022-17:59:00",
                    "content": " MIP40c3: Add/Modify Core Unit Budget (Subproposal Process) Template  Preamble MIP40c3-SP#: # Author(s): Contributors: Tags: template Status: Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd> Budget Start Date: <yyyy-mm-dd> Budget End Date: <yyyy-mm-dd>   Sentence Summary  Paragraph Summary  Specification  Motivation  Why are you proposing this Core Unit Budget/modification? Clear motivator that describes how the Budget Proposal supports the strategic or organizational Objectives of the DAO. Should demonstrate, over the length of the Budget Term, either the potential for revenue growth or the potential for a tangible improvement in operational efficiency.   Core Unit ID  Specify the Core Unit ID. This element specifies which Core Unit you are proposing to attach the Budget to.   List of Budget Implementations  This element must contain a list of at least one Budget Implementation. Each Budget Implementation must follow this format:    Is it a smart contract Budget Implementation, or manual Budget Implementation?  If it is a smart contract Budget Implementation:  What is the Ethereum address that the smart contract is deployed to? What kind of authorization does it need (suck authorization, authorization to draw funds from other smart contracts, etc.)     What is the amount of Dai or other assets per month that the Budget Implementation will pay out (if any)?  If it is a manual Budget Implementation, at which week of the month will the executive vote to pay out the budget for the month be submitted?   What are other circumstances that the Budget Implementation will pay out Dai or other assets, and how are the amounts determined? Any additional notes and clarification about how the Budget Implementation works.    List of Budget Breakdowns  This element must contain a detailed Budget Breakdown for each of the Budget Implementations in the element above. Budget Breakdowns aren’t binding, but should provide as much clarity as possible to governance about how the monthly amount or other circumstances for payouts where determined, and what the current plan for their use is.   Reporting Transparency List of expenses by type, per the Chart of Accounts and Core Unit Operating Expense Budget Template     Expense Category Total Budget Term Monthly Equivalent Monthly Expense Annualized (x12)     Compensation & Benefits      Bonus      Travel & Entertainment      Headcount Expense Subtotal            Admin Expense      Freight & Duties      Gas Expense      Governance Programs      Hardware Expense      Marketing      Professional Services      Software Development Expense      Software Expense      Supplies      Training Expense      Non-Headcount Expenses Subtotal            10% Contingency      Grand Total        Budget Term  This element must contain a Start Date and an End Date for the entry. The Start Date is no later than 3 months after the formal submission date. The End Date is no later than 12 months after the Start Date.   Increasing Value to Maker Tokenholders  This element should demonstrate, over the length of the Budget Term, either the potential for revenue growth and/or the potential for a tangible improvement in operational efficiency   Roadmap and Objectives  This element must contain a roadmap with specific deliverables and timeline to be produced as a result of the Budget Proposal   Headcount Planning / Team Summary  This element must contain a table with a headcount plan by month, at the very least detailing the total expected number of FTEs in the budget at any given point of the Budget Term   Contingency Planning  Explain how this Core Unit could guarantee minimally viable business continuity if the approved Budget Proposal was operating during a Bear/Superbear context: 10%/20% lower  Facilitators should formulate operational budgets capable of operating at lower funding levels Facilitators are encouraged to transparently communicate with collaborators regarding potential impact on compensation during downturns   Explain how this Core Unit could operate if the approved Budget Proposal was operating during a Bull context: With corresponding roadmap oriented around stretch targets   Unwinding and Defunding  Define how the Core Unit will be wound down in the event of a Governance vote to defund it, with accompanying rationale (period, use of funds, return of funds)  Describe what costs will be paid during this period and what costs will not be paid for, including but not limited to:  Finishing current initiatives. Handing initiatives off to another unit Archiving initiatives   Describe how funds will be returned to the DAO Describe one-time expenses that would be needed to wind down the core unit.  This also should be included in the one-time expenses to spin up Detail how the Core Unit will treat non-DAI funds, including MKR, whether vested or not, during the offboarding     Considerations for Budget Modifications  If an already approved Core Unit is requesting a >10% increase in budget, the new budget proposal must include:  Variance analysis by expense type comparing proposed vs existing budget, including spend and headcount Variances of >10% require disclosure of driver(s)   Detailed business case to justify the increase in investment  Explain why the DAO should make this investment What problem does making this investment solve? Why is now the right time to make the investment? Detailed incremental deliveries expected as a result of increased investment     Considerations for Unwinding and Defunding  Reducing DAO overhead is critical, so managing an offboarding must execute with grace and clarity Please itemize which costs need inclusion for winding down or which will return to the DAO (eg., travel etc.) To conduct a smooth unwinding, it’s suggested to have a 2 of 3 multisig with the ex or interim facilitator executing the wind down   Proposal Parameters   Minimum Feedback Period: 1 Month.  Minimum Frozen Period: 1 Week. Ratification Polls for MIP40c3 subproposals involving a Core Unit Budget Modification will have different requirements to MIP51c2. Instead of binary voting, they must use ranked-choice voting, with the options as follows:  A: Approve existing budget only (Business as usual) B: Approve increased budget C: Reject budget D: Abstain    In order for this Ratification Poll to conclude successfully and the contained proposal(s) move to Accepted status, each of the following conditions must be true:   A or B vote-weight must exceed C vote-weight when the poll closes. Winning vote-weight must exceed the Minimum Positive Participation value of 10,000 MKR when the poll closes.  ",
                    "links": [
                        "https://xyz"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 5.3595441427259605
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#4",
                    "likes": "2",
                    "time": "27/03/2022-17:59:30",
                    "content": " [EXAMPLE] MIP40c3-SP69: Adding Proprietary High Frequency Trading Core Unit Budget (HFT-001)  Preamble MIP40c3-SP69: Adding Proprietary High Frequency Trading Core Unit Budget (HFT-001) Author(s): @KenGriffin Contributors: @RoaringKitty @vbuterin Tags: hft Status: RFC Date Applied: <yyyy-mm-dd> Date Ratified: <yyyy-mm-dd> Budget Start Date: 2022-04-01 Budget End Date: 2022-12-31   Sentence Summary This Budget Proposal for DAI expenses aims to fund the activities of the HFT-001 Core Unit as described in MIP39-SP42 Adding Proprietary High Frequency Trading Core Unit.  Paragraph Summary This Budget Proposal for DAI expenses aims to fund the activities of the HFT-001 Core Unit as described in MIP39-SP42 Adding Proprietary High Frequency Trading Core Unit. This budget is necessary to provide a runway for the first nine months of HFT-001 activities. Following which, HFT-001 will finance continuing operations entirely through Core Unit profits and wind down the excess budget.  Specification  Motivation HFT-001 seeks to aggressively invest MakerDAO deposits and flashloans through MEV trading and off-chain HFT operations. The runway is necessary to finance the first few months of trading and compensation for Core Unit traders. During the Budget Term, the Core Unit will scale up trading algorithms until it can generate enough profits to sustain itself indefinitely through aggressive management of Vault deposits and through active DAI flashloan deployment. This will substantially increase earnings per MKR token on a balanced risk-adjusted basis.  Core Unit ID HFT-001  List of Budget Implementations The HFT-001 budget is designed with the following in mind:  Paying for the operational costs to run the core unit for the first nine months Having a buffer for unexpected legal, technical, or financial problems  Therefore, a vote to ratify this MIP means MKR holders make a commitment to: A continuous funding model similar to those proposed by RISK-001, SES-001, and DUX-001. If any modifications are needed, they would be done on a six-month basis through “Modify Core Unit Budget Subproposal Process” (MIP40c3 subproposals.) If modifications are not proposed, the monthly payment amount gets rolled over from the initial proposal, if our work meets community and MKR holders expectations and demands.  List of Budget Breakdowns  Reporting Transparency List of expenses by type, per the Chart of Accounts and Core Unit Operating Expense Budget Template     Expense Category Total Budget Term Monthly Equivalent Monthly Expense Annualized (x12)     Compensation & Benefits 270,000 30,000 360,000   Bonus - - -   Travel & Entertainment - - -   Headcount Expense Subtotal 270,000 30,000 360,000         Admin Expense 450,000 50,000 600,000   Freight & Duties 135,000 15,000 180,000   Gas Expense 90,000 10,000 120,000   Governance Programs - - -   Hardware Expense 5,625,000 625,000 7,500,000   Marketing - - -   Professional Services 9,000 1,000 12,000   Software Development Expense 4,500,000 500,000 6,000,000   Software Expense 90,000 10,000 120,000   Supplies 18,000 2,000 24,000   Training Expense - - -   Non-Headcount Expenses Subtotal 10,917,000 1,213,000 14,556,000         10% Contingency 1,118,700 124,300 1,491,600   Grand Total 12,305,700 1,367,300 16,407,600     Budget Term The HFT-001 Budget will begin on April 1st, 2022 and run for up to nine months through to December 31st, 2022.  Increasing Value to Maker Tokenholders Investing 12.3m DAI in setup costs for the HFT-001 Core Unit is a judicious use of Maker capital. We expect our delta-neutral high-frequency market making strategies and MEV extraction to recover the budget within 6 months after the end of the Budget Term. After this, we will return all excess profits after trader compensation and operating expenses to the DAO and to token holders. HFT-001 is a one-sided bet on at least a 50% increase in earnings per MKR in 6 months with capped downside of 12.3m DAI over the course of 9mos.  Roadmap and Objectives 01-Apr-2022: Budget deployment 31-May-2022: Infrastructure deployed and underwater cables rolled out between London and Calais 30-Jun-2022: First strategy backtesting completed 31-Oct-2022: First go-live under real market conditions 31-Nov-2022: Full team of traders hired 31-Dec-2022: Return excess funds to DAO and winding down HFT-001 Budget  Headcount Planning / Team Summary     Month FTEs Forecasted Total HC Expense     Apr-2022 1 10,000   May-2022 1 10,000   Jun-2022 2.5 25,000   Jul-2022 2.5 25,000   Aug-2022 2.5 25,000   Sep-2022 2.5 25,000   Oct-2022 3 30,000   Nov-2022 3 30,000   Dec-2022 3 30,000     Contingency Planning     Expense Category Base Case Monthly Bear Monthly (10%) Superbear Monthly (20%)     Compensation & Benefits 30,000 20,000 15,000   Bonus - - -   Travel & Entertainment - - -   Headcount Expense Subtotal 30,000 20,000 15,000         Admin Expense 50,000 45,000 40,000   Freight & Duties 15,000 13,500 12,000   Gas Expense 10,000 9,000 8,000   Governance Programs - - -   Hardware Expense 625,000 500,000 200,000   Marketing - - -   Professional Services 1,000 - -   Software Development Expense 500,000 500,000 500,000   Software Expense 10,000 10,000 10,000   Supplies 2,000 2,000 2,000   Training Expense - - -   Non-Headcount Expenses Subtotal 1,213,000 1,079,500 772,000         10% Contingency 124,300 109,950 -   Grand Total 1,367,300 1,209,450 787,000     Bear Case: Our bear scenario if market conditions turn and DAO profits are compromised. Our budget could function with 11% less runway. In this eventuality, we will scale back our FTE timetable and reduce admin and freight expenses accordingly. However, we will not be able to scale back any of the software development expenses as they are necessary to start our operation. Superbear Case: Our superbear scenario. The bare minimum for executing our plans is with a budget 42% smaller than the base case. The FTE plans would be significantly scaled back and we would run our algorithms on a network-cluster of Pixel Chromebooks instead of high performance ASICs and on-site servers. This would push back our ROI timetable well past 6 months from the end of the Budget Term but the original timetable could still hold. We are sufficiently aggressive in our base case that we do not feel there are any untapped opportunities worth stretching the budget over   Unwinding and Defunding  Most of the budget will go to upfront investments in hardware equipment and tooling. In the event of an unwinding, the DAO would be able to judge whether to liquidate the stock of equipment or to keep it to repurpose for other Core Units In either case, there will be a 100,000-200,000 DAI expense just to unwind all the hardware that has been set up and to move it to a new location for a new purpose Any remaining budget in the operational wallet would be returned through DSSBlow.   Proposal Parameters   Minimum Feedback Period: 1 Month.  Minimum Frozen Period: 1 Week. Ratification Polls for MIP40c3 subproposals involving a Core Unit Budget Modification will have different requirements to MIP51c2. Instead of binary voting, they must use ranked-choice voting, with the options as follows:  A: Approve existing budget only (Business as usual) B: Approve increased budget C: Reject budget D: Abstain    In order for this Ratification Poll to conclude successfully and the contained proposal(s) move to Accepted status, each of the following conditions must be true:   A or B vote-weight must exceed C vote-weight when the poll closes. Winning vote-weight must exceed the Minimum Positive Participation value of 10,000 MKR when the poll closes.  ",
                    "links": [
                        "https://xyz"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.353324915824916
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#5",
                    "likes": "2",
                    "time": "29/03/2022-10:13:47",
                    "content": "    adcv:  Return of Excess Funds Every three months starting June 30th, 2022 Core Units will be required to return all funds in excess of three months of budget, defined as the most recent three months budget proceeding the return fund date (e.g. for June 30th deadline, April, May, and June budgets will be used).   Would you be able to elaborate a bit more on this point? What action will be taken if a CU/facilitator fails to do this? Presumably, there will be some flexibility so that a CU can withhold funds if they anticipate a large one-off expense later in the year? For example, PE expecting a large cost for a specific audit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.845238095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "1",
                    "time": "29/03/2022-10:18:03",
                    "content": "I am a bit confused why this HFT-001 proposal doesn’t have its own forum post and is being posted in the MIP4c3-SP69 forum post? I think adding a High Frequnecy Trading Core Unit deserves its own forum thread. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#7",
                    "likes": "2",
                    "time": "29/03/2022-10:21:53",
                    "content": "I think this is an illustrative example as referenced in the initial post rather than a formal proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "3",
                    "time": "29/03/2022-10:25:00",
                    "content": "Well then label this as an example - literally looked to me like a real proposal.  Thank you for the clarification - you had me going there! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#9",
                    "likes": "0",
                    "time": "29/03/2022-10:57:55",
                    "content": "Yes apologies will edit to relabel - was supposed to be an illustration of how the new template would look like for an example new CU budget. It happens to be in the uncanny valley of things that look like they could be real. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.787878787878787
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#10",
                    "likes": "3",
                    "time": "29/03/2022-13:49:06",
                    "content": "if vitalik wants to go for a high frequency trading CU he can put his proposal at any place - i don’t mind ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Dairyman",
                    "index": "#11",
                    "likes": "2",
                    "time": "29/03/2022-13:50:11",
                    "content": "And Roaring Kitty!!!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#12",
                    "likes": "1",
                    "time": "29/03/2022-14:12:21",
                    "content": "I have to agree I was like vbuterin - we really need to talk about this… lol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "4",
                    "time": "29/03/2022-19:23:09",
                    "content": "While I am personally a proponent of some of the MIP40 amendments, such as the Roadmap/objectives, contingency planning, unwinding/defunding, headcount, and a few others–I always like to take the other side of the trade and play Devil’s Advocate. So, first question–how much consideration did the @strat-fin-core-unit team take into making sure Core Unit Facilitators will not be overwhelmed with proposing and forecasting their budgets that might make the facilitators feel like they’ll need to hire extra-help in order to comply?  Some modifications are asking for a variance analysis, forecasting of operations in opaque market conditions, and some might interpret the proposed modifications of this MIP as “over-managing” which is known to stifle innovative thinking. Second Q, once again taking the reverse-side of the trade, how do you think these amendments will combat against CU that decide to low-ball their budgets in order to avoid meeting an overvalued promise to Maker Tokenholders? Do you think their will be motivation to feed falsified information into the budgeting process in order to low-ball their goals? And last but not least, how does the proposed budget amendments ensure “harmonious” interactions among core units, leading to efficient processes, high-quality growth, and satisfied customer retention? Do you believe implementing a pay-for-performance model could be more efficient? Thanks in advanced. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#14",
                    "likes": "5",
                    "time": "29/03/2022-20:27:30",
                    "content": "Thanks for the thoughtful questions Frank.     flipflopflapdelegate:  So, first question–how much consideration did the @strat-fin-core-unit team take into making sure Core Unit Facilitators will not be overwhelmed with proposing and forecasting their budgets that might make the facilitators feel like they’ll need to hire extra-help in order to comply?   We did take the administrative burden of a more comprehensive budgeting MIP into account. I strongly believe MKR holders deserve more transparency in the budgeting process and accountability regarding CU spend, and that outweighs what we consider quite reasonable asks. As you may have noticed from the proposal, much of what is required have already been common questions amongst existing and former MIP40s, and are often repeated. Asking these questions pre-emptively provides all stakeholders an opportunity to more holistically evaluate a MIP40 proposal from the moment it’s posted. The SF team will host a learning event in the event this MIP is passed and is happy to help any prospective facilitators fulfill the requirements if they have uncertainties or questions. I view facilitating a Core Unit as owning a business. If a prospective facilitator is unable to answer these questions with our help, I would question if they are ready to run their Core Unit and if there mandate as better fulfilled by an existing team or through the grants program.     flipflopflapdelegate:  Second Q, once again taking the reverse-side of the trade, how do you think these amendments will combat against CU that decide to low-ball their budgets in order to avoid meeting an overvalued promise to Maker Tokenholders? Do you think their will be motivation to feed falsified information into the budgeting process in order to low-ball their goals?   In our view, the budgeting decision comes down to, does this CU add more value than the proposed cost? Cost doesn’t necessarily matter if the value the prospective CU creates exceeds it - this is a common analysis performed by nearly every top Corporate Finance team, called NPV analysis. If a CU low-balls their budget and doesn’t fulfill their mandate or are not meeting delegate expectations, I would expect them to be offboarded. Not sure what you mean by falsifying information, but this is why performance reviews will be critical to ensure CUs are meeting delegate and MKR holder expectations.     flipflopflapdelegate:  And last but not least, how does the proposed budget amendments ensure “harmonious” interactions among core units, leading to efficient processes, high-quality growth, and satisfied customer retention?   It is not the intention of the proposed amendments to ensure these things, I’m not sure if any budgeting MIP can truly ensure harmonious collaboration among CUs. I believe building efficient processes, delivering high-quality growth, and increasing customer retention/satisfaction are what we’re all striving for - but we need to be able to quantify these metrics. This is why SF has kicked off the QSR meetings in collaboration with Growth, RWF, Risk, and PE. We’re just scratching the surface though and have tremendous work to do.     flipflopflapdelegate:  Do you believe implementing a pay-for-performance model could be more efficient?   I believe a MIP to provide pay-for-performance is indeed desirable and would likely lead to more efficiency, but I believe such a model would be complementary to this MIP and not mutually exclusive. Additionally, I would expect this model to tuck-in nicely with the performance evaluation initiative. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.961360398860399
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#15",
                    "likes": "4",
                    "time": "08/04/2022-16:24:48",
                    "content": "Modifications: Changed submission window from New Core Units - Quarterly (April, July, October, or January Governance Cycles) Existing Core Units - Twice a year (during July & January Governance Cycles) to Quarterly (April, July, October, or January Governance Cycles) in order to accommodate feedback received from delegates and Core Units. Other small modifications include right aligning the table columns with numbers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.058847402597403
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "3",
                    "time": "13/04/2022-11:46:07",
                    "content": "    Aes:  the budgeting decision comes down to, does this CU add more value than the proposed cost? Cost doesn’t necessarily matter if the value the prospective CU creates exceeds it - this is a common analysis performed by nearly every top Corporate Finance team, called NPV analysis.   Thank you for your response Aes. With regards to MKR token owners and Delegates understanding and closely following the progress of each Core Unit—I reckon that Core Units will need to communicate more efficiently with the Community, and the Community will need to keep up (specially MKR token owners). I’ve stated in this forum that many in the community don’t have have a grasp on who, or what talent is currently working within each Core Unit(names, headcount, or skill set). More importantly, I’m willing to bet that most don’t even know what accomplishments & goals have been achieved by each Core Unit. Deciphering if each Core Unit adds value—but will continue to be a challenge and it will be misinterpreted by both MKR token owners and Delegates, but I am hopeful that the proposed amendments to MIP40 will help improve MKR token owners ability to decide on the valuable of each CU. Thanks again Aes! Y muchas gracias Adcv! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.165908029878619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#17",
                    "likes": "5",
                    "time": "13/04/2022-12:15:02",
                    "content": "This is great, @adcv and the @strat-fin-core-unit. I think it’s a step in the right direction (I even thought about forking it and using what we like  ).  TL;DR Definitely like seeing these types of initiatives. (I think @GovAlpha-Core-Unit  was working on improving this as well? Not sure if there’s a lot of overlap or not). We might be adding hurdles for existing and potential Core Units to join Maker. Yes, it will provide more transparency, but we might get fluff, and we might miss on great talent. It’s probably easier to start with support to the current Core Units so that transparency becomes a best practice instead of trying to force it through a MIP. Stealing Rune’s idea, we probably need to look into a budget committee to make sure that budgets are reviewed thoroughly and consistently.  Tying Objectives and Expenses I like this point. I’m still struggling with the implementation part.  Objectives of the DAO While there seem to be tacit or unwritten objectives, the closest thing we have right now is the initiative from @GovAlpha, which is not complete yet. How do you suggest that Core Units find the “Objectives of the DAO” (especially when these change)?  Operating Expenses and Return on Investment Trying to quantify the initiatives is an excellent exercise. I encourage every Core Unit or Contributor to do that. However, it’s essential to acknowledge that:  There will be hypothesis: assumptions about the result of an initiative. These are hard to calculate, hard to predict, and even more challenging when the function is not directly related to the the potential for revenue growth or the potential for a tangible improvement in operational efficiency. We will end up using a lot of proxies. If direct links are harder to establish, indirect links will be even more obscure. We can argue that having these indirect measures is better than not having them. I tend to agree, but I’m afraid of making it too hard for talent to propose something to Governance.   Support Core Units Where do the security Core Units fall regarding revenue growth or a tangible improvement in operational efficiency? How about audits? How about transparency Core Units trying to help the MKR holders and delegates? As an example, GovAlpha is “invisible” when things are working well (yeah, people are being civil and collaborating, who needs GovAlpha?) and the instant culprit when things are not going well (Governance is broken, and they’re not doing anything about it!). How do we quantify the operational efficiency they bring? How about GovComms, which is supporting GovAlpha?  Cross-Core Unit Initiatives If an initiative (such as the D3M) brings X revenues, and 7 Core Units contribute to it (from Growth to PECU, Risk, etc.), how do we split the merit? (Who needs a Marketing Core Unit, our products sell on their own, etc.).  Reduced Flexibility  Budget Window I believe this is potentially a terrible idea. Maker Governance cycle is already too slow (when things are ready to go; arguably too fast when things need more discussion). Closing this window even further will make us miss many good opportunities. This will mean that the Delegates might spend A LOT of time on specific dates reviewing budgets (like an accountant working 20 hours a day during tax season), instead of having it more spread across the year. I think that standards will help, but we might need a specific group to review this thoroughly.  Special Deals We currently have deals that do not fall within these standards. Deco comes to mind, but I might be missing others. Do we want to miss opportunities where a group of people offers Governance a package deal?  Other Considerations  Roadmap and Overlap with MIP39 There seems to be quite an overlap with MIP39 and trying to include a roadmap or objectives might help, but it might also add noise. In your example, you’re giving 16MM on a 6-line roadmap. I know it’s an example, but it would be nice to see a real example with your real expectations? Is the Strategic Finance one a good example?  Budget Crunch: Operations versus Opportunities For a Core Unit like SES, it would be easy to present a reduced budget where fewer opportunities are pursued. I imagine this exercise would be much more strenuous for a Core Unit like TechOps. By forcing Core Units to go through this (I do think it’s a great exercise, by the way), we might be encouraging Core Units to bloat their budgets to be able to shrink them later.  Support from Strategic Finance I like the Strategic Finance Core Unit spearheading these proposals. I believe that to get Core Units to adopt these best practices, it’s probably helpful to:  create learning material (how is a good budget done, what are some good reporting metrics, how can you measure ROI, etc.). provide templates and tools that help through the process (this will make it easier for everyone to follow) provide default values (e.g.: for unwinding / defunding) eventually, make it software (the templates and tools are so good that we can integrate them, or maybe even put them on-chain).  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.064348845598846
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#18",
                    "likes": "5",
                    "time": "13/04/2022-18:19:51",
                    "content": "Thank you @juan, really appreciate the time you’ve taken and your thoughts. They have been echoed in previous calls. We have tried to summarize the concerns along with our views. The ultimate objective is to improve transparency and the quality of the financial decisions we are asking delegates and token holders to make. TLDR:   Hurdles: The attached process does not change the hurdle for prospective Core Units to apply  Objectives: The budgets should serve the objectives of the DAO  Return on Investment: ROI is difficult but proposals do need to bear ROI principles in mind as they will be measured by them anyway  Support function budgets: Support function budgets should be able to tie the requested funds to a specific objective, including downside avoidance  Cross-core unit initiatives: Core Unit facilitators should primarily concern themselves with adding as much value as they can rather than performance attribution  Budget windows: Necessary to minimize Governance overhead and enables the DAO to better understand and allocate resources to all CU proposals in the window  Budget bloat: The enemy of budget bloat is transparency, decentralization and market performance  Strategic Finance: Strategic Finance is very keen to support   1. The attached process does not change the hurdle for prospective Core Units to apply The attached process does not change the hurdle for prospective Core Units to apply but significantly improves standardization and transparency for MKR Holders and Delegates to evaluate them. The barrier to entry is time spent thinking about a budget and writing a MIP proposal. This is not a material barrier to entry in any meaningful form, nor does it represent any new barriers to entry relative to the existing MIP40 process. We should not be surprised to see great talent expecting to hear and ready to answer these very basic questions about use of funds and impact on MKR. We encourage prospective Core Units and existing Core Units alike to reach out to the SF team for help.  2. The budgets should serve the objectives of the DAO The minimum requirement for a budget proposal should be to advance the objectives of the DAO. It is not within the scope of MIP40 to define them. The DAO has in fact signaled that RWA Collateral Growth, DAI market share, and ETH & WBTC Market Share are key focus areas.  3. ROI is difficult but proposals do need to bear ROI principles in mind as they will be measured by them anyway Quantifying to the extent possible is an absolutely necessary exercise. I agree that often, particularly with support functions such as our own, the link to tangible improvements in operating efficiency are difficult to quantify. However, budget proposals are in practice already evaluated through an ROI lens. Therefore formulating them through an ROI lens from the outset will facilitate the discussion and avoid good budgets getting rejected by delegates. Necessarily these will involve hypotheses. Nobody is under any illusions that you can perform anything with zero support functions. We expect that just thinking about budget initiatives and ranking them in terms of positive impact on the DAO will help ease the conversation most of the time. This is just a hypothesis, of course, and if it doesn’t pan out we’ll have to tweak the process document again. Our governance system necessarily needs to evolve dynamically with our needs.     juan:  when the function is not directly related to the the potential for revenue growth or the potential for a tangible improvement in operational efficiency.   If a budget or Core Unit proposal is not related at all to revenues or operations, they probably have no business proposing to draw funds from the surplus buffer.  4. Support function budgets should be able to tie the requested funds to a specific objective, including business continuity or downside avoidance A support unit should aim to support the main lines of business. Some of the investments might be in people others might be in systems. A Legal team, for instance, has in their mandate the ability to influence the expense structure and performance of RWA vaults. This directly impacts the profitability and risk of RWA vaults. Therefore a Legal budget should be able to clarify the impact of specific line items on the protocol. For instance, GovAlpha or GovComms could talk about how a given FTE or a given person will spend most of their hours working on initiative X, whose aim is to help token holders receive timely information about governance proposals. Just to make this sentence possible, what needs to happen in the background is the facilitator to have a concrete plan for a new FTE, evaluate what initiatives are possible to execute and prioritize the ones with the highest impact to the protocol. The market values choices that maximize token holder value. Every Core Unit, support and revenue-facing alike, should feel the pressure not just to perform against the expectations of the token holder but also against the possibility that the market will either replace Maker or a competing alternative Core Unit will replace them. This won’t dissuade all the sandbagging but it should dissuade a lot of it.  5. Core Unit facilitators should primarily concern themselves with adding as much value as they can Although we operate in a decentralized way, we all answer to the same tokens. Core Units should be concerned in maximizing the value of these vs making sure performance attribution is done correctly. If there is a challenge, they should be able to explain the value of their contribution to an initiative. Other Core Units should be able to do the same on their behalf if asked. In any case, it is not the remit of MIP40 to conduct performance evaluation. It is to provide a basis for comparability.     juan:  (Who needs a Marketing Core Unit, our products sell on their own, etc.).   A non-quantitative response to this could orient around:  MakerDAO needs people to supply collateral to generate revenues. People who have collateral need a token they can use. The more people use Dai, the more attractive Dai becomes as a receipt for collateral. Therefore you need to pull people into using Dai. Having a Marketing Core Unit dedicated to this problem full time will increase the number of people using Dai. This generates value for the protocol. We feel the top 3 initiatives that will achieve this in the next 6mos are A, B and C. It would be nice to do D but it is probably a nice-to-have rather than a necessity. We would like 4 instead of 3 people on A but we will maximize capacity first then evaluate whether we need an increase. On B we cannot do with less than 4 people.  Every Core Unit budget proposal should be able to answer basic questions of this nature. Most already are. This MIP40 aims to standardize this framework and make comparability easier and reduce the cognitive overhead of producing budgets and processing them.  6. Necessary to minimize Governance overhead and enables the DAO to better understand and allocate resources to all CU proposals in the window I don’t think we will miss anything with a quarterly cycle for budget requests. It is not an unreasonable expectation. The budget window change comes specifically from delegates to help with cognitive overhead. There is no need for any additional overhead or cost to deal with this. It is fully in line with the expectations of a delegate to dedicate enough time to budget proposals. Batching them should actually reduce the time they spend processing them.  7. The enemy of budget bloat is transparency, decentralization and market performance If your denominator is sandbagged, no matter how much value you add in the numerator, you will be challenged. If you consistently return a lot of money at the end of each budget cycle you will be challenged to make more with less. If you misappropriate funds and buy crates of flat-screen TVs to keep the budget rolling at a high level, you will be discovered and offboarded. If someone believes they can achieve the same outcomes more efficiently, with less money or faster, they should propose the alternatives or propose themselves as a replacement. It is actually much simpler to just propose a realistic and truthful budget from the outset.  8. Strategic Finance is very keen to support Your ideas for ongoing upskilling are very good and very well formulated, particular with regards to learning material and templates and tools. In a first step it might take more of the form of helping existing or prospective Core Units with specific requests and evolve to larger roles. In any case, we are more than happy to help and share. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None"
                    ],
                    "Sentiment": 5.956435643564356
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#19",
                    "likes": "2",
                    "time": "13/04/2022-23:34:28",
                    "content": "    adcv:  The barrier to entry is time spent thinking about a budget and writing a MIP proposal. This is not a material barrier to entry in any meaningful form, nor does it represent any new barriers to entry relative to the existing MIP40 process.   You’re absolutely right—it’s a DAO and at the end of the day, MKR token owners have the final say. That’s the beauty of the MIPs process—on any given day, new amendments can be presented to the DAO.     adcv:  Therefore formulating them through an ROI lens from the outset will facilitate the discussion and avoid good budgets getting rejected by delegates.   For sure—I do believe that some delegates and MKR token owners will formulate their own agenda regardless of the possible outcome (ROI)—but again, that’s the beauty of a DAO.     adcv:  For instance, GovAlpha or GovComms could talk about how a given FTE or a given person will spend most of their hours working on initiative X, whose aim is to help token holders receive timely information about governance proposals. Just to make this sentence possible, what needs to happen in the background is the facilitator to have a concrete plan for a new FTE, evaluate what initiatives are possible to execute and prioritize the ones with the highest impact to the protocol.   So, as an example (as an example I’ll use Payton Rose of GovAlpha ) — a GovAlpha budget proposal should imply what Payton a FTE will spend 12 hours a week working with PE preparing spells, 8 hours a week monitoring, improving, and expanding Discord, 15 hours monitoring, improving, and expanding the Forum, as another 12 hours reviewing proposals. Would that description work?     adcv:  The budget window change comes specifically from delegates to help with cognitive overhead. There is no need for any additional overhead or cost to deal with this. It is fully in line with the expectations of a delegate to dedicate enough time to budget proposals.   Valid points here—anything that can help both Delegates and MKR token owners analyze budgets request is highly needed.     adcv:  If you misappropriate funds and buy crates of flat-screen TVs to keep the budget rolling at a high level, you will be discovered and offboarded.    good one!     adcv:  Your ideas for ongoing upskilling are very good and very well formulated, particular with regards to learning material and templates and tools.   Totally agree. I also believe it would be fantastic is somehow/someday we get what Juan suggested here:     juan:   create learning material (how is a good budget done, what are some good reporting metrics, how can you measure ROI, etc.). provide templates and tools that help through the process (this will make it easier for everyone to follow) provide default values (e.g.: for unwinding / defunding) eventually, make it software (the templates and tools are so good that we can integrate them, or maybe even put them on-chain).    Software that can easily automate this process would be fuego! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.564211076280042
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#20",
                    "likes": "2",
                    "time": "14/04/2022-00:28:09",
                    "content": "Just want to say I very much appreciate the work being done here and seeing core units pursue transparency.  With so many new CUs, it has been hard to keep up with who’s doing what.  I think this will bring a lot of clarity to the community.  We will be able to see if there is any duplication of responsibility or opportunities for joint work between CUs. Reading through it all, I thought to myself this might seem onerous to some.  I hope it can be seen as beneficial to CUs as well.  You would be able to see where your time is being spent and ask yourself if it’s spent in the right areas.  You get to prioritize your time and if you need help, the community will see more clearly that you have more responsibilities than you should have and either offload to others, reduce your mandate, or give you help.  I believe, even without being put into formal proposals for others to see, thinking through these questions up front and reviewing them periodically is a valuable process. One other idea I had regarding the return of excess funds was that if a CU is consistently outperforming expectations, meeting their mandate, and bringing great value to the protocol, they should be rewarded.  I think being able to return excess funds could be a part of this evaluation.  Of course, there is need for wisdom in discerning whether the CU was outperforming or simply had a budget that was too large. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.23047138047138
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#21",
                    "likes": "3",
                    "time": "18/04/2022-16:44:35",
                    "content": " Modification:   Be submitted during a budget submission window - Quarterly (April, July, October, or January Governance Cycles)   to:  Be submitted during a budget submission window  Quarterly (March, June, September, or November Governance Cycles)     Modifications and explanation Clarification that the goverance cycle is for June rather than May as implied by introductory post. Removed stray reference to the removed semi-annual window. Taking into account further valuable feedback regarding budget cycles and to show how quarterly cycles can provide useful cadence to organize planning work with little disruption. This should allow broadly, once a quarter for:  Month 1: Design of the budget Month 2: RFC in forums Month 3: Governance Cycle and Vote Beginning Month 4: Effective  If approved, this means the first formal budget submisssion window under the new MIP40 process would be in September. That probably means that the June cycle would be technically the last one under which the old submission template would be valid, assuming this is approved. We strongly encourage Core Units to bear this in mind as the submission window approaches. Please correct me if understanding is wrong, @Patrick_J This modification also allows for a training and upskilling campaign in July and August during which the SF team will be available to help Core Units prepare new budget proposals. We will roll out templates, training materials and iterate them based on experiences during the summer. Thank you @juan for suggesting this valuable build which will help existing Core Units and new prospective ones adapt to the new template and build on experience from other submissions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.552584670231729
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#22",
                    "likes": "2",
                    "time": "18/04/2022-16:56:37",
                    "content": "    flipflopflapdelegate:  So, as an example (as an example I’ll use Payton Rose of GovAlpha ) — a GovAlpha budget proposal should imply what Payton a FTE will spend 12 hours a week working with PE preparing spells, 8 hours a week monitoring, improving, and expanding Discord, 15 hours monitoring, improving, and expanding the Forum, as another 12 hours reviewing proposals. Would that description work?   Back of the envelope for sure. Every business need will be slightly different and will need to be formulated with slightly different objectives in mind. We’ll always find time to exchange ideas with existing or prospective Core Units on how to analyze and frame these questions to help delegates and token holders take decisions.     flipflopflapdelegate:  Software that can easily automate this process would be fuego!   For sure. If we start small and low overhead until we reach capacity we will quickly understand where the benefit will be in investing to acquire or build software to help us automate tasks.     Traster_Tray:  Of course, there is need for wisdom in discerning whether the CU was outperforming or simply had a budget that was too large.   Indeed. The principle of looking at investments from an ROI proposal is that if someone sandbags their request with a padded budget it should look like a low yielding investment for the risk. We should expect our forecasting error to start higher and trend lower as Core Units gain experience with planning investment needs. Deviations from this trend should be able to have straightforward explanations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.113839285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#23",
                    "likes": "1",
                    "time": "20/04/2022-15:39:07",
                    "content": "Updated the MIP4 structure to fit governance requirements (thank you @blimpa). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#24",
                    "likes": "1",
                    "time": "20/04/2022-16:59:32",
                    "content": "Updated the headings to clarify unwinding processes and removing typos. Also updated two links to budgeting templates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#25",
                    "likes": "1",
                    "time": "20/04/2022-22:37:54",
                    "content": "Reminder that this proposal will enter its Frozen Period in seven days, on Thursday, April 28 at 00:00 UTC. Substantive modifications beyond that date will render the proposal ineligible for the upcoming Governance Cycle / reset its Frozen Period, as the case may be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#26",
                    "likes": "0",
                    "time": "22/04/2022-20:31:47",
                    "content": "Reminder that this proposal will enter its Frozen period on Thursday, April 28 at 00:00 UTC. @Core-Facilitators please consider leaving your feedback, if you have not yet done so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#27",
                    "likes": "0",
                    "time": "26/04/2022-14:58:42",
                    "content": "A couple of questions from my end.     adcv:  Reporting Transparency  List expenses by type, per the Chart of Accounts and Core Unit Operating Expense Budget Template     What if there are expenses that do not properly fit into any of the categories listed?  Is the CU free to add categories to fit those expenses?  In the case of the Events CU there are some new spends which do not really fit into any of those categories.     adcv:  MIP40: Budget Process Framework Contingency Planning  Explain how this Core Unit could operate if the approved Budget Proposal was operating during a Bear/Superbear context: 10%/20% lower  Facilitators should formulate operational budgets capable of operating at lower funding levels Facilitators are encouraged to transparently communicate with collaborators regarding potential impact on compensation during downturns   Explain how this Core Unit could operate if the approved Budget Proposal were operating during a Bull context: With corresponding roadmap oriented around stretch targets    What is the process for triggering the reduced budget?  How would this happen and how long would a CU have to implement a reduced budget?     adcv:   Ratification Polls for MIP40c3 subproposals involving a Core Unit Budget Modification must use a ranked-choice voting system with three options  Approve existing budget only (Business as usual) Approve increased budget (Budget increase >10%) Reject budget      Interesting approach with ranked voting but does this not conflict with MIP51c2 which defines ratification polls as binary? Also what about the abstain option?     adcv:  Return of Funds Every three months starting September 30th, 2022 Core Units will be required to return all funds in excess of three months of budget, defined as the most recent three months budget proceeding the return fund date (e.g. for September 30th deadline, July, August, and September budgets will be used). Calculation Example: Core Unit A’s budget is 100,000 Dai per month for 12 months. If actual spend by the end of the budget period is 600,000, then the minimum that must be returned to the DAO is 300,000. Budget Remaining - (3 * Monthly Budget) = Minimum Amount to Return 600,000 - (3 x 100,000) = 300,000 Transfers should be made to the DssBlow contract, simply send a standard ERC20 Dai transaction: 0x0048fc4357db3c0f45adea433a07a20769ddb0cf   What flexibility will there be here?  In the case of Events CU our spending will not be very constant as spending revolves around when the events are.  The in-between time we spend very little but around events will be much larger.  I guess I don’t want to be in the situation where on the month we are being forced to pay excess funds back that is needed for planned future expenses. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1dyrRelt5X5kD8CyRd6inyKXZV9PwF4RExPLgK3PQIRE/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.194046442687748
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#28",
                    "likes": "4",
                    "time": "26/04/2022-16:09:33",
                    "content": "I’m struggling to understand what would happen if someone submits an SP40 without these requirements. Would the @MIP-Editors start to block proposals without ROI? Maybe we can add them as suggestions to the templates instead of MIPifying this? Here’s why:     adcv:  Hurdles: The attached process does not change the hurdle for prospective Core Units to apply   I could not disagree more. The current process is hard enough. Attracting talent is already quite hard, and our governance process is not at the point where someone just plug&plays their Core Unit.     adcv:  Budget windows: Necessary to minimize Governance overhead and enables the DAO to better understand and allocate resources to all CU proposals in the window   Our governance process is already quite slow when we need it to be fast. For example, had the budget from DIN failed yesterday, they would have needed 2 more months to get a budget in place. If you add “windows”, this time will only go up? How do we solve that? Or are we ready to miss on talent, just because we decided to not be agile? Concentrating these into windows might slow that process even further. Until we figure out how to solve these situations, we should not close the doors behind us on potential Core Units.     adcv:  Strategic Finance: Strategic Finance is very keen to support   This is great. I fully support it. I think that if we start  approaching Core Units that are forming approaching Core Units that are renewing their budgets creating content creating templates creating tools creating software  we would create a much more welcoming DAO where talent finds the budget to execute its vision. Background: I’ve been supporting teams drafting SP40s, not only for our incubation program but also for other Core Units, including Events, Dai Foundation, Strategic Happiness, Deco, and I’m probably forgetting some more. The struggle is real. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5761494252873565
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#29",
                    "likes": "0",
                    "time": "26/04/2022-21:39:41",
                    "content": " Modification: Modified the proposal parameters to clarify application of the MIP framework and ratification poll settings. Thank you @PonJerry for the remark and @prose11, @blimpa and team for your availability to help clarify.  Proposal Parameters   Minimum Feedback Period: 1 Month.  Minimum Frozen Period: 1 Week. Ratification Polls for MIP40c3 subproposals involving a Core Unit Budget Modification will have different requirements to MIP51c2. Instead of binary voting, they must use ranked-choice voting, with the options as follows:  A: Approve existing budget only (Business as usual) B: Approve increased budget C: Reject budget D: Abstain    In order for this Ratification Poll to conclude successfully and the contained proposal(s) move to Accepted status, each of the following conditions must be true:   A or B vote-weight must exceed C vote-weight when the poll closes. Winning vote-weight must exceed the Minimum Positive Participation value of 10,000 MKR when the poll closes.  Clarification that excess funds destined for an expense do not have to be returned, thank you @PonJerry for the build. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.985795454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#30",
                    "likes": "2",
                    "time": "26/04/2022-21:42:44",
                    "content": "    PonJerry:  What if there are expenses that do not properly fit into any of the categories listed? Is the CU free to add categories to fit those expenses? In the case of the Events CU there are some new spends which do not really fit into any of those categories.   You are welcome to exceed the requirements of the MIP with detail as needed for your specific CU requirements. Put yourself in the shoes of a token holder voting on the proposal to determine the level of extra detail they might welcome to understand the value the budget request brings.     PonJerry:  What is the process for triggering the reduced budget? How would this happen and how long would a CU have to implement a reduced budget?   There is no formally required process for implementing. The only requirement is to prepare business continuity planning. Our P&L and our operations and most of our costs except for oracles are denominated in Dai. Our revenues correlate extremely highly with ETH, however. We should be able to demonstrate that we can preempt concerns of entering a bear market with inflexible cost structures. Executing this contingency should be a prerogative of the Core Unit and a ngeotiation with delegates and token holders. However, the minimum requirement should be to have thought about the possibility first and explained in the request that this budget can guarantee some form of minimally viable service under constrained conditions.     PonJerry:  Interesting approach with ranked voting but does this not conflict with MIP51c2 which defines ratification polls as binary? Also what about the abstain option?   Edit will have clarified this point, thank you for pointing it out.     PonJerry:  What flexibility will there be here? In the case of Events CU our spending will not be very constant as spending revolves around when the events are. The in-between time we spend very little but around events will be much larger. I guess I don’t want to be in the situation where on the month we are being forced to pay excess funds back that is needed for planned future expenses.   Edit will clarify pragmatism of flagging expenses that were already budgeted but that may be lumpy as would be the case with Events. Thank you for this. Thank you for your careful reading of the proposal and the incredibly valuable builds. Good catch on MIP51! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.856965488215488
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#31",
                    "likes": "2",
                    "time": "26/04/2022-21:45:56",
                    "content": "    juan:  I’m struggling to understand what would happen if someone submits an SP40 without these requirements. Would the @MIP-Editors start to block proposals without ROI?   I think I see the source of the confusion driving this struggle. MIP40 doesn’t actually formally require a calculated numeric ROI for each line item. What it asks is that budgets demonstrate the potential to grow revenues or improve the operations of the DAO, however tangentially. It then asks for minimum disclosure and standardization requirements so delegates and token holders can understand how this budget will attempt to achieve its aim. The main principle is to require questions that come up over and over in MIPs that lack the detail, even if the authors may have thought about the issues beforehand. The aim is for structure to do the pointless work of token holders and delegates asking the same questions.     juan:  I could not disagree more. The current process is hard enough. Attracting talent is already quite hard, and our governance process is not at the point where someone just plug&plays their Core Unit.   We will agree to disagree on hurdles. We are describing very straightforward business planning principles. If we have a talent problem it won’t be because we are asking prospective core units to describe how their budgets will serve the DAO. It is not a materially higher incremental request relative to today in any case.     juan:  Our governance process is already quite slow when we need it to be fast. For example, had the budget from DIN failed yesterday, they would have needed 2 more months to get a budget in place. If you add “windows”, this time will only go up? How do we solve that? Or are we ready to miss on talent, just because we decided to not be agile? Concentrating these into windows might slow that process even further. Until we figure out how to solve these situations, we should not close the doors behind us on potential Core Units.   Regarding windows: batching proposals for budgets helps delegates and asks core units to plan in advance, both of which are desirable outcomes. The ranked voting system actually would prevent the sort of cliff edge funding dropoff DIN faced and avoid the need for a workaround like this month’s GovComm double MIP budget request. We have no budget windows today: we are not agile today. Introducing budget windows won’t make us not agile. We are not missing any talent by relaxing requirements for the minimum information delegates and token holders should have to evaluate budget proposals. We are not closing any doors by asking people to go through a process that aims to facilitate decision making. We face volatile realities of crypto volatility and aggressive competition taking share. We are in a burgeoning high-risk sector inches away from blowing up every second. Submitting budget request MIPs in a way that deloads cognitive overhead for both facilitators and delegates will hopefully reduce the struggle and free up valuable mindshare to focus on the real problems of the DAO: Growing share, expanding into new businesses and developing the decentralized financial rails of the future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.115313852813853
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#32",
                    "likes": "0",
                    "time": "26/04/2022-23:07:06",
                    "content": "Thanks for your clarification on my points.  The voting parameters look better defined but raise another question.     adcv:   Ratification Polls for MIP40c3 subproposals involving a Core Unit Budget Modification will have different requirements to MIP51c2. Instead of binary voting, they must use ranked-choice voting, with the options as follows:  A: Approve existing budget only (Business as usual) B: Approve increased budget C: Reject budget D: Abstain    In order for this Ratification Poll to conclude successfully and the contained proposal(s) move to Accepted status, each of the following conditions must be true:   A or B vote-weight must exceed C vote-weight when the poll closes. Winning vote-weight must exceed the Minimum Positive Participation value of 10,000 MKR when the poll closes.    I’m assuming that the voters would rank all these four options in 1st-4th preference.  My question is regarding the abstain vote.  If abstain is the voter’s first choice how does this fit into the ranking system? Abstain is generally the least voted for so, in theory, would be the first option to get tossed and re-ranked in the second round.  Moving to the abstain voter’s second choice.  This would result in a voter not being able to abstain, in theory…since their other vote options would still be used.  I guess what I am getting at is if a voter wants to abstain as first choice then it should be their only option and would not participate in subsequent rounds of voting.  What if abstain is the 2nd/3rd choice or will it not be an option? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.550454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#33",
                    "likes": "1",
                    "time": "27/04/2022-06:24:57",
                    "content": "From my understanding, any abstain votes are taken out of the picture. This is also the case in the binary voting when determining minimum participation threshold. Gov Alpha will know better for sure though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#34",
                    "likes": "2",
                    "time": "27/04/2022-09:28:55",
                    "content": "    PonJerry:  I’m assuming that the voters would rank all these four options in 1st-4th preference. My question is regarding the abstain vote. If abstain is the voter’s first choice how does this fit into the ranking system?   So if a voter truly intends to abstain, that should be their only ranked vote. Otherwise, voting will proceed in typical Instant Run-Off fashion, where the voter’s first choice is used until the option is eliminated in one of the run off rounds. If a voter selected Abstain and any other options, it’s likely the other options would be used in the final round, the only exception being if Abstain retains a majority of vote. In Instant Run-Off votes, voters should vote for all options they support. Abstain means they would accept any option, so there is no practical voting reason to rank Abstain with other votes, but could perhaps be used for social signaling. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.58578431372549
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#35",
                    "likes": "0",
                    "time": "27/04/2022-19:55:23",
                    "content": "Final tweaks Including reference to the budget implementation standard. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#36",
                    "likes": "0",
                    "time": "28/04/2022-07:44:09",
                    "content": "    adcv:  Submitting budget request MIPs in a way that deloads cognitive overhead for both facilitators and delegates will hopefully reduce the struggle and free up valuable mindshare to focus on the real problems of the DAO   Can you please restate the Strategic Finance last MIP40 so that we can see what a real life example looks like? I think a concrete example (side by side with the old one) would be greatly beneficial. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.321428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#37",
                    "likes": "1",
                    "time": "28/04/2022-13:31:58",
                    "content": "    juan:  Can you please restate the Strategic Finance last MIP40 so that we can see what a real life example looks like? I think a concrete example (side by side with the old one) would be greatly beneficial.   We made an example in this thread for this very purpose. But this is a good idea - we could restate the Dec/Jan SF Budget to show side-by-side what it would look like under the new template. Similarly, if other Core Units, to take SES as an example, would like more clarity on how this process would work we are happy to help out to do the same exercise with them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.442234848484848
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#38",
                    "likes": "1",
                    "time": "02/05/2022-08:51:03",
                    "content": "@blimpa could you kindly move this MIP to formal submission? Thank you ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#39",
                    "likes": "0",
                    "time": "10/05/2022-11:40:48",
                    "content": "This proposal is currently being voted on. Its RP will run from 05/09 to 05/23. Please vote here. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip4c2-sp15-core-unit-offboarding-process-amendments/15291",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/12",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#40",
                    "likes": "1",
                    "time": "24/05/2022-09:42:38",
                    "content": "Thank you to everyone who has participated in this process and to the engaged voters from the MKR token holder community. Prior to the budget proposal passing, the StratFi team submitted a budget modification request following the template proposed. Hopefully this will provide a first test-case of the modified budget request framework and guide discussion and comments. We will organize regular windows during which we will be available to help any prospective and existing Core Units who are interested prepare budget requests. We will also begin rolling out the updated budget and expense reporting framework as per the updated MIP40 requirement. Core Unit collaboration in this regard would be greatly appreciated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7857142857142865
                }
            ]
        }
    ],
    "group_index": "874"
}