{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/oracle-cost-per-collateral-type-reduction/8265",
            "title": "Oracle Cost Per Collateral Type Reduction ",
            "index": 8265,
            "category": [
                "Governance"
            ],
            "tags": [
                "oracles"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#1",
                    "likes": "1",
                    "time": "23/05/2021-08:43:41",
                    "content": "The main cost is writing the prices to Ethereum, right? Clients supporting an additional price is presumed to have only a small, mostly fixed one-time cost. How about updating the clients to monitor MakerDAO and only push a price-on chain if it might result in liquidations? Those are actually fairly infrequent. Wouldn’t the price feed still be equally useful to MakerDAO (though maybe not some other projects) and cost far less? ",
                    "links": [],
                    "GPT-summary": "The post suggests a way to reduce the cost of writing prices to Ethereum for Oracle Cost Per Collateral Type Reduction. The author proposes updating the clients to monitor MakerDAO and only push a price-on chain if it might result in liquidations. The post also asks if this approach would still be useful to MakerDAO and cost far less.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.566964285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#2",
                    "likes": "2",
                    "time": "23/05/2021-09:33:29",
                    "content": "A variant of this is to simply publish the signed prices somewhere (not on-chain or on a cheap side-chain) and make it the responsibility of the keepers to grab a price update and submit it to the system when they kick off a liquidation. (Or an hour before, queueing it up for the OSM.) It’s definitely a very interesting model. But the consequences need to be thought through very carefully, especially if Maker wants to have a viable business model for its oracles. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "0",
                    "time": "23/05/2021-10:40:40",
                    "content": "I know I made a stink about collateral types that don’t cover their Oracle costs in other places, but I want to chime in to say that the Oracle cost for any particular collateral is not material to our earnings. I was using it as an easy filter to identify those vault classes that obviously lose money. The biggest problem isn’t 200k or whatever it costs to provide an Oracle. The main problem is that means Maker is actually paying to assume the risk of bad debt within those vault classes. The last thing we need in the middle of a crash is for millions in debt to go bad that we were actively paying to hold onto. Our business is to be paid to hold risk not to do the opposite. I’m leery of asking for major overhauls of the Oracle feeds, given that exploitation of oracles is a major vector of attack and any time you change something significantly, there’s the chance you let someone in ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8694444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/08/2021-16:40:48",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}