{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/debt-ceiling-adjustment/1099",
            "title": "Debt Ceiling Adjustment ",
            "index": 1099,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "debt-ceiling"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "3",
                    "time": "10/01/2020-14:55:37",
                    "content": "Folks.   I don’t know how to start a poll but perhaps we should have some discussion at least start regarding where the community wants to go on the Debt Ceilings. Personally I am voting for 6/6/6 on the DSR/MCD-SF and SCD-SF because the PEG looks much better here than what it was when the rates were 4/4/3 vs. 4/4/5 currently winning. But not included in the polling here is where people think we should go on the Debt Ceilings. Personally I’m advocating a bump from $100M on the MCD/DC for ETH-A to ~$120M, and a drop of the SCD Debt Ceiling from 70M to 50M.    This is purely in response to the continued nice migration moves.   I’m thinking DAI debt should get closer to $100M and would leave a ~20M bit of headroom, and the SCD should continue to drop to $30M or below and 50M is a safe upper limit (one could even go for 40M and I’d be ok with that) Feel free to discuss and later those who put up the new polls can take into account where the community thinks we need to go to on the Debt Ceilings. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.160946196660483
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "0",
                    "time": "18/01/2020-14:50:52",
                    "content": "Is it time to adjust the DC? I didn’t see any other thread about it. What do you think the next DC should be and when should we vote for it? I’m for the vote ASAP and I’d also like not to have to vote for the DC every month (if we are confident in the system). My suggestion is 250M. At least we have to accomodate all SAI (150M) + room to grow @3M/day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/01/2020-15:25:26",
                    "content": "    MakerMan:  Personally I am voting for 6/6/6 on the DSR/MCD-SF and SCD-SF   I would even go even higher 6.5/6.5/6.5. Why not?     MakerMan:  advocating a bump from $100M on the MCD/DC for ETH-A to ~$120M, and a drop of the SCD Debt Ceiling from 70M to 50M   I would drop SCD debt ceiling to 40 mil ( before the next vote sai number will likely drop further) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "19/01/2020-20:12:24",
                    "content": "Actually if I had to pick a rate I would pick 8% on the SF 1% on the ETH RP, and 2% on BAT RP for effective DAI borrow rates of 9-10% as I think at least for now given growth of approx .5M DAI debt/day when ETH/USD prices are relatively stable we might want to perk up the PEG and slow DAI growth just a bit.  Only reason I suggested 6/6/6 was because that was more likely to pass given the previous votes.  SCD-SF should always be some amount higher than the MCD ETH-A rate (in my opinion anyway) to continue to encourage SCD migration.  Leave the DSR at 6% for a bit just to try to get some data on SF changes alone on the PEG as well as to see if we have any control over debt growth or not…   Current numbers on migration 96.7DAI/29.2SAI  to give approx 125M outstanding so at this point would look again to 120M on ETH-A as we are maybe two weeks from hitting the ETH-A debt ceiling and SCD to 40M now that we are below 30M. The above is the current state of my thoughts on direction.   As to whether to just go to $150M on ETH-A to reduce need for further action into the future.   I don’t have a good idea of how much the DC should be due to risk of a liquidity attack and one of the reasons I’ve been advocating implementing a rate based on debt facility utilizaiton as the markets will then target the utilization based on real competition.     Proposal interest rate adjustment by debt facility utilization Collateral Discussion       I am posting this as a new topic for discussion because after the first round of analysis and the fact the GSM time delay is not activated means the IAMs that could be used to implement it could be coming on line shortly.   Also my wife is now suffering a debilitating medical condition that requires almost constant care currently and so it is time I hand various details/ideas I have found off to others for discussion and debate.  I don’t want to talk about implementation issues but simply the me…     If the above (with same utilization curve) suggestion was implemented I would say take the DC to about $160M and just let the system run for a while (see where the debt facility utilization lands, as well as the rate) and then see which direction to go next (probably a higher DC to lower rates if utilization is > 80%) and everything (PEG in particular) looks stable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.394480519480519
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/debt-ceiling-mechanics/785",
            "title": "Debt Ceiling Mechanics ",
            "index": 785,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "debt-ceiling",
                "idea"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "1",
                    "time": "14/11/2019-12:37:40",
                    "content": "At the present the collateral debt ceiling is absolute. Example: ETH has a USD100m debt ceiling, irrespective of the USD value. My question is: Would it not be better to have a relative debt ceiling expressed as a percentage and linked to the marketcap? Example: ETH has a marketcap of USD 20 billion. Instead of a absolute debt ceiling of USD100 million, we could give it a floating debt ceiling of 0.5% of market cap? The debt ceiling would be the same using both systems but the relative debt ceiling would be much more flexible. If ETH doubles in value, the debt ceiling measured i USD doubles automatically. Same if the price of ETH drops. In this way the debt ceiling for Vault collateral would be adjusted to market circumstances without increasing the Maker governance workload. Are there any strictly technical reasons this would not work? Possibly too high reliance on oracles? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/11/2019-14:51:48",
                    "content": "First thing that comes to mind, you would need to replace the word ‘ceiling’ with something else. Anyhow: You cannot lower the ceiling below the current debt. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "0",
                    "time": "14/11/2019-16:25:03",
                    "content": "You would not need to lower the debt ceiling under total amount of current debt. Example: the ETH debt ceiling is USD100m and total debt for this asset is USD100m - it is in other words maxed out. During an event the price drops significantly (let’s say 20%), resulting in multiple Vaults being bitten. This will lower the total debt for this asset class. If debt ceiling mechanics (which may lag the price by a week or two) kicks in the debt ceiling is adjusted to lets say USD80m after a week or so unless the price has recovered in the meantime. The above system will reduce the governance burden associated with having tens or even hundreds of assets types and manually having to adjust the debt ceiling for each of them as the assets grow or fall in value. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "1",
                    "time": "14/11/2019-20:37:13",
                    "content": "I don’t think it makes sense for the debt ceiling to fluctuate with market caps of the collateral since the borrowing collateral value is only relevant against the debt value (which is intended NOT to fluctuate via the PEG). This unnecessarily complicates the contract for exactly what benefit? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/11/2019-09:32:51",
                    "content": "    Planet_X:  event the price drops significantly (let’s say 20%), resulting in multiple Vaults being bitten   Can you really assume this step? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.958333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#6",
                    "likes": "0",
                    "time": "15/11/2019-14:57:16",
                    "content": "It is an assumption. It should however be fully possible to simulate it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spounds",
                    "index": "#7",
                    "likes": "0",
                    "time": "15/11/2019-15:52:18",
                    "content": "Very naive question here[Apologies if addressed in previous thread]: Is it possible to denominate the ceiling in absolute nominal units of ETH [or in units of each type of collateral]? Main thought was to eliminate rates of exchange and global supply of money. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.841666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "0",
                    "time": "31/12/2019-18:42:11",
                    "content": "Actually based on SCD actions during the last drop I can say for sure the following two things.  Most people who actively manage their vaults don’t want to be liquidated Due to (1) what will happen is either a) more collateral will be deposited b) Debt will be paid down.  2b   would be a case where one might want to lower the DC 2a   would be a case where one WOULD NOT want to lower the DC Personally I have advocated elsewhere a kind of floating rate based on the Debt utilization and the community voting for a SF target based on a 50% Debt utilization.    My proposal suggested the Debt Utilization curve for the SF should be ~.5*SFtarget if the utilization is < 20% or 2xSFtarget if the utilization is > 80%.    This would allow for a kind of floating rate that would manage utilization and the rates bounded by the debt utilization curves.  It would also allow the rate to move towards the existing market via users. Having a fixed rate for whatever amount of debt utilization leads to the need to unecessary management of the DC by the community.    Same thing applies to the DSR.   I would rather something like a fixed percentage of the incoming interest (say 50% for example) be set aside for the DSR again giving a kind of utilization curve payout to depositors since it guarantees MKR holders get a return, and DSR holders will self manage to match best available market rates for the risk exposure. If one sets up a system to manage itself via proper feedback mechanisms - it will.   Right now every parameter in the Maker system is fixed and is requiring constant community votes to adjust.    I think in time this will lead to voter and community exhaustion for very little reward.  It also leads to Maker rates being inflexible to market conditions and being used to arbitrage rates against other platforms. The added bonus is that having utilization curve based rates will allow enough data to be collected regarding what the market thinks the risk exposure is for Maker compared to other platforms both on the borrow and supply side of the rate equations and will always allow for liquidity to be available (at some price) and to have utilization actively managed by users. There are other issues here in relation to how quickly and accurately Maker can adapt their business model to the now fast changing DeFI space. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.765617484367485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Bob_Swift",
                    "index": "#9",
                    "likes": "0",
                    "time": "20/02/2020-10:24:06",
                    "content": "I have already taken two loans from two different financial institutions and now I want to take one more. I read about debt consolidation and by doing that rate of interest will be decreased. So if I do that, will I exceed the limit of my debt ceiling. If any expert is reading this, please do reply. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                }
            ]
        }
    ],
    "group_index": "212"
}