{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poll-options-to-handle-comp-farming/2981",
            "title": "Poll: options to handle COMP farming ",
            "index": 2981,
            "category": [
                "Governance"
            ],
            "tags": [
                "governance-poll",
                "comp",
                "liquidity-mining"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "0",
                    "time": "30/06/2020-14:55:59",
                    "content": "Due to the incentivized campaign by Compound, several types of collateral is now in high demand. Thanks to the work done by @cyrus     Upcoming COMP farming change could impact the Dai peg Risk       I have been watching the evolution of COMP farming extremely closely over the last two weeks, and I’m concerned that an upcoming governance change to their protocol could significantly affect the Maker ecosystem. On Friday the balance of power among their collateral assets is going to change dramatically  Up until now, Dai has been left out of the COMP farming craze. This is because COMP is currently rewarded to farmers paying/earning the most amount of interest. Because the BAT rate maxes out v…      and @monet-supply     Discussion: Liquidity Mining Impacts Risk       Compound is currently voting on an update to the distribution calculation for COMP. This change would make COMP distribution proportional to total $ amount borrowed, instead of the current method of allocating based on interest paid. Discussion can be found here.  So far, it looks like this update is likely to pass almost unanimously. This will greatly increase the allocation of COMP directed to the DAI market.   [image]  Assuming 2% DAI borrowing rate on Compound, the total cost of borrowing is…      there is strong reason to believe demand for collateral, including Dai, will be even higher going forward. With Compound incentivizing their offering, it is quite possible collateral will be moved directly to Compound without first being used to generate Dai at Maker due to the inefficiency caused by overcollateralization. As pointed out by the above community members, this could cause high demand and low supply for Dai, with the associated risk for the DAI/USD exchange rate. Accordingly this poll is about how we could increase the supply of Dai despite the incentives offered by Compound. What should we do?       An overall increase in the debt ceilings of each collateral type we already have approved. This does however assume that users will prefer to add Dai to Compound, and not directly use their collateral.     Create an additional collateral tier with high debt ceiling and high stability fee for each of our approved collateral types. Again the issue is that it could be considered a secondary option to go through a Vault instead of using the collateral directly on Compound.     Create an additional collateral tier with high debt ceiling and high stability fee for each of Maker’s approved collateral types that are not on Compound’s market. This collateral now has to go through Dai in order to join in on the COMP farming. The tokens this applies to are KNC, LINK, PAXG, WKT and TUSD-A if current votes are final.     Lower the liquedation ratio for all collateral approved stablecoins.     Add MKR as a Vault collateral type with high debt ceiling and high stability fee type parameters, something like USDC-B.       0 voters     ",
                    "links": [
                        "https://compound.comradery.io/post/1769",
                        "https://forum.makerdao.com/t/discussion-liquidity-mining-impacts/2898/19",
                        "https://compound.finance/governance/proposals/11",
                        "https://compound.comradery.io/post/1769",
                        "https://forum.makerdao.com/t/maker-relay-ep-2/3097",
                        "https://forum.makerdao.com/t/signal-request-should-makerdao-signal-that-it-prefers-for-comp-rewards-for-dai-suppliers-and-borrowers-to-be-disabled/3112",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-99-thursday-july-2-9am-pst-4-00-pm-utc/2944/2"
                    ],
                    "GPT-summary": "The post discusses the impact of an upcoming governance change to the Compound protocol on the Maker ecosystem. The author expresses concern that the change could significantly affect the Maker ecosystem and lead to high demand and low supply for Dai, with the associated risk for the DAI/USD exchange rate. The post includes a poll asking for suggestions on how to increase the supply of Dai despite the incentives offered by Compound. The post also includes a discussion on the update to the distribution calculation for COMP and its potential impact on the DAI market.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.48201754385965
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "1",
                    "time": "30/06/2020-15:07:28",
                    "content": "You linked my comment instead of @cyrus 's just fyi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "0",
                    "time": "30/06/2020-15:08:12",
                    "content": "ah typical! thanks for the correction ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.979166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#4",
                    "likes": "3",
                    "time": "30/06/2020-15:42:56",
                    "content": "I think the simplest options (tentatively) are A) Lower USDC-A LR to 101%, set debt ceiling very high ($100 mil). Medium stability fee. Then, anyone with just a little bit of USDC can arb the peg down. B) ETH-B with 133% LR and medium debt ceiling as well, with a high stability fee. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.031180555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#5",
                    "likes": "4",
                    "time": "30/06/2020-17:35:51",
                    "content": "Having USDC with a very low LR and auctions turned off would necessitate setting the SF to 0%, otherwise the internal accounting of the protocol would come out of whack as positions would get lower collateral value than their debt, but still not be liquidated. IMO this is perfectly fine in the short and medium term as provides the community a lot of breathing room through a solid guarantee that the peg won’t break significantly, regardless of the market distortions that happen from the various free money subsidy programs being employed by other defi projects. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.592592592592593
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "4",
                    "time": "30/06/2020-22:20:11",
                    "content": "Apologies for length here I am just putting down my thoughts for others to digest and to get them out because the analysis and thinking here really needs to be clearly analyzed so everyone - particularly governance can sort out what they want to do. @cyrus Lets try to clear something up. arbitrage trades are ones that are typically made on two different exchanges ideally simultaneously for different price netting an immediate profit for the arbitrager. Taking a position and holding it until a price changes on something IS NOT an arbitrage trade is it a position trade.   In the case of a DAI price higher than 1 it would be a DAI USD short, if < 1 a DAI USD long. … What you want the markets to do to provide liquidity is to take on the DAI short position for whatever the SF is with the hope to unwind it later when the DAI price is lower.   The market participants have to have a good understanding of their pricing risk, against the trade profit (or trade risk).   The problem here is that capital would need to be locked and then the position taken.   What happens if they need their capital back and can’t exit the trade?  Or worse another event side swipes everyone and DAI prices continue to rise.   Double down, up the limit.  No matter how you look at this the above options A/B basically put the system at risk (A) because of the massive centralization risk having not just $100M of USDC against what $200-250M DAI and markets looking for more DAI  (B) lower LR and people buying ETH in to borrow DAI.    No matter how you turn this to solve the problem there still is one basic issue.   What is going on here is increasing risk in ALL DeFI systems and markets and this risk is not being priced appropriately. It is starting to remind me of prehousing crisis and a whole bunch of other financial crises where to ‘float’ or ‘protect’ the financial systems from collapse (or huge stresses leading to possible bankruptcies) that the FED, govts etc. basically heaped on liquidity to stave off systemic risk.   At some point the markets can come calling on this and if one is not nimble or fast enough can sideswipe you very quickly wiping the whole thing out.  It is a game where the house has to have the cards to do whatever is required no matter what.   It is a dangerous game still being played with the world economy even now. Whether to take this risk with governance in control via the direct injection methods I suggested or to decentralize this to market participants and just try to manage it via the weak and slow tools Maker has at its disposal.   Well we can ‘hope’ it will work.   I want to know when the first $100M USDC-A is soaked up where do we stop this?  And what SF fee are you going to advocate here.   Medium means ‘what’ relative to this 29%yr over year comp bait being tossed into the DeFI waters by compound?  10%, 5, 15, 2? And are we going to sit here and not active liquidations on USDC and float everything on top of the USDC.   Honestly folks this is kind of serious and the idea of just throwing everything risk wise out the window to satisfy an already crazy situation is like heaping more gasoline on the fire to put it out. We know there is going to be a liquidity demand that might not be satisfiable with a rather unknown driver that can change everytime compound governance changes.  Prudence says to head that off with somewhat of a counter move.  Make it more expensive to borrow DAI now so that the overall cost to play the compound game is too high.   Play into the upcoming move so we can get a solid gauge as to whethere there even is a price where people won’t play the compound game with DAI.   Hell if I knew Robert I’d be asking them to exclude DAI from the comp totally so that DAI can’t be directly gamed - only via indirect methods until they can get this under control.  Maker system and markets really are not ready for these stresses and could get so hammered if we get another overall market surprise risk off event that also sideswipes crypto. Honestly I’d like to see a protocol that could handle this and I don’t consider this an emergency yet.  But I can see it quickly becoming a serious problem and possibly an emergency if we drive liquidity the wrong way here making an ETH price pump and then dump when the next compound governance change happens and these farmers want to make another shift with some fraction of a billion in value of assets. I think it is more prudent to proactively tighten slightly to compensate for risk as a rise in the PEG.  Yes extend some liquidity via managed DC increases, new facilities with different rates but USDC-A LR at 101% that is so over the top reactionary.  Short leverage at those levels requires literally 90x fees and tx’s because you have to roll over and over through tx fees to accomplish this type of leverage.   I know because I have been doing it up to 3x on USDC-A myself. I mean if you want to go whole hog here.   Do the 101%LR up the debt ceiling to 1B set the SF to .25% just to send a message that DAI will be available for this little game but then realize what you are doing to your DAI holders.  IF (and I don’t think governance will ever do this BTW) the system has to be ES’d you are going to be having everyone holding DAI bags looking to exchange for USDC and that might not be pretty to markets. No matter what is done here if it is extreme it will lead to further market distortions that we will not be able to easily guess in advance and may end up finding ourselves trapped in a pretty bad road very quickly. Do we up the cost by raising SF and making the PEG go up now to throttle this and control system risk or do we simply keep SF low, increase DC and lower LRs and drive up the risk component.    THIS is the kind of discussion we need to be having with risk teams here.   What are the additional risk components in each scenario to the entire class of people that make up the entire business community.  DAI holders, vault owners,  and MKR holders as well as the entire DeFI space. What appears to be missing here is this kind of risk analysis of how the above suggestion is likely going to affect not just the players in the space but also the pricing risks (driving ETH DAI price up, massively increasing centralizing USDC risk in the Maker protocol, etc.) It is easy to make a guess based on what seems right, but much harder to game out this risk in a rapidly changing risk and reward environment particularly in the face of what is driving this to understand the most prudent change for all parties when our chains are being yanked around by someone elses decisions. I want to be clear I don’t see this as an emergency.  I am concerned.  But I want the response to be well composed and thought out from a gaming scenario point of view and I am not seeing this with off the cuff suggestions without some gaming being thought out here.   My biggest problem with trying to scenario this is that I honestly don’t have a good idea of what compound governance is going to do next and this is driving everything.   I am honestly not sure we can set up a catch all type of response system as the parameter space seems larger than I like and the potential driver messing things up here at 29% on $1B is god awful strong. ",
                    "links": [
                        "https://forum.makerdao.com/t/peg-stabilization-modules-a-pre-mip-discussion/3045"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.313044546449719
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#7",
                    "likes": "2",
                    "time": "30/06/2020-22:50:32",
                    "content": "Thanks @MakerMan. You brought up a lot of great points. Particularly about how, even if they are willing to put the trade on with high leverage, how will they exit out of it? Interestingly though, at a super low LR, Vault owners still have the majority of their original USDC in hand. The capital lockup is very, very minimal. And eventually the trade will have to unwind (or ES will be called). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.327500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#8",
                    "likes": "1",
                    "time": "30/06/2020-22:58:44",
                    "content": "I know I seem a bit harsh here but I feel like compound mis-action or inappropriate action is causing us here to also be reactionary and pretty much to ignore risk (your area - so my post above really is meant to assist you and all of governance here in assessing risk against action).  If I had in my head a great way to narrow the parameters to post a kind of gaming analysis on the different possibilities I am suggesting. Two in particular (tighten a bit now in advance to drive the market in direction it will go anyway to see if we can with SF, and high DAI PEG drive off the DAI comp farmers).  Or just give with the liquidity at low fees and take on a huge amount of risk we won’t get crap for compensation for. I wish I had it for us.   What I really want to do and I hope they are reading this thread is to shake compound governance harshly and wake them up.   This is a serious problem that requires a hard and fast move.   Their decentralization should not put the rest of the ecosystem into a higher risk situation and governance needs to know this.   Cut the COMP now - 0 it and revisit how to approach this.  If they won’t please exclude DAI from comp so Maker only has to deal with this indirectly.   Maker IS the only DeFI space project that has it’s own stablecoin we really need the community to realize how important it is to not kill us here or make us do things that together really increase risk in the entire crypto space. @cyrus I appreciate the praise and I highly respect your opinion.  I also wanted to say thank you for creating this thread it was timely and needed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.526944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "3",
                    "time": "30/06/2020-23:21:36",
                    "content": "Another thought came to me on this 101LR on USDC-A. Say the DAI PEG is 1.02 - This means leverage is infinite and I earn USDC by levering.  Literally one could make USDC by levering this up to total DC.   I think we have to have the USDC-A LR at least at a level we don’t expect to see the DAI PEG at.   105 at least because if the price goes above this then the USDC DC attack is effectively on.   Now can someone manage this attack to walk with their capital and leave the system in a lurch.   Depends on the DAI price they can get.and how much they have to lever before they can walk with all the USDC they started with. This is something we need to take into account here on the LR especially for USDC btw.  So a big no to the idea of 101LR and $1B cap…    I think 105 is probably the lowest we want to try to go if we even go down this road and know a USDC attack is possible if the DAI USDC price rises above 1.05.  What I don’t know is if the DAI USDC price is used to calculate whether a USDC loan on Maker is underwater or if this is still pegged to 1.   I understand the idea of not doing liquidations (I really want to urge people to turn liquidations on on USDC) but peggin the DAI/USDC price to 1 just opens up the above USDC DC LR attack. BTW:  The above only came to me because as I use the USDC-A facility to take the DAI USD short. I realized a while ago the higher above 1% I get on the DAI USDC sale the closer I come to edging out the 20% on the 120%LR - this allows me to extend my LR effectively because the DAI USDC price is helping get me more USDC to feed into Maker extending my leverage with the USDC profits.   I then was like shit if we lower the LR to 101 I literally make USDC  if I sell DAI for USDC over the LR price (101 being 1.01 in DAI). I think this bodes well for a LR that should never be below 110% because as the PEG approaches 1.1 leverage effectively is growing already.  I think 1.1 DAI PEG in most normal circumstances should never sustain for any length of time… EDIT ADD:   Also where is the room for the Liquidation Fee of 13%?   I mean literally to have a hope of getting that 13% are we not required to have LRs > 113%?  Literally the protocol has to have room for profit on ALL of the assets that might liquidate otherwise the protocol loses money and MKR flop auctions occur.   I know USDC doesn’t have liquidations turned on.  But when we turn them on we are going to want a LR of 113% AT a MINIMUM at least if we think the 13% LF is important risk parameter to govern behavior? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.380704365079366
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#10",
                    "likes": "2",
                    "time": "01/07/2020-07:58:30",
                    "content": "Yesterday it was Black Thursday, today it’s COMP, tomorrow there will be something else. The DAI model is not working or it works only in an ideal 2017-2019 world when there is no large demand/supply, no economic crisis, no Covid, no incentives, no $20+ network fees, no bank runs in the developed world… We have to search for solutions outside of the comfort zone:  negative SF incentives minting ‘out of thin air’ L2 …  We should’ve had a team working on the next version of DAI as soon as it became obvious that we need more and more hacks to keep the system afloat (3+ months?). I hope my remarks won’t sound hostile - I like DAI since the beginning and I know that it’s easy for me to complain and do no development but it’s hard to design/program and maintain a complex system. Now for the solution… There are not many solutions that we can implement quickly but one of them might be to mint DAI ‘out of thin air’ and buy ETH (not USDC as @MakerMan suggested as we’ll quicky end up being backed mostly by a centralized coin). DAI has already bet on ETH’s success as being part of the ecosystem - now we might want to double down. I know that being a decentralized system you cannot just buy/accumulate ETH, hold it in some multisig wallet and sell when needed - you have to define some rules and conditions, but it can be done - maybe in a more centralized/manual way in the beginning and more decentralized/automatic in the future. If there are enough likes for this post, I can set up a signal/separate thread for that idea or other more controversial ideas. As for this poll - there is really no option that I think will help. We can try raising the DC for ETH to “unlimited” (no other collateral type is significant/decentralized - we can raise them but it doesn’t matter) to see how much demand there is but then what? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.51187641723356
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#11",
                    "likes": "5",
                    "time": "01/07/2020-08:48:27",
                    "content": "“minting DAI out of thin air” and buying collateral with it would negate practically all work done by the Maker team since 2016. The good will and credibility built by Maker in the Defi community will be gone in a single vote. Proponents of such ideas are better off getting involved in stablecoins based on algorithmic designs such as Ampleforth. Do note that I am not criticizing the idea as such, it is just that it is the wrong action to take for a collateral based stablecoin such as Maker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.164285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#12",
                    "likes": "0",
                    "time": "01/07/2020-09:16:07",
                    "content": "    Planet_X:  “minting DAI out of thin air” and buying collateral with it would negate practically all work done by the Maker team since 2016. The good will and credibility built by Maker in the Defi community will be gone in a single vote.   That is your opinion. I think that improving the peg will help regain confidence in the Maker governance. The system might be undercollateralized for a while, maybe not. We just don’t take actions on every ETH price swing. I admit it is a significant change - I wish a working solution within the current design exists.     Planet_X:  … it is just that it is the wrong action to take for a collateral based stablecoin such as Maker.   But the current actions are not working (4 months above the peg, DAI supply not growing). Should we just activate global shutdown in a few months so that we don’t change the original design? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.145604395604395
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#13",
                    "likes": "10",
                    "time": "01/07/2020-09:28:12",
                    "content": "The real problem is the lack of collateral, diversification and scale of the system, which is why getting pushed around by Compounds distorted economics is a real risk. It’s a fundamental issue which will be solved as the system becomes able to onboard real world assets as collateral to properly scale. Getting real world assets as collateral is something that the Foundation and many of the companies in the ecosystem are working on, and which will come over time (please keep in mind that connecting a DAO with real world legal systems is something completely unprecedented and revolutionary - it was never going to happen overnight). Until we get it, having a low LR on USDC to prevent the peg from failing is the best option. The alternative is to just give up and either call ES, or just give up on the peg and disregard the users of the system. The great thing about stablecoins as collateral is that they naturally unwind themselves when the system gets back into balance with enough long term collateral to cause an increase in the DSR. So it cannot cause a long term problem, if there wasn’t already a problem to begin with (broken peg and not enough collateral). It’s the best interim solution that’s available. And it might seem uncomfortable to potentially have a lot of USDC as collateral as an interim measure until the system can get back into balance - but it’s important to look past the narrow “centralization bad” memes and be realistic about the risk that exists in crypto. All assets in the market, including ETH,  already fundamentally relies on, and is thus effectively backed by, Tether (plus a few centralized exchanges). What’s gonna happen to the ETH in the maker collateral portfolio if tether vanishes? From that perspective, does it really make sense to make the “centralization bad” argument against USDC? The truth is that as long as the system relies significantly on a single type of risk, which is the risk of the small and insulated crypto market, it will always be in a transition stage where it could fail due to a single catastrophic event, and where the community needs to work decisively towards mitigating this risk. The only sustainable solution is getting significant amounts of real assets with actual value to hedge the risk of the crypto markets. Until we get there, we can pick our poison: Do we want to have bad liquidity in Dai and greater risk of being forced to ES - but be able to say centralization bad (while still secretly counting on tether, binance and coinbase to not mtgox), or do we want to use stablecoins to make the user experience better and risk lower as an interim measure while we work on the long term growth of the collateral portfolio? One thing to note is that I’ve always been in favor of a low LR for stablecoins (below 101% IMO). 100x leverage is the standard in Forex, but that’s between different currencies. Here we’re talking about backing USD with USD. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.440925426774483
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#14",
                    "likes": "1",
                    "time": "01/07/2020-09:54:13",
                    "content": "    rune:  It’s a fundamental issue which will be solved as the system becomes able to onboard real world assets as collateral to properly scale.   I think that option is very very far away and I’m not sure if it’s even worth mentioning at this time. Even if we onboard such collateral in less than a decade - the problem IMO is not the lack of collateral - it’s the lack of incentives and punishments (to vote, to borrow, to repay, to save, to spend, to arbitrage…) and the lack of trust in ETH (as a store of value).     rune:  Until we get it, having a low LR on USDC to prevent the peg from failing is the best option. The alternative is to just give up and either call ES, or just give up on the peg and disregard the users of the system.   I also see only those 3 scenarios except that I believe that #1 will not work because there is no immediate arbitrage opportunity even at LR 100% (maybe I don’t see it?). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.778787878787879
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#15",
                    "likes": "5",
                    "time": "01/07/2020-10:51:03",
                    "content": "    bit:  I think that option is very very far away and I’m not sure if it’s even worth mentioning at this time. Even if we onboard such collateral in less than a decade - the problem IMO is not the lack of collateral - it’s the lack of incentives and punishments (to vote, to borrow, to repay, to save, to spend, to arbitrage…) and the lack of trust in ETH (as a store of value).   I think it will happen, and at scale, sooner than most people expect. There’s already a number of real world assets that have been proposed as collateral - some of them more realistic than others. And once just a few have been onboarded to prove that it is possible to do, it could begin drawing in more assets because of the better rates that Maker can offer compared to banks or their intermediaries.     bit:  I also see only those 3 scenarios except that I believe that #1 will not work because there is no immediate arbitrage opportunity even at LR 100% (maybe I don’t see it?).   The hardest guarantee comes when you are able to buy more Dai by buying USDC and then generating Dai, rather than buying Dai directly on the market for USDC. So the LR of USDC, if there’s available debt ceilling, always sets the upper bound for the price of Dai. E.g. If USDC LR is 101%, the peg shouldn’t be able to go above 1.01 Since at that point you’d rather buy USDC, generate Dai, and potentially just ditch the vault (if there’s a positive SF) or wait until more collateral is added and the system gets into balance to make an extra profit by closing the vault when the Dai price goes back down. And IMO having this kind of guarantee is actually really important for attracting more ETH collateral to the system, since it reduces the risk of ETH vaults being stuck without a way to easily wind down their Vault. In the worst case scenario they can wind it down at a 1% loss on the Dai price by just buying USDC and generating Dai with it. Obviously, to my earlier point, none of these scenarios are ideal but that’s a consequence of the fundamental issue which is lack of collateral, not that stablecoins are bad or are causing these issues in the first place. However, I think it is pretty much indisputable that will be in a better position to escape this situation of lack of collateral if the peg is under control, vs if it is neglected, because users will be much more willing to add new collateral to the system if they don’t see a huge peg risk that could make the price of their debt grow unpredictably. Having an upper bound on that risk in place through USDC is a huge improvement IMO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.863920454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#16",
                    "likes": "1",
                    "time": "01/07/2020-14:41:44",
                    "content": "I see. The plan for profit with 101% LR and $1.02 DAI/USDC is:  Mint 1M DAI with 1.01 M USDC Sell DAI for 1.02 M USDC Ditch the vault and earn 10k USDC  …but what would the system do with all that abandoned USDC in vaults generating 0 in fees? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#17",
                    "likes": "0",
                    "time": "01/07/2020-14:47:24",
                    "content": "Isn’t the plan at 101% to recursively mint dai, trade it for usdc, lock up, repeat? So… you should be able to mint ~ 1M dai with ~10k usdc. It takes a long time to do that though, would be nice if there was a way to lever directly in the app. Maybe this can be done easier within defisaver? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#18",
                    "likes": "5",
                    "time": "01/07/2020-15:53:12",
                    "content": "Yes, you can directly do this direct recursive behaviour with flash loans. Possible with other interfaces like defisaver and instadapp. Also it should be noted that you can mint 1M DAI with 10k USDC if the peg is at 1.00, if the peg is at 1.005, you only need 5k capital, if the peg is at 1.01, you need 0k capital. Considering that you currently can’t get liquidated, it doesn’t make sense to be giving out free put options at 1.01. I’d recommend at least a 103% collateral ratio. This isn’t like trading Forex, and with forex you can get liquidated. Also, it’s not just shorting DAI. This will be quite popular for rate arbitrage too. With a 103% collateral ratio, it makes sense to use this vault if the interest rate on DAI is 1.03x more than USDC. Seems like it’d be quite popular even with a 105% CR and a modest SF. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.822916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#19",
                    "likes": "0",
                    "time": "01/07/2020-15:57:38",
                    "content": "Is there a major technical hurdle that prevents us from activating usdc liquidations? Is it primarily an oracle issue? This feels like something we really need to activate asap. It would be terrible if usdc vaults started going below 100% collateralization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.6625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#20",
                    "likes": "0",
                    "time": "01/07/2020-18:33:41",
                    "content": "@bit I completely agree a team should have been working on this.   Personally I see this in the risk and governance domain.  @cyrus brought up the topic and proposed a solution but did not provide a real analysis of the additional risk it will bring to the system. I think if we wanted to look at tools we could simply look at Central Bank and FED monetary policy tools to see what they have in their basket and figure out what we could apply. Purchasing assets IS in the CB/FED tool box.  They also literally can inject and remove liquidity AT will in pretty much every market now (in the past these injection mechanisms were limited to only certain markets - after 2008 and now covid it is pretty much a free for all on what CBs are doing with liquidity here) I have suggested that the reserve fund could hold many assets.   I tended to favor assets that either had stable valiues or ones that were anti-correlated with the accepted collateral simply because a reserve is usually designed to hold or increase in value when markets are stressed.   They should also have good liquidity in case cash needs to be raised.   My thinking here is just based on a company or business perspective as well as a financial one. I am at a loss to understand how the DAI price will stay below 1.01 if we put USDC LR to 101.  I also completely disagree with rune suggesting this is like forex markets when liquidations are turned off.  forex markets with 100x leverage have pretty dang aggressive liquidations because of the high leverage.   Rune can you even imagine what a forex market without underwater position liquidations would look like?   I am thinking my decades now trading and watching these markets in different capacities is pretty worthless in the face of these kinds of suggestions when one simple fact remains.  Why has Maker added what 4 or more new asset classes all with liquidations turned on and leave what was an emergency facility both active, fixed oracle price, and liquidations turned off? So yeah I feel what you are saying @bit but honestly feel like anything that isn’t just twisting a pre-existing knob pretty much is going to fall on deaf ears.   It is a lot harder to look at a problem and be open to all solutions - even if they are not practically realizable at the time vs. the reverse of this.   Only be open and entertain solutions that ARE practically realizable now.   The first is a different and proactive way of approaching process optimization, the second is for the most part a reactionary approach.    As a freelance consultant I could see quite clearly how hard the first is to do efficiently, and how easily the second became a cheap dead end leading usually to some kind of systemic failure that needs an out of the box idea in the first to solve provided your business was not entirely ruined before you could successfully implement it.   It is quite difficult to find an effective middle ground between these two allows for successful major upgrades and real open discussions about issues (even if difficult and politically/economically divisive or costly) while also paying attention to what can be done practically with the system as-is without a major upgrade which has its own hazards. We will all see how Maker navigates these issues as time passes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.579832336975194
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#21",
                    "likes": "0",
                    "time": "01/07/2020-21:36:38",
                    "content": "Compound Governance Proposal: Update cDAI Interest Rate Model    compound.finance    Compound Compound is an algorithmic, autonomous interest rate protocol built for developers, to unlock a universe of open financial applications.      Also, wondering why @rleshner polled for “Add MKR as a Vault collateral type with high debt ceiling and high stability fee type parameters, something like USDC-B”  – highly doubt the Maker Risk Team would agree with such opinion  ",
                    "links": [
                        "https://compound.finance/governance/proposals/12?target_network=mainnet"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.628571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rleshner",
                    "index": "#22",
                    "likes": "2",
                    "time": "01/07/2020-21:41:12",
                    "content": "Speaking as a MKR holder, its an efficient route to draw DAI. Nobody knows MakerDAO better than MKR holders, and the “availability” of the asset probably rivals or exceeds ETH. I’m not sure why it’s considered so taboo. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#23",
                    "likes": "1",
                    "time": "01/07/2020-22:08:38",
                    "content": "The problem with USDC liquidations is that the current auction system cannot handle them well if they happen at a large scale. The new upcoming liquidation system would do so. But it is not as urgent as with other assets from the risk perspective, since USDC risk is very much all or nothing.     MakerMan:  I am at a loss to understand how the DAI price will stay below 1.01 if we put USDC LR to 101. I also completely disagree with rune suggesting this is like forex markets when liquidations are turned off. forex markets with 100x leverage have pretty dang aggressive liquidations because of the high leverage. Rune can you even imagine what a forex market without underwater position liquidations would look like? I am thinking my decades now trading and watching these markets in different capacities is pretty worthless in the face of these kinds of suggestions when one simple fact remains. Why has Maker added what 4 or more new asset classes all with liquidations turned on and leave what was an emergency facility both active, fixed oracle price, and liquidations turned off?   The difference between Forex and USDC as collateral is that there is no market risk - both are USD. To better understand what it is you’re worried about, can you explain what scenario you imagine where having real time USDC liquidations online would be useful in the short run? So not a situation where USDC has been banned/seized/frozen because trying to do a liquidation then wouldn’t really matter. Keep in mind governance can always manually activate liquidations, or turn on the real time oracle based liquidations. And let me try to better use examples of how a low USDC LR helps create an upper bound on the peg. The peg goes above e.g. 1.01 USD because people are buying Dai with USD and are paying more than 1.01 USD for 1 Dai. But if the cheapest way to buy Dai becomes buying 1.01 USDC, and then generating 1 Dai with it, people will stop buying it on the open market, and start generating it instead (thus alleviating open market price pressure). If market participants still pay above the 1.01 on the open market (e.g. 1.02), then arbitrageurs will step in and sell e.g. 1 Dai for 1.02 USDC, then use 1.01 of that USDC to generate the 1 Dai back and then pocket the free 0.01 USDC. This arbitrage will continue until no one is buying Dai on the free market above 1.01, as long as a single arbitrageur is active. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.525515493278651
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#24",
                    "likes": "2",
                    "time": "01/07/2020-22:23:02",
                    "content": "I guess the risk with usdc liquidations turned off is more just not being able to stay above minimum collateralization as interest accrues… which is a risk that becomes much greater as the LR moves close to 1. with a 1% SF at 101% CR I believe it only takes a few days for a maximum leverage vault to be underwater. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rohanp",
                    "index": "#25",
                    "likes": "2",
                    "time": "01/07/2020-22:53:38",
                    "content": "PSA: USDC-A debt ceiling is already 95% used, ETH debt ceiling 82% used, and DAI is already 1.3% above peg. COMP farming hasn’t even started yet—it will pick up tomorrow as Compound gov proposal is executed. Pointing this out to emphasize that there is some urgency in addressing this issue ASAP so that DAI does not drift too far off peg.    daistats.com    Dai Stats Dai statistics live from the Ethereum blockchain.      ",
                    "links": [
                        "https://daistats.com/#/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.3939393939393945
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#26",
                    "likes": "4",
                    "time": "01/07/2020-22:55:17",
                    "content": "Can we have an onchain vote ASAP about the LR for USDC-A (i.e. 101%, 102%, 105%, 125%…)? It seems that we also might want to vote for the new USDC-A DC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#27",
                    "likes": "0",
                    "time": "01/07/2020-23:38:13",
                    "content": "There are a couple of assumptions implicit in your argument.  There will be 0 interest charged otherwise over time these positions can go underwater relative to surplus due to interest. at low interest this could take a lot of time but then what about abandoned vaults?   Another implicit assumption here is that high DAI PEG means low or 0 SF. Orderly liquid markets - without significant fees and with liquidity to fund them (not just DAI but USDC etc.) All DAI holders value $1USDC or even 1.01USDC = $1 USD Implicit in the above is that the DC will never be hit so that DAI always can be minted.  I think there are cases where these assumptions will be violated that lead to different forms of risk either for DAI holders or MKR holders. I am skeptical that a liquidator would actually pay $1DAI for 1.01USDC if the DAI price is above 1.01USDC since bidding and moving money around involves fees and liquidators want to profit not lose money.   I am also skeptical that ALL DAI holders value 1 USDC = 1 USD.  We already know markets can get ‘disorderly’.  I am skeptical the USDC SF will be 0.  In fact it is not 0 now even though at .25% it would take something short of 4 years to put the position underwater due to interest.  Also unless I see MKR governance putting the USDC DC at say some effectively infinite or very large number that the DC will be hit and DAI won’t be mintable, or it will be at a higher price. Right now USDC-A is almost at capacity after being down for a while and we still have a PEG around 1.5 the question then again will be whether to even have a DC.   The whole interest thing on USDC-B would also still apply even if one set the 1.01 LR there - in fact it would be worse as it would only take a week to go underwater on interest there.  Where does DAI get minted if we are having a collateral asset price crash and possibly a USDC price drop below $1 USD. In this case even if we were liquidating the net DAI yield for 1.01 USDC would likely be below 1 DAI making a system surplus loss even if small. I grant you - IF the above assumptions hold - then your argument is reasonably sound.  I don’t believe we can count on the assumptions above to always hold and in particular to hold for all DAI holders at all times. Turn your argument around.  IF USDC is so valuable why not allow liquidations to be turned on since based on your assumptions the system would never lose money.    Right now the answer is because the liquidation system can’t handle the massive load.   Why is this?   Because without the fear of liquidations there is no real structure to the collateralization of vaults.   Everyone can lever up to max at the same LR without fear of liquidation where as there at least would be some skew of collateralizations if liquidation was turned on meaning not everyone is going to lever up and do it at the 101LR level because they would be concerned about either interest or DAI USD price rising to cause them to be liquidated and ofc they would get nothing back. Your example basically incentivizes the worst behavior without any control or possible scatter to allevaite a massive liquidation scenario and just heaps risk of some uncovered loss into the system… EDIT ADD:  I think this idea has some merit but I think a LR of 101 really doesn’t build in any system safety margins from a risk perspective and liquidations off means there is nothing to temper borrowing behaviors to provide system Collateralization variance so the vaults don’t clump at the same CR levels. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.910251322751323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#28",
                    "likes": "4",
                    "time": "02/07/2020-00:08:53",
                    "content": "Even with a 120% CR, the USDC-A Vault is now at 95.74% utilization. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#29",
                    "likes": "3",
                    "time": "02/07/2020-00:17:33",
                    "content": "One thing I want to remind people of.   The Maker system ran with DAI PEG > 1 with a suplus buffer -5.3M with something like 70M DAI outstanding for over a week. I for one was surprised that the markets did NOT immediately punish the DAI PEG by dropping it to like <.95 because of this until MKR was auctioned to fill the gap.   Normal and efficient markets would have done this.  It was one reason I suggested and suggest simply minting DAI out of thin air (the threat of this should drop the DAI PEG by itself),  doing it but not buying anything should actually drop the PEG, and direct injection would/should be the final nail to actually lowering the PEG via directly injecting this unbacked DAI into the markets to lower the PEG and buy assets that are in a seperate Maker reserve account (not available if system ES’s to DAI holders except if Maker governance specifically approved it). I honestly would like to see other DAI creation mechanisms - something more along lines of @cyrus suggestions and possibly @rune except not with a 101LR but I think given the size of the compound driver here we could bloody well need to mint .25-.5B DAI to satisfy possible demand.   I just am concerned if we play into this this way vs. first doing something of the opposite to measure what price demand exists at we simply are going to whipsaw the markets when compound makes the next move. I keep hearing this DAI > 1.0 crushes people.   It hurts vault holders but with SF fees on the most used vaults running .25% I don’t see a high PEG hurting them here.  It simply is a market based SF based on the DAI premium and this is good for DAI holders.  If vault owners are well collateralized this has no impact on them since they can simply wait to pay down debt because the additional PEG cost is literally 4 years of current SF.   If anything these vault holders could add more collateral and take advantage of the DAI short opportunity.   If their collateral is going up and they want to get access to collateral all the higher PEG does is eat into trade profits to buy DAI to release capital to capture slightly less gains. Literally a high DAI PEG incentivizes DAI minting via users opening vaults here there and elsewhere.  The real issue generally is liquidity and this is where the rub always seems to come and what we are learning is that a decentralized approach trying to incentivize people to take this on may simply not be enough.   Going off the wheels to incentivize this by tossing system risk out the window pushing system parameters to the edge or into unlimited catagories doesn’t have to be the only tool in Makers arsenal.  But right now IT APPEARS to be the only TOOL IN the arsenal due to the current structure of the system determined by the current smart contract structures. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3892764857881135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#30",
                    "likes": "4",
                    "time": "02/07/2020-00:56:26",
                    "content": "My feeling is that we’ve been too shy/risk averse to increase debt ceilings/lower CR. The market has determined what it wants and by us not giving it to them (more USDC/WBTC) we’re only shooting ourselves in the foot. At this point it seems like we have to balance systemic collateral risk with DAI peg risk and determine which is more likely in the short/medium term. I still have faith that market forces will play out properly to keep the peg closer to $1 than $1.10 but we should definitely keep driving forward with new collateral types and other tweaks to existing ones. It’s important to stay pro-active instead of reactive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.805681818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#31",
                    "likes": "0",
                    "time": "02/07/2020-01:31:11",
                    "content": "I appreciate this view Aaron I think I would just like to see more of a measured approach to loosening with some eye to measurement mechanics and some application of science to optimization than a whole hog - throw everything we got at it at once and leaving ourselves without any options if it looks like we are getting trapped thats all. Perhaps we should list the actual available options within the system now that we can do and then list ones that we might want to have in our arsenal that would take work and see if we can get risk teams to kind of rank what they think are the least risky and most impact on this list so we all can hone in on the best options because we may find ourselves needing to act and I completely agree with you we want to be ready to ACT strong and confidently but not RE-ACT in panic and fear. I think some comments from @cyrus and also @vishesh on how we are going to take measurements to asses results of actions during a possible upcoming mess might be warranted so we have a handle on what we will use datawise to drive the results of previous decisions to funnel into the next decisions as this may be a fast moving issue.   I hope this all is a non-event but you all have a worst case planner here so yeah.  I will almost always err on the more conservative sides of things, except to toss out what I feel are off the wall ideas just to vet them.   Which is why I liked @rune tossing his LR 101 USDC idea out as it is pretty off the wall so we can analyze extreme ideas to see maybe if we can find one that goes in a good direction and allows for whole hog but has a means to go there in a stepwise methodical fashion even if the steps end up being somewhat logrithmic. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#32",
                    "likes": "0",
                    "time": "02/07/2020-02:00:06",
                    "content": "Definitely yes on USDC-A DC unless one wants to create a new USDC-C facility for this. Given other comments do we really want to poll on 101, 102?    If we do that add 103, 104, 105, 110, and same 120, as well as 133, 150.   basically the approx 100x, 50x, 33x, 25x, 20x, 10x, 5x, 3x, 2x leverage options. I am mixed on whether we want to make another ETH facility with lower LR and higher fee.   I think we should poll cleanly on the USDC LR, and then do the DC since higher leverage folks will probably want a higher DC than low leverage folks (hard to say without polling).   The real question is going to be what SF or really the RP change if any on this as I think a higher rate due to risk would be a prudent step here. Is the above USDC the preferred option or should we look at other options? Onboarding more collateral? Expanding ETH either with a new facility or using the existing one? What else is realistic and doable now with existing system? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.554407713498622
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#33",
                    "likes": "5",
                    "time": "02/07/2020-08:26:48",
                    "content": "I definitely agree that with any sort of positive fee, and without reliable auctions, the USDC LR needs to be significantly higher. But I don’t think the value of getting a bit of MKR buy and burn is worth much when the cost is a worse peg (in a situation where the peg is already broken and has been broken for a long time). I also don’t think having a lets say 5% SF on USDC for 6 months would help make any difference if e.g. coinbase failed. On the other hand I think that having shown user growth and better momentum for the project by delivering a more acceptable user experience through a less broken peg, would probably make a big difference, because it would impact whether the market would be ready to buy a lot diluted MKR if some sort of big catastrophe happened. <-- thats really the crux of my argument - I think people who want to be conservative with risk parameters believe they are reducing risk to the system, when IMO it is potentially doing the opposite if it’s making the UX and growth prospects significantly worse. Obviously the ideal situation is a world where there is plenty of collateral and a decent DSR, and diversified stablecoins available as collateral at low LR’s with high enough SFs to properly account for their risk from a risk management perspective. I also think the idea of a direct liquidity/stabilization mechanism built into the DAO is very interesting. It’s something that I’ve considered too radical in the past but now we’re post black thursday and getting into the defi free money bonanza I think it should be considered more in depth by the community. But back to the topic of what to do in the short run: Ultimately it’s not my decision what gets up for a vote - For risk decisions like this I’m just another voice in the community, so ill support any measure that can help. The most important thing is just that we do something, and that we always take a broken peg seriously. The biggest risk IMO, is the market losing confidence in the commitment of governance to maintaining the peg. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.23434917355372
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#34",
                    "likes": "2",
                    "time": "02/07/2020-10:09:46",
                    "content": "Just a quick note to those arguing for immediate action in some form. Given the polls in the OP, the only action there is consensus for currently is decreasing the CR for stablecoins. Given that the debt ceiling has already been fully utilised for USDC, there doesn’t appear to be a large amount of urgency to make that change. Emergency action can take place, but we need to have a solid justification for doing so. In my opinion, this would take the form of either:  Getting a majority on a poll specifically calling for some sort of emergency action outside of the weekly poll cycle. Ideally with a majority on what that emergency action should be. The more support a poll has, the harder it is to justify ignoring it. So aim for more than a simple majority. A clear statement from @Risk-Core-Unit that emergency action is warranted. Again, ideally with a clear plan of what that emergency action should be.  There is a segment planned in the Governance and Risk meeting later today in which everyone can discuss the impact of COMP. I encourage those participating in this thread to attend the call and take part in that discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.942640692640692
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#35",
                    "likes": "3",
                    "time": "02/07/2020-11:00:04",
                    "content": "I do not think any immediate action is required, but what I would very much like to happen is that one or more possible emergency responses are planned for in detail. So if things becomes too hot we can respond quickly without lengthy discussions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.2027777777777775
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#36",
                    "likes": "5",
                    "time": "02/07/2020-11:11:15",
                    "content": "Any ad hoc (using that word now instead of ‘emergency’) polls would definitely include a debt ceiling change as well. In fact, debt ceiling change may be first, with liquidation ratio changes to come later, since those are a bit more aggressive. We just saw 20 mil get taken at 120% LR. We could consider lowering the LR as a policy tool to keep in the back pocket. The most important near term change is the increase in debt ceilings. Can discuss on the governance call today. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#37",
                    "likes": "0",
                    "time": "02/07/2020-14:13:19",
                    "content": "    LongForWisdom:  Given the polls in the OP, the only action there is consensus for currently is decreasing the CR for stablecoins.   There was no option in the poll for “doing nothing in the short term (days)” so I guess there is no consensus for that either. In that case, we should do something (anything) i.e. let MKR holders decide. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#38",
                    "likes": "0",
                    "time": "02/07/2020-14:18:32",
                    "content": "    bit:  There was no option in the poll for “doing nothing in the short term (days)” so I guess there is no consensus for that either.   You can’t assume consensus (or lack of it) for an option that people were never given a chance to vote on. I suspect that we will end up doing something. Whether that happens this week or next week largely depends on the criteria I shared above about taking emergency action. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.314285714285715
                }
            ]
        }
    ]
}