{
    "poll_list": [
        {
            "title": "Interim DAO Budget - February 8, 2021",
            "index": "5924",
            "option": "Yes",
            "supporting_mkr": "28,626",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-interim-dao-operating-budget/5924",
            "title": "[Signal Request] Interim DAO Operating Budget ",
            "index": 5924,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#1",
                    "likes": "9",
                    "time": "05/01/2021-18:16:57",
                    "content": "Happy new year everyone! The DAO Autonomous Group has been growing a lot since its inception. We now have 10 members actively working to move towards the decentralized future of Maker. As our responsibilities have been scaling up, so have our bills. So far the Foundation has been able to cover most things through the grants program, but with the introduction of the community-led PSM we are now racking up costs which need to be covered. We believe it is time to take the next step towards the DAO funding operation of the protocol. The DAO Autonomous Group proposes setting up a Gnosis multi-sig wallet for the end of the month owned by all mandated domain facilitators who opt-in. As of right now this would include:  @LongForWisdom @Primoz  By the end of the month there are potentially 3 more candidates to join the multi-sig:  @SebVentures @juan @hexonaut  We propose running this as a (N - 1) of N multi-sig so you need the signatures of 1 less than all the owners. We will also be whitelisting governance with full authority over the wallet, so they can take the funds back at any time. This allows us to keep a conservative threshold for fund distribution as there is no risk due to key loss. The Autonomous DAO group will keep public records of when and why funds are distributed. The DAO will also return any remaining funds if the number of signatories drops below 3. To get things started we propose an initial budget of 100k DAI to cover previous expenses (~50k mostly for the PSM audit) as well as give us some budget for January and February. For perspective this is less than 2 days of protocol revenue at current numbers. We will be preparing a formal MIP in parallel as well to cover how funds are allocated on an ongoing basis. In the event the MIP fails the remainder of the 100k DAI will be returned to the surplus buffer, and another strategy will be devised. There is also a 1 year expiry in which the funds will also be returned.     Yes, I want to proceed with this plan with 100k DAI Yes, I want to proceed with this plan, but 100k DAI is too much No, I do not want to proceed with this plan Abstain     0 voters     This poll will be run for 2 weeks closing on Tuesday, January 19th which can be extended if there is significant controversy or discussion. If this poll passes then it will proceed to an on-chain governance vote for the week of February 1st to give time to confirm who the domain facilitators are. If the governance vote passes then the following executive will include a vat.suck() to move 100k DAI from the surplus buffer to the multi-sig. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp10-declaration-of-intent-eurdai/6766",
                        "https://forum.makerdao.com/t/signal-request-adjust-the-surplus-buffer-march-april-2021/6979/12",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/road-to-dao-the-core-unit-operating-model/6105/11",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-124-thursday-january-14-17-00-utc/5967/2",
                        "https://forum.makerdao.com/t/road-to-dao-the-core-unit-operating-model/6105",
                        "https://forum.makerdao.com/t/gobernanza-de-un-vistazo-14-01-2021-autor-original-prose11/6073",
                        "https://forum.makerdao.com/t/mip34-keg-streaming-payments-module/6013/6",
                        "https://forum.makerdao.com/t/governance-at-a-glance-2021-01-14/6048",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-10th-2021/6046",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-en-espanol-feliz-2021/6035",
                        "https://forum.makerdao.com/t/governance-at-a-glance-2021-01-07/5959/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-27-happy-2021/6016",
                        "https://forum.makerdao.com/t/governance-at-a-glance-2021-01-07/5959",
                        "https://forum.makerdao.com/t/team-funding-experiment-rwa-objectives-and-cost-structure/5954",
                        "https://forum.makerdao.com/t/remaining-autonomous-makerdao-budget-returned/13701"
                    ],
                    "GPT-summary": "The post proposes setting up a Gnosis multi-sig wallet for the DAO Autonomous Group to cover expenses and allocate funds for the DAO funding operation of the protocol. The post also includes a poll for community feedback and proposes an initial budget of 100k DAI. The post explains the details of the proposal and the process for implementation. The post may receive constructive criticism, questions, and potential collaboration from third parties. The proposal may also be audited and reviewed by third parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Board composition",
                        "Smart contract updates",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5788059163059165
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#2",
                    "likes": "4",
                    "time": "05/01/2021-18:21:48",
                    "content": "I voted yes. I cannot really tell if 100k is too much or not, but in the end this does not really matter. After PSM as a first community driven deliverable this is the biggest next milestone of becoming a real DAO. I have fill trust in all individuals listed here and I am looking forward for the future. Proud to be part of this (even if just participating from the sidelines). Let’s DAO it! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#3",
                    "likes": "2",
                    "time": "05/01/2021-18:23:53",
                    "content": "I would go with 200k (just to decrease amount of such polls). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/01/2021-18:24:41",
                    "content": "How do signal that 100k isn’t enough? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "2",
                    "time": "05/01/2021-18:26:46",
                    "content": "Wait. How long is this for? Unconditional? What is the timeframe? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#6",
                    "likes": "0",
                    "time": "05/01/2021-18:30:15",
                    "content": "I like this move and fully support it. Yearn was able to become a self-funded DAO so it is definitely doable for MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#7",
                    "likes": "1",
                    "time": "05/01/2021-18:30:16",
                    "content": "    hexonaut:  some budget for January and February   I think it’ll be for January and February. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/01/2021-18:30:19",
                    "content": "Let’s start with 100k and top up later. We can improve along the way ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#9",
                    "likes": "1",
                    "time": "05/01/2021-18:30:54",
                    "content": "This is an interim budget until we get a formal formal structure set up. There is already ~50k in outstanding bills and we wanted a bit of wiggle room to fund ongoing PSM dev as well as potentially DssGovRewards. Appreciate you guys wanting to provide more, but we are mostly still covered by grants and just wanted to dip our toes in first. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#10",
                    "likes": "9",
                    "time": "05/01/2021-18:33:54",
                    "content": "I do agree. 100k is not much (plus half of it will go to pay the audit) but we should give the first step in this direction (I see this Signal Request as that step). We don’t know yet what will happen in the on-chain votes, what big MKR holders have to say in this regard. I trust that they see this as the right direction of events, but we should first ensure that’s the case (once we go on-chain). Also adding more members of the community to the multi-sig will ensure that everybody will feel more comfortable with it, including big MKR holders. My full support for this, really happy to see this happening already! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.362103174603174
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#11",
                    "likes": "4",
                    "time": "05/01/2021-18:54:27",
                    "content": "If we can get this through, it will be a turning point for the DAO. Once developers across DeFi sees that you can get paid by the maker community directly when you contribute, we will begin to see a lot more contributions and new code and upgrades to the protocol! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.284090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#12",
                    "likes": "2",
                    "time": "05/01/2021-19:31:54",
                    "content": "    hexonaut:  There is already ~50k in outstanding bills   I am not opposed to this generally but if 50K is already spent.   I see 50k for the PSM audit.  What will the other 50K get, when? I guess I will wait for a formal MIP. Also N-1 probably not ideal as if two are lost for any time this means funds are locked.   Improbable to be sure but I would go for N-2 at least (which won’t work with < 3) with 2 it means one person authorizes.  I’d say get a larger group (5 and do N-2).  In 1Hive swarms (DAOs themselves) basically use majority of quorum (quorum decided by holding non-transferrable swarm tokens). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.597222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#13",
                    "likes": "2",
                    "time": "05/01/2021-19:37:21",
                    "content": "    MakerMan:  I am not opposed to this generally but if 50K is already spent. What was it spent on?   This will mostly be going to the Quantstamp audit. They estimated 40k for 2 audit-weeks, but I still have to do another round with them and get the final bill. The rest will be for my dev time and contract deployment gas costs for both the PSM as well as DssGovRewards. Anything where I cannot be paid by the Foundation.     MakerMan:  Also N-1 probably not ideal as if two are lost for any time this means funds are locked.   I mentioned this in the post, but lost keys is not an issue because we are whitelisting governance as an admin account, so worst case scenario if the keys are lost then governance can perform an executive vote to return the funds to the surplus buffer. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "7",
                    "time": "05/01/2021-21:43:49",
                    "content": "A couple of words on this. My acting as a keyholder is contingent on there being at least two other keyholders. So I’m hoping that one or more of the potential mandated actors will also be ratified in January. Regarding process on this, normally this would be something I’d like to handle as a MIP through the monthly cycle, but we’re running in to the situation where it’s actively causing us problems to not have the ability to pay people. This became particularly noticeable when it came to the PSM, and organising the audit. We were originally hoping that the more-permanent solution would arrive in time for us not to need to worry about  about an interim version, but as it turns out, setting up a sustainable, extensible and transparent structure for budgeting and payments is more complicated than it sounds. I also think that the 100k starting amount will need to be added to in the near future, but we felt it was important to start small to maintain trust rather than saying something along the lines of ‘we want 500k to cover the next 3-6 months worth of potential expenses.’ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.270833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cryptouf",
                    "index": "#15",
                    "likes": "0",
                    "time": "05/01/2021-23:46:50",
                    "content": "I also agree with the majority of comments here. I also think 100k is very low, especially if 50k are already spent. But it’s hard to tell without a formal MIP.     hexonaut:  We will be preparing a formal MIP in parallel as well to cover how funds are allocated on an ongoing basis.   You are saying  that 100k should be enough, so let’s go for this, but this should probably be increased soon. But again it also depend on what this budget is for.  So waiting to know more.     MakerMan:  Also N-1 probably not ideal as if two are lost for any time this means funds are locked. Improbable to be sure but I would go for N-2 at least (which won’t work with < 3) with 2 it means one person authorizes. I’d say get a larger group (5 and do N-2). In 1Hive swarms (DAOs themselves) basically use majority of quorum (quorum decided by holding non-transferrable swarm tokens).   Also agree with this.  N-1 doesn’t give a lot of flexibility. Maybe we can start like that and change it latter. but N-2 seems better to move quickly. Especially if multisig holders live on different time zones. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.439616755793226
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#16",
                    "likes": "4",
                    "time": "05/01/2021-23:59:22",
                    "content": "    LongForWisdom:  We were originally hoping that the more-permanent solution would arrive in time for us not to need to worry about about an interim version, but as it turns out, setting up a sustainable, extensible and transparent structure for budgeting and payments is more complicated than it sounds.   Yeah.  I was there with you on the MIP to authorize DAI transfers - seems so long ago.  So now with Foundation pretty much riding off into the sunset you and the few others here are having to bootstrap the entire DAO from scratch.   Why I think doing a MIP for some real funds beyond 100K is probably desirable.   I honestly would support up to 500K given that is earned in what 2 weeks now. I would urge you and primoz to get your team of 5 and put together a .3-5Mish proposal with some basics laid out.   As a MKR holder I am very supportive of this.   We risk millions every day it is time we start using some of those millions being earned to get the true MakerDAO off the ground.  I expect a real budget will be in the 1-2M/yr (really higher for entire DAO functions) and I can’t think of anyone I’d trust more than yourself to see those funds managed with prudence and as much transparency as possible.     LongForWisdom:  I also think that the 100k starting amount will need to be added to in the near future, but we felt it was important to start small to maintain trust rather than saying something along the lines of ‘we want 500k to cover the next 3-6 months worth of potential expenses.’   The above is exactly why I would agree to doing more.   Honestly put at least a rough idea of budget for at least 3 months (ideally 6) together.  If it is reasonable and includes at least a small component to pay someone to provide transparent updates as to spending and quality assurance I think we would find significant support.   I’d rather your group get more than ample funding to start and hazard losing 50K (what 20hrs of Maker earnings) to something than to short change you guys and cause headaches in the effort to find and retain key people. This was needed 6 months ago, even more so now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#17",
                    "likes": "0",
                    "time": "06/01/2021-00:25:49",
                    "content": "I’d like to know the roadmap and the expenses without much details. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#18",
                    "likes": "4",
                    "time": "06/01/2021-09:21:57",
                    "content": "This proposal is only a first step, really just used to finance some unexpected stuff that the community wants. The PSM audit is a good example, it was decided quite in a rush and we were lucky to have an audit firm that agreed to be paid only if the DAO wish. Instead of spending months of designing the perfect system to find that it doesn’t work in real life, we take a more fragmented, test & learn approach to craft the good MIP at the end. You can expect 2 other proposals in the short term. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-123-thursday-january-7-17-00-utc/5928/3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.286111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#19",
                    "likes": "1",
                    "time": "06/01/2021-13:35:26",
                    "content": "The roadmap for the Maker protocol is being mostly set by the Foundation SC team. I primarily work with them on the agreed upon agenda, but these funds are for things that they cannot assist with such as the PSM and DssGovRewards. The PSM is now live, but there is more work to do extending it to other collateral types and setting up a website UI along with documentation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.176136363636364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#20",
                    "likes": "0",
                    "time": "06/01/2021-15:06:16",
                    "content": "Moving forward there should probably be a quarterly budget with line items as to how the funds will be used to finance growth initiatives. For transparency’s sake. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party giving feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#21",
                    "likes": "3",
                    "time": "06/01/2021-17:31:19",
                    "content": "Understood Sam.   I wanted to thank you, primoz and LFW and the rest about to come on board for all the hard work.   I think it is time that MakerDAO finally start getting its act together beyond the Foundation here.   You already have other stuff coming up (PSM for other stablecoins, UI, documentation).  These will require audits.  MakerDAO is going to need money to secure 3 auditors (would really love if lev wanted to be a paid 4th btw as he seems to have a good handle on the protocol from a security sense).   Literally I can see 50K not covering the above and something more like 150K being needed. I am going to urge one last time.   Get at least a 3 month and preferrably a 6 month budget up for MIP vote with a list of line items with tentative budgets.   There is no reason to pass 3 or more MIPs through governance when we can do this with one.   Maker needs to grow up a bit here in a DAO sense and I am confident the players in charge of these funds will make sure they are put to good use. We are definitely going to need work accounting, and auditing so I expect at least 10% of whatever funds to go to efforts in that regard.   500K here to kick start the next 6 months of autonomous MakerDAO given this is now a 1B project really isn’t that much.  Right now this is like 2 weeks of protocol profits. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.962868480725624
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#22",
                    "likes": "2",
                    "time": "06/01/2021-19:38:23",
                    "content": "    hexonaut:  The PSM is now live, but there is more work to do extending it to other collateral types and setting up a website UI along with documentation.   Thanks for the explanation. I don’t support more work on PSM except for the minimal maintenance. The interested parties could fund the integration of “their” coins. The MakerDAO system gets nothing from including dozens of small cap coins in the short term. PSM is a nice experiment and a showcase but it does not solve any major issue (although time will tell). I’m also not much enthusisatic about the governance rewards. The circumstances changed. The gas price is not getting cheaper and it prevents many rewards to be claimed. When you add the costs of claiming rewards, approving, voting (poll), voting (exec), trading, anonymizing?.. - it’s just not worth it. My list of unclaimed rewards, interest, coins, even abandoned deposits just gets bigger. Maybe the whales would be interested in such rewards - if we get 3x more whales (100 MKR+) voting - that would be a real success. BTW, the good way to get some money would be to start charging for the oracles. I’d vote immediately for a 200k budget for that purpose. I’ll abstain in this poll as I’m not too opposed to the budget (a showcase, again :)) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.053300865800866
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#23",
                    "likes": "3",
                    "time": "06/01/2021-22:32:50",
                    "content": "    bit:  BTW, the good way to get some money would be to start charging for the oracles. I’d vote immediately for a 200k budget for that purpose.   Oracles as a Service is coming Bit! Totally excited about this–and The Oracles Team do deserve a hefty Budget for such–agree. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#24",
                    "likes": "4",
                    "time": "19/01/2021-13:02:35",
                    "content": "Poll is closed with a large majority saying Yes to proceed. We will go to an on-chain vote for Feb 1st. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#25",
                    "likes": "2",
                    "time": "19/01/2021-16:48:59",
                    "content": "Sorry I’m new to the Maker community - could you explain why we have a two week lag on this SR? Seems like a no-brainer and given the community support, would be great to see a on-chain vote in one week or less. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.337121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#26",
                    "likes": "5",
                    "time": "19/01/2021-17:16:39",
                    "content": "In this case we need to confirm who the mandated actors are to hold the keys which we won’t know until the MIP exec passes next week (or not). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#27",
                    "likes": "4",
                    "time": "31/01/2021-23:30:27",
                    "content": "This will be delayed for a week until we can actually setup the multi-sig. It’s taking us a little longer than anticipated to collect addresses and get the setup done. All being well, this should move on-chain on February 8th, with a multi-sig address, and the signing addresses of each of the five keyholders. The on-chain poll will ask whether Governance wishes to transfer 100,000 DAI to this multi-sig address to manage payments until we can get some Core Units up and running. Thanks to all who voted, and apologies for the delay. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#28",
                    "likes": "1",
                    "time": "01/02/2021-09:07:05",
                    "content": "    LongForWisdom:  January 8th   typo: 8th February 2020. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#29",
                    "likes": "1",
                    "time": "01/02/2021-11:19:27",
                    "content": "Fixed, thanks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#30",
                    "likes": "6",
                    "time": "17/02/2021-11:52:12",
                    "content": "This has now passed on-chain and the multi-sig has been funded with 100,000 DAI. Thanks to all who participated. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#31",
                    "likes": "0",
                    "time": "24/02/2021-11:52:34",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3125"
}