{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-8-14-de-marzo/13987",
            "title": "Relay Semanal: 8 - 14 de Marzo ",
            "index": 13987,
            "category": [
                "Latin America"
            ],
            "tags": [
                "summary",
                "update",
                "espa\\xc3\\xb1ol",
                "latin-america",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#1",
                    "likes": "5",
                    "time": "17/03/2022-11:12:44",
                    "content": "Relay Semanal: 8 – 14 de Marzo, 2022  1662×422 244 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas MKR o DAI, tengas tu propia Vault o quieras involucrarte más en la Gobernanza, esta es tu parada obligatoria para estar al día con todo lo nuevo que traen las actualizaciones de MakerDAO.  Aquí podrás encontrar la versión original en inglés en PDF.   Eventos Actuales  Esta Semana en Gobernanza  Comunidad Deep Dai-ve  Anotaciones para el Calendario  Enlaces Útiles  ¿Tienes algún comentario?   Eventos Actuales  Debate sobre Mejorar las Solicitudes de Presupuesto de las Core Units Mientras que el número de Core Units continúa creciendo y varias se preparan para la incubación, las CUs ya existentes se esfuerzan por escalar. Sin embargo, el crecimiento normalmente viene acompañado de un incremento en el presupuesto. Recientemente, la comunidad ha expresado sus inquietudes respecto al gasto de personal y cómo esto podría llegar a ser insostenible, dejando al protocolo en una situación potencialmente precaria. Aquí puedes encontrar los Gastos de Enero vs. el Presupuesto  1380×526 480 KB   1380×526 480 KB  Ten en cuenta que la mayoría de los FTEs (empleados de tiempo completo) también reciben MKR a través de una propuesta de adquisición de derechos aprobada.   Este crecimiento exponencial en los gastos de las Core Units viene llegando desapercibido, aunque ya se han iniciado debates sobre el tema en el Foro y en llamadas públicas. El Delegado Reconocido, Doo Nam, hace un llamado a la consciencia y a mejorar la examinación de los presupuestos de las Core Units. Doo-  …Cada vez vemos más solicitudes para aumentos de presupuesto y creación de nuevas Core Units, con grandes presupuestos también. Temo que están abrumando a la Comunidad de Maker. Esto es especialmente crítico debido a que las ganancias del Protocolo de Maker han venido declinando dramáticamente. Cada petición de modificación de presupuesto debe ser examinada cuidadosamente, pero en realidad eso ha sido difícil… Miembros de las Core Units de SES y SF están trabajando juntos para mejorar e implementar un proceso presupuestario estandarizado para las Core Units.  Aes-  La MIP40 nos ha quedado pequeña – En efecto, logró cumplir con su propósito inicial, pero es muy amplia y necesita más estructura para que los miembros de la DAO puedan acceder fácilmente a las solicitudes de presupuesto. a. SF propondrá una revisión a la MIP40. El reporte de gastos existentes está áltamente fragmentado y no estandarizado, haciéndolo que sea extremadamente difícil de evaluar como las CUs están gastando sus presupuestos, incluso para aquellos que se dedican tiempo completo a ello. a. SF está colaborando con SES para estandarizar estos procesos y proveer las mejores prácticas, pero eso requerirá la participación de las CUs. La ausencia de evaluaciones de rendimiento y rendición de cuentas por parte de las CUs – esto debería ser parte de cualquier solicitud de aumento de presupuesto a. SF está colaborando con SES y los delegados para lanzar un proceso de revisión cualitativa y cuantitativa.  A continuación, puedes ver un gráfico proporcionado por Aes que muestra una comparación actualizada de las propuestas de presupuesto activas en RFC, en relación con los presupuestos anteriores.  973×397 18.8 KB   973×397 18.8 KB  El Delegado Reconocido MakerMan también dió su opinión acerca de revisar las solicitudes de presupuesto de las MIPs actuales, MIP40. MakerMan-  Maker ahora tiene más de 20 CUs, más las que están en proceso de “incubación”; y más de la mitad de éstas, después de tan sólo seis meses, han solicitado ampliaciones de presupuestos con incrementos superiores al 10%. Esto también incluye la adquisición de derechos de MKR. Con los ingresos declinando y los gastos aún aumentando de forma dramática, la Gobernanza de MakerDAO necesita una mejor manera de gestionar los presupuestos de las CUs de MakerDAO (incluyendo la distribución de DAI y la adquisición de MKR).  También proporcionó varias sugerencias para ayudar a mejorar la capacidad de Gobernanza con la gestión de presupuestos. Sin embargo, no todo está perdido; varias Core Units y Delegados están de acuerdo con estas opiniones y están dispuestos a colaborar en agilizar los procesos, para ayudar a mejorar las futuras modificaciones de presupuesto.   Esta Semana en Gobernanza  MIPs  Actualización Semanal de MIPs #781122×756 30 KB   1122×756 30 KB  ¡Las fechas de las RFC y FS para referencia y las propuestas existentes pueden ser vistas en este nuevo rastreador de propuestas (WIP)! Las Encuestas de Ratificación para el Ciclo de Gobernanza de Marzo ya están disponibles. ¡Vayan a votar! Si tienes alguna pregunta acerca de cómo votar en MakerDAO, la Guía Práctica de Votación te será de ayuda. Lo que se viene:  El 30 de marzo del 2022 es el último día de modificación para las propuestas que esperan entrar al Ciclo de Gobernanza de Abril. La próxima ventana de presentación formal se abrirá a partir del lunes 4 hasta el miércoles 6 de abril. Para entrar al Ciclo de Gobernanza de Mayo, la propuesta debe ser posteada en el foro a más tardar el 6 de abril.  Debates Pre-MIP:  DAI Respaldado por Subasta IAM para Buffer de Excedentes Ideas Propuestas en el Foro [Pre-MIP] Usando el giroscopio para cortar el nudo Gordiano del DAI: su dependencia del USDC Una solución estilo RWA para reemplazar el PSM   Voto Ejecutivo Mitigar la Vulnerabilidad de los Préstamos Rápidos después de un Apagado de Emergencia Incorporación de Curve stETH-ETH, Limitador de Tasa Flapper, Pagos por Detección de Fallos Immunefi Ambas votaciones ejecutivas fueron aprobadas el 9 y 11 de marzo respectivamente y fueron ejecutadas el 11 y 14 del mismo mes, generando los siguientes cambios en el Protocolo de Maker:  Mitigar la Vulnerabilidad de los Préstamos Rápidos después de un Apagado de Emergencia Esta propuesta ejecutiva fue aprobada y ahora disminuye la vulnerabilidad de los préstamos rápidos después de un apagado en el Protocolo de Maker, como es descrito por la Core Unit de Ingeniería de Protocolos, aquí.   Dar autorización al nuevo módulo flash-killer sobre el Módulo de Acuñación Rápida, de tal manera que cualquiera pueda usar el flash-killer sin necesidad de algún permiso para deshabilitar el Módulo de Acuñación Rápida en caso de que el Apagado de Emergencia sea activado. (Actualmente) la vulnerabilidad no es aprovechable hasta 3 días después de que el Apagado de Emergencia es activado, lo que significa que hay una ventana de 3 días donde cualquier usuario puede deshabilitar el Módulo de Acuñación Rápida usando el flash-killer antes que ocurra un exploit.   La Core Unit de Ingeniería de Protocolos considera esto como una mitigación temporal y recomienda que el problema debería ser resuelto de forma permanente en el futuro, mediante el reemplazo del Módulo de Acuñación Rápida. El código fuente para el módulo flash-killer puede ser encontrado aquí. La dirección del contrato flash-killer es 0x07a4BaAEFA236A649880009B5a2B862097D9a1cD.  Incorporación de CRVV1ETHSTETH-A De acuerdo con esta encuesta de gobernanza exitosa, el tipo de vault CRVV1ETHSTETH-A fue incorporado con los siguientes parámetros:     Parámetros Nuevo     Colateral Inicial    Tarifa de Estabilidad 3.5%   Ratio de Liquidación 155%   Techo de Deuda Máximo 3MM DAI   Deuda Disponible de Objetivo 3MM DAI   Incremento del Techo de Enfriamiento 8 Hr   Piso de Deuda 25,000 DAI   Liquidación    Función de Precio de Subasta Disminución Exponencial Escalonada   Multiplicador de Cambio de Precio 0.99   Intervalo de Cambio de Precio 90 Segundos   Multiplicador de Precio de Subasta 1.30   Penalización por Liquidación 13%   Limites    Limite de Liquidación Local 3MM DAI   Reducción Máxima de Subasta 0.4   Duración Máxima de Subasta 140 Minutos   Tolerancia de Ruptura de Precios 0.5   Incentivos    Incentivo Proporcional de Activación 0.1%   Incentivo Plano de Activación 300 DAI     Agregar un Limitador de Tasa a las Subastas Flap  De acuerdo con estas encuestas de gobernanza 1, 2 exitosas, un nuevo limitador de tasa, detallado más abajo, fue añadido al contrato.   Modificar el Contrato-Flapper introduciendo una tasa límite para que el protocolo pueda controlar la cantidad de subastas Flap que ocurren simultáneamente. Esto se logra limitando la cantidad de DAI que puede ser subastado por MKR al mismo tiempo. Agregar el parámetro lid que establece el valor total de DAI que se permite enviar a las subastas de excedentes (flap) de una sola vez. Establecer el parámetro lid a 150,000 DAI.  Por favor ten en cuenta que esta propuesta ejecutiva no incluye en el Buffer de Excedentes del Sistema, que permanecerá en el valor actual de 250 millones de DAI.  Pagos por Detección de Fallos Immunefi Como parte del Programa de Recompensa por Detección de Fallos Immunefi, se transfirieron un total de 2,750 DAI de la siguiente forma:   2,500 DAI fueron transferidos a 0x3C32F2ca11D92a7093d1F237161C1fB692F6a8eA.  250 DAI fueron trasferidos a 0x2BC5fFc5De1a83a9e4cDDfA138bAEd516D70414b.  Para más detalles, consulta el hilo en el foro.  Encuestas de Gobernanza Activas     Nombre de la Encuesta Debate     Financiar la Prueba Piloto del Programa de Embajadores Debate   Emendar la MIP64 para Aclarar el Monto Crítico de Recompensa Web (MIP4c3-SP1) Debate   Encuesta de Ratificación para Declaración de Intención - Invertir en Bonos de Corto Plazo (MIP13c3-SP12) Debate   Encuesta de Ratificación para la Desvinculación de Facilitadores (MDS-001) (MIP41c5-SP5)) Debate   Encuesta de Ratificación para el Presupuesto de GovAlpha de 2022-2023 (MIP40c3-SP59) Debate   Encuesta de Ratificación para la Modificación del Presupuesto de la Core Unit - Finanzas del Mundo Real (RWF-001) (MIP40c3-SP61) Debate   Encuesta de Ratificación para la Modificación del Presupuesto de la Core Unit de GovAlpha (MIP40c3-SP60) Debate   Encuesta de Ratificación para Incorporar - Enmendar la Red Keeper - Red Gelato (MIP63c4-SP3) Debate   Encuesta de Ratificación para Incorporar - Enmendar la Red Keeper - Red Keep3r (MIP63c4-SP2) Debate   Encuesta de Ratificación para los Pagos Rápidos de Recompensas por Detección de Fallas (MIP64, Enmienda de MIP40c3-SP42) (MIP4c2-SP17) Debate   Encuesta de Ratificación para la Compensación de Delegados Reconocidos (MIP61) Debate    Consulta el Relay Semanal del 7 de Marzo para más información sobre las encuestas más recientes.  Encuestas del Visto Bueno de la Comunidad No hubo encuestas del visto bueno de la comunidad para la semana del 8 – 14 de marzo de 2022. Échale un vistazo a los tipos de Vault actuales y a sus parámetros en MakerBurn.  Peticiones de Señales Activas Promover la “MIP4c3-SP1: Enmendar la MIP64 para aclarar el monto crítico de recompensa web” a una encuesta on-chain Psychonaut presento una petición de señal bastante directa. En cuestión: Enmendar la MIP64 para aclarar el monto crítico de recompensa web Consideraciones (ni pros ni contras):  Aumentar el pago de los bugs web de gravedad critica de 5k-50k a un sólo monto de 50k. Reducir la negociación en torno a los montos de recompensa por gravedad critica. Aumentar los incentivos para que los hackers de sombrero blanco persigan los bugs web de severidad critica.  Onboard de D3M para Notional Finance El Delegado Reconocido GFX Lab manifestó su opinión de incorporar un D3M (Modulo de Deposito Directo de Dai) al fondo de préstamos para el vencimiento de 3 meses de Notional Finance, con un techo de deuda inicial de 10 millones de DAI (a menos que la Core Unit de Riesgo recomiende lo contrario).    [Signal Request] Onboard D3M For Notional Finance   Pros:  Aumento de Ingresos. Al momento de escribir este artículo, la tasa de tres meses esta al norte del 7%, en una base de alrededor de 85M de DAI. Por ejemplo, incluso una prueba de 10M de DAI DC pondría a un D3M Notional entre los 10M mejor pagados (ee estima que al momento de escribir este artículo 10M de DAI solo suprimen las tasas a un 6%).   Como referencia, a continuación, se indican los ingresos anuales estimados de otros grandes grupos:    Mayor control sobre el front end de la curva de rendimiento. Estratégicamente, el uso de Maker de los D3M a través de múltiples lugares de préstamos va a ejercer más control sobre el mercado total, amortiguando los efectos de la liquidez fragmentada para DAI, así como la volatilidad durante los descensos del mercado. Al ser bastante insensible a los costos del gas, el D3M de Maker para Aave ha permitido estabilizar la tasa de DAI incluso de cara a una fuerte volatilidad. La estabilización también puede ser aplicada a la porción más corta de la curva de rendimiento.   Diversificación de las contrapartes. Actualmente, Maker se enfrenta al riesgo existencial de varias contrapartes: Circle, Lido, Bitgo, Paxos y, ocasionalmente, Aave. Al crecer la oferta de DAI y aumentar la tasa por la cual el Buffer de Excedentes crece, un programa de D3Ms diversificados avanza a la meta de reducir el exceso de dependencia de las contrapartes individuales.   Riesgos crediticios conocidos y riesgos tecnológicos. Los riesgos representados por la exposición a plataformas de préstamos sobrecolateralizados de Notional Finance (que figuran en la lista de Contras) son riesgos en los que Maker tiene una profunda experiencia en evaluar y monitorear a través de las Core Units de Servicios de Ingeniería de Colaterales, Riesgos e Ingeniería de Protocolos.   Reducción de la dependencia del colateral de stablecoin. Al momento de escribir este artículo, la oferta de DAI esta respaldada en un 68% por colateral estable, cuya mayor parte es 5,300,000,000 USDC y casi 500.000.000 USDP. Los D3M pueden escalar rápidamente y solo son limitados por la deuda de sus mercados desplegados, permitiendo que crezcan a medida que la demanda de DAI crece en la plataforma de préstamos. Esto no solo aumenta la oferta de DAI, sino que también debería reducir la demanda de los PSMs, ya que habría métodos alternativos de obtener DAI.    Contras:   Riesgo de smart contracts (contratos inteligentes). En cualquier interacción de protocolo a protocolo siempre hay un riesgo en smart contracts. Los pasos para mitigarlo en caso de Notional Finance incluyen una auditoria por parte de ABDK, un programa de compensación por detección de fallos en Immunefi de 1.000.000 dólares, análisis mediante Code4arena, verificación formal a través de Certora y un reporte de diligencia pendiente por parte de Consensys.   Riesgo de Multisig. Los mecanismos de la Gobernanza de Notional están todavía en las primeras fases de descentralización. Por el momento, partes clave del protocolo son gobernadas por 3 de 5 multi sigs.  No se ha establecido un calendario final, pero los poderes administrativos de la multi sig están destinados a ser eliminados con el tiempo. Algo que posiblemente atenúe el riesgo para Maker es que uno de sus delegados; (GFX Labs) es uno de los firmantes y todos los firmantes están completamente doxados. Tenga en cuenta que otros colaterales subyacentes que ya están en el portfolio de Maker también incluyen gobernanza con multi sigs, por lo que no se trata de un riesgo nuevo.   Riesgo de Iliquidez. Si la cantidad de DAI en la pool de liquidez cae debido a que los LPs retiran su capital, puede que no haya liquidez suficiente para que Maker retire el 100% de su capital antes del vencimiento. Hay que tener en cuenta que Maker siempre podrá retirar su capital al vencimiento, independientemente de la liquidez en la pool. Este riesgo de iliquidez sólo se refiere a retiradas previas al vencimiento. Para mitigar esto, se puede tener en mente un escalado gradual de máxima exposición.   Riesgo de perdida de capital. Si las liquidaciones no se realizan correctamente, la perdida de capital es un riesgo. Notional ha construido una infraestructura de liquidación fuerte y actualmente utiliza parámetros conservadores. Siendo una plataforma de prestamos sobrecolateralizados el riesgo de deuda incobrable es, en principio, bajo. Aunque probablemente sea innecesario para Maker, también hay una cobertura disponible para Notional bajo Nexus Mutual.   Riesgo de Oráculo. Notional utiliza Oráculos Chainlink para los 4 activos enumerados. Maker ya está expuesto al oráculo Chainlink a través de Aave y (próximamente) a través de Compound.     Onboard de PAXG Otra Petición de Señal para la incorporación de un nuevo colateral fue propuesta por la Core Unit de Finanzas Estratégicas. Esta vez para incorporar a PAXG (PAX Gold)    [Signal Request] Onboard PAXG   Pros:  Gold puede ser una pieza importantísima para DeFi. Cuando incorporamos WBTC, aún era pequeño y no estaba probado en DeFi; desde entonces, se ha convertido en un elemento importante, en parte gracias a MakerDAO. Lo mismo puede ocurrir con PAXG. DeFi puede proporcionar rendimiento para el oro y así atraer a gente de TradFi. Esta incorporación puede incrementar nuestra relación con Paxos. El dominio del Dólar Americano está bajo ataque (especialmente después del uso del dólar como arma) y una fuerte inflación viene en camino. Ambas cosas son buenas para el oro.  Contras:  El oro puede caer en el olvido pronto. Los aumentos de tasas actuales son malas para el oro. PAXG esta centralizada por Paxos. Puede haber falta de demanda y podríamos incurrir en pérdidas y vernos desenfocados (costos de Oráculo).      Comunidad Deep Dai-ve  Tweet de la Semana     twitter.com    Maker @MakerDAO  📆 This is the first#MakerUpDaits!  Get refreshed with this recap on what happened with@MakerDAO and Dai in the last two weeks.  👇   6:48 PM - 14 Mar 2022           30                8             Opiniones de Foro stkMKR: Revision del Staking y los Tokenomics de Maker Monet-supply introdujo una propuesta para hacer staking de MKR y potencialmente revisar sus tokenomics con la esperanza de mejorar el crecimiento de usuarios, la participación y seguridad de la Gobernanza, así como mucho más.  El mecanismo económico de tokens de stkMKR está inspirado principalmente en un estilo de Gobernanza tipo Cosmos, con influencia de las economías tokenizadas de stkAAVE y xSUSHI.   stkMKR es un token acuñable que representa una parte de MKR stakeado en la Gobernanza. Generalmente no es transferible; sólo puede acuñarse o transferirse entre contratos de votación o delegación. Esto permite una participación plena en la Gobernanza, mientras asegura que el MKR stakeado no puede ser comercializado en mercados de liquidez.   1248×654 36.5 KB   1248×1102 50.7 KB   1248×648 41 KB  Se han proporcionado parámetros iniciales de ejemplo y la propuesta está abierta al público para su discusión. Consulta la última edición del “Foro de un Vistazo” para encontrar post adicionales.   Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada  Revisión Estratégica Trimestral - Q4 2021   Foro | Video    Gobernanza y Riesgo | Ep. 181   Foro | Video    Conoce a tu Delegado | Ep.9 Ft. Hasu   Foro | Video      Próximas Llamadas  Focus On #6: Core Unit de Data Insights   Foro | Unete Passcode: 724756     Gobernanza & Riesgo   Unete | Agenda - Jueves a las 16:00 UTC   Horarios de Oficina de las Core Units   Unete | Gobernanza GovAlpha Q&As - Lunes 17:00 UTC  Únete | Seguridad Immunefi - Martes 00:00 UTC  Unete | Ingeniería de Protocolos - Martes 15:00 UTC  Unete | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Únete | Crecimiento - Miércoles 17:00 UTC  Únete | Comunicaciones de Gobernanza - Viernes 18:00 UTC    Enlaces Útiles Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario Publico de Llamadas | Calendario Publico de Votaciones y Eventos Suscripción para todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el Protocolo  Maker.   ¿Tienes algún Comentario? ¡Valoramos tu opinión! Llena nuestra encuesta para hacernos saber qué se nos está pasando por alto o que podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Créditos @Artem_Gordon @nothsa  Esta es una traducción libre del artículo original en inglés gracias a @joserjimz y @Sebix ",
                    "links": [
                        "https://pdfhost.io/v/gnhu3j6yN_Weekly_Relay__March_8_14_2022",
                        "https://forum.makerdao.com/t/makerdao-actual-expenses-vs-budget-january-2022/13720",
                        "https://forum.makerdao.com/t/call-for-responsible-budget-and-process/13816",
                        "https://forum.makerdao.com/t/rfc-budget-request-mip-break-on-going-from-expansion-budget-requests-budget-polling-to-rcv/13877",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/0/5/0574e50e26fadf7f6eeb113ca0bc210cca834cc9.png",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://forum.makerdao.com/t/auction-backed-dai/13011/11",
                        "https://forum.makerdao.com/t/premip-iam-for-surplus-buffer/11584",
                        "https://forum.makerdao.com/c/mips/proposal-ideas/21?order=activity",
                        "https://forum.makerdao.com/t/pre-mip-using-gyroscope-to-cut-through-dai-s-gordian-knot-its-usdc-dependency/8865",
                        "https://forum.makerdao.com/t/an-rwa-style-solution-to-replace-the-psm/8705",
                        "https://vote.makerdao.com/executive/template-executive-vote-mitigate-post-shutdown-flash-loan-vulnerability-march-9-2022?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-curve-steth-eth-onboarding-rate-limited-flapper-immunefi-bug-bounty-payouts-march-11-2022?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/post-shutdown-flash-loan-vulnerability-announcement-and-remediation-plan/13746",
                        "https://manual.makerdao.com/module-index/module-flash-mint-module",
                        "https://manual.makerdao.com/module-index/module-flash-mint-module",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://manual.makerdao.com/module-index/module-flash-mint-module",
                        "https://manual.makerdao.com/module-index/module-flash-mint-module",
                        "https://github.com/makerdao/flash-killer",
                        "https://etherscan.io/address/0x07a4BaAEFA236A649880009B5a2B862097D9a1cD",
                        "https://vote.makerdao.com/polling/Qmek9vzo",
                        "https://vote.makerdao.com/polling/QmagLVA2",
                        "https://vote.makerdao.com/polling/Qmdd4Pg7",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056",
                        "https://auctions.makerdao.com/flap",
                        "https://manual.makerdao.com/parameter-index/core/param-system-surplus-buffer",
                        "https://mips.makerdao.com/mips/details/MIP64",
                        "https://etherscan.io/address/0x3C32F2ca11D92a7093d1F237161C1fB692F6a8eA",
                        "https://etherscan.io/address/0x2BC5fFc5De1a83a9e4cDDfA138bAEd516D70414b",
                        "https://forum.makerdao.com/t/bounty-payout-request-for-immunefi-bug-5565/13545",
                        "https://vote.makerdao.com/polling/QmPpQ49p?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-fund-ambassadors-program-pilot/13199",
                        "https://vote.makerdao.com/polling/QmQD5PDm?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount-to-on-chain-poll/13649",
                        "https://vote.makerdao.com/polling/QmR6QMt6?network=mainnet",
                        "https://forum.makerdao.com/t/mip13c3-sp12-declaration-of-intent-invest-in-short-term-bonds/13084",
                        "https://vote.makerdao.com/polling/QmV3Lem7?network=mainnet",
                        "https://forum.makerdao.com/t/mip41c5-sp5-facilitator-offboarding/13005",
                        "https://vote.makerdao.com/polling/QmSBytmr?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp59-govalpha-budget-2022-23/13144",
                        "https://vote.makerdao.com/polling/QmXDh7RR?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152",
                        "https://vote.makerdao.com/polling/QmefuvKL?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp60-modify-govalpha-core-unit-mkr-budget/13145",
                        "https://vote.makerdao.com/polling/QmTnVxAL?network=mainnet",
                        "https://forum.makerdao.com/t/mip63c4-sp2-onboard-amend-keeper-network-keep3r-network/12748",
                        "https://vote.makerdao.com/polling/QmaEfChz?network=mainnet",
                        "https://forum.makerdao.com/t/mip63c4-sp2-onboard-amend-keeper-network-keep3r-network/12748/1",
                        "https://vote.makerdao.com/polling/QmRdVByP?network=mainnet",
                        "https://forum.makerdao.com/t/mip4c3-sp1-rapid-payment-for-small-bug-bounties-mip64-mip40c3-sp42-amendment/12869",
                        "https://vote.makerdao.com/polling/QmTvzCjL?network=mainnet",
                        "https://forum.makerdao.com/t/mip61-delegate-compensation/10640",
                        "https://forum.makerdao.com/t/weekly-relay-march-1-7-2022/13731",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-promote-mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount-to-on-chain-poll/13649",
                        "https://forum.makerdao.com/t/mip4c3-sp1-amend-mip64-to-clarify-critical-web-bounty-amount/13439",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-notional-finance/13782/1",
                        "https://github.com/notional-finance/contracts-v2/blob/master/audits/ABDK%20-%20Notional%20V2%2C%20Sept%201%202021.pdf",
                        "https://code4rena.com/reports/2021-08-notional/",
                        "https://github.com/notional-finance/contracts-v2/blob/master/audits/Certora%20-%20Formal%20Verfication%20Report%2C%20Nov%201%202021.pdf",
                        "https://etherscan.io/address/0x22341fB5D92D3d801144aA5A925F401A91418A05#readProxyContract",
                        "https://blog.notional.finance/understanding-liquidations/",
                        "https://forum.makerdao.com/t/d3m-risk-assessment/9353",
                        "https://forum.makerdao.com/t/compound-d3m-risk-assessment/12580",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768",
                        "https://forum.makerdao.com/t/signal-request-onboard-paxg/13768/1",
                        "https://twitter.com/MakerDAO/status/1503442865250263047",
                        "https://twitter.com/MakerDAO/status/1503442865250263047",
                        "https://twitter.com/MakerDAO/status/1503442865250263047",
                        "https://twitter.com/search?q=%23MakerUpDaits",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/MakerDAO/status/1503442865250263047",
                        "https://forum.makerdao.com/t/stkmkr-maker-staking-and-tokenomics-revision/13890",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/3/2/32332e3eeb2f4a37a6e4eb9f11210852382c69c4.png",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/b/d/bda65a2fcc2a2b535712828174a1e47faf691905.png",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/3X/3/1/316c6290c6897e4e6df757318474e640152b5078.png",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://forum.makerdao.com/t/quarterly-strategy-review-q4-2021-public-call-on-friday-3-11-22-5-00pm-utc/13734",
                        "https://youtu.be/ssTkOX9mL0U",
                        "https://forum.makerdao.com/t/governance-and-risk-181-thursday-march-10-17-00-utc/13764",
                        "https://youtu.be/GIa-7PnBfeA",
                        "https://forum.makerdao.com/t/meet-your-delegate-9-hasu-no-longer-postponed/12944",
                        "https://youtu.be/u7tT3HgAXqo",
                        "https://forum.makerdao.com/t/focus-on-6-data-insights-core-unit/13827",
                        "https://us02web.zoom.us/j/86221714672?pwd=R3hpWVF1eCt5TEpqa0dRVkRRMnpRQT09",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/",
                        "https://chat.makerdao.com/",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/Z2QAgywU2Sesm7Vy6",
                        "https://forum.makerdao.com/t/weekly-relay-march-8-14-2022/13906",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-marzo-de-2022/14181",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-mar-14-mar-25/14263"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.1314935064935066
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Marian",
                    "index": "#2",
                    "likes": "3",
                    "time": "18/03/2022-03:30:39",
                    "content": "Excelente aporte! Siempre que un proyecto, cualquiera que sea, comienza a expandirse en sus aspiraciones de crecimiento, surgen las discusiones en torno a los gastos. Los gastos e inversiones en un comienzo no muestran retornos, requiere su tiempo de maduración, y de ahí la importancia de elegir bien donde se gasta el dinero, en que, y quienes disponen de eso. Si se elige bien y se le da un buen uso, mas que un gasto habrá sido una inversión y los retornos van a justificar con creces haberlos hecho, sino se elige bien, habrá sido dinero mal gastado. Solo el futuro va a decir si el dinero gastado hoy ha sido bien o mal gastado, y resulta lógico que se den hoy éstas discusiones y muy sano creo yo, así se alerta tempranamente sobre posibles desvíos en el uso del dinero. Cuando se dispone de dinero ajeno, las criticas u observaciones tienen que ser bien recibidas y hay que hacer el doble del esfuerzo por disponer bien de ese dinero. Cuantos mas ojos controlando, mejor. Muy interesante debate se está dando. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#3",
                    "likes": "2",
                    "time": "24/03/2022-00:10:03",
                    "content": "Muy bueno gente! Felicitaciones. Muy interesante ver el crecimiento propuesto del presupuesto en las distintas CUs de um año a otro. Brutal. Da cuenta de la adopcion y enorme potencial del protocolo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 0.625
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-01-07-de-febrero-de-2022/13151",
            "title": "Relay Semanal: 01 - 07 de Febrero de 2022 ",
            "index": 13151,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NCO",
                    "index": "#1",
                    "likes": "2",
                    "time": "09/02/2022-22:30:59",
                    "content": " 1920×846 40.2 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas Maker (MKR) o DAI, poseas una Vault o quieras involucrarte más en la Gobernanza de MakerDAO, esta es tu parada rápida para estar al tanto de las actualizaciones del ecosistema de MakerDAO.  La versión pública en PFD en inglés se puede encontrar aquí.   Eventos Actuales  Esta Semana en Gobernanza  Comunidad Deep Dai-ve  Anotaciones para el Calendario  Links Útiles  ¿Tienes algún feedback?   Eventos Actuales  Controversia de la Investigación de Cumplimiento de KYC/AML La @SES-Core-Unit (Core Unit de Escalado de Ecosistemas Sostenibles) vino con buenas intenciones de anunciar su nueva subvención involucrando obligaciones de cumplimiento con know-your-customer (KYC, conoce a tu cliente) / anti-money laundering (AML, antilavado de dinero) centrándose en la guía actualizada del Grupo de Acción Financiera Internacional para los Proveedores de Servicios de Activos y Confirmaciones Virtuales. La subvención tiene como objetivo actuar como una investigación e identificar una selección de posibles herramientas AML para ser probadas. La comunidad cree que la subvención va en contra de la idea de, lo que creen los miembros de la DAO, que es el incumplimiento. Varias personas están preocupadas de que agregar una capa KYC promueva características similares a las de un banco para MakerDAO. El equipo responde a estas preocupaciones explicando que la subvención es solo una mera investigación para ayudar a promover una mayor descentralización y preparar a la comunidad contra posibles riesgos legales. Parte de la comunidad finalmente acordó confiar en el proceso y cree que debemos ser pacientes hasta recibir los resultados de la investigación. Otros malinterpretan los objetivos detrás del anuncio de la subvención. No obstante, @SES-Core-Unit tiene el mejor interés para la DAO para educar a todos y mejorar el éxito del protocolo.  Limitación de Tasas On-Chain del Flapper  La petición de señal y una reciente discusión expresó que la gran mayoría de la comunidad quiere establecer una Limitación de Tasas en el Flapper para continuar quemando MKR, que ahora se encuentra on-chain (la encuesta termina el 10/02 a las 4 PM UTC). La Core Unit de @Protocol-Engineering (Ingeniería de Protocolos) publicó más detalles con respecto a la Limitación de Tasas en el Flapper.  Esta es una enmienda simple que permite que la Gobernanza limite la cantidad de DAI que se permite subastar una sola vez, lo que se logra agregando dos nuevos parámetros al contrato del flapper; lid y fill…  Los siguientes pasos involucran una petición de señal adicional que determine el límite DAI correcto para ser subastado en una vez. Las soluciones ya han sido escritas por @hexonaut, que se someterá a una auditoría antes de la implementación y la aprobación de su encuesta on-chain.   Esta Semana en la Gobernanza  MIPs Actualización Semanal de MIPs #73  A partir de hoy y hasta el miércoles, la Ventana de Presentación Formal se encuentra abierta. La actualización de MIP proporciona todas las propuestas actualmente elegibles para presentación formal y las últimas propuestas de RFC. ¡Echale un vistazo! Las fechas de RFC y FS para referencia y las propuestas existentes se pueden ver en este ¡nuevo registro de propuestas (en proceso)! Próximas fechas:  ¡Las encuestas de ratificación se activan el lunes 14 de febrero! Las encuestas de ratificación se encontrarán activas durante dos semanas hasta el lunes 28 de febrero.   Votaciones Ejecutivas Compensación de Delegados Reconocidos, Incrementar el umbral del Apagado de Emergencia, Cambios en los Parámetros de MOMC, Correcciones en los flujos presupuestarios de las Core Units - 04 de febrero de 2022 Esta propuesta ejecutiva ha sido aprobada y los siguientes resultados fueron ejecutados:  Pago de Compensaciones a Delegados Reconocidos - Enero 2022 Según estas exitosas encuentas de la Gobernanza (1, 2) y la prueba en curso de compensación de delegados, se distribuyó un total de 54.752 DAI a ocho Delegados Reconocidos que se detallan a continuación:     DAI Transferido Delegado     12.000 DAI FlipFlopFlap Delegate LLC   12.000 DAI schuppi   12.000 DAI Feedblack Loops LLC   8.620 DAI MakerMan   4.807 DAI monetsupply   3.795 DAI ACREinvest   889 DAI JustinCase   641 DAI GFX Labs    Los detalles del desglose de la Compensanción de Delegados de Enero se puede encontrar en el foro de MakerDAOD aquí.  Incremento del umbral del Módulo de Apagado de Emergencia Según esta encuesta de la Gobernanza, se hicieron los siguientes cambios en el Módulo de Apagado de Emergencia (MAE):  Aumentar el umbral para activar el Módulo de Apagado de Emergencia por 25.000 MKR pasando de 75.000 MKR a 100.000 MKR.  Para más información, por favor revisa la Petición de Señal inicial en el foro de MakerDAO aquí. Para más información acerca de los cambios que se realizaron en el Módulo de Apagado de Emergencia, la Core Unit de Ingeniería de Protocolos ha creado un posteo en el foro de MakerDAO que se puede encontrar aquí.  Cambios en los Parámetros de MOMC Según esta encuesta de Gobernanza en la última propuesta del Mercado Abierto de MakerDAO, los siguientes cambios de parámetros se realizarán en el Protocolo de Maker si esta propuesta ejecutiva es aprobada.     Tipo de Vault Parámetros Cambio Viejo Nuevo     ETH-A Tarifa de Estabilidad -0.25% 2.5% 2.25%   ETH-B Tarifa de Estabilidad -2.5% 6.5% 4.0%   WSTETH-A Tarifa de Estabilidad -0.5% 3.0% 2.5%   WBTC-A Tarifa de Estabilidad -0.25% 4.0% 3.75%   WBTC-B Tarifa de Estabilidad -2% 7% 5%   WBTC-C Tarifa de Estabilidad -0.75% 1.5% 0.75%   UNIV2DAIETH-A Tarifa de Estabilidad -1% 2% 1%   UNIV2WBTCETH-A Tarifa de Estabilidad -1% 3% 2%   UNIV2USDCETH-A Tarifa de Estabilidad -1% 2.5% 1.5%   GUNIV3DAIUSDC2-A Tarifa de Estabilidad -0.25% 0.5% 0.25%   TUSD-A Tarifa de Estabilidad -1% 1% 0%   DIRECT-AAVEV2-DAI Tasa de Préstamo Objetivo (bar) -0.25% 3.75% 3.5%   GUNIV3DAIUSDC1-A Techo de Deuda Máximo (line) -400 millones de DAI 500 millones de DAI 100 millones de DAI   GUNIV3DAIUSDC2-A Techo de Deuda Máximo (line) +250 millones de DAI 500 millones de DAI 750 millones de DAI   GUNIV3DAIUSDC2-A Deuda Disponible Objetivo (gap) +40 millones de DAI 10 millones de DAI 50 millones de DAI     Correcciones en los flujos presupuestarios de las Core Units La Votación Ejecutiva anterior, contenía errores relacionados con los flujos de presupuesto de DAI para las Core Units de Ingeniería StarkNet y Finanzas Estratégicas. El error ha sido detallado por el equipo de Ingeniería de Protocolos en el foro de MakerDAO aquí. Para poder corregir este error, se han producido los siguientes cambios:  Los flujos de presupuesto de DAI actualmente configurados para las Core Units de Ingeniería StarkNet y Finanzas Estratégicas fueron cancelados.  412.085 DAI serán transmitidos a la Core Unit de Finanzas Estratégicas a 0xf737C76D2B358619f7ef696cf3F94548fEcec379 iniciando el 01-03-2022 y finalizando el 31-07-2022 como resultado de su última propuesta presupuestaria.  214.583 DAI serán transmitidos a la Core Unit de Ingeniería StarkNet a 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1 iniciando el 01-03-2022 y finalizando el 31-07-2022 como resultado de su última propuesta presupuestaria. Para conservar el acceso a los fondos del primer mes durante la actualización del flujo, transferimos 82.417 DAI a la Core Unit de Finanzas Estratégicas a 0xf737C76D2B358619f7ef696cf3F94548fEcec379. El monto de la transferencia de 82.417 DAI equivale a un mes de financiamiento según su propuesta presupuestaria más reciente y se realizó reclamando los fondos de la transmisión cancelada más una transferencia de la diferencia entre los 82.417 DAI y el monto reclamado. Para conservar el acceso a los fondos del primer mes durante la actualización del flujo, transferimos 42.917 DAI a la Core Unit de Ingeniería StarkNet a 0x6D348f18c88D45243705D4fdEeB6538c6a9191F1. El monto de la transferencia de 42.917 DAI equivale a un mes de financiamiento según su propuesta presupuestaria más reciente y se realizó reclamando los fondos de la transmisión cancelada más una transferencia de la diferencia entre los 42.917 DAI y el monto reclamado.   Encuestas de la Gobernanza Activas  Actualmente, se encuentran 3 encuestas on-chain de la Gobernanza activas:      Nombre de la Encuesta Votación Debate     Extender el Período de Prueba de Compensación de Delegados - 07 de febrero de 2022 Votar Debate   Traspasarse a TUSD-A - 07 de febrero de 2022 Votar Debate   Introducir una Limitación de Tasas en el Flapper - 07 de febrero de 2022 Votar Debate    Consulta la edición del 31 de enero del Relay Semanal para obtener más información acerca de las encuestas que han finalizado recientemente.  Encuestas del Visto Bueno de la Comunidad  Actualmente, no se encuentra ninguna encuesta del visto bueno de la comunidad on-chain.  Consulta el punto de vista de “De Un Vistazo” sobre los tipos de Vault actuales y sus parámetros en MakerBurn.  Peticiones de Señales Activas Avance de “Pago rápido por recompensas de errores pequeños” a la encuesta on-chain La señal cierra el 11 de febrero @psychonaut submitió una petición de señal consultando a la comunidad si deberían hacer presión para agregar la MIP4c3-SP1: Pago rápido por recompensas de errores pequeños (MIP64, enmienda MIP40c3-SP42) a una encuetsa on-chain. gbMKR, una propuesta para beneficiar a poseedores de MKR a largo plazo La señal cierra el 08 de febrero En respuetsa al feedback recibido en su propuesta más reciente, @paraficapital agrega unas mejoras e inicia una petición de señal para consultarle a la comunidad si MakerDAO debería implementar el gbMKR. [Petición de Señal] Aumentar el Techo de Deuda del Módulo de Estabilidad del Peg (PSM, Peg Stability Module) del Dólar Gemini (GUSD) a 60 millones de DAI  La señal cierra el 08 de febrero El recién incorporado PSM-GUSD tiene un techo de deuda de 10 millones de DAI y actualmente está cerca de su capacidad total. Para aumentar la diversificación de las reservas de stablecoins, GFX Labs quiere elevar el techo de deuda a 60 millones de DAI, lo que representaría aproximadamente el 32% del GUSD pendiente; esto está alineado con lo que podría llegar a cubrir el Buffer de Estabilidad en el peor de los casos. En un esfuerzo por impulsar esta propuesta, GFXlabs consulta a la comunidad si se debería elevar el techo de deuda del PSM-GUSD a 60 millones de DAI. Compensanción de Delegados Retroactiva de MakerMan La señal cierra el 18 de febrero La encuesta del Modificador de Rendimiento de Prueba de Compensación de Delegados Reconocidos fue aprobada, lo que llevó a cambios en el cálculo de las compensaciones de diciembre. Sin embargo, un delegado, @MakerMan, no recibió compensación alguna por noviembre y debería haber recibido 8.245 DAI si el nuevo modelo de compensanción se hubiera implementado en su momento. En respuesta a lo ocurrido, @prose11 envía una petición de señal consultando a la comunidad si el protocolo debe pagar a @MakerMan los 8.245 DAI por sus deberes de Delegado Reconocido en noviembre, calculados según el cambio de fórmula de diciembre.   Comunidad Deep Dai-ve  Tweet de la Semana   twitter.com    𓀣 Odysseas.eth 𓀢 @odysseas_eth  me: yeah, I can change her her: vat.sol   7:23 PM - 3 Feb 2022           120                14             Posteos del Foro Con 20 Core Units existentes, es difícil plasmar todas sus actualizaciones del mes pasado. Por suerte, las Actualizaciones Mensuales de las Core Units proveen un listado corto como también un PDF público que contiene un montaje completo de todas las actualizaciones para enero de 2022. Consulta el último “Foro de un Vistazo”  Artículos   Presentando el Panel de Riesgos de MakerDAO  @josolnik explora cómo el Panel de Riesgos de MakerDAO puede ser utilizado como una herramienta para ayudar a lograr una Gobernanza asistida por computadora y, en última instancia, impulsar la alineación de la comunidad respaldada por la toma de decisiones basada en datos.    **¡Las notificaciones automáticas de EPNS están activas! **  Las notificaciones automáticas para el Portal de la Gobernanza ¡están activas!. La gente de EPNS ha hecho un [video](https://twitter.com/epnsproject /status/1488920159553302530) que muestra cómo suscribirse al canal de notificaciones      Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada  Llamada de Gobernanza y Riesgo #177   Foro | Video      Llamadas de Esta Semana  Llamada de Discusión de Problemas #4 | Remoción de Core Units Facilitadores.   Forum | Link para Unirse      Llamadas de Esta Semana  Gobernanza y Riesgo   Link para Unirse | Agenda - Jueves a las 16:00 UTC   Horas de Oficina de las Core Units   Link para Unirse | GovAlpha - Preguntas y Respuestas de la Gobernanza - Lunes 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes 15:00 UTC  Link para Unirse | Crecimiento - Miércoles 17:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes 18:00 UTC    Links Útiles Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario de Llamadas Público | Calendario de Votación & Eventos Público Suscripción para todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el protocolo de Maker.   ¿Tienes algún Feedback? ¡Valoramos tu opinión! Haz nuestra encuesta para hacernos saber qué se nos está pasando por alto o podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Esta es una traducción libre del artículo original en inglés gracias a @NCO y @Joserjimz ",
                    "links": [
                        "https://forum.makerdao.com/t/grant-announcement-kyc-aml-compliance-research/12991",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn/12837",
                        "https://vote.makerdao.com/polling/QmagLVA2?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056",
                        "https://forum.makerdao.com/t/weekly-mips-update-73/13092",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://vote.makerdao.com/executive/template-executive-vote-recognized-delegate-compensation-raise-the-emergency-shutdown-threshold-momc-parameter-changes-core-unit-dai-budget-stream-corrections-february-04-2022?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/polling/QmPCbBu3?network=mainnet",
                        "https://vote.makerdao.com/polling/QmbvuhYH?network=mainnet#poll-detail",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://vote.makerdao.com/address/0xb21e535fb349e4ef0520318acfe589e174b0126b",
                        "https://vote.makerdao.com/address/0x845b36e1e4f41a361dd711bda8ea239bf191fe95",
                        "https://vote.makerdao.com/address/0x22d5294a23d49294bf11d9db8beda36e104ad9b3",
                        "https://vote.makerdao.com/address/0x45127ec92b58c3a89e89f63553073adcaf2f1f5f",
                        "https://vote.makerdao.com/address/0x4d3ac33ab1dd7b0f352b8e590fe8b62c4c39ead5",
                        "https://vote.makerdao.com/address/0xcdb792c14391f7115ba77a7cd27f724fc9ea2091",
                        "https://vote.makerdao.com/address/0xf60d7a62c98f65480725255e831de531efe3fe14",
                        "https://forum.makerdao.com/t/recognized-delegate-compensation-breakdown-january-2022/13001",
                        "https://vote.makerdao.com/polling/QmQSVmrh",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://forum.makerdao.com/t/signal-request-raise-threshold-for-emergency-shutdown-module/12208",
                        "https://forum.makerdao.com/t/moving-the-esm-threshold-increase-to-next-week/12895",
                        "https://vote.makerdao.com/polling/QmWReBMh",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-2022-01-27/12883",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://github.com/makerdao/dss-direct-deposit#configuration",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#maximum-debt-ceiling-line",
                        "https://manual.makerdao.com/module-index/module-dciam#target-available-debt-gap",
                        "https://forum.makerdao.com/t/correction-to-last-weeks-executive/13022",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP46",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP27",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP46",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP19",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP47",
                        "https://vote.makerdao.com/polling/QmNf5pe9?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-extend-the-delegate-compensation-trial/12686",
                        "https://vote.makerdao.com/polling/QmYj6Wzd?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-offloading-tusd-a/12814",
                        "https://vote.makerdao.com/polling/QmagLVA2?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn/12837",
                        "https://hackmd.io/1jc7XOxvRsSyGt09e0xwiw",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-advance-rapid-payment-for-small-bug-bounties-to-on-chain-poll/13017",
                        "https://forum.makerdao.com/t/mip4c3-sp1-rapid-payment-for-small-bug-bounties-mip64-mip40c3-sp42-amendment/12869",
                        "https://forum.makerdao.com/t/gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
                        "https://forum.makerdao.com/t/gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
                        "https://forum.makerdao.com/t/signal-request-raise-gemini-dollar-gusd-psm-debt-ceiling-to-60-million-dai/12961",
                        "https://forum.makerdao.com/t/signal-request-makerman-retroactive-delegate-comp/13051",
                        "https://vote.makerdao.com/polling/QmbKaHAv?network=mainnet#poll-detail",
                        "https://twitter.com/odyslam_/status/1489318673206685699?s=20&t=4aMTdMiRYbC3G5vRU4luqQ",
                        "https://twitter.com/odyslam_/status/1489318673206685699?s=20&t=4aMTdMiRYbC3G5vRU4luqQ",
                        "https://twitter.com/odyslam_/status/1489318673206685699?s=20&t=4aMTdMiRYbC3G5vRU4luqQ",
                        "https://twitter.com/odyslam_/status/1489318673206685699?s=20&t=4aMTdMiRYbC3G5vRU4luqQ",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-january-2022/13094",
                        "https://pdfhost.io/v/dRDKJgUsO_Monthly_Core_Unit_Updates__January_2022",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://maker.blockanalitica.com/",
                        "https://discord.com/channels/893112320329396265/897479130168324107/938839670639443978",
                        "https://twitter.com/epnsproject",
                        "https://forum.makerdao.com/t/governance-and-risk-177-thursday-february-03-17-00-utc/12977",
                        "https://www.youtube.com/watch?v=BZesImg9oUw",
                        "https://forum.makerdao.com/t/issue-discussion-call-4-core-unit-and-facilitator-offboarding/12985",
                        "https://us02web.zoom.us/j/82713713029?pwd=MTU3VTJBYVJBTEI3T0JRaHlXbVY1Zz09",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/",
                        "https://chat.makerdao.com/",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/Z2QAgywU2Sesm7Vy6",
                        "https://forum.makerdao.com/t/weekly-relay-february-1-7-2022/13103",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-jan-31-feb-11/13198",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-febrero-de-2022/13294"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "10/02/2022-20:12:49",
                    "content": "Gran trabajo chicos y muchas felicidades @Joserjimz @NCO    tremendo team de traducciones, ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-8-14-de-febrero-de-2022/13294",
            "title": "Relay Semanal: 8 - 14 de febrero de 2022 ",
            "index": 13294,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sebix",
                    "index": "#1",
                    "likes": "2",
                    "time": "18/02/2022-09:40:39",
                    "content": " Relay Semanal: 8 - 14 de febrero de 2022  1399×426 214 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas Maker (MKR) o DAI, poseas una Vault o quieras involucrarte más en la Gobernanza de MakerDAO, esta es tu parada rápida para estar al tanto de las actualizaciones del ecosistema de MakerDAO.  La versión pública en PFD en inglés se puede encontrar aquí.   Eventos Actuales  Esta Semana en Gobernanza  Comunidad Deep Dai-ve  Anotaciones para el Calendario  Links Útiles  ¿Tienes algún feedback?   Eventos Actuales  Preparación para ETHDenver ¡ETHDenver está aquí! Muchas Core Units, delegados y miembros de la comunidad estarán asistiendo. @gov-comms-core-unit (la Core Unit de Comunicaciones de la Gobernanza) está trabajando en colaboración con varias personas de MakerDAO en un documento compartido para llevar el registro de los eventos, charlas, personas y otros recursos. Hasta ahora, ¡creemos que van a estar asistiendo que muchos miembros de Ingeniería de Protocolos, Escalado de Ecosistemas Sostenibles, Crecimiento, Servicios de Ingenierías Colaterales y del equipo de GovAlpha!  ¡El suministro total del DAI llega a 10 mil millones!; ¡Competencia de Memes! Lo logramos: ¡El suministro total del DAI ha superado los 10 mil millones! Para esta ocasión especial, @makerburn anunció la oportunidad de ganar un NFT único y exclusivo en conmemoración al evento de los 10 mil millones de DAI en Makerburn. Durante las próximas dos semanas, todos se encuentran invitados a compartir su mejor meme para acompañar este glorioso momento y se aceptan múltiples propuestas por usuario (¡pero no espaméen!). El meme que tenga más likes proclamará su victoria y será propietario del NFT exclusivo. ¡Buenas suerte! La competencia termina el 2022-02-22T16:00:00Z   Esta Semana en la Gobernanza  Propuestas de Mejoras de Maker (MIPs - Maker Improvement Proposals) Actualización Semanal de MIPs#74  ¡Las Encuestas de Ratificación ya se encuentran vigentes! Las fechas de Solicitud de Comentarios (RFC - Request for Comments) y Presentación Final (FS - Final Submission) para referencia y las propuestas existentes se pueden ver en nuestro nuevo registro de propuestas (en proceso)! Las Encuestas de Ratificación para el Ciclo de la Gobernanza de Febrero ya se encuentran vigentes:¡Haz que tu voz se escuche! Si tiene cualquier consulta con respecto al proceso de votación en MakerDAO, este manual te podría ser útil.  Votaciones Ejecutivas No habrá ninguna votación ejecutiva hasta el 25 de febrero de 2022 debido al evento ETHDenver. GovAlpha estará emitiendo encuentas no ejecutivas, como de costumbre. Deberían haber muchos elementos para agrupar cuando se reanuden las propuestas ejecutivas el 25 de febrero. Comunícate con GovAlpha por cualquier consulta o inquietud. Chequea este anuncio para más información.  Encuestas de la Gobernanza Activas     Nombre de la Encuesta Votación Debate     Encuesta: Aumentar el Techo de Deuda del PSM-GUSD Votar Debate   Encuesta de Ratificación para Incorporar a 0xdeniz como Facilitador de DUX-001 - (MIP41c4-SP32) Votar Debate   Encuesta de Ratificación para Modificar el Presupuesto de la Core Unit de Riesgo, RISK-001 (MIP40c3-SP56) Votar Debate   Encuesta de Ratificación para Modificar el Presupuesto de la Core Unit - Servicios de Ingeniería Colateral, CES-001 (MIP40c3-SP57) Votar Debate   Encuesta de Ratificación de Enmiendas a la MIP55 (MIP4c2-SP16) Votar Debate   Encuesta de Ratificación para Modificar el Presupuesto de la Core Unit - Seguridad Immunefi (IS-001) (MIP40c3-SP58) Votar Debate   Encuesta de Ratificación para la Incorporación/Modificación de la Red Keeper - Tech-Ops (MIP63c4-SP1) Votar Debate   Encuesta de Ratificación para la Incorporación de la Core Unit de Maker Talent (MT-001) Votar Debate   Encuesta de Ratificación para la Asignación de Activos Intangibles (MIP60) Votar Debate    Consulta la edición del 7 de febrero del Relay Semanal para obtener más información acerca de las encuestas que han finalizado recientemente.  Encuestas del Visto Bueno de la Comunidad  Actualmente, no se encuentra ninguna encuesta del visto bueno de la comunidad on-chain.  Consulta el punto de vista de “De Un Vistazo” sobre los tipos de Vault actuales y sus parámetros en MakerBurn.  Peticiones de Señales Activas Compensanción de Delegados Retroactiva de MakerMan La señal cierra el 18 de febrero La encuesta del Modificador de Rendimiento de Prueba de Compensación de Delegados Reconocidos fue aprobada, lo que llevó a cambios en el cálculo de las compensaciones de diciembre. Sin embargo, un delegado, @MakerMan, no recibió compensación alguna por noviembre y debería haber recibido 8.245 DAI si el nuevo modelo de compensanción se hubiera implementado en su momento. En respuesta a lo ocurrido, @prose11 envía una petición de señal consultando a la comunidad si el protocolo debe pagar a @MakerMan los 8.245 DAI por sus deberes de Delegado Reconocido en noviembre, calculados según el cambio de fórmula de diciembre. Financiar a la prueba piloto del Programa de Embajadores La señal cierra el 25 de febrero El financiamiento del Programa de Embajadores, que provee recursos y materiales educativos a comunidades que no tienen el inglés como primera lengua, se ha visto interrumpido por la remoción de MKT-001 (Producción de Contenidos). @Kat ha tomado la iniciativa de encabezar el Programa sin encontrarse adjunto a una Core Unit y está buscando 25.000 DAI para completar la prueba piloto y proyectos asociados durante los próximos 3 meses. Ella consulta a la comunidad si MakerDAO debería financiar la prueba piloto del Programa de Embajadores. Asignar 20 millones al Protocolo de Liquidación Uniswap V2 MKR/DAI LP La señal cierra el 3 de marzo En respuesta a un debate reciente, @psychonaut cree que el método más simple para mejorar la liquidez de MKR es agregar acciones LP de protocolo de liquidación Dai/MKR a UniV2. Él consulta a la comunidad si Maker debería asignar 20 millones a un protocolo de liquidación LP UniV2 MKR/Dai y presenta su argumento con los pros y contras:  Pros:  Simple No es necesario esperar los rediseños de los tokenomics radicales que han tenido dificultades para encontrar un consenso(e.g., Motor Sagittarius, gbMKR, etc.) Mayormente ortogonal a MKR subastas flap  Ayuda a identificar un precio mínimo y máximo para el MKR tanto para las subastas flap como para las flop  Automáticamente compra a un precio bajo, vende a uno alto y captura el movimiento. Obtiene algún rendimiento sobre el capital inactivo que se encuentra en la reserva de buffer Muy eficiente con respecto al gas (i.e., setéalo y olvídate de él)  Contras:  Interfiere, potencialmente, con la capacidad de recaudar muchos DAI de las ventas de MKR La estrategia comercial es prácticamente opuesta a las subastas flop    Traigan de vuelta la quema de MKR - Parte II La señal cierra el 4 de marzo @ultraschuppi afirma que el reciente voto ejecutivo para deshabilitar temporalmente las Subastas deEexcedentes y la quema de MKR tenía intenciones de volver a la mecánica lerp original. Sin embargo, una encuesta on-chain agregó un Limitador de Tasas al Módulo Flapper. En respuesta, Schuppi pregunta a la comunidad si el protocolo debería regresar a la configuración de quemado parcial anterior, que se aceptó en noviembre, pero con las siguientes condiciones:  El Limitador de Tasas se instaló en la red principal; esto tomará un par de semanas. Se seteó una configuración inicial par el Limitador de Tasas.    Comunidad Deep Dai-ve  Tweet de la Semana     twitter.com    Maker @MakerDAO  gm   4:07 PM - 8 Feb 2022           340                33             Posteos del Foro Manual Operativo de Maker - versión en español Gracias a @GovAlpha-Core-Unit, en colaboración con el Programa de Embajadores, ¡el Manual Operativo de Maker ahora se encuentra disponible en español! Todas las secciones se han traducido excepto los índices de Parámetros y Módulos, los cuales se encontrarán disponibles a la brevedad. Consulta el último posteo de “Foro de un Vistazo” para encontrar Posteos del Foro adicionales  Artículos    MakerDAO lanza la mayor recompensa por errores de la historia con una recompensa de 10 millones de dólares - “MakerDAO anunció que comenzará a ofrecer una recompensa máxima de $10 millones a los hackers de sombrero blanco y especialistas en seguridad cibernética que señalen amenazas de seguridad legítimas en sus smart contracts… la cual es la recompensa por errores más grande en la plataforma Immunefi.”     Reuniones y Eventos  Grabaciones de las Llamadas de la Semana Pasada  Llamada de Gobernanza y Riesgo #178   Foro | Video    Llamada de Discusión de Problemas #4 | Remoción de Core Units Facilitadores.   Foro | Video      Gobernanza y Riesgo   Link para Unirse | Agenda - Jueves a las 16:00 UTC   Horas de Oficina de las Core Units   Link para Unirse | GovAlpha - Preguntas y Respuestas de la Gobernanza - Lunes 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes 15:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Link para Unirse | Crecimiento - Miércoles 17:00 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes 18:00 UTC    Links Útiles Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario de Llamadas Público | Calendario de Votación & Eventos Público Suscripción para todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el protocolo de Maker.   ¿Tienes algún Feedback? ¡Valoramos tu opinión! Haz nuestra encuesta para hacernos saber qué se nos está pasando por alto o podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Esta es una traducción libre del artículo original en inglés gracias a @NCO y @Sebix ",
                    "links": [
                        "https://www.ethdenver.com/",
                        "https://docs.google.com/spreadsheets/d/1bF6SMpF3oYpAgKdufcjatjGVrKR2hNDmRLzjyC89x1U/edit?usp=sharing",
                        "https://forum.makerdao.com/t/10-000-000-000-dai-reached/13106",
                        "https://makerburn.com/#/moments/7",
                        "https://forum.makerdao.com/t/weekly-mips-update-74/13234",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://www.ethdenver.com/",
                        "https://forum.makerdao.com/t/planned-executive-proposal-update/13149",
                        "https://vote.makerdao.com/polling/QmWPYU9c?network=mainnet",
                        "https://forum.makerdao.com/t/signal-request-raise-gemini-dollar-gusd-psm-debt-ceiling-to-60-million-dai/12961",
                        "https://vote.makerdao.com/polling/QmR3DeK2?network=mainnet",
                        "https://forum.makerdao.com/t/mip41c4-sp32-facilitator-onboarding-to-dux-001-0xdeniz/12559",
                        "https://vote.makerdao.com/polling/Qmb6o8ua?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp56-modify-core-unit-budget-risk-001/12587",
                        "https://vote.makerdao.com/polling/Qmb6o8ua?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp57-modify-core-unit-budget-collateral-engineering-services-ces-001/12578",
                        "https://vote.makerdao.com/polling/QmTRMFXz?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp57-modify-core-unit-budget-collateral-engineering-services-ces-001/12578",
                        "https://vote.makerdao.com/polling/QmaBYzea?network=mainnet",
                        "https://forum.makerdao.com/t/mip40c3-sp58-modify-core-unit-budget-immunefi-security-core-unit-budget-is-001/12598",
                        "https://vote.makerdao.com/polling/QmbsvbsA?network=mainnet",
                        "https://forum.makerdao.com/t/mip63c4-sp1-onboard-amend-keeper-network-tech-ops/12739",
                        "https://vote.makerdao.com/polling/QmTKSjCM?network=mainnet",
                        "https://forum.makerdao.com/t/mip39c2-sp28-adding-maker-talent-core-unit-mt-001/12075",
                        "https://vote.makerdao.com/polling/QmWDna6r?network=mainnet",
                        "https://forum.makerdao.com/t/mip60-intangible-asset-assignment/10319",
                        "https://forum.makerdao.com/t/relay-semanal-01-07-de-febrero-de-2022/13151",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-makerman-retroactive-delegate-comp/13051",
                        "https://vote.makerdao.com/polling/QmbKaHAv?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-fund-ambassadors-program-pilot/13199",
                        "https://i.pinimg.com/originals/7a/f9/08/7af9082a3a102a39617ebcda86a4d65e.jpg",
                        "https://vote.makerdao.com/polling/QmYk1XN5?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-allocate-20m-to-protocol-owned-uniswap-v2-mkr-dai-lp/13150",
                        "https://forum.makerdao.com/t/sagittarius-engine/10852",
                        "https://forum.makerdao.com/t/signal-request-gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756",
                        "https://manual.makerdao.com/parameter-index/surplus-auction",
                        "https://manual.makerdao.com/parameter-index/debt-auction",
                        "https://forum.makerdao.com/t/signal-request-bring-back-the-mkr-burn-part-ii/13146",
                        "https://vote.makerdao.com/polling/QmUqfZRv?network=mainnet#poll-detail",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056",
                        "https://forum.makerdao.com/t/rate-limited-flapper/13056#next-step-setting-lid-3",
                        "https://twitter.com/MakerDAO/status/1491081189758844933?s=20&t=YpVNZZdlMO1BD1oKwnsuEg",
                        "https://twitter.com/MakerDAO/status/1491081189758844933?s=20&t=YpVNZZdlMO1BD1oKwnsuEg",
                        "https://twitter.com/MakerDAO/status/1491081189758844933?s=20&t=YpVNZZdlMO1BD1oKwnsuEg",
                        "https://twitter.com/MakerDAO/status/1491081189758844933?s=20&t=YpVNZZdlMO1BD1oKwnsuEg",
                        "https://forum.makerdao.com/t/maker-operational-manual-spanish-version/13233",
                        "https://manual.makerdao.com/",
                        "https://manual.makerdao.com/v/mom-spanish/",
                        "https://forum.makerdao.com/tag/forum-at-a-glance",
                        "https://cointelegraph.com/news/makerdao-launches-biggest-ever-bug-bounty-with-10m-reward",
                        "https://forum.makerdao.com/t/governance-and-risk-178-thursday-february-10-17-00-utc/13136",
                        "https://www.youtube.com/watch?v=rHIQFRdqa1M",
                        "https://forum.makerdao.com/t/issue-discussion-call-4-core-unit-and-facilitator-offboarding/12985",
                        "https://www.youtube.com/watch?v=Mkbf6xD6BzM&t=1s",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com/",
                        "https://chat.makerdao.com/",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/Z2QAgywU2Sesm7Vy6",
                        "https://forum.makerdao.com/t/weekly-relay-february-8-14-2022/13239",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-14-feb-25/13462"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.391483516483516
                }
            ]
        }
    ],
    "group_index": "667"
}