{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/temperature-check-guidelines-for-mkr-compensation/17170",
            "title": "[Temperature Check] Guidelines for MKR compensation ",
            "index": 17170,
            "category": [
                "Governance"
            ],
            "tags": [
                "mkr-compensation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#1",
                    "likes": "1",
                    "time": "11/08/2022-01:04:10",
                    "content": "There is currently no general, voted upon guideline for how MKR compensation is handled. Nothing on how much each CU should receive or under what circumstances. Typically, compensation outside the approved annual budget would be standardized and tied to the general financial state of the organization. Right now, CUs all use somewhat different guidelines and there is nothing tying it to the overall health of the DAO. In this situation, CUs have significant disparities depending on the various deals they have made with the DAO. The amount of MKR given as compensation can fluctuate wildly as well with price. I propose establishing guidelines that tie this MKR to, at a minimum, the overall financial state of Maker and would provide standardized payouts for all CUs. I have put together a few polls to gather feedback on what should go into those guidelines and to provide space for comments from relevant stakeholders.    Should MKR compensation for CU be tied to the financial state of Makerdao?  Yes No     0 voters        Should MKR compensation for CU be tied to the price performance of MKR?  Yes No     0 voters        Should MKR compensation be standardized such that the conditions and percentage of pay is the same for all CUs?  Yes No     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/10",
                        "https://forum.makerdao.com/t/mip40c3-sp79-mkr-compensation-for-starkenet-engineering-core-unit-sne-001/17042/29"
                    ],
                    "GPT-summary": "The author proposes establishing guidelines for MKR compensation for CUs, tying it to the overall financial state of Maker and providing standardized payouts for all CUs. The post includes polls to gather feedback on what should go into those guidelines and to provide space for comments from relevant stakeholders. The post also invites feedback and questions from third parties.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.067261904761905
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/08/2022-01:32:35",
                    "content": "Additional Notes The main benefit of equity compensation is that you can defer income through vesting, which is a big money saver for a startup. However, the short lockup of MKR in proposals defeats this purpose. Unvested MKR compensation is functionally no different from Dai as the two can easily be exchanged. So additional guidelines should be considered for vesting length. A common argument for equity compensation is incentive alignment. However, most workers have a small impact on the price of MKR and are unable to significantly it price by doing their job well. Instead, MKR compensation ties a portion of their pay to the general performance of the DAO and to the whims of the market. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.215909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "5",
                    "time": "11/08/2022-02:09:34",
                    "content": "Definitely recommend checking out the mkr-compensation tag articles - Topics tagged mkr-compensation. We have had 3 attempts (at least formal-ish ones) to come up with org-wide guidelines. But in a decentralized org, coming up with policies that will fit for any direction or DAO composition that might come about in the future is a struggle. As GovAlpha our lives would be much easier if we could all agree on a “fair” structure. But unlike a traditional org we do not have control or monitoring for how CUs are structured internally. While the notion of radical transparency and having to convince token holders for any changes does make for a much more interactive workforce, supporting pseudonymity has been an important value for the DAO and that comes with a lot of challenges around compensation.  All this isn’t to discourage you trying to come up with a system but to provide some context on the problem space. I think everyone would win if there is a unified structure (the amount of cognitive overhead alone we could save all stakeholders  ). If they have time to weigh in on it, I bet @juan @Planet_X @Aes @LongForWisdom could provide a lot more concrete insights on the blockers, though I do believe you’d get quite a bit of context just from reading the tagged posts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.115384615384616
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#4",
                    "likes": "3",
                    "time": "11/08/2022-04:03:27",
                    "content": "dude use SF the best  make random number (80) no limit for reprice no limit renewal lenientest terms 2 months avg wait 8 months multiply 80*3>>>240 tell dao cut budget for other cu  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#5",
                    "likes": "2",
                    "time": "11/08/2022-09:51:50",
                    "content": "Voted ‘no’ to tying MKR CU comp to either the financial state of Maker or the price performance of MKR. The latter is particularly unfair IMO: as you note @CodeKnight, most workers cannot impact the price of MKR no matter how well they do their job. In addition, as we all know, MKR’s price is subject to the mercurial whims of the broader market. That means that tying any kind of compensation to the price of MKR is arbitrary and unfair (not to mention ineffective as a KPI). The other issue that springs to mind is that retaining key staff is particularly important during the tough times. I don’t think we want to self-sabotage in those moments by dropping/cutting MKR compensation, particularly given it would be extremely unlikely for adverse market conditions to be due to a CU’s job performance. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.753703703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#6",
                    "likes": "0",
                    "time": "11/08/2022-13:06:25",
                    "content": "The purpose of tying MKR compensation to financial health is not just to incentivize good performance. It’s to provide a standardized way to cut cost during bear market and share the wealth during good ones. Right now, we have no standardized way to cut cost during bad times or reward employees during good ones. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.404761904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "3",
                    "time": "11/08/2022-21:44:14",
                    "content": "Ideas I have been rattling around for 1-2 years now posted elsewhere (will post links to numerous forum posts on the subject as I find them but the ideas I post here now).  In the past I felt it was critical to align CU/contractor interests by having a component of MKR vesting tied to whether Maker was revenue negative or positive.    I originally wanted NO MKR vesting if Maker wasn’t revenue positive.  I think having some minimum vest is reasonable and the rest being a bonus based on Maker performance which would align revenue positive state with MKR bonus. Lately came up with idea of having some component of the MKR vest be also tied to contractors taking some of their DAI salary to buy MKR on open market and put it in their vesting contract.  So say this month you are due to vest 6 MKR.   Have it so the last 2 of the 6 are coupled with the contractor taking their DAI pay and buying 2 MKR on open market (or clicking a button) and stuffing it in their vesting contract.   MakerDAO uses this slated DAI and smart contracts to buy on the open market. A rather new idea (not generally used but also is useful) is this idea of having annual or bi-annual performance awards.   Like CU facilitators and/or delegates can nominate individuals for the award, with given reasoning backed by verifiable info and those nominated maybe get a moderate bonus (maybe in DAI and not MKR - like $100-500DAI for a dinner, or $1000-5000 DAI for a vacation) and the top 3 getting say some extra DAI and/or some MKR.   The point here is to recognize and reward exceptional performance.  Now this could just devolve into likeability contest, or who is most in public eye, but some bounties could be put up for contractors/delegates that if completed in their delegate or contractor roles would nominate them.   etc. One way to determine the bonus MKR vesting for the period was to take daily DAI positive revenues and buy MKR for the monthly vest calculation.  This way protocol is paying directly for the additional bonus vest. Another idea was to take some fraction of liquidation DAI profit and directly toss this into the MKR buy buffer and one could burn 1/2 and put the other 1/2 into MKR vest pools.   While I think this would create guaranteed burn during high stress times (ideal to do when markets and MKR price is down btw) this method might not send the best message.  The pros here is contractor incentive alignment with MKR holders generally, and good ways to pay for as well as calculate the bonus MKR being vested.   The cons are that DAI that could be tossed to surplus buffer (and hence growth of risk in portfolio and overally protocol return)… The whole point here with these ideas was to align Maker CU contractor interests with protocol net revenues, and to create a mechanism for decentralized MKR buying with DAI that was beneficial to everyone. Leave these for posterity if people start looking for ideas on how to alter even some component of the MKR contractor vest and additional pay for it as well as a reasonable way to guarantee some burn over time irrespective of the state of the SB (i.e. taking a fraction of liquidation profits and slating it for MKR buy to burn and to vest). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.720523088023088
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#8",
                    "likes": "1",
                    "time": "19/08/2022-08:23:46",
                    "content": "Thank you CodeKnight. We’re seeing right now how important a uniform approach is. I’d love to see more thinking going into this and especially into finding an approach more similar to what options do for startup contributors → Explosive upside if things go really well, while little cost to the enterprise if things go south. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.221230158730159
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "18/11/2022-14:24:15",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}