{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/price-of-mkr-against-eth-is-hitting-all-time-low/14859",
            "title": "Price of MKR against ETH is hitting all time low ",
            "index": 14859,
            "category": [
                "Governance"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#1",
                    "likes": "6",
                    "time": "29/04/2022-11:32:40",
                    "content": "We need an emergency plan. We are losing big time against the 4pool and 2pool. We need to really fix this token to beat them. Otherwise we gonna see our DAI disappear. Where are the core units, where is rune, let’s gather and do some code magic. ",
                    "links": [],
                    "GPT-summary": "The author of the post is expressing concern about the price of MKR against ETH and the need for an emergency plan to fix the token and beat the competition. They are calling for the core units and Rune to come together and work on a solution. The post is asking for feedback and constructive criticism on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#2",
                    "likes": "2",
                    "time": "29/04/2022-11:42:07",
                    "content": "Yes its a hard time being a MKR holder, stay strong. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.354166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/04/2022-11:55:15",
                    "content": "It’s really hard indeed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.541666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "5",
                    "time": "29/04/2022-12:49:30",
                    "content": "    scream:  Where are the core units, where is rune, let’s gather and do some code magic.      ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#5",
                    "likes": "2",
                    "time": "29/04/2022-13:04:27",
                    "content": "Wagmi, In this hard times we need guidance from @happiness-core-unit  dont look at the price look at the memes, where are the memes, in such dark days we need something to laugh, can we have a meme section here at the forum maybe exclude the sourcecred from it. NEW MIP incoming. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.994696969696969
                },
                {
                    "author_link": "https://forum.makerdao.com/u/superTricycle",
                    "index": "#6",
                    "likes": "1",
                    "time": "29/04/2022-13:12:17",
                    "content": "I also follow degen spartan on twitter ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#7",
                    "likes": "11",
                    "time": "29/04/2022-13:41:39",
                    "content": "degen is just goading us into pumping his massive MKR bags  Competition is definitely increasing and sentiment on defi tokens overall remains pretty bad. But I think the most important thing we can do is continue executing in a methodical way, not getting caught up in short term narratives or changing strategy too often. Dank memes also help. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.28125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#8",
                    "likes": "3",
                    "time": "29/04/2022-14:15:28",
                    "content": "I know I know, it just some panic. But this half joke and half truth. I am really considering selling my big bag, we really need to talk, gather and focus on what is really our incentive on the token Maker. I am ready to take a plane to where ever the core units and Rune are. Let’s do this a fam. Some deep talks, with some drinks about the future of the DAI. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.2592592592592595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#9",
                    "likes": "14",
                    "time": "29/04/2022-14:52:30",
                    "content": "Agreed – especially on avoiding distractions, i.e., proposals that are bound to lose (Makeshire Hathaway or taking ETH into the SB), recreating the wheel (Dao Singularity), indulging greenwashed fantasies (Clean Money) and spending money on bacchanals (DaiVinity). People complained about the Foundation, but they delivered MCD, Governance, a fully functioning protocol churning out $100mm a year in profit and returned the remaining dev fund, then valued at nearly $500mm. That was less than a year ago. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#10",
                    "likes": "2",
                    "time": "29/04/2022-15:00:12",
                    "content": "    Tosh9.0:  People complained about the Foundation, but they delivered MCD, Governance, a fully functioning protocol churning out $100mm a year in profit and returned the remaining dev fund, then valued at nearly $500mm. That was less than a year ago.   Wow. Really puts the value destruction in focus ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.527777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#11",
                    "likes": "0",
                    "time": "29/04/2022-15:29:10",
                    "content": "This is just the beginning. After the merge when Eth becomes deflationary and MKR is still static the ratio will drop even more. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#12",
                    "likes": "1",
                    "time": "29/04/2022-15:36:06",
                    "content": "That is correct, we must focus on the fundamentals, on the growth that Maker has had and has yet to demonstrate. The true potential of Maker is still a long way off. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#13",
                    "likes": "3",
                    "time": "29/04/2022-15:48:48",
                    "content": "    AliceinMKRland:  Wow. Really puts the value destruction in focus   Especially if you squint and look past the verbose forum posts, harebrained ideas, “calls to action” and the hours of Dai Singularity lectures put out nearly every day and see what the community had dropped into its lap. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.15
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#14",
                    "likes": "4",
                    "time": "29/04/2022-15:52:52",
                    "content": "I think it should be a healthy balance. Even back in the foundation, there were discussions over some of the directions and sometimes big pushes whether internal or external were needed. For example, it was not until Maker protocol was hit hard by March 2020 crash when it really started to onboard more collaterals such as USDC and WBTC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.50462962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#15",
                    "likes": "1",
                    "time": "29/04/2022-15:55:34",
                    "content": "The same for multichain strategy. We are now more open to it but back then it was considered heresy to even consider that expect for maybe optimism ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#16",
                    "likes": "0",
                    "time": "29/04/2022-15:58:57",
                    "content": "Those are good points, for sure, but aren’t what I’m talking about with “harebrained” proposals or CUs that seemingly have major overlap or do the same thing… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.578125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#17",
                    "likes": "7",
                    "time": "29/04/2022-16:26:41",
                    "content": "We have a lot of true allies in the space from other teams and protocols. Many of them want to support DAI and MKR above all else. We have created the only decentralized stablecoin to date that has provably survived a vicious bear market. When push comes to shove, just about any player would opt to hold DAI over anything else through a true bear. I know it takes time to do things right. We can’t rush launches on L2 and elsewhere to keep up with every other protocol that takes shortcuts… but every day we delay that deployment gives other players room to fill the void that was waiting for us. We may have the superior product, but if it’s not available, the demand is filled by others. I’m not sure what the timeline still looks like on those rollouts, but hopefully sooner than later. There is a massive L1 priced-out crowd that is just waiting on us.  I also think we have one of the most promising frameworks for integrating RWA in ways that leave other protocols years behind us. While I can’t claim to fully understand all the nuances of how everything will operate in practice, I’m very optimistic about 6S and what’s been under construction for several years now. I would like to see something material produced from RWF though too for all of our investment in that direction.  I understand that 2018 PTSD is real… but it’s incredibly disappointing to see everyone just bailing and giving up at a market cycle bottom. Whether any of you want to believe me or not, this is the most massive bear trap in crypto history. Our strongest hands… who held through BT, one of our most trying times… are just capitulating at every opportunity… into zero liquidity… as if everything that we’ve built and worked on has no promise.  I will say though, and I understand this point has been debated heavily and a decision was made… we’re going for “Aggressive Growth.” It’s a valid model… but is it the model that many of our longest holders and supporters signed up for? Maybe the burn was not efficient. Maybe it could have been optimized, maybe it could have been reduced, phased out, or something… but it was the revenue distribution model we had. We took it away at a market cycle bottom, and replaced it with… nothing concrete… a promise to develop something later. As an investor… I, and I’m sure many others who were happy with what was in place before feel rugged in a sense. I’m told “the burn doesn’t work”… that it had no effect on price. I don’t believe it was meant to have a very visible effect at all times. An infinitesimal burn over time would have returned value over the course of years. We all have long time horizons. But maybe it didn’t work at visibly raising the price and returning value… it DID work for retaining holders. During liquidity crunches, I, and I’m sure many others, became accustomed to seeing MKR perform, or at least maintain price while everything else nuked. It’s the last asset that goes on the chopping block. Now? Market nukes? We nuke harder… no burn? No reason to hold. This time, maybe it’s MKR that goes to bail out a bad trade.  We can’t retain investors indefinitely without a solid revenue distribution model. I’m not saying we should or shouldn’t restart the burn, but It’s hard to keep up with all the visions. Maybe one will work and will be better… but leaving everyone in this purgatory does none of us any good. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.499291383219955
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#18",
                    "likes": "14",
                    "time": "29/04/2022-16:47:29",
                    "content": " MKR has value to me : ) … and to all of us! That’s what matters   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#19",
                    "likes": "4",
                    "time": "29/04/2022-17:55:14",
                    "content": "1 MKR = 1 MKR, all you need to know. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#20",
                    "likes": "10",
                    "time": "29/04/2022-18:12:26",
                    "content": "1 MKR = 1,000,000,000 BKR, all you need to know. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#21",
                    "likes": "3",
                    "time": "29/04/2022-18:14:52",
                    "content": "I’m a unit bias maximalist so I endorse this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#22",
                    "likes": "2",
                    "time": "29/04/2022-18:24:07",
                    "content": "Let Elon buy 100% of the Mkr to unleash its full potential as soon as possible and that’s the end of it.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#23",
                    "likes": "1",
                    "time": "29/04/2022-20:08:53",
                    "content": "Sure we should really hold tight. But my call was different. Look, these degens out there are losing a lot value, literally I could hire a plane, hire a castle and organize a Maker conference and it still won’t cover the loss. So what about a Maker conference where we invite the brightest minds in the world, from the deep jungle in Africa to the light cities of NY and South Korea / Japan / and more. Again, let’s gather, let’s call Bob, John, and even all Urbit devs, Rune and all core units. The biggest day of DeFi. Three-day conference where all core units will do elevator pitch on how the treasury is spend and what the move forward is. Let’s do it fam. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.015306122448979
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#24",
                    "likes": "1",
                    "time": "29/04/2022-20:12:39",
                    "content": "Also, let’s take a snapshot of all balance MKR, only those who had a balance is invited. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yingjie34",
                    "index": "#25",
                    "likes": "6",
                    "time": "29/04/2022-20:31:56",
                    "content": "Because you stop the MKR burn!! Restart the burning ASAP please! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#26",
                    "likes": "1",
                    "time": "29/04/2022-22:19:31",
                    "content": "Could be worse   Screen Shot 2022-04-30 at 10.16.48 AM1012×454 37.2 KB   Screen Shot 2022-04-30 at 10.16.56 AM910×246 15.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#27",
                    "likes": "2",
                    "time": "29/04/2022-23:19:01",
                    "content": "I don’t think we need an “emergency plan”. No need to panic. Markets under-appreciating MKR is an opportunity. What’s the hurry, you’re holding for the long-term anyway, right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#28",
                    "likes": "2",
                    "time": "29/04/2022-23:46:22",
                    "content": "    aburban90:  I understand that 2018 PTSD is real… but it’s incredibly disappointing to see everyone just bailing and giving up at a market cycle bottom. Whether any of you want to believe me or not, this is the most massive bear trap in crypto history.   BTFD  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#29",
                    "likes": "1",
                    "time": "30/04/2022-00:57:12",
                    "content": "touche – the SPELL fire. Total dump (and Daniele should be in jail). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#30",
                    "likes": "2",
                    "time": "30/04/2022-08:35:09",
                    "content": "When this type of post comes up, sign of bottom? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#31",
                    "likes": "1",
                    "time": "30/04/2022-13:54:44",
                    "content": "On the Curve side, yes, it’s something I’ve mentioned in several posts. It’s something inevitable, the liquidity of maker merma verses centralized stablecoinms and 3rd gen stablecoins. Also PSM is a direct competition to curve and other existing liquidity groups. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.975
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#32",
                    "likes": "2",
                    "time": "30/04/2022-21:26:31",
                    "content": "Def bottomy … but exact bottom?  I do somewhat vividly remember the fear throughout our community late January, when we decided to shut off the burn (for better, or for worse). The urgent sentiment shift to prep for the impending Black Swan… I mean, it was an understandable mindset to adopt. Macro was (is)… let’s say, not looking too optimistic. Ofc, that day was the exact market bottom for crypto… so far. Macro/tradfi is still taking a beating, but imo the charts look good. If you’re not in Netflix!  If trading purely against sentiment, I don’t think I’ve ever seen more consensus about market  direction than now.  image864×444 20.6 KB  … and within our own community? This is possibly the most negative sentiment I’ve ever seen. It’s truly beyond me why it’s this way for us right now. We have so much coming up that will propel us 10x, 100x, and tbh…. 500-1000x. Bailing at levels below 2017 highs? I mean… I understand PTSD hits hard… but cmon lol MKR may possibly be one of the best sentiment counter trade investments in the space right now.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.137851731601732
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#34",
                    "likes": "2",
                    "time": "30/04/2022-22:59:27",
                    "content": "I just want to say, that sometime I am really feeling dirty to be an investor in Maker. There is no respect, no friendly talk. But why ? The investors put there own money in a project that they believe it. And ofc its not always about fairy tales and rainbows, the investors is also searching for profit, but its not 100%. For me it’s like nice to be in profit 60% and 40% in like beating those centralized banked system from 60 years ago and free people up. I accept some loss but still ok if we can protect this diamond. He left crypto, but Andre Cronje from (YFI) was the only one who really was thinking with the investors instead of against him. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.856250000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#35",
                    "likes": "7",
                    "time": "01/05/2022-03:36:34",
                    "content": "I really feel you but do want to clarify Maker Core Units, the Maker community as well as other supporters are all working to improve and expand the Maker protocol. Sure, some might disagree with others about how to best execute that goal but such discussions always have been open and also needed in such DAO. The Maker protocol doesn’t spend time or resource on “shilling” MKR in speculate way, and can imagine where you thought on “disrespectful to investors” come from. However, many members have been here helping the protocol for years during both cycles of bear and bull. And if you zoom out the price for years long horizon , you can see the hard work eventually paid off. I remember “Frog Nation” bragging about how their team is for the investors and spent a lot on maintaining such clout and perception. However, as you can see, without real progress and commitment, such illusion is easily broken. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.477777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#36",
                    "likes": "0",
                    "time": "01/05/2022-07:46:06",
                    "content": "It’s not just MKR - quite a few tokens have the same issue. It’s just the market doing market things. See for example tokens like UNI, SNX and so many more. Consider this your buying opportunity and wait for strategic patience to pay out!  Screenshot 2022-05-01 at 3.44.45 PM2592×1462 287 KB   Screenshot 2022-05-01 at 3.45.15 PM2602×1468 311 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#37",
                    "likes": "0",
                    "time": "01/05/2022-17:47:36",
                    "content": "UNI and SNX are worthless shitcoins with only silly memetics and no value accrual; MKR is much different if we only came to our senses and turned the burn back on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 3.9166666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#38",
                    "likes": "1",
                    "time": "01/05/2022-19:37:30",
                    "content": "    AstronautThis:  It’s not just MKR - quite a few tokens have the same issue. It’s just the market doing market things. See for example tokens like UNI, SNX and so many more.    image1316×887 167 KB  “The whole market is down, not just us!” I have no hate for SNX UNI AAVE and other DeFi 1.0 projects, but afaik they are all structured fundamentally differently from MKR. I’m speaking quite broadly here… They may all be built well, and have proven to generate consistent revenue for their protocols. But, many/all of them offer token emissions, either as direct incentives, or as a share of revenue. That creates constant sell pressure. Also, while I have nothing but the highest respect for Stani and AAVE, after the rebrand from ETHLend, many holders are still deeply deeply in profit. I do believe for all that AAVE does, it’s actually quite under priced,  but the sell pressure is undeniable. Given the uncertainty of macro conditions, it’s not unreasonable to lock in profits if they exist. Here at MKR, very few of us are in meaningful profit after seven years. If you bought anywhere in 2021 or at the 2017 highs, you are down. If you accumulated the 2018-2020 bear, you are sitting on about 3-4x… in this space? Especially given the time that’s elapsed… you didn’t make anything. If you’re selling here, you’re not selling to lock in profits. You’re selling because of fear. Fear of further downside, fear of the “Marco” Boogeyman, fear that our DAO can’t its sh*t together. Fear of reliving 2018 PTSD. These are emotional decisions imo. In the moment, it’s very difficult to not let emotions get the best of you and impact your decision making. No one is immune. —- If you step back and look at what Maker really is… it’s not some DEX or other generic lending protocol. Maker and DAI are the bedrock of DeFi. It’s cliche… but, we are the pioneers of discovering how a DAO works in practice, not just on paper. There is no instruction manual for this, and the rest of the space always looks up to us with the highest respect, seeking ways to learn from us in setting up their own DAOs. Is what we’re doing right now the most efficient? No, probably not. It may very well be that corporate hierarchical structures work better…maybe not. What’s important is that we do not just abandon our convictions because times got a little difficult. As much as we argue and quibble on forums and polls… DAI carries on, maintaining its peg and full solvency. It’s our flagship product, and the whole world is ever grateful to us. This realization came to me on my latest trip to Rio. In LatAm, they don’t just see DAI as a novel fad. They need it, to preserve their wealth, and the fruits of their labor, in societies w/ capital controls, rarely solvent banks, and a rapidly inflating currency… DAI is a necessity, not a luxury. —- No hate on AAVE or Uni… but these products not as unique as MKR. There are dozens of DEX’s each with their own pro’s and con’s… and there are dozens of variations of secondary lending markets like AAVE. Those pose no real existential threat to anyone. MakerDAO? Let’s be careful with capitulating on what we”ve worked so hard to build and accumulate for so many years. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.660503725299644
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#39",
                    "likes": "15",
                    "time": "01/05/2022-19:58:50",
                    "content": "First off I’m really happy we’ve started to discuss the price of MKR in relation to ETH instead of the price of MKR in $ as that is too closely correlated to the price of ETH to be meaningful. Sadly the effect of the price we’re seeing now is to be expected since we started to put the credibility of the burn mechanic in play. Allow me to illustrate with the following graph:  MKR ETH burn1323×622 46.4 KB  It is no wonder that currently MKR is falling similarly to other DeFi coins. That is because at the moment MKR lacks the value proposition it used to have. To an outside investor considering buying MKR he not only has to consider the risk that the protocol will deliver on the promises of growth but also if those promises are ever going to benefit MKR holders rather than other contributors of the protocol. People that used to be passionate about MKR has left us. I personally know people who has lost interest in the protocol and divested their funds from Maker. Anecdotal but indicative. We currently acknowledge the difficulty of getting MKR holders to participate in governance and thus we can conclude that MKR holders in general is not obtaining the token for its utility in governance. I have been an advocate for the burn since I became a delegate. Look into any of the debates on this issue or any vote and you will see where I stand. Killing investor confidence is detrimental to the valuation of any endeavor. It doesn’t help our case that at the same time expenses has increased and we as a community keep voting in favor of initiatives that is very easy to interpret from the outside as insiders rewarding themselves with protocol funds. Our surplus buffer currently sits at 70M which is quite a bit over the 54M Risk claims is necessary at our current collateral levels. I know many wants this to be much bigger, but that is implicitly saying we as a protocol knows better than those that have invested in us how to invest. The vast majority of MKR holders do not work directly for Maker or the CUs and has limited visibility into the work they are producing. They are however watching our numbers and those keep pointing in the wrong direction. Promising riches in the future for investment now requires trust, and I think we’ve done too little to consider the MKR holders trust and interests in the choices we have taken and are now facing the consequences of said choices. We are also in the unfortunate position that it is a lot harder to regain trust than it is to lose it in the first place. Hopefully we can implement changes that will restore confidence and once again make us an attractive token to invest in. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.388737468671679
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#40",
                    "likes": "0",
                    "time": "05/05/2022-20:14:59",
                    "content": "SNX has an value acrual mechanism. You can mint sUSD with Eth and the fees for that are redistributed to SNX stakers or get subtracted from the debt pool (not clear on the details). Plus trading fees also go to SNX stakers. And ofcourse the token inflation. Its not just a governance token. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#41",
                    "likes": "0",
                    "time": "08/05/2022-11:46:40",
                    "content": "It’s interesting UST and Luna having problems right now, and we are also being punished by the market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9642857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#42",
                    "likes": "5",
                    "time": "08/05/2022-23:24:16",
                    "content": "I mean in this market, almost all are falling unfortunately ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.96875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#43",
                    "likes": "8",
                    "time": "09/05/2022-03:16:33",
                    "content": "Very light analysis here but for what it’s worth I find no correlation between burning and MKR price historically. Doesn’t matter whether you look at USD values and USD price or burned tokens to ETH price. If anything there is a slight (non-significant) negative correlation. Here is the query in case I missed something:  MKR Price vs Burn (USD cost vs USD price and token amount vs ETH price)  dune.com_embeds_678221_1258985_ba32fb70-1096-4886-8abc-5680319014842522×1478 232 KB   dune.com_embeds_678221_1273590_03b422f8-eead-4619-846a-ba38b06fede02522×1478 243 KB   30-day trailing correlations vs Price (USD Burn vs USD Price and token burn vs ETH price)  dune.com_embeds_678221_1260154_b40d6f04-a125-47ef-b928-b17e431558432522×1478 290 KB   dune.com_embeds_678221_1273597_a9a270ad-ec49-4fa3-a0e7-de2d557aec602522×1478 317 KB   Scatter charts (USD Burn (log) vs USD Price and token burn (log) vs ETH Price)  dune.com_embeds_678221_1260135_a360a089-cc8b-4648-8765-e0cd0214d3542522×1478 185 KB   dune.com_embeds_678221_1273596_0d82e55f-6169-4462-b727-ddeac0b7189b2522×1478 178 KB  Edit: pasted nicer charts with bigger legends as per popular demand ",
                    "links": [
                        "https://forum.makerdao.com/t/mkr-almost-below-900/15748/19",
                        "https://forum.makerdao.com/t/mkr-almost-below-900/15748/18"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.680952380952381
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#44",
                    "likes": "1",
                    "time": "11/05/2022-13:18:56",
                    "content": "It is clear to me from these charts that it is an unnecessary expense, the price returns to a point of return, there is no demand for the token, no demand, no burning is worthwhile. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#46",
                    "likes": "2",
                    "time": "14/05/2022-19:44:12",
                    "content": "This didn’t age well. DAI survived and the 4pool with the UST is gone. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#47",
                    "likes": "4",
                    "time": "14/05/2022-22:51:31",
                    "content": "Well, Maker won the “war” but the price is still lower. So it’s still a valid concern. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#48",
                    "likes": "1",
                    "time": "15/05/2022-15:25:02",
                    "content": "But seriously   twitter.com    Doo | StableNode @GoblinTown @DooWanNam  The fact that failed $LUNA marketcap is somehow still ranked higher than $MKR is a reason why we can't have nice things... https://t.co/PvBFNYH8ob   3:22 PM - 15 May 2022           2            ",
                    "links": [
                        "https://twitter.com/DooWanNam/status/1525859234360922113?t=6F-XTVzP7tQUepeHfvj2Bw&s=19",
                        "https://twitter.com/DooWanNam/status/1525859234360922113?t=6F-XTVzP7tQUepeHfvj2Bw&s=19",
                        "https://t.co/PvBFNYH8ob",
                        "https://twitter.com/DooWanNam/status/1525859234360922113?t=6F-XTVzP7tQUepeHfvj2Bw&s=19"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.020833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#49",
                    "likes": "4",
                    "time": "15/05/2022-15:35:53",
                    "content": "    Alefcripto:  It is clear to me from these charts that it is an unnecessary expense, the price returns to a point of return, there is no demand for the token, no demand, no burning is worthwhile.   Burning was what kept the price of MKR above $2k. In practice, it was rather inefficient… largely symbolic. Nevertheless, it was an important narrative to many of our oldest holders, myself included. I would venture to say that nearly all price action below $2k was due to a sell-off from our community that did not appreciate the shift in narrative. Given the recent price action, though (rather bullish) I’d like to believe that everyone that wanted to sell, already sold. Question remains… who bought up all that cheap MKR? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.726648351648351
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#50",
                    "likes": "1",
                    "time": "15/05/2022-16:58:49",
                    "content": "With the recent Terra event it was demonstrated that despite everything, Maker is a solid protocol, everyone who sees potential will have bought that cheap MKR. I understand the narrative part, we are driven by beliefs and I understand that psychological part, but we can change that narrative for something that will motivate the holders, I don’t know, maybe the next dai or maker next release in the l2, the RWA, I think there are a lot of reasons to believe in the protocol. Maybe it would be good to review the incentives of the hodlers from a benefits point of view, for example the staking of MKR or some active form of participation in the DAO that would benefit the holders. You have to think outside the box (I don’t think I’m the right guy for this). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.56926406926407
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#51",
                    "likes": "2",
                    "time": "15/05/2022-17:24:49",
                    "content": "the butt hurt is strong with Do ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#52",
                    "likes": "8",
                    "time": "15/05/2022-17:56:34",
                    "content": "I would like to add that some of the current Core Unit members selling their vested MKR as soon as it becomes available isn’t helping the price either. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#53",
                    "likes": "0",
                    "time": "15/05/2022-18:02:07",
                    "content": "Maybe don’t vest for “sell in may, go away” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#54",
                    "likes": "5",
                    "time": "15/05/2022-18:05:19",
                    "content": "While I’d love MKR to go up and to see everybody just HODL   , let’s try to not create a regime of pressure… Everybody is free to sell their MKR for whatever (good for them) reason they may have. If anything, we might switch to a longer vesting mechanism in the future, if that’s seen as a solution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#55",
                    "likes": "1",
                    "time": "15/05/2022-18:35:11",
                    "content": "Not just butt, it hurts my heart that I might ask for cancer insurance next time ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#56",
                    "likes": "3",
                    "time": "17/05/2022-10:14:49",
                    "content": "    aburban90:  I would venture to say that nearly all price action below $2k was due to a sell-off from our community that did not appreciate the shift in narrative.   This is a hypothesis that would imply much higher degree of correlation between burn and price. I know this is an unpopular thing to say and maybe there is some second order effect but at first glance didn’t see any meaningful relationship ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.767857142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#57",
                    "likes": "5",
                    "time": "17/05/2022-13:29:25",
                    "content": "    adcv:  This is a hypothesis   Yes, of course… it’s just my own theory, not based on data or anything of the sort. I’m fully aware that, to date, burning has been rather inefficient and could… should be improved upon. Burning was largely symbolic, at least in its current form. Still, it was the promise of a revenue distribution model that many investors, myself included, had based their investment thesis on for MKR. They held fMKR for years patiently while watching other protocols in the space explode in price around them. IMO, because we have sound fundamentals, a passionate, hardworking team,  an awesome community, and a revenue model. Regardless of its actual performance on affecting the MKR price, removing the burn at that exact time, IMO, was as symbolic as the burn itself. II believe many of our supporters, who would have never sold otherwise, were disappointed with the shift in narrative and took the opportunity to leave. Given how thin the liquidity for MKR is, to begin with… an exodus into an illiquid market would not look pretty… (and it didn’t! ) Anyway, those are just my opinions. I’d like to believe that the holders that  did remain are not looking to sell any further. They are with us for the long haul.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.570378151260504
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#58",
                    "likes": "2",
                    "time": "17/05/2022-19:00:37",
                    "content": "I think what is missing from your analysis is the trust component. The direct effect on MKR price from burning would naturally be small as the amounts burned relative to the market cap is small. As such, measuring burning on an off as a discrete event isn’t likely to produce a strong correlation. Though when there is large pullbacks the effect can be quite noticeable as we saw in January. What we instead need to examine is the effect on sentiment. The belief and trust that the value proposition will hold and lead to increased pay-off in the future. Anyone that invests in a start up doesn’t think, or at least should be comfortable with the idea, that payoff isn’t immediate. However, an investor has a reasonable expectation to be paid down the line. Any messing around with the burn mechanic that doesn’t replace it with another value proposition harms that trust. Any discussion of rising the SB (which delays burning) hurts that trust. Any temporary suspensions of the burn mechanic that turns out to be permanent hurts that trust badly. It’s a cumulative effect. To an outsider it doesn’t matter if we have every intention of turning on the burn, because an outsider will have to trust that the community actually will. It also becomes an open question on “when” will we actually turn the burn on (or introduce an alternative value proposition). Measuring this sentiment is far more nebulous than tracking a binary burn on/off metric. It needs to consider the wider discussions within the protocol and on other places. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.992157974300832
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#59",
                    "likes": "6",
                    "time": "17/05/2022-19:40:59",
                    "content": "I think you make some interesting points, though I might wonder if a hypothesis that is too broad to measure is a hypothesis at all.  Investor trust Capital allocation Returning funds to investors      JustinCase:  Anyone that invests in a start up doesn’t is or at least should be comfortable with the idea that payoff isn’t immediate. However, an investor has a reasonable expectation to be paid down the line.   I am very interested in merging the burn into a broader discussion about capital allocation and how to meet investor expectations for value realization. My view is that we are still in an investment-heavy phase of growth. Any allocation to returning capital now vs later carries an opportunity cost orders of magnitude greater than just actually the cost of burning.  2048×1163 233 KB  Burning any amount of capital in this stage of sector development would be akin to Amazon starting dividends and buybacks somewhere between 1995 and 1999. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.696338383838384
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#60",
                    "likes": "5",
                    "time": "21/05/2022-00:43:49",
                    "content": "Really not here to fud. But let this sink in MKR holder:  image1284×875 109 KB  134 people maintaining Maker protocol, which is really great. They are receiving 54m DAI. Seems really high if you ask me. What do the MKR got ? Nothing, but worse we are the last resort if everything is collapsing. We really need to figure this out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#61",
                    "likes": "1",
                    "time": "21/05/2022-01:34:42",
                    "content": "Yes Budgets are exploding, but not all of it is going to the individual CU members, there are other expenses too! I think those are also without MKR vesting, vesting causes a dilution from the normal MKR Holder, also not a great development ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.4921875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/scream",
                    "index": "#62",
                    "likes": "0",
                    "time": "21/05/2022-01:38:49",
                    "content": "Ok. Do you know where the information is about the vested MKRs ? Its very obfuscated on the website. I think we need a very clear tokenomics on the website. Its crazy that we need to digg this information of from twitter and other sources. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.50625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#63",
                    "likes": "0",
                    "time": "23/05/2022-08:47:04",
                    "content": "    scream:  Ok. Do you know where the information is about the vested MKRs ? Its very obfuscated on the website.   Vested MKR is transferred from the Maker Pause Proxy (Treasury) to the individual CUs. For example, this is a sample transaction where 261.4 MKR was transferred to PE-001. You can look up the Pause Proxy balance over time using etherscan by entering the Pause Proxy address and the MKR token contract address into the tool. I assume you were looking at https://makerburn.com? If you have a suggestion on presenting this data differently, please give @makerburn a shout out! ",
                    "links": [
                        "https://etherscan.io/tokencheck-tool",
                        "https://makerburn.com"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving information related to proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#64",
                    "likes": "7",
                    "time": "23/05/2022-10:11:06",
                    "content": "    MakerDAO Actual Expenses vs Budget - March 2022 Core Units       All,  Please see below for the March update of the monthly Core Unit expenses, including a forecast for the subsequent three months.  As you can see from the below table, DAI expenses increased to 2.5M in march (0.2M vs prior month), but 164k lower than had been forecasted 30 days ago. Our forecasted expenses are expected to increase to 3.5M/month by April, a 40M annual run-rate (4M higher run-rate vs what we forecasted in February). Estimated annual Oracle gas costs are 3.6M (vs 5.1M last month…     These posts from Strategic Finance have the most accurate overview. Fwiw i think budgets are high, but you want that during growth. However, we need to take steps to get more clear value out of the workforce. There’s incredible talent and some massive projects being done, but they are not being properly supported by MKR holders. One option is to just cut budgets and scale back aspirations for the protocol and DAO. But personally I believe we are better off focusing on more growth and use what we have today as a springboard to get to the next level, and that’s what I’m pushing for with the Endgame Plan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.976315789473684
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#65",
                    "likes": "1",
                    "time": "23/05/2022-12:29:20",
                    "content": "Yes. If you want to grow and bring in more value, you have to spend more. The old saying still holds true “you gotta spend money to make money”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#66",
                    "likes": "1",
                    "time": "01/06/2022-20:52:38",
                    "content": "Well I am for more growth for sure, even if it costs short term gains. I just dont see any growth. I see the opposite of growth. Whats the metric that determines growth? If we discount the 70% Dai wrapped USDC there is like 2 Billion income producing Dai. Maybe my understanding of what growth entails is too simplistic. But if there is less profitable Dai but more costs I feel like we are not growing. For sure there are good plans that might lead to growth once implemented. But in the measurable metrics Maker is not growing. Amazon didnt make any profits in the beginning which is totally fine. But did their revenue shrink did they start selling less books and items during their growth period for a while? In bearmarkets people try to flee into stable coins usually. USDC is growing… Dai is not. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.847222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#67",
                    "likes": "4",
                    "time": "01/06/2022-22:07:03",
                    "content": "Just a few thoughts on that. Financial services largely acts with the economy - it broadly grows and shrinks as the economy does. I suppose books might act differently? As such, in finserv, one would probably be more focused on growing relative market share to competitors than too much focus on uncontrollable direct revenue elements (as it does ebb and flow with economy to a certain degree). Which would mean, of course, your question on USDC prominence has merit - I don’t know the answer - but I suspect community members has some views on this. (I believe the End-Game plans has some of the solution to this question of how to continue to grow market share). Amazon is an amazing company in their own right, but did benefit from positive winds of online user growth and behavior changes towards e-commerce (you can argue amazon helped accelerate these positive winds with their great products of course!). My point just being that the broad growth of the crypto economy/DeFi might be the principal long term revenue driver for a key DeFi infrastructure piece such as Maker. As long as there is relevant continued market share growth of Maker (and enough cash to pay the bills etc), the long term story of DeFi growth should get you the gross revenue growth desired. Obviously, as with Amazon, it would be wonderful if great Maker products or MetaDAOs could help accelerate this broad market growth. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.982305194805195
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#68",
                    "likes": "4",
                    "time": "01/06/2022-22:38:38",
                    "content": "    Ber10:  Amazon didnt make any profits in the beginning which is totally fine. But did their revenue shrink did they start selling less books and items during their growth period for a while?   Amazon took the tortoise  route. Bezos decided early-on that a slow and steady pace to profitability would ultimately win the race. The same slow and steady rabbit vs. tortoise approach has declared DAI as the clear winner in the decentralized stablecoin realm. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.4907407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ber10",
                    "index": "#69",
                    "likes": "1",
                    "time": "02/06/2022-18:54:52",
                    "content": "At what point would you judge there is no sufficent growth for the money that is being spent (Which is currently basically everything Dai makes)? 71% of Dai are backed by centralized stable coins. For me growth is if percentage backed by centralized stable coins decreases and Dai increases. Or profits grow. 5 Billion Dai minted with Ether is more valuable than 30 Billion Dai which are 90% minted via PSM. And as a MKR holder, growth only has meaning, if at some point profits go to MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#70",
                    "likes": "0",
                    "time": "02/06/2022-19:39:44",
                    "content": "What does it matter if Dai the biggest decentralized stablecoin when Dai is a distant 4th in the overall stablecoin market? Even if someone was a decentralized stablecoin purist, they certainly wouldn’t touch dai with its large USDC exposure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.410714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#71",
                    "likes": "2",
                    "time": "02/06/2022-19:48:11",
                    "content": "    CodeKnight:  Even if someone was a decentralized stablecoin purist, they certainly wouldn’t touch dai with its large USDC exposure.   “Decentralised” is the key property/feature of DAI. If that does not attract interest by itself (of course paired with a strong peg, liquidity, etc) then DAI has no future. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.8619047619047615
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#72",
                    "likes": "0",
                    "time": "02/06/2022-19:53:50",
                    "content": "Dai may be decentralized, but its tied to centralized stablecoins. Frankly, I doubt decentralization was ever a big draw for users, but even if it was Maker gave that up with the USDC PSM. Thats not to say things are hopeless for Dai. Just that its competing on equal grounds with centralized providers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#73",
                    "likes": "0",
                    "time": "02/09/2022-01:54:37",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}