{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/using-snapshot-to-improve-signaling-and-polls/3810",
            "title": "Using Snapshot to Improve Signaling and Polls ",
            "index": 3810,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#1",
                    "likes": "15",
                    "time": "26/08/2020-01:27:52",
                    "content": "Hello! I recently came across snapshotlabs whilst participating in YAM governance  Snapshot allows for off-chain vote signaling.  It is 100% gasless.  Anyone can participate by creating proposals and voting for them. You are able to select start and stop times, as well as a block height which will be used to gather on-chain data for the front end (eg how much MKR you held at a given block).  I thought this could be helpful in giving some weight to forum polling and maybe replace on-chain polling, if the stars align .   High gas fees have been a deterrent for our current polling system, and it would allow for more MKR insight in our casual forum polls. It looks like Balancer and YFI are also using this tool.  So I thought we could start the conversation and see what questions would need answering for the Maker community to adopt off-chain signaling. I’ve been chatting with Fabien in their discord, and invited him to help answer any questions we may have. Front-end: https://github.com/balancer-labs/snapshot Back-end https://github.com/balancer-labs/balancer-gov/tree/develop/server ",
                    "links": [
                        "https://snapshot.page/#/yam",
                        "https://vote.balancer.finance/balancer",
                        "https://twitter.com/iearnfinance/status/1298215344004358145",
                        "http://discord.snapshot.page",
                        "https://github.com/balancer-labs/snapshot",
                        "https://github.com/balancer-labs/balancer-gov/tree/develop/server",
                        "https://forum.makerdao.com/t/feature-analysis-of-crypto-governance-systems/3811/3",
                        "https://forum.makerdao.com/t/maker-relay-ep-11/4041",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-107-thursday-august-27-16-00-utc/3754/2"
                    ],
                    "GPT-summary": "The author of the post is explaining the benefits of using Snapshot for off-chain vote signaling and how it could improve the current polling system. The post also invites feedback and questions from the community and extends an invitation to the creator of Snapshot to answer any questions. A 3rd party provides constructive criticism and asks questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.614285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#2",
                    "likes": "8",
                    "time": "26/08/2020-02:08:53",
                    "content": "Hi here! Fabien from Balancer Labs / Snapshot Labs. Feel free to ask any questions i’d be happy to answer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#3",
                    "likes": "1",
                    "time": "26/08/2020-02:18:32",
                    "content": "I guess I’d be curious to know how many active forum members are actually large mkr holders. It would be best if the 2 were one and the same, but personally I don’t hold a significant amount of mkr. I have a strong suspicion that most active members on this forum are not “whales”. Not suggesting forum votes weighted by mkr is an incorrect decision, but it may dramatically affect the outcomes of signalling polls. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.207251082251082
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#4",
                    "likes": "1",
                    "time": "26/08/2020-05:07:01",
                    "content": "Well, it’s important for governance polls. And we might get a lot more participation with gasless voting. Yeah, maybe not everyone’s a whale. But there’s a lot of holders. Actually 27k addresses hold MKR, top 1k address holds 17.66 MKR which is worth more than $10k. All the shrimps and dolphins can make a difference for governance polls. And it’s not a stretch to say that some of those holders are active here.  But it is an interesting mix currently, our signal requests that we have now combined with governance polls on chain which is 1 coin 1 vote. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.425925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#5",
                    "likes": "0",
                    "time": "26/08/2020-10:27:23",
                    "content": "I’d be interested to contrast the security differences between between our current on-chain polling and snapshot.  @fabien are there any points of centralization, trust assumptions, or operator risks with using off-chain polling? Also, am I thinking correctly that this will work even when tokens are deposited into our governance contract? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#6",
                    "likes": "7",
                    "time": "26/08/2020-11:30:15",
                    "content": "@Jtathmann with Snapshot there isn’t any on-chain settlement, it’s what we call soft-voting or vote signaling. The proposals and votes are just signed messages using the eth_sign format and stored on IPFS. The signed messages are made available for the user through the interface so that’s easy for him to verify it. Here is an example of a signed message for vote on a Balancer governance proposal: https://gateway.pinata.cloud/ipfs/QmeVwGtp4YxKaCGZM3jPSd7VKXTEAxXj74Xjnn1c8F4ifh You can copy paste the message payload here to verify it:    MyCrypto    MyCrypto MyCrypto is a free, open-source interface for interacting with the blockchain.      There isn’t any smart contract risk because there isn’t any smart contract. The result of the proposal votes is easy to verify and hard to contest. We use a server that we call “hub” to upload user signed messages to IPFS. We also use it to store an index of IPFS hashes for all the proposals per tokens and all the votes per proposals on a database to make interface load faster. We plan on making it possible for anyone to run a hub but at the moment i would say that it’s a point of centralization.  Also, am I thinking correctly that this will work even when tokens are deposited into our governance contract?  Currently votes will be considered if the voting address is also the address who hold MKR or a selected token. If the governance contract is holding the token for the users there might need some small change on Snapshot to make it work. ",
                    "links": [
                        "https://mycrypto.com/sign-and-verify-message/verify",
                        "https://mycrypto.com/sign-and-verify-message/verify"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7767857142857135
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#7",
                    "likes": "5",
                    "time": "26/08/2020-17:13:18",
                    "content": "I’ve create a space on the demo instance here: https://beta.snapshot.page/#/maker Feel free to play with it, you can create proposal and vote for them using MKR (for free!). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#8",
                    "likes": "0",
                    "time": "27/08/2020-01:14:16",
                    "content": "This is awesome @fabien. Any suggestions on how this voting method could be further decentralized/trust minimized? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#10",
                    "likes": "3",
                    "time": "27/08/2020-03:41:37",
                    "content": "@Aaron_Bartsch Yes, i got these 2 options to minimize trust: A: One option is to link each IPFS signed messages to each others, sort of we don’t need an index to get the full list of hashes, we can just load IPFS hashes in serie from the interface and remove the hub completely. But because it’s loaded in serie one by one, it might be very slow and not scale well when loading hundred of votes. B: The other option is to make it possible for anyone to run a hub. The hub db may not need to know ordering, its designed more like a graph database similar than IPFS. The client should have a way to set the hub url (or array of hub url) of his choice, and hubs should be able to talk to each others and stay sync. I could ask few protocols that are using Snapshot to run their own hub to keep some kind of trusted network. I would prefer go for plan B, the project Snapshot is very new there must be others options to explore, i’m confident that with time we will be able to reduce that trust needed, happy to discuss if you have some suggestions or ideas. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.30409090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#11",
                    "likes": "2",
                    "time": "27/08/2020-11:36:13",
                    "content": "Very cool. Option B definitely makes the most sense. I could envision Maker governance electing several hub maintainers to shepherd this infrastructure kind of like a multi-sig. One more question. Is it possible to add comments to a signed transaction so voters could anonymously comment as to why they voted a certain way? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.418303571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#12",
                    "likes": "2",
                    "time": "27/08/2020-12:04:06",
                    "content": "@Aaron_Bartsch Great! Now there isn’t any way to comment on a vote but that’s something we want to implement in the short term. There will be a way for anyone to comment (even if you haven’t voted) and comments will be linked to votes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#13",
                    "likes": "0",
                    "time": "27/08/2020-16:46:59",
                    "content": "I’m now thinking, how would this work with MKR in the dschief contract? Is it possible to sign a transaction if your MKR is in another contract? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#14",
                    "likes": "1",
                    "time": "27/08/2020-18:08:38",
                    "content": "@Aaron_Bartsch It will not work if the address who sign the message doesn’t hold the token defined on Snapshot, from my understanding staking MKR in the contract doesn’t mint another token so it will not work out of the box, but we can imagine having custom logic to be implemented for specific use case like MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#15",
                    "likes": "2",
                    "time": "04/09/2020-19:29:41",
                    "content": "Here is an update from our friend @fabien.  Snapshot now using MKR locked up in DSChief You can test it here! Strategy setup: https://github.com/balancer-labs/snapshot/pull/58/files#diff-d45e9fc817dd9f4950aa966ea99f5b56R10-R22 And this is the DSChief strategy: https://github.com/balancer-labs/snapshot/pull/58/files#diff-1b6072936c35d66437c3197aadb614bb ",
                    "links": [
                        "https://github.com/balancer-labs/snapshot/pull/58/files#diff-d45e9fc817dd9f4950aa966ea99f5b56R10-R22",
                        "https://github.com/balancer-labs/snapshot/pull/58/files#diff-1b6072936c35d66437c3197aadb614bb",
                        "https://forum.makerdao.com/t/maker-relay-ep-11/4041"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#16",
                    "likes": "0",
                    "time": "05/09/2020-14:12:18",
                    "content": "Hey @fabien, what causes the Oops, wrong timestamp error… and how fix? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#17",
                    "likes": "0",
                    "time": "05/09/2020-14:17:09",
                    "content": "@fabien  Hm, I think I usually vote with 0x273BF243219D31c4096c00e156c1d8a8ff9731D9. I use the two address hot/cold setup. When I try to vote, it says that I have 0 MKR. The regular vote site shows 400 MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#18",
                    "likes": "0",
                    "time": "05/09/2020-15:52:39",
                    "content": "Is snapshot censorship resistant? I don’t think how it could without doing anything on chain, so it’s probably very helpful to have on the forum but not a suitable replacement for on chain signalling. The other problem with it is that it won’t be supported by custody providers and any non-standard smart contract as it requires an EOA (Ethereum accounts owned by a cryptographic key instead of say a smart contract). I’m not sure how much better we’d actually be with this mechanism. How is it working out for balancer labs? Are large institutional holders participating in it? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3464285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#19",
                    "likes": "1",
                    "time": "05/09/2020-17:32:58",
                    "content": "@Jtathmann Did you used Metamask? @psychonaut When i call the function “deposits” on DSChief for this address “0x273BF243219D31c4096c00e156c1d8a8ff9731D9” i got a response of 0 MKR, this is most likely the reason why you don’t see the MKR in the interface. Is there some kind of delegation? There might be a logic that i am missing, if someone can explain to me i could implement it on the strategy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#20",
                    "likes": "0",
                    "time": "05/09/2020-17:33:33",
                    "content": "@spin I will not say it’s censorship resistant if we don’t have the network of hubs that i’ve discussed in earlier messages here but the proposals and votes are stored on IPFS, the hub expose all the IPFS hashes, anyone can already pin and replicate the content. I’m not sure to understand the issue with custody providers, is it something that is working already in Maker on-chain governance?  How is it working out for balancer labs? Are large institutional holders participating in it?  Snapshot is a side project that i’ve initiated with the support (non-monetary) of Balancer Labs. There is no investors participating, no token, no business model and no plan for all of it. Ideally i want Snapshot to become a common good tool for governance maintained by open source contributors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.903061224489797
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#21",
                    "likes": "1",
                    "time": "05/09/2020-21:02:43",
                    "content": "Thanks on clarifying the multiple hub fact, indeed, if multiple hubs exist and at least one of them is honest then censorship becomes harder. As for the “institutional investor” question, that was not asking about whether investors invested in Snapshot but whether funds that hold tokens with a professional custodian (such as anchorage or coinbase custody) could still participate because they don’t actually have a private key that they could use to sign. Even myself I keep most of my stuff in a Gnosis Safe Multisig where it’s not a simple 1:1 relationship between signing keys and accounts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#22",
                    "likes": "0",
                    "time": "06/09/2020-04:34:49",
                    "content": "Ok got it! Thank you for the details and sorry for the misunderstanding. For the funds held in professional custodian it will not work indeed. I wonder if the funds from each of these investors have a specific address in Coinbase custody or if it’s mixed. If each investor have their own address we can imagine Coinbase custody enabling some kind of delegation to make the fund usable for vote on Snapshot. For multi-sig wallets we can imagine having a strategy that count a vote only if a multi-sig threshold is reached, or a way to delegate this ability to vote to a single address. These are just some ideas, there might be better way to solve this, happy to brainstorm on this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.2061688311688314
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#23",
                    "likes": "1",
                    "time": "06/09/2020-04:42:15",
                    "content": "@fabien Yeah, currently some delegation is supported. There’s a voting proxy, and you let your hot wallet be able to vote for your cold wallet. Not sure how to implement that into a strategy but other people might know how. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/fabien",
                    "index": "#24",
                    "likes": "1",
                    "time": "06/09/2020-09:11:20",
                    "content": "I’ve deployed the “strategies” feature on prod, now you can test it here directly: https://demo.snapshot.page/#/maker ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#25",
                    "likes": "8",
                    "time": "10/09/2020-19:23:19",
                    "content": "Sharing for community awareness. Fabien, Josh and I had a great call yesterday - you’ve done some amazing work in a short amount of time, Fabien! So we have a few options when it comes to integration. Paraphrasing from @jparklev :   Link directly to snapshot.page/maker . This however reduces the utility of the governance portal which isn’t ideal as we don’t want to further fragment the polling/exec voting of Maker Governance.  Embed an iFrame in the portal. Also not ideal due to double headers and potential for wallet connection issues.  Link directly to snapshot.page/maker while maintaining a read-only page on our portal. Our read-only page would reference poll statuses allowing users to link to and vote directly on snapshot.  Re-implement all the functionality in our own portal. We could fork and re-implement but would require work to stay up-to-date with enhancements.  Based on this, I feel like option 3, maintaining a read-only site with a link to voting on a poll in snapshot feels like a quality quick win, we would also look to become a hub/db host along with committing ranked choice voting enhancements to the broader community. One important note, we still need to determine if this solution will support custody solutions such as Coinbase and Anchorage, following which, I will respond and let the community decide on whether or not we proceed based on a signal poll. It is also worth mentioning, as you may be aware that internally we have been working on a batched polling solution that is weeks away from completion. Although a big improvement on what we have in production today, it is on-chain, so is not a free voting solution. We will continue to finish this work and have it as a complete but hidden on-chain fallback solution if it is ever needed, but for now with the pain-points around gas costs, the off-chain snapshot solution (with it’s proof/signature solution) seems like a winner. I’m keen to hear community thoughts and appetite. Thanks all. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.82253086419753
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#26",
                    "likes": "0",
                    "time": "10/09/2020-19:35:49",
                    "content": "YESSSSSSSSSS. Options 3/4 definitely sound good. Having https://vote.makerdao.com/polling either link to the snapshot page or be the same portal as now but with snapshot functionality would be best imo. Sounds like you’ve considered all the possibilities in regards to custodial solutions. I’m looking forward to seeing this implemented ASAP!!! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#27",
                    "likes": "1",
                    "time": "10/09/2020-19:39:42",
                    "content": "I’m in even with 1 while waiting for 3/4. We could also use 1 already with an on chain gov poll (the on-chain being the reference) in order to get a sense of the impact of this change. I guess using this tool will need a MIP update anyway so we have some time to test it live. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#28",
                    "likes": "3",
                    "time": "10/09/2020-22:39:59",
                    "content": "Also a fan of #1, my bet is that we would gain more from gas-free participation than we might lose from fragmentation ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#29",
                    "likes": "2",
                    "time": "27/09/2020-17:48:22",
                    "content": "In a little over a month Snapshot is now being used in some capacity by YAM, Yearn, Balancer, Sushiswap, Swerve, Aave, Rarible, Uniswap, and more! It’s quite remarkable seeing the ecosystem pick up this new tool so quickly.  If you participate in Gitcoin grants feel free to pass along the love https://gitcoin.co/grants/1093/snapshot. ",
                    "links": [
                        "https://gitcoin.co/grants/1093/snapshot"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.826569264069264
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#30",
                    "likes": "4",
                    "time": "29/09/2020-17:03:45",
                    "content": "Hey all, great to see the adoption! A few points:  Discussion with Coinbase Custody confirmed that the implementation suggested during our discussion with Fabien can be supported. Good news! As you may know, a new portal will shortly be released with on-chain batched polling. This will reduce gas costs but not eliminate them to the degree of Snapshot, so it is reasonable to consider the batched solution an incremental yet temporary improvement in the lead-up to Snapshot. (This will live-on as a background fallback solution if ever needed). In order for Snapshot to function as part of Maker Polling, there is a need to develop ranked choice voting - which doesn’t exist yet.  Therefore, summarising next steps:  If interested, the community should signal their interest to support a Snapshot solution as a replacement for on-chain polling. I would be happy to work with anyone from the community in adding any details required. I believe this should be a poll, but look towards @LongForWisdom for confirmation on this. If the above poll passes, I will work with the community to secure a developer (either in the foundation or externally, TBD) to develop Ranked Choice Voting so we get Snapshot capabilities on-par with current polling. A project would begin to integrate this with the existing Governance Portal*  *Small disclaimer - I can’t commit to a delivery window just yet as the Foundation have a number of pre-existing initiatives like Liquidations2.0 that will require additional prioritisation discussions. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-15-pt-br-portugues/4597",
                        "https://forum.makerdao.com/t/maker-relay-ep-15/4574"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.203787878787878
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#31",
                    "likes": "1",
                    "time": "29/09/2020-17:46:41",
                    "content": "    Derek:  I believe this should be a poll, but look towards @LongForWisdom for confirmation on this.   Probably should be a Declaration of Intent for something like this, governance is expressing intent to have / do something which you’ll then have confidence to work on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#32",
                    "likes": "1",
                    "time": "29/09/2020-21:37:04",
                    "content": "@Derek I can draft one up for your review.  Soon™ ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#33",
                    "likes": "0",
                    "time": "29/09/2020-21:47:02",
                    "content": "Doesn’t that take months to implement? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#34",
                    "likes": "0",
                    "time": "30/09/2020-05:57:45",
                    "content": "I assume. But as Derek mentioned, they can’t commit to delivery window anyway and will take some time. I only superficially read this topic, but is there a way to add functionality for commenting on executive votes off-chain? Since executive spells bundle a lot, maybe whales could comment easily why they did not move MKR to specific spell? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.722222222222221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#35",
                    "likes": "2",
                    "time": "30/09/2020-10:41:02",
                    "content": "Hey @jernejml to your question of adding comments to executive votes - yes, the dev team is building this now and we should have this functionality available in a matter of weeks. (the user will be able to sign a transaction with their voting wallet if leaving a comment). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#36",
                    "likes": "1",
                    "time": "30/09/2020-10:45:12",
                    "content": "We should be able to implement Snapshot capability relatively quickly - there is technical consulting work for us to build the Ranked Choice Voting capability which is probably a sprint (2 weeks work), then the page build as a read-only/linkable page to Snapshot is another sprint, as well as some back-end infrastructure because I expect Governance would want Maker to maintain a hub/host the polls. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#37",
                    "likes": "0",
                    "time": "30/09/2020-11:48:56",
                    "content": "I meant if we go through the declaration of intent process as opposed to a signal request. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#38",
                    "likes": "1",
                    "time": "30/09/2020-12:06:13",
                    "content": "The reason that I think the Declaration of Intent process should be used for this is that it’s currently not clear exactly what the community and Maker Holders want from this. The DoI process requires the author to clarify what the intention is. This clarity is often lacking from the signalling process. That clarity prompts more robust discussion and debate over what it is the community actually wants and is trying to achieve with the snapshot tech. A All of which should result in a more concrete understanding on the part of the implementer (Derek + co) of what goals the delivered product should meet. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.291666666666666
                }
            ]
        }
    ]
}