{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/shcu-reflections-on-recent-events-a-love-letter/16087",
            "title": "SHCU | Reflections On Recent Events: A LOVE Letter ",
            "index": 16087,
            "category": [
                "Discontinued Categories",
                "Strategic Happiness"
            ],
            "tags": [
                "meta-governance",
                "cu-update",
                "archive-sh-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#1",
                    "likes": "23",
                    "time": "27/06/2022-16:01:01",
                    "content": " Reflections On Recent Events As the Facilitator of the Strategic Happiness Core Unit, my mandate is to keep everyone happy. Of course, that’s easier said than done. To many of you, I’m just “the swag guy” that just hangs out at events. I have a silly role running a core unit with intangible benefits. The truth is, the swag aspect of my involvement is just a proxy for the value I bring. I bring people together. I help form connections between like-minded people that would otherwise not exist. I will also rally people to a cause when necessary. At some point, though, I have to pick a side. MakerDAO has been part of my identity for seven years now. I have dedicated my life and soul to the vision of DAI, its decentralized future, and the promise of bringing true financial freedom to the world. I’ve stayed loyal to Maker all these years, spreading awareness, growing the community, and investing my time and money out of love. Until recently, I have never even requested compensation. I know I am not alone with this view in our community. Many of us here work nearly for free. What we have is unique, and the dedicated community we’re blessed to have is what makes it possible. In my opinion, that vision was threatened today. I did my part in what I believed was necessary to protect it. However, I fear that this is just the beginning.  Unprecedented Voter Turnout I may be wrong, but I believe it was no accident that nearly one-third of all MKR in circulation participated in this vote. How did these proposals receive so much support? Where did all these new “Yes” votes come from? I believe that accumulating MKR on that scale out of an illiquid market required many months of planning and was carefully orchestrated, employing tactics used in the traditional finance world when executing a company’s hostile takeover. Recent price action, to me, appeared extremely unnatural, designed to shake out liquidity from core members of our community. They were forcing their hands. Of course, this is a free market. All participants are free to make their own decisions, but if I am correct, many of Maker’s longest supporters, myself included, have suffered immeasurably at the hands of those who employed these tactics. This vote would have passed if not for our larger silent community’s goodwill. Gathering everyone to block these sorts of actions is no easy task.  Going Forward Owning MKR is a responsibility, and if not for the goodwill of the community, this vote on a move towards centralization would have been successful. We let our guard down. Next time, they will come with more firepower. If the path forward is centralized, hierarchical control of the system, maybe Maker will be a successful enterprise, but it is not the vision I signed up for. However, I am optimistic that there can be a path forward that does not involve these tactics. The community has shown today that it is willing to come out and defend the protocol. I hope those that chose to pick this moment to take control will understand that there are better, symbiotic ways forward. ",
                    "links": [
                        "https://forum.makerdao.com/t/actualizaciones-mensuales-de-las-core-units-junio-del-2022/16923",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-june-2022/16783",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/3"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.075287761334272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "6",
                    "time": "27/06/2022-21:57:57",
                    "content": "I would be careful with accusation and rumors as it can lead to greater distrust and conflict. For example,     aburban90:  Recent price action, to me, appeared extremely unnatural, designed to shake out liquidity from core members of our community. They were forcing their hands.   Considering even major coins like ETH dipped quite a lot in the recent fall, I don’t think it’s fair to blame the recent MKR price fall to some coordinated attempt unless there’s clear evidence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.61875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#3",
                    "likes": "6",
                    "time": "28/06/2022-00:59:52",
                    "content": "    aburban90:  Owning MKR is a responsibility, and if not for the goodwill of the community, this vote on a move towards centralization would have been successful. We let our guard down. Next time, they will come with more firepower. If the path forward is centralized, hierarchical control of the system, maybe Maker will be a successful enterprise, but it is not the vision I signed up for.   Very difficult to decipher this. Is “they” meant to be large MKR holders/funds? Haven’t we been asking for more involvement in governance from the big funds for a long, long time? I can understand why some prefer the autocracy of just one MKR whale (Rune) rather than an oligarchy of several whales (Rune plus others) but it’s not at all clear to me why the former is more “decentralized” per se. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.802910052910053
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "25/09/2022-16:01:21",
                    "content": "This topic was automatically closed after 90 days. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.09090909090909
                }
            ]
        }
    ]
}