{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/multichain-market-musings/16909",
            "title": "Multichain Market Musings ",
            "index": 16909,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#1",
                    "likes": "10",
                    "time": "29/07/2022-20:05:29",
                    "content": " Multichain Market Musings  6912×3456 1.46 MB  Image generated via AI through Midjourney I’m trying something new. If it’s extraneous or doesn’t belong, well… this will be the sole edition. Baked in rarity. While Dai-lights covers the movement of DAI throughout the expanding cryptoverse, this series aims to follow the news. Some may only tangentially relate to MakerDAO, but crypto news travels in waves. So, let’s dive in.  LIDO shows why Governance matters  Lido DAO rejected a $14M deal with Dragonfly Capital, but it didn’t come easy. LIDO is Ethereum’s largest “liquid-staking” protocol. Through it, users deposit ETH to receive stETH, a liquid derivative that can be actively traded, swapped, or pooled. As Ethereum storms closer to the ‘Merge’, attention’s shifted to the future. With the transition to PoS, the burden of network security falls on these delegate protocols. Something that’s already being tested.  10/ A summary of the proposal:• 20M LDO (2% of supply) to be sold by the DAO treasury at a purchase price equal to $29,043,051.43 in $DAI stable coin.• DragonFly Capital to acquire 1%, or 10M LDO.• Other partners to acquire the remaining 1%, or 10M LDO tokens.— Miles Deutscher (@milesdeutscher) July 26, 2022  The tokens were to be offered at a significant discount from their current price point ($1.45/ea) and with no lock-up or vesting schedule. The proposal offered three options:  No – the proposal needs work; For – Keep as listed, 1 yr lockup; For – Keep as listed, no lock-up  Despite overwhelming opposition on the LIDO Governance Forum, and “No – the proposal needs work” dominating the early voting; an anonymous whale still dropped a mammoth $15M LDO vote for “For – Keep as listed, no lockup”. Per Alex Svanevik of Nansen.ai, the wallet was initially funded by Alameda Research. SBF sure has been busy…  Fortunately, the vote was trumped by a larger whale (blue whale?), and the proposal ended with a 66% “No” vote. So, crisis averted – but it’s a vivid reminder of the importance of a vigilant community and robust system of governance. Sidenote: The LDO was set to be sold OTC for DAI.  zkEVM’s are the new cool  It was only two weeks ago that I made my report on ZK Rollups, but a lot can change in 14 days. ZK protocols are locked in a pseudo “Cold War” brought on by zkSync’s announcement of a zkEVM testnet (a ZK capable of running smart contracts). Soon after, Scroll and Polygon joined the fray, and the race was on. These were not expected announcements. Many felt EVM compatibility was still years away - but here we are.  ⮛ TLDR, we now have three zkEVMs vying for market dominance.    zkSync - poised for a Q4 2022 “fair launch”  Polygon-Hermez - launch expected in Q1 of 2023  Scroll - launch TBD following an “open alpha” phase   ⮛ Why’s this important?  Zero-knowledge (ZK) rollups are faster, cheaper, and more secure than their optimistic counterparts, but they traditionally came attached with a rather large caveat. They couldn’t run smart contracts. To this point, ZKs have only been applied to a handful of simple use cases like token swaps, transfers, and NFT trading. zkEVMs, on the other hand, aim for full compatibility with the Ethereum Virtual Machine (EVM). This would allow for a rollup that looks, feels, and behaves like Ethereum mainnet.  ⮛ How do they differ?  With the new era of ETH scalability now in sight, let’s take a look at how these networks plan to operate. To start, a rollup can be EVM-equivalent or EVM-compatible. Optimistic rollups like Optimism and Arbitrum boast EVM-equivalency, meaning the network behaves in near parity with Ethereum layer-1. For devs, this leads to far less overhead when porting a project to layer 2, and for users, familiar tools like MetaMask have no issues operating as designed. EVM-compatibility is a much looser term. Compatibility doesn’t guarantee devs access to the same tools and frameworks available on layer-1. In some cases, contracts need to be rewritten entirely to launch on an EVM-compatible chain (and, potentially, in a different programming language). Per Luozhu Zhang of the Scroll team, EVM compatibility comes in three flavors: bytecode level, language level, and consensus level.   zkSync’s EVM allows for developers to write contracts in Solidity, but the contract is then compiled into Yul (zkSync’s native programming language). Because the code is compiled into Yul, the network is EVM-compatible at the language level, but not fully equivalent.  Polygon’s zkEVM falls into the bytecode level category. This approach yoinks the compiler, allowing for contracts to be ported in native Solidity.  Scroll’s also utilizes bytecode level compatibility, but is closer than Polygon to EVM-equivalency.  And that’s where much of the confusion stems from. Bytecode level compatibility can be further boiled down. Explained in a Messari report:  “Part of the [‘true’ EVM] debate follows whether the EVM bytecode is being executed directly or interpreted first and then executed. In other words, if a solution does not mirror official EVM specs, it cannot be considered a true zkEVM. Within this definition, Scroll might be considered a ‘true zkEVM’ vs. the others.”  Polygon has a massive leg up on circulating DAI, but with staggered roadmaps, it’s tough to tell how that landscape will shift. For now, just sit back, relax, and watch the scalability unfold.  Disclaimer: None of the above should be taken as financial advice. I’m just a guy who likes to read and write – maybe too much. Thanks for reading, skimming, or anything in between! ",
                    "links": [
                        "https://twitter.com/search?q=%24DAI&src=ctag&ref_src=twsrc%5Etfw",
                        "https://twitter.com/milesdeutscher/status/1551957614749052928?ref_src=twsrc%5Etfw",
                        "https://research.lido.fi/t/treasury-diversification-2/2570/20",
                        "https://twitter.com/ASvanevik/status/1550366913251115008?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E1550366913251115008%7Ctwgr%5E%7Ctwcon%5Es1_&ref_url=https%3A%2F%2Fthreadreaderapp.com%2Fthread%2F1551957574320214023.html",
                        "https://forum.makerdao.com/t/dai-lights-reunion-tour/16636",
                        "https://blog.matter-labs.io/100-days-to-mainnet-6f230893bd73",
                        "https://blog.polygon.technology/the-future-is-now-for-ethereum-scaling-introducing-polygon-zkevm/",
                        "https://mirror.xyz/scroll.eth/XQyXDgyxoefag6hcBgGJFz8qrb10rmSU-zUBvY3Q9_A",
                        "https://threadreaderapp.com/thread/1546971464645357568.html",
                        "https://messari.io/article/the-big-three-zkevm-announcements-what-you-need-to-know-and-potential-implications?referrer=author:eshita-nandini",
                        "https://polygonscan.com/token/0x8f3Cf7ad23Cd3CaDbD9735AFf958023239c6A063",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/9",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-28-de-julio-03-de-agosto-del-2022/17139"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.618525918525918
                },
                {
                    "author_link": "https://forum.makerdao.com/u/tylermeanswell",
                    "index": "#2",
                    "likes": "2",
                    "time": "29/07/2022-23:04:06",
                    "content": "Very interesting read, I appreciated the summary of the variations in the ways the ZK-chains interact with solidity at different levels with some allowing for more “interpretation” by the Layer-2 than others— and how that leads to different security/interpretation concerns— enlightens me to questions of DAI security on these changes I hadn’t previously considered! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.951388888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#3",
                    "likes": "2",
                    "time": "30/07/2022-00:48:58",
                    "content": "Good writeup! The Lido governance battle is quite interesting. As for ZK smart contracts, It would be great if they pull this off by early 2023, but I will believe it when I see it. Teams feel a lot of pressure to exaggerate claims and timelines. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.489285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#4",
                    "likes": "1",
                    "time": "30/07/2022-20:07:09",
                    "content": "Much appreciated!      CodeKnight:  As for ZK smart contracts, It would be great if they pull this off by early 2023, but I will believe it when I see it. Teams feel a lot of pressure to exaggerate claims and timelines.   Fully agree. Strong chance the first won’t be the best, and it could still be a while until they’re “ready” for traffic. It took Optimistics a full cycle to catch on and from a dev perspective, they’re far cheaper and easier to launch on. Either way, good to see some strong bear market building. Also worth noting that EIP-4844 (and Proto-danksharding) should significantly decrease the average cost of calldata, making L2s absurdly attractive for both devs and users. Protocols might be trying to stay ahead of that potential surge. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.810574229691877
                }
            ]
        }
    ]
}