{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/endgame-a-simple-overview-of-makerdaos-governance-revamp/20220",
            "title": "Endgame: A simple Overview of MakerDAO's Governance Revamp ",
            "index": 20220,
            "category": [
                "Governance"
            ],
            "tags": [
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#1",
                    "likes": "21",
                    "time": "19/03/2023-20:57:27",
                    "content": " Endgame: A Simple Overview of MakerDAO’s Governance Revamp  image988×582 135 KB   Introduction Endgame is a comprehensive governance overhaul for MakerDAO that addresses key opportunities and challenges faced by the blockchain industry. It aims to make Maker Governance more efficient, transparent, and inclusive by establishing a resilient and reliable governance equilibrium. To complement this increased resilience, Endgame also catalyzes scalable and parallelizable product innovation and growth strategies. This post provides a quick overview of the 3 main features of Endgame, and gives a rough timeline for when they will be implemented.  1: Clear and Specific Rules  image754×311 47.2 KB   To be implemented immediately upon passing the Maker Constitution MIP Set The Maker Constitution and Scope Frameworks serve as rulebooks that clarify the autonomous, open processes of MakerDAO. These frameworks reduce ambiguity and align DAO efforts towards critical objectives while ensuring that distractions are avoided. Easy-to-use software tools, such as data dashboards and AI chatbots, make the rules, processes and their results accessible and auditable for all governance participants, not just insiders. The core rules and definitions of the Maker Constitution are immutable in order to provide minority token holder protections and to prevent scope creep or changes to the balance of power that might put the decentralization of the system at risk. This does not go into effect until all 3 core features of Endgame have been implemented, so early fine tuning of the core rules is still possible. Constitutional Voter Committees (CVCs) are open structures composed of regular MKR token holders that are defined in the Maker Constitution. CVCs provide a public platform for MKR holders to receive detailed status reports and professional advice. Based on this input CVCs propose key decisions in a holistic format known as Governance Strategies. A crucial aspect of the Maker Constitution is its focus on purpose beyond monetary enrichment, primarily through the Purpose Fund that allocates donations to charities scaling with MakerDAO’s success. This alignment encourages participants to seek long-term, holistic value from MakerDAO’s broad success, rather than narrow and short-term wealth extraction.  2: Governance Participation Incentives  image1269×418 39.7 KB   To be implemented later in 2023 The Sagittarius Engine (SE) encourages MKR holders to participate in governance by locking up MKR and delegating their voting power to a Governance Strategy designed by the CVCs. This process utilizes a user-friendly, gamified frontend for easy access, and is comparable to the well understood process of picking a political party in a multi-party democracy (with voting power weighted by MKR holdings). SE users receive compensation for their work in improving and securing Maker Governance in the form of Dai (25% of Maker Protocol surplus) or SubDAO tokens (SubDAOs are described below). The SE imposes a 15% exit fee, which is burned from the locked MKR when a user exits, incentivizing long-term commitment and problem-solving through governance tools like CVCs, instead of just quitting when challenges emerge.  3: Move operational complexity from MakerDAO into SubDAOs  image956×435 42.3 KB   To be implemented in 2024 SubDAOs function as semi-independent specialized divisions within MakerDAO. They have their own governance tokens and governance processes, enabling rapid parallelized growth, specialization and decision making. Outsourcing day to day complexity to SubDAOs significantly reduces the amount of work and complexity that Maker Governance needs to deal with. The primary tasks of SubDAOs include maintaining decentralized frontends, allocating Dai collateral, handling operational efficiency risk, marginal decision-making, and experimenting with innovative products and growth strategies. SubDAOs reuse key governance processes and tools from MakerDAO to streamline their operations. Maker never issues or generates Dai itself, and in Endgame will slowly move towards no longer maintaining native vaults. Instead, SubDAOs will use the Maker Protocol to generate Dai in bulk at a low Stability Fee Base Rate, and then allocate the Dai to other DeFi protocols, Real World Assets, or their own native vault engines. SubDAOs cover all collateral onboarding costs, oracles, maintenance, upgrades, legal costs, credit risk assessment costs, and other associated expenses. They also maintain junior capital that takes the first loss on all collateral exposure. In return, SubDAOs can charge a spread above the Base Rate from their users, to compensate for their work and risks. Maker Governance can remove almost all costs and complexity related to day to day operations, and focus solely on mitigating tail risk and asset-liability management. SubDAO and MKR token holders’ incentives are aligned through intertwined economic mechanics of their governance tokens. SubDAO tokens are algorithmically created and distributed broadly to Maker Protocol users, fostering decentralization and diverse communities. This fundamental decentralization, combined with broad token distribution, enables each SubDAO to find its unique specialization through organic, bottom-up processes. ",
                    "links": [],
                    "GPT-summary": "The post provides an overview of MakerDAO's governance revamp called Endgame. It explains the three main features of Endgame, which are clear and specific rules, governance participation incentives, and moving operational complexity from MakerDAO into SubDAOs. The post also gives a rough timeline for when these features will be implemented. The post does not advertise the proposal, nor does it ask for collaboration or feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.543632075471699
                },
                {
                    "author_link": "https://forum.makerdao.com/u/VonNeumann",
                    "index": "#2",
                    "likes": "1",
                    "time": "20/03/2023-21:59:28",
                    "content": "This is very helpful.  Can you clearly outline in a similar format the reason why the current way of doing things (via delegates, etc.) is not working and how this plan helps? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#3",
                    "likes": "3",
                    "time": "21/03/2023-16:01:04",
                    "content": "I’m glad you found it helpful! Let me try to clarify the three main problems and how each of Endgame’s main features addresses them.  The Complexity Spiral Problem: The current governance process has become increasingly complex, with over 100 MIPs, many of which are unknown, inconsistent, or abandoned. Additionally, there are numerous unwritten, implicit rules, many of which impact decision-making more than the documented ones. Solution: Endgame introduces clear and specific rules through the Maker Constitution and Scope Frameworks. These rules aim to stabilize the governance process, make all rules explicit, and streamline or reduce them over time to make sure the focus remains on what’s critically important. The approach of explicitly documenting all rules and processes also lays the foundation for transferring most of the complexity to SubDAOs.  Voter Apathy Problem: Low voter turnout in Maker governance leads to centralization risk and vulnerability to governance attacks or forced emergency shutdowns. Typically, a few whales make key decisions. Solution: The Sagittarius Engine (SE) Governance Participation Rewards incentivize MKR holders to easily delegate their MKR through the Easy Governance Frontend and helps increase the chance they are aligned with other MKR holders through the skin-in-the-game aspect of SE exit fees. Delegates continue to play a crucial role in Endgame, serving as stewards of most of the voting power that results from the Governance Participation Rewards. This powerful position could be dangerous to the system without proper checks and balances since delegates might wield control without accountability or skin in the game as they don’t need to hold MKR. CVCs act as the primary check on delegates, ensuring that MKR holders have a clear line of sight and can easily comprehend all critical decisions. This is why CVCs are integral to Endgame.  The Relationship Problem Problem: The current governance system is slow and single-threaded, making it challenging for thousands of token holders to coordinate and manage delicate relationships with core unit members and collateral counterparties. Combined with the complexity spiral problem, this becomes highly problematic at scale, leading to conflicts, drama that hinders progress, and potential conflicts of interest that are difficult to detect and could in extraction of significant value from the protocol over time. Solution: SubDAOs serve as a decentralized layer between Maker Governance and counterparties and contributors. They facilitate conflict resolution and relationship management while reducing the chance it spills over to other parts of Maker. Politics and drama can never be completely eliminated in truly decentralized DAOs, but SubDAOs that develop strong communities and counterparty networks can grow and execute without being slowed down by distractions from potentially dysfunctional relationships in other SubDAOs, and eventually those SubDAOs can then either be fixed or simply replaced by new SubDAOs that start fresh.  Growth Additionally, a last problem is that the Dai supply isn’t growing and we don’t have effective means of distributing Dai or attracting more users. The SubDAOs in particular will help with this significantly because they can execute on growth strategies in parallel, and can use unique branding to specialize in attracting specific demographics, instead of being forced to try to make one-size-fits all distribution strategies. Then there’s also the SubDAO token farming element, where users may be attracted to use Dai and participating in the Maker Ecosystem because they can get SubDAO tokens for free through a fun and user-friendly gamified experience. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.618782083126346
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#4",
                    "likes": "3",
                    "time": "21/03/2023-19:25:48",
                    "content": "Thanks for this overview Rune - I think it’s a helpful summary and also does a good job distilling what exactly the Endgame governance reforms are ‘for’. These big-picture aims are important to keep emphasizing:     rune:  It aims to make Maker Governance more efficient, transparent, and inclusive by establishing a resilient and reliable governance equilibrium.       rune:  A crucial aspect of the Maker Constitution is its focus on purpose beyond monetary enrichment, primarily through the Purpose Fund that allocates donations to charities scaling with MakerDAO’s success.   In terms of the ‘three main features’, particularly ‘clear and specific rules’, there is some work to do in terms of clearing up ambiguity in the Constitution and Scope Frameworks. I do agree that there is plenty of ambiguity and ‘complexity spiralling’ in the current governance processes as well, though, so there is a lot of value in creating a new single rulebook: we just need to keep iterating and improving to achieve greater clarity. I think most stakeholders in Maker governance can get around that aspiration as a north star. One kind of iteration I have been thinking about is how to draw the lines in the constitutional documents between what language/rules should be immutable and what should be open to amendment (and, if so, how high the bar should be for amendment). It’s clear that some things will need to be immutable to provide lifetime protections to minority token holders, but also that other things will need to be able to be amended as Maker progresses and evolves long into the future. There are helpful precedents for us to look at in the history of constitutional development around the world, and also the structure of international agreements. I recommend reading up on ‘entrenchment clauses’ if this is interesting to people: here is a taster. As an example, there are different varieties of entrenchment clauses that we can deploy depending on how ‘immutable’ we want to make any particular provision in Maker’s constitutional documents. There are ‘eternity provisions’ that fully prohibit amendment right through to more tailored kinds of restrictions on amendments like those limited to a time period, or to specific situations (unpegging emergencies?)  etc.  Screenshot 2023-03-21 at 3.20.31 PM1240×608 54.9 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.0490969967532475
                }
            ]
        }
    ]
}