{
    "poll_list": [
        {
            "title": "Investigate Implementation of an Antalpha Institutional Vault - May 23, 2022",
            "index": "15030",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "80,879",
            "highest_fraction": 0.96
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-antalpha-institutional-vault/15030",
            "title": "[Signal Request] Antalpha Institutional Vault ",
            "index": 15030,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/William_Chiu",
                    "index": "#1",
                    "likes": "12",
                    "time": "07/05/2022-16:04:55",
                    "content": " Institutional and Long Term Vaults Proposal - Antalpha This post merges recent discussions between @ Growth , @ Risk , @ Protocol Engineering and Antalpha to propose an institutional vault offering. We are putting forward this proposal to gather community feedback and sentiment on an initiative that we believe will lead to sustainable longer term ecosystem growth.  Goals This proposal seeks to grow the MakerDAO ecosystem, specifically regarding:  Boosting DAI Supply Generating greater revenue for MakerDAO and our partners Enhancing capital efficiency for our partners Longer term borrowing commitment with a level of borrowing rate-predictability   Mechanisms to Achieve This New vault mechanisms are introduced to promote this growth, including:  Origination fee: will be applied to all DAI at the time of minting. This is not restricted and is open to change via Governance (specifically the Parameter Changes Proposal group). Meaning that any partner will have a lead time of 2-3 weeks before any changes are implemented. Stability fee: is determined upfront and fixed for a period of time. This fixed rate can be reduced as additional collateral is added. Vault starting size: to ensure that such vaults will mint a minimum amount of DAI in order to gain favorable rates. Antalpha intends to utilize DAI loan to strengthen the stable coin portion of the balance sheet to support one of its primary business of lending and borrowing. Antalpha will take on collateral at a higher collateral level than the level borrowing from DAI to implement proper credit risk management and utilize systems and algorithmic trading to facilitate in managing the loans and collaterals   Company Background Antalpha Group was established in June 2021 by Antpool Technologies Holding Company (“Antpool Holding”), the holding company of the business operated under the “Antpool” brand, which includes one of the world’s largest cryptocurrency mining pools. Antpool was launched firstly in 2014 as a cryptocurrency mining pool operated by Bitmain Technologies Holding Company (“Bitmain”). Bitmain is a top fabless IC design company in terms of revenue and a leading market player in the global ASIC-based cryptocurrency mining hardware company under the “Antminer” brand. Antalpha Group primary business is digital assets financial services that includes lending and borrowing, OTC trading, and asset management. The core management includes: Moore Jin, Chief Executive Officer of the group and a veteran in the cryptocurrency and mining business who has launched and managed several private equities crypto mining funds with assets exceeding 100 million USD under management. William Chiu, Chief Investment Officer of the group, who oversees investments and the trading desk, has traditional finance experiences in MF Global and Citigroup. He also acted as the managing partner at Armada Capital, which manages cryptocurrency assets using algorithmic trading systems. Mo Zhang, Chief Risk Officer of the group, who oversees the risk management and lending desk. Another veteran of the cryptocurrency industry since 2013, founder of www.btc123.com and an early team member of Huobi. Edward Scott, Head of Global Proprietary Trading, who oversees the proprietary trading desk was a portfolio manager at Millennium Partners and R Investments.  Institutional Vaults The proposed terms of our agreement are as follows:     Institutional Vault Type Permissioned ETH and wBTC Vaults (INST-WBTC-5, INST-ETH-5)     Qualifying Vault size: 200m   Debt Ceiling 1B, 500m for ETH and 500m for wBTC   Origination fee: 1% of DAI minted   Origination fee behaviour: Origination fee is not restricted and can be changed through Governance via a Parameter Changes Proposal. Typically this will mean that Antalpha has a 2-3 week lead-time to any Origination fee rate change.   Origination fee future commitments Maker and Antalpha will work together to propose reductions to the origination fee if the vault size grows significantly.   Stability fee: WBTC-A stability fee1 - 50bps & ETH-A stability fee2 - 50bps   Stability fee3 behavior: Fixed for 6 months. After the 200m DAI minted, an additional 100m DAI minted will reduce the stability fee by 10 basis points (per vault) to a minimum of Stability fee-30bps for 6 months. Stability fee reduction will be manual via an executive vote. After 6 months, open community dialogue facilitated by the Growth CU will determine ongoing stability fees.   Collateral Ratio: 150%   Collateral Ratio Behavior: Failure to maintain 200% CR4 over the majority of any 7 day period will result in increasing the SF to 5% and increasing the LR to 150%. The 7 day period would be calculated by ensuring that 95% of the OSM updates show that the CR is equal to or greater than 200%.   Liquidation Ratio: 120%    —————————————————————————————————————————————— 1 By the time the executive vote passes 2 By the time the executive vote passes 3 Minimum possible SF can be zero or non-negative 4 This CR is an adjustable parameter and can be adjusted by Rick Core Unit  Transparency, Intention and Discussion To spotlight the scale and opportunity this product presents, it is worth mentioning the following as part of our recent discussions with all the CUs from MakerDAO:  Antalpha commits to mint 200m DAI per vault (that’s 400m DAI total) during the first week after the INST-WBTC-5 and INST-ETH-5 vault is available for its usage. Over time, pending market conditions we can expect this to reach a billion DAI. Antalpha is improving its operations and collateral management automation to ensure monitoring 24/7, meaning that they will keep a collateralization ratio above 200%. To foster aggressive growth, Antalpha and MakerDAO will explore reductions to the origination fee as the vault size grows. This additional flexibility will help align incentives over the longer term.   Process & Meeting Cadence As described above, stability fees are fixed for 6 months. In the 4-6 weeks leading up to the 6month stability fee maturity date, the Growth Core Unit will engage with Governance and Antalpha to facilitate discussion and decision making to set the stability fee for the following 6 months. These discussions will be pre-scheduled meetings to ensure cadence is managed and there is ongoing visibility to all involved. This will then proceed to a poll and/or executive vote as per standard governance processes. We want to understand the community’s sentiment to proceed with the presented terms that were built together with Risk CU, Growth CU, Strategic Finance CU and PECU.  Polling Do you think we should launch the Antalpha Institutional Vault?  Yes No Abstain      Yes No Abstain     0 voters      Next Steps Next Steps clarified by LFW - 2022-05-08 Poll will run until 2022-05-19T00:00:00Z. If successful at the off-chain stage, it will move on-chain in the ‘Investigate Implementation’ format. ",
                    "links": [
                        "https://forum.makerdao.com/t/relay-semanal-24-30-de-mayo-de-2022/15594",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/17",
                        "https://forum.makerdao.com/t/mip40c3-sp70-modify-growth-core-unit-budget-gro-001/15102",
                        "https://forum.makerdao.com/t/weekly-relay-may-24-30-2022/15488",
                        "https://forum.makerdao.com/t/relay-semanal-17-23-de-mayo-del-2022/15392",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/43",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/78",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/65",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/80",
                        "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-23-de-mayo-de-2022/15344",
                        "https://forum.makerdao.com/t/relay-semanal-10-16-de-mayo-de-2022/15289",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-12-18-2022/15280",
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
                        "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-5-11-2022/15154",
                        "https://forum.makerdao.com/t/growthcu-last-year-in-review-and-high-level-plan-for-next-year/15100",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/20",
                        "https://forum.makerdao.com/t/core-unit-de-crecimiento-revision-del-ano-pasado-y-plan-de-alto-nivel-para-el-ano-proximo-traduccion/15844"
                    ],
                    "GPT-summary": "The post proposes an institutional vault offering by Antalpha to grow the MakerDAO ecosystem. The proposal seeks to boost DAI supply, generate greater revenue for MakerDAO and partners, and enhance capital efficiency for partners. The proposal introduces new vault mechanisms, including origination fee, stability fee, and vault starting size. The post also provides details about the company background, institutional vaults, transparency, intention, and discussion. The author seeks community feedback and sentiment on the initiative and wants to understand the community's sentiment to proceed with the presented terms.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.383875519904931
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/05/2022-17:04:28",
                    "content": "    William_Chiu:   To foster aggressive growth, Antalpha and MakerDAO will explore reductions to the origination fee as the vault size grows. This additional flexibility will help align incentives over the longer term.    Hello! Welcome to the MakerDAO community and thank you for proposing a much needed paradigm, Institutional Vaults. With regards to the origination fee, will it apply to All incoming Collaterals throughout the life of the INST-ETH & INST-WBTC Vaults, or just the initial commitment to mint 200m DAI per vault? Total = 400m DAI     William_Chiu:  Failure to maintain 200% CR4 over the majority of any 7 day period will result in increasing the SF to 5% and increasing the LR to 150%.   Also, is this  correct, a 450 basis pts increase if you fail to maintain 200% CR over a 7-day period?  What happens if you reduce each Vault Type under 200m DAI? Stability Fee remains at 50bips? Thank you in advance and looking forward to hearing more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.488095238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "7",
                    "time": "07/05/2022-22:52:11",
                    "content": "what is liquidation fee? The standard 13%? And as I suggested in the past all of these IV terms need to be systematized.   I can’t imagine what Nexo is thinking here. The sheer lack of systematics and special treatment for each player is just bad optics and shows that Maker doesn’t have a coordinated approach to IV vaults that treats all players fairly. So basically Maker is going to take on 1B of vault for 30bps when short term bond rates are significantly higher. What is the SF fee increase allowed every 6 months?    I mean a 1% orig fee seems like a lot but when you tie this to 30bps 1B loan it is nothing and this doesn’t even come close to being ‘at market’ as far as I can tell. You all realize that each one of these IVs clumps liquidations dramatically.  I am not even sure the markets would be able to handle a cascading liquidation event.    I have repeatedly insisted that these IV’s should be broken up so that they don’t liquidate in a single heap. Seems like a great idea but the pricing and terms are terrifically poor in a increasing rate environment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.335379464285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/05/2022-00:36:25",
                    "content": "Agreed What are reasonable terms/pricing in the current rate environment? Seems like Maker needs to form its own view on these key items ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AliceinMKRland",
                    "index": "#5",
                    "likes": "0",
                    "time": "08/05/2022-01:09:43",
                    "content": "Edited: The formatting led to confusion. I thought the rate was only 1/2 percent This rate is far too low. Everyone will want this rate if we give it to some Bitcoin miners. I’m sorry. This is evidence that Maker is becoming diseased and desperate if we approve this rate ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.178571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Piratical",
                    "index": "#6",
                    "likes": "0",
                    "time": "08/05/2022-01:14:00",
                    "content": "    William_Chiu:  |.| |Stability fee:|WBTC-A stability fee1 - 50bps & ETH-A stability fee2 - 50bps|   Belay that order! This be an insult! At least be enough percent to count on one finger! Send this rate down to pump the bulge until we see fees that ain’t downright plundering the DAO  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.2407407407407405
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#7",
                    "likes": "1",
                    "time": "08/05/2022-01:29:01",
                    "content": "Thanks for the application and thanks to the growth team for facilitating this. It’s a clear win for both sides. Let’s make this happen. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#8",
                    "likes": "2",
                    "time": "08/05/2022-01:36:49",
                    "content": "@hexonaut How do you respond to criticism that the stability fee is too low? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rob",
                    "index": "#9",
                    "likes": "0",
                    "time": "08/05/2022-01:49:46",
                    "content": "Thank you for the application, and thank you to our team for initiating this. That being said… the rate really sends a bad signal. Is there any chance you’d take a higher one? Other people would want the same deal if we did this ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#10",
                    "likes": "0",
                    "time": "08/05/2022-01:53:52",
                    "content": "It’s the same deal we have for all IVs. This is upwards of +1B supply to replace non-interest bearing stablecoin supply. Acquiring crypto collateral market share is very important and this does exactly that. Also keep in mind there is a 1% origination fee so the overall rate is about the same for a 1 year timespan. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.77
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Puzzler",
                    "index": "#11",
                    "likes": "1",
                    "time": "08/05/2022-01:57:12",
                    "content": "Edited. I misunderstood. My apologies!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#12",
                    "likes": "7",
                    "time": "08/05/2022-02:10:51",
                    "content": "Hey guys I’m realizing now that there is confusion on this. The stability fee is not 0.5%. It’s ETH-A / WBTC-A SFs minus 0.5%. So for the ETH vault the rate will be 1.75% and down to 1.45% if they max it out. Same for WBTC. @Eumenes @Piratical @MakerMan @Puzzler @Rob @CYJFC @AliceinMKRland @Spidomo ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.5740740740740735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#13",
                    "likes": "1",
                    "time": "08/05/2022-02:20:20",
                    "content": "Np I looked at it again and see how the wording was not great. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#14",
                    "likes": "2",
                    "time": "08/05/2022-02:22:46",
                    "content": "Yes, I had it wrong… thought the “-” was just a separator, not a mathematical subtraction. I’m pretty sure @MakerMan did too since he quoted 30bps. So is the stability fee fixed for 6 months, or does it float along with ETH-A and WBTC-A stability fees? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#15",
                    "likes": "0",
                    "time": "08/05/2022-02:26:24",
                    "content": "@strat-fin-core-unit Can you please create a DAI debt versus Stability fees and cost per DAI debt graph based on the parameters proposed via this SR? At your earliest convenience, of course.  That might be helpful/visually appealing for me, and others. Also, maybe some backtesting going back to April 2020? Alright NVM, I’ll take whatever y’all can cook together  Thank you in advance! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#16",
                    "likes": "1",
                    "time": "08/05/2022-02:26:38",
                    "content": "Still confused by this:     William_Chiu:  Fixed for 6 months. After the 200m DAI minted, an additional 100m DAI minted will reduce the stability fee by 10 basis points (per vault) to a minimum of Stability fee-30bps for 6 months.   Does it mean adding 300m Dai borrowed per vault reduces the stability fee from 50bps below benchmark to 80bps below benchmark? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.9791666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#17",
                    "likes": "4",
                    "time": "08/05/2022-02:33:21",
                    "content": "Yes so at max mint it will be 1.45% + 1% OF. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#18",
                    "likes": "0",
                    "time": "08/05/2022-03:27:58",
                    "content": "    MakerMan:  You all realize that each one of these IVs clumps liquidations dramatically. I am not even sure the markets would be able to handle a cascading liquidation event. I have repeatedly insisted that these IV’s should be broken up so that they don’t liquidate in a single heap.   Isn’t this a non-issue for Liquidations 2.0. Large positions get liquidated in chunks because of the constrained throughput of auctions. eg; Seven Siblings Of course Maker would still carry a ton of risk on the unliquidated part of the position while it waits in queue, but still. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.742857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#19",
                    "likes": "1",
                    "time": "08/05/2022-07:41:09",
                    "content": "    Davidutro:  Isn’t this a non-issue for Liquidations 2.0. Large positions get liquidated in chunks because of the constrained throughput of auctions. eg; Seven Siblings Of course Maker would still carry a ton of risk on the unliquidated part of the position while it waits in queue, but still.   Can you expand for those of us who are not comfortable with the dynamics of Liq 2.0? What happens if the AntAlpha vault is liquidated (with 700m DAI debt, say) on a crash (not necessarily like a BT event but stil similar to those that happen with a predictable frequency in crypto (e.g., -20% in a day). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.814285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#20",
                    "likes": "3",
                    "time": "08/05/2022-07:52:46",
                    "content": "How can the proper functioning of the automated collateral management infrastructure be reasonably guaranteed? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#21",
                    "likes": "4",
                    "time": "08/05/2022-11:26:00",
                    "content": "I have said in the past that every time a number is reported it SHOULD NOT be a formula but an actual number after the formula to avoid precisely this kind of confusion. Provided these rates match what Nexo is paying I would be supportive. As to:     Davidutro:  Isn’t this a non-issue for Liquidations 2.0. Large positions get liquidated in chunks because of the constrained throughput of auctions. eg; Seven Siblings Of course Maker would still carry a ton of risk on the unliquidated part of the position while it waits in queue, but still.   Perhaps PE will correct me if I am wrong but. For the reasons you state this is exactly why these huge clumped liquidations are a problem.  Even with flash loans you still have to find a market for these while the price drops.   If you have 1B on the block you don’t want 900M sitting there waiting to come up for auction while the first 100M is being dealt with.   Again this is why you basically want these large vaults broken up into managable pieces with different CRs so when the first 100-200M comes under the auction block the next 700M still have a good CR (at least that is the hope).    Point here is to cause these large vault holders to spread their CRs over a range vs. heaping all collateral into a vault with a single CR because once these come under the liquidation gun - they don’t go back (as per a suggestion I had made long ago that partial liquidations could under certian circumstances actually bring a vault CR back to good - and was a reason to do only partial liquidations on vaults than to liquidate entire vaults.  I believe during liq2.0 design I was told this was not feasable technically or overly complex). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.436904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#22",
                    "likes": "1",
                    "time": "08/05/2022-14:22:17",
                    "content": "    MakerMan:  Point here is to cause these large vault holders to spread their CRs over a range vs. heaping all collateral into a vault with a single CR   I like this idea.     iammeeoh:  Can you expand for those of us who are not comfortable with the dynamics of Liq 2.0? What happens if the AntAlpha vault is liquidated (with 700m DAI debt, say) on a crash (not necessarily like a BT event but stil similar to those that happen with a predictable frequency in crypto (e.g., -20% in a day).   I was referencing this;    MIP45: Liquidations 2.0 (LIQ-2.0) - Liquidation System Redesign   Both liquidations 1.2 and 2.0 implement a limit on the total amount of DAI needed to cover the summed debt and liquidation penalty associated with all active auctions. In LIQ-1.2 this is called the box, and in LIQ-2.0 we call this the Hole. Whenever the maximum possible addition to this value is less than the amount of debt+fees that would otherwise be sent to auction, a partial liquidation is performed so as not to exceed this amount. In the current system there is only a global limit; in 2.0, in addition to the global limit, there is also a per-collateral limit.   So assuming their IV has a vault-specific limit then it will get liquidated in chunks while the rest sits in wait to be saved (like what Seven Siblings did), or to be fully liquidated. While the unliquidated part of the vault’s collateral sits there it is subject to price risk so there is a chance that by the time it goes to auction it may not be valuable enough to cover the corresponding debt. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip45-liquidations-2-0-liq-2-0-liquidation-system-redesign/6352/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.757703081232493
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adcv",
                    "index": "#24",
                    "likes": "9",
                    "time": "08/05/2022-15:10:25",
                    "content": "Hi ElPro, please find this summary over an example three-year basis.       ETH-A   WBTC-A           SF 2.25%   2.25%         Base Reduct. 50 bps   50 bps         Threshold 200.0   200.0         Addtl Reduct. / 100m 10 bps   10 bps         Origination 1.00%   1.00%          Effective Stability Fee (appl to both, annualized)     From X to Y Dai Y1 Y2 Y3     0 100 2.75% 2.25% 2.08%   100 200 2.75% 2.25% 2.08%   200 300 2.65% 2.15% 1.98%   300 400 2.55% 2.05% 1.88%   400 500 2.45% 1.95% 1.78%     Annualized Gross Interest Income (appl to both, in M DAI)     From X to Y Dai Y1 Y2 Y3     0 100 2.8 2.3 2.1   100 200 5.5 4.5 4.2   200 300 8.0 6.5 6.0   300 400 10.2 8.2 7.5   400 500 12.3 9.8 8.9     Annualized Total Gross Interest Income (appl to both, in M DAI, assuming above table x2, i.e. Dai drawn on both vaults tracks at the same rate)     From X to Y Dai Y1 Y2 Y3     0 100 5.5 4.5 4.2   100 200 11.0 9.0 8.3   200 300 15.9 12.9 11.9   300 400 20.4 16.4 15.1   400 500 24.5 19.5 17.8     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.857142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#25",
                    "likes": "2",
                    "time": "08/05/2022-16:55:58",
                    "content": "This is the kind of deal that wouldn’t need a signal request or any special effort once Deco Protocol is live. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.822510822510822
                },
                {
                    "author_link": "https://forum.makerdao.com/u/superTricycle",
                    "index": "#27",
                    "likes": "0",
                    "time": "11/05/2022-03:21:48",
                    "content": "Antpool are OGs. Looks like a win-win, let’s do it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#28",
                    "likes": "1",
                    "time": "11/05/2022-13:06:46",
                    "content": "This is a resounding YES for me ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#29",
                    "likes": "1",
                    "time": "20/05/2022-08:33:47",
                    "content": "This poll ended yesterday with a majority of non-abstain respondents in favour. An on-chain poll will follow on Monday in the “Investigate Implementation” format. Thank you to everyone that participated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#30",
                    "likes": "0",
                    "time": "19/06/2022-18:34:31",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1052"
}