{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/my-thoughts-multi-chain-market-musings/18109",
            "title": "My Thoughts & Multi-chain Market Musings ",
            "index": 18109,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "summary"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/alec",
                    "index": "#1",
                    "likes": "8",
                    "time": "27/09/2022-16:40:51",
                    "content": " My Thoughts & Multi-chain Market Musings  6912×3456 1.24 MB  Crypto denizens can be loosely broken into two categories: 1. “I’m in it for the tech” 2. “Wen Lambo?” That is to say, the mix is composed of groups with conflicting ethea. DAOs are no different. They’re made up of people, each with a unique perspective coloring the contents of their actions and decisions. It’s hard enough to form a group devoted to a singular goal and likely impossible to find one (at scale) fully in agreement on the “best” method to reach it. And it’s for the best; echo chambers may be comforting, but they’re rarely productive. Conflict can be similarly unproductive, but that depends entirely on the resolution reached. The majority of human growth can be attributed to ‘struggle’. We learn and grow through pain. Conflict in business can be an extension of this, provided the discussion remains focused and, of course, centered in reality. The first section was written with this as its core concept. The second highlights the competition, emphasizing roadmap amendments and functionality updates.  UST as a Mirror  UST was of a different breed. The embodiment of a parasitic ideology that paints the majority of human history.  “Inter arma enim silent leges”, or “for among arms, the laws are silent”.  In other words, win at all costs. Terra’s angle was not unlike Microsoft’s in the '90s. Its goal was to dominate, conquer, and destroy. That isn’t to say they correlate 1 to 1. Microsoft had the ambition, and more importantly, the means, to seize and hold control. Terra possessed only ambition. It conquered because it had to. At the scale it reached, the only way the platform could succeed was to expand and destroy. Some point to the tweet calling for the death of DAI as Do Kwon’s “Icarus moment.” I see it more as desperation. Terra relied on its social momentum, and in many ways, Terra was that momentum. Now, this might all read like aimless rambling, and perhaps it is. But every story nests an underlying truth. Here’s mine: The world is never black and white, so as we consider our path forward, we must find a balance between extremes. Growth takes time, patience, and the ability to handle an unhealthy degree of self-doubt. My hope is we tread carefully. We have one of the largest, most active, and diverse communities of any protocol in the space (I check regularly). Lean on them, as the most impactful perspective’s often come from those least involved, and lastly (I know, I know…) I’ll wrap it with an old quote:  The first draft of everything is shit. The first draft of anything is shit. The first draft of anything is rubbish.  The magic happens during the editing, or in our case RFC, process. When a poll passes, snippets of code are immortalized. So as we sift through the plethora of protocol alterations, ask questions, cast doubt, and offer improvements. Take part in their construction, and take note of the many forms. Watch as things bend, meld, and shape. Then, when it comes time to poll, all that remains is an informed decision. Myself included. I’ll do more on the revision side rather than fully focus my efforts on reporting.  Up-and-coming competitor growth  A wide range of protocols like Aave, Compound, and Yearn could slot into this category, but most of us are already familiar with them. They’re also only tangential competition (excluding Aave and its GHO stable). Instead, we’ll focus on the “late-bloomers.” FRAX and Synthetix aren’t new, but they didn’t exactly come out of the gate hot. In the case of FRAX, the decline seems fair considering its competition. No legitimate protocol could compete with UST’s scheme for now obvious reasons. And then we have Synthetix. The protocol has a strong use case, but it’s failed to generate much use for most of its lifespan. While the model was sound, Ethereum transaction fees made it unprofitable, and in a sea of simple yield farms - the concept and UI were (and are) too complex for most passersby. First, let’s quickly run through who they are and what they do. What is FRAX?  Frax is a stablecoin partially backed by external collateral complemented with the issuance of protocol shares, represented with the Frax Share (FXS) token. FRAX derives its value both as the protocol’s governance token and as a means to receive a percentage of the seigniorage the protocol generates. In this case, seigniorage mainly refers to the income produced when the collateral that backs Frax is put to work. – seba via Mirror.xyz  In other words, FRAX utilizes decentralized collateral (in various forms) to retain a partial backing ranging from ~80-90%. Just as Maker currently manages its peg primarily through the use of USDC (I am aware of the many ideas to remedy this), the FRAX Treasury is composed of shares in Convex/Curve LPs spanning several chains. This Treasury holds around 100M DAI or 1% of the circulating market cap. While this figure appears – and is – entirely underwhelming, recent announcements show it’s likely to grow. FRAX Finance’s Sam Kazemian on Blockworks Research Spaces The transcribed interview with FRAX’s founder, Sam Kazemian, begins with his thoughts on the current regulatory landscape for stablecoin issuers. Maker was referenced throughout the discussion. Kazmeian believes it’s harmful to suggest that fiat-backing is inherently wrong and that FRAX and DAI should return to overcollateralized ETH. Direct quotes can be found below. 1. “A system based on overcollateralized ETH doesn’t work.” 2. “Top stablecoin issuers already recognize the flaws in this system.” 3. “Drawing from past data, overcollateralized stablecoins cannot scale and instead shrink over time.” He goes on to say that DAI and FRAX, the two largest [decentralized] stablecoins do have fiat exposure, while the remaining tokens (LUSD, RAI, sUSD, and FEI) add up “to less than an 800 million market cap”.  \"Once you build a stablecoin project, you notice that at a point there’s a fork in the road: You can adopt a hybrid model, take on some fiat/RWA risk and continue to scale, or stay true to the immutable, decentralized ethos - but you will shrink over time.\"  This preliminary discussion set the stage for the primary topic of conversation. Where does FRAX go from here? “The Trinity” aka the FRAX Endgame Plan 1. frxETH frxETH serves as the protocol’s “endogenous” liquid staking arm. Through it, users can deposit ETH and receive frxETH in a 1:1 ratio. This newly minted frxETH can then accrue yield through a Curve pool similar to the current ETH-stETH LP or be deposited in a protocol-owned vault for additional PoS yield. frxETH aims to remain pegged 1:1 with Ether, functioning as a fully-liquid “ETH-stablecoin”. The goal is to utilize this derivative as a portion of FRAX’s backing. 2. FRAX Rollup This piece of the puzzle is the furthest from realization. Cross-chain bridge’s myriad issues have been on display throughout 2022. The FRAX team hopes to avoid this pitfall entirely by issuing native FRAX, redeemable on ETH layer-1 through an “exit mechanism”. The goal isn’t to build a rollup capable of competing with Arbitrum and Optimism, but to create “a stablecoin issuance rollup better equipped to handle trustless money.” 3. Fraxlend and Fraxswap Kazemian sees the current DeFi landscape as a “different flavour of the same three things: stablecoins, AMMs, and lending/leverage.” FRAX aims to build a native version of each, which he’s dubbed “the DeFi full-stack”. This vision begins with Fraxlend and Fraxswap. As the names imply, the products allow users to lend and swap Ethereum-based cryptocurrencies. Fraxswap functions as an AMM, and Fraxlend as an isolated lending market. By fusing these products, FRAX aims to allow custom stablecoin loans between DAOs. Fraxlend’s “customizable money and loan-backed stablecoins” This is FRAX’s attempt at shedding USDC risk in a “unique way”. Through the lending arm, myriad loans with numerous loan parameters will be created, with the end goal of finding and matching acyclical loans and debt. 4. Frax Basepool This one’s been a bit more publicized and is likely the most important variable in the equation. The BasePool is a Curve LP composed of FRAX and USDC, structured to allow BasePool LP tokens to be paired with assets in new pools.  “Instead of taking market share of others, grow the total size of the pie.”  Before the pool’s launch, FRAX made up around 20% of Curve’s total market share, primarily through subsidizing the DAI-USDC-USDT 3pool. However, additional rewards weren’t offered to MetaPools built atop this base pool. FRAX’s BasePool distributes these incentive rewards (CRV, CVX, FXS) to all MetaPools paired with the FRAX-3Crv pool. The BasePool is already live on Ethereum and should soon launch on Arbitrum and Optimism. Now, I didn’t want to paint this section with my bias before presenting the facts, but it seems fair to say that quite a bit of this sounds very familiar… But as a semi-related sidenote, watching the DeFi landscape grow and morph has been quite interesting. Dai has entrenched itself as a central building block in the financial composition of numerous DeFi protocols like Convex, FRAX, GMX, etc. What is Synthetix? Synthetix specializes in token derivatives. While numerous synthetic assets are offered, the competition lies in two primary tokens.   SNX - a governance and utility token  sUSD - a stablecoin backed by a litany of ERC-20 assets.  Through the platform, users stake SNX to mint sUSD at a 350% collateralization ratio. Stakers that maintain adequate collateralization receive weekly SNX and sUSD rewards. The protocol also chose a much more traditional governance route. Rather than delegation-centric governance, Synthetix tackled the issue of voter apathy with a more traditional method. Users elect members to the “Spartan Council.” This council then votes on proposed changes to the protocol. And therein lies their competitive advantage; the duality of SNX. It functions as a governance token, but outside of governance polling, it also offers a competitive stable, and non-stable yield. In other words, holding the token benefits the average investor and those heavily invested in protocol operations, but this only works if the scheme remains profitable for the average trader. Enter layer-2. Optimism blew the doors wide open for Sythetix to thrive. Rewards now greatly exceed the gas paid to claim them, and all protocol functionality can be performed for a fraction of the original fee. This reduction alone saw the protocol quickly accrue around 135MM in locked collateral, but future updates and overhauls hope to capture a larger market share. Updated Synthetix roadmap 1. sUSD Bridge Bridging is now built directly into the Sythetix Staking UI, enabling fee-efficient movement between layers. 2. Perps V2 and V3 Through these SIPs, Synthetix aims to construct a platform for “permissionless asset creation”, wherein any financial derivative can be built atop Sythetix V3. On the user end, the overhaul looks to simplify staking, introduce veSNX inflation weightings, and provide the option to lock for increased rewards. For devs, the overhaul allows builders to create pools supporting any financial derivative of their choosing, alleviating some of the “Cold Start” liquidity issues new protocols often face. 3. Debt Migration All debt held by the protocol was merged into a single pool. This not only combines two linked markets but also serves to increase volume (and trading fees) for both mainnet and L2 stakers. 4. Atomic Swaps Atomic swapping enables users to automatically exchange assets between chains, typically by routing through a multi-chain liquidity hub like Curve, 1inch, and Uniswap. Though the tech isn’t groundbreaking, it’s rocketed the protocol’s daily trading volume - generating up to $1M in daily fees for SNX stakers and liquidity providers.  The two may be taking different routes, but regardless of the paths traveled, they’ve shown a willingness to adapt to the roaring future. Maker’s shown a similar hunger, but it lacks focus. Initiatives are in place to assuage the communication gap, but I feel it will take a more refined community effort to find and pursue our “north star.”  “When push comes to shove, you gotta push.”  Customary NFA, and should probably toss in a Not Philosophical Advice as well - can never be too careful. Thanks for reading, caring, and being . ",
                    "links": [
                        "https://defillama.com/protocol/synthetix",
                        "https://mirror.xyz/0x5152e31dfF3C7C7fa1f7D90cef6C9EafD56bE7E7/aHfH_cSy6wToU7aWKXW07y_sL4-atFQcMNt_6Y1EQdM",
                        "https://mirror.xyz/0xfF8Fa9737169903FEb053d6320d7088cF6EC861B/mNUFetTtva7hoYSE2Ff9Ntfii-pIjqxMg9TE1KFWoAw",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/22",
                        "https://forum.makerdao.com/t/mis-pensamientos-y-reflexiones-sobre-el-mercado-multi-chain-traduccion/18131",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-21-28-de-septiembre-de-2022/18259"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.600539755603046
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "2",
                    "time": "27/09/2022-21:33:05",
                    "content": "The future is certainly multichain, however the lack of security in the bridges and the fact that DAI will always be mainnter even if there are versions created for these chains will be a big challenge. Agreeing already a couple to eat is something difficult and for a DAO with hundreds of people from different cultures is even more complicated, but I have seen unanimity in something that allows me to continue believing in Maker and is the progress and innovation, perhaps with many stumbles and slowness typical of the bureaucratic processes of a DAO, but with the intention to improve them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.026455026455027
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#3",
                    "likes": "1",
                    "time": "27/09/2022-22:41:36",
                    "content": "At this time, uncertainty surrounds the intellectual decisions of the community, we have two opposite poles and one of those, which is RWA, was taken to the well, and several who criticized real-world finance are supporting Coinbase, which is practically an RWA in disguise, but there will always be a percentage of the community that thoroughly studies each proposal, while our goal remains the same “Cryptocurrencies will be used in all possible services” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.458333333333334
                }
            ]
        }
    ]
}