{
    "poll_list": [
        {
            "title": "Proceed with Pre-Implementation Work for the Deal Outlined in MIP90 (BlockTower Liquid AAA Structured Credit and Money Market Fund) - November 21, 2022",
            "index": "18845",
            "option": "Yes (Proceed)",
            "supporting_mkr": "55,042",
            "highest_fraction": 0.83
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/request-to-poll-poll-to-move-forward-with-the-commercial-risk-legal-technical-and-other-work-necessary-to-onboard-the-deal-outlined-in-mip90/18845",
            "title": "[Request to Poll] Poll to move forward with the commercial risk, legal, technical, and other work necessary to onboard the deal outlined in MIP90 ",
            "index": 18845,
            "category": [
                "Governance"
            ],
            "tags": [
                "collateral-onboard",
                "rwa",
                "sf-001",
                "impact-:-medium",
                "blocktower"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#1",
                    "likes": "6",
                    "time": "18/11/2022-22:15:28",
                    "content": "Requesting the DAOs sentiment regarding moving forward with the assessments necessary to onboard the deal outlined in MIP90. Given the high credit quality, high liquidity, attractive yield, and relatively lower assessment requirements compared to traditional RWA vaults, the deal appears well-suited for onboarding. The deal described within MIP90 onboards a DAI 600MM RWA vault that will acquire USDC via the PSM and acquire USD 600MM of diversified, AAA (or equivalent) rated Structured Credit and Money Market Funds. All investments will be sourced on the open market in arms-length, competitive processes through investment banks and/or broker-dealers.  MIP90c1: Summary of Terms & Transaction Details     Term Details     Issuance Details: • Maker Commitment: 600mm DAI • Seniority (Structured Credit): AAA (or equivalent) • AAA Structured Credit: 70% or less of portfolio (exact limit up for vote during polling) • Money Market Funds: 30% or more of portfolio (exact limit up for vote during polling)   Indicative Return Profile: Return profile will be informed by secondary market pricing for AAA Structured Credit and Money Market Fund returns.   In today’s market we expect the following return profile:  • AAA Structured Credit: Target 6% gross return  • Money Market Fund: Target 3% gross return  (See Indicative Structured Credit AAA Return Profile for more detail)   Portfolio Concentration Limits: • Avg. Expected WAL of AAA Structured Credit: 4 years or less • Single Position Structured Credit Concentration Limit: 10% of portfolio   Execution Timeline: Expected timeline to acquire Money Market Funds is one month following the approval of this MIP. AAA Structured Credit to be invested one month thereafter.   Transaction Parties: • [RWAF] • BlockTower • Investment Banks • Broker-dealers • Exchange Agent   Maker Sacred Rights: • Pass executive vote to instruct liquidation of portfolio. (Money Market Fund to be liquidated within 7 days and Structured Credit to be liquidated within 14 days of notice) • Replacement of BlockTower as servicer• Ability to appoint independent trust director• Ability to amend Concentration Limits with 30 days notice   Transaction Fees: 1.00% of AUM, paid quarterly alongside interest distributions     ",
                    "links": [
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/33",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/30",
                        "https://forum.makerdao.com/t/calblockchain-delegate-platform/18407/5",
                        "https://forum.makerdao.com/t/pvl-delegate-platform/16022/42",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/31",
                        "https://forum.makerdao.com/t/llama-delegate-platform/15191/33",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/29",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/23",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/40",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/8"
                    ],
                    "GPT-summary": "The author of the post is explaining a proposal outlined in MIP90, which is a request to poll the DAO's sentiment regarding moving forward with the assessments necessary to onboard a DAI 600MM RWA vault that will acquire USDC via the PSM and acquire USD 600MM of diversified, AAA (or equivalent) rated Structured Credit and Money Market Funds. The post provides details on the terms, transaction details, indicative return profile, portfolio concentration limits, execution timeline, transaction parties, Maker Sacred Rights, and transaction fees. A 3rd party is asking questions about the proposal and providing constructive criticism.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Law and regulations",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.185756802721089
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#2",
                    "likes": "4",
                    "time": "18/11/2022-22:19:37",
                    "content": "Why would you buy bonds with WAL < 1.0 given Makers short liability structure? Why would you pay 1% manager fee for plain vanilla product when you can buy simple liquid Treasury ETFs such as SHV (Blackrock TBill) ETF which charges .15% manager fee? Or PIMCOs MINT (short duration investment grade bond ETF) which charges .35% manager fee and is very liquid too?  Its an actively managed fund, too, to its probably the best comparable.  Monetalis charges about 15bps fee to connect Maker to the Baille GIfford funds so add that on and you get a .5% fee which is significantly lower than 1%.  And MINT is managed by top tier credit managers, too. Too high fees for too long duration bonds ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.765575396825397
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlockTower",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/11/2022-23:35:57",
                    "content": "Hi @Eumenes, Thanks for your response! There are two ways to best ensure that invested assets align with Maker’s short-term liquidity needs, and both are interconnected. We’re happy to highlight and provide additional color on top our original post:   Short duration assets: The target portfolio will invest in short duration assets. If you reference the Prime Auto ABS AAA example provided in MIP90, you will see that the top AAA tranche has a weighted average life (WAL) of 1 year and the second tranche has a WAL of 2.6 years. These investments will start paying back right after we purchase them.   Assets with low mark-to-market volatility: The best way to ensure that an investment has low volatility is to ensure that it is risk remote. We are seeking to purchase only AAA investments on Maker’s behalf. These assets have deep, robust protections that make credit loss highly unlikely. As such, these investments seldom experience major mark-to-market drawdowns. To further reduce mark-to-market volatility, longer duration investments (which would otherwise be more exposed to mark-to-market volatility than short duration ones) will be invested in floating rate bonds, like CLOs. Floating rate coupons help insulate mark-to-market losses because the interest rate paid to investors rises and falls alongside broader market sentiment.   We have selected an asset mix that is short duration and insulated from mark-to-market risks. In response to your suggestion of investing in treasuries, we believe that short duration Treasuries are also a viable investment for Maker! Through MIP90, Maker will continue to gain exposure to Treasuries via the Money Market Fund portion of the investment plan. That said, the AAA rated securities offer a higher yield profile that we believe is an attractive risk adjusted opportunity to boost Maker’s surplus buffer. In response to your concern about fees, we believe that this is an imperfect comparison. We are proposing an active portfolio management solution that has high fixed fees to maintain. In addition, I would point out that the fees you have mentioned are fees taken by ETF managers. This does not consider the cost of actually onboarding that ETF to Maker, which is considered separately in your referenced transaction. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip90-liquid-aaa-structured-credit-money-market-fund/18428",
                        "https://forum.makerdao.com/t/mip90-liquid-aaa-structured-credit-money-market-fund/18428"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.890606398809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#4",
                    "likes": "4",
                    "time": "19/11/2022-02:17:26",
                    "content": "Is this asking for additional funds? If not, what would the poll be asking for? No one will know if it gets approved for another nine and a half weeks. If CUs think it’s a good use of existing resources, they don’t need delegate/voter approval as long as existing responsibilities aren’t being neglected. Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#5",
                    "likes": "6",
                    "time": "21/11/2022-12:18:02",
                    "content": "The following is my understanding from a brief discussion with Mark on Friday about this, although I would prefer @Aes to be following up on questions about his poll request.  SF are now mandated to direct onboarding of RWA collaterals. SF seeks to move forward with the work to onboard the deal outlined in MIP90 without waiting for a MIP ratification poll that wouldn’t end until the end of January, essentially superseding the need for MIP90 to move to a vote. Approval of this poll will see relevant Core Units start the necessary work to onboard the deal that has been outlined in MIP90. This onboarding will still require an executive vote once appropriate work is complete. GovAlpha recommends a final onboarding poll to ensure Governance is happy with the relevant assessments before progressing to the executive vote. It is unclear at this stage what this means for MIP90. I suspect if this poll is approved, it will be withdrawn as it may no longer be necessary, but @Aes or @BlockTower will need to confirm this.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.884615384615385
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#6",
                    "likes": "0",
                    "time": "21/11/2022-15:11:31",
                    "content": "    Patrick_J:  SF seeks to move forward with the work to onboard the deal outlined in MIP90 without waiting for a MIP ratification poll that wouldn’t end until the end of January, essentially superseding the need for MIP90 to move to a vote.   Assuming this indeed isn’t asking for any further funds, how is this different from providing a risk assessment prior to any other collateral onboarding other than the lack of a (now obsolete) greenlight poll specifically requesting such? Please weigh in if GovAlpha disagrees with any of the following:  It is within SF’s mandate to do this work. No new funds are being requisitioned. This appears to be akin to a MIP9 greenlight poll, asking if people value an assessment prior to a vote in January. Approval to conduct due diligence is not the same as approval of a specific onboarding.  Our general position is that no permission is needed to do what is outlined in the post, but are happy to vote on the poll. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.135606060606061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#7",
                    "likes": "1",
                    "time": "21/11/2022-15:17:15",
                    "content": "    GFXlabs:  how is this different from providing a risk assessment prior to any other collateral onboarding other than the lack of a (now obsolete) greenlight pol   I would consider this vote akin to a greenlight poll, except it will be three days instead of fourteen and has been specifically requested by a Core Unit rather than the applicant themselves.     GFXlabs:   It is within SF’s mandate to do this work. No new funds are being requisitioned. This appears to be akin to a MIP9 greenlight poll, asking if people value an assessment prior to a vote in January. Approval to conduct due diligence is not the same as approval of a specific onboarding.    Most of this seems correct. On the third point, a follow-up vote doesn’t have to happen in January. SF is mandated to propose votes related to onboarding into the weekly cycle, which could be done whenever requested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.023674242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#8",
                    "likes": "1",
                    "time": "23/11/2022-15:38:01",
                    "content": "The poll is requesting community sentiment regarding moving forward with the work and assessments necessary to onboard the deal outlined in MIP90, similar to a greenlight. If the poll passes, funding will be required to perform the work given that SF’s last budget did not include any allocation for risk and legal resources. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#9",
                    "likes": "0",
                    "time": "22/02/2023-21:38:34",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1941"
}