{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mkr-governance-dapp/8533",
            "title": "MKR Governance dApp ",
            "index": 8533,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/BastiColler",
                    "index": "#1",
                    "likes": "9",
                    "time": "04/06/2021-07:31:52",
                    "content": "I’ve only recently discovered this project and find it one of the most fascinating technology proposals in the crypto space. One thing I like in particular is the decentralized governance structu https://nox.tips/ re by MKR token holders. As far as I’ve been able to understand, MKR token holders will get to decide on CDP interest rates, asset classes, collateral %, oracles and other stuff. As I’ve recently bought some MKR, I’m wondering if the dapp platform that allows for making these governance decisions is currently still in development or has it been released already and I can already cast my votes there? If it’s still in development, maybe you can tell me what to expect as I’ve never participated in a DAO before. Thanks, you guys are an inspiration to me and I wish you all the best. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-6th-2021/8724"
                    ],
                    "GPT-summary": "The author of the post is asking for feedback on the MKR Governance dApp. They express their fascination with the project and ask if the dApp platform for making governance decisions is still in development or if they can already cast their votes. The post ends with the author expressing their admiration for the project.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.267361111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "3",
                    "time": "04/06/2021-10:35:17",
                    "content": "Right now everything is on vote.makerdao.com Welcome! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "1",
                    "time": "04/06/2021-13:28:41",
                    "content": "Adding a bit more to your answer, remember to also take into account gas prices in Ethereum, some votes will require paying network fees and others by simply signing a message. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "03/09/2021-19:29:09",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}