{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sourcecred-and-coordinape-tool-comparison/13299",
            "title": "SourceCred and Coordinape Tool Comparison ",
            "index": 13299,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "sourcecred",
                "offch-govinc-set",
                "coordinape"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "5",
                    "time": "18/02/2022-15:24:34",
                    "content": " Context As part of our response to the discussion around what to do with SourceCred, @hernandoagf from GovAlpha looked into Coordinape, a newer tool that aims to solve similar problems to SourceCred. Assuming some base level of familiarity with SourceCred, this post compares the two across a number of headings. Posts in the Off-Chain Governance Incentives Set  Off-Chain Governance Incentive Objectives SourceCred Report SourceCred and Coordinape Tool Comparison List of Options and Recommendations (coming soon.)   SourceCred and Coordinape Tool Comparison      SourceCred Coordinape     How it works Algorithm that measures plugin (Discourse) interactions and produces a token distribution based on the configured weights for those  interactions Members of a group (circle) are given a certain amount of tokens (GIVE) each period which they can allocate to other members based on their contributions. After each period a distribution is generated based on the total amount of GIVE allocated   How to use Users feed data to the algorithm by just using the forum. The algorithm fetches forum information by using its API Users need to connect to Coordinape site and manually allocate their GIVE to other members of the circle each period (epoch)   Target team/org size Performs better when used in relatively large groups/communities. The larger the community, the more data it can evaluate to produce better results Although a circle can have 200+ users, they are thought to be used for smaller groups where members interact with each other since it can become difficult to remember contributions from tons of users   New users onboarding 3 step process where users opt in, maintainers validate their account and then maintainers activate opted in users in the instance - Admins can add new users to the circle- Circle members can invite new users and they will be added to the circle if enough members vouch for them   Decentralization - Distributions: all users that are active in the forum indirectly take part in how funds are distributed by interacting (giving likes) to posts and topics- User onboarding: only maintainers have the power to onboard new users- User and contributions data: stored in the GitHub instance and any alternative system (Google sheets, DBs, etc) - Distributions: only members of the circle have a say in how funds will be distributed by allocating their GIVE- User onboarding: every member of the circle can propose and vote for users to join the circle- User and contributions data: stored in Coordinape DBs   Contribution evaluation precision It can measure lots of contributions easily in an automated way but its precision depends on every user in the forum correctly understanding how the algorithm works and what giving a like represents It offers a more direct reward allocation mechanism where every user gets a limited amount of tokens that they can distribute based on how valuable they think other users contributions were   Overhead SourceCred needs maintainers to ensure the instance works well and to come up with the best configuration parameters based on weights given to contributions, which can take time. They also handle user onboarding and distributions generation Coordinape circles and user information live inside Coordinape DBs and can be accessed through their app, which makes maintenance almost unnecessary. Distributions are easily generated at the end of an epoch and user onboarding can be handled by the members of the circle   3rd party applications support Provides a public API that can be used to interact with the instance, that paired with the fact that instances live in different GitHub repos make the development of custom applications possible. These applications can be used to automate some of the maintenance tasks Doesn’t provide a public API yet   Supported plugins / contributions Limited to contributions from supported plugins only (Discourse, GitHub and Discord), can account for external contributions through a Props Discord channel Since it depends on user allocations, multiple kinds of contributions can be rewarded through it     ",
                    "links": [
                        "https://coordinape.com/",
                        "https://forum.makerdao.com/tag/offch-govinc-set",
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-objectives/13298",
                        "https://forum.makerdao.com/t/sourcecred-report/13277",
                        "https://forum.makerdao.com/t/sourcecred-and-coordinape-tool-comparison/13299",
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-objectives/13298",
                        "https://forum.makerdao.com/t/signal-request-sourcecred-stop-paying-people-who-are-already-paid-by-makerdao/12971/41",
                        "https://forum.makerdao.com/t/off-chain-governance-list-of-options-and-recommendations/13373",
                        "https://forum.makerdao.com/t/relay-semana-22-28-de-febrero-del-2022/13587",
                        "https://forum.makerdao.com/t/weekly-relay-february-22-28-2022/13499",
                        "https://forum.makerdao.com/t/forum-at-a-glance-february-17-24-2022/13425"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.337765409193981
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/05/2022-21:25:16",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}