{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/consolidated-budget-worksheet/17629",
            "title": "Consolidated Budget Worksheet ",
            "index": 17629,
            "category": [
                "Core Units",
                "Strategic Finance"
            ],
            "tags": [
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#1",
                    "likes": "2",
                    "time": "02/09/2022-21:52:09",
                    "content": " Background Following up on the discussion last week surrounding the Target Spend Level, we are releasing a simple worksheet for MKR holders, Delegates, and community members to model potential changes to the budget as part of the budget reduction / endgame process. We hope that this tool will aid the discussion of various future budget permutations and allow MKR holders and delegates to quantitatively express their view on a potential budget options. Consolidated Budget Worksheet Please copy down your own file to make changes. Let me know if you have any questions or changes you want reflected.  Worksheet Notes  Consolidated Budget Tab  Contains a worksheet that allows users to choose between four illustrative budget options (Lights On, Base, Growth, and Override) for each core unit  Growth corresponds to the current actual (not budgeted) spend of the core unit Base represents a 10% cut to current actual spend Lights On represents a 25% cut to current actual spend Override allows users to choose a specific budget number, including full offboarding of the CU (corresponding to 0 budget)     L6M CU Spend Tab  Contains the budgeted, actual, and variance in spend for each CU through July, including projections through October     @PaperImperium @ultraschuppi @strat-fin-core-unit ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-and-risk-207-thursday-september-08-at-17-00-utc/17794/2",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/15"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.798611111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PonJerry",
                    "index": "#2",
                    "likes": "1",
                    "time": "02/09/2022-23:09:30",
                    "content": "Issue:  your L6M numbers for Events-001 only account for 4 months of spending (actual spending since creation in May).  In turn, this makes your N6M projection numbers only valid for 4 months of spend and not 6 months. The annualized L6M x 2 on the other tab is a correct projection (provided by Events-001). ~643k ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pipko",
                    "index": "#3",
                    "likes": "1",
                    "time": "02/09/2022-23:44:18",
                    "content": "Thanks–I’ve updated the sheet to reflect $643k annual, $322k pro forma L6M spend. I also pro forma’d the actual spend to reflect a 6 month number. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "01/12/2022-23:45:11",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}