{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/b-protocol-is-live-give-rewards-to-vault-holders-and-help-make-makerdao-more-stable/4888",
            "title": "B.Protocol is live: give rewards to Vault holders and help make MakerDAO more stable ",
            "index": 4888,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "bprotocol"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#1",
                    "likes": "7",
                    "time": "27/10/2020-15:33:13",
                    "content": "B.Protocol is LIVE! Start using the app here - https://bprotocol.org/app If you have a MakerDAO ETH-A Vault or want to open one, you can now get rewarded for managing it via B.Protocol interface, and you can find more details here. What users get:  Accumulate B.Protocol Rating Get your share of the backstop liquidation proceeds according to their Rating Start using B.Protocol early to get more Rating First month has Rating accumulation rate of x2 Contract is already seeded with $10k in ETH  Governance: After a 6 months period, 100% of voting power will go to the users, no premining or VC allocation. Users could vote on a protocol upgrade to determine the future proceeds distribution scheme. Governance does not, and will not have control over user deposits B.Protocol is a backstop liquidity protocol for decentralized lending platforms. A new lego primitive bringing traditional finance systems best practices into DeFi, aiming to stabilize the ~$10b market of DeFi assets crucially dependent on adequate liquidation processes Our first integration is over MakerDAO. Users can import their ETH-A vault with one click, or open a new Vault using B.Protocol to gain a share of liquidation proceeds. B.Protocol Liquidators share proceeds with users in return for a priority on the liquidation process. If you need any support as for how to start with B.Protocol or just want to join the on-going discussion please head over to our Discord - https://discord.gg/bJ4guuw. For a deeper dive you can read B.Protocol’s whitepaper here - https://medium.com/b-protocol/b-protocol-b6dd4e3bf9c0…. Who benefits from B.Protocol:  MakerDAO as a platform becomes more stable due to more committed liquidators Liquidators avoid gas wars and shift MEV (Miners Extracted Value) to users Users get more from their Vaults while helping to secure the platform  The smart contract code was audited by Solidified. ",
                    "links": [
                        "https://bprotocol.org/app",
                        "https://t.co/Acw8cbavEf?amp=1",
                        "https://t.co/RON4o6VLPh?amp=1",
                        "https://t.co/rMOPgLPOyN?amp=1",
                        "https://twitter.com/SolidifiedHQ/status/1313158774815817728?s=20"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.277571634714492
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#2",
                    "likes": "2",
                    "time": "28/10/2020-20:31:07",
                    "content": "This is pretty neat. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#3",
                    "likes": "2",
                    "time": "28/10/2020-23:49:17",
                    "content": "I think this will prove to be a critical part of the DeFi infrastructure in time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}