{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/wbtc-b-collateral-onboarding-risk-assessment/11397",
            "title": "[WBTC-B] Collateral Onboarding Risk Assessment ",
            "index": 11397,
            "category": [
                "Collateral Onboarding",
                "Domain Work"
            ],
            "tags": [
                "wbtc",
                "risk-domain-work",
                "wbtc-b"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#1",
                    "likes": "16",
                    "time": "03/11/2021-15:39:59",
                    "content": "Legal Disclaimer: This communication is provided for information purposes only. This communication has been prepared based upon information, including market prices, data and other information, from sources believed to be reliable, but Maker has not independently verified such information and makes no representations about the enduring accuracy of the information or its appropriateness for a given situation. This content is provided for informational purposes only, and should not be relied upon as legal, business, investment, or tax advice. You should consult your own advisers as to those matters. References to any digital assets and the use of finance-related terminology are for illustrative purposes only, and do not constitute any recommendation for any action or an offer to provide investment advisory services. This content is not directed at nor intended for use by the MakerDAO community (“MakerDAO”), and may not under any circumstances be relied upon when making a decision to purchase any other digital asset referenced herein. The digital assets referenced herein currently face an uncertain regulatory landscape in not only the United States but also in many foreign jurisdictions, including but not limited to the UK, European Union, Singapore, Korea, Japan and China. The legal and regulatory risks inherent in referenced digital assets are not the subject of this content. For guidance regarding the possibility of said risks, one should consult with his or her own appropriate legal and/or regulatory counsel. Charts and graphs provided within are for informational purposes solely and should not be relied upon when making any decision. The content speaks only as of the date indicated. Any projections, estimates, forecasts, targets, prospects, and/or opinions expressed in these materials are subject to change without notice and may differ or be contrary to opinions expressed by others.  Summary Proposed Risk Parameters Overview Metrics and Analysis Risk Parameters   Summary Proposed Risk Parameters Stability Fee: 5% Liquidation Ratio: 130% Debt Ceiling: 500m DC-IAM gap: 30m DC-IAM ttl: 8h Cut: 0.99 Step: 60 seconds Buf: 1.2 Cusp: 0.4 Tail: 90 minutes Chip: 0.1% Tip: 300 DAI Ilk.chop: 13% Tolerance: 0.5 Ilk.hole: 25m DAI Dust: 30.000 DAI  Overview The first WBTC assessment by the Risk Core Unit was published in March, 2021, called “State of wrapped bitcoin (WBTC)”. Since then, the WBTC project has experienced significant growth and adoption. During the same period, the amount of WBTC locked in the Maker Protocol has increased rapidly. This assessment is a follow-up from our latest WBTC related forum post, [WBTC-B] and [WBTC-BProt-A]: Review and Plan of Action, where we presented the main reasons for onboarding a WBTC-B vault. The report presents updated WBTC data that will serve as a benchmark to evaluate WBTC specific risks and to set appropriate risk parameters for the WBTC-B vault. In order to learn more about the underlying mechanisms of WBTC, we recommend reading @Risk-Core-Unit’s previous WBTC report - “State of wrapped bitcoin (WBTC)”, which provides a more comprehensive introduction and overview of the project.  Metrics and Analysis  Trading Volume and Liquidity  CEX Trading Volume This year we saw a clear trend of increased CEX trading volume for WBTC. The trading volume peaked, and subsequently decreased significantly, after the May 19th crash. Nevertheless, WBTC is currently maintaining a relatively healthy daily trading volume with an average daily volume of $33 million since June. The most dominant trading venues for WBTC are (i) FTX, (ii) FTX.us, (iii) Binance, and (iv) Coinbase. It is important to note, however, that the main purpose of WBTC is to offer a BTC pegged asset on Ethereum. This makes CEX trading volume, compared to DEX trading volume, a less relevant metric to assess.  Chart1200×742 28.2 KB  Source: CryptoCompare  DEX Trading Volume DEX trading volume, on the other hand, has been steadily increasing. As illustrated in the chart below, DEX trading volume has followed a similar pattern to CEX trading volume, peaking in May, 2021. For the first part of the year, most trading volume was concentrated on Uniswap and Sushiswap. In July 2021, Curve introduced an additional AMM design for non-pegged tokens, such as the Tricrypto2 pool, which contains ETH+WBTC+USDT. This resulted in Curve attracting a lot of the WBTC trading volume. Currently, the Curve Tricrypto2 pool is the most liquid AMM and offers the least amount of slippage for larger trade amounts.  1600×519 151 KB  Source: DuneAnalytics  Chart1600×989 227 KB  Source: Block Analitica & TheGraph  On-chain liquidity On-chain liquidity, the most important metric for 1-tx flash loan liquidations, has also experienced steady growth since the crash in May, 2021. Similar to DEX trading volume, the Curve Tricrypto2 pool is gaining the most liquidity. The increasing on-chain liquidity directly impacts the slippage curve. More information on the WBTC slippage curve is set out below.  Chart1200×742 76.4 KB  Source: Blockanalitica & TheGraph  Outstanding Supply and Holder Distribution  Unique addresses holding WBTC WBTC has seen rapid growth and adoption, with a clear upsurge in unique addresses in September, 2020. At the time of writing, circa 40,258 unique Ethereum addresses are holding WBTC. Unique Addresses for Token  1056×490 22 KB  Source: Nansen  Outstanding supply (WBTC on Ethereum) The chart below illustrates the amount of WBTC on the Ethereum chain over time. At the time of writing, approximately 227,862 WBTC is available on Ethereum. This implies an 84% increase since March 1, 2021.  Chart1200×742 16.4 KB   Holder Distribution As illustrated by the pie chart below, the majority of WBTC tokens are being held within DeFi protocols and L2 bridges.  1104×391 39.6 KB  Source: Etherscan  Downside Risk WBTC is a wrapped ERC20 token representation of BTC on the Bitcoin blockchain. This means that the downside risk of WBTC should theoretically be the same as for BTC, with added price discrepancies between the two assets that can occur if WBTC for whatever reason depegs from the BTC price. The chart below highlights the most significant drawdown events for BTC. The observed period for the daily drawdown data is from December 2015, while the observed period for the hourly drawdown data is from May, 2019. Drawdowns - Price Jumps  1330×764 61.5 KB  Source: Block Analitica & CryptoCompare The chart below illustrates the on-chain slippage curve for the WBTC-DAI trading pair, measured by the 1Inch DEX aggregator. Selling $500 million worth of WBTC would incur a -32% decrease in price. The slippage curve was higher three months ago, where selling $500 million worth of WBTC would incur a -38% price decrease, which shows that liquidity is increasing. On-chain Price Slippage - Pair: WBTC-DAI  Source: Block Analitica  WBTC Specific Risk - the peg discount WBTC is a tokenized asset which can diverge in price from the underlying asset due to several unexpected market dynamics or system issues. An unexpected WBTC price discount will make the valuation of the asset, as well as the bid decision, harder for Keepers. Large discounts are unlikely to happen. If they do, they will most likely be arbitraged by large market makers that can afford to wait for hours or days until the peg stabilises. Because of a natural lower buffer due to low LR compared to standard vaults in Maker, and the addition of possible WBTC/BTC discount, we will use a shorter auction cycle duration than with standard vaults. Similar to ETH-B, one cycle will last for ~20 minutes and not standard ~30 minutes.  DeFi Presence  BTC on Ethereum The table below shows the nine largest ERC20 bitcoin projects on Ethereum today. The total amount of BTC on Ethereum is currently 290,678 BTC. The WBTC project is the most dominant BTC project on Ethereum. It makes up the majority (76.65%) of available tokenized BTC. By way of comparison, HBTC, the second largest BTC project on Ethereum, makes up 13.72% of total BTC liquidity. Total BTC on Ethereum  Source: Btconethereum  WBTC on DeFi Protocols and Platforms WBTC has become a widely accepted collateral type across several DeFi protocols. The chart below illustrates the balances across the top five WBTC holders. Out of the DeFi projects presented in the chart, MakerDAO holds the most amount of WBTC. However, both Aave v2 and Compound have caught up with MakerDAO. On some occasions, both Aave and Compound have surpassed MakerDAO in total WBTC locked. At the time of writing, approximately 35,714 BTC is locked in MakerDAO. This means that MakerDAO holds circa 15.8% of all available WBTC on Ethereum. Meanwhile, Compound holds circa 14.2% and Aave 13.3%. Top Holders: Balances  1600×473 164 KB  Source: Nansen  Summary of notable risks or red flags  WBTC governance and system is robust. Central point of failure is the custodian, who is currently BitGo. Considering that BitGo is serving important financial institutions in crypto, we believe that it is a type of market risk. WBTC is a pegged asset, which means that the price can diverge from the underlying BTC. As a collateral asset, this implies the risk of an additional potential price drop in addition to the underlying asset. For example, if BTC drops by 30%, and for whatever reason WBTC/BTC trades at a discount, then the WBTC/USD price would drop >30%. Before the liquidation system 2.0, the risk team recommended avoiding a low LR vault for WBTC. However, we believe that the current system is much more efficient and that the lower liquidation ratio is now much less risky. The historical WBTC/BTC peg has remained quite stable. We believe that, in addition to the KYC verified users and merchants who would normally be performing Ethereum-Bitcoin blockchain arbitrage, many other users from CEX and DEX venues would bid on WBTC in anticipation of later convergence to the peg. As a consequence, we believe that a large WBTC discount would not persist for longer than a few hours. Low LR vault types have an increased chance of OSM delay attack risk. This means that an attacker would be able to mint unbacked DAI during the time of market price crash, while the internal system price updates due to the OSM. Historically BTC has less sharp drops compared to ETH. The largest one in recent years of trading history was on Black Thursday in March 2020, when the BTC price dropped by -35% in one day. The OSM delay attack is limited with a gap parameter under the DC-IAM. For this reason, it is important that we do not increase the gap too much.  Collateral Onboarding Risk Model - WBTC-B As illustrated in the chart below, the risk premium at maximum utilization will be 5.5% with the selected parameters. In the beginning of the vault launch, the risk premium will likely be higher, due to the fact that all vaults are new to the system and therefore untested by a market crash, where they will be labelled as high risk users. With time and market stress testing, some users will become medium or low risk and risk premium will subsequently decrease.  1600×699 69.8 KB  Source: Block Analitica  Proposed Risk Parameters Stability Fee: 5% Liquidation Ratio: 130% Debt Ceiling: 500m DC-IAM gap: 30m DC-IAM ttl: 8h Cut: 0.99 Step: 60 seconds Buf: 1.2 Cusp: 0.4 Tail: 90 minutes Chip: 0.1% Tip: 300 DAI Ilk.chop: 13% Tolerance: 0.5 Ilk.hole: 25m DAI Dust: 30.000 DAI A link to our model specification with inputs and outputs can be found here. Data for graphics included in this report can be found here. Lead Researchers: @Primoz, @rema & @Sean Sources:  MakerDAO; [WBTC-B] and [WBTC-BProt-A]: Review and Plan of Action; October, 2021 MakerDAO; State of wrapped bitcoin (WBTC); October, 2021 Block Analitica; MakerDAO Risk Dashboard | Block Analitica October 2021 Nansen; Nansen October, 2021 Dune Analytics; https://dune.xyz/ ; October, 2021 WBTC; Wrapped Bitcoin ( WBTC ) an ERC20 token backed 1:1 with Bitcoin October, 2021 Etherscan; https://etherscan.io/; October, 2021 Santiment; Sanbase October, 2021 CryptoCompare; https://www.cryptocompare.com/; November, 2021 Btconethereum; BTC on Ethereum November; 2021  ",
                    "links": [
                        "https://forum.makerdao.com/t/wbtc-b-and-wbtc-bprot-a-review-and-plan-of-action/11191",
                        "https://forum.makerdao.com/t/state-of-wrapped-bitcoin-wbtc/6800",
                        "http://FTX.us",
                        "https://www.cryptocompare.com/",
                        "https://dune.xyz/queries/218668",
                        "https://maker.blockanalitica.com/assets/WBTC/",
                        "https://thegraph.com/en/",
                        "https://maker.blockanalitica.com/assets/WBTC/",
                        "https://thegraph.com/en/",
                        "https://pro.nansen.ai/token-god-mode/segments?token_address=0x2260fac5e5542a773aa44fbcfedf7c193bc2c599",
                        "https://etherscan.io/token/tokenholderchart/0x2260fac5e5542a773aa44fbcfedf7c193bc2c599",
                        "https://maker.blockanalitica.com/assets/WBTC/",
                        "https://www.cryptocompare.com/",
                        "https://maker.blockanalitica.com/assets/WBTC/",
                        "https://btconethereum.com/",
                        "https://pro.nansen.ai/token-god-mode/notable?token_address=0x2260fac5e5542a773aa44fbcfedf7c193bc2c599",
                        "https://maker.blockanalitica.com/vaults/onboarding/WBTC-B/",
                        "https://maker.blockanalitica.com/vaults/onboarding/WBTC-B/",
                        "https://docs.google.com/spreadsheets/d/1q-A8zqi5KrRxLiS8LPr9N7fybYyPoDQeuuhWNBpxjeA/edit?usp=sharing",
                        "https://forum.makerdao.com/t/wbtc-b-and-wbtc-bprot-a-review-and-plan-of-action/11191",
                        "https://forum.makerdao.com/t/state-of-wrapped-bitcoin-wbtc/6800",
                        "https://maker.blockanalitica.com/;",
                        "https://pro.nansen.ai/;",
                        "https://dune.xyz/home",
                        "https://wbtc.network/;",
                        "https://etherscan.io/;",
                        "https://app.santiment.net/;",
                        "https://www.cryptocompare.com/;",
                        "https://btconethereum.com/;",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-28th-november-4th/11441",
                        "https://forum.makerdao.com/t/maker-relay-ep-70/11528",
                        "https://forum.makerdao.com/t/maker-relay-ep-70-en-espanol/11569",
                        "https://forum.makerdao.com/t/under-construction/12274/12",
                        "https://forum.makerdao.com/t/proposed-risk-parameters-for-wbtc-c-vault-type/11707",
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-november-2021/11914"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.645178043501215
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#2",
                    "likes": "2",
                    "time": "03/11/2021-16:17:28",
                    "content": "Thanks rema, a thorough assessment from the risk team as always. Could I ask why you’re suggesting a lower stability fee for WBTC-B than the rate for ETH-B proposed by the MOMC given the liquidity risks you mention? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rema",
                    "index": "#3",
                    "likes": "3",
                    "time": "03/11/2021-17:43:03",
                    "content": "Thank you. We expect that actual debt exposure will be lower than the current WETH-B is. If debt issued increases substantially risk or MOMC will recommend an increase to SF. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "0",
                    "time": "04/11/2021-02:06:21",
                    "content": "Will be interesting to see how the markets spread their appetite for borrowing here. I also find it interesting that more and more we are doing what I suggested over a year ago now. Tiered vault structures for the same collateral type so users can actually have and make a choice. This has the positive effect of declumping liquidation risk.  Back in the day people told me this would add too much complexity to vault management, but here we are.   It is something that I knew would naturally happen particularly if Maker only had a few vault types with significant DC.   It is also a way that Maker could spread the liquidation risk profiles with IV players that should be seriously considered.   There are multiple reasons for this.  One is to declump liquidation risk, the other will be to stagger longer term lending rate terms across IV vaults. Is there any data regarding the general trends of CR vs. LR on these vaults?   Do certain vaults have a better CR/LR ratio than others? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.793722943722943
                },
                {
                    "author_link": "https://forum.makerdao.com/u/josolnik",
                    "index": "#5",
                    "likes": "2",
                    "time": "04/11/2021-11:25:49",
                    "content": "@MakerMan You can find the chart comparison of vault type average debt-weighted CR to its LR in our dashboard (bottom of page). When comparing ETH-collateralized vaults:  Screenshot from 2021-11-04 12-21-272267×585 148 KB  The CR to LR multiplier (spread) grows with the vault type’s LR. The most risk-tolerant vault type is ETH-B, the most risk-averse is ETH-C. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "1",
                    "time": "04/11/2021-12:02:47",
                    "content": "Ah.  I rarely click through links.   Thank you for pulling it in.   Very interesting to see that. What it shows is that having the different CR/LR/SF actually creates a nice staggered CR which reinforces my thesis from long ago that this would be a suitable way to spread liquidation risk. Something we should really think about for Institutional Vaults. BTW:  If I am reading the data right it looks like we could use another ETH vault right between ETH-B and ETH-A ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.410714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "02/02/2022-12:02:47",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}