{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/uniswap-faces-a-new-class-action-lawsuit-from-meme-coin-traders/14658",
            "title": "Uniswap faces a new class action lawsuit from meme coin traders ",
            "index": 14658,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "regulation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#1",
                    "likes": "4",
                    "time": "16/04/2022-18:13:21",
                    "content": "In case anyone has not heard about this new class action lawsuit against Uniswap, here is a link to one of the many articles online.    The Block    Class action lawsuit accuses Uniswap Labs, its investors of allowing... A new class-action lawsuit from a Uniswap user alleges that Uniswap Labs and its backers are culpable for her losses due to a failure to comply with securities laws.      •\tAccording to the joint press release put out by the two law firms engaged in the action, the allegations are that Uniswap (and the other defendants) violated the securities laws by offering and selling unregistered securities in the form of digital tokens on the Uniswap exchange, including Uniswap’s own UNI token. •\tWhile they did name the UNI token, the lawsuits seeks to remedy investors who utilized Uniswap to purchase the EthereumMax, Bezoge, Matrix Samurai, Alphawolf Finance, Rocket Bunny, and BoomBaby.io. Being that this action pertains to an asset which has yet to be designated a commodity or a security, it should be interesting to watch. Happy reading and learning! ",
                    "links": [
                        "https://www.theblockcrypto.com/linked/141853/class-action-lawsuit-accuses-uniswap-labs-its-investors-of-allowing-fraudulent-activity-on-the-dex-protocol",
                        "http://BoomBaby.io"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.966450216450216
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "1",
                    "time": "16/04/2022-18:25:36",
                    "content": "I remember few years ago “DEX” EtherDelta was fined for operating unregistered securities. However, their structure was very different from Uniswap so will be indeed interesting to see what happens. Etherdelta Founder Fined $400K for Operating Unregistered Securities Exchange – Exchanges Bitcoin News. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#3",
                    "likes": "3",
                    "time": "16/04/2022-19:53:58",
                    "content": "Based upon what I was reading, it really is unclear how the attorneys plan to invoke the securities laws. Here is a link to the complaint: I wasn’t able to download it without using PACER (the federal court’s e-filing system) so hopefully this will work in case people want to read it:   Scribd    Risley vs Universal | PDF | Cryptocurrency | Market Liquidity Source: PACER      It’s fitting that this matter has been brought in the Southern District of New York (SDNY) as other crypto related actions, both criminal and civil, are being prosecuted in the district. The SDNY is sometimes known as the “Sovereign” District of New York due to the US Attorney’s  SDNY office tending to do its own thing, that sometimes includes bucking the trends of the Justice Department. I predict that going forward many of the relevant federal cases in the US will also be venued in the SDNY (which includes Wall Street). The Judges in the SDNY, as well as the 2nd Circuit Court of Appeals Judges, will likely become the more knowledgeable. ",
                    "links": [
                        "https://www.scribd.com/document/569787087/Risley-vs-Universal#download&from_embed"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.700757575757576
                }
            ]
        }
    ]
}