{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/el-salvador-remittance-case-for-dai/16454",
            "title": "El Salvador - Remittance case for DAI ",
            "index": 16454,
            "category": [
                "Latin America"
            ],
            "tags": [
                "news"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#1",
                    "likes": "11",
                    "time": "08/07/2022-19:17:30",
                    "content": "El Salvador continues its crypto adoption by enabling free BTC remittances, link here. Remittances account for about 25% of El Salvador’s GDP and by disintermediating TradFi and payment providers, they are estimating $400M in annual savings. Given that El Salvador has two official currencies, BTC and USD, Salvadoreans are adopting crypto wallets at a faster pace than others. BTC vaults are probably an attractive product given this dual-currency. Have we been able to capture some of this growing market? Spanish version below - Apologies in advanced, used google translate. El Salvador continúa con su adopción de criptomonedas al habilitar las remesas gratuitas de BTC, enlace aquí. Las remesas representan alrededor del 25 % del PIB de El Salvador y, al desintermediar a TradFi y a los proveedores de pago, estiman un ahorro anual de $400 millones. Dado que El Salvador tiene dos monedas oficiales, BTC y USD, los salvadoreños están adoptando billeteras criptográficas a un ritmo más rápido que otros. Las bóvedas de BTC son probablemente un producto atractivo dado esta estructura dual. ¿Hemos sido capaces de capturar parte de este mercado en crecimiento? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "08/07/2022-19:23:35",
                    "content": "How attractive is it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/nahueth",
                    "index": "#3",
                    "likes": "9",
                    "time": "08/07/2022-22:04:45",
                    "content": "As the world expected El Salvador continues enforcing their promise on a journey to an BTC for all, at all. The global macro and the actual world juncture are the best test scenarios to rise up or die doing this, hopefully they can adjust their economic and social reality to an hybrid paradigm between FIAT & crypto. Por cierto, este post esta en ingles en la parte LATAM del foro, no sería interesante tener la versión traducida? Así la comunidad puede aportar sus visiones y pensamientos al respecto de este caso tan particular. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.928571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rachel_G",
                    "index": "#4",
                    "likes": "2",
                    "time": "10/07/2022-20:46:36",
                    "content": "We should test the market to see consumer appetite. Could Maker do a partnership with a wallet or a centralized exchanged to increase engagement and awareness of the use case? Seems like there’s potential for revenue growth. @Growth-Core-Unit ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FuchoCrypto",
                    "index": "#5",
                    "likes": "8",
                    "time": "11/07/2022-05:00:18",
                    "content": "    nahueth:  Por cierto, este post esta en ingles en la parte LATAM del foro, no sería interesante tener la versión traducida? Así la comunidad puede aportar sus visiones y pensamientos al respecto de este caso tan particular.   Ciertamente @nahueth. Me tomé la libertad de traducir el interesante artículo de Gareth Jenkinson  al cual hace refrencia nuestro compañero @TRUEMAKER. Saludos.   La billetera Bitcoin de El Salvador, Chivo, obtiene $52 millones en remesas en 2022 La aplicación de pago de El Salvador, Chivo, procesó $52 millones en remesas durante los últimos seis meses, ya que los expatriados hacen uso de transferencias en BTC sin comisiones. Los salvadoreños residentes en el exterior enviaron más de $50 millones en remesas de enero a mayo de este año, según el Banco Central de Reserva de El Salvador. Douglas Rodríguez, presidente del Banco Central de El Salvador, desglosó el miércoles el panorama económico general del país en el noticiero de la televisión local Frente a Frente . Una conclusión importante fueron los $52 millones en remesas procesadas por el servicio nacional de billetera digital Chivo durante los primeros cinco meses del año. Esto marca un aumento del valor del 3.9%, 118 millones de dólares, en comparación con el mismo período de 2021. Chivo se lanzó en septiembre de 2021 cuando el país centroamericano se convirtió en el primero del mundo en adoptar Bitcoin (BTC) como moneda de curso legal. Según los informes, el lanzamiento de la aplicación atrajo a más de 2 millones de usuarios en menos de un mes, lo que al principio provocó problemas importantes para la plataforma de pago respaldada por el Estado. El proveedor de servicios de pago autorizado por el gobierno se relanzó en febrero de este año, debido a la incorporación de aproximadamente 4 millones de usuarios que buscaban hacer uso de tarifas bajas para pagos y transferencias realizadas en BTC. La empresa estadounidense de software de intercambio de criptomonedas AlphaPoint se incorporó para abordar los problemas de escalabilidad y estabilidad. Chivo ofrece a los usuarios transferencias y pagos sin comisiones en BTC y dólares estadounidenses. El presidente de El Salvador y defensor del Bitcoin, Nayib Bukele, afirmó anteriormente que la aplicación ahorrará a los ciudadanos unos $ 400 millones en comisiones anuales gastadas al utilizar proveedores de servicios de pago y remesas convencionales en el país. La aplicación también utiliza el protocolo de pago de capa 2 de Bitcoin Lightning Network, que proporciona transacciones BTC a bajo costo. La adopción del Bitcoin y Chivo en El Salvador ha tenido un efecto medible en el aumento de los volúmenes de transacciones de Lightning Network, con un aumento del 400% en el volumen de pagos durante el último año. Puedes acceder a través del siguiente link al artículo original publicado en inglés:    Cointelegraph    El Salvador's Bitcoin wallet Chivo scores $52M in remittances in 2022 El Salvador payment app Chivo processed $52 million in remittances over the past 6 months, as expatriates make use of commission-free BTC transfers.      ",
                    "links": [
                        "https://cointelegraph.com/authors/gareth-jenkinson",
                        "https://www.youtube.com/watch?v=MrHAqDONvTg",
                        "https://cointelegraph.com/news/bitso-to-assist-the-launch-of-el-salvador-s-official-bitcoin-wallet-chivo",
                        "https://cointelegraph.com/bitcoin-price",
                        "https://cointelegraph.com/news/a-third-of-salvadorans-actively-using-chivo-wallet-president-bukele-claims",
                        "https://cointelegraph.com/news/el-salvador-s-bitcoin-wallet-is-95-fixed-president-bukele-says",
                        "https://cointelegraph.com/news/el-salvador-relaunches-chivo-wallet-plans-to-deploy-1-500-bitcoin-atms",
                        "https://cointelegraph.com/news/el-salvador-s-bitcoin-wallet-onboards-4m-users-with-netki-partnership",
                        "https://cointelegraph.com/news/cashapp-and-chivo-help-drive-lightning-payment-volume-up-400",
                        "https://cointelegraph.com/news/el-salvador-s-bitcoin-wallet-chivo-scores-52m-in-remittances-in-2022?utm_source=Iterable&utm_medium=email&utm_campaign=campaign_4625181",
                        "https://cointelegraph.com/news/el-salvador-s-bitcoin-wallet-chivo-scores-52m-in-remittances-in-2022?utm_source=Iterable&utm_medium=email&utm_campaign=campaign_4625181"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.300925925925926
                },
                {
                    "author_link": "https://forum.makerdao.com/u/One_Pastrami",
                    "index": "#6",
                    "likes": "8",
                    "time": "19/07/2022-21:53:30",
                    "content": "  laprensalatina.com    Cryptocurrency makes up just 1.9 pct. of remittances in El Salvador - La... San Salvador, May 25 (EFE).- More than eight months after El Salvador adopted Bitcoin as a legal tender, the country has received some $96.3 million via cryptocurrency wallets but it has not become a major method for citizens living and working...  Est. reading time: 2 minutes       Still a long way to go though… ",
                    "links": [
                        "https://www.laprensalatina.com/cryptocurrency-makes-up-just-1-9-pct-of-remittances-in-el-salvador/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.890625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joselyn",
                    "index": "#7",
                    "likes": "5",
                    "time": "22/07/2022-01:31:42",
                    "content": "    One_Pastrami:  Still a long way to go though…   That’s right. That figure can be seen as little, but for the time that BTC has been implemented as legal tender in El Salvador it is a great advance. It also depends a lot on the culture of the Salvadoran who is outside, whose context is different from the one that is inside living these changes in the process of adoption of cryptocurrencies. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.748724489795919
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#8",
                    "likes": "3",
                    "time": "22/07/2022-01:56:06",
                    "content": "Totally agree, the El Salvador BTC currency law was implemented to attract foreign investments, increase tourism and attract hype capital and NOT for the average El Salvador citizen ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Balloonist",
                    "index": "#9",
                    "likes": "5",
                    "time": "22/07/2022-09:53:21",
                    "content": "I was a co-founder of a Dai remittance platform a couple of years back https://dafnir.com/ It also works as Dai on/off-ramp. You can see 30 sec explainer here This p2p-remittance platform is fully translated into Spanish too. It runs on L1-rails, so the gas costs are currently quite high. You can get from cash into DAI using it if you want to work as an agent. I think the platform still works, but I do not really spend time on it anymore. My co-founder is still active, let me know if I should put him in contact with anyone of relevance. It is a two-sided market, so it will take some bootstrapping to get it running in a new market. Nadia and Mariano from growth are well aware of the product, we spend time on trying to brand it in Argentina, without success. ",
                    "links": [
                        "https://vimeo.com/431143750"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.256515151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#10",
                    "likes": "3",
                    "time": "22/07/2022-13:38:56",
                    "content": "The platform looks amazing and the concept seems to be a great product market fit for El Salvador given its dollarized economy and reliance on incoming USD remittances. MKR has two products that fully align with El Salvadoreans   BTC vaults - Receive BTC from remittances, open BTC vault and mint some DAI while maintaining exposure to BTC (Local Currency)   DAI - Receive DAI (USD Local Currency) from remittances and utilize as a store of value and a medium of exchange. Reliance on broader country’s crypto adoption. Another good use case is to convert received DAI to cash using a service like yours. This would create organic DAI demand for remittance export to El Salvador.   The GAS is a problem though but its still comparable or lower than most predatory remittance services. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                }
            ]
        }
    ]
}