{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-weekly-update-june-18-june-24/8945",
            "title": "Growth CU weekly update: June 18 - June 24 ",
            "index": 8945,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "11",
                    "time": "24/06/2021-16:55:54",
                    "content": " General Updates  Growth and Risk CUs talked with Circle. Circle offers a Yield Account with fixed terms, using Genesis as a lending partner. The added value of Circle is to provide an overcollateralized loan with Bitcoin. To access Circle’s yield account, the lender (MakerDAO) must be an incorporated entity to pass through KYC and sign the Line of Credit Agreement.  image724×522 50.9 KB  Some questions raised after our conversation with Circle:  If we lend them 1B USDC, does that change the yield? → No, scaling won’t change the terms. The Genesis market is massive. Do we want to incorporate a company to lend USDC? If so, what should be the next steps?  We also talked with Syndicate Protocol. Syndicate is helping companies (VCs) to create DAOs to manage their investments through a DAO. During this process, they developed a framework to create legally compliant DAOs for sharing equity. Now they want to work with DAOs to help them to be more compliant and allow them to interact with the off-chain world:  They can help DAOs to set up entities with on-chain ownership. These entities can have access to different service from the TradFi world (like a bank account) They work with DAOs to help them to diversify their treasury, opening brokerage accounts to invest their crypto funds in instruments that protect them from inflation, like bonds.    Star of the week   our Twitter account is live!!! follow us and tell your followers about us  ",
                    "links": [
                        "https://twitter.com/MakerGrowth",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-27th-2021/9107",
                        "https://forum.makerdao.com/t/informal-poll-using-the-cayman-foundation-to-invest-in-financials-assets-at-scale/9790",
                        "https://forum.makerdao.com/t/what-is-stopping-us-from-investing-the-psm-usdc/8730/56"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.658167613636364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "2",
                    "time": "24/06/2021-17:30:10",
                    "content": "    Nadia:  Do we want to incorporate a company to lend USDC?   When that happens, will we have to report profits on the assets being completely legal or how would it be in that matter of fiscalization of profits being an incorporated company? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "4",
                    "time": "24/06/2021-19:32:08",
                    "content": "Tbh, that will really depends on how and where such entity is incorporated. I am personally leaning toward DeFi model (putting USDC into “proven” yield farm). ",
                    "links": [
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/38",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-147-thursday-june-24-17-00-utc/8904/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-51-en-espanol/9063",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-147-thursday-june-24-17-00-utc/8904/2"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#4",
                    "likes": "0",
                    "time": "24/06/2021-22:28:52",
                    "content": "Just to clarify. What was the feedback from the @Risk-Core-Unit who took part in this call? Obviously any time you lock up fund it creates a risk of a bank run. Has there been any research done on what strategy is best to approach this risk? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#5",
                    "likes": "1",
                    "time": "24/06/2021-22:37:17",
                    "content": "    Zarevok:  Has there been any research done on what strategy is best to approach this risk?   Wasn’t on the call, but the simplest mitigation is to ladder everything so there’s cash being returned every day. So if you do 3 month maturity, divide the cash into ~90 buckets. Each day you invest 1/90th of the cash so that every day you get cash returned to you that you can either roll into another 3 months or withdraw. You could also ladder by the week or any other interval if daily rollovers became onerous ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#6",
                    "likes": "0",
                    "time": "24/06/2021-23:16:48",
                    "content": "    PaperImperium:  Wasn’t on the call, but the simplest mitigation is to ladder everything so there’s cash being returned every day. So if you do 3 month maturity, divide the cash into ~90 buckets. Each day you invest 1/90th of the cash so that every day you get cash returned to you that you can either roll into another 3 months or withdraw. You could also ladder by the week or any other interval if daily rollovers became onerous   Understood, however I was looking more for answers to the following questions.   What percentage of our USDC holdings would they allow us to invest?   Considering there is a higher rate based on the length of the term, what term are they advising we consider.   Are there any concerns of risk due to rehypothecation and what impact will that have on questions 1 and 2?   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#7",
                    "likes": "3",
                    "time": "24/06/2021-23:24:42",
                    "content": "    Nadia:  Circle offers a Yield Account with fixed terms, using Genesis as a lending partner.   What about asking Goldman Sachs and the new crypto desk launched by Citibank—I bet they offer higher yields on $1B. Also, don’t let Circle pull the wool over your eyes—high net worth individuals can always negotiate higher yields than the plebs — it’s a fact. I mean 4% is nice—but they should feel privileged that your core unit even consider them. Just keeping it real — you gotta have swagger  Cc: @MarianoDP ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5688131313131315
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#8",
                    "likes": "4",
                    "time": "24/06/2021-23:30:25",
                    "content": "Well said, I hope people grasp the significance of this proposal. This initiative alone has the potential to more then double the revenue of the DAO. It should be prioritized accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#9",
                    "likes": "2",
                    "time": "25/06/2021-00:26:25",
                    "content": "The challenge here is all the legal implications of setting up a company for investments (plus taxes obligations). Circle’s proposal is just an example of what we could get. Still, it’s important to understand the risks associated with that decision. And I agree with Doo, if we are going to invest in crypto, I prefer the DeFi model. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#11",
                    "likes": "1",
                    "time": "25/06/2021-00:47:25",
                    "content": "Do they need an entity just for KYC, or do they want a tax ID/EIN with the intention of sending a 1099 to that entity?  And even if an entity is formed, as they going to ask for KYC info. for its owners? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#12",
                    "likes": "0",
                    "time": "25/06/2021-01:14:17",
                    "content": "From the yield account page, bottom: \"For investors in the United States, investments described in this communication are offered by Circle Bermuda to “accredited investors” only in accordance with Regulation D, Rule 506(c) of the Securities Action of 1933, as amended. \"   So if that applied to the yield account we couldn’t do a US based entity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#13",
                    "likes": "0",
                    "time": "25/06/2021-02:21:23",
                    "content": "    Saludiego_201:      Nadia:  Do we want to incorporate a company to lend USDC?   When that happens, will we have to report profits on the assets being completely legal or how would it be in that matter of fiscalization of profits being an incorporated company?   There likely isn’t much difference here based on preliminary research, although obviously more work would need to be done to confirm. IRS - Unincorporated Business California - Unincorporated Associations ",
                    "links": [
                        "https://www.ftb.ca.gov/forms/misc/927.html#:~:text=dissolves%20through%20SOS.-,Unincorporated%20Associations,pay%20the%20minimum%20franchise%20tax."
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#14",
                    "likes": "0",
                    "time": "25/06/2021-02:26:40",
                    "content": "    omahalawyer:  From the yield account page, bottom: \"For investors in the United States, investments described in this communication are offered by Circle Bermuda to “accredited investors” only in accordance with Regulation D, Rule 506(c) of the Securities Action of 1933, as amended. \"   So if that applied to the yield account we couldn’t do a US based entity.   It’s possible there could a different entity or exemption they use if needed. MakerDAO could potentially also setup an entity that qualifies as a Qualified Institutional Buyer, which would remove essentially all roadblocks. This would take some careful thinking though and designing with developers and lawyers to see if it can be correctly modeled through the smart contract system. Not sure if the community would be willing to explore it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.107142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#15",
                    "likes": "1",
                    "time": "25/06/2021-03:54:24",
                    "content": "    Nadia:  The challenge here is all the legal implications of setting up a company for investments (plus taxes obligations). Circle’s proposal is just an example of what we could get. Still, it’s important to understand the risks associated with that decision. And I agree with Doo, if we are going to invest in crypto, I prefer the DeFi model.   I agree, a defi solution would definitely be more on brand for the DAO. Still it’s great you are scoping out all possibilities. Great work!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#16",
                    "likes": "4",
                    "time": "25/06/2021-04:21:56",
                    "content": "Just a thought experiment, but could we establish a trust in a tax neutral jurisdiction with a very limited mandate only permitting said trust to “(i) invest some percentage of the PSM with Circle; (ii) receive dividends therefrom; and (iii) transfer those dividends to a smart contract under MKR voter control”? Basically, the trust would act as a medium through which the funds could pass to the DAO. I imagine MKR voters would have to vote to allocate funds to the trust, among other things. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.995535714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#17",
                    "likes": "1",
                    "time": "25/06/2021-04:43:17",
                    "content": "This could also likely be done as a single member LLC with pass through treatment in Dealware with an operating agreement that basically only authorizes this. Either way the issue will be who is actually the owner for the state’s tax purposes, which circles back to the same DAO isn’t a person problem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.940476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#18",
                    "likes": "0",
                    "time": "25/06/2021-04:46:03",
                    "content": "We have already established a precedence of core teams forming LLC’s to protect themselves from liability. Why would this be any different? The Maker community would need to vet and elect the person/persons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#19",
                    "likes": "1",
                    "time": "25/06/2021-05:38:30",
                    "content": "Considering even for RWA, there has been a lot of discussion and also controversy, if it’s an centralised entity that handles billions and doesn’t have onchain transparency… I can see it creating a lot of conflicts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#20",
                    "likes": "0",
                    "time": "25/06/2021-05:43:21",
                    "content": "You get much higher rates on DeFi protocols anyway. I don’t personally see a reason to risk much more to get lower rates. On the other hand, putting collateral or treasury into DeFi is pretty proven and ongoing. For example, YFI team does that as well as Alchemix that puts collateral into yield generating to pay off loan (they had a bug but idea overall is still sound) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.910714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#21",
                    "likes": "0",
                    "time": "25/06/2021-16:07:54",
                    "content": "I prefer this a thousand times, although that fixed 4% regardless of the amount sounds tempting, because bringing more USDC 1 billion into the market will affect interest rates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#22",
                    "likes": "1",
                    "time": "25/06/2021-17:34:02",
                    "content": "There is a limit to how much we can invest in DeFi without pushing rates down too significantly. I think we’ll have to take a mixed approach and adjust as the DeFi ecosystem scales. We also have to consider risks and having a diversified approach will reduce these even if it creates more complexity in the short term. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.766203703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#23",
                    "likes": "0",
                    "time": "25/06/2021-18:01:24",
                    "content": "I just had a fun (?) dream of MakerDAO farming with USDC to become a major governance player to influence other DeFi protocols. The construction of MakerDAO empire  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.395833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#24",
                    "likes": "0",
                    "time": "25/06/2021-18:03:04",
                    "content": "Alameda doubles down billions on DeFi farming and yes, rewards can go lower but will still be higher yield and less risky than CeFi route ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.87962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#25",
                    "likes": "0",
                    "time": "25/06/2021-18:05:12",
                    "content": "Like don’t you guys see why many CeFi houses are taking funds and putting them in DeFi? Higher yields and more flexible ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#26",
                    "likes": "1",
                    "time": "25/06/2021-18:09:12",
                    "content": "The way is DEFI ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#27",
                    "likes": "2",
                    "time": "25/06/2021-19:19:22",
                    "content": "The USDC supply side on Compound is $3.5B with 1.74% interest rate at the moment and AAVE has about $5.5B in USDC with interest rates slightly over 2%. Increasing the supply side by 33% would only push these rates down further. Where are you seeing rates more attractive than CeFi (5.5%+ at Circle and 8.6%+ at BlockFi)? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.814814814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#28",
                    "likes": "0",
                    "time": "26/06/2021-01:50:08",
                    "content": "Do agree that both AAVE and Compound rates are low right now but they used to hover around 8-10%. In terms of absolute returns, if we are willing to risk a bit more, Curve pools as well as several pools still offer up to 20%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.029761904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#30",
                    "likes": "3",
                    "time": "26/06/2021-17:45:52",
                    "content": "We can’t throw a billion at anyone in DeFi that wouldn’t reduce rates or cause heartburn.  But even if we could only get 200 million invested this way and even if the rate goes from 4 to 3% that’s 6 million a year, over 16.4k a day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#31",
                    "likes": "0",
                    "time": "26/06/2021-18:27:46",
                    "content": "To be clear I’m in favor of investing in DeFi when the yield warrants doing so and getting a process in place would certainly be beneficial. At the moment though the advantage is to invest through CeFi as Nadia mentioned in her original post we could invest $1B and the rates would be unaffected. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.799107142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KriptoHayat",
                    "index": "#32",
                    "likes": "1",
                    "time": "26/06/2021-18:36:01",
                    "content": "Everything is possible in defi. let’s grow the ecosystem.  Kripto, Kripto Hayat ",
                    "links": [
                        "https://kriptohayat.com/kripto-hayat"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#33",
                    "likes": "1",
                    "time": "26/06/2021-18:43:41",
                    "content": "Do you share my point of view, if we are the protocol that created the DEFI term, why go to CeFI? Let’s continue in Defi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#34",
                    "likes": "3",
                    "time": "28/06/2021-19:28:27",
                    "content": "Is this CeDeFi?    twitter.com    Compound Labs @compoundfinance    We're proud to announce Compound Treasury, designed for businesses and financial institutions to access the benefits of the Compound protocol.  The idea is simple: a fixed 4% APR on US dollars, with daily liquidity and none of the complexity of crypto.  medium.com/compound-finan…   7:11 PM - 28 Jun 2021           180                35            ",
                    "links": [
                        "https://twitter.com/compoundfinance/status/1409590399794962435?s=19",
                        "https://twitter.com/compoundfinance/status/1409590399794962435?s=19",
                        "https://medium.com/compound-finance/announcing-compound-treasury-for-businesses-institutions-83d4484fb82e",
                        "https://twitter.com/compoundfinance/status/1409590399794962435?s=19"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#35",
                    "likes": "3",
                    "time": "28/06/2021-22:52:29",
                    "content": "If CeFi offers better rates, we should go with CeFi. Long term we will need both but having the flexibility to move between them will be important so we can take advantage of whichever offers better rates. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#36",
                    "likes": "1",
                    "time": "29/06/2021-17:15:34",
                    "content": "LedgerX has just onboarded ETH options. Why not use some of the USDC to sell covered calls and this serves as a hedge against market price volatility while adding more USD reserves in the form of options premiums. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Richtofen",
                    "index": "#37",
                    "likes": "5",
                    "time": "29/06/2021-22:28:57",
                    "content": "The problem with DeFi, as most everyone has noted, is that it could not absorb the kind of supply we’d be looking to invest without seriously impairing our own products. This is not a problem that Alameda has. And despite Alameda, I still am inclined to believe most of their money is going to CeFi and TradFi where liquidity needs still dwarf DeFi. Quite simply, I do not believe that the r/r entailed with DeFi are compatible with our needs (competitive & fixed rates, minimized risks, or harmless to our own business). This all could (and frankly probably will) change within the next twelve months as the space continues rapidly growing and brings new DeFi products that meet our needs and/or raise rates that are commensurate with the risks. In the meantime, if we want to keep everything decentralized there still may be viable opportunities that don’t harm our own products, like perhaps insurance. I’m not sure. Regardless I still think it’s a far superior solution to go with a fixed 4% rate through CeFi that can absorb billions without tanking DeFi money markets. All while incurring minimal additional risk beyond those entailed with holding billions of Circle’s stablecoin in the first place.     flipflopflapdelegate:  What about asking Goldman Sachs and the new crypto desk launched by Citibank—I bet they offer higher yields on $1B. Also, don’t let Circle pull the wool over your eyes—high net worth individuals can always negotiate higher yields than the plebs — it’s a fact. I mean 4% is nice—but they should feel privileged that your core unit even consider them. Just keeping it real — you gotta have swagger    100% correct. We absolutely are in a position to demand the terms. There is zero chance that Circle has near as much raw capital power as we do right now. They are more or less at our mercy and we should negotiate accordingly. Not that advise it, but even the hint that we’d switch out the USDC for, say, GUSD, would send them scrambling to make us happy customers. We are in a position to work out an arrangement that works to our benefit, whether that’s higher rates or a different model of drawing yield from Circle altogether. As regards sentiments like this, which I myself often struggle with:     Zarevok:  I agree, a defi solution would definitely be more on brand for the DAO.   We need to remember that nowhere is there a rule-book that we must bend our decision making to match the ideological bent in which this all came to be. If anything, we should see working with traditional players as the obvious next step in the evolution of the decentralization revolution. We can and should work with the oldest, most established business or banking institutions out there if it benefits us and profits our organization. Doing so means we won; non-engagement is not viable and obstinacy in this regard is the achilles heel of DLT-based innovations. Nothing could be more on-brand than MakerDAO proving DAOs can operate billion dollar businesses with an efficacy rivaling the very best corporate executives out there. All in all, I’m glad to see that we’re at this point and I think we should strike while the iron is hot. An arrangement with Circle is a no-brainer imo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.15292701484562
                },
                {
                    "author_link": "https://forum.makerdao.com/u/someone",
                    "index": "#38",
                    "likes": "0",
                    "time": "30/06/2021-03:05:56",
                    "content": "    Nadia:  To access Circle’s yield account, the lender (MakerDAO) must be an incorporated entity to pass through KYC and sign the Line of Credit Agreement.   Circle requires KYC, but would Compound require it with the Treasury product that @Doo_StableLab pointed out, considering that they already pay interest on-chain without KYC? Would it be possible to reach out to them directly and see if they would offer their Treasury rates (or something close) to MakerDAO on-chain? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joy-syndicate",
                    "index": "#39",
                    "likes": "6",
                    "time": "07/07/2021-09:46:25",
                    "content": "Hi everyone, Joy from Syndicate Protocol here.   As @Nadia mentioned, we’re fascinated by the question of how DAOs can undergo KYC and want to help Maker navigate this uncharted territory. We have been busy researching ways to structure this. One possibility we’re exploring is setting up a trust to hold the assets, and then designating a trustee to act on behalf of the community as their fiduciary. We have a few things to figure out, such as where this trust should be located for tax purposes. We’ve received requests for Cayman and other locations. We also need to better understand what the rights and risks involved with this structure are. Other structures we’re looking into are LLCs (possibly in Delaware or Wyoming), and more creative solutions. We’ll be back with another update soon, but in the meantime we’d welcome any questions or thoughts you have so far! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.105769230769232
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Zarevok",
                    "index": "#40",
                    "likes": "2",
                    "time": "07/07/2021-23:01:00",
                    "content": "Welcome to the community Joy! I look forward reading reading your recommendations! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#41",
                    "likes": "2",
                    "time": "07/07/2021-23:40:53",
                    "content": "Nice! Would it be possible for you to list the advantages/disadvantages of going your route versus the Fireblocks route? I’m assuming you are referring to KYC/AML services, right? Maybe I misunderstood. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.726190476190475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/joy-syndicate",
                    "index": "#42",
                    "likes": "4",
                    "time": "12/07/2021-18:10:59",
                    "content": "Great question, @flipflopflapdelegate! We’re big fans of the work Fireblocks is doing. Syndicate would help Maker DAO create the legal entity it needs so a company like Fireblocks could later do a KYC check on Maker DAO. Right now, KYC is pretty difficult (if not impossible) to do on a decentralized community, but being able to go through KYC is a necessary step to be able to participate in most of the treasury diversification options out there. Hope that helps! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.330853174603175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#43",
                    "likes": "0",
                    "time": "10/10/2021-18:11:46",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-weekly-update-june-11-june-17/8831",
            "title": "Growth CU weekly update: June 11 - June 17 ",
            "index": 8831,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "10",
                    "time": "17/06/2021-16:53:59",
                    "content": " General Updates  El Salvador. We are working with our partners there (crypto ATMs and PoS solutions) to find a way to introduce Dai to the country. There are two approaches for it, depending on the audience:  Retail users.  Current situation. Although Bitcoin is accepted for payments, our partners think people in general (especially merchants) won’t save their money in BTC but will look out for ways to convert it to USD. Next steps:  We have to start an educational campaign to explain how DAI is a dollar (a better dollar). This has been a recurrent challenge in the past with emergent markets, where it’s essential to explain to people what Dai is. It’s confusing for them because it’s not self-explanatory. As part of a previous agreement we have with one of our partners, we will be launching a solution for merchants to accept BTC and convert it and save it in DAI.   Government. Current situation. Part of their treasury will be in BTC, and they intend to offer a service to their citizens to convert BTC to USD. Next steps:  Through our partners, we will propose to them the wBTC vault to get loans in Dai.    Star-s of the week   New bridge!!!  Sovryn bridge went live, accepting DAI from ETH Mainnet or BSC to RSK network using Babelfish protocol and transforming the DAI into XUSD. Babelfish protocol is going live in a few days. MaoDAO: First Play-to-earn DAO in China, also serves as an incubator, aims to help build a broader NFT community and make community-driven projects come into existence through an incubator. Onboarded hundreds of players to Axie Infinity. They are going to use DAI as payment. ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-21st-2021/8958",
                        "https://forum.makerdao.com/t/maker-relay-episode-50/8897",
                        "https://forum.makerdao.com/t/maker-relay-ep-50-en-espanol/8966",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/37",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-146-thursday-june-17-17-00-utc/8785/4",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-146-thursday-june-17-17-00-utc/8785/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2006655092592595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "2",
                    "time": "17/06/2021-17:41:53",
                    "content": "    Nadia:   Through our partners, we will propose to them the wBTC vault to get loans in Dai.    There are rumors that possibly due to the acceptance of BTC as a legal currency, and being El Salvador a country without its own monetary policy due to its dependence on the FED, its credit will be seriously affected, I think it would be a great advance if they open Vaults of wBTC, it would force a healthier economic policy and also to manage the risk in a great way, always looking for returns instead of expenses. Much success guys and may that goal be achieved! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.195833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "1",
                    "time": "18/06/2021-02:35:09",
                    "content": "    Nadia:  El Salvador. We are working with our partners there (crypto ATMs and PoS solutions) to find a way to introduce Dai to the country.   Looks like Paraguay  is up next per Coin Briefing: “Carlitos Antonio Rejala Helman, a Paraguay official, is planning to introduce Bitcoin legislation in July.” Also, maybe we can reach out to Groupo Cinco @MarianoDP ? “One of Paraguay’s top entertainment companies, Grupo Cinco, is also planning to accept Bitcoin and other cryptocurrencies.” ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisB",
                    "index": "#4",
                    "likes": "5",
                    "time": "18/06/2021-09:39:43",
                    "content": "    Nadia:  We have to start an educational campaign to explain how DAI is a dollar (a better dollar). This has been a recurrent challenge in the past with emergent markets, where it’s essential to explain to people what Dai is. It’s confusing for them because it’s not self-explanatory.   With regards to this, would this be a good opportunity to potentially start to rebrand our main Dai as Dai-USD (or similar), at least on UIs and marketing material? Given there are several marketing CU proposals at the moment this could be a great opportunity for the DAO to start working on some key messaging around what Dai is, and surely help reinforce that we are talking about a USD pegged currency here as it’s in the name - I think Nadia mentioned yesterday on the governance call that we always start at a disadvantage by not having USD in our name - doesn’t have to be in the ticker per-se but we could at least reference it as so when we talk about the USD version. Also, I say USD version above because there are several references in this forum alone to EurDai, so even once we start to educate people that Dai is USD, a bit of their own research is going to lead them to discover that actually, Dai might also be Euro and any other currency that might crop up in conversation. It won’t be long when Dai is not just USD and we will have to do something like this anyway IMO. Trying to do it sooner is always easier than later, as there are much fewer people to re-educate, and then it would seem new conversations around education and awareness building would be much easier. Just my thoughts… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.545606060606061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#5",
                    "likes": "3",
                    "time": "18/06/2021-12:20:06",
                    "content": "I have a couple of contacts in Paraguay, on it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "1",
                    "time": "18/06/2021-17:19:03",
                    "content": "Nice!! Wishing you the best of success! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.854166666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#7",
                    "likes": "4",
                    "time": "18/06/2021-19:12:23",
                    "content": "Excellent idea. I would love the next branding CU to propose a solution for this. Understanding we can’t brand Dai as a digital dollar (or euro), because there’s no dollar in the back, but it’s like a better version of it @Kathleen @Al_Leong2_Amazix_CMO @Planet_X @MarianoDP @seth ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "4",
                    "time": "19/06/2021-01:09:57",
                    "content": "    Nadia:  Understanding we can’t brand Dai as a digital dollar (or euro), because there’s no dollar in the back, but it’s like a better version of it   Maybe analogous to travellers’ cheques (if anyone here is old enough to remember using them)? A note that claims cash equivalency, and draws its value from the reputation of the issuer/guarantor and the unconditionality of making good on that guarantee of value. I’m not sure what the catchy branding name would be, but we can take the “better than currency” approach like travellers cheques did. They were incredibly successful as both a medium of exchange and a stable store of value, and acted as a substitute for currency ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#9",
                    "likes": "1",
                    "time": "19/06/2021-18:52:44",
                    "content": "    ChrisB:  would this be a good opportunity to potentially start to rebrand our main Dai as Dai-USD (or similar), at least on UIs and marketing material?   It’s probably a good time to start thinking about it. My immediate concern is the legal implications of directly associating Dai with USD or other currencies in its name and I’m not sure exactly when we’re looking to more forward with EurDai.     ChrisB:  Trying to do it sooner is always easier than later   I’d recommend waiting until we’re ready to do something with EurDai to implement this messaging because I think making plans to go from Dai to USDai and EurDai (for example) would be simpler and more effective than rebranding Dai to USDai and then launching EurDai. That said, that’s not a hill I would dai on if the community wants to proceed otherwise.     PaperImperium:  we can take the “better than currency” approach like travellers cheques did. They were incredibly successful as both a medium of exchange and a stable store of value, and acted as a substitute for currency   I like that approach. I’m not sure what a good analog for 2021 would be but I’ll give it some thought. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.22420634920635
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#10",
                    "likes": "1",
                    "time": "20/06/2021-01:43:48",
                    "content": "    Nadia:  We have to start an educational campaign to explain how DAI is a dollar (a better dollar). This has been a recurrent challenge in the past with emergent markets, where it’s essential to explain to people what Dai is. It’s confusing for them because it’s not self-explanatory.   Show a chart from 6/1/20 to now of the market price of DAI, then that of BTC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#11",
                    "likes": "1",
                    "time": "20/06/2021-03:02:36",
                    "content": "    ChrisB:  would this be a good opportunity to potentially start to rebrand our main Dai as Dai-USD (or similar), at least on UIs and marketing material?   DAI Dolar Digital Or, El Dolar Digital DAI  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.404761904761904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#12",
                    "likes": "2",
                    "time": "20/06/2021-03:40:18",
                    "content": "    flipflopflapdelegate:  El Dolar Digital DAI   I like this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#13",
                    "likes": "0",
                    "time": "20/06/2021-22:18:55",
                    "content": "It is very easy to recognize DAI’s function by these short sentences, I like it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.408333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cassius",
                    "index": "#14",
                    "likes": "0",
                    "time": "21/06/2021-10:35:34",
                    "content": "“USDai”? We’re hamstrung if we have a dollar-pegged token but can’t reference the dollar. Travellers’ Cheques: I remember those  We’re effectively back to the wildcat money discussion here (which is ok: on the internet, everyone loves cats), or more broadly talking about Dai as a form of eurodollar. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.328125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#15",
                    "likes": "0",
                    "time": "19/09/2021-10:35:41",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/growth-cu-weekly-update-june-4-june-10/8669",
            "title": "Growth CU weekly update: June 4 - June 10 ",
            "index": 8669,
            "category": [
                "Core Units",
                "Growth"
            ],
            "tags": [
                "gro-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#1",
                    "likes": "12",
                    "time": "10/06/2021-04:00:33",
                    "content": " General Updates    Dai in other networks.  image1708×1036 88.3 KB    Institutional Vaults post.   Highlights of Miami -thanks to @Jenn and @Gustav_Arentoft -:   Meeting with Aave Pro to understand their product and what’s needed to have Dai on that platform.   Meeting with Celcius, we talked about institutional vaults and CEL as collateral (they are willing to open a 100m DAI vault using CEL).   Meeting with Opera, they integrated Dai. It’s in beta for now… and they are thinking about OptimismDai.   Meeting with Blockfi (more details coming soon)   Meeting with a gameverse, what do you think about having the “office hours” in the Maker Bank (sci-fi style)? (more details coming soon)       Star-s- of the week      Korea   Bithumb, one of the largest Korean exchanges, listed Dai, and it’s the first and only Stablecoin on there. Also, D’CENT, a Korean hardware wallet, listed Klaytn Dai. Awesome job @joce_chang and @Doo_StableLab  LatAm+Gaming   Do you know that people from different countries play Axie for a living? In LatAm, Axie is a popular game in Argentina, Venezuela, and Brazil because it allows you to earn crypto while playing. Next week 256 Axie players will participate in the second Latin Axie Championship for a prize pool in Polygon Dai. We’ve partnered with two Axie esports teams (Block Esports and Crit Theory Gaming), with Community Gaming to organize the tournament, and with Cryptorefills to incentivize the use of Polygon Dai inside their platform to buy Giftcards for games. KMANU88 will stream the tournament on his Twitch channel (+90k followers) and his youtube channel (+450k subscribers). Amazing job @Lozadaluis12 ",
                    "links": [
                        "https://en.bithumb.com/",
                        "https://www.youtube.com/watch?v=cQZr0KpbWfc",
                        "https://communitygaming.io/tournament/latin-axie-championship-20",
                        "https://communitygaming.io/",
                        "https://www.cryptorefills.com/",
                        "https://www.twitch.tv/kmanu88/about",
                        "https://www.youtube.com/channel/UC0Ym7ckYtSsgcbZX1VvYMQQ",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-145-thursday-june-10-17-00-utc/8590/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-49/8763",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/35",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-145-thursday-june-10-17-00-utc/8590/8",
                        "https://forum.makerdao.com/t/a-look-at-dai-on-different-chains/9231",
                        "https://forum.makerdao.com/t/maker-relay-ep-49-en-espanol/8795"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0703125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "6",
                    "time": "10/06/2021-16:41:37",
                    "content": "Growth is always such a fountain of good news. Tell all your people that y’all rock my socks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "1",
                    "time": "10/06/2021-20:46:47",
                    "content": "Be nice to see these as graphs of amounts over time and totals.   % out of 100% is kinda misleading. I also would like to see included what is on L1/ETH against what is moving to L2. Interesting here was every network basically lost DAI with Polygon being the single grower here which in itself is a interesting piece of news. What I really want to see is whether on total DAI growth whether growth of DAI on L1 exceeded what is on L2. My points with the above is that the above report while interesting is not showing the total story of DAI but only the L2 one which only tells me what I already knew (Polygon being the hot L2 and everyone else staying still or losing to them).   I am more interested in the what the total DAI ecosystem is doing.   I would also be interested in seeing a report of how much DAI was static (just sitting somewhere) vs. being moved around but I think those are harder numbers to think about generating. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.019642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Nadia",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/06/2021-21:25:05",
                    "content": "point taken,  @SebVentures worked in something like that and we can start using his dashboards to analyze Dai flows. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "12/09/2021-21:25:16",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "3779"
}