{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/focus-on-4-mip6-review-methodology-for-structured-finance-transactions/12943",
            "title": "\\xf0\\x9f\\x94\\x8e Focus On #4: MIP6 Review Methodology for Structured Finance Transactions ",
            "index": 12943,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "rwf-001",
                "rwa",
                "pubcall-:-focus-on"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Retro",
                    "index": "#1",
                    "likes": "11",
                    "time": "31/01/2022-14:50:54",
                    "content": "     On this episode of Focus On, we will host the Real-World Finance Core Unit as they discuss the newly proposed MIP6 review methodology for Structured Finance Transactions. We will be joined by Real-World Finance Core Unit members William Remor @williamr, Christian Petersen @christiancdpetersen, and Eric Rapp @Eumenes. Project Real-World Sandbox Report author Luca Prosperi @luca_pro will also join our call as a guest. The first iteration of this new methodology captures evaluation criteria and other best practices from structured finance markets. Join us to weigh in on the current proposal, ask questions, and voice your constructive criticisms.  Join us!  @Wouter & @retro will host.  When Time in your local-timezone format: 2022-02-02T19:00:00Z Mark it on your Google Calendar!  Where Zoom call Passcode: COREUNIT Alternatively, use this:  Find your local number: Zoom International Dial-in Numbers - Zoom Meeting ID: 829 4277 3725 Passcode: COREUNIT  Attn:  @SES-Core-Unit, @gov-comms-core-unit, @GovAlpha-Core-Unit, @Growth-Core-Unit, @Content-Production, @daif-core-unit, @Protocol-Engineering, @Oracles-Core-Unit, @Risk-Core-Unit, @Real-World-Finance, @dux-core-unit, @starknet-core-unit, @data-insights-cu, @collateral-core-unit ",
                    "links": [
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://calendar.google.com/event?action=TEMPLATE&tmeid=MjNzanBpcm5nazhqZzZwY202c3VoNjhyMmEgbWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGc&tmsrc=makerdao.com_3efhm2ghipksegl009ktniomdk%40group.calendar.google.com",
                        "https://us02web.zoom.us/j/82942773725?pwd=eWxBUXRZWHJsUEZ1QUF4U082SHYwUT09",
                        "https://us02web.zoom.us/u/kdYmK1Gv2D",
                        "https://forum.makerdao.com/t/weekly-relay-january-25-31-2022/12953",
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/relay-semanal-25-al-31-de-enero-de-2022/13007"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.776515151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gala",
                    "index": "#2",
                    "likes": "1",
                    "time": "31/01/2022-22:42:16",
                    "content": " Focus On Call - Episode #04  February 2nd, 2022  Agenda   00:00: Intro with Retro  00:49: Presentation with Christian Petersen & Eric Rapp  01:12:22: Outro   Video https://youtu.be/-5EpITMIio4  Introduction  Retro  Agenda and Preamble 00:00  Hello to everyone. Thank you for joining episode #4 of Focus On. I am Retro, a contributor with the SES CU at MakerDAO. Today, I am co-hosting the session with SES team lead Wouter Kampmann. For this episode, we are joined by the Real World Finance CU team with the facilitator William Remor and contributors Christian Petersen and Eric Rapp. We also have Project Real-World Sandbox author Luca Prosperi on the call. Together we will be discussing the new lead proposed methodologies for reviewing MIP6s applications for structure finance transactions. For other episodes of FO, please check the forum.   Presentation  Christian Petersen & Eric Rapp 00:49  Methodology for Structured Finance1920×1165 107 KB   About1920×1177 216 KB   Presentation Outline1920×1137 125 KB   Definition1920×1140 228 KB   Securitization a Financing Tool for Lenders1920×1148 196 KB   Methodology for Reviewing Structured Finance Proposals1920×1132 225 KB   Transaction Legal Structure1908×1141 216 KB   Transaction Structure1920×1146 148 KB   Important Principles1920×1140 142 KB   Maker Specific Issues1920×1148 183 KB   Principles1920×1154 219 KB   Asset Manager Review Overview1920×1149 194 KB   Asset Manager Review: Ownership and Management1915×1143 131 KB   Asset Manager Review: Alignment with Maker1920×1134 162 KB   Asset Manager Review: Key Functions1920×1150 139 KB   Asset Manager Review: Key Functions1920×1146 117 KB   Asset Manager Review: Key Functions1920×1152 132 KB   Asset Manager Review: Key Functions1920×1134 160 KB   Asset Manager Historical Performance Review1920×1149 167 KB   Transaction Financial Structure Overview1920×1150 141 KB   Transaction Financial Structure Review: Structure1920×1143 164 KB   Transaction Diagram Example1920×1125 134 KB   Priority of Payments Example1899×1128 172 KB   Transaction Financial Structure Review: Structure1920×1140 154 KB   Credit Enhancement Example1920×1150 122 KB   Credit Enhancement Example1920×1136 123 KB   Transaction Financial Structure Review: Structure1920×1142 133 KB   Transaction Financial Structure Review: Asset Base1870×1148 173 KB   Transaction Financial Structure Review: Asset Base1842×1135 224 KB   Appendix: Originator Review1872×1110 80.8 KB   Questions 35:04 - Someone: How much interaction do I have inside of what I am doing versus facilitating and enabling others to do the work? 59:59 - Someone: As you laid out, a DAO is a passive player, and we want to scale this up. Naturally, there would be a low-risk appetite, and we would want to learn as many lessons as we can from the traditional finance industry to get this right. On the other hand, DAOs are also more open organizations that allow for innovation. Do you see these two things as a conflict, or do you think they can coexist? 1:08:22 - Max (from chat): MakerDAO can lend with Arbitrum, NS the DAO is not bound is free. Does Real Finance and Sandbox look to Basel III as the guide? Or is it strategic for MakerDAO to lend to Asset clases like trade finance and project finance that Basel restrics? 1:11:38 - Luis: What is the difference between providing capital and being investors?  Closing Comment  Retro  Outro 01:12:22  We will conclude here. Thanks to Christian, Eric, Luca, and Will for the presentation and discussion. We will make the recording available. The questions and answers can continue on the forum thread. Thanks to everyone for joining. See you next time.   Credits  Kunfu-po produced this summary.  @gala produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/-5EpITMIio4?t=49",
                        "https://youtu.be/-5EpITMIio4?t=4342",
                        "https://youtu.be/-5EpITMIio4",
                        "https://youtu.be/-5EpITMIio4",
                        "https://forum.makerdao.com/search?q=focus%20on",
                        "https://youtu.be/-5EpITMIio4?t=49",
                        "https://youtu.be/-5EpITMIio4?t=2104",
                        "https://youtu.be/-5EpITMIio4?t=3599",
                        "https://youtu.be/-5EpITMIio4?t=4102",
                        "https://youtu.be/-5EpITMIio4?t=4298",
                        "https://youtu.be/-5EpITMIio4?t=4342"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.510010822510822
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/05/2022-22:42:36",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
            "title": "Methodology for Review of MIP6 Structured Finance Transactions ",
            "index": 12697,
            "category": [
                "Governance"
            ],
            "tags": [
                "informal-poll",
                "rwa",
                "cmoff",
                "framework"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#1",
                    "likes": "25",
                    "time": "17/01/2022-19:36:48",
                    "content": "Methodology for Review of MIP6 Structured Finance Transactions Title: Methodology for Review of MIP6 Structured Finance Transactions Author(s): @eumenes, @christiancdpetersen Reviewers: @williamr, @luca_pro, @sebventures, @teej, @Philinje, @Porter_Smith Type: Proposal Purpose: For discussion Date Proposed: 2022-01-17  The Real World Finance Core CU (“RWF CU”) proposes to use the criteria in this paper to evaluate proposed MIP6 structured finance transactions (each a “Proposal”). The methodology and criteria below build upon the [Informal Poll] RWF Collateral Risk Level and the SES Project Real-World Sandbox report. The criteria are intended to capture “best practice” in the structured finance market and may be considered appropriate for the on-boarding of real world collateral into Maker vaults. The RWF CU will update the Maker community to the extent of any proposed revisions to these guidelines. When reviewing the risk and the expected return to Maker for investing in a specific tranche of a Proposal, RWF CU assesses the following areas to determine the ability of the tranche to pay timely interest and principal under the terms of the transaction’s legal documents at a risk level that is equivalent to Investment Grade with an appropriate return. The RWF CU, in its risk assessment, will highlight material weaknesses in light of these criteria for the Maker community’s consideration. The criteria are intended to provide guidance to potential applicants and the operational core units of Maker DAO. These criteria remain subject to change and further input from the Maker community.   Asset Manager (or, in general, the Applicant): has the size, structure, personnel, and resources for managing the business and implementing the investment mandate including a. The ownership provides oversight  Consistent professional & ethical behavior Reasonable ownership structure Reasonable governance structure Strategic direction Accountability, including  Selection, support and review of senior management Strategic planning Financial oversight Legal oversight    b. Senior Management provides management including  Consistent professional & ethical behavior Clear reporting lines Separation of duties Significant experience of success (& track record) investing in eligible and related assets, including origination, underwriting, structuring, servicing and portfolio management Experience working together or reasonable demonstration of capacity to perform as a newly formed organization  Knowledgeable on current trends in  Eligible and related assets Market financing terms and structures Credit performance Competition Regulation and compliance   Mitigating key man risk  c. Ownership and Management are aligned with Maker  Demonstrable and meaningful economic exposure given nature of transaction (measured on a relative basis) All third party transactions are conducted at arm’s length Disclosure of all potential conflicts of interest with Maker, MKR holders, or any related party  d. The Asset Manager has the processes, staffing and channels to source  investments  Policies and procedures Staffing and resources Active/prospective pipeline demonstrating significant scale and eligible profile of collateral  e. The Asset Manager follows investment processes at both the fund level and (individual asset) investment level, including   Fund investment and portfolio management process  Fund guidelines, policies and procedures including  Strategy Risk appetite Eligible assets Fund concentration limits Use of leverage and subordination levels Performance benchmarking   Ongoing portfolio management, including  Policies and procedures Monitoring investments, including monitoring of originators, servicers, backup servicers and other third party service providers Updating fund and investment forecasts, including stress cases, as needed Fund and Investment valuations Portfolio compliance and auditing Workouts   Fund and portfolio management decision process    Individual asset investment process  Investment underwriting policies and procedures including  Investment strategy and risk appetite Originator review Servicer review Collateral performance assessment with expected and stressed performance forecasts Concentration matrix Transaction finance structure Transaction legal structure with bankruptcy risk analysis (see section 4 below) Cash flow modeling sensitivity analysis Surveillance and reporting Title or lien searches and insurance   Individual investment decision process    Investment personnel for fund and individual investments including  Roles, responsibilities and reporting lines Separation for investment vs ongoing portfolio decisioning Experienced credit investors/structurers/fund managers in eligible assets Ability to assess, structure and price investment grade transactions Experience overseeing originators and servicers Experienced with portfolio management and workouts Mitigating key man risk    Process for changing Investment Guidelines and Policies   Process for transitioning to another asset manager if Asset Manager exits   f. The Asset Manager follows Risk Management processes including  Policies and procedures Staffing and resources Roles, responsibilities and reporting lines Oversight at both fund and investment level Pricing/valuation at both fund and investment level  g. The Asset Manager provides reporting to the investor including  Technology, systems and information security Fund level and investment level Frequency, accuracy and timing Detailed fund remittance with cash reconciliation Non-performing portfolio tracking and recovery guidance  h. The Asset Manager follows audit and quality control processes that address key risks to business and investment portfolio  Policies and procedures Staffing and resources  i. The Asset Manager has financial controls, liquidity and funding including  Audited financial statements for Asset Manager, funds, and borrowers Capital sources for funds outstanding Debt facilities outstanding Consistently profitable Asset Manager or at least 12 months operating cash on hand Three year financial model including required funding  Asset under management Asset performance Personnel Technology and systems    j. The Asset Manager follows legal and compliance processes including  Policies and procedures Staffing and resources Legal and Compliance framework mitigating key risks such as KYC/AML Disclosure of any pending corporate events, regulatory action or material litigation Disclosure of conflicts of interest between the asset manager and the proposed end-borrower entities Disclosure of litigation or bankruptcies of end-borrowers    Asset Manager Historical Performance:  the Asset Manager provides a performance track record that demonstrates their ability to generate risk adjusted returns through the business cycle, including  Fund and investment level details  Monthly investment Losses analysis and rationale  Senior and junior facility level Asset level     In the eligible and related assets Includes gross returns, various expenses and net returns to investors Use of leverage As compared with a reasonable performance benchmark Auditable    Transaction Financial Structure:   The proposal’s financial structure, asset base, and cash flow analysis support the timely repayment of interest and principal for the given tranche. A key initial consideration will be whether the asset pool is a static pool (fixed assets with a stated payment profile) or a revolving pool (where new assets and/or new borrowings can be added to, or subtracted from, the collateral pool, within a certain time frame). Static pools are less complex and operationally intensive than revolving asset pools. Revolving asset pools will require contractual mechanisms to ensure that the new on-boarded assets meet the eligibility criteria set forth in the financing documents and the risk retention standards are maintained. a. Financial structure  Cash flow diagram (DAI to USD/Other to DAI) Priority of payments  Timing of funds received from assets Payment of recurrent transaction expenses  Trustee or equivalent Servicer General administration   Other senior payments such as hedging cost Payment of Interest Payment of Principal Prepayment provisions Other funds or payments Any payment caps/limits Post event of default priority of payments   Account control  Collateral security over SPV account(s) Mechanics for payments from SPV accounts   Credit Enhancement  Overcollateralization Excess Spread Cash Reserve Accounts Subordination Third Party Liquidity   Performance Thresholds / Triggers  Delinquencies (current / cumulative) Defaults (current / cumulative) Cash shortfalls Others   Financial Covenants  Asset Manager financial health Originator financial health Servicer financial health Borrower creditworthiness   Audit, accounting and reporting  b. Asset Base:  asset eligibility criteria and concentration limits  Detailed investment policies and processes for the fund level Detailed investment policies and processes for the investment level  c. Cash flow analysis  Expected, stressed and break even scenarios Detailed collateral performance assumptions such as  Default curves Prepayment curves Replines Recoveries Interest rates      Transaction Legal Structure:  each Proposal should be reflective of acceptable securitization practice in the relevant jurisdiction. Proposals in the United States, European Union, Asia-Pacific, Oceania and elsewhere will be largely driven by the legal regimes applicable to those jurisdictions. The RWF CU will seek support from professional legal intermediaries senior/experienced in customary practice in these jurisdictions to benchmark a transaction against a market standard practice. The RWF CU clearly recognizes the potential for regulatory risks in the crypto space. Thus, the RWF CU views the transaction structure to be an evolving process guided by historical precedent. Rather than be prescriptive as to form, the RWF CU has identified the following as important principles for any potential legal structure. The RWF CU’s focus will be on substance over form. Of course, certain exceptions may be appropriate from time to time in respect of “proof of concept” transactions with recognized, rated and regulated financial institutions (e.g. SocGen). a. Avoid bankruptcy risk of the Asset Originator   Transfer of assets from originator to a special purpose vehicle (“SPV”)  True sale in form and substance to remove assets from the originator’s bankruptcy estate - transfer of equitable and legal rights    Delivery of a true sale legal opinion from external counsel As a legal matter, in the United States, no structure can be “bankruptcy proof” as the Bankruptcy regime in the United States grants debtors and the bankruptcy court with debtor-friendly rights and powers. The purpose of the “true sale” is to create bankruptcy remoteness. Bankruptcy risk may be different in other jurisdictions where creditors have stronger rights during the insolvency process.   b. Avoid substantive consolidation of SPV with the Asset Originator  Demonstrate separateness of SPV and originator in operations, governance, administration, and organizational formalities. Factors that support substantive consolidation include:  Common ownership or control Common directors Consolidated filing of tax returns Consolidated accounting treatment Inter-corporate loans/guarantees Commingling of assets and business functions Asset transfers without observance of corporate formalities Common books and records, payment of liabilities, holding themselves as related entities   Delivery of a non-consolidation legal opinion  c. SPV Characteristics  SPV has limits on its purpose and activities SPV restricted from the issuance of indebtedness SPV restricted from the issuance of guarantees SPV restricted from mergers or reorganizations SPV restricted from changes to its organizational documents SPV mitigation of entity-level taxation SPV has an independent director SPV organizational documents require the vote of the independent director to make a bankruptcy filing or to amend the SPVs organizational documents Independent director is required to vote in the interests of the SPV and its debt securityholders Methodology for the removal/resignation of the independent director SPV restricted from termination of its existence Separateness covenants Non-petition clauses in contracts between SPV and 3rd parties  d. Transaction Considerations  Form of SPV issuer (grantor trust, statutory trust, limited liability company, other, etc.)  Case-by-case subject to applicable jurisdiction Focus on substance over form Most third party agents (trustees, etc.) will limit/restrict duties and liabilities (if permitted by applicable law)   Existence of an agent to act for senior and junior security holders  Enforcement of security holder rights Funds collection and distribution (e.g., Tinlake)   Covenant Package (affirmative and negative) Representations and Warranties Payment priority Events of default Enforcement rights of security holders Indemnities Delegations of authority to third party Security interest / filings  e. Servicing and Collections  SPV will require a servicing agreement for servicing and collecting on the underlying collateral  Asset originator is typically the servicer Ensure servicer is a priority payment in cash waterfall Mechanism for the appointment of a replacement servicer   Collection accounts  Segregated collection account opened in name of SPV with an identified account bank Payments should be made into collection account No commingling of funds with servicer Define permitted investments with funds on deposit in collection account      Maker Specific Issues a. Delaware Statutory Trust (“DST”) The Maker community has expressed a preference for adopting the Delaware statutory trust model (“DST”) and the use of a trustee. The DST structure may be implemented in various ways (e.g., 6S model vs standard use of a DST in many traditional securitizations with a US issuer). As the Delaware Code, in most sections, expressly provides that the trust agreement (not the statute) governs the roles, responsibilities and liabilities of the trustee, the contractual terms of the trust agreement are paramount to understand and evaluate for commerciality and risk. The DST may be appropriate for United States transactions, but not appropriate for non-United States transactions. For instance, a DST may not be appropriate for a UK-only transaction. Further, the split of legal and beneficial ownership in common law trusts may not be familiar in civil law jurisdictions. Given the jurisdiction-centric qualities of the Delaware statutory trust, it is perhaps more important to identify the principal qualities that the Maker community may want to see evidenced in a transaction. These might include:  An independent, reputable, third party (not the borrower) to take action based on direction from Maker governance (or majority token holders) in certain defined circumstances (e.g., conditions precedent to disbursement of funds to borrower). An independent, reputable, third party to serve as paying agent (i.e. to initiate the fiat/DAI conversion for ultimate repayment to Maker and other creditors (e.g., TIN)). An independent, reputable, third party to hold and take direction in respect of, any assets pledged as collateral security for the benefit of Maker (and, if applicable, other creditors). An independent, reputable, third party to take actions directed by Maker (or majority token holders) in the case of a borrower default (sell assets, collect and distribute cash, exercise other collateral security rights, file claims, etc.).  A case-by-case analysis may be made as to whether the independent, reputable, third party needs to be: (1) a “regulated” trustee (the definition of “regulated” may vary from jurisdiction to jurisdiction) or simply a “trustee” subject to the duties set out in applicable law; and (2) a regulated bank with certain assets under management or other third party corporate service provider with certain assets under management (availability may vary from jurisdiction to jurisdiction). The RWF CU, together with external legal support, will evaluate each proposed transaction in light of the standards described above and customary practice in the relevant jurisdiction. b. DeFi Integration The Maker protocol presents unique challenges as Maker is not a legal person and cannot sign legal documents. Further, real world assets are on-boarded into a Maker vault. Asset originators may propose various solutions to address the “DeFi integration” piece. Any solution should be mindful of potential regulatory risks and mitigations. The RWF CU expects the “DeFi integration” to be an iterative process of dialogue and continual learning. c. Mixed On-Chain and Off-Chain Transactions Some transactions may incorporate both on-chain and off-chain structuring considerations (e.g. Centrifuge). The RWF CU will have to evaluate the risks for each transaction on a case-by-case basis and develop mitigants as appropriate. d. Administration Each transaction should set forth a process for the administration of the underlying indebtedness. Administration of the underlying indebtedness may require more than one-level of decision-making. For discussion purposes only, this paper distinguishes between “Mandatory” decisions that require the affirmative vote of the Maker community and “Administrative” decisions that the Maker community may delegate to a person or committee of persons. The committee of persons may represent a member of the RWF CU, a person from compliance, a person from legal and/or perhaps a delegate, with such a committee acting on the basis of unanimity or majority decision-making. Majority decision-making may avoid the situation of deadlock with unanimous decision-making. At the same time, the RWF CU recognizes the need to balance customary “administration” with the ethos of decentralization and management of potential attack vectors. This too will be an iterative process as the Maker community determines its comfort level between completely “hands-off” and very “hands-on”. Mandatory decisions might include:  Declaration of an event of default Exercise remedies after an event of default (other than the insolvency of the issuer which results in an automatic acceleration) Waiver of any default and its consequences Sale of collateral assets Change in the date for the payment of interest or principal Change in the maturity date Change in the interest rate Change in the method to compute principal or interest on Change in the commitment amount Creation of any liens on the collateral with a more senior priority Amend any agreement in a manner that may materially affect the note holders Trigger an asset review by a third party reviewer Certain specified amendment to the issuer or trust  Changing the purpose and power of the issuer or trust Adding, changing or eliminating any provision of the issuer or trust’s governing documents    Administrative decisions might include:  Replacement of the servicer Approve any replacement or successor to the trustee (or similar) Cure any ambiguity, defect or inconsistency in any document Compliance with any tax, regulatory or accounting requirements    The RWF CU will provide a proposal on “administration” for Maker community discussion.   Appendix Originator and Servicer Detailed Review  Originator review   Company and management Financial condition Controls and compliance Origination and sourcing Underwriting Technology   Servicer review   Company and management Financial condition Controls and compliance Loan administration Customer service Collection accounts and cash management Account maintenance Default management - collections, loss mitigation and fraud Investor reporting Technology Back-up servicing analysis.  Service transition analysis.  Solution summary.  ",
                    "links": [
                        "https://forum.makerdao.com/t/real-world-sandbox-final-deliverable-for-consultation-round/11915",
                        "https://forum.makerdao.com/t/nuts-bolts-alignment-of-interests-junior-senior-capital/12613/3",
                        "https://forum.makerdao.com/t/centrifuge-january-2022-update-our-collateral-partners-legal-work-and-community-call-with-the-maker-community/12848",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/25",
                        "https://forum.makerdao.com/t/forum-at-a-glance-january-14th-20-2022/12752",
                        "https://forum.makerdao.com/t/ost-mip6-collateral-onboarding-application-by-uprets-real-estate-backed-digital-security/4438/19",
                        "https://forum.makerdao.com/t/kf-drop-mip6-application-kickfurther-drop-consignment-inventory-finance-for-ecommerce-retail-brands/4064/5",
                        "https://forum.makerdao.com/t/mip73-pando-investment-grade-climate-assets-collateral-onboarding/14484/64",
                        "https://forum.makerdao.com/t/mip6-emerging-markets-green-opportunity-financing-for-atd-combustors-egyptian-power-plant-efficiency-projects/14489/11",
                        "https://forum.makerdao.com/t/6s-capital-review-of-the-delaware-statutory-trust/14552",
                        "https://forum.makerdao.com/t/charting-a-path-for-rwas-the-case-for-continuity/14519/9",
                        "https://forum.makerdao.com/t/request-for-definitive-description-of-collateral-onboarding-process/14330/12",
                        "https://forum.makerdao.com/t/mip6-huntingdon-valley-bank-loan-syndication-collateral-onboarding-application/14219/9",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152/53",
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/signal-request-real-world-asset-fast-tracking/13563/37",
                        "https://forum.makerdao.com/t/monetalis-mip6-collateral-onboarding-risk-evaluation/13658/2",
                        "https://forum.makerdao.com/t/monetalis-mip6-collateral-onboarding-risk-evaluation/13658",
                        "https://forum.makerdao.com/t/offloading-growing-centralization-risks-to-maker-and-to-dai-opening-a-general-discussion/13469/3",
                        "https://forum.makerdao.com/t/mip40c3-sp61-modify-core-unit-budget-real-world-finance-rwf-001/13152",
                        "https://forum.makerdao.com/t/focus-on-4-mip6-review-methodology-for-structured-finance-transactions/12943",
                        "https://forum.makerdao.com/t/informal-poll-rwa-borrowers-to-pay-for-makers-external-legal-costs/12816/6",
                        "https://forum.makerdao.com/t/investing-our-liquidity-in-short-term-etf-managing-psms-exposures/10891/39",
                        "https://forum.makerdao.com/t/investing-our-liquidity-in-short-term-etf-managing-psms-exposures/10891/36",
                        "https://forum.makerdao.com/t/what-core-units-does-the-dao-need-next/13594/3",
                        "https://forum.makerdao.com/t/mip39c2-sp34-creating-rwf0x-from-a-split-of-rwf-001/16967",
                        "https://forum.makerdao.com/t/sb-ddc-mip6-application-interests-in-detox-medical-facilities-digital-offering-of-solidblock-holdings-llc-in-the-form-of-cryptographic-digital-tokens-ddcs-a-solidblock-offering/16177/2",
                        "https://forum.makerdao.com/t/mip6-pando-investment-grade-climate-assets-collateral-onboarding/16394",
                        "https://forum.makerdao.com/t/mip55c3-sp5-interim-chief-legal-officer/15981",
                        "https://forum.makerdao.com/t/signal-request-weather-proofing-existing-rwa-vaults-against-market-conditions/15859/11",
                        "https://forum.makerdao.com/t/pa-drop-mip6-application-us-based-supply-chain-finance-for-large-oems/7787/18",
                        "https://forum.makerdao.com/t/clarity-around-collateral-onboarding-process/14221/5",
                        "https://forum.makerdao.com/t/tm2-drop-mip6-application-technology-metals-market-tm2-trade-finance-for-trading-of-physical-metals/10666/13",
                        "https://forum.makerdao.com/t/sb-ldb-mip6-application-solidblock-democratizes-real-estate-with-london-digital-bonds-a-smart-tradable-property-investment/6276/7",
                        "https://forum.makerdao.com/t/sb-frogi-coin-mip6-application-membership-interests-in-red-frog-digital-series-of-solidblock-holdings-llc-in-the-form-of-red-frog-digital-coin-frogi-coin-a-solidblock-offering/11258/9",
                        "https://forum.makerdao.com/t/sb-ddc-mip6-application-membership-interests-in-detox-medical-digital-series-of-solidblock-holdings-llc-in-the-form-of-cryptographic-digital-tokens-ddcs-a-solidblock-offering/10063/11",
                        "https://forum.makerdao.com/t/reinno-mip6-collateral-onboarding-application-real-estate-new/6218/14",
                        "https://forum.makerdao.com/t/sb-bfdc-mip6-application-own-and-trade-a-piece-of-paradise-with-this-beachfront-hotel-in-phuket-thailand-managed-by-best-western-plus-a-solidblock-offering/6778/6",
                        "https://forum.makerdao.com/t/reif-drop-mip6-application-reif-drop-commercial-real-estate-assets/10169/8",
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215/33",
                        "https://forum.makerdao.com/t/mc-drop-mip6-application-monachil-capital-partners-lp-drop-senior-secured-credit-facility-for-a-private-credit-fund/8543/9"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.538329725829726
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/01/2022-19:52:33",
                    "content": "removed post ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#3",
                    "likes": "4",
                    "time": "17/01/2022-22:18:34",
                    "content": "Thank you for putting this together @Eumenes and @christiancdpetersen, Yes, it is A LOT, but this document will work as a detailed guideline for any potential counterparty interested in working with Maker, and more importantly as a map for the CUs and the Community to translate what “Investment Grade” means in terms in practice. Yes, it will take a while for all parties to align. Yes, we might lose immediate opportunities to deploy DAI. Yes, those criteria will require several iterations. However, I strongly believe that the long-term impact on quality and scalability is immense. Thank you for putting the hard work, it has been a pleasure reviewing the document. And looking forward for this to soon become reality. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.939814814814815
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#4",
                    "likes": "6",
                    "time": "17/01/2022-23:43:58",
                    "content": "@Eumenes @christiancdpetersen and all the various reviewers, I want to thank you for such a professional and detailed piece. The community has waited for guidance on structured finance transactions from real-world assets teams for a long time. This proposal comes in a timely manner. In early 2022, an increasing number of counterparties both institutional and not are enquiring Maker on their structured finance use cases. Hopefully such a proposal gives them a north they’ve been searching. Maker and Maker’s structured finance teams want and probably need to be become respected in reputable areas of real world financing. Respect and reputation goes both ways. A respectful methodology from teams operating on the ground is just a start for Maker to become a more serious player in rwf. This post is only the first iteration. We want to encourage the community (MKR tokenholders, delegates, contributors) and counterparties current and future (borrowers, arrangers etc) in contributing to the proposal discussion. We also plan to organise AMA sessions to give as much opportunity as possible to harness further constructive feedback and questions. @Growth-Core-Unit @collateral-core-unit @Recognized-Delegates @SES-Core-Unit @rune @cass @spin @Allan_Pedersen @mrabino1 @SylvFromSG-Forge @g_dip @maxglass @MH_NCP @lucas-manuel ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.62280701754386
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "2",
                    "time": "18/01/2022-02:07:55",
                    "content": "Thank you Eric and Christian Petersen, along with the many contributors that participated in reviewing, discussing, and structuring this proposal. Glad to have you All onboard with MakerDAO. Indeed, this is a lot–most of us will need to review the methodology & criteria more than a few times to fully grasp it, and I’ll personally have to research certain frameworks I’m not familiar with. But with regards to expanding the definition/criteria at a later date for items that initially caught my eye, how are you thinking about the following:  Modeling the cash flow waterfall (SPV service agreement) Further definition of the true sale securization process Definition of Credit Enhancement, internal and external? Example: internal can be subordinated, overcollateralization, and external = 3rd party guarantees? Are the back-up servicer guidelines for both an Arranger/underwriter, and trustee? Example: incase the original asset servicer is removed, M.I.A., or terminated. Expanding the definition of “arm’s length” transactions: are they independent, do parties have no relationship to each other, etc.      Eumenes:  A case-by-case analysis may be made as to whether the independent, reputable, third party needs to be:   Not sure if this is were this “criteria” question fits, but will you exclude DSTs that include blind pools, or that are packaged and sold as private placements? Thanks again, this is super-awesome and exciting! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3882389162561575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prankstr25",
                    "index": "#6",
                    "likes": "2",
                    "time": "19/01/2022-02:18:09",
                    "content": "This is very impressive, congrats to everyone who worked on this. I’m glad to see concrete direction for RWA and looking forward to see how this iterates and then working on implementing these guidelines. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.749999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#7",
                    "likes": "3",
                    "time": "19/01/2022-16:03:32",
                    "content": "El Pro, Here is my perspective: (Christian - please update where needed)  Cashflow modeling is a key part of investing in loans/bonds.  The lender typically models the cashflows generated by the underlying pool of assets and then puts them through the transaction waterfall and sees if they can pay timely interest and principal on their loan/bond, and all other relevant expenses.  There are many nuances to this but typically the lender develops a base case and stressed cases for the cashflow generated by the asset pool and see how their loan/bond performs in these different scenarios.  The lender wants to know where the loan ‘breaks’ and its key sensitivities to asset performance.  This is easier for single asset pool transactions from one asset class originator and more difficult for transactions with multiple asset pools (think of lending to aprivate credit fund with 10 underlying loans from different assets/originators).  Its also easier for static pools versus revolving credit pools.   True sale is part of the bigger issue:  what is the potential risk of the originator’s/sponsor’s bankruptcy to Maker’s loan?  In the US this is a big risk as a bankruptcy court can interfere with creditor’s rights to a bankrupt companies assets.  Thus lenders want the assets to be structured in a bankruptcy remote SPV to mitigate this risk.  There are two key parts of this approach:  true sale and substantitative non-consolidation. At closing a transaction usually will have legal opinions on both of these issues which together are often referred to as bankruptcy remote opinions.   Credit enhancement typically refers to internal support such as overcollateralization, subordination, reserve accounts… In a technical sense these are amounts than can absorb losses to the structure before the senior Maker loan would take a loss. External support such as 3rd party guarantees can be very valuable but are typically viewed separately.   Backup  servicers, when required, are there to replace the primary servicer if needed.  Trustees can  be removed and replaced but are not usually backed up   Arms length means that the transation was conducted as if both were independent parties.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.045238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "0",
                    "time": "19/01/2022-17:09:00",
                    "content": "    Eumenes:  Cashflow modeling is a key part of investing in loans/bonds. The lender typically models the cashflows generated by the underlying pool of assets and then puts them through the transaction waterfall and sees if they can pay timely interest and principal on their loan/bond, and all other relevant expenses. There are many nuances to this but typically the lender develops a base case and stressed cases for the cashflow generated by the asset pool and see how their loan/bond performs in these different scenarios. The lender wants to know where the loan ‘breaks’ and its key sensitivities to asset performance.   Got it! And will the waterfall follow the same structure for ALL deals, or will it vary? As an example: Senior tranche 1 Senior tranche 2 Mezzanine tranche 1 Mezzanine trance 2 Junior tranche (first loss)     Eumenes:  This is easier for single asset pool transactions from one asset class originator and more difficult for transactions with multiple asset pools   Right. And this is because it is harder to liquidate multiple asset-types in a secondary market, correct?     Eumenes:  True sale is part of the bigger issue: what is the potential risk of the originator’s/sponsor’s bankruptcy to Maker’s loan? In the US this is a big risk as a bankruptcy court can interfere with creditor’s rights to a bankrupt companies assets. Thus lenders want the assets to be structured in a bankruptcy remote SPV to mitigate this risk. There are two key parts of this approach: true sale and substantitative non-consolidation. At closing a transaction usually will have legal opinions on both of these issues which together are often referred to as bankruptcy remote opinions.   Understood. Can we say (as an example) that the true sale process can be structure where an Arranger will be the “originator” and the true sale process allows the Arranger looking to remove credit risk, to sell their debt-portfolio to a “special-purpose-entity”?  And then that SPE can disperse the risk into tranches. Thinking out loud  Those tranches are then allowed to be sold to investors (risky but hey).     Eumenes:   Credit enhancement typically refers to internal support such as overcollateralization, subordination, reserve accounts… In a technical sense these are amounts than can absorb losses to the structure before the senior Maker loan would take a loss. External support such as 3rd party guarantees can be very valuable but are typically viewed separately.    Got it. So, 3rd party guarantees like an insurance policy from Lloyd’s TSB are acceptable, correct?     Eumenes:  Backup servicers, when required, are there to replace the primary servicer if needed. Trustees can be removed and replaced but are not usually backed up   Sounds good. I was just wondering what can happen if a trustee becomes insolvent.     Eumenes:  Arms length means that the transation was conducted as if both were independent parties.   Sounds good! And thank you for the reply! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.33829365079365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#9",
                    "likes": "2",
                    "time": "19/01/2022-17:43:33",
                    "content": " Waterfalls have some variation deal to deal but the basic structure is in most deals.  “This is easier for single asset pool transactions from one asset class originator and more difficult for transactions with multiple asset pools” Here I mean its harder to model deals with multiple asset classes/deals than one deal/one asset class.  Each separate loan in a credit fund manager’s portfolio would potentially need to be modeled and then you ‘pour’ all the resulting cashflows together in your loan structure, assuming you are making a loan to the credit fund manager against their various deals.  True sale is a legal standard that distinguishes between a secured loan and a true sale of the assets in question.  For painful legal details see page 3 and following.  We are actually using Bjorn (co-author) for some US transactions.  He is very good.    shearman.com    USA-LawPracticeChambersSecuritisationFIN022219.PDF 609.70 KB        yes - any 3rd party guarantee.  The most common type is by a parent or higher quality affiliate of the transaction party.   Maker will have the right to remove/transfer Trustees if the current one becomes insolvent.  Folks tend to use high quality trustees such as Wells, Wilmington Trust…  I havent seen one go insolvent yet.   ",
                    "links": [
                        "https://www.shearman.com/-/media/Files/Perspectives/2019/02/USA-LawPracticeChambersSecuritisationFIN022219.PDF?la=en&hash=35B2FDFD9407B7AE65B0C5A9C8614A302062FC53",
                        "https://www.shearman.com/-/media/Files/Perspectives/2019/02/USA-LawPracticeChambersSecuritisationFIN022219.PDF?la=en&hash=35B2FDFD9407B7AE65B0C5A9C8614A302062FC53"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.396747448979592
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#12",
                    "likes": "4",
                    "time": "20/01/2022-17:03:34",
                    "content": "It is a comprehensive list and matches nicely what Monetalis would require from the non-bank lenders on strictly credit performance related subjects. Good work indeed! I have a few general things for your consideration.  1/ …It takes 20 years to build it and 5 minutes to ruin it… So obviously, at Monetalis, we have also included in our review of non-bank lenders, a Green Economy review of the business and set conditions and controls for outcomes on this, given we are a Green Economy business and increasingly a signatory to several of relevant global principles (like UNPRI, OPIM etc) requiring us to indeed do so. We, of course, also do a review of the main key “value principles” that are legally required in the UK today for a lending operation - i.e. fair treatment of borrowers, complaints processes, modern slavery act compliance etc. On top of that we put our own value judgement: we won’t consider payday loans, young adults credit, we won’t consider trade finance situations to companies and countries we don’t feel ‘ok’ with, we won’t work with property lenders working with a certain sets of property developers etc. Basically we try to set the “reputation and good citizen” bar high, which I think is vitally important as Maker and TradFi integrate at scale (I have written ad nauseum about this under my BIS review post). For this reason I would suggest reputational risk consideration and value principles should be reviewed in any structured finance application. I think it is simply hazardous not to do so. It is unfair to expect the community and delegates to independently make this sort of review and assessment at the final vote when considering whether or not to accept a lending business. I know, I proposed this in a previous post, but, as Cato, I will continue to ask for Carthage to be destroyed. To illustrate:   A brilliant trade-finance business is proposed. It is safe, high volume and high return. The parties in the business are professional, loss history is impeccable, it is compliant to local laws etc. Reviewing using the list above, this is a great business. And let’s say Maker engages happily.   Within a year, an article gets published: It says: “MakerDAO is now the principal funder of textile businesseses using child labour working under inhumate conditions in country X via Lender Y. The businesses funded by MakerDAO have clear ownership and control links with the globally sanctioned junta Z and help finance the continuing genocide in country X”. And obviously the article will have an end payoff: “As the finance world and regulators have feared, the cryptoworld, as it engages with the traditional finance world, completely disregards the global playbook and rule set for how to act as a responsible global financial citizen. The regulators of the US, EU and the UK convene to consider aggressive measures to contain the crypto world integration with traditional finance. Institutional investors with large DAI holdings contacted by the newspaper are considering immediate sell-offs’’   Immediately all institutions have to freeze their work with Maker. Most current Maker-funded operations will start getting calls from their relevant regulators - and probably have their bank accounts frozen during an investigation period.   …sell-off spiral(?)…   I am clearly here dialling the story up to 11, I admit, but I hope it might just get you to include something on this in the methodology? Now, I would love the review to even extend to require proper ESG review also, but I suspect that requires a separate ‘Clean Money”/ESG CU or team. I will try to explore with SES how my team and I can help get that going.  2/ Triage & chunking the methodology? Now, when we at Monetalis review potential lenders, we don’t start by asking them for this large piece of data dumps, statements, necessary site visits and interviews etc. We triage - and we try to triage fast. We don’t want to waste other people’s time and resources (or our own for that matter) - it is disrespectful and results in a bad industry reputation. And so therefore we have a clear process in place. It looks like this - and I think is self-explanatory.  1600×888 146 KB  Just for completeness and understanding of practice: We found the most flexible way of managing this due diligence process is to keep track of each opportunity in a google sheet as it progresses along this process - and keep all material in the process linked into the spreadsheet, make conclusions in the spreadsheet and keep track of all decisions and meetings etc. Happy to share a version of it here. No fancy IT is really needed for this to be productive. I think it would be great if this comprehensive methodology list could be split into decision-relevant information/discussion chunks along the decision making process envisioned by RWF? I.e. what to bring to the table before a greenlight by the applicant and what RWF will review (if anything) before such a greenlight. What is the next piece to deliver that will be considered in developing an in-principle offer (or such) for common agreement? And what to do and what info to provide in the final confirmatory due diligence before final docs? Etc. I think that would increase the practical value of the methodology tremendously for all parties. Knowing when to have what ready would be very productive.  3/ Summary Advice One-Pager for Applicants? This methodology plus the various other pieces of direction recently published by the RWF are great helpers. I think, perhaps now, it would be very instructive to turn all these into a one-pager “Quick Advice for aspiring Maker RWA Asset Managers/Lenders” - and perhaps add a bit of colour on what to expect in working with Maker? I think that would be a great help. To illustrate what I am envisioning, here’s sort of a very, very quickly written example:  -----NOT ACTUAL GUIDANCE! NOT REAL! EXAMPLE ONLY!----  ADVICE TO APPLICANT SEEKING RWA CREDIT WITH MAKER  Sweet-spot Maker Credit Facility Parameter Summary:  USD-based Investment Grade Credit (as in zero losses expected to the Maker loan portion with a 99.99%+ confidence - or equivalent measure/test to show loss exceptionally unlikely) Senior (as in there is a junior/equity capital portion paying for the full loan) Secured (as in there are actual assets that can be accessed backing the loan) Zero lock-up/at-will liquidation (as in Maker must be able to sell/liquidate or request run-off of credit facility at its own discretion at any time) Minimum facility: USD [x0M] (a size where investments in DD and sign-up spent on both sides makes financial sense) Maximum facility: USD [x00M] Stability Fee:  expect rates comparable to large international banks in their relevant markets Only 12 to 24 months locked-in rates max - above variable   Expect a profit-share dimension Facility length: 1 to 50 years (note the at-will liquidation above) Repayment of Principal and Stability Fee upon liquidation - or earlier Short to medium term duration of underlying portfolio’s (i.e. no 10y+ lending) Relevant, market standard, economic exposure to the underlying portfolio by Asset Manager in alignment with Maker Underlying portfolio reasonably diversified Limited discretion in underlying credit characteristics in any portfolio build-up proposals No Covenant-lite or other aggressively designed underlying loan portfolio documentation or structures. Plain vanilla only. Green Economy/Clean Money/ESG credentials appreciated Market standard reporting package Expect non-standard Maker-related off-shore holding vehicle and governance package …?   Working with Maker - matching expectations  Maker Money is neither easy, nor cheap or dumb. If you are looking for either of these qualities, Maker is probably not the right source of credit for you. Expect community-wide, extensive, first-principle based debate on the merits of your application, which you will have to productively engage with - or it is unlikely your application will succeed. This is a bigger task than you think. Expect large resource draws and expenses during the approval process - and expect no actual commitments from Maker before the final executive vote and implementation in place. You will feel uncomfortable as you go through this. The crown-jewel of Maker is its ever-expanding, active and competent community debating, deciding and executing on a common, ever-evolving vision. You are strongly encouraged to play a continued active contributing role in the community. Expect surprises and expect to feel confused from time to time. The Maker governance processes and quantum mechanics share similarities: both are only truly understood in detail by very few on planet earth. Just go with the flow. …?   4/ How to connect Methology with applicant realities? We have now, quite quickly and thoroughly, set a high qualification bar for Maker Credit. Very good work by RWF indeed! In fact, I think perhaps, so high, that if somebody had to have perfect, global level, scores on all dimensions of this methodology we would probably only be talking about Maker setting up credit arrangements with large scale, international, mature banks and asset managers (JP Morgan Chase, Goldman, BlackRock etc), who were willing to work with a Maker designed tradfi/crypto legal/structural integration point. Now, none of these institutions are at the current moment in the applicant pipeline - and if they were, I suspect it would only be to ‘run a crypto pilot test’ - and obviously Maker cannot build a bedrock of RWA deployments on the sands of ‘pilots’. That is quite simply too volatile a base to build anything upon. As far as I know about the current applicant pipeline, there are none in it that would today be able to score “10” across the board. At Monetalis clearly we are less well capitalised than JP Morgan Chase, cannot show a 10 Trillion dollar AuM like BlackRock or the long-term, global, consistent high return “chops” of Goldman. Equally, on the surface of it, it would be hard to say that the Societe Generale bond is a world-beater in yield vs underlying risk - nor perhaps is the bond a crystal clear indicator of long-term commitment to Maker by Societe Generale. But, importantly, we (and here I mean not just Monetalis, but many of the current applicants) can do a lot of other things that are important at this exact moment of Makers transition from RWA experiments to large scale deployment. Things that aren’t captured in this methodology (and probably shouldn’t be btw - this is not a critique of the methodology by any means). Things such as:   We are willing to invest in, and collaborate with Maker, on building a custom structure and platform (off-chain or on-chain)  that allows for large scale credit deployment and provides Maker the governance and control it desires. A structure that can ultimately be reused again in other relationships Maker may wish to set up.   We are willing to accept and work with the fact that probably this next 12 months several changes and adjustments will be necessary to get all dimensions of RWA deployment working smoothly: from legal structure over reporting and collateralization calculations to IT components interfacing with Maker.   We are willing to make long-term commitments towards working with Maker on growing a credit platform - 100% of our business is from Maker - everything is setup specifically to service the unique needs of Maker. To us this is not a pilot.   We are willing to truly participate in the Maker community to help professionalise the RWA component of the Maker platform.   Now, given the RWA applicants are true professionals in their field, then I think the above list plus said applicants are what, in combination, is needed right now to professionalise - and then institutionalise - Maker, and drive it forward to large scale RWA deployments. I, somewhat, have this mental picture of the Maker RWA growth being split into 3 periods/stages:  2020/21: Experimentation / “Crawl” - No AuM demands  Various smaller scale tests and adjustments to get the community comfortable with RWA and basic infrastructure. Very entrepreneurial.   2022: Professionalisation / “Walk” - USD 1B  Based upon learnings from 2021, work collaboratively with entrepreneurial industry professionals to build appropriate structures (on-chain and off-chain) and arrangements to deploy USD 1B over the year in a safe manner. Potential tests with tier 2 and 1 bank/asset managers. Sort out roles such as Arrangers, Attestors and CU’s Gain complete clarity and control over concepts such as Clean Money. Get ALM etc right   2023: Institutionalisation / “Run” - USD 10B+  With now proven structures, volumes, controls, roles and requirements - Maker (or appropriate role) can confidently and competently engage with tier 1 asset managers and banks to deploy into the trillions (and not look like an experimental deployment).  My overall point being: …when the community starts to see risk reviews from the current applicant base, and it is clear they are not even close to Goldman in scope/scale/quality and certainly won’t score “10” on all methodology aspects, please do have a think about what phase we are in right now with RWA implementation - and ask yourself whether you think the applicant is, or isn’t, the right kind to help Maker rapidly professionalise RWA and facilitate large scale deployments within the next 12 months to hit the USD 1B target - and, broadly speaking, be productive in getting Maker to a place where Maker can act as a competent partners with tier 1 banks and asset managers - and as such have truly integrated with TradFi… ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-rwf-collateral-risk-level/12254/13",
                        "https://docs.google.com/spreadsheets/d/1VsgipjiUEUuMpe57pJYZ2G-bYHOL0-HjVCApbMLSdEA/edit?usp=sharing"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.706831831831831
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "3",
                    "time": "20/01/2022-21:50:41",
                    "content": "    Allan_Pedersen:  My overall point being: …when the community starts to see risk reviews from the current applicant base, and it is clear they are not even close to Goldman in scope/scale/quality and certainly won’t score “10” on all methodology aspects, please do have a think about what phase we are in right now with RWA implementation - and ask yourself whether you think the applicant is, or isn’t, the right kind to help Maker rapidly professionalise RWA and facilitate large scale deployments within the next 12 months to hit the USD 1B target - and, broadly speaking, be productive in getting Maker to a place where Maker can act as a competent partners with tier 1 banks and asset managers - and as such have truly integrated with TradFi…   Nice final words of wisdom here -- with S&P Global forecasting another record year in Global Structure Finance in 2022 ( forecasting $1.56 trillion), achieving the 1B DAI target is less than 0.1% of the total pie. They also expect a continuation of the importance of the environmental and social components of ESG to continue grow. With all that said, I just hope that we are able to avoid barriers and we don’t impede the principle of breakthrough thinking. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.578373015873016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#14",
                    "likes": "4",
                    "time": "21/01/2022-13:39:31",
                    "content": "Agree on this @flipflopflapdelegate, The work of the RWF team(s) is not an easy one, as it involves several things to run in parallel:  Find consensus over a vision → we started this with the Sandbox Communicate this vision internally and externally → we are doing this daily with all the counterparts involved, including Monetalis Protect Maker from existential threats while keeping an open mind to innovation → we are doing this through the DD efforts of all past and present MIPs Show the community we can deliver in the short term while we keep raising the quality bar → we hope we will soon be able to deliver, within Q1, in line with this vision Develop all checks and balances internally to make this happen, the Methodology posted here is a very important step in that direction → SES’s incubation program goes in this direction, with all the relevant CUs (risk/ legal/ compliance) part of such program as we speak  We are all excited and extremely optimistic. I, personally, keep sharing within the industry Maker’s competitive advantage: an almost infinite source of liquidity at extremely competitive rates that will be one day ready to compete with the largest sovereign issuers in the traditional world, and a protocol that remains ambitious and with the desire to sustain a new phase of sustainable capitalism. The interest is emerging. I am convinced that as soon as we establish the right pipes that connect us with the wider ecosystem, demand won’t be an issue. In the medium term, Maker could become ubiquitous as a senior lender within DeFi/ MixedFi, and DAI its dominant currency. The future is exciting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.557771395271395
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#15",
                    "likes": "4",
                    "time": "21/01/2022-14:51:14",
                    "content": "@flipflopflapdelegate I am confident that Maker can invest in large call RWA assets this year but we need to form a consensus vision as Luca notes, build strong structures (which we are currently doing!) and invest in a few solid early deals that show how this can work.  Once the word is out that Maker is actively making senior secured loans to high quality asset backed portfolios, there will be much interest in working with us.  We are also currently in discussions to finance several high quality asset portfolios with high profile counterparties. Update: I want to share a few issues that we currently working to resolve: @christiancdpetersen - could you provide some thoughts here as well? Design and Build a Governance Process for Maker to Enforce and Implement Its Lender Rights (1)  A senior secured lender has broad rights in a loan transaction so how will Maker decide how and when to enforce these rights, if needed?  For example, if the loan performs poorly and trips a performance trigger, an Event of Default(EoD) will occur.  At that point the lender will have a variety of options ranging from waiving the EoD all the way to seizing the underlying collateral and selling it to repay the loan balance. Maker needs to design and implement a goveranance process that will determines its course of action and how best to implement these actions.  Which most serious decisions should be determined by MKR vote?  Which next level of decisions can be resolved by some type of Maker representative such as an Attestor?  Finally which lower lever decisions can be resolved by the day to day representative such as a Trustee? Design and Build a Collateral Validation and Control Process for Maker (2)  A successful senior secured lender must have (1) valid collateral backing its loan and (2) control over the collateral.  When Maker makes a senior secured loan to a Borrower, how will Maker know that the collateral backing the loan is valid? For example if Maker makes a secured loan to a Borrower backed by a pool oF auto loans, how is Maker conFident that the auto loans are valid such as the loan was originated in accordance with its Credit Policy? Thus Maker needs to design and implement a robust process where an entity reviews and approves the proposed collateral beFore extending a the loan.  Which entity will perForm key Function, how will they be aligned with Maker, how will they do this and what will be their reviewing standard? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.576363287250384
                },
                {
                    "author_link": "https://forum.makerdao.com/u/christiancdpetersen",
                    "index": "#16",
                    "likes": "5",
                    "time": "21/01/2022-17:45:13",
                    "content": "    Eumenes:  Maker needs to design and implement a goveranance process that will determines its course of action and how best to implement these actions. Which most serious decisions should be determined by MKR vote? Which next level of decisions can be resolved by some type of Maker representative such as an Attestor? Finally which lower lever decisions can be resolved by the day to day representative such as a Trustee?   This is a key issue as real world issues require nuance. The appropriate answer for Maker, as a decentralized protocol, may be anywhere along the spectrum of “totally hands off other than liquidation” to “totally hands on this is risky”. As the Maker protocol on-boards new assets at scale, the question and answer becomes more and more relevant. We know what senior lenders in the real world typically request and we want to make sure that we calibrate that understanding with what the Maker community may expect and/or require. We are working on a recommendation for community consideration.     Eumenes:  When Maker makes a senior secured loan to a Borrower, how will Maker know that the collateral backing the loan is valid? For example if Maker makes a secured loan to a Borrower backed by a pool oF auto loans, how is Maker conFident that the auto loans are valid such as the loan was originated in accordance with its Credit Policy?   For a protocol based on “trustlessness”, this also becomes an important consideration. This is one area where Maker can build upon the learnings of traditional finance. Finally, as the methodology is lengthly and detailed, we will be organizing an “Ask Me Anything” session regarding the methodology. We look forward to community engagement on the methodology. The expectation is that detailed, structured and well-considered discussion of these issues will enable the community to build upon Maker’s competitive advantage. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.002029220779221
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Allan_Pedersen",
                    "index": "#17",
                    "likes": "0",
                    "time": "23/01/2022-07:11:31",
                    "content": "Hi @christiancdpetersen  and @Eumenes, Very important practical subjects (governance layers + loan vs guide verification). They speak brilliantly to the mental picture of 2022 being sort of a “walk” period of the RWA evolution in Maker where a lot of processes, infrastructure and structure needs to be designed, tested in practice and adjusted to reach a solid, institutional level. A key thing to realise is, no matter how much we think through these subjects at this moment, it is pretty much guaranteed we won’t get the solutions completely right the first time around! These are new structures and processes for embedding into Maker governance, and one must clearly plan for, and expect, unforeseen issues happening in practice, that will require adjustments, over the coming 12 months until a stable firm solution has evolved. This will be the same for a good number of other specific choices that need to be made by Maker over the coming months in respect of RWA interaction I reckon. Given this, of course, Maker must ensure it can adjust and change these solutions as it requires, at its own discretion, within the legal and structural documentation surrounding these key subjects. But even more important is it to ensure that the Asset Managers in this period are “tied”/”connected” appropriately to Maker, in a way, that Maker can trust they would never take advantage of any “loop-holes”/bugs, that might appear as these structures/processes are perfected, for an Asset Managers short-term gain and Makers loss. The ideal, Maker aspires to, is creating trustless mechanisms, but, here during the practical design, testing, adjusting, and re-testing phase, unfortunately, old-fashion community trust is required on top of the initial legal agreements and processes, for this RWA structural evolution to happen in a safe manner. Otherwise this attack vector of “loop-holes”/bugs may become a bit scary for Maker to expose itself to. Luckily, I think, the RWA pipeline has quite a lot of applicants worthy of the community’s trust. All a product of having a very active community and having gone through the ‘crawl’ period. What would one look for to determine whether the Asset Manager applicant is worthy of this sort of community trust? Clearly it is a personal and subjective decision for each member of the community, but the following consideration might go into such a decision:   History, engagement with, and behaviour within the Maker Community? Sort of the community equivalent of “looking somebody in the eyes” and determining if one thinks one can trust the applicant   Asset Manager “setup” designed for long-term relationships with Maker? I.e this is not a pilot or just a one-time event - somebody is committing to growing with Maker. Here one could also look at the size of investments made in dedicated Maker infrastructure: the more, the greater commitment   Long-term MKR owner? Somewhat the ultimate alignment with the Maker protocol   How “Open Book” is the Asset Manager? Showing alignment with the key principle of Maker of transparency - and as such making it impossible to hide transgressions.   Maker “Governance Reach” within the Asset Manager? How deep and far within the Asset Manager can Maker appoint key governance participants and oversee decisions.   All in all, in practice, when reviews based upon the credit Methodology of Asset Manager applicants start coming out, I would probably encourage the community members overlay this sort of consideration in final assesment:  “do I trust connecting this Asset Manager to our “first version” RWA governance interface, and trust that they do not abuse any ‘loop-holes’/bugs, but instead collaborate with Maker on fixing them as they appear in practice?”. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.815263053273258
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeremy_Kim",
                    "index": "#18",
                    "likes": "2",
                    "time": "26/01/2022-00:44:02",
                    "content": "This is highly detailed, and very well written! Just a few questions and thoughts:  Investment Grade with an appropriate return Can you clarify what is meant by “appropriate return”? Are you benchmarking against the private ABL market? Or the public term securitization market? Would the onus be on the presenter of the investment opportunity (i.e. the Arranger, or otherwise) to contextualize it for the Maker team? Are there limitations on WAL (i.e. would Maker consider a 7 year WAL investment as long as the returns are appropriate, or does it depend on the underlying collateral and historical collateral performance, or is there a blanket preference for shorter duration investments)?      Eumenes:  Ownership and Management are aligned with Maker   Can you clarify what this means? Specifically - if the Asset Manager has a fiduciary duty to their investors (or if the Asset Manager is an Originator, then their shareholders), there may be instances where this may conflict with the duties to a senior lender (in this case, Maker). For instance, in an event of default, the Asset Manager may be incentivized to delay collateral liquidations to avoid selling at too low of a price - even if selling at that price would cover the full senior position and pay off that senior position sooner rather than later (I’ve personally seen this happen in the securitization space with an orphaned NPL deal). Some additional guidance on this would be helpful (perhaps some sort of corporate guarantee with a financial covenant on the parent?).     Eumenes:  Updating fund and investment forecasts, including stress cases   Would Maker have a process in place to validate these forecasts independently, or would Maker be relying on the forecasts provided by the Asset Manager?     Eumenes:  Asset Manager Historical Performance: the Asset Manager provides a performance track record that demonstrates their ability to generate risk adjusted returns through the business cycle, including  Fund and investment level details  Monthly investment Losses analysis and rationale  Senior and junior facility level Asset level     In the eligible and related assets Includes gross returns, various expenses and net returns to investors Use of leverage As compared with a reasonable performance benchmark Auditable    For Asset Managers who are structured credit hedge funds, would it be overkill to ask them to disclose all of their investments outside of the actual investment being presented? Structured credit funds, particularly funds participating in the specialty finance/direct lending/ABL space, typically do not disclose full details on all investments, even to investors in their fund, let alone a senior syndicate investor in a specific investment. I think what would be reasonable is the historical performance of the eligible and related assets - it is standard to share loan/payment tapes, either specific to the originator’s platform, or benchmarked to a blend of existing originators (if the platform/asset itself is too new).     Eumenes:  Account control  Collateral security over SPV account(s) Mechanics for payments from SPV accounts    Can you clarify what the intent is here? Most deals I’ve seen have springing DACAs in place. I have also seen deals with active DACAs, but every distribution/remit required review and formal written approval from each lender and the trustee.     Eumenes:  Credit Enhancement  Overcollateralization Excess Spread Cash Reserve Accounts Subordination Third Party Liquidity    Can you clarify what is meant by “Third Party Liquidity”? Would this be like an Assured Guaranty wrap? Or would a corporate guarantee from the parent of the originator qualify as third party liquidity?     Eumenes:  Financial Covenants  Asset Manager financial health Originator financial health Servicer financial health Borrower creditworthiness    Can you clarify what is meant by “Borrower Creditworthiness”? Would this mean that subprime loans (i.e. subprime auto, deep credit subprime unsecured personal loans, etc) be excluded, even if the loans are priced correctly to cover default risk?     Eumenes:  Transfer of assets from originator to a special purpose vehicle (“SPV”)   Will Maker only consider SPVs, or would any structure qualify, as long as a true sale holds? (i.e. Trust structures)     Eumenes:  Declaration of an event of default   Oftentimes for private ABL deals, covenants will be waived at the discretion of the senior lender (typically happens so that the senior lender has time to review trends in the collateral, and possibly make amendments to contain pockets of risk, rather than declare full default and try to recoup the principal). Would this be the case with Maker as well, or should default triggers be set assuming that there will be no waiver of default trigger breaches? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.382232722634508
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#19",
                    "likes": "0",
                    "time": "26/01/2022-19:16:48",
                    "content": "Jeremy - thanks for posting.  These are good and challenging questions.  Investment Grade with an appropriate return Can you clarify what is meant by “appropriate return”? Are you benchmarking against the private ABL market? Or the public term securitization market? Would the onus be on the presenter of the investment opportunity (i.e. the Arranger, or otherwise) to contextualize it for the Maker team? Are there limitations on WAL (i.e. would Maker consider a 7 year WAL investment as long as the returns are appropriate, or does it depend on the underlying collateral and historical collateral performance, or is there a blanket preference for shorter duration investments)?  We are looking for reasonable benchmarks for the specific proposed investment that help inform RWA as to its risk-return profile versus other opportunites available to Maker.  It would be helpful if the presenter to contextualize their proposal but RWA will also perform its own diligence.  Maker also has some strategic investing initiative such as ‘Green’ investing that are also factored in.  Given the nature of Maker’s relatively short liabilities, it makes sense for Maker to prefer shorter duration investments.     Eumenes:  Ownership and Management are aligned with Maker    Can you clarify what this means? Specifically - if the Asset Manager has a fiduciary duty to their investors (or if the Asset Manager is an Originator, then their shareholders), there may be instances where this may conflict with the duties to a senior lender (in this case, Maker). For instance, in an event of default, the Asset Manager may be incentivized to delay collateral liquidations to avoid selling at too low of a price - even if selling at that price would cover the full senior position and pay off that senior position sooner rather than later (I’ve personally seen this happen in the securitization space with an orphaned NPL deal). Some additional guidance on this would be helpful (perhaps some sort of corporate guarantee with a financial covenant on the parent?).  RWA looks for investments where the originator/asset manager is reasonably aligned with Maker, but to your points this does not mean they are perfectly aligned with Maker.  For example, if the originator owns a sizable 1st loss piece, they will generally be aligned for the transaction to perform well.  They will, to your point, also want to defer taking losses, but we would expect that a reasonable structure and credit policy would reasonably protect Maker in terms from clever charge off timing or loan modifications.     Eumenes:  Updating fund and investment forecasts, including stress cases    Would Maker have a process in place to validate these forecasts independently, or would Maker be relying on the forecasts provided by the Asset Manager?  RWA would review the asset manager’s forecasts but also form its own view.  For Asset Managers who are structured credit hedge funds, would it be overkill to ask them to disclose all of their investments outside of the actual investment being presented? Structured credit funds, particularly funds participating in the specialty finance/direct lending/ABL space, typically do not disclose full details on all investments, even to investors in their fund, let alone a senior syndicate investor in a specific investment. I think what would be reasonable is the historical performance of the eligible and related assets - it is standard to share loan/payment tapes, either specific to the originator’s platform, or benchmarked to a blend of existing originators (if the platform/asset itself is too new).  This question is directed to asset managers who are asking Maker to be a senior lender across its portfolio, so in that case yes it makes sense.  Can you clarify what the intent is here? Most deals I’ve seen have springing DACAs in place. I have also seen deals with active DACAs, but every distribution/remit required review and formal written approval from each lender and the trustee.  Ideally the underlying cashflows from the financed asset pool would be paid into a lockbox.  Operationally this can be challenging so there is some flexibility particularly for larger more established originators.  Then its also a question of how often their bank accounts need to be swept to a lockbox.  Additional cash reserves accounts could potentially help mitigate this risk as well.  Can you clarify what is meant by “Third Party Liquidity”? Would this be like an Assured Guaranty wrap? Or would a corporate guarantee from the parent of the originator qualify as third party liquidity?  Any type of 3rd party guarantee.  Can you clarify what is meant by “Borrower Creditworthiness”? Would this mean that subprime loans (i.e. subprime auto, deep credit subprime unsecured personal loans, etc) be excluded, even if the loans are priced correctly to cover default risk?  I think this in redundant given the prior list of asset manager, originator, and servicer.  Apologies.  Will Maker only consider SPVs, or would any structure qualify, as long as a true sale holds? (i.e. Trust structures)  I generally defer to @christiancdpetersen as he is a lawyer and I am not.  My view is that Maker wants firm protection from bankruptcy entangling the financed collateral and is fairly agnostic on the specific structure.  Maker also needs a structure that works with its rather unique governance process which we are actively working on!  Oftentimes for private ABL deals, covenants will be waived at the discretion of the senior lender (typically happens so that the senior lender has time to review trends in the collateral, and possibly make amendments to contain pockets of risk, rather than declare full default and try to recoup the principal). Would this be the case with Maker as well, or should default triggers be set assuming that there will be no waiver of default trigger breaches?  Again we are actively working on this key issue.  But we expect that Maker will end up with a process that addresses the various nuances of different types and situations in events of default as opposed to ‘liquidation cures all’ approach. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6758404356060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MGRay",
                    "index": "#20",
                    "likes": "0",
                    "time": "07/02/2022-13:57:39",
                    "content": "Wow, that seems to be something genuinely great. I didn’t even expect there are these possibilities nowadays. Cash flow modeling has to be the essential feature when talking about structured finance transactions. Honestly, I would like to use one as I’m planning an investitionsplan right now, and I hope to realize it as soon as possible. Moreover, I think that apps like PayPal or its alternatives presented here https://www.moneyunder30.com/ might also need such an advanced feature. I mentioned they have an insane amount of issues related to structured finance transactions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5928571428571425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Scarlet_Chen",
                    "index": "#21",
                    "likes": "1",
                    "time": "09/02/2022-06:24:40",
                    "content": "Thanks so much for the extremely detailed guideline! As you might know, Robinland passed the greenlight poll and is now in the evaluation process with the RWF Core Units. We want to make sure that we deliver a solution that fits Maker’s needs, so would like to amend our proposed structure in accordance to the above guidelines. We’ve been studying this internally over the past few weeks and have a few quick clarification questions. Once we have clarity on that we can send over a new version of our structure which fits neatly into the guidelines:     Eumenes:  b. Avoid substantive consolidation of SPV with the Asset Originator  Demonstrate separateness of SPV and originator in operations, governance, administration, and organizational formalities. Factors that support substantive consolidation include:  Common ownership or control Common directors Consolidated filing of tax returns Consolidated accounting treatment Inter-corporate loans/guarantees Commingling of assets and business functions Asset transfers without observance of corporate formalities Common books and records, payment of liabilities, holding themselves as related entities   Delivery of a non-consolidation legal opinion        Eumenes:   An independent, reputable, third party (not the borrower) to take action based on direction from Maker governance (or majority token holders) in certain defined circumstances (e.g., conditions precedent to disbursement of funds to borrower). An independent, reputable, third party to serve as paying agent (i.e. to initiate the fiat/DAI conversion for ultimate repayment to Maker and other creditors (e.g., TIN)). An independent, reputable, third party to hold and take direction in respect of, any assets pledged as collateral security for the benefit of Maker (and, if applicable, other creditors). An independent, reputable, third party to take actions directed by Maker (or majority token holders) in the case of a borrower default (sell assets, collect and distribute cash, exercise other collateral security rights, file claims, etc.).    We know that Maker has explicitly said a DST structure is not a must. On the other hand, after reading the above paragraphs closely several times, we do believe DST is one of the only ways to deliver it for the below reason: based on the first paragraph, if the SPV is truly separate with the Asset Originator, this reduces risk for Maker but increases risk for Robinland as we lose control over the underlying asset. In order to also protect our own interest, a trust structure seems to be the only way to go. Also description in the second paragraph pretty much is describing a trustee in a trust structure. So we’re just curious whether Maker thinks that a DST is the way to go, in which case Robinland is more than happy to switch to such a structure, and if not, if there are ways to give Maker the above without it, i.e. any example we can refer to? We’ve heard that Maker is considering entering into a bulk deal with a specific trustee WSFS. We’re wondering whether it’s already in place and if so if we can use them through Maker’s contract with them, as it (1) saves cost and (2) means we’re already using a trustee that satisfies Maker’s needs. If Maker hasn’t entered into deals with WSFS yet, we’re wondering if Maker is ok with us finding our own trustee, and if there’s anything specific that Maker is looking for in a trustee.     Eumenes:  Knowledgeable on current trends in  Eligible and related assets    Does this refer to Robinland being knowledgeable about trends on Maker’s forum about Maker’s demand or does it refer to our knowledge about real estate market in general?     Eumenes:  c. Ownership and Management are aligned with Maker  Demonstrable and meaningful economic exposure given nature of transaction (measured on a relative basis)    Would appreciate if Maker gives more clarity on this! Does this refer to Robinland’s exposure to the real estate market or Robinland’s exposure to Maker (i.e. Maker taking a significant fraction of Robinland’s transactions)?     Eumenes:  e. The Asset Manager follows investment processes at both the fund level and (individual asset) investment level, including       Eumenes:  Individual asset investment process  Investment underwriting policies and procedures including        Eumenes:  Concentration matrix   What does concentration matrix refer to? (Wondering if the intended wording here is ‘concentration metrics’?) Does it refer to how concentrated Robinland’s underlying portfolio is?     Eumenes:  Process for transitioning to another asset manager if Asset Manager exits   Wondering if the ‘Asset Manager’ here refers to Robinland or the manager of a specific real estate asset? We’re asking because, if the former, then this is asking what happens if Robinland exits, but the revolving credit line is between Maker and Robinland. If the latter, it doesn’t apply because we’re handling the debt instead of equity of real estate, meaning that there’s not an ‘asset manager’ but just ‘fund manager’ (which is us).     Eumenes:  g. The Asset Manager provides reporting to the investor including   Curious who does ‘investor’ refer to here - is it Maker or is it individual investors who participate in token sales?     Eumenes:  Transaction Financial Structure:       Eumenes:  a. Financial structure       Eumenes:  Credit Enhancement   Wondering if the credit enhancement piece refers to ‘Robinland towards Maker’ or the ‘real estate projects towards Robinland’     Eumenes:  c. Cash flow analysis       Eumenes:  Detailed collateral performance assumptions such as       Eumenes:  Replines   Wondering what does ‘replines’ refer to here?     Eumenes:   Existence of an agent to act for senior and junior security holders Enforcement of security holder rights Funds collection and distribution (e.g., Tinlake)    The only way we can think of to solve this is to have the trustee enter into legal contracts with the developer (given that Maker cannot sign legal contracts), which is another argument for why we think it seems we have to employ a trust structure after all. Under our current framework (which is not a trust), the developers will pay interest into a bank account that’s ultimately owned by Robinland, since we will not have an agent to distribute the funds.     Eumenes:  Transaction Legal Structure:       Eumenes:  d. Transaction Considerations       Eumenes:  Representations and Warranties   Representations and warranties from which party to which party? Many thanks for your patience reading through our questions! Really appreciate it! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.608274866895556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheThadP",
                    "index": "#22",
                    "likes": "4",
                    "time": "09/03/2022-04:13:58",
                    "content": "One of the weaknesses of the current system of structured finance, and in particular ABS securities, is the myriad of formats that the trustees and reporting agents produce to give periodic updates on the collateral performance, cashflow waterfall. There is an entire industry that exists to parse the reports and standardize them (Intex, Moodys SFP, Kanerai, etc.). Careful thought should be given to a standardized reporting and modelling framework to reduce the friction and opacity generated by the patchwork system currently implemented. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.066666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/numair",
                    "index": "#23",
                    "likes": "1",
                    "time": "10/04/2022-17:17:25",
                    "content": "@Eumenes @christiancdpetersen Thank you for pointing me to this link, it’s really quite helpful. Are there any examples of a completed version of this information disclosure that could be used for those who are looking to structure their responses? If not, I would be more than happy to work with your team on creating an open example for others to follow. For reference, my colleagues and I work with a G7 government that operates a bilateral funding program for renewable energy and decarbonization in developing countries. One of their certified projects would be the basis for this example. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#24",
                    "likes": "0",
                    "time": "11/04/2022-15:15:50",
                    "content": "Hello - thanks for posting! We do not have such as case yet but would like to work with others such as yourself to create a valuable benchmark. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/numair",
                    "index": "#25",
                    "likes": "3",
                    "time": "12/04/2022-09:28:41",
                    "content": "Thanks @Eumenes that sounds great! I’ve been discussing this with my colleagues to figure out which parts we could do out in the open, and which might need to be kept private for now. We are very interested in providing a reference for both the MakerDAO / DeFi communities and the various governments / others for whom greater awareness of the power of DeFi could accelerate a necessary transition. I am thinking the correct course of action will be to have “progressive transparency,” whereby we discuss things in emails and other communications that are intended to be made public once disclosure becomes possible. The end result will, of course, be a completely public, open-source document, and open discussions here on the Maker Forum. It will be great to provide this community with the real economics – real yield, real fees, all the fees – that have gone into deals arranged by people that have operated in the green finance sector for more than a decade, on projects located in more than a dozen countries. These deals aren’t done as charity work, or as part of a philanthropic enterprise. The motivating factor is the large amount of money that will be made by facilitating a do-over of the industrial revolution to make it clean and sustainable. Sustainable finance is highly unsustainable if you aren’t charging real fees and earning real yield – the skepticism in this community regarding deals of that nature is well-warranted. A lot of the “philanthropy” in the green finance sector has turned out to be extremely predatory, as exemplified by this recent Bloomberg article. I am keen to see the DeFi community drive the charlatans out of this game. Please let me know how to connect with you, @christiancdpetersen and other members of the Real World Finance Core Unit via email – perhaps in a DM, to avoid the spambots… I will follow up with information on the various government/private organizations in our ecosystem, and a few upcoming projects with different yield and risk profiles that could be considered for this case study. Regards Numair ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.64156462585034
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#26",
                    "likes": "0",
                    "time": "12/07/2022-15:29:02",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "558"
}