{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-oracle-feed-as-service/7623",
            "title": "[Discussion] Oracle Feed As Service ",
            "index": 7623,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracles",
                "price-feed"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "5",
                    "time": "23/04/2021-01:23:46",
                    "content": "Exchanges in the equity, fixed income, derivatives, currencies, and commodities world made an estimated $6 billion in revenue and 76% operating margin from information services related to provision of market data. I would like this thread to be a place to both brainstorm specific ideas and draw attention to a potential revenue source from our existing and future oracle network. I think it deserves attention and as someone not involved in its operation, would like to learn more about its capabilities and potential. My first thoughts are that our feeds — both Medianizer and OSM — could be either sold as a subscription or bundled with private vaults (to KYC and collect more market data) in the following ways:   Near real-time data across markets to enable/prevent arbitrage   Added risk management by exchanges/brokers that wish to be alerted to possible market manipulation in their specific pools (waves to Compound)   Collection of historical data for algorithmic and other technical trading desks to backtest strategies   Better information for news sources that currently all seem to draw 24-hour VWAP feeds instead of ours   Ability for market participants to see the true depth and liquidity of individual assets across the fragmented crypto exchange ecosystem   …and so forth and so forth. So. What resources does the oracle team need to retain historic data and how can we make a product that growth can pitch? ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.494318181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#2",
                    "likes": "9",
                    "time": "23/04/2021-17:24:09",
                    "content": "Oracles as a Service is a core feature of the Oracle Core Unit (coming very very soon). Monetizing processed market-data both on-chain and off-chain are both products of said core unit. Although the TAM is quite small at the moment, I anticipate that market to grow quite large as the industry scales over the next few years. I’m looking forward to being able to share my vision with the community on the future of Oracles. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.374489795918366
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#3",
                    "likes": "0",
                    "time": "23/04/2021-17:57:31",
                    "content": "    NikKunkel:  I’m looking forward to being able to share my vision with the community on the future of Oracles.   that’s going to be a super interesting CU proposal! Can’t wait! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.018229166666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#4",
                    "likes": "1",
                    "time": "24/04/2021-12:33:41",
                    "content": "I definitely think it is a good source of revenue to sell oracle services. dYdX has mentioned that they wanted to use Maker oracles on their exchange. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#5",
                    "likes": "3",
                    "time": "26/04/2021-14:53:03",
                    "content": "I’ve always been thinking that MakerDAO Oracle System is the best between all the other DeFi projects, products like the Medianizer is something you don’t see anywhere.     NikKunkel:  Oracles as a Service is a core feature of the Oracle Core Unit (coming very very soon).   I’m very excited with this news from the Oracle Team, keep the good work ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.4975000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#6",
                    "likes": "1",
                    "time": "26/04/2021-16:49:35",
                    "content": "More sources of revenue are always good. Revenues from such services could potentially be used to subsidize stability fees, or supplement what goes into the DSR; either use would be a worthwhile investment, I say. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#7",
                    "likes": "1",
                    "time": "26/04/2021-19:31:11",
                    "content": "What do you think the TAM is now and where do you think it’ll be in 3 years and 5 years? The market is assigning a ~$35B market cap to the largest pure play (chainlink) but there doesn’t seem to be any value assigned to MKR’s oracle business. Is this because we’ve been mostly internally focused, is the market just unaware, or are they different businesses? I don’t really know anything about the oracle business outside of the LINK marines trying to shill everyone under the sun about their partnerships so appreciate any insight. Very much looking forward to the CU proposal! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.528061224489797
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#8",
                    "likes": "2",
                    "time": "26/04/2021-19:31:29",
                    "content": "I would like to one day see a higher DSR, but I think we are a ways from then. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "1",
                    "time": "28/04/2021-00:28:26",
                    "content": "    Aes:  What do you think the TAM is now and where do you think it’ll be in 3 years and 5 years?   Current TAM is approximately $1.5 Trillion based on current overall market cap, excluding protocols that do depend of Oracle data feeds. Such as Flow blockchain, and old school PoW coins. In 5 years it should scale to $8 Trillion—providing the Oracles CU an opportunity to digest some serious Revenue. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5476190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#10",
                    "likes": "0",
                    "time": "28/07/2021-06:28:33",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}