{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/fixed-rate-vaults-proposal-with-deco-protocol/9707",
            "title": "Fixed Rate Vaults Proposal With Deco Protocol ",
            "index": 9707,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "fixed-rate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#1",
                    "likes": "26",
                    "time": "05/08/2021-15:04:54",
                    "content": " Fixed Rate Vaults Proposal With Deco Protocol This post presents a proposal to bring a new revenue generating and user retention feature to MakerDAO: Fixed Rate Vaults. The Deco Protocol operates to decompose Yield-Bearing Assets into Fixed Rate and Yield Rate instruments providing a hedge against rate volatility for all yield bearing assets. We are putting up this post with the purpose of introducing you to the Deco Protocol and hope to gain your support for the implementation of an integration with Maker Protocol. We desire to take this project forward with the support of the Maker community and are preparing a proposal for a core unit to execute the integration and maintain it on behalf of MakerDAO. Using the Deco fixed rate protocol, Maker will be able to issue tokens that permit Vault owners to hedge their stability fee for a fixed duration and for a specific collateral type. This proposed Deco and Maker integration uses a market driven solution so that vault owners of all sizes can hedge stability fees for any desired duration. Integration of Deco will enhance rate stability, achieve a predictable and stable revenue flow for Maker, boost DAI supply, and enhance vault owner retention. The Deco protocol is ready for immediate integration.  Summary This proposed integration brings the following immediate benefits to the MakerDAO ecosystem:  Boost supply of DAI. Develop an immediate and reliable revenue stream for MakerDAO. Attract MakerDAO prospective users who may be intolerant of rate volatility. Provide a novel product for the Growth Core Unit. Enhance vault owner capital and operational efficiency. Improve vault owner retention and discourage vault migration. Introduce rate-predictability. Allow stability fees to be discovered by the market through auctions.   Proposal This proposal is for the creation of a new product for MakerDAO by the integration of the Deco Protocol:  Fixed Rate Vaults via Deco Protocol   Deco Protocol The Deco protocol is a fixed rate protocol designed to be flexible and safe. Its design anticipated that its first and most effective initial application may be on Maker. The core protocol is outlined in the whitepaper and in the technical documentation. Codebase repo of the base protocol implementation can be found on Github. The Deco protocol, in collaboration with MakerDAO, can offer fixed-rate vaults to Maker vault users. The Deco user experience is simple: vault owner purchases a pure-yield token which earns a yield that offsets the entire stability fee on the vault. A vault need not migrate to an external protocol, either before or after the fixed rate expires, which makes it possible for the Maker protocol to retain its core business and not lose stability fees. Vault owners are not required to change any of their own vault management processes; users may continue to use the same UI or smart contract to manage the vault. The vault itself remains fully independent, and within the Maker Protocol. Fixed rate token issuance on Deco is controlled and maintained by Maker governance, allowing MakerDAO to control the fixed rates without relying on external governance.  Problem: Rate Volatility and MakerDAO Stability fee volatility means vault owners are unable to accurately predict the future fees, which limits MakerDAO’s user base and in turn the DAI supply. Rate volatility constrains the market for Maker vaults by eliminating participants who require stable rates. At the same time, stability fee variance means Maker is unable to accurately predict its own cashflow. In a bear market, the inability to predict and depend on revenue and control cash may prove very problematic to the DAO. MakerDAO needs a method of retaining vault owners and expanding Dai supply, while also providing for a stable cash flow to support DAO operations. Deco is already developed and provides these features to Maker.  Solution: Deco Protocol Retains Vaults and Captures Revenue for MakerDAO Deco protocol decouples a yield bearing asset into a pure-yield and zero-yield component. Through an integration with the Maker protocol, Deco makes it possible for MakerDAO to issue a token that tracks the stability fee for a certain collateral type over a fixed duration, a FEE-CLAIM token. For the user to get a fixed rate on their vault, all they need to do is buy the FEE-CLAIM token and hold it. The token will accrue yield to offset the fees accrued by the stability fee for the fixed duration. Deco optimizes the Maker protocol and vault owner user experience. Vaults need not migrate to an external protocol before or after the fixed rate expires. Vault owners are not required to change any of their own vault management processes. The UI or smart contract already used to manage a vault may continue to be used. Even after the expiration of the fixed term token, vaults are left “as is.” Since the rate fix is performed outside of the vault infrastructure and contracts, vaults are never touched. This design is secure and means that the Maker protocol retains its core business even after the expiration of the fixed rate term. The vault itself remains fully independent and within the Maker Protocol.  High Level Integration Design The Deco protocol integration has been thoughtfully designed to work with Maker and allows the DAO complete control over its own fixed rate infrastructure, while mitigating any underlying risks which are inherent in other fixed rate protocols. Figure 1 below demonstrates how the integration functions.  deco-maker-final1920×1440 134 KB  Figure 1. Fixed Rate Vaults: Deco on MakerDAO The usage steps are as follows:  The vault owner purchases a token. Ex: 100,500 CLAIM-FEE-ETH-A tokens valid for three months to hedge the ETH-A vault with 100,500 DAI in debt for three months. The purchase price of a token is the total stability fee paid in advance. Ex: Vault owner pays 500 DAI to purchase these 100,500 CLAIM-FEE-ETH-A tokens, uses the 100,000 DAI in debt for their own purposes, which fixes their total vault debt at 100,500 DAI for the entire duration the CLAIM-FEE-ETH-A tokens are valid for irrespective of the changes to the ETH-A stability fee over this duration. The token earns yield during its validity period which equals the actual stability fee accruing on the vault. Ex: ETH-A stability fee increases to 50% APR at some point which increases the vault debt to 113,000 DAI. 100,500 CLAIM-FEE-ETH-A tokens would earn 12,500 DAI as yield over the same duration (equal to the stability fee accrued) which will pay down debt back to 100,500 DAI. The Vault owner can collect the yield on a token as many times as desired continuously paying back the accrued stability fee on the vault, and thus eliminating any additional interim exposure to a lower collateral ratio. Ex: Vault owner can collect Dai yield from the 100,500 CLAIM-FEE-ETH-A tokens as many times as one wishes to repay the additional debt being continuously added to the vault with the stability fee. Token balances are fungible and allow vault owners to hedge a portion of the debt by buying a lower number of tokens than the vault debt. Ex: Vault owner can choose to purchase only 50,000 CLAIM-FEE-ETH-A tokens to hedge a portion of the vault debt. Vault owners can also sell tokens on the market at any time. Ex: Vault owner can sell the 100,500 CLAIM-FEE-ETH-A tokens at any time at a price that is based on the latest stability fee outlook. Vault owners can also purchase new tokens to extend the hedge when the current tokens expire.  Please check our technical docs for more details about the components in this integration proposal.  Summary Fixed-rate protocols face liquidity issues. Liquidity requires that there must be buyers for both zero and claim tokens at the same time at the conclusion of the issuance process. By integrating with a collateral type, the need to find buyers for zero balances immediately has been removed. There is no need for symmetric demand; the DAO may issue claim tokens without needing to find a buyer for the zeros. The processes we have engineered permits the DAO to hold ZERO tokens temporarily or permanently, creating a seamless user experience for MakerDAO, while satisfying the demand for CLAIM-FEE tokens without constraint. ZERO-FEE tokens can also be unlocked from the adapter whenever required. The debt is automatically repaid on the maturity date; or, if an emergency shutdown is triggered, or if MakerDAO wishes to shut down the Deco instance for whatever reason, all obligations will be repaid. Auctioning Zeros may also help MakerDAO discover the yield curve for Dai and can use this information to set an appropriate DSR. The benefits of integration to vault owners and the MakerDAO, include:   Fixed Stability Fee: Once purchased, the token issued by Deco and MakerDAO will offset the stability fee with limit to any increase as there is no upper limit.  No Vault Management Changes: Vault owners do not have to make any changes to their vault ownership or management.  New Revenue Stream: This protocol provides a stable and predictable income stream in the form of fixed-rate risk premiums for MakerDAO and gives it the ability to upsell new products to the largest vault owners, and future RWA vaults which also tend to borrow at scale.  Vault Owner Retention: Vault owner stickiness is vastly improved, especially for the largest vaults, since the stability fees have been prepaid and locked into a fixed term.  Integration with Gnosis Auction Protocol V2: Discovery of rates permitting the performance of large sales competitively and transparently.  Compatible with Asymmetric Demand: There is no requirement to find buyers for Zeros or to be able to sell Claims.   Deco is the Safest, Most Flexible Fixed Rate Protocol. Deco is designed to avoid typical protocol risks by reducing the number of assumptions to a minimal level. For example, Deco’s core operations do not assume that yield protocols will always be solvent, or that redemptions will always succeed even when they are solvent. Deco is built on the premise that fixed-maturity asset lockups should quickly change when going through a phase of instability and may require yield token holders to redeem; Deco has a built-in mechanism to ensure that swift and early redemptions are possible. Deco works exactly to the specifications of the Maker protocol, and addresses edge cases in its design that may in time be forgotten at the institutional level. The Deco instance has been built and deployed so that it is controlled by MakerDAO governance, and thus removes the governance risk typically present in such external protocols. Deco is designed to use minimal smart contract infrastructure to issue a token that tracks the stability fee for a fixed term, and for a specific collateral type. It ensures that sensitive FEE tokens issued by MakerDAO are automatically removed from circulation at or by the maturity date, or in an emergency shutdown. Vault owners simply hold a token, enabling an offset of the stability fees. By keeping regular vaults virtually untouched throughout the process, we ensure liquidation infrastructure, and assure that service providers do not have to update their systems to deal with a special fixed-rate vault type. Deco does not add complication to the liquidation process, and makes the yield from FEE tokens collectable on-demand. Deco ensures that the collateralization ratios are not affected by stability fee accrual. Vault owners do not lose the excess stability fees they have paid upfront. If their vault is liquidated, CLAIM-FEE tokens are held separately and can be sold on the market at any time to collect the residual value.  Deco Supports Existing Users and Attracts New Supply Side Users Maker is currently missing out on a huge market of vault owners that would immediately sign up if they had a fixed rate. In the first half of 2018, there were stories about users confidently refinancing their home mortgages with Maker or purchasing cars when the rates were low and constant at 0.5% but these stories disappeared the moment stability fees became volatile, and even worse, it left users with a bad taste in their mouth. Maker may bring these users back with the promise of stable rates, the potential for this market segment could be four times the size of what we already have, considering the low percentages of collateral like ETH and BTC currently locked within Maker as collateral. Maker presently finds sufficient Dai demand but has concerns regarding growing Dai supply backed with debt. To help grow Dai supply, present market segments need to be expanded. Fixed Rates allow for more conservative users, or borrowers who need to better anticipate future rates. Fixed rates would offer a new feature that the growth core unit could use to expand existing Maker business lines. Recently, the protocol engineering team and the growth core unit have aptly highlighted market demand and provided a potential vault-oriented solution to fixed rates.  Fixed Rates Mean Fixed Revenue: Deco Affords Stability By using fixed rates, Maker stands to smooth out its revenue and achieve some predictability in its cash flow. Maker may now lock in vault owners and be able to reliably cover its fixed operating costs through the upfront sale of Fee tokens. The nature of a fixed rate premium suggests that Maker is receiving more than the current floating rate, which is to Maker’s advantage, in exchange for assuming the minor risk of future rate changes. If the future rate decreases, Maker stands to make even more revenue than it would have in the absence of the fixed rate instrument. However, if the rate goes up, such as in a bull market, Maker will lose the potential upside of the higher floating rate. However, considering current market conditions, losing a potential upside in a bull market is likely not the biggest concern. The cost benefit of possible loss of future gains is greatly outweighed by gaining a stable and predictable revenue stream, enhancing retention of vault owners, and opening new user markets. Deco on Maker allows Maker to hedge revenue under bear market conditions or a prolonged downturn. This feature should not be underrated as it provides a remedy to a serious potential problem for MakerDAO.  Deco Supports Parallel Smart Contract Development The SES core unit is focused on scaling internal operations for DAO sustainability. One of the current initiatives is to evaluate and promote systems which manage parallel contract development. Specifically, the Project Sandbox is seeking project candidates to perform smart contract development in parallel with the current Protocol Engineering Team. Our team, with deep knowledge of MakerDAO and our prior work with the foundation, is a perfect fit for this project.  Scalability: Transparency, Intention, and Trust Deco’s flexibility solves problems inherent in fixed rate protocols, i.e., solvency and market instability. The current goal is to support MakerDAO and solve or ameliorate rate volatility and supply-side issues for the DAO. For any DAO to scale effectively, it not only needs internal operational scalability, the core tenet of the SES core unit, but also to incentivize external actors to bring novel solutions to the DAO. It requires the capability to create a deal flow for product features and crowdsourced technical solutions. A Deco and Maker integration may be the first of its class and a unique structure, a feature acquisition by a DAO through integration with another protocol. This work is very much in line with the SES core unit mission statement and its long-term vision of building a sustainable and self-organizing ecosystem. We have discussed this project with @wouter, SES Team Lead, and have received very positive feedback.  Team Deco is led by Vamsi Alluri, principal protocol designer and smart contract programmer. Vamsi is a long time MakerDAO participant, was on the original MKR issuance block, and a previous member of the Maker Foundation Integration Engineering team as a Senior Integrations Engineer. He has assisted a wide group of external partner companies to integrate with the Maker suite of products. Deco is also substantively supported by former senior Maker operations team and unit members, as well as by Rohit Kapoor, designer, and product manager.  Links Website Github Blog Technical Docs Twitter We would like to receive your valuable feedback either here or on #speculation. You can also reach out to us at [email protected] with any questions. ",
                    "links": [
                        "https://deco.tech/whitepaper",
                        "https://docs.deco.tech",
                        "https://github.com/deco-protocol/deco-base",
                        "https://docs.deco.tech/#/integrations/maker-vaults",
                        "https://decrypt.co/5344/be-your-own-bank-with-makerdao",
                        "https://www.coindesk.com/a-loan-shark-situation-makerdao-is-leaving-crypto-borrowers-with-rising-bills-and-theyre-crying-foul",
                        "https://twitter.com/vamsiraju",
                        "https://deco.tech",
                        "https://github.com/deco-protocol",
                        "https://deco.tech/blog",
                        "https://docs.deco.tech",
                        "https://twitter.com/decoprotocol",
                        "https://forum.makerdao.com/t/mip39c2-sp23-adding-the-deco-fixed-rate-core-unit/10224/46",
                        "https://forum.makerdao.com/t/maker-relay-ep-58/9892",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-154-thursday-august-12-17-00-utc/9793/3",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-6th-12th/9823",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/build-your-makerdao-alm-model/18730/15",
                        "https://forum.makerdao.com/t/announcing-phoenix-labs-and-spark-protocol/19731",
                        "https://forum.makerdao.com/t/mip41c4-sp24-facilitator-onboarding-deco-fixed-rate-core-unit/10227",
                        "https://forum.makerdao.com/t/ama-fixed-rate-maker-vaults-with-pairwyse/10397",
                        "https://forum.makerdao.com/t/mip39c2-sp23-adding-the-deco-fixed-rate-core-unit/10224",
                        "https://forum.makerdao.com/t/paperimperium-delegate-platform/8992/7",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/48",
                        "https://forum.makerdao.com/t/maker-relay-ep-58-en-espanol/9949",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948"
                    ],
                    "GPT-summary": "The post presents a proposal for integrating the Deco Protocol with MakerDAO to create Fixed Rate Vaults. The proposal aims to provide a hedge against rate volatility for yield-bearing assets and enhance rate stability, revenue flow, and DAI supply for MakerDAO. The post explains the Deco Protocol, the problem of rate volatility, and the solution of the Deco Protocol. The post also outlines the benefits of the integration and the high-level integration design. The author invites feedback and collaboration on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.517311137600993
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "3",
                    "time": "05/08/2021-17:07:04",
                    "content": "How does your proposal compare with Yield Protocol, MIP 43? ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP43"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "1",
                    "time": "05/08/2021-22:15:22",
                    "content": "I am so excited to see so many fixed rate tools being developed! I’ll save my detailed questions until I’ve read another couple times. But one question I do have: Maker issues/sells yield-claim tokens? Or does Deco do the actual issuance? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#4",
                    "likes": "4",
                    "time": "06/08/2021-11:01:08",
                    "content": "This looks great, congratulations to everyone involved! One question:  The Vault owner can collect the yield on a token as many times as desired continuously paying back the accrued stability fee on the vault  This does mean that unless actively managed by a reliable operations team, fixed yield vaults can be liquidated despite claimfee tokens being available. This makes sense from the pov of not touching core maker infrastructure but is a small drawback for the user. This is fixable by going through any good “managed fixed rate vault” service but I’ll note for future reference that there may be a more smart contract based solution achieved by modifying vault behavior: add a callback before liquidation. The called contract uses locked claimfee tokens to repay outstanding debt. Then the liquidation proceeds if there is still bad debt. Callbacks would be authorized by Maker governance only for well-behaved contracts (contracts that don’t suddenly lose debt payback ability). This would be similar to B.Protocol managed vaults. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.62327694235589
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#5",
                    "likes": "1",
                    "time": "08/08/2021-00:57:06",
                    "content": "In the context of the proposed integration, Deco through the FEE token design essentially permits Maker itself to function as a fixed-term lending protocol. On the other hand, Yield is a fixed-rate lending protocol on its own. Everything I mention below is about the proposed TLM integration, and not a critique of the Yield Protocol. We think the TLM module proposed has risks for Maker, primarily because TLM is being tasked with linking two lending protocols, while Deco only brings deterministic smart contract behavior to Maker and does not deal with collateral or liquidation by itself. Emergency Shutdown Dai holders receiving fyDai during the redemption process must work with Yield, wait until borrowers pay back debt, most likely at the fixed-term loans maturation, to finish the redemption. This process is not instantaneous, and there would be exposure to interest rate fluctuation that would affect the price of fyDai which will result in additional loss. Deco allows Maker to close it and replace all Zeros locked as collateral in Maker with Dai in one transaction before triggering emergency shutdown. Even if emergency shutdown is triggered abruptly, Dai holders will be able to redeem the Zeros they receive during redemption for more Dai immediately. Deco’s close mechanism uses the Dai it holds through FEE tokens to replace all Zeros, irrespective of their maturity date. Yield not tokenized Yield protocol does not tokenize the yield component. CLAIM-FEE tokens are tokenized pure-yield and give Maker the option to sell them in a variety of ways. Revenue potential TLM allows Maker to get back some of the lost stability fee from migrated vaults by supplying liquidity, but it will be competing with other liquidity providers for a share. Deco allows Maker to collect the entire stability fee directly because the vaults never leave. Also, new vaults will be attracted by the fixed-rate feature. Zero collateral type within Maker Yield uses fyDai (zeros) as collateral and backs them with debt from its lending system. fyDai redemption is linked to borrowers purchasing Dai from the market to payback their debt which ties the process to market conditions. Deco backs Zeros directly with Dai that is already under its control and is ready to clear debt 1:1. Dai is not purchased from the market. User Experience TLM incentivizes Maker vault owners to migrate to Yield and access the fixed-rate feature. Even after migration, they have to roll-over their vault to a new maturity series periodically after the current one expires or migrate back to Maker when the regular stability fee becomes attractive again. They might not be able to migrate back if debt ceilings are hit in Maker. CLAIM-FEE tokens can be bought or sold in whatever quantities and maturities the vault owner wants without changing anything about their Maker vault and achieve the exact hedge. Collateral Types Not all collateral types that are in Maker will be available in Yield, especially RWAs, making it hard for those folks to access the fixed-rate feature, even if they are willing to migrate their vault. Scaling TLM must start at a low ceiling due to the external risks it brings. Deco does not deal with collateral, liquidations, oracles et cetera and consequently it would permit Maker to scale faster after its integration. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6885603135603136
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#6",
                    "likes": "2",
                    "time": "08/08/2021-00:57:59",
                    "content": "    PaperImperium:  Maker issues/sells yield-claim tokens? Or does Deco do the actual issuance?   MakerDAO would issue CLAIM-FEE tokens, and maybe even start an auction, with the executive spell. No other actor needs to be involved. The Deco smart contracts deployed for Maker will be fully governed by MakerDAO. We would assist MakerDAO with crafting relevant portions of the spell to achieve whatever issuance goals MakerDAO may have. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.845982142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#7",
                    "likes": "2",
                    "time": "08/08/2021-01:00:01",
                    "content": "We made a conscious trade-off because stability fee accrual is a slow drip. Percentage changes in the collateralization ratio would happen over the course of a year due to no debt rebalancing (1-5% APR) and happens regularly on an hourly basis anyway due to collateral price volatility. We assumed that vault owners would check-in frequently enough, even when they have DefiSaver enabled, that they should be able to manually collect yield from CLAIM-FEE tokens and rebalance easily and without hassle. Another reason for the trade-off was the one you mentioned, automated vault management systems are pretty good these days, and this is more of a cron job that just must be scheduled at an interval without incurring too much gas cost. Our end goal is for the user to not even realize that there is a CLAIM-FEE token in their wallet that needs to be managed in addition to the vault. We envision that vault management UIs will wrap vaults and the CLAIM-FEE together making it a very seamless user experience for fixed-rate vault owners who simply pick a duration, lock-in the stability fee, and manage it to avoid liquidation as usual. Another smart-contract based solution I have in mind is to incorporate a bounty for rebalancing since anyone can payback debt on a vault. We can setup a function within the Deco instance that directs CLAIM-FEE yield collection to a vault user sets up. Any address submitting a transaction to do the rebalancing, when the yield collected by CLAIM-FEE hits a threshold, gets paid a small bounty. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.551041666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#8",
                    "likes": "1",
                    "time": "08/08/2021-16:35:13",
                    "content": "The way the Deco protocol is built seems like a straightforward extension of the Maker protocol. How does your team expect to get paid? Do you plan to submit an application to become a DAO core unit? What is the next step toward incorporating Deco or activating Deco for Maker? What is the roadmap? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#9",
                    "likes": "6",
                    "time": "08/08/2021-21:13:42",
                    "content": "The first part of the Deco roadmap is to determine the level of community interest in the proposal and whether the community agrees with us that this is of significant value to MakerDAO. A specific compensation plan has not yet been finalized, but the objective is to make it performance based. Of course, if Deco does not receive an appropriate level of interest and acceptance by the community, presenting a compensation plan becomes pointless. If the community wishes to incorporate and activate Deco for Maker, we will then submit a finalized integration budget and timeline, a protocol maintenance budget, and a performance revenue sharing proposal. We are taking this process a step at a time and are open to suggestions on how we may become a DAO core unit. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "7",
                    "time": "08/08/2021-23:05:16",
                    "content": "What more encouragement do you need? Do you want Recognised Delegates to weigh in with comments? @PaperImperium @Planet_X @flipflopflapdelegate @monet-supply @twblack88 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "2",
                    "time": "08/08/2021-23:23:33",
                    "content": "I am generally in favor of what is presented here. My main hang up is with regard to whether this would attract unwanted attention as a security or if it can be structured such that it is clearly not one. But — with the caveat I prefer to read through things a couple times on different days — I like the functionality if I understand it correctly. So put me in the “I’d like to hear more” camp. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "0",
                    "time": "09/08/2021-03:10:20",
                    "content": "    vamsi:  Deco allows Maker to close it and replace all Zeros locked as collateral in Maker with Dai in one transaction before triggering emergency shutdown.   Have you “testnet” tested this scenario, or you’re assuming all the stars will be aligned if such a scenario plays out?     vamsi:  Yield protocol does not tokenize the yield component. CLAIM-FEE tokens are tokenized pure-yield and give Maker the option to sell them in a variety of ways.   To be fair—this is probably something @niemerg Yield can add.     vamsi:  TLM incentivizes Maker vault owners to migrate to Yield and access the fixed-rate feature. Even after migration, they have to roll-over their vault to a new maturity series periodically after the current one expires or migrate back to Maker when the regular stability fee becomes attractive again. They might not be able to migrate back if debt ceilings are hit in Maker.   Fair enough—but perhaps one day this can be automated.     vamsi:  Our end goal is for the user to not even realize that there is a CLAIM-FEE token in their wallet that needs to be managed in addition to the vault. We envision that vault management UIs will wrap vaults and the CLAIM-FEE together making it a very seamless user experience for fixed-rate vault owners who simply pick a duration, lock-in the stability fee, and manage it to avoid liquidation as usual.   This is super cool.      PaperImperium:  My main hang up is with regard to whether this would attract unwanted attention as a security or if it can be structured such that it is clearly not one.   Yup—that came across my mind—but I think this product is unique in the sense that I can’t identify it with any traditional product available today—but maybe I’m not thinking clearly   BTW, I wonder if products like this would have an effect on “investment interest expense” for Yankees like us? Meh, hard to tell since IRS can’t provide clear guidance… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.760803689064558
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "0",
                    "time": "09/08/2021-03:39:24",
                    "content": "@vamsi hey man—looking over the Deco docs, can you please explain the following, and how are timestamp kept accurate, or safe from being manipulated? “Within insert , governance is allowed to calculate the fraction value externally and directly insert it at a timestamo. It is up to developers to allow governance to overwrite existing frac values, insert values at future timestamps etc. Both are dangerous practives and should typically not be allowed.” ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.302083333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#14",
                    "likes": "4",
                    "time": "09/08/2021-08:05:48",
                    "content": "Would it be fair to say that, in your presentation, you basically make MakerDAO issue interest rate swaps? MakerDAO would be the counterparty as it doesn’t have collateral issues (as MakerDAO can print as much DAI as needed, no need to put collateral aside). While MakerDAO is good at that, no secondary market can (yet). Buyers need to pledge the full amount of future interests upfront. I understand those CLAIM-FEE-ETH-A would be quite complex to manage on a secondary market (as you will have many series, one for each call/minting?). Therefore it would be similar (but more flexible) to having term vaults on MakerDAO (like ETH-TERM-2022-08). At scale, it poses the interest rate risk that MakerDAO would face (which might or might not be an issue, it’s MakerDAO Governance to decide). It would prefer to start (or do ni parallel) with an ETH-TERM-2022-08 (maturity August 2022 where SF is raised to 100%), 100M DC, SF 3% (more precisely 3% origination fees and 0% SF) and see what happens. Fixed borrowing demand is currently a hypothesis, let’s find out if it is really there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.088235294117647
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#15",
                    "likes": "2",
                    "time": "09/08/2021-22:05:15",
                    "content": "    SebVentures:  Would it be fair to say that, in your presentation, you basically make MakerDAO issue interest rate swaps? MakerDAO would be the counterparty as it doesn’t have collateral issues (as MakerDAO can print as much DAI as needed, no need to put collateral aside).   I think this is the reason that Deco offers Maker a competitive advantage. Maker is uniquely positioned to take the opposite side of the swap more efficiently than any other potential counterparty. Even if there isn’t much demand for hedging with CLAIM-FEE tokens, I think Maker could gain a lot of information by regularly auctioning CLAIM-FEE tokens at various durations on major vaults like ETH to do price discovery on the yield curve. This could jump-start interest in hedging. Why should we only do custom deals with Institutional and Long Term Vaults Proposal when the origination fee could be a generic feature available to all? For CLAIM-FEE tokens, what would be a good initial maximum duration? 1 year? 2 years?     SebVentures:  I understand those CLAIM-FEE-ETH-A would be quite complex to manage on a secondary market (as you will have many series, one for each call/minting?).   Okay, maybe roll the proposal into MIP39c2-SPxx: Adding the StarkNet Engineering Core Unit (SECU) ? ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39c2-spxx-adding-the-starknet-engineering-core-unit-secu/9745",
                        "https://forum.makerdao.com/t/institutional-vaults-economics-terms/9989/2",
                        "https://forum.makerdao.com/t/institutional-and-long-term-vaults-proposal/9586/17"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.786931818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#16",
                    "likes": "1",
                    "time": "10/08/2021-00:13:03",
                    "content": "    PaperImperium:  My main hang up is with regard to whether this would attract unwanted attention as a security   The only thing Deco does is allow you to pay the security fee at a different time (now vs later). How could this make a difference about whether CLAIM-FEE tokens or vaults are a security? It’s just splitting existing vaults into two separate stand-alone products. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#17",
                    "likes": "0",
                    "time": "10/08/2021-01:09:51",
                    "content": "    psychonaut:  How could this make a difference about whether CLAIM-FEE tokens or vaults are a security?   If we offered it only to the vault user, perhaps? Unsure about what happens if there’s a secondary market. I like the gist of it. But we live in a treacherous neighborhood and just need to make sure we don’t antagonize anyone needlessly. I think there’s potential here and want to know more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.240259740259741
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#18",
                    "likes": "4",
                    "time": "11/08/2021-13:49:15",
                    "content": "So, sorry to be that guy but… I have like no experience in financial instruments beyond what I’ve picked up from crypto. I’d really appreciate it if you could help me understand better how this works. I think I understand the goal - provide users with fixed-rate vaults over a certain time period. I think I understand the benefits - open up a new market and mint more DAI (though I do wonder if that market is as large as everyone is hoping. I’d be astounded if we saw 3x the current ETH-A issuance as a result of this for example. Maybe I lack imagination.) What I don’t understand is the costs and the implementation. So for costs:  How do we ensure that fees are stable? Who pays the difference if fees rise? Who receives the difference if fees decrease? Does DAI remain fully-backed throughout this (given that we’re talking about using DAI minting to compensate for the lack of a counterparty)? What are the initial and on-going governance costs to this? (What does governance now need to worry about and manage with the addition of DECO?) What are the development and deployment costs to this? (What new vaults do we need, what new development needs to happen?)  For implementation:  I’m not even sure where to start here. I’m afraid the (very pretty) clarifying diagram was not terribly clarifying for me. I think the main issue I had with it was that I didn’t understand why each of the steps was being made? Like I understand the eventual goal, but not the breakdown of that goal into the steps communicated. How does this differ from us creating an ETH-D vault and pledging that the stability fee will not change for time t? And what is the benefit of this over that?   Maybe you can walk through what implementation looks like from our perspective (fill in the ???)  Governance decides it wants to implement DECO. ??? Profit (presumably.)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.691928685349738
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#19",
                    "likes": "1",
                    "time": "11/08/2021-16:00:36",
                    "content": "As somebody not affiliated with the Deco term, let me see whether I can answer your questions. Obviously @vamsi can correct me if I come to any wrong conclusions. I’ll update my reply in an hour. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#20",
                    "likes": "6",
                    "time": "11/08/2021-16:39:52",
                    "content": "    LongForWisdom:  How do we ensure that fees are stable? Who pays the difference if fees rise? Who receives the difference if fees decrease?   A CLAIM-FEE token is composed of a notional value and a duration. For example, suppose I draw 100 DAI from an ETH vault for two weeks and then pay it back. I am obliged to pay the stability fee during those two weeks while the loan is outstanding. If I buy a two week CLAIM-FEE token for the notional amount of 100 DAI then that CLAIM-FEE token will mint exactly the amount of DAI that I will need to repay the stability fee of my vault (regardless of changes to the stability fee by Maker governance).  notional value = 100 DAI duration = two weeks  However, the CLAIM-FEE token does not have to match the value and duration of my loan. If I hold my 100 DAI loan for more than two weeks, the CLAIM-FEE token will expire; I will be back to paying the floating stability fee out of my pocket, the stability fee which is a floating rate determined by governance. Or alternately, suppose I take out a 200 DAI loan instead of 100 DAI for two weeks. In this case, the CLAIM-FEE token will only pay for half of the stability fee. Now to answer your question. CLAIM-FEE tokens are purchased by vault owners and are sold by the Maker protocol. Once purchased, the CLAIM-FEE token mints DAI to pay the stability fee (whatever the current rate is) for the duration of its existence. If the stability fee increases after the CLAIM-FEE token is issued then the vault owner will save some money on the stability fee and Maker will collect less DAI then it would have had the CLAIM-FEE token not been purchased. If the stability fee decreases after the CLAIM-FEE token is issued then the vault owner overpaid and Maker will collect more DAI in fees then it would have otherwise. The other thing to keep in mind is that the fees are collected at a different time: with CLAIM-FEE tokens, the fees are collected by Maker when the CLAIM-FEE token is sold. In contrast, without the CLAIM-FEE token, stability fees are collected continuously by the Maker protocol.     LongForWisdom:  Does DAI remain fully-backed throughout this (given that we’re talking about using DAI minting to compensate for the lack of a counterparty)?   The worse possible situation for the Maker protocol is to sell long duration, high notional CLAIM-FEE tokens cheap while the stability fee is zero and then for governance to aggressively raise the stability fee very high. Suppose the stability fee is raised to 20%. In this case, fortunate vault owners who purchased CLAIM-FEE tokens will not be affected by the new, much higher stability fee until the CLAIM-FEE tokens expire. So DAI remains fully backed, but Maker is not able to change the price of risk on these vaults until the CLAIM-FEE tokens expire. Presumably we moved from a low-risk environment to a high-risk environment. The CLAIM-FEE tokens delay the change in fees.     LongForWisdom:  What are the initial and on-going governance costs to this?   Although it may seem like it would be hard to manage hundreds of CLAIM-FEE tokens with different durations and notional values, they are all priced the same way. There is some mathematical formula that takes CLAIM-FEE token parameters and the stability fee, and outputs price. Another ingredient to this formula is some measure of expected stability fee volatility. Governance can look at the total duration and notional value of issued CLAIM-FEE tokens to understand how much inertia exists in anticipation of changing the stability fee. If all outstanding DAI loans are 100% covered by CLAIM-FEE tokens for the next two years then stability fees have been effectively fixed for two years. Governance can change the stability fee, but it will not have any effect on loans covered by CLAIM-FEE tokens.     LongForWisdom:  How does this differ from us creating an ETH-D vault and pledging that the stability fee will not change for time t?   It is the same, but how do you choose time t? With CLAIM-FEE tokens, any arbitrary duration can be selected by the buyer. As CLAIM-FEE tokens are issued, every one will have a different duration. I don’t really see how to offer this kind of duration flexibility via a regular vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.406795454545454
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#21",
                    "likes": "3",
                    "time": "11/08/2021-16:46:59",
                    "content": "    flipflopflapdelegate:  Have you “testnet” tested this scenario, or you’re assuming all the stars will be aligned if such a scenario plays out?   Thanks for this question: no assumptions are being made regarding star alignment. Please note the next sentence, which describes how the design that handles any abrupt emergency shutdown when there is an untoward event. This is an additional feature to improve the MakerDAO UX and ensure that Dai holders do not have to think about new assets like fyDai or CLAIM-FEE tokens when going through the redemption process. You can find the tests for the close feature which this relies upon in the codebase. deco-base/close.ts at master · deco-protocol/deco-base · GitHub In the past, I have written specifically about emergency shutdown and how integration partners can mitigate losses for their users by using the right patterns. developerguides/emergency-shutdown-design-patterns.md at master · makerdao/developerguides · GitHub     flipflopflapdelegate:  ooking over the Deco docs, can you please explain the following, and how are timestamp kept accurate, or safe from being manipulated?   There is a fully trustless function called snapshot to capture yield values for the current timestamp directly from the smart contracts and then referenced later. Timestamp is a block timestamp and cannot be manipulated. Yield value comes from the FEE token directly. The instructions are written for integration developers to remind them of the tradeoffs they make with certain choices: insert is an optional function which we ask them to keep in mind and implement to allow governance (MakerDAO in this case) to insert yield values, and also to give guardrails to developers to be placed during the implementation design phase in order to restrict what governance can or cannot do. The snapshot function is its trustless equivalent, where the yield values are captured directly from the FEE token. The whitepaper goes in-depth on why implementing only the trustless function is not always safe for users. We will work with MakerDAO and decide which one to implement based on the requirements gathered.     SebVentures:  Buyers need to pledge the full amount of future interests upfront.   Their effective collateralization ratio will have to be maintained a bit higher due to the upfront cost. I don’t think it is an issue specific to Deco though, as it will be the same when vault owners use an up-front origination fee solution as well. Any fixed-rate solution that does not collect the fees upfront for the term risks the vault owner halting their payments mid-way.     SebVentures:  I understand those CLAIM-FEE-ETH-A would be quite complex to manage on a secondary market (as you will have many series, one for each call/minting?).   The timestamp when minting occurs does not automatically become the issuance timestamp. Thanks to this design, there is no fragmentation or creation of a new series automatically for each minting. MakerDAO is able to mint more to satisfy new demand for an existing standard series in the market. The number of series in the market will be determined by business goals and requirements. The technical implementation is already designed to avoid fragmentation and align on standard issuances.     SebVentures:  Therefore it would be similar (but more flexible) to having term vaults on MakerDAO (like ETH-TERM-2022-08).   One big complaint against Maker vs Compound or Aave is market rate discoverability; this design achieves this feature through a sales process.     SebVentures:  It would prefer to start (or do ni parallel) with an ETH-TERM-2022-08 (maturity August 2022 where SF is raised to 100%), 100M DC, SF 3% (more precisely 3% origination fees and 0% SF) and see what happens. Fixed borrowing demand is currently a hypothesis, let’s find out if it is really there.   The smart contracts that need to be developed to charge 3% origination fees are going to be a bit complex as well considering Vat cannot be upgraded and all solutions are similarly bolted on. We’ve designed Deco to achieve a superior UX solution for vault owners. With these goals in mind, we hope that when we move to evaluate market demand and fixed rate appetite we are not confounding user experience, third party protocol risks, and market demand. Some other confounding factors we have attempted to control for are MakerDAO setting a suboptimal right fixed-rate and reducing demand, or only evaluating market demand from large vaults and accidentally omitting the smaller vault market segment.     psychonaut:  For CLAIM-FEE tokens, what would be a good initial maximum duration? 1 year? 2 years?   Considering crypto markets, and the need to pay stability fees upfront, our current suggestion would be to start with a 6-month maximum.     psychonaut:  Okay, maybe roll the proposal into MIP39c2-SPxx: Adding the StarkNet Engineering Core Unit (SECU)  ?   Assuming you mentioned L2 to improve UX, we describe above how Deco does not fragment issuances beyond what the market desires and create a UX problem that requires vault owners to do a ton of transactions. ",
                    "links": [
                        "https://github.com/makerdao/developerguides/blob/master/mcd/emergency-shutdown-design-patterns/emergency-shutdown-design-patterns.md",
                        "https://forum.makerdao.com/t/mip39c2-spxx-adding-the-starknet-engineering-core-unit-secu/9745"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.672864245129871
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#22",
                    "likes": "3",
                    "time": "11/08/2021-17:03:11",
                    "content": "In order for an RWA issuer to have proper ROI on their investment in the Equity/Junior/Subordinate tranche - they cannot pay extra for additional contracts. This makes the “I” in ROI proportionally bigger and hence the “R” proportionally smaller. This effect is amplified with the duration of the contract. It messes with the “gearing.” In an ideal solution the RWA issuer would rehypothecate their Vault collateral and use that to pay for any additional hedges. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8999999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#23",
                    "likes": "0",
                    "time": "11/08/2021-21:54:11",
                    "content": "    Akiva:  In order for an RWA issuer to have proper ROI on their investment in the Equity/Junior/Subordinate tranche - they cannot pay extra for additional contracts. This makes the “I” in ROI proportionally bigger and hence the “R” proportionally smaller. This effect is amplified with the duration of the contract. It messes with the “gearing.”   It would be easy to structure this within the sales process by giving additional CLAIM-FEE tokens to the vault owner to cover all additional stability fees they would accrue on their additional I. Maker and RWA issuer can use a structure like this in their shared definition of ROI. You should note that vault owner is allowed collect yield from CLAIM-FEE tokens multiple times before maturity date and can rebalance periodically pushing their total debt back to the fixed debt amount which means their I will stay constant for the duration as defined upfront. There is no effect, which means there is no amplification of it either across any duration. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.266666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#24",
                    "likes": "5",
                    "time": "11/08/2021-22:10:18",
                    "content": "@psychonaut was spot on in his reply. I’ll add some more context to his answer.     LongForWisdom:   Does DAI remain fully-backed throughout this (given that we’re talking about using DAI minting to compensate for the lack of a counterparty)?    Dai remains fully backed throughout. ZERO-FEE tokens are locked as collateral and back the Dai debt. These ZERO-FEE tokens themself are fully backed 1:1 with Dai, and which are always present within the system and used to cancel the debt once ZERO-FEE tokens mature. Additionally, we have an emergency-shutdown mechanism which can trigger debt cancellation immediately, irrespective of the maturity date, if emergency-shutdown in Maker is triggered.     LongForWisdom:   What are the initial and on-going governance costs to this? (What does governance now need to worry about and manage with the addition of DECO?)    The initial step is to setup the ZERO-A collateral type and adapter so that can create CLAIM-FEE tokens for all collateral types. One Deco instance, and FEE token, needs to be deployed for each collateral type MakerDAO wishes to introduce at a fixed rate. Unlike other fixed-rate protocols, Deco is built to handle all maturity dates from one deployment. This design effectively reduces the work needed for MakerDAO. There is no longer a need to deploy these contracts every month or every three months for each collateral type due to maturity dates. No on-going smart contract deployments are required beyond those noted above and weekly or monthly CLAIM-FEE issuance will be executed using this infrastructure through spells to meet the business goals of fixed-rate sales. Deco’s will handle the settlement and remove the tokens issued from circulation, as well as the debt in the ZERO-A collateral type, after maturity, without the involvement of governance using public functions anyone can execute.     LongForWisdom:   What are the development and deployment costs to this? (What new vaults do we need, what new development needs to happen?)    ZERO-A adapter contract and FEE token development are Maker specific and the cost of development would be borne by MakerDAO as part of this integration. We have incurred the cost of Deco development and the design cost of a Maker integration. If the project is approved, there will be the cost of integration and deployment of the Deco Protocol on Maker.     LongForWisdom:   I’m not even sure where to start here. I’m afraid the (very pretty) clarifying diagram was not terribly clarifying for me. I think the main issue I had with it was that I didn’t understand why each of the steps was being made? Like I understand the eventual goal, but not the breakdown of that goal into the steps communicated.    The goal is to have a free-standing token like CLAIM-FEE which vault owners can independently use to off-set the fee changes that would happen on a normal vault. In Step 1, we are creating the tokens (CLAIM-FEE) which are used to track the stability fee for a collateral type and a fixed duration. In step 2, these tokens are sold to vault owners who pay an upfront cost for the privilege of purchasing these tokens. In step 3, the vault owners hold the tokens; if the stability fee changes, Dai flow through the claim token changes in turn, effectively providing a stable fee.  The vault owners fee is fixed at the upfront cost paid to purchase the token and holding the token offsets any additional stability fee accrual.     LongForWisdom:   How does this differ from us creating an ETH-D vault and pledging that the stability fee will not change for time t? And what is the benefit of this over that?    There is no way to incorporate a maturity date within ETH-D. So, Maker would have to maintain multiple ETH-D collateral types, e.g., ETH-D-SEP21, ETH-D-DEC21, at the bare minimum, unless the complexity of managing maturity dates is forced outside to a Deco-like solution. Deco is built to attach maturity dates to assets, and consequently allows the same ETH-A vault to target any maturity date. MakerDAO has to update the stability fees after the maturation date to match the ETH-A stability fee. But Maker governance cannot force debt payoff right after a maturity date and move the vault owner back to the main ETH-A vault. Maker governance can threaten with a large stability fee increase and perhaps force the vault owner to move, but the process is not deterministic. We can already see this issue in the amount of debt Maker is forced to hold on to for long periods despite setting the debt ceilings to 0. If an origination fee is not collected upfront, the vault owner will use it only when the fixed-rate is favorable and has a free option to move during the fixed-term. There is no way to lock-in an ETH-D-XXX vault owner for a fixed term without requiring payment of an origination fee; otherwise, Maker would risk a re-financing as soon as rates drop below the agreed upon fixed-rate. Additionally, Maker has no way of imposing a penalty fee.  Selling CLAIM-FEE tokens at the market rate forces vault owners to book a loss or gain, and to be exposed to market conditions should they wish to exit the fixed-term early. Handling these issues may require some additional development or maintenance, but certainly cannot be accomplished by simply creating an ETH-D type and attaching a pledge from governance.     LongForWisdom:  Maybe you can walk through what implementation looks like from our perspective (fill in the ???)  Governance decides it wants to implement DECO. ??? Profit (presumably.)    At a high level the missing step is, Maker gives Deco an implementation budget to develop the additional adapter and fee token contract required for the integration. Deco sets up a core unit to operate this feature on behalf of MakerDAO and receives a share of the fixed-rate revenue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.491450216450216
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#25",
                    "likes": "1",
                    "time": "17/08/2021-18:38:22",
                    "content": "    psychonaut:  Now to answer your question. CLAIM-FEE tokens are purchased by vault owners and are sold by the Maker protocol   I am still trying to digest this but it looks like what is being proposed here is a prepaid Maker SF vault fee token.    Basically the user purchases this token by paying up front the DAI in SF over the period of concern at the instantaneous SF rate.   Not understanding the mechanics but intent is that once this token is purchased it basically has a price decay like an option which will either expire in or out of the money so to speak.   This looks to me like a separate product that costs the borrower extra up front, that doesn’t do anything to stifle the SF fees accumulated in the vault.   At some point it is expected this token product would be redeemed within a market based on the difference in fees. Here is what is not clear to me.   If rates drop basically the fund that accumulated the extra SF fees will be in surplus relative to the markets.   Basically the fund for a particular note can only redeem for some fraction < 1 of the purchase value because the rate par value has dropped.    The opposite is true if the SF increased.   The fund basically will not have the funds to cover redemptions, or someone taking the opposite side of the interest rate bet on these token instruments will have to cough up DAI.   In turn the holders of these notes will have to redeem to get their DAI and then they can pay down their loans. My biggest problem with these is going to be the extra gas and transaction costs they will incur.   1 month worth of interest at even 5% on 1M is going to be about 4170 DAI.   If this rate difference is 1% this drops to like 800 DAI.   I don’t see who is going to be the counter party to these at institutional level investing, Maker protocol itself?    My problem here is that the only clean way to do this is to segregate the DAI from these instruments from the surplus generally.  I also have a significant concern that if Maker needs to move on rates against these contracts it will effectively tie hands of governance in a lose if you do, lose if you don’t scenario. SInce these notes are not going to pay SF, and basically act independently of the protocol as a kind of interest rate spread insurance instrument prepaid in DAI, paying out in DAI at term why does this have to be tied into the protocol at all?  Why not do this independently of the protocol using a completely independant bond fund?   Use this spread to earn return.   My point here is that using the DAI SF over the term up front isn’t enough of a risk premium.  Normally such instruments are going to collect a premium on top of what they know has to be paid and I see no mechanism for pricing this ‘at all’.   This is a cost free interest rate risk spread as it is structured and so can only yield returns for the backers if rates are going to drop.  Even if rates stay the same - there are no gains to the counterparties to these notes. I don’t see the benefit here and I also don’t like Maker basically being the counterparty in this fashion because governance will not be free to move rates without possible loss or gain implications on these instruments.    Loosely speaking if the protocol sells these governance has a strong conflict of interest that regulators would surely ‘look into’ if the holders of these instruments lost money. I am not even sure this can be structured not to come under scrutiny as a security honestly. I want to remain open to these and really need to spend some time looking at this, but just logically thinking about this I don’t see how the protocol can take this on without having significant conflict of interest. Honestly going to have to read more carefully the above, but not seeing any mechanism for fee management above and beyond the SF due to be paid over the period I don’t see how these can work at all.  Maker as the counter party on these entails conflict of interest as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.839909781576448
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#26",
                    "likes": "2",
                    "time": "17/08/2021-20:16:48",
                    "content": "    MakerMan:  Here is what is not clear to me. If rates drop basically the fund that accumulated the extra SF fees will be in surplus relative to the markets. Basically the fund for a particular note can only redeem for some fraction < 1 of the purchase value because the rate par value has dropped. The opposite is true if the SF increased. The fund basically will not have the funds to cover redemptions, or someone taking the opposite side of the interest rate bet on these token instruments will have to cough up DAI. In turn the holders of these notes will have to redeem to get their DAI and then they can pay down their loans.   If you had bothered to study the proposal then you would know that Maker is the counterparty. Since Maker is the counterparty, DAI can be minted to cover redemption and any surplus would be added to the surplus buffer.     MakerMan:  I don’t see who is going to be the counter party to these at institutional level investing, Maker protocol itself?   Yes. That’s why Maker is uniquely positioned to implement this protocol in a more gas efficient way than a 3rd party.     MakerMan:  I don’t see the benefit here and I also don’t like Maker basically being the counterparty in this fashion because governance will not be free to move rates without possible loss or gain implications on these instruments. Loosely speaking if the protocol sells these governance has a strong conflict of interest that regulators would surely ‘look into’ if the holders of these instruments lost money.   I don’t follow you here. Maker has to price the risk environment anyway. How does adding floating-to-fixed tokens pose any additional conflict of interest? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.718388637506284
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#27",
                    "likes": "1",
                    "time": "17/08/2021-22:59:51",
                    "content": "    psychonaut:  If you had bothered to study the proposal then you would know that Maker is the counterparty. Since Maker is the counterparty, DAI can be minted to cover redemption and any surplus would be added to the surplus buffer.   Apologies for not digging deeper was just trying to deal with this from what was posted here vs. a document deep dive. Yeah I guess that is what is required here given the complexity of this.   Actual many hours worth of study to digest some basic issues.    The basics of how this is might even look from a vault users perspective.   What funds go where, and when?    What market is being talked about.   My problem here is the deco documentation is trying to be general, and even the specific Maker example in the proposal post talks about 100,500 DAI and has a figure showing 12,500 DAI and even then things about the numbers don’t match.  This alone stopped me from trying the ‘whitepaper’. Can we simplify this somewhat. If there are markets please explain who is the buyer and seller of what?   My problem here if these CLAIM-FEE-ETH-A tokens can hit any market is the expectation of return, this by definition would make them a security. If the markets are internal and have basically fixed prices based on the difference between the instantaneous SF from the purchased - locked SF within a ‘period’ of time covered by the instrument then there isn’t a market but simply a price. Here is my problem with this.   Lets say these CLAIM-FEE-ETH-A tokens are just an internal accounting mechanism, there is only one market which basically works as follows.  Maker vault protocol sells or buys these from Maker vault owners protocol to person.   A vault owner can purchase them or sell them back to the protocol (or make claims for DAI based on return).   In effect these become a rate modulation instrument between Maker and the Vault owner.   The mechanics of this while relevant are irrelevant because there is no market.   What is entirely unclear to me is how the DAI mechanics work on this vault if these options are a just an internal accounting mechanism for the SF lock - SF floating rate * time. Take the example with the 100,500 DAI outstanding debt, 500DAI that went Where? and 100,000 DAI that the user has borrowed and the 100,500 CLAIM-FEE-ETH-A that are ‘Where’?   Now the vault owner has 100,500 DAI borrowed not 100,000 so the interest will be 502.5 not 500 over the period of interest which didn’t jive for me.  Other points/questions So 500 DAI is the interest on 100,000 over 3 months (SF 2%).   For simplicity lets say the SF rate instantly jumps to 6% once this option is released and purchased.   Will the vault DAI debt after 3 months be 100,500?  or will it be more like 101,500 and the vault holder will basically have an option worth 1500 DAI they can redeem, or will this look like something else. If the 101,500 is the number (and not something else) where does the 1000 DAI come from and when does it move where? Another question - what happens if the vault owner decides to pay back the debt after 1 month and the SF is still 2%?  Do they then get to sell/redeem the options to get their 333.33333… DAI back or what? My problems with reading this is that the numbers just don’t match.  Is the borrow 100,500 or 100,000.   When does any surplus or deficit in these ‘interest rate options’ get paid, to/from where? Regarding conflict of interest here.  I really had to rethink this because no matter how one looks at this - some interest is being paid by vault owners.   The issue becomes how much.   Invariably there will be this temptation by governance (rightly so btw) when considering rate changes to vaults to have to consider how much money will be made or lost with these options based on SF changes.   This may potentially affect how governance sets rates to the favor of generating returns over risk management to the detriment of DAI holders potentially.  Not saying this is true but it could complicate this.  Is it a conflict of interest, maybe not… Edge case in point. Why would the protocol sell these options at 0%?   Why WOULDN’T it sell these options at 20%.   Now a vault owner if they can get these options for 0 cost at 0% - why wouldn’t they buy all they could for free?    And at 20% why would a vault owner in their right mind buy them?   The conflict of interest here is in the sense of issuance management and using this structure to generate additional return from vault owners by basically selling lots at high rates (whatever that is) and selling none at low rates. Scratches head here.   At this point I am just not seeing how this is good for the protocol and not something that is done by a 3rd party on a cheaper network.   My problem here is if interest rates are 0 basically the fees to buy these would have to represent the risk of SF being increased to some level over the time frame of interest.   Same issue would occur when rates are high the fees to purchase these would likely be low   I don’t see the pricing mechanism for this SF rate change risk at all in the pricing mechanisms.   If there is a real market pricing these, well then I am back to them being potentially a security because they promise a kind of return even if it is paying less interest which based on the above is entirely unclear to me.   Are these things options that redeem DAI that is used to pay down DAI debt, or are they options used to reduce DAI debt.? Thanks again and my apologies I literally don’t have days to dig through this.  It already looks complicated enough to cause me to pause…   The implications for smart contracts changes, and implications to SF management seems really complicated and I don’t see the protocol getting more income but less for the most part implying a higher risk profile at key times. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.503544525154695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#28",
                    "likes": "1",
                    "time": "18/08/2021-06:52:42",
                    "content": "@vamsi  I started reading but found the text hard to follow. You start with the terms “fixed rate” and “yield rate”.  Fixed rate’ is defined and understandable, but “yield rate” is here used in contradiction to the normal meaning. I assume that you mean “variable rate” or something along those lines? Further down in the text “fixed rate” and “yield-rate” were replaced by “pure-yield” and “zero-yield”, but I found no definitions or explanations of these terms. In light of “pure-yield” being a term that Google could not help me with, I think this might need clarification. Also, the words “yield” and “rate” appear used in a way that mixes up the two, but they mean different things. Where will the FEE-CLAIM tokens be traded? How many different versions of this token will there be? Reading the first pages of the whitepaper did not assist my attempts to climb the learning curve. This is most likely due to my limited ability to understand new things, but you might want to take a look at that document as well. ",
                    "links": [
                        "https://www.investopedia.com/ask/answers/09/difference-between-yields-and-interest-rate.asp#:~:text=Yield%20refers%20to%20the%20return,reported%20as%20an%20annual%20figure.&text=If%20the%20stock%20price%20doubles,to%2Dmaturity%20(YTM).",
                        "https://www.investopedia.com/ask/answers/09/difference-between-yields-and-interest-rate.asp",
                        "https://uploads-ssl.webflow.com/60f36d3a3ee90b586e386a7f/610bc04e94ae4c62447fbbde_deco-protocol-whitepaper.pdf"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.225797894915542
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#29",
                    "likes": "4",
                    "time": "20/08/2021-22:31:55",
                    "content": "    MakerMan:  I am still trying to digest this but it looks like what is being proposed here is a prepaid Maker SF vault fee token. Basically the user purchases this token by paying up front the DAI in SF over the period of concern at the instantaneous SF rate. Not understanding the mechanics but intent is that once this token is purchased it basically has a price decay like an option which will either expire in or out of the money so to speak. This looks to me like a separate product that costs the borrower extra up front, that doesn’t do anything to stifle the SF fees accumulated in the vault. At some point it is expected this token product would be redeemed within a market based on the difference in fees.   Many of the assumptions you have made, e.g., the difference calculation, possibility of going OTM, price decay, are not applicable to Deco and the proposed technical solution. This is a novel and disruptive product and as such, reaching clarity in understanding the technical solution can be challenging. Consequently, we intend to hold a launch pod session to review the technical solution and its implications.  We would be pleased to have you join us. We will also be recording the session and it will be available for later viewing. In short, the CLAIM-FEE token purchaser is not purchasing an option, nor is the purchaser exercising an option at any point before the maturity date. The purchaser will always collect the yield received from the CLAIM-FEE token. The purchaser will not be OTM before expiry if the difference in rates is lower than the locked-in fixed rate.  No Difference Calculation is being performed either within Maker or within Deco.     MakerMan:  Here is what is not clear to me. If rates drop basically the fund that accumulated the extra SF fees will be in surplus relative to the markets. Basically the fund for a particular note can only redeem for some fraction < 1 of the purchase value because the rate par value has dropped. The opposite is true if the SF increased. The fund basically will not have the funds to cover redemptions, or someone taking the opposite side of the interest rate bet on these token instruments will have to cough up DAI. In turn the holders of these notes will have to redeem to get their DAI and then they can pay down their loans.   There is not a solvency issue because Deco is not independent of the Maker protocol. In this proposal the Maker protocol is the exclusive issuer (no one else is authorized to issue), giving Maker certain advantages: locking in a fixed-rate to smooth out revenue instability, selling a pure-yield instrument to discover market rates/yield curve, and expanding the partnership with vault owners by offering them fixed-rates so that they stay within Maker, et cetera. Deco is helping Maker become a fixed-rate lending protocol like Yield or Notional protocols. This proposed iteration of Deco is specifically designed for Maker. Maker will never be at risk of not having funds available: stability fees are accruing debt for the system at the same rate as the token is accruing Dai. It is simply a token the Vault owner holds that provides and offsets the vault debt, provided they hold the appropriate quantity and proper class for the vault collateral type.     MakerMan:  My biggest problem with these is going to be the extra gas and transaction costs they will incur. 1 month worth of interest at even 5% on 1M is going to be about 4170 DAI. If this rate difference is 1% this drops to like 800 DAI. I don’t see who is going to be the counter party to these at institutional level investing, Maker protocol itself? My problem here is that the only clean way to do this is to segregate the DAI from these instruments from the surplus generally. I also have a significant concern that if Maker needs to move on rates against these contracts it will effectively tie hands of governance in a lose if you do, lose if you don’t scenario.   Please see previous response. MakerDAO is the counterparty the same as it is with vault owners right now, nothing new. Maker stability fee revenue would come from two buckets of debt- variable-rate stability fee vault debt, and fixed-rate stability fee vault debt. Adjusting the variable rate stability fee higher or lower on all debt does not pass any losses(or gains) from the fixed-rate revenue bucket from past issuances to variable-rate revenue bucket.     MakerMan:  SInce these notes are not going to pay SF, and basically act independently of the protocol as a kind of interest rate spread insurance instrument prepaid in DAI, paying out in DAI at term why does this have to be tied into the protocol at all? Why not do this independently of the protocol using a completely independant bond fund? Use this spread to earn return. My point here is that using the DAI SF over the term up front isn’t enough of a risk premium. Normally such instruments are going to collect a premium on top of what they know has to be paid and I see no mechanism for pricing this ‘at all’. This is a cost free interest rate risk spread as it is structured and so can only yield returns for the backers if rates are going to drop. Even if rates stay the same - there are no gains to the counterparties to these notes.   Yes, there will have to be a premium, just like in the real world, and Deco would not limit Maker from collecting it. We see a stability fee and rate premium also suggested by PE, Growth, and Risk in the institutional vault proposal. Deco would be no different in that regard, except that it enables market driven pricing, if desired. For the first time MakerDAO will not have to set rates by itself. Maker may use sale mechanisms like auctions to discover market rates, while setting a limit order for the floor fixed rate that starts with a premium to ensure an appropriate exchange of value.     MakerMan:  I don’t see the benefit here and I also don’t like Maker basically being the counterparty in this fashion because governance will not be free to move rates without possible loss or gain implications on these instruments. Loosely speaking if the protocol sells these governance has a strong conflict of interest that regulators would surely ‘look into’ if the holders of these instruments lost money.   Rate volatility protection, in exchange for a fixed payment, is the promise of a CLAIM-FEE token.     MakerMan:  Take the example with the 100,500 DAI outstanding debt, 500DAI that went Where? and 100,000 DAI that the user has borrowed and the 100,500 CLAIM-FEE-ETH-A that are ‘Where’? Now the vault owner has 100,500 DAI borrowed not 100,000 so the interest will be 502.5 not 500 over the period of interest which didn’t jive for me. Other points/questions   100,000 DAI = the current vault debt. 500 DAI = new debt they take on and use to purchase 100,500 CLAIM-FEE tokens. 100,500 CLAIM-FEE tokens will be in the vault owners’ ethereum wallet. Any variable stability fee applied on the vault which now has 100,500 DAI in debt is offset by the yield from 100,500 CLAIM-FEE tokens. Both vault debt in dai and CLAIM-FEE yield in dai compound at the same rate. When the variable rate is high and the additional debt on the vault starts to affect the collateralization ratio, vault owner is allowed to collect yield from Deco to payback debt and set the notional amounts of both back to 100,500 Dai, from where they start compounding at the same rate again. You raise a good point and we’ll verify that this works as intended for vault owners with more realistic numbers in a blog post shortly.     MakerMan:  100,500? or will it be more like 101,500 and the vault holder will basically have an option worth 1500 DAI they can redeem, or will this look like something else.   No, it is not an option. There is only one action available after purchase until maturity: “collect yield”.     MakerMan:  Thanks again and my apologies I literally don’t have days to dig through this. It already looks complicated enough to cause me to pause… The implications for smart contracts changes, and implications to SF management seems really complicated and I don’t see the protocol getting more income but less for the most part implying a higher risk profile at key times.   No worries, we will have a presentation shortly!     Planet_X:  You start with the terms “fixed rate” and “yield rate”. Fixed rate’ is defined and understandable, but “yield rate” is here used in contradiction to the normal meaning. I assume that you mean “variable rate” or something along those lines?   Yield Rate is a typo in the title, it was supposed to be “Pure Yield” and we’ll fix that. We do not use the word yield rate anywhere else in the whitepaper.     Planet_X:  Further down in the text “fixed rate” and “yield-rate” were replaced by “pure-yield” and “zero-yield”, but I found no definitions or explanations of these terms.   They were defined in the glossary within the whitepaper and we are happy to expand the definitions. We have to use a new word “pure-yield” because it best describes CLAIM-FEE tokens which do not have a comparable term outside of DeFi.     Planet_X:  Also, the words “yield” and “rate” appear used in a way that mixes up the two, but they mean different things.   Would you be able to point out an example? We understand the difference and will take a pass again on the whitepaper to make sure any errors are corrected.     Planet_X:  Reading the first pages of the whitepaper did not assist my attempts to climb the learning curve. This is most likely due to my limited ability to understand new things, but you might want to take a look at that document as well.   It would be helpful if you let us know which parts, and we’d love to write a blog post and give those topics additional clarity. This is a challenging topic and we attempted to write the paper for multiple audiences, including financial and crypto amateurs, of course that presents its own challenge. ",
                    "links": [
                        "https://www.investopedia.com/ask/answers/09/difference-between-yields-and-interest-rate.asp#:~:text=Yield%20refers%20to%20the%20return,reported%20as%20an%20annual%20figure.&text=If%20the%20stock%20price%20doubles,to%2Dmaturity%20(YTM).",
                        "https://www.investopedia.com/ask/answers/09/difference-between-yields-and-interest-rate.asp",
                        "https://uploads-ssl.webflow.com/60f36d3a3ee90b586e386a7f/610bc04e94ae4c62447fbbde_deco-protocol-whitepaper.pdf"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.784925754322305
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#30",
                    "likes": "1",
                    "time": "21/08/2021-02:57:50",
                    "content": "    vamsi:  Considering crypto markets, and the need to pay stability fees upfront, our current suggestion would be to start with a 6-month maximum.   Would it be possible to consider a lesser maturity—perhaps 4-weeks? My guess is that shorter maturities can provide an upside for both Maker & the borrower—depending on the movement of the SF. Also—How Gas intensive would it be to repurchase CLAIM-FEE token? Or perhaps a 3-month maximum would work as well. Interested in hearing your thoughts. Very different game theory here versus Opyn who’s looking to roll out “Everlasting Options” to avoid the end-user going thru “rolling position” strategy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#31",
                    "likes": "4",
                    "time": "23/08/2021-17:50:26",
                    "content": "One feature being discussed as part of Institutional Vaults - Economics & Terms is a limit on how fast the stability fee can change for fixed rate beneficiaries. Deco doesn’t currently offer this (correct?), but would it be feasible to add? For example, suppose I purchase CLAIM_FEE tokens at an implied fixed rate of 2% for six months. I hold these tokens to expiration. Can I renew them for another six months at an implied fixed rate of 3% or less, regardless of the current stability fee? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.238095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#32",
                    "likes": "1",
                    "time": "24/08/2021-19:51:29",
                    "content": "Deco contains features which can be implemented to achieve a comparable outcome. We anticipated that vault owners may not be willing to pay the entire stability fee up-front for longer durations, e.g., a year or more. In these situations, we added a function called Slice to Deco which can be programmed to achieve the result you mention with the use of a small custom sale contract. The following is an example of an implementation which achieves the result you suggest: For example, Slice can be used to convert a 100M CLAIM-FEE Q1_22-Q1_24 balance (issued for two years) into 8 new balances, each representing contiguous quarters. We now have eight 100MM CLAIM-FEE tokens and each 100MM representing one of 8 quarters from the original two-year term: 100M CLAIM-FEE Q1_22-Q2_22, 100M CLAIM-FEE Q2_22-Q3_22, …, 100M CLAIM-FEE Q4_23-Q1_24. The time is sliced and the 100M notional amount stays the same on all these slices. The sale contract can be designed to define the rate at which the vault owner will purchase each 100M CLAIM-FEE balance that represents one quarter and the date at which they are eligible to purchase each CLAIM-FEE balance, (one week before the start of each quarter perhaps?), to achieve the use case you described. The sale price set for each one of these CLAIM-FEE token balances sets the fixed-rate stability fee that vault owners would receive. Using Deco, a Vault owner does not have to trust MakerDAO governance to receive the future CLAIM-FEE tokens at an agreed upon rate. Instead, the vault owner can receive the stability fee offset in a trustless manner at pre-defined intervals. There may even be a superior implementation using Deco, but the main point I’d like to make is that tokenization of the stability fee and some neat native functions we designed, like Slice, allow Deco to be flexible. Deco can handle new use cases like this with ease and without introducing new complications or stretching the current protocol. In the example given above, CLAIM-FEE slices are not treated any differently than the initial tokens. They rely on the same central yield snapshot mechanism (called Fraction Values in Deco). Slicing the terms and using this feature will not introduce additional complications to Maker governance or to Deco in terms of managing the settlement. The safety mechanism Close can settle all future maturities in one go and take them out of circulation the moment emergency shutdown is triggered. The Close feature makes long-range issuances like the ones described above safe. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.602444903581267
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#33",
                    "likes": "1",
                    "time": "24/08/2021-20:09:37",
                    "content": "    flipflopflapdelegate:  Would it be possible to consider a lesser maturity—perhaps 4-weeks? My guess is that shorter maturities can provide an upside for both Maker & the borrower—depending on the movement of the SF. Also—How Gas intensive would it be to repurchase CLAIM-FEE token? Or perhaps a 3-month maximum would work as well. Interested in hearing your thoughts.   I need to verify but are stability fees on collateral types being set once per month already making them stable over that duration? Deco can target any issuance frequency as long as it is beneficial for both MakerDAO and vault owners. A minimum of two transactions would be required for the entire fixed-rate cycle- a token purchase transaction on a DEX, and a collect transaction to collect Dai yield and payback vault debt. I can run some simulations and give you an accurate gas estimate but collect is fairly simple and cost to execute it would be similar to a token trade.     flipflopflapdelegate:  Very different game theory here versus Opyn who’s looking to roll out “Everlasting Options” to avoid the end-user going thru “rolling position” strategy.   I will read the post and revert back. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.09090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#34",
                    "likes": "1",
                    "time": "24/08/2021-20:54:51",
                    "content": "    vamsi:  I need to verify but are stability fees on collateral types being set once per month already making them stable over that duration?   I believe the rates working group  meets every week, and the Parameter Proposals are first  presented on the Maker Governance forum and are then entered into the weekly governance cycle. Thanks again for providing feedback Vamsi! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#35",
                    "likes": "2",
                    "time": "01/09/2021-06:05:27",
                    "content": "My feedback   for Institutional Vaults a fixed rate is fine as long as it in general is above the floating SF and the potential users have expressed an explicit interest in this product.   for general Vaults I am sceptic, it does not matter if it is Deco or any other provider. The argumentation is as follows.   Interest rates in Maker, Aave etc don’t matter unless they are 10-15+%. Why? because crypto is so volatile that the cost of capital (interest rates) is insignificant compared to the potential capital gain (if the price of lets say ETH goes up). This is why lowering the Stability Fee does not really work that well, but lowering the Liquidation Ratio is the way to go if you want to attract more business, it simply provides more dai. The same applies to Fixed Rate Vaults. It is a maybe useful feature for a small minority of Vault holders. Example: at the start of Defi Summer 2020 you start a ETH-A Vault. You mint Dai and buy more ETH at DAI240. 31 December 2020 you close the Vault at an ETH price of DAI750. At the same time Maker stability fee for ETH-A has gone from 3-4% to about 5-6%. You get my point? It does not matter at all if the SF is variable or fixed since ETH has gone up 3x in the same period. Fixed or floating - it is totally irrelevant. You have a use case where fixed rates makes sense? My motivation here is not that I am trying to prevent the protocol being loaded up with features nobody really wants and prevent a lot of work for nothing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.398333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#36",
                    "likes": "0",
                    "time": "03/09/2021-14:16:25",
                    "content": "    Planet_X:  My motivation here is not that I am trying to prevent the protocol being loaded up with features nobody really wants and prevent a lot of work for nothing.   I respect your opinion, but I want to push back on this. It’s hard to assess the potential interest in a feature that isn’t available yet.     Planet_X:  Interest rates in Maker, Aave etc don’t matter unless they are 10-15+%. Why? because crypto is so volatile that the cost of capital (interest rates) is insignificant compared to the potential capital gain (if the price of lets say ETH goes up).   If what you say is true then why is the rates working group keeping stability fees so low? We’re in a bull market and protocol income is slashed to starvation levels because we’re trying to use stability fees to discourage USDC? Today the MKR/ETH ratio is less than 1.      Planet_X:  It does not matter at all if the SF is variable or fixed since ETH has gone up 3x in the same period. Fixed or floating - it is totally irrelevant.   Maybe, but fixed rates would distinguish Maker from the competition and seems likely to facilitate new business opportunities. For example, the institutional vaults product would be a lot simpler to put together if most of the pieces could be built out of standard floating-to-fixed swap components. Closely integrating the yield tokens with the Maker protocol (Deco) offers a particularly slick user experience that cannot be mimicked by add-ons like Yield or similar fixed rate protocols. ",
                    "links": [
                        "https://forum.makerdao.com/t/institutional-and-long-term-vaults-proposal/9586"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.199552341597796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#37",
                    "likes": "2",
                    "time": "03/09/2021-14:21:34",
                    "content": "    Planet_X:  the protocol being loaded up with features nobody really wants and prevent a lot of work for nothing.   It seemed to me that a key point of Deco was that there was not much additional work for the protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/vamsi",
                    "index": "#38",
                    "likes": "2",
                    "time": "04/09/2021-20:33:40",
                    "content": "    swakya:  It seemed to me that a key point of Deco was that there was not much additional work for the protocol.   Yes, and more details to follow soon! The remaining work is the integration and then the maintenance of the protocol Deco has borne the cost of design and development and consequently de-risked these components to Maker’s benefit. This is not an R&D project, nor is it a proposal for Maker to fund the development of a product. Instead, we are asking Maker to fund the integration and support the operational core unit until such time as it becomes sufficiently profitable to cover its core budget and generate a profit for Maker. This protocol enhances Maker rather than adding any additional burden to the DAO or any of the existing CU. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#39",
                    "likes": "0",
                    "time": "12/10/2021-19:07:05",
                    "content": "ETH and BTC are big enough Maker users that they may attract liquid fixed rate markets. For smaller collateral types, would it be possible to aggregate all collateral together that are tied to the same floating rate? For example, if risk decides that some LP tokens (e.g., WBTC/ETH, UNI/ETH, and USDC/ETH are all at 2%) shall follow the same floating rate then can Deco merge these markets into a single fixed rate market? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#40",
                    "likes": "0",
                    "time": "12/01/2022-01:07:25",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}