{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-august-13th-2020-executive-vote/3713",
            "title": "Discussion: August 13th, 2020 Executive Vote ",
            "index": 3713,
            "category": [
                "Governance"
            ],
            "tags": [
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "3",
                    "time": "18/08/2020-02:05:00",
                    "content": "Since we’re having a hard time passing the current executive, I wanted to start a discussion on why that may be (aside from 65k farming YAMs). On https://old.reddit.com/r/MakerDAO/comments/ibjrpg/please_vote_in_the_current_executive/ I read the following comment: \"I disagree with the first three, and agree with the last three. It annoys me that technical oriented fixes are bundled with more subjective policy decisions. I know in the current environment having 6 different polls probably isn’t much better though, so I am not sure I have a constructive suggestion to improve things.\" Now we all know the difficulties with currently bundling executives but this gave me the idea to break down each proposal and explain why I think they are all good for those against 1 or more of them and hopefully change their minds.  Reduce the Base Rate  Negligible change based on current state of the system. We’re currently at a -4% base rate which already makes all except USDC-B and MANA 0% SF. If the base rate needs to go up in the medium future then either it takes 2 weeks to go positive, or we signal a specific rate, or Cyrus could enact an emergency vote to move the BR positive. Not a big deal.  Adjust the Dust Parameter  Gas is really high. Short story is, keepers can’t liquidate small vaults when the network is congested. Sure, getting small fish to open Vaults to try them out would be great for adoption, but as Ethereum stands right now, its just not economical. Perhaps in the future when L2’s get adopted or ETH 2.0 comes out and gas is more efficient we could allow for smaller vaults, but right now this change makes sense. Besides, who wants to spend $20 in gas fees for a $50 Vault?  Adjust the BAT-A Risk Premium  Unless you have a BAT Vault this is a no-brainer. BAT is riskier than ETH and more in line with KNC/ZRX for risk settings (perhaps even more but thats just my opinion). While base rate is negative, this is the perfect time to increase it’s risk premium.  Increase the Surplus Auction Buffer  This was my personal addition. After Black Thursday it was clear that it would have been helpful to have a larger buffer to stave of catastrophic failures like we saw. In all we ate over 4 Million in losses (5?) and MKR holders had to pay (literally through dilution). With the DAO needing to eventually self fund as well as insure the system, increasing the System Surplus (Auction Buffer) is a smart choice. If anyone still has qualms with these changes I would love to hear your reasoning. Thanks. ",
                    "links": [],
                    "GPT-summary": "The author of the post is explaining the August 13th, 2020 Executive Vote and breaking down each proposal to explain why they are good. A 3rd party has given constructive criticism on the proposals and the author is open to hearing more reasoning from anyone who still has qualms with the changes.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.3565069462128285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/08/2020-06:18:24",
                    "content": "Yeah, they’re either not that big of a deal, or good for MakerDAO. Also, another benefit is that we might get an ETH DC raise next. A bit closer, only 22,335.46 MKR needed to pass. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/The_Ratj",
                    "index": "#3",
                    "likes": "3",
                    "time": "18/08/2020-08:42:00",
                    "content": "This executive has passed. Approximately 2hrs ago. Good news! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1875
                }
            ]
        }
    ]
}