{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/comments-on-the-dai-peg-sf-fees-and-a-request-any-possibility-to-get-full-data-regarding-sai-dai-peg/1069",
            "title": "Comments on the DAI PEG SF fees and a request: Any possibility to get full data regarding SAI/DAI PEG ",
            "index": 1069,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "data",
                "rates"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "0",
                    "time": "05/01/2020-00:01:51",
                    "content": "Folks some time ago I was putting together a proposal regarding the data gathered on the PEG over the last years operation of the SCD/SAI but I did not take a snapshot of the  existing DAI graph data I had at the time and now with the migration the data appears to have vanished. I really like the data found here at https://dai.stablecoin.science What I really want is the raw data on this for the past year so I can finish my PEG analysis and present here in the forums my final report regarding why the SF fees should be closer to the compound USDC rates to get the PEG back on track. vishesh can you post here a link where we can pull the data for the past year?   Is it available or am I going to have to look for some 3rd party sources with a fine enough grain. There is one thing I really want to see is something like the mrk.tools graph for the past year (including the outstandind debt, eth-usd price, SF fee AND the PEG along with something like the 3, 5 sigma band lines bracketing the PEG averages.    If I had a complete graph of such data I am pretty sure I can make a strong arguments for how the markets were reacting to the SF rates and why they currently should be closer to the USDC compound borrow rates so the Maker community can finally get a good handle on PEG management.  There was some terrific data generated by the rise from 1% to 18%, down to what 16% and to 20.5% before dropping back to ~6% before the migration. As a last note before I see if this data turns up.   In my analysis I have been looking at what loss of PEG means to various stake holders and am finding that the most damage is done to the most people when the PEG drops much below $1 as the mechanisms to sop up excess liquidity simply are less robust than providing liquidity when it is tight and the PEG is above $1.    Hence I think (based on my own analysis of the ecosystem) is that a focus to maintain the PEG should be biased to having the PEG >=1 vs. letting it float below that.    This is particularly important for the underserved, in restricting debt facility growth, and maximizing return for MKR token holders as well as faith and trust of the community. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.556545556545557
                }
            ]
        }
    ]
}