{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-proposing-yeth-vault-alternative/4121",
            "title": "[Discussion] proposing yETH vault alternative! ",
            "index": 4121,
            "category": [
                "Governance"
            ],
            "tags": [
                "idea"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#1",
                    "likes": "10",
                    "time": "13/09/2020-16:45:04",
                    "content": "yETH vault had the potential to mint hundreds of millions of DAI by offering relatively high yields for ETH holders who deposit their ETH in yETH vault but this strategy didn’t continue for a simple reason, in times of bear market especially black swan events there is a huge demand for DAI in general and this strategy will just increase this demand which might cause huge liquidation or they will be forced to buy expensive DAI because DAI peg might become much worst than the current state. what I am proposing is Maker participating directly in “farming” the idea is simple: Maker mint for example 10m DAI and become a liquidity provider in one of Curve’s pools if DAI peg continued to be broken we mint more and more DAI when DAI peg restored we start to lower our position and burn the DAI the benefits of this idea: 1- restore the broken peg (since half a year ago) 2- Makerdao will generate high yield from participating in farming, the yield right now 50-60% for most of Curve pools, even with 10% APY we can generate a very good source of income for the protocol 3- the required smart contracts to implement this idea is very simple in comparison to yETH vault because we don’t need oracles and we don’t need to care about keeping the right borrowing ratio and there is no risks of getting liquidated and no risks of DAI liquidity crisis (so should be relatively simple for the foundation to implement it) 4- it will buy us time until more scalable collaterals become available (for example RWA) 5- Curve is alive for almost 1 y now with more than 1 billion $ total deposits and their platform seems fairly secure 6- the fees generated from this idea can help us recruit more devs and teams and increase the DAO independency from the foundation 7- the risks of this idea are very similar to the risks of usdc vaults but the benefits (income) are much higher (so much better benefits-risks ratio than usdc vaults) please I would like to hear your feedback for this idea! ",
                    "links": [],
                    "GPT-summary": "The author proposes a new strategy for Makerdao to generate high yield by participating in farming and becoming a liquidity provider in one of Curve's pools. The proposal aims to restore the broken DAI peg and generate a good source of income for the protocol. The required smart contracts to implement this idea are simple in comparison to yETH vault. The author asks for feedback on the proposal. A third party gives constructive criticism and asks questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.500434362934364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#2",
                    "likes": "3",
                    "time": "13/09/2020-16:46:56",
                    "content": "Yes, much better than minting DAI to buy MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#3",
                    "likes": "1",
                    "time": "13/09/2020-16:53:13",
                    "content": "by the way I think this idea could even bring back yETH vault or similar strategies because we will be solving the biggest problem that threat it (liquidity crisis) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "1",
                    "time": "13/09/2020-16:57:31",
                    "content": "Can’t we just print DAI, put it in the curve pool and hold the ycrv token as backing? This proposal has been talked about in another thread but I don’t remember the downsides. @MakerMan did you propose this? We can always become our number 1 customer by printing unbacked DAI and purchasing assets to make the DAI backed. I’m wondering if this isn’t the simplest solution (albeit riskiest). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#5",
                    "likes": "0",
                    "time": "13/09/2020-17:01:24",
                    "content": "@Aaron_Bartsch Though to earn the good returns you need to stake your yCRV tokens to earn CRV. And you need to harvest the CRV and sell it. yyCRV the yearn vault tokenizes this so you’ll have a token as backing. And you don’t need to manually harvest. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#6",
                    "likes": "1",
                    "time": "13/09/2020-17:16:49",
                    "content": "This could result in a lot of unbacked dai.  While I am open to this, most people here appear to be heavily opposed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#7",
                    "likes": "0",
                    "time": "13/09/2020-17:18:11",
                    "content": "it is backed by our share in the pool ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#8",
                    "likes": "3",
                    "time": "13/09/2020-17:21:43",
                    "content": "So basically this would be just approving curve.fi tokens as collateral.  We could essentially do what you are proposing the same way that we are proposing to use USDC vaults:  approve curve-fi collateral, set LR to 1.01 or lower.  As much as possible, we should use strategies that don’t involve any new smart contract programming. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.35064935064935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "2",
                    "time": "13/09/2020-17:33:32",
                    "content": "    Aaron_Bartsch:  Can’t we just print DAI, put it in the curve pool and hold the ycrv token as backing? This proposal has been talked about in another thread but I don’t remember the downsides. @MakerMan did you propose this?   Yeah I advocated this in connection with a secondary system surplus (or treasury) since then it breaks the primary system 1:1 DAI collateral backing but retains this as a ‘governance’ option to restore the 1:1 PEG by adding back the collateral in the treasury to the primary DAI redemptions in case of ES. In the loosest sense it is printing of unbacked DAI within the collateral of the primary system but if one adds in the collateral of the secondary surplus/treasury 1:1 ‘should’ be restored.    The problem with just buying collateral in the secondary surplus/treasury buffer is pricing risk.   I was talking about doing this with stablecoins so the pricing risk was minimal. I did also suggest this in connection with yield farming since in principle depositing DAI to get cDAI in compound has zero pricing risk, only liquidity risk which the system can easily take on. So yes as long as the underlying basically gives back DAI 1:1 I see no real issue with this and the protocol itself would earn. I point out that I suggested this for COMP simply because Maker getting into this game would lower returns overall for everyone else and governance could have drop kicked as much DAI as necessary to price out the farmers.   Pricing risk is zero, but liquidity and other risks would have had to been assessed.  In the end it would have given Maker governance a voting share of compound governance as well or just sold for MKR and the MKR burned or saved in the treasury. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.041666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#10",
                    "likes": "0",
                    "time": "13/09/2020-18:09:09",
                    "content": "I touched the subject in MIP13c3-SP3: Declaration of Intent - Strategic reserves fund (SRF) but without going as far as having DAI minting out of thin air. But using M vaults more or less solve the capital base issue (if you have a cDAI-M vault 100% LR even the 3% of Compound can be 30-40% easily and you push compound farmers to curve quickly). Or have a yyCRV-M vault, but you can’t have 100% LR then so you need a bit of capital. If my way to use vaults is convoluted, just think about keeping the system solvent while minting DAI. Accounting can do the trick as well. ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-quantitative-easing-to-fix-the-peg-aka-manual-psm/3902"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.895833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#11",
                    "likes": "0",
                    "time": "13/09/2020-18:13:50",
                    "content": " So basically this would be just approving curve.fi tokens as collateral. We could essentially do what you are proposing the same way that we are proposing to use USDC vaults: approve curve-fi collateral, set LR to 1.01 or lower. As much as possible, we should use strategies that don’t involve any new smart contract programming.  but this way we will miss the high yields also we will depend on curve LPs and their will to use Maker ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.425541125541126
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#12",
                    "likes": "4",
                    "time": "13/09/2020-18:14:52",
                    "content": "I think the cleaner way to accomplish this is to allow for Curve’s Liquidity Pool tokens to be used as collateral to mint more DAI. And not limited to Curve of course, but it is a good place to start. This way if yETH needed to unwind but didn’t want to market buy DAI, they could use their existing assets to mint more without slippage. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 7.169642857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "1",
                    "time": "13/09/2020-18:21:25",
                    "content": "Our vault are currently full reserves banking. We don’t use the collateral. Nothing say we can’t provide vault that use fractional banking (like Compound or Aave) were we use the collateral to farm and give an interest to the vault owner (and keep some of the yield as we insure the operation). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#14",
                    "likes": "4",
                    "time": "13/09/2020-18:26:08",
                    "content": "Maybe but don’t underestimate the complexity of trying to make new smart contracts.  At this point, we are maxed out dev resources trying to create the new liquidations and voting contracts.   As an intermediate step, we should try to use the existing structures and see if we can fix the peg that way. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.811688311688313
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#15",
                    "likes": "1",
                    "time": "13/09/2020-18:27:31",
                    "content": "    rileyjt:  I think the cleaner way to accomplish this is to allow for Curve’s Liquidity Pool tokens to be used as collateral to mint more DAI. And not limited to Curve of course, but it is a good place to start. This way if yETH needed to unwind but didn’t want to market buy DAI, they could use their existing assets to mint more without slippage.   I think we should support Curve liquidity tokens… but we will be depending on the will of Curve liquidity providers to use Maker and we will probably get much lower fees than directly farming ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.696428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#16",
                    "likes": "3",
                    "time": "13/09/2020-18:33:24",
                    "content": "I proposed something similar to this with uniswap tokens. I really like the idea of maker holding liquidity tokens. In line with what @rileyjt is saying, I think these vaults should be open to the public, but ALSO that the maker protocol itself should hold these tokens in reserves. They are the closest equivalent to treasury bills for the crypto market. Many of these tokens are fully decentralized and permissionless, they provide a yield, they have low volatility compared to the crypto market as a whole. They really are just about the perfectly optimal token to hold in reserve. Also there’s a wide enough variety now that we can even optimize the amount of risk the protocol takes on within the realm of liquidity tokens alone. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.909090909090908
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#17",
                    "likes": "3",
                    "time": "13/09/2020-18:33:57",
                    "content": "Yes- but keep in mind if the SF for curve tokens is below their yield, LPs have a high incentive to deposit their tokens into CDPs and leverage buy more of them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.65
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#18",
                    "likes": "0",
                    "time": "13/09/2020-18:34:10",
                    "content": " Maybe but don’t underestimate the complexity of trying to make new smart contracts. At this point, we are maxed out dev resources trying to create the new liquidations and voting contracts. As an intermediate step, we should try to use the existing structures and see if we can fix the peg that way.  yeah I understand… but it seems to me that this idea is much simpler than yETH vault (that didn’t take a lot of time to be produced by yearn developers) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.858766233766234
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rileyjt",
                    "index": "#19",
                    "likes": "2",
                    "time": "13/09/2020-19:28:00",
                    "content": "Maker needs to be able to compete for liquidity, or it will never be able to scale. Accepting yield generating tokens as collateral are an important step in that direction (both RWA and native DeFi ones). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "3",
                    "time": "13/09/2020-20:53:23",
                    "content": "    latetot:  Maybe but don’t underestimate the complexity of trying to make new smart contracts. At this point, we are maxed out dev resources trying to create the new liquidations and voting contracts.   Can’t emphasise this enough. It will change in the future as the DAO gets it’s own smart contract development resource, but for now, got to stick with what we have. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.929499072356215
                }
            ]
        }
    ]
}