{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-maker-is-not-a-lender-does-not-take-deposits/8520",
            "title": "[Discussion] Maker Is Not A Lender; Does Not Take Deposits; ",
            "index": 8520,
            "category": [
                "Governance"
            ],
            "tags": [
                "marketing",
                "pr"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "17",
                    "time": "03/06/2021-13:32:30",
                    "content": "TL;DR: We should not refer to ourselves as a lender, much less a bank. That’s not an accurate description of what Maker does, invites political/regulatory risk that we are actually not subject to, means that a negative SB should not always result in minting MKR, and recognizes the technical innovation by our PE team of enabling trustworthy self-lending for the first time in human history. (I honestly think that latter one is worthy of an economics Nobel) This is a discussion I’ve wanted the community to have for a while. On the surface, this will sound like semantics, but it has some very important ramifications, so please bear with me. The Maker Protocol is not a lender. Maker has two lines of business at present: trading and loan guarantees. The simpler of the two businesses is what we all know as the PSM. It functions by providing a fixed price at which we will both buy and sell the tokens known as USDC and DAI. DAI issued through the PSM are zero-coupon, perpetual-maturity debt issued by the Maker Protocol. In accounting terms, these should be listed as liabilities and the USDC we hold are an offsetting asset. The net effect on our balance sheet should be zero unless something goes wrong. The reason the USDC in the PSM is an asset is because Maker can control it. It not, however, a deposit, as Maker holds it free of any obligation to return it – we could turn off the PSM at any time if we really felt like it. By the same token, the DAI issued through the PSM is not a loan asset, but debt Maker has issued itself. The second line of business is that Maker provides a machine – in the form of smart contracts – that allows people to lend to themselves. This sounds strange, but note that Maker does not hold the collateral of the user. It also does not lend out the DAI to the user. Those are both done by the machine – the smart contract – and the property of the user. In, for instance, an ETH-A vault, both the collateral and the loan are on the user’s balance sheet, not ours. This is analogous to Microsoft providing the Word program, but it does not own the output of that program. You own the words you type in Word, you own the photo you take with an iPhone, you own the bread you bake in your oven. Likewise, Maker neither owns nor holds the collateral or loan associated with a vault. It simply supplies the machine that allows people to lend against themselves – a novel and underappreciated innovation. To make those loans users borrow from themselves marketable – in the form of DAI – Maker guarantees that debt will be backed by at least $1 in assets. This makes the debt fungible and in some way ultimately redeemable, allowing it to trade in the market at around face value. If a user’s debt goes bad, the machine begins the liquidation process automatically. Fees collected by Maker in the form of SF or liquidation penalties are akin to the subscription you pay for other software, or a premium paid to a guarantor of your debt. This has very important implications. The most obvious is simply that being a guarantor of loans is a much more accurate description of Maker than being a lender. Unfortunately, there’s not concise way to describe that role, so I will admit I am just as guilty as everyone else who uses “crypto lender” as a shorthand for what Maker does. The next implication is that erroneously referring to ourselves as a lender or even a bank exposes us to future regulatory scrutiny that is unwarranted. Maker is not a bank – we do not accept custodial deposits – and it is not a lender – we only issue our own debt through the PSM and guarantee the debt of standard vault classes. Both of those are subject to varying amounts of regulatory oversight and scrutiny in a wide array of jurisdictions. The business of trading DAI/USDC with our own funds and the business of offering guarantees for loans generated with our software in exchange for subscription revenue/premium due only upon liquidation is decisively less exposed to onerous regulation. The final implication is that MakerDAO has far more equity than it appears at first glance. If all DAI issued really were loans we held on our books, then our balance sheet looks much, much larger, and holding much, much less equity. I have not attempted to estimate a balance sheet for us recognizing our activities as loan guarantees rather than loans, but the key understanding is the the SB is an asset – our cash reserves – and does not represent the actual equity – or solvency – of Maker. At the moment, these will appear to be very similar to each other in number, as the PSM assets/liabilities will cancel each other out and the SB is mostly the asset that is left. But as CUs become operational, there are both funds inside them that Maker can potentially claim on its balance sheet, and they will have tangible and intangible assets that Maker can claim as well (assuming the CU is not merely a contractor, but that’s another discussion). This is probably not the time for it, but it also implies we should revisit whether Maker should automatically mint in the event of a negative SB, as that merely implies that cash on hand < outstanding DAI debt issued by the DAO directly to cover expenses or guarantees of bad self-lending debt. I suggest we begin to consistently recognize and push a form of this self description to both make it clear to our user base what Maker does, and to keep ourselves at arm’s length from unnecessary regulatory risk. Note that philosophical mission statements need not be affected by this recognition of the practical realities of Maker’s business. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-vs-redemption-based-stablecoins-under-glass-steagall/10911",
                        "https://forum.makerdao.com/t/maker-relay-ep-48/8609",
                        "https://forum.makerdao.com/t/maker-relay-ep-48-en-espanol/8636",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-145-thursday-june-10-17-00-utc/8590/2",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-6th-2021/8724"
                    ],
                    "GPT-summary": "The author of the post argues that Maker should not be referred to as a lender or bank, but rather as a guarantor of loans. The post explains the two lines of business of Maker, trading and loan guarantees, and how they function. The author suggests that referring to Maker as a lender or bank exposes them to unnecessary regulatory scrutiny and proposes a consistent self-description to clarify Maker's business. The post invites constructive criticism and suggests a need to revisit Maker's automatic minting policy.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.185535714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "8",
                    "time": "03/06/2021-14:41:15",
                    "content": "    PaperImperium:  much less a bank. That’s not an accurate description of what Maker does, invites political/regulatory risk   This  I have been singing this tune for a while. TY Paper! It’s music to my ears. Why in the world would Maker want to label itself as a “Bank” is beyond me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "1",
                    "time": "03/06/2021-16:06:49",
                    "content": "I think this is an excellent discussion to be having! Thanks for posting, looking forward to digging into some of the finer points I disagree with here, but preface this with I am not a lawyer and do not know what legal implications exist for different framings, just my two cents on what makes sense as a dedicated community member.     PaperImperium:  means that a negative SB should not always result in minting MKR   I would offer some pushback here, the entire incentive alignment of the system is based on MKR holders being diluted when poor policies are approved that put the protocol at risk. The system relies on this mechanism to encourage MKR holders to pay attention, and importantly to not vote anything in that has undue risk of this happening.     PaperImperium:  an ETH-A vault, both the collateral and the loan are on the user’s balance sheet, not ours.   This is also a bit problematic. DAI has its value because of its collateralization commitment. If the items were truly only on the user’s balance sheet we would have no need for over collateralization and we would have no interest in what the user is allowed to do with the smart contact (in terms of minimum collateralization, SF, asset offerings). It is very important that we understand these items as on our own balance sheet, or we will not be able to make decisions that keep the protocol safe and DAI at its peg.     PaperImperium:  If a user’s debt goes bad, the machine begins the liquidation process automatically. Fees collected by Maker in the form of SF or liquidation penalties are akin to the subscription you pay for other software, or a premium paid to a guarantor of your debt.   Saying this doesn’t make it so, IMO. After all, we are dealing with cryptocurrencies And cannot ignore the financial implications because it makes us feel better about the regulatory risk. The risk is there regardless, and I believe attempting to obscure this is a disservice both to our marketing efforts and to our decision making process. Maker looks a lot like early 19th century banks and I think it is dangerous not to acknowledge this and learn from the mistakes that were made in traditional finance.     PaperImperium:  but the key understanding is the the SB is an asset – our cash reserves – and does not represent the actual equity – or solvency – of Maker.   Important to remember that we use the SB to pay our expenses, like the cost of our workforce. We can count on some good will from dedicated community members (I, for one, am not gone at the first missed paycheck) but with the inability to pay people we can’t expect a functioning growth machine for very long. Want to check with @SebVentures here, but pretty sure it’s also problematic to have the SB on the asset side of the ledger, as it would be returned to DAI holders in the event of an Emergency Shutdown. Just some thoughts on why I have been in full embrace of the (de)Central Bank meme and why it’s a hard mindset to break free of anytime soon. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7035342261904765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "1",
                    "time": "03/06/2021-17:09:51",
                    "content": " DAI issued through the PSM are zero-coupon, perpetual-maturity debt issued by the Maker Protocol  Agreed. A bank deposit would be an on-demand debt and not a perpetual one. But we are acting like we have a moral duty to act like DAI should be on-demand debt and be convertible for $1 (or close to it). I mean we call it a $-pegged stablecoin. As DAI is a fungible token, Not sure you can have it on the liability side of many balance sheet or linked to something.     PaperImperium:  DAI issued through the PSM are zero-coupon, perpetual-maturity debt issued by the Maker Protocol. In accounting terms, these should be listed as liabilities and the USDC we hold are an offsetting asset.   You can’t offset a USDC asset with a DAI liability without using some quite creative accounting. For reference, my frame of thinking for MakerDAO accounting => MakerDAO accounting and implications ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.364583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#5",
                    "likes": "1",
                    "time": "03/06/2021-17:21:26",
                    "content": "I don’t think regulators are going to interpret laws charitably such that they let us off with a slap on the wrist. If they want to come down hard calling it a bank or not won’t make a difference. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.25462962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "0",
                    "time": "03/06/2021-17:37:40",
                    "content": "So these are great questions! Let me go through them one by one.     prose11:      PaperImperium:  means that a negative SB should not always result in minting MKR   I would offer some push back here, the entire incentive alignment of the system is based on MKR holders being diluted when poor policies are approved that put the protocol at risk. The system relies on this mechanism to encourage MKR holders to pay attention, and importantly to not vote anything in that has undue risk of this happening.   The statement you made is not incorrect. The thing to remember is that the SB does not represent whether Maker is solvent – it represents cash on hand. Historically, these seem like they have been the same thing. As the DAO spreads assets into places that are not just the SB, then this shorthand is no longer going to be accurate. Additionally, negative equity would not necessarily imply that Maker could not meet its ongoing expenses and obligations. Even Apple does not keep more cash on hand than all of its liabilities. That does not make Apple insolvent, though, because it has other assets. The DAO is moving into a stage where there will be assets in places other than the SB. So while the SB is for now a good approximation of whether Maker has a positive equity value, this will not always be the case, and we will want to keep that in mind going forward.     prose11:      PaperImperium:  an ETH-A vault, both the collateral and the loan are on the user’s balance sheet, not ours.   This is also a bit problematic. DAI has its value because of its collateralization commitment. If the items were truly only on the user’s balance sheet we would have no need for over collateralization and we would have no interest in what the user is allowed to do with the smart contact (in terms of minimum collateralization, SF, asset offerings). It is very important that we understand these items as on our own balance sheet, or we will not be able to make decisions that keep the protocol safe and DAI at its peg.   DAI does have value because of the collateralization commitment – of the user who created the DAI. Maker stands as a backstop should that user not be able to continue to make good on that promise. That does not make it our balance sheet item. If you buy a car by taking on a loan, but your parent guarantees the loan, that does not make either the car or the loan your parent’s asset/liability. At least, not until you default and it falls to them. The peg is how we guarantee the debt. We guarantee that anyone holding debt in the form of DAI can trade it for a close approximation of $1 on the secondary market.     prose11:      PaperImperium:  If a user’s debt goes bad, the machine begins the liquidation process automatically. Fees collected by Maker in the form of SF or liquidation penalties are akin to the subscription you pay for other software, or a premium paid to a guarantor of your debt.   Saying this doesn’t make it so, IMO. After all, we are dealing with cryptocurrencies And cannot ignore the financial implications because it makes us feel better about the regulatory risk. The risk is there regardless, and I believe attempting to obscure this is a disservice both to our marketing efforts and to our decision making process. Maker looks a lot like early 19th century banks and I think it is dangerous not to acknowledge this and learn from the mistakes that were made in traditional finance.   I’m not aware of any crypto asset that has been recognized as a currency by any major jurisdiction. However, that doesn’t change the mechanics. It could be a cash-secured loan and still operate the same way. Microsoft does not own the copyright to a book you write, and we do not own the debt a user is able to issue to themselves. I think it would help if we imagined what Maker does, but in physical cash. If Maker rented out a machine in the privacy of your own home or business that functioned as a cross between a safe and an ATM, where you put in one asset, it was locked away from everyone, and dispensed paper DAI, would we be providing a loan? I would argue no. We rent out the machine and also guarantee the debt to anyone willing to take it as payment. We do not access the collateral – no one can – except in the case that this batch of DAI debt is no longer soundly backed by collateral. We are not even a pawn shop – we do not take deposit or custody of the asset used as collateral. But Maker has invented a machine that people trust to be honest about the collateral-to-debt ratio.     prose11:      PaperImperium:  but the key understanding is the the SB is an asset – our cash reserves – and does not represent the actual equity – or solvency – of Maker.   Important to remember that we use the SB to pay our expenses, like the cost of our workforce. We can count on some good will from dedicated community members (I, for one, am not gone at the first missed paycheck) but with the inability to pay people we can’t expect a functioning growth machine for very long. Want to check with @SebVentures here, but pretty sure it’s also problematic to have the SB on the asset side of the ledger, as it would be returned to DAI holders in the event of an Emergency Shutdown.   The SB is our net cash position vs DAI we have ourselves issued (plus any cash we hold inside CUs that are true “subsidiaries” and not contractors). If it goes negative, that is because we have either had to assume debt that went bad (in which case it does move onto our balance sheet) or have spent more than we hold. What does a negative SB mean in practice? It means we have issued DAI debt, just as we do with the PSM, but without the collateral on hand to back it in the event of an instantaneous settling (the ESM is the most likely scenario). I’m not saying that’s a good or desirable thing – just that it is not always a bad thing and not always catastrophic as long as income allows current expenditures to be met. Just like a person can have negative net worth from racking up credit card debt on frivolous expenses, or have negative net worth because they have enormous loans to finance an education, the mere existence of a negative SB shouldn’t spell catastrophe – especially as the SB ceases to represent all of Maker’s assets. One can easily imagine a case where the SB goes below 0, but there are still tens of millions of DAI in CU wallets. That doesn’t mean Maker can’t – if forced to – meet all its obligations. That situation wouldn’t be one to celebrate, but also should not automatically lead to a policy of dilution. There are definitely more details that will crop up, but I think the key test is:   Do we take deposits? We do not. We do not access our users’ collateral in any way except in liquidation.   Do we issue loans? Loans are issued by the smart contracts, not by Maker. DAI do not move from the SB to the user. They are generated at the user level with a smart contract provided by Maker.   Do we actually pay the debt for a vault? Not typically. Only if the user cannot continue to ensure the debt is properly backed. If we don’t pay it, it’s not our debt. If we do pay it, then it becomes our debt.   What do we do with debt that doesn’t need to be liquidated? We rent our credit history/reputation to our users so that their own self-issued debt is both fungible and accepted in the market at face value. We do this by promising to assume the debt is the user becomes undercollateralized.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.442085890300175
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "3",
                    "time": "03/06/2021-20:32:38",
                    "content": "    PaperImperium:  Do we take deposits? We do not. We do not access our users’ collateral in any way except in liquidation.   We technically can access it whenever. Not sure if that messes up the narrative or not, but governance can steal it all if they want to (hence why we worry about governance attacks.) In practice you’re right though, we don’t access it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.059523809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#8",
                    "likes": "0",
                    "time": "03/06/2021-21:14:31",
                    "content": "I am not too sure, banks have more than one businesses. One of them is lending money on assets you own. Like farm land, properties, house, painting … that looks pretty much what we are doing. Also they actually don’t give you money they give you an IOU database line in your account that you can redeem and convert to $$$. And we also collect dai (dsr) at a low rate and lend it at an higher rate. Afterall it is an interpretation point of view. But yes technically blockchain in general removes the thrusted party needed during a trade. So the protocol is the bank. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.175000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#9",
                    "likes": "0",
                    "time": "03/06/2021-21:34:11",
                    "content": "    LongForWisdom:  We technically can access it whenever. Not sure if that messes up the narrative or not, but governance can steal it all if they want to (hence why we worry about governance attacks.) In practice you’re right though, we don’t access it.   That’s the grab function, right? It’s no problem for this interpretation. There’s lots of businesses who could steal from their customers but do not. Which is why y’all are smart to worry about it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5357142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "0",
                    "time": "03/06/2021-22:42:25",
                    "content": "    SebVentures:  You can’t offset a USDC asset with a DAI liability without using some quite creative accounting.   Can you elaborate on this? We exchange $1 in debt for $1 in assets, or vice versa. We also take a small fee which falls to the income statement. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#11",
                    "likes": "0",
                    "time": "03/06/2021-22:48:41",
                    "content": "Principle of Non-Compensation If you have $100 on one bank account (USDC) and $100 on an overdraft loan of another bank (DAI) you cant net them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#12",
                    "likes": "0",
                    "time": "03/06/2021-22:52:50",
                    "content": "    SebVentures:  If you have $100 on one bank account (USDC) and $100 on an overdraft loan of another bank (DAI) you cant net them.   On your balance sheet that’s exactly what you do. One is held as an asset. The other was issued debt, which in this case is a liability. It’s analogous to selling a zero-coupon, put-able bond for $1 (a liability), and accepting $1 in cash, which in this case is held to keep the liability balanced on the books. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#13",
                    "likes": "1",
                    "time": "03/06/2021-22:56:28",
                    "content": "I probably misunderstood your sentence:  The net effect on our balance sheet should be zero unless something goes wrong.  The effect is $100 on the asset and $100 on the liability. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#14",
                    "likes": "1",
                    "time": "04/06/2021-11:22:17",
                    "content": "    alexis:  And we also collect dai (dsr) at a low rate and lend it at an higher rate.   So we actually do not. At least, not like a bank does. DAI in the DSR is not lent out, nor — if my understanding is correct— do we have custody of it. Practically speaking, the DSR’s existence does make us sensitive to the yield curve. But not because we are borrowing short and lending long, though the math likely works out pretty much the same ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.45
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mlphresearch",
                    "index": "#15",
                    "likes": "8",
                    "time": "04/06/2021-11:24:53",
                    "content": "In terms of regulation, the overarching principle nowadays is “same activity, same risk, same rules.” What constitutes ‘sameness’ is based on a facts-and-circumstances analysis. My reading of recent history is that regulators are much more focused on functional equivalence than actual technology or mechanisms. EDIT: To be clear, I’m not suggesting anything about Maker specifically but simply describing my reading of the existing regulatory framework. For a typical regulator, the problem boils down to accurately describing the economic substance of the activity in question and whether it can be grouped under an existing category or whether it is so radically innovative that it defines a new category (and thus necessitates an entirely new regulatory stance/practice). That said, throughout history, there has always been a gap between regulatory enforcement on paper vs. in practice, and very often that’s been due to both financial and technological innovation.  This is slightly off-topic but I think framing ICT (incl. blockchain networks and Maker) as first and foremost machine/software-based automation makes a lot of sense (see The Great Automaton) but that alone is unlikely to suffice as an answer on how to define Maker from a regulatory point of view. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.502104377104377
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#16",
                    "likes": "9",
                    "time": "06/06/2021-19:07:00",
                    "content": "Maker is not a bank, agreed, although the DSR requires some detailed explaining and Maker should discourage even third parties from describing it as a savings account. Maker is a lender, just not a lender in the normal banking sense.  I think we need to be careful about trying to describe Maker in a heightened complex way to try to avoid regulation and instead provide a clear description that will be understandable to a court or regulator.  Because the more complex it becomes the more likely a court or regulator - right or wrong - interprets the description as a coy end-run and then throws the entirety in the trash.  I’m not saying any of your analysis is wrong - maybe because I’m not smart enough in accounting to have an educated opinion  - but reading this description I think a point where a judge would stop listening is the claim that the person is self-borrowing and all Maker did was create a machine to do it.  I can hear the interruption from the court: wait, you are telling this court that Walgreens is not in the photo business because it is not Walgreens it is a machine that pops out a photo when the user pops in money and a .jpeg?  The nearby casino is not in the gambling business because a user of a slot machine is actually self-gambling with a computer program?  Even though the casino takes money from the slot machine? Part of Maker’s goal to avoid shut-it-all-down or stifling regulation is to make its product sufficiently popular that users of it and through them politicians will stand in the way of regulators who may think differently.  Like Uber/Lyft.  I can tell you that as Uber was becoming a craze on the coasts, state common carrier regulators in Nebraska were watching and waiting to shut them down and even take vehicles away from drivers, because the Uber model is absolutely 180 degrees from Nebraska’s laws regarding taxi service.  When Uber came, that happened for about 24 hours and then regulators stopped, not because of an Uber court win but because the regulators came under pressure from politicians and the public who cried out for Uber service. As I see it, Maker is a very sophisticated pawn broker that does not lend money but lends store tokens, and no one borrowing ever incurs a personal liability (helpful to avoid consumer lending regulation) - the pledged asset owes the debt/obligation to return the tokens plus a fee.  The reasons people are willing to pledge assets for those store tokens are (1) Maker accepts such tokens for all debt owed to it, (2) Maker (presently) will exchange those tokens one for one for tokens of another company that will exchange one for one with the USD, and (3) the crypto world’s acceptance of Maker’s store tokens as having value and a stable value and within that Maker’s reputation and proven performance in keeping those tokens valued in the open market within tenths of a cent of the USD.  Additionally the borrower’s collateral is not in the control of anyone/thing that can make human judgment calls outside fixed contracted terms, which means there never is discrimination based on race, sex, etc. in initiating a loan or in exercising default remedies. Now in response to that a regulator may say A-HA you are not registered as a pawnbroker!  Which in Nebraska the answer would be that our statutes regulate those that lend “money” on pledged collateral and Maker never lends money.  And that argument works on many finance laws/regulations in Nebraska and I bet as well in many other jurisdictions.  Circling back, if governments are hell bent on regulating Maker they will just change the law - our goal is to show those governments directly or indirectly through citizen pressure that Maker does not need to be further regulated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.477309727309727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#17",
                    "likes": "2",
                    "time": "06/06/2021-19:24:37",
                    "content": "    omahalawyer:  I can hear the interruption from the court: wait, you are telling this court that Walgreens is not in the photo business because it is not Walgreens it is a machine that pops out a photo when the user pops in money and a .jpeg? The nearby casino is not in the gambling business because a user of a slot machine is actually self-gambling with a computer program? Even though the casino takes money from the slot machine?   So I am obviously not an attorney, so I will defer to you and others on that point. The two analogies that came to my mind were ones where the machine is released into the world and it is the user who accrues the benefits and liabilities of use — guns and cameras. I don’t think we have the ability to restrict who uses our vaults, though I am unsure to what extent we solicit use from different parts of the public. I certainly wouldn’t rest a legal defense upon this description. But there’s no reason to invite regulation unnecessarily, or even lump ourselves fully in “finance” when a “technology” moniker may engender more warm, fuzzy feelings than former. I 100% agree, though, that usage by a large or important segment of the population gives us a constituency to buffer against regulation. I also am a strong advocate for us demonstrating a good faith effort in complying with regulations that we actually think may cover us. It’s important we present ourselves as a benevolent addition to finance and are important enough to have a seat at the table to comment on regulatory pressures when they inevitably occur. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.9154761904761894
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#18",
                    "likes": "0",
                    "time": "06/06/2021-19:38:37",
                    "content": "Interesting write-up but doesn’t precision matter here? I am not a lawyer but I can read a statute fairly well and from what I gather, the strict definition of lending under a state statute does not or would not capture the activity occurring on the Maker Protocol. Accordingly, the Maker Protocol and users thereof do not engage in “lending” services per the applicable regulation. Why that’s important is so often people use shorthand or ill-fit (but easy to understand) terminology to poorly describe new activities. I can’t say how a state court judge in rural Nebraska may handwave away complexity (note that a federal court judge may not take that route); regardless, we should not sacrifice accurate technical descriptions of what occurs here for ease of use. Case-in-point: Compound’s team has adopted the term \"“interest rate protocol” to better inform the public (and regulators, likely) why the Compound protocol is not a lender per se. Here is the article if you’re interested. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.122960372960373
                },
                {
                    "author_link": "https://forum.makerdao.com/u/omahalawyer",
                    "index": "#19",
                    "likes": "2",
                    "time": "06/06/2021-19:59:48",
                    "content": "Re: judge.  Sounds like you are picturing a Matlock “I’m just a country lawyer” type.  I am not.   In an adverse setting where that hypothetical argument is taking place, the judge would be making judgment calls about whether an explanation is necessarily a bit complex or the purpose of the argument’s complexity is to avoid the truth and end-run or smoke screen. I was saying that in how I view what Maker does, lending statutory schemes I am familiar with at the state level do not provide for regulation.  But I was also saying that laws can simply be changed if regulators/politicians feel compelled to regulate - the point being that Maker could sit with lawyers and come up with language and arguments to show how any relevant law/regulation does not cover Maker but if there has been no convincing government officials that further regulation is not needed then laws will just get changed. re: compound - thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1607142857142865
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#20",
                    "likes": "2",
                    "time": "06/06/2021-20:16:05",
                    "content": "    omahalawyer:  but if there has been no convincing government officials that further regulation is not needed then laws will just get changed   Sounds like the first step towards a “Government Relations” CU if you ask me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mr.dorf",
                    "index": "#21",
                    "likes": "0",
                    "time": "07/06/2021-19:07:23",
                    "content": "    PaperImperium:  I’m not aware of any crypto asset that has been recognized as a currency by any major jurisdiction.   El Salvador considered a major jurisdiction? [BTC as Legal Tender]…I’m half-kidding…(https://www.washingtonpost.com/world/2021/06/06/bitcoin-el-salvador/)     PaperImperium:  The statement you made is not incorrect. The thing to remember is that the SB does not represent whether Maker is solvent – it represents cash on hand.   This has been a fun exercise. Thank you @SebVentures for posting the accounting reference. I have to agree with @PaperImperium that the SB can be viewed as cash on hand, more closely resembling working capital rather than retained earnings. R/E passed on MKR holders in the form of a burn event, SB equaling an asset, cash reserves, to meet the demands of operations and its other liabilities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#22",
                    "likes": "0",
                    "time": "07/09/2021-01:07:38",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}