{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/2021-august-20-exec-update-pax-psm-at-50m-this-week/9958",
            "title": "2021 August 20 Exec Update: PAX PSM at 50m this week ",
            "index": 9958,
            "category": [
                "Updates"
            ],
            "tags": [
                "executive",
                "pe-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#1",
                    "likes": "21",
                    "time": "20/08/2021-14:48:07",
                    "content": "MKR holders, The Protocol Engineering Core Unit is preparing a new PAX PSM deployment for this week’s executive. This deployment has required the modification of some code from the existing USDC PSM deployment. Due to the new code and recency of the changes, we will be proposing the initial debt ceiling be set to 50 million Dai during the initial deployment period. These changes are fairly low impact and we can be reasonably assured that we’ll be able to raise the debt ceiling to the full 500 million requested in the next executive after a short burn-in period. For safety we would prefer that new code have some time to settle in at a value within the surplus buffer limit. These changes have been discussed and agreed to by GovAlpha and BizDev facilitators. Thank you, Your Friendly Neighborhood Protocol Engineering Core Unit ",
                    "links": [
                        "https://forum.makerdao.com/t/create-a-pax-psm/9683/17"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6573426573426575
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#3",
                    "likes": "2",
                    "time": "20/08/2021-15:41:19",
                    "content": "    brianmcmichael:  For safety we would prefer that new code have some time to settle in at a value within the surplus buffer limit.   Very prudent! Should we make this a standard rule for all new structural deployments like this? Or is this a special case? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.879870129870129
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#4",
                    "likes": "1",
                    "time": "20/08/2021-17:40:33",
                    "content": "I was thinking we should consider a kind of vault burn in period.  Start with lowish DC wait a bit to see if anything crops up before running a DC past 100M.  idk really. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wouter",
                    "index": "#5",
                    "likes": "2",
                    "time": "21/08/2021-09:35:50",
                    "content": "@brianmcmichael Would it be possible to publish a light-weight assessment somewhere to summarize which considerations lead to these debt ceiling recommendations? For example, I would imagine the team considered elements such as:  Business logic complexity New business logic compared to the USDC module Lines of code New lines of code compared to the USDC module External dependencies Formal verification Internal audits External audits  Having metrics like this with qualitative scores, not just for this change but future changes as well, would help the community to better understand the technical risk trade-offs. Later this can be formalized and adopted as part of a more comprehensive risk framework. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.530303030303029
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brianmcmichael",
                    "index": "#6",
                    "likes": "6",
                    "time": "24/08/2021-06:57:52",
                    "content": "Hi Wouter, I’m not sure I can give so tight a heuristic, it’s not really about lines of code. Generally we need to be careful adding any code to the system, whether we’ve seen it or not. To date, we have not added any new collateral or modules in excess of the debt ceiling, and it’s historically been considered the most effective defense for limiting collateral risk. With the new code involved and lack of a clear emergency this didn’t feel like the right time to start swinging outside of that, so we have stuck with a longstanding precedent. This system is fragile and there are many moving parts. The team makes every effort to fulfill our mandate of safety and security of the system, but in many cases we don’t know what we don’t know. In addition to the risk of new code, errors can get introduced in the spellcrafting process or in the interaction between the PAX code and the PSM module code. PAX itself is a proxy implementation with no way for us to tell on-chain whether the implementation has changed, so we will likely need to do additional research to mitigate this risk. While we have prepared and simulated tests, there are no takebacks in smart contracts, and a failure here can create irreversible loss, so somewhat absurd levels of caution are advised. A more detailed risk framework is something we can certainly discuss among the team, and that will take additional time and effort to produce. In this case, reasonable measures within historical precedent  and the team mandate were taken to mitigate inherent risks in system modification. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.582334332334332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#7",
                    "likes": "0",
                    "time": "22/11/2021-06:58:29",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}