{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-to-improve-mip14-protocol-dai-transfer/3427",
            "title": "Informal Poll To Improve MIP14: Protocol DAI Transfer ",
            "index": 3427,
            "category": [
                "Governance"
            ],
            "tags": [
                "community",
                "mips",
                "mip-14",
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#1",
                    "likes": "6",
                    "time": "28/07/2020-21:29:38",
                    "content": "Background: MIP 14: Protocol DAI Transfer failed to be included in June’s monthly governance vote Yes 1,099.28 No 16,257.72 We do not have great insight to why our MKR overlords did not support this MIP. However, we have the power of speculation at our disposal!  I’ve prepared a non-exhaustive list of possible reasons the MIP was not supported. Hopefully using this informal poll, we can identify areas of the MIP that can be modified/improved. Feel free to expand upon these ideas. The goal is to keep this poll open for two weeks and use the data to revise MIP 14 for the September or October governance cycle.     Voters were worried about MKR dilution via the potential to cause flops Low voter turnout, would have passed with more awareness Voters were worried about sending DAI to an external address not controlled by Maker Governance (would prefer to have funds move from the protocol to a governance-controlled address (eg cash account) before final dispersal) Voters did not believe the protocol needed the ability to transfer DAI Voters wanted to see a fund management structure in place before approving MIP14 (eg adding core personal such as a treasure or accounts domain team) Voters only wanted to use system surplus for DAI transfer Abstain/Show Vote     0 voters     ",
                    "links": [],
                    "GPT-summary": "The author of MIP14 is asking for feedback on why the proposal failed to be included in June's monthly governance vote. The author has prepared a list of possible reasons and is conducting an informal poll to identify areas of the MIP that can be modified or improved. The post also invites voters to expand upon the ideas presented and keep the poll open for two weeks to revise MIP 14 for the September or October governance cycle.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.538461538461538
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/07/2020-21:57:11",
                    "content": "aren’t the dilution option and the stability buffer option more or less the same objection? Potential other reason could be that people don’t want to increase spending with protocol revenue being what it is. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#3",
                    "likes": "0",
                    "time": "28/07/2020-22:15:43",
                    "content": "Yeah, it looks like it reads that way.  My intent for “only spend surplus” was aiming at - whatever the surplus is, that is our our MAX budget… which is still maybe the same as the MKR dilution question, but from a different perspective ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/07/2020-01:18:27",
                    "content": "This seems like an inevitable MIP and it’s important to develop the guidelines and precedents for this to proceed. Is there a process developed for determining when a DAI Transfer is eligible to take place? Does that need to be included in this MIP to safeguard peoples worries about MKR dilution? I think this is a great idea but would love to see more detail on exactly when a DAI Transfer can take place. I guess these concerns would fall under “fund management” and “MKR dilution”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#5",
                    "likes": "2",
                    "time": "29/07/2020-01:45:29",
                    "content": "We may use it for a variety of purposes. Mkr holders will still have to vote on every dai transfer, this is just creating a process, specs for delay time, etc ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#6",
                    "likes": "0",
                    "time": "29/07/2020-02:01:47",
                    "content": "Yea, so not sure why it wouldn’t pass a second go around then. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "3",
                    "time": "30/07/2020-15:48:04",
                    "content": "The two issues I heard were:  We don’t want this to execute if it ends up causing the system to sell MKR to raise DAI.  (i.e. limit it to only taking from surplus if the surplus is positive Where does the DAI go and who controls it?  We come right back down to a few issues.  Primary Surplus limit now is 500K.   Do we really want to take DAI and buy MKR rather than just transfer it out into a secondary surplus account.  Personally I really don’t like buying MKR at high prices only to mint and dilute it at low ones.   Maker needs to set a MKR price floor for when it will use DAI to buy MKR, and consider selling MKR when the price is high (though this will ofc be a huge debate whether the system should at all market make in MKR - personally I think it is critical for the system to also be a MKR liquidity player along with being a DAI liquidity player) A secondary surplus fund that doesn’t just have DAI, but ideally has other liquid assets so the system doesn’t hoard DAI reducing DAI liquidity. How does the system/governance manage a secondary surplus fund? How large should a secondary surplus fund be? What would the system use a secondary surplus fund for?  So rather than getting all wound up in how we transfer DAI from the primary surplus into a secondary surplus perhaps we should just get past this and talk about the creation of a secondary surplus fund and the details not just the size and character of it from a portfolio management standpoint, but also a how/who will manage such a fund. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1235719261581325
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#8",
                    "likes": "2",
                    "time": "30/07/2020-16:41:58",
                    "content": "What about using the surplus to buy MKR and open an 80-99/20-1 MKR/DAI pool. That way it doesn’t have to be actively managed, it receives liquidity fees and helps with MKR price/adoption. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#9",
                    "likes": "1",
                    "time": "30/07/2020-17:34:10",
                    "content": "    Aaron_Bartsch:  What about using the surplus to buy MKR and open an 80-99/20-1 MKR/DAI pool. That way it doesn’t have to be actively managed, it receives liquidity fees and helps with MKR price/adoption.   One of a great many possible ideas.   My point here is that we are focused on transfering DAI, I think MKR holders were like - tranfer it to where, when, why, and who does what with it. Literally this is one of the many longer term planning issues that really need to be discussed in the contest of a greater vision for what Maker could/should look like in 1, 5, 20 years kind of thing. We are staring at leaves in a forest of problems and not at all looking at the tree much less the forest here.   Inherently one can choose to deal with problems in a re-active mode or try to be pro-active and look at the issues from a larger perspective of greater long term goals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#10",
                    "likes": "2",
                    "time": "30/07/2020-20:03:06",
                    "content": "    MakerMan:  MKR holders were like - tranfer it to where, when, why, and who does what with it   The more I think about it, the more I agree that a secondary fund would be a nice workaround for some of the issues of taking directly from the surplus.  We could siphon DAI from the surplus as available to ensure it would not lead to a flop The budget wouldn’t be constrained by the amount in the surplus, just the amount in the secondary account, which would be more reliable We could set ceilings on the secondary account to provide MKR holders comfort/security  I think the hope for MIPs in general is that they encompass a single task.  So for this one, the procedure to take DAI from protocol.  I think the “why and who does what with it” will have to be answered by another MIP or by the on-boarding of new core personnel (does this NEED to be done in concert with passing MIP14?). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.756222943722944
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#11",
                    "likes": "3",
                    "time": "11/08/2020-23:04:28",
                    "content": "Poll is closed! It looks like the only option that got 50%+ vote is that MKR voters did not want dilution.  After chatting with @LongForWisdom I learned that the way the smart contract is written, it will be up to the social/governance layer to ensure any DAI taken from the surplus does not cause a flop. Next steps: I’m going to go through the MIP to see if any language updates could help make it clear how to prevent flops while requesting DAI transfers ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.189285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#12",
                    "likes": "3",
                    "time": "12/08/2020-04:41:13",
                    "content": "    Jtathmann:  It looks like the only option that got 50%+ vote is that MKR voters did not want dilution. After chatting with @LongForWisdom I learned that the way the smart contract is written, it will be up to the social/governance layer to ensure any DAI taken from the surplus does not cause a flop.   Yeah having that as a constraint on how much could be moved out of the surplus with MIP14 probably would assure its passage through governance. I think there is a real question about what the protocol should do when it needs cash but doesn’t have any to pay for something important but that could and probably should be addressed by another MIP. Regarding the what to do or how to manage a secondary surplus agree completely that probably is another MIP or a MIPset relating to secondary surplus management.   But for now we have to take baby steps MIP14 as a way to remove DAI from surplus and put it ‘somewhere else’ is a completely necessary first step to fund decentralized operations.   Without it Maker is dead or will need something like the Foundation forever and if I understand @rune right this simply isn’t happening so we have to have something like MIP14 soon so we can move on to how to manage the secondary fund and then the harder part who gets to disburse funds, when, why for what! Now that I look back at the poll on this 43% came up with issues about who has control over the fund so it might be that MIP14 may also need a few other MIPs to pass as a set or some subsections?!   What I am annoyed about is we didn’t get enough participation on this. Looks like I didn’t get to vote but will weigh in publicly.   I definitely don’t want flops.  If we are going to use MKR to buy stuff it shouldn’t be DAI. I really would like to have thought about the fund management structure,  personally I would like to see a team put into place for this that has pretty clear guidelines in place via governance but I think we are going to need a treasury or accounts domain team with some multisig type approach and quality assurance checks, with rewards for good work, so that govenance can and does in the end put their ‘grade’ on what the treasury/accounts team did.   Personally it would be interesting to see governance weigh in on individual account/treasury actions with a grade but think it would be expensive tx wise unless we can roll it all up and I also think if we fine grain this it will lead to voter exhaustion to click buttons for every little detail of operations to grade it. So I want to see MIP14 have a mechanism about surplus transfers not initiating MKR flops, and another MIP to talk about how we are going to manage the surplus.   Put simply I am against governance micromanaging everything as I think in the long run it will not be practical, but I would also have concerns over single individuals having sole control over the Maker Treasury.  I really like triad approaches where say 2 of 3 have to sign off or 3 of 5.   Who those are or how they are appointed and what their responsibilities and authorities are is a whole diff matter but I think to pass MIP14 we need another MIPz in relation to who and how the treasury is managed as well as the size of such a treasury. ",
                    "links": [
                        "https://forum.makerdao.com/t/poll-creation-of-a-makerdao-strategic-reserves-solving-the-peg/3638/11"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.265811011904762
                }
            ]
        }
    ]
}