{
    "poll_list": [
        {
            "title": "Ratification Poll for Modify Core Unit Budget, COM-001 (MIP40c3-SP40) - November 8, 2021",
            "index": "10756",
            "option": "Yes",
            "supporting_mkr": "71,960",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp40-modify-core-unit-budget-com-001/10756",
            "title": "MIP40c3-SP40: Modify Core Unit Budget, COM-001 ",
            "index": 10756,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "com-001",
                "core-unit-budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#1",
                    "likes": "5",
                    "time": "05/10/2021-15:04:16",
                    "content": " MIP40c3-SP40: Modify Core Unit Budget, COM-001  Preamble MIP40c3-SP#: 40 Author(s): David Utrobin Contributors: Tags: core-unit, cu-com-001, budget, dai-budget Status: Accepted Date Applied: 2021-10-05 Date Ratified: 2021-11-22   Sentence Summary MIP40c3-SP40 modifies the budget for Core Unit COM-001 and extends it through June 2022.  Paragraph Summary This budget modification adjusts the team’s budget figures, extends our funding through to the end of 06/22, and updates the budget implementation to accurately reflect the current setup. The annual budget figure has changed from $486,000 to $515,000. A vote to ratify this MIP means MKR holders agree to allow:  Continued funding through to the end of Q2 2022(June 2022.) Updated figures for the funding + Stream adjustments  Primary changes:   Travel figures updated: More accurately reflects expenses by assuming one team-wide offsite for three people, and coverage for two people to attend up to three events per year.  Salary line item updated: More accurate.  Hourly Compensation item updated: More accurate.  Operating Expenses item updated: More accurate.      Description Annual (SP8) Annual (This SP) Change     Salaries (3 FTE) $ 280,000.00 $ 285,000.00 $ 5,000.00   Hourly Compensation (~1 FTE) $ 40,000.00 $ 45,000.00 $ 5,000.00   Healthcare $ 43,200.00 $ 43,200.00 $ -   Sign-on Expenses $ 1,800.00 $ 1,800.00 $ -   Travel & Events $ 10,000.00 $ 32,000.00 $ 22,000.00   Operating Expenses $ 11,000.00 $ 8,000.00 $ (3,000.00)   Professional Services $ 50,000.00 $ 50,000.00 $ -   Contingency Buffer $ 50,000.00 $ 50,000.00 $ -         Total $ 486,000.00 $ 515,000.00 $ 29,000.00    What we are not changing:   3-month runway reserve, held in a protocol-owned multi-sig: We will not be updating the number here since the change is less than 10k and our standing agreement is to update this once per year.  Commitment for a team MKR compensation package: To be released soon.   Specification  Motivation Updating remuneration for the Governance Communications Core Unit and extending our funding for the next 6 months past our original agreement that funds us through to the end of Q4 2021.  Core Unit ID ID: COM-001  Budget Implementation  Smart Contract Implementation  Actionable Changes Former stream will be supplemented by a new stream; New stream will be created with a total of 12,241.67 DAI streamed to 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9 starting 2021-12-01 and ending 2021-12-31 New stream will be created with a total of 257,500.02 DAI streamed to 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9 starting 2022-01-01 and ending 2022-06-30  Information Governance Communications Operational multi-sig: 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9  Implementation: Distribution to the Core Unit multi-sig will be executed by a DssVest Dai stream. Ownership: This multi-sig is 1 of 1, with additional signers to be added as needed. Frequency: Protocol distributions to the multi-sig will occur continuously.  Governance Communications Continuous Operation multi-sig: 0x99E1696A680c0D9f426Be20400E468089E7FDB0f  Implementation: This multi-sig was already funded in full upon successful onboarding of the Governance Communications Core Unit. Access: In order for funds to be accessed from this multi-sig, the Maker protocol must be in a state where it is unable to pay team salaries due to protocol error, shutdown and/or under governance attack. Ownership: The Continuous Operation multi-sig will require 3 of 6 signatures from the following keyholders. This may be expanded to other critical Core Units as they are formed:  DavidUtro (COM-001): 0xE91f4F5834bB9312A45B2bd75804b32CC3DA8fd3 LongForWisdom (GOV-001) : 0x66f40F044E0e2F77bB746e3275E82e88dCBA2D69 Primoz (RISK-001): 0x5d67d5B1fC7EF4bfF31967bE2D2d7b9323c1521c SebVentures (RWF-001): 0x0D61C8b6CA9669A36F351De3AE335e9689dd9C5b Brian McMichael (PE-001): 0xC0dE1AB51082442f821bA273273B4F7d32521D8b Nik Kunkel (ORA-001): 0xB4CFf22c0d5a015460Fd503a9328Bf00a24f686c     Continuous Operation To ensure 3 months of continuous operation in the event of emergency shutdown or protocol issues, we have been granted an upfront lump-sum of 3 months of runway to sit in a protocol owned multi-sig.  Calculation Use initial annual budget figure (from MIP40c3-SP8) divided by 4 to determine the 3-month runway sum: 121,500 DAI → MIP40c3-SP40-based figure: 128,750 DAI Detail:  NO CURRENT CHANGE REQUESTED. The lump-sum will be held outside of the surplus buffer in a protocol owned multi-sig. If normal protocol operation is not possible due to emergency shutdown or other protocol failure, these funds will be used to ensure continuous operation as the system gets back up and running. At the conclusion of the year, the lump sum will remain in the multi-sig for the following year and may be increased or decreased at that point in time due to changes in the projected budget.   Monthly Budget Statement Within the first 7 days of each month, COM-001 will submit Monthly Budget Statements with the following sections:   The Budget Forecast, based on the latest available information, of the budget (in DAI) that is required to maintain a 3-month runway for the team.  The Last Month Actuals, i.e., the actual expenses (DAI and MKR) of the month that just ended, this includes reporting any surplus or deficit.  The MKR Vesting Overview: This is a schedule that has the expected MKR vesting amounts for the current team configuration, grouped by the pay-out month.  Transaction Amounts: The required DAI amount to replenish the 3-month runway.  The Monthly Budget Statements will be added to the team drive. They will also be posted in this git repository on Github. Note: Due to a delay in the administrative setup of the team, we will begin posting these in October/November and will retroactively post actuals from the team’s start date of August 2nd 2021.  Budget Breakdown Please Note, August 2021 was our first month of operation, and so Q3 2021 is one month short by its figures. Please use the approximate monthly figure and annual figures to see the difference. View our public team budget sheet for the same breakdown below.     Description Annual (SP8) Q3 2021 Annual (Current SP) Q4 2021 Q1 2022 Q2 2022     Salaries (3 FTE) $ 280,000.00 $ 46,666.66 $ 285,000.00 $ 71,250.00 $ 71,250.00 $ 71,250.00   Hourly Compensation (~1 FTE) $ 40,000.00 $ 6,666.66 $ 45,000.00 $ 11,250.00 $ 11,250.00 $ 11,250.00   Healthcare $ 43,200.00 $ 7,200.00 $ 43,200.00 $ 10,800.00 $ 10,800.00 $ 10,800.00   Sign-on Expenses $ 1,800.00 $ 1,800.00 $ 1,800.00 $ - $ 450.00 $ 450.00   Travel & Events $ 10,000.00 $ 1,666.68 $ 32,000.00 $ 8,000.00 $ 8,000.00 $ 8,000.00   Operating Expenses $ 11,000.00 $ 1,833.34 $ 8,000.00 $ 2,000.00 $ 2,000.00 $ 2,000.00   Professional Services $ 50,000.00 $ 8,333.33 $ 50,000.00 $ 12,500.00 $ 12,500.00 $ 12,500.00   Contingency Buffer $ 50,000.00 $ 8,333.33 $ 50,000.00 $ 12,500.00 $ 12,500.00 $ 12,500.00            Total $ 486,000.00 $ 82,500.00 $ 515,000.00 $ 128,300.00 $ 128,750.00 $ 128,750.00   Approximate Per month $ 40,500.00  $ 42,916.67        Details Providing additional detail with regards to the above line items; Salaries: The current team has 1 full-time Facilitator and 2 full-time Project Managers. Hourly Compensation: The team also consists of multiple part-time contributors, who will be compensated on an hourly basis. These are roles that require less than 25hrs per week. Healthcare: In order to align with traditional company offerings, this proposal includes a healthcare supplement averaging $1250 p/month for full-time employees. Sign-on Expenses: Provided at the discretion of the Facilitator to attract top talent to the team. Travel & Events: Team members may travel to present at industry events, participate in team or larger MakerDAO offsites. Assumes one team-wide offsite for three people, and coverage for two people to attend up to three events per year. Operating Expenses: Coverage for managing general operational overhead; includes transaction gas costs, software subscriptions, and other miscellaneous costs. Professional Services: Payroll and accounting costs, as well as potential legal services if needed. Contingency Buffer: Approximately 10% of budgeted costs in the event that we underestimated our current budget. Unincluded items that may end up being an expense are covered by the Contingency Buffer and will be added to an updated budget in the future, if such items exist.  MKR Vesting The Governance Communications Team will add some version of MKR vesting for its team members, retroactively dated to the first day of their employment. Instead of offering our own unique proposal now, we will wait for the community to come to consensus around how Core Units should set this up. We support the formation of an overarching MKR Vesting framework that all Core Units can follow. ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP40/MIP40c3-Subproposals/MIP40c3-SP8.md",
                        "https://drive.google.com/drive/u/0/folders/1GBAeTx4jmob7wRs7_LK32Bh_Y-pHzPvV",
                        "https://github.com/MakerDAO-Governance-Communications-CU/transparency-reporting",
                        "https://docs.google.com/spreadsheets/d/1H41VHDwZDlF9CSAlbR-u5NBUhp1qwTcaSGNkYB5C5bI/edit?usp=sharing",
                        "https://forum.makerdao.com/t/govcomms-bi-weekly-update-oct-15-29/11301",
                        "https://forum.makerdao.com/t/under-construction/12274/7",
                        "https://forum.makerdao.com/t/weekly-mips-update-58/11074",
                        "https://forum.makerdao.com/t/govcomms-bi-weekly-update-oct-01-15/11070",
                        "https://forum.makerdao.com/t/weekly-mips-update-57/10921",
                        "https://forum.makerdao.com/t/weekly-mips-update-59/11186",
                        "https://forum.makerdao.com/t/signal-request-one-time-payment-to-com-001-to-cover-missing-dssvest-funds/11685",
                        "https://forum.makerdao.com/t/maker-governance-review-november-2021/12000",
                        "https://forum.makerdao.com/t/govcomms-bi-weekly-update-nov-15-26/11877",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/10",
                        "https://forum.makerdao.com/t/mip40c3-sp8-modify-core-unit-budget-com-001/7010/29",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/govcomms-bi-weekly-update-oct-30-nov-12/11604",
                        "https://forum.makerdao.com/t/weekly-mips-update-60/11347"
                    ],
                    "GPT-summary": "The post is a proposal to modify the budget for Core Unit COM-001 and extend it through June 2022. The proposal adjusts the team's budget figures, extends funding, and updates the budget implementation to accurately reflect the current setup. The post also includes a breakdown of the budget and information on the team's multi-sig and vesting plans. There is no negative feedback or criticism of the proposal, and no advertising or questions about it.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.377879560915275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "1",
                    "time": "05/10/2021-15:17:52",
                    "content": "@MIP-Editors please advise on SP#  edits incoming in light of recent GovAlpha post     Core Unit Budget Implementation Standardization Core Units       This post is mainly aimed towards existing and new Core Units, if you aren’t writing CU budgets, you can safely ignore it.  TLDR:   Figuring out executive contents with respect to CU budgets has become annoyingly time-consuming for GovAlpha. Further, the lack of clarity in budget proposals hurts transparency. There are new requirements for the formatting of budget implementations detailed below, if you do not follow these, your proposal will not be put up for vote. We are no longer taking respon…      Edits complete  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5196969696969695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "0",
                    "time": "05/10/2021-16:08:13",
                    "content": "Our proposal involves ending our current stream 1 month early, let me know if there is any issue or nuanced consideration for that request. @GovAlpha-Core-Unit ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "05/10/2021-16:32:57",
                    "content": "It’s a good example of an annoying exception that makes our lives harder heh. Better to check with PE. Feels like it would be easier to just set the new stream amount to be less the extra amount from the old stream. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None",
                        "3rd party giving constructive criticism of proposal",
                        "None"
                    ],
                    "Sentiment": 5.2310606060606055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "0",
                    "time": "05/10/2021-16:55:14",
                    "content": "Yes, I know trying to remedy it with a non-annoying solution. What about this; Instead of discontinuing the old stream we can do two streams   Our proposed stream minus one month New stream will be created with a total of 257,500.02 DAI streamed to 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9 starting 2022-01-01 and ending 2022-06-30   A one-month stream for the difference New stream will be created with a total of 12,241.67 DAI streamed to 0x1eE3ECa7aEF17D1e74eD7C447CcBA61aC76aDbA9 starting 2021-12-01 and ending 2021-12-31   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.170454545454546
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "0",
                    "time": "08/10/2021-21:11:21",
                    "content": "Can you provide a little background on these travel expenses generally, and why the large increase specifically? Are there specific events that GovComms needs to go to as part of its mandate? It just seems like a large amount for a CU focused on internal communication. Did GovComms go over budget traveling last budget period and revise upwards? Thanks! CC: @Aes ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.338169642857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#7",
                    "likes": "1",
                    "time": "09/10/2021-16:37:31",
                    "content": "    PaperImperium:  Can you provide a little background on these travel expenses generally, and why the large increase specifically?   Hi Paper, sure! Our original budget took into consideration the fact that we only had two full-time people and would probably only be participating in one in-person event during the first ~5 months of operations (Aug-Jan). I needed the funds for travel($5k) and for some ability to sponsor events and stakeholder dinners(5k)–hence, 10k. This modification accounts for a third full-time hire, @thomas.flitter, Engagement Lead, who will soon be the appropriate person to send to events with high concentrations of existing MakerDAO stakeholders. Additionally, the travel increase accounts for at least one team-wide off-site per year that I did not intend to do for 2021 and so did not include it in our budget.      PaperImperium:  Are there specific events that GovComms needs to go to as part of its mandate? It just seems like a large amount for a CU focused on internal communication.   Our budget item for travel on our previous proposal states,  Travel & Events : Team members may travel to present at industry events, participate in team or larger MakerDAO offsite.  Our team is focused on more than internal communications. We are also mandated to perform Stakeholder Relations activities that involve external stakeholders, concerning their access needs to information coming out of Maker. I think an important part of building an impactful stakeholder relations arm is being present at events with high stakeholder participation. We use these opportunities to form better bonds, understandings, and relations with these groups. Similarly, team/cross-team/org-wide off-sites are a valuable practice for forming better relationships and understandings of the people we work with while also sprinting on cross-functional initiatives or research. It’s especially important for full-remote orgs to do these at some level. Additionally, as we perform our job to improve stakeholder experience(SX) at MakerDAO, we should also be using this opportunity to speak publicly at (varying levels of internal->external)events about a variety of different things; the importance of stakeholder experience & relations, the challenges we face, the standards we hope emerge, best practices, etc. Maker needs to be a leader here if we want to accelerate the growth of our network effects. The benefit of doing this justifies the modest increase. Each trip is unique and so we will be documenting our purpose, activities, and expenditures for each.  Did GovComms go over budget traveling last budget period and revise upwards?  Nope. In fact, we are under budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.892559523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#8",
                    "likes": "0",
                    "time": "09/10/2021-17:15:07",
                    "content": "    Davidutro:  I needed the funds for travel($5k) and for some ability to sponsor events and stakeholder dinners(5k)–hence, 10k.   Can you refresh my memory about which events and what stakeholder dinners? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#9",
                    "likes": "1",
                    "time": "09/10/2021-18:09:42",
                    "content": "MakerDAO side-events primarily. So if multiple teams are involved we want the budget to contribute or to cover such gatherings. One example of this might have been the recent side-event held in Paris. We would also like to be able to proportionally contribute to the cost of a larger organization-wide off-site when the time comes. I assume this may happen at some point in 2022. As for Stakeholder dinners; I see two acceptable formats. One is the targeted dinner with a specific person to discuss a specific thing–our team would cover those. The other is a larger dinner with broader attendance usually once per trip and usually for MakerDAO personnel with some flexibility to invite other key stakeholders like integration partners, collateral partners, etc… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.903846153846153
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#10",
                    "likes": "2",
                    "time": "13/10/2021-00:03:12",
                    "content": "After looking at several CU budgets recently – I have been remiss in not getting around to it earlier – I wonder if we might want to find some resources for facilitators on just some of the nuts and bolts of running a small business. I think I in particular have taken it for granted that this is experience everyone has, and there are just some best practices around the edges of many budgets that would be good habits to build. No one starts a business to build budgets — they do it to work in their core competency, which is what needs to use the budget. Example: I’m wondering why we need to include a contingency buffer when there are 121.5k DAI in your 3-month emergency fund, and 42.2k undrawn-but-accrued DAI in the GovComm stream right now. Presumably there is also at least some cash in a CU bank account somewhere as well. Are you anticipating some large expenses between now and the end of the quarter? It seems like an easy 12.5k DAI to save each month just from the Contingency Buffer line item since cash is piling up. No need to build that to the sky. Budget forecasting is hard. I and others should make more of an effort to help lend fresh sets of eyes to these. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.086111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#11",
                    "likes": "3",
                    "time": "13/10/2021-13:59:49",
                    "content": "    PaperImperium:  I’m wondering why we need to include a contingency buffer when there are 121.5k DAI in your 3-month emergency fund, and 42.2k undrawn-but-accrued DAI in the GovComm stream right now.   The continuous operations multisig is for the event of a longer delay in funding and represents a 3-month runway; This is fin the event of Emergency Shutdown or other protocol issues. The contingency buffer, on the other hand, is for giving us a buffer on our actual operating expenses. This way if we go over-budget we have coverage and can adjust our budget accordingly.     PaperImperium:  42.2k undrawn-but-accrued DAI in the GovComm stream right now. Presumably there is also at least some cash in a CU bank account somewhere as well.   Yup, we need to draw and send that over to AccountAble. And yes, we still have an existing cash balance with AccountAble as well.     PaperImperium:  Are you anticipating some large expenses between now and the end of the quarter? It seems like an easy 12.5k DAI to save each month just from the Contingency Buffer line item since cash is piling up. No need to build that to the sky.   No, we don’t anticipate any large unexpected spending through to the end of the new year. Keep in mind any excess cash we have will be returned to the protocol and yes once the contingency buffer is built up that will factor into our future requested stream.     PaperImperium:  Budget forecasting is hard. I and others should make more of an effort to help lend fresh sets of eyes to these.   Yes please  I think having eyes on budgets is very important. Thank you for keeping us accountable. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.67125946969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#12",
                    "likes": "1",
                    "time": "27/10/2021-19:50:10",
                    "content": "The contents of this proposal are now frozen to honor the 1-week mandatory freeze period for proposals going to Formal Submission. No changes have been made since earlier in the month. We intend to put this to formal submission on Monday for the November cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#13",
                    "likes": "1",
                    "time": "01/11/2021-13:49:45",
                    "content": "Formally Submitting MIP40c3-SP40 to the November governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#14",
                    "likes": "1",
                    "time": "01/11/2021-13:58:15",
                    "content": "^ @blimpa, assuming you’re already aware but just incase  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#15",
                    "likes": "0",
                    "time": "16/11/2021-14:41:14",
                    "content": "Crossposting for visibility/reference     MIP40c3-SP8: Modify Core Unit Budget, COM-001 Archive       Just a heads up, our current stream was accidentally misconfigured through a fault of my own. So we don’t quite get 40,500 per month as expected. But rather 30,750 per month so far.  In fact, in doing our accounting it seems we are running quite close to the wire. Our SP40 proposal fixes the stream(adding a supplemental one) for December but forfeits the lost/unclaimed Dai for the prior 3 months (~30k)  Thankfully the contingency buffer has been just enough to not let this impact our operations(…     ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp40-modify-core-unit-budget-com-001/10756"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.5
                }
            ]
        }
    ],
    "group_index": "175"
}