{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c3-spx-core-unit-offboarding-is-001/19082",
            "title": "MIP39c3-SPX: Core Unit Offboarding (IS-001) ",
            "index": 19082,
            "category": [
                "Maker Improvement Proposals",
                "RFC"
            ],
            "tags": [
                "mips",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#1",
                    "likes": "2",
                    "time": "07/12/2022-20:07:00",
                    "content": " MIP39c3-SPX: Core Unit Offboarding (IS-001)  Preamble MIP39c3-SP#:  Author(s): @rspa, @ultraschuppi, @elprogreso Contributors: Tags: IS-001 Status: RFC Date Proposed: 2022-12-07 Date Ratified: Forum URL: https://forum.makerdao.com/t/mip39c3-spx-core-unit-offboarding-is-001/19082 Ratification Poll URL:   Sentence Summary Offboard the IS-001 Core Unit.  Paragraph Summary We propose an offboarding of the ImmuneFi Core Unit and request the respective core unit to submit one of their own to replace this.  Specification  Motivation The mandate and the budget for the ImmuneFi Core Unit have both been rejected in a recent on-chain poll.  Details This is a placeholder. We will refine this proposal during the RFC period. Our preferred way forward would be to get a counter proposal from the CoreUnit Facilitator, so we can ditch this one and not submit it formally. The authors reserve the right not to submit this proposal formally if an adequate response is forthcoming. The proposal should include how the core unit plans to:  Transfer intangible MakerDAO assets (access to DAO-claimable platforms, e-mail accounts, websites, etc.) back into the DAO. Documenting and delegating the activities previously carried out by the unwinding Core Unit that impact the DAO. To the extent that this is reasonable and possible, provide enough detail so that other Core Units can pick up these activities. Settling outstanding debts both to contributors and external actors/services. Returning unused funds.   Summary of the reason for offboarding The last budget proposal has been rejected; it is time to close the chapter of this Core Unit.  Explicit deliverables and responsibilities TBD  Implicit deliverables and responsibilities TBD  Examples of unfulfilled deliverables and responsibilities: TBD  Core Unit Unwinding – Work TBD  Core Unit Unwinding – Funds TBD  Possible remedy to avoid offboarding TBD  Core Unit ID IS-001 @Core-Facilitators please chime in if you have a stake in this proposal. ",
                    "links": [],
                    "GPT-summary": "The post is a proposal to offboard the ImmuneFi Core Unit and replace it with a new one. The proposal explains the motivation behind the offboarding and the details of the process. The post also invites feedback and collaboration from the CoreUnit Facilitator and other stakeholders.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.542460317460317
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/12/2022-20:09:10",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal MIP39c3-SPX: Core Unit Offboarding (IS-001) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TravinImmunefi",
                    "index": "#3",
                    "likes": "4",
                    "time": "12/01/2023-23:30:48",
                    "content": "Hi Rspa, Though the budget for IS-001 has been rejected, there is currently an exploration for bridge funding for Joshua’s role as deputy facilitator as we transition into being an Ecosystem Actor. As our core unit has been minimized to just the bug bounty program at this point, I’ve been in coordination with the steward core units with regards to making sure the transition to Ecosystem Actor is done with minimal negative impact to the bug bounty program management. One of the things we’re working with them on is with regards to proper staffing for triaging bug reports within or among their respective core units. I can confirm as well that during this time the core unit itself beyond Joshua’s activity can continue to operate without the allocated budget as it is in the interest of Immunefi itself to make sure that the bug bounty program of MakerDAO is properly maintained and we will continue to work with the steward core units to keep the bug bounty program operational with no, or at the very least, minimal downtime. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.055
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#4",
                    "likes": "2",
                    "time": "16/01/2023-21:07:23",
                    "content": "Thanks a lot for pointing that out. That’s good to hear! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#5",
                    "likes": "0",
                    "time": "17/01/2023-02:19:48",
                    "content": "Thanks for sharing this but if this is the case, shouldn’t governance reject the current budget request to extend to May from Joshua? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#6",
                    "likes": "3",
                    "time": "17/01/2023-04:36:25",
                    "content": "    Doo_StableLab:  shouldn’t governance reject the current budget request to extend to May from Joshua?   Oh, I think you might be misinterpreting what Travis wrote,     TravinImmunefi:  I can confirm as well that during this time the core unit itself beyond Joshua’s activity can continue to operate without the allocated budget   What Travin meant is that ISCU has continued operation in anticipation of the bridge funding being approved. If the bridge funding is rejected then ISCU will immediately cease to function, the bug bounty program will be adrift, and I will have done about 6-7 weeks of unpaid labor. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#7",
                    "likes": "0",
                    "time": "17/01/2023-06:47:19",
                    "content": "Ah ok, thanks for clarification ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TravinImmunefi",
                    "index": "#8",
                    "likes": "1",
                    "time": "18/01/2023-09:38:57",
                    "content": "    psychonaut:  Oh, I think you might be misinterpreting what Travis wrote,   I might have a problem with the bolded part though… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip39c3-spx-core-unit-offboarding-sas-001/19083",
            "title": "MIP39c3-SPX: Core Unit Offboarding (SAS-001) ",
            "index": 19083,
            "category": [
                "Maker Improvement Proposals",
                "RFC"
            ],
            "tags": [
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#1",
                    "likes": "2",
                    "time": "07/12/2022-20:08:58",
                    "content": " Preamble MIP39c3-SP#: Author(s): @rspa, @gfxlabs, @ultraschuppi, @elprogreso Contributors: Tags: SAS-001 Status: RFC Date Proposed: 2022-12-07 Date Ratified: Forum URL:   Sentence Summary  Specification  Motivation The budget for the Sidestream Auction Core Unit has been rejected in a recent on-chain poll.  Details This is a placeholder, we will refine this proposal during the RFC period. Our preferred way forward would be to get a counter proposal from the CoreUnit Facilitator, so we can ditch this one and not submit it formally. The authors reserve the right not to submit this proposal formally if an adequate response is forthcoming. The proposal should include how the core unit plans to:  Transfer intangible MakerDAO assets (access to DAO-claimable platforms, e-mail accounts, websites, etc.) back into the DAO. Documenting and delegating the activities previously carried out by the unwinding Core Unit that impact the DAO. To the extent that this is reasonable and possible, provide enough detail so that other Core Units can pick up these activities. Settling outstanding debts both to contributors and external actors/services. Returning unused funds.   Summary of the reasons for offboarding The last budget proposal has been rejected, it is time to close the chapter of this Core Unit.  Explicit deliverables and responsibilities TBD  Implicit deliverables and responsibilities TBD  Examples of unfulfilled deliverables and responsibilities: TBD  Core Unit Unwinding – Work TBD  Core Unit Unwinding – Funds TBD  Possible remedy to avoid offboarding TBD Core Unit ID SAS-001 @Core-Facilitators please chime in if you have a stake in this proposal. ",
                    "links": [
                        "https://forum.makerdao.com/t/request-to-poll-sas-spending-permission/19107",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/35"
                    ],
                    "GPT-summary": "The post is a proposal for offboarding a Core Unit in MakerDAO due to the rejection of its budget proposal. The authors explain the details of the proposal and their preferred way forward. They also list the deliverables and responsibilities for the offboarding process. The post invites feedback and collaboration from the CoreUnit Facilitator and other parties.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.39514652014652
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/12/2022-20:09:20",
                    "content": "This post has been reserved for GovAlpha’s proposal summary on proposal MIP39c3-SPX: Core Unit Offboarding (SAS-001) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "09/03/2023-02:10:05",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2004"
}