{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-increase-psm-dc-and-set-debt-ceiling-for-usdc-a-b-to-0/6692",
            "title": "[Signal Request] Increase PSM-DC and set Debt Ceiling for USDC-A/B to 0 ",
            "index": 6692,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "psm-usdc-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "3",
                    "time": "22/02/2021-19:59:18",
                    "content": " Overview In the executive passed on January 25, the USDC-PSM was configured for slowly lerping to 500 MM over 12 weeks (~1/3 of it passed by now). A good portion of the DAI-from-USDC has been sucked up by it, about 130 MM DAI has been generated from it already  While the PSM has already generated >100k DAI in fees since it got deployed, we do not make any fees by the USDC-A vaults as we have the stability fee at 0%. I think it is about time to make the next step.  Increase PSM-DC and set Debt Ceiling for USDC-A/B to 0 I want to propose that - as we now know that the PSM got adopted (e.g. 1inch has it) - we should  set the DC for USDC-A and USDC-B to 0 stop the lerp to 500M and instead set a new debt ceiling for PSM-USDC  I am aware that there was already a Signal about setting the DC to 0 and there is already a onchain-poll following that - but I have doubts that it passes (and even if it does, it does not conflict with this Signal). If we follow this proposal, we can later think about PSM flip all the existing USDC-vaults to the PSM - but this is future talk and not subject of this Signal Request. Pros:  we generate some fees again  Cons:  USDC-arbitrageurs are forced to use the PSM and cannot mint free DAI   Support for this idea? Please signal if you like this idea or not     Yes - good idea, let’s do it No - bad idea or bad timing Abstain     0 voters      How high should we set the new DC for PSM-USDC? I added some options higher than the current state. Right now we have ~450MM DAI-from-USDC, with a DC of ~750MM - might be a good moment to adjust to the current situation  Please vote for all options you would support in an onchain poll     2000 MM (+1500 MM) 1500 MM (+1000 MM) 1000 MM (+500 MM) 750 MM  (+250 MM) 500 MM (current setting after final lerp) Abstain     0 voters      Next Steps The Poll will run until 2021-03-04T14:00:00Z; its outcome will  result in a on-chain-poll assuming the outcome of the poll deems it necessary. ",
                    "links": [
                        "https://makerburn.com/#/collateral/psm_usdc",
                        "https://twitter.com/1inchExchange/status/1349058704663076864",
                        "https://forum.makerdao.com/t/turn-stablecoins-dc-to-0/6432",
                        "https://vote.makerdao.com/polling/QmfDb77D?network=mainnet#poll-detail",
                        "https://github.com/BellwoodStudios/dss-psm/pull/4/files",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/turn-stablecoins-dc-to-0/6432/14",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/pax-vault-dc-change/7540/5",
                        "https://forum.makerdao.com/t/urgent-executive-psm-usdc-a-usdc-a-dc-changes-1st-march-2021/6794"
                    ],
                    "GPT-summary": "The author proposes to increase PSM-DC and set Debt Ceiling for USDC-A/B to 0. The proposal aims to generate fees again, but it would force USDC-arbitrageurs to use the PSM and cannot mint free DAI. The author explains the proposal and asks for support through a signal. The post also includes a poll for the community to vote on the new DC for PSM-USDC. Some users ask questions and provide constructive criticism, while others express support or abstain.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.404187479187479
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "2",
                    "time": "22/02/2021-20:36:19",
                    "content": "I’d rather have more governance processes than overshoot and add more risk that way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#3",
                    "likes": "5",
                    "time": "22/02/2021-22:23:49",
                    "content": "FWIW I would leave the DC of USDC-B alone and just turn on liquidations there, but that is just a suggestion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#4",
                    "likes": "6",
                    "time": "24/02/2021-17:37:20",
                    "content": "I think it wouldn’t hurt if we increase PSM USDC-A to 1bn instead of “pre-agreed” 500m. It doesn’t increase risks dramatically more since 500m is already a number that could break Maker if something goes terribly wrong with USDC. Considering USDC-A vaults get migrated to PSM-USDC-A (336m) and current utilization of PSM at 182m we might want a higher debt ceiling than 500m. Also, we may want a 20% of DAI debt to be available in mints from stablecoins in DAI liquidity crunch events. This tells me 1bn is a more reasonable number for PSM-USDC-A currently. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#5",
                    "likes": "1",
                    "time": "24/02/2021-19:08:43",
                    "content": "Don’t we want to limit the other stable coin with it. Pax is 100M … We might have user moving to the other vault instead of using usdc. ",
                    "links": [
                        "https://forum.makerdao.com/t/governance-at-a-glance-feb-19-25-2021/6735"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#6",
                    "likes": "3",
                    "time": "24/02/2021-19:26:53",
                    "content": "The initial plan for this was to set up PSM as a replacement for the normal vault-types - for each collateral one by one. a) we don’t have PSM for non-USDC stablecoins b) so far we have seen that PSM is capable of absorbing USDC-A-debt I am more than happy with moving over to the other stablecoins as well, after we did the whole thing for USDC. just setting DC to 0 for something where we don’t have a PSM for makes no sense ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#7",
                    "likes": "1",
                    "time": "24/02/2021-20:22:02",
                    "content": "I totally agree with this proposal: replacing USDC vaults with PSM. However with the PSM we are exposed to “blacklisting” risk. Therefore, I hope we will take measures to reduce our exposure to “blacklisting” risk. As discussed in other threads this can be done in several ways, e.g. by taking some USDC from the PSM and set up a DAI/USDC LP UNIV2 pair, as this moves the “blacklisting” risk from MakerDAO to all Uniswap DAI/USDC LPs users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.791666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#8",
                    "likes": "0",
                    "time": "24/02/2021-20:25:59",
                    "content": "    iammeeoh:  However with the PSM we are exposed to “blacklisting” risk.   how is the blacklisting risk different in PSM compared to normal USDC-A vaults? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#9",
                    "likes": "0",
                    "time": "24/02/2021-20:34:36",
                    "content": "    ultraschuppi:  how is the blacklisting risk different in PSM compared to normal USDC-A vaults?   Please correct me if I am wrong:  The USDC in the PSM is property of MakerDAO. The USDC in a USDC-Vault is property of the user.  So, sure, a regulator could target both types, but they’d have to target two different entities. If MakerDAO was to become “undesired” to the US regulators, for example, it would just take a “PSM blacklist push-button” to kill us. So I think it is of paramount importance to shift this risk somewhere else (like Uniswap). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.15
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#10",
                    "likes": "0",
                    "time": "24/02/2021-20:43:00",
                    "content": "Don’t worry about it, there will be more usdx inside the vault than inside the PSM for a while. I meant reviewing the other stable coins dc to bring it to a normal dc. Assuming that in the absence of usdc vault, the users using usdc to arbitrate will use the other ones instead. Edit: don’t bother with the curve 3p at 600 that gives us 100M before touching the 1.01 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.739583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#11",
                    "likes": "1",
                    "time": "24/02/2021-20:53:50",
                    "content": "    iammeeoh:  Please correct me if I am wrong:  The USDC in the PSM is property of MakerDAO. The USDC in a USDC-Vault is property of the user.    i dont’t have my lawyer with me right now, but i feel there is no difference between the two     iammeeoh:  If MakerDAO was to become “undesired” to the US regulators, for example, it would just take a “PSM blacklist push-button” to kill us.   i think both PSM and all usdc-a vaults are just one single wallet each and the kill button would work the same way in both cases ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.642857142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#12",
                    "likes": "0",
                    "time": "25/02/2021-09:19:25",
                    "content": "    Andy_McCall:  FWIW I would leave the DC of USDC-B alone and just turn on liquidations there, but that is just a suggestion.   i doubt that would work - no keeper is going to bid on a vault with 365 USDC in it. not speaking of any keeper going to take the effort to configure the bot for this collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#13",
                    "likes": "2",
                    "time": "01/03/2021-16:57:48",
                    "content": "Note that this signal request has been included in an urgent out of schedule executive vote as described here. Thank you to all for voting and contributing to the mandate for this out-of-schedule proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/FourthStreet",
                    "index": "#14",
                    "likes": "0",
                    "time": "01/03/2021-18:22:45",
                    "content": "Yes - good idea, let’s do it ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#15",
                    "likes": "3",
                    "time": "03/03/2021-21:34:05",
                    "content": "Hi there, the urgency exec containing  setting PSM-USDC DC to 1B setting USDC-A DC to 0  will get executed tomorrow at 15:16 UTC. The only missing part of this Signal Request was to set the DC for USDC-B to 0 too. I have to admit I am not really convinced that this is a necessary step so I refrain from putting this to an onchain poll: USDC-B has a really high SF and a decent LR and we have  almost no utilization on it, so we are not missing out on any fees and are not putting us into any heavy risk for keeping it. USDC-B was initially meant as a last resort for keepers in case DAI-liquidity is totally down. I am quite sure it is not configured in a really appealing way, but setting DC to 0 is certainly not improving it. cheers, tim ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.237131519274376
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#16",
                    "likes": "0",
                    "time": "03/04/2021-07:34:30",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}