{
    "poll_list": [
        {
            "title": "Short Ratification Poll for Vault Setting Amendment Subproposal (MIP92c5-SP1) - March 13, 2023",
            "index": "19553",
            "option": "No",
            "supporting_mkr": "63,088",
            "highest_fraction": 0.87
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip92c5-sp1-vault-setting-amendment-subproposal/19553",
            "title": "MIP92c5-SP1: Vault Setting Amendment Subproposal ",
            "index": 19553,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "psm",
                "impact-:-high",
                "yearn"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#1",
                    "likes": "3",
                    "time": "26/01/2023-16:18:55",
                    "content": " MIP92c5-SP1: Vault Setting Amendment Subproposal  Preamble MIP92c5-SP#: 1 Author(s): @Doo_StableNode Contributors: Tags: PSM Status: Rejected Date Proposed: 2023-01-27 Date Ratified: Forum URL: https://forum.makerdao.com/t/mip92c5-sp1-vault-setting-amendment-subproposal/19553   Specification This will be explained in the following Proposed Changes and Motivation  Proposed Changes Strategies to Pursue:  Gen Lender: Supplies USDC to AAVE to generate interest. Earned tokens are harvested, sold for more USDC which is deposited back into the strategy. GUNIV3USDC-DAI: Supplies USDC to Maker DAO Peg Stability Module to feelessly get the correct USDC-DAI ratio then it deposits to Arrakis Finance’s Univ3daiusdc Vault 5, which autocompounds a Uniswap v3 DAI-USDC position. Afterwards, it uses this Vault token as collateral at Maker DAO. Flashmints are used to mint DAI from MakerDAO to flashlend and fold the position, boosting the APY. Earned tokens are harvested and sold for more USDC, which is deposited back into the strategy. GenLevComp v3: Supplies and borrows USDC on Compound Finance simultaneously to earn COMP. Flashmints are used to mint DAI from MakerDAO to flashlend and fold the position, boosting the APY. Earned tokens are harvested, sold for more USDC which is deposited back into the strategy.  Deposit Limits: Each of above strategy should have a deposit limit of 1,000,000 PSM USDC. Therefore, in total, 3,000,000 PSM USDC limit.  Motivation As MIP92: Onboard PSM USDC to Yearn to earn Yield noted “A list of investment strategies that the vault might adopt is proposed. Choices of which strategies to pursue, deposit limits, debt ratios, and corresponding risk profiles are controlled by Maker Governance.” Considering MIP92 has passed, we believe that such onboarding should take step by step especially with strategies that the Maker protocol already has exposure to and thus can be understood as more “comfortable” to deploy. And Maker already has exposure to both AAVE, Compound Finance, and Uniswap LP. ",
                    "links": [
                        "https://beta.arrakis.finance/#/vaults/0xAbDDAfB225e10B90D798bB8A886238Fb835e2053",
                        "https://oasis.app/asset/dai#earn",
                        "https://oasis.app/",
                        "https://app.compound.finance/",
                        "https://oasis.app/",
                        "https://forum.makerdao.com/t/weekly-mips-update-129/20172",
                        "https://forum.makerdao.com/t/weekly-mips-update-130/20226",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/128",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/52",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/106",
                        "https://forum.makerdao.com/t/flipside-crypto-delegate-platform/13456/49",
                        "https://forum.makerdao.com/t/london-business-school-delegate-platform/15203/43",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/23",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/67",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/67",
                        "https://forum.makerdao.com/t/coldiron-eth-delegate-platform/11193/172"
                    ],
                    "GPT-summary": "The post is an explanation of a subproposal for MIP92c5-SP1, which proposes changes to the Vault Setting Amendment. The proposal outlines strategies for earning yield and deposit limits for each strategy. The author explains the motivation behind the proposal and references MIP92, which allows Maker Governance to control the choices of strategies to pursue, deposit limits, debt ratios, and corresponding risk profiles. The post also invites feedback and review from third parties.",
                    "GPT-proposal-categories": [
                        "Smart contract updates",
                        "Grants, Funding and resource allocation",
                        "Board composition",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.923076923076923
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GovAlphaBot",
                    "index": "#2",
                    "likes": "0",
                    "time": "26/01/2023-16:18:59",
                    "content": "This is a summary of the contents of this subproposal and its impact, from GovAlpha’s perspective:  This is a valid subproposal to select investment strategies for USDC in the Yearn Vault associated with MIP92. This subproposal recommends three strategies, each with a deposit limit of 1M USDC. In total, 3M USDC will be used by the three strategies. The three strategies are:  Supply USDC to AAVE to earn interest. Obtain GUNIV3USDC-DAI LP tokens using USDC and the USDC PSM. Deposit this LP token into Arrakis Finance vaults (note that these are under beta testing), which autocompounds a Uniswap v3 DAI-USDC position. Finally, use the DAI-USDC LP tokens as collateral to open a MakerDAO Vault. Supply and borrow USDC on Compound Finance simultaneously to earn COMP. All strategies take earned tokens and sell them for more USDC, which is deposited back into the strategy. Flashmints are also used by the second and third strategy to boost yield.   This proposal has been assigned High-Impact based on the methodology listed here.  Disclaimer: These summaries are intended to be a guide and not a source of truth. You remain responsible for any actions you take on the grounds of this information. Please note the date when the summary was last updated to judge accuracy. Updated 2023-02-14 ",
                    "links": [
                        "https://aave.com/",
                        "https://beta.arrakis.finance/vaults",
                        "https://manual.makerdao.com/governance/off-chain/impact-estimations",
                        "https://forum.makerdao.com/t/weekly-mips-update-125/19812",
                        "https://forum.makerdao.com/t/weekly-mips-update-128/20070",
                        "https://forum.makerdao.com/t/weekly-mips-update-127/20001",
                        "https://forum.makerdao.com/t/weekly-mips-update-126/19881",
                        "https://forum.makerdao.com/t/weekly-mips-update-124/19706",
                        "https://forum.makerdao.com/t/weekly-mips-update-123/19600"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.388888888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "2",
                    "time": "09/03/2023-06:16:01",
                    "content": "I would like to formally submit it @MIP-Editors ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "2104"
}