{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/off-chain-proposal-bounties/15363",
            "title": "Off-Chain Proposal Bounties ",
            "index": 15363,
            "category": [
                "Governance"
            ],
            "tags": [
                "help-wanted",
                "incentives",
                "sourcecred",
                "offch-govinc-set"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#1",
                    "likes": "19",
                    "time": "25/05/2022-17:13:13",
                    "content": " Context After the discussion around what to do with SourceCred and the presentation of a set of options and recommendations to encourage governance engagement, we want to present, in greater detail, GovAlpha’s strategy to improve the MakerDAO off-chain incentive system explaining to the community the reasons and the expectations behind it.  Intro SourceCred is a truly innovative reputation tool for open collaboration but has shown some limitations. It is innovative because it is the first intersubjective reputation tool capable of rewarding contributions in a credible and neutral manner, with an enormous potential to redefine in the near future the method and nature with which we value our contributions, but its implementation alone has not been sufficient to build an integrated governance incentive system aligned with the community’s objectives. The systematic way in which the payouts have been concentrated in the hands of actors who were already paid a salary by the DAO, and who precisely due to the inertia of that link have been monopolizing the rewards from SourceCred, is evidence enough of what has been said. If we add to this the technical impossibility of tweaking the instance to encourage specific nodes, to promote concrete governance actions, it is clear that we need a change of direction, a possible solution that allows us to push the wheel and generate incentives that favor concrete community action.  Motivation This proposal comes to remedy the limitations of SourceCred and develop certain complementary strategies to improve the system as a whole. Taking as a premise the Off-Chain Governance Incentive Objectives we present the new off-chain proposal bounties, a new off-chain reward system that incentivizes concrete and outcome-producing governance initiatives. This initiative will strengthen our governance process through the direct incentive of concrete governance actions, encouraging community members to trigger governance processes with tangible results. We believe the implementation of this fund will contribute to the resilience and robustness of the system, making reward allocation more efficient and allowing it to scale hand in hand with the performance of the protocol.  The Pool of Funds By using 72,000 DAI we propose the creation of a new pool of funds to directly incentivize concrete and outcome-producing governance actions.  Pool Parameters  The Pool The initiative consists of a pool of 6,000 DAI per month to be distributed among all successful MakerDAO governance proposals. The design of a variable remuneration pool of funds favors continuous rewards updating based on the number of winning proposals submitted. This variability in the amounts promotes a dynamism that strengthens the system with continuous and consistent incentives. In this way, instead of appealing to fixed amounts, the pool encourages contributors to be rationally aware of the potential opportunity cost of not submitting their proposals in a timely manner.  Eligible Proposal Types Proposals eligible for rewards are:  Successful MIP proposals Successful MIP Sub Proposals Successful Signal Requests  A proposal is considered successful if its on-chain vote meets the success criteria defined in the accompanying on-chain poll text. Incentivising concrete and outcome-producing governance actions have been a goal of GovAlpha since SourceCred was introduced. We initially intended that the SourceCred algorithm could bias compensation towards users who participated in certain threads or categories related to governance outcomes (MIPs, Signals, etc.). But unfortunately, this did not turn out to be possible. However, this is still something we would like to investigate. Specifically, we believe that this strategy, in addition to promoting the generation of new proposals, can be an important catalyst for improving the quality and consistency of the community’s understanding (and relationship) of existing ratified MIPs, contributing to generating, in the long run, a more informed vote.  Rewards The maximum reward for each type of successful proposal is denoted below.  MIP - 2,000 DAI Sub Proposal - 1,000 DAI Signal - 500 DAI  The 6,000 DAI reward pool will be split between eligible proposals in a given month and may be significantly less depending on the volume of proposals submitted in a given month. The reward pool for a given month is split between proposals according to the following weights.  MIP = 1 Sub Proposal = 1/2 Signal = ¼  For cases in which a proposal has several authors, the distribution formula will distribute DAI equally among all of its contributors. For clarification and transparency, we want to share the formula so that the entire community can have a clear notion of how the calculation is made to reward allocation.  Eligibility Any community member with an official forum account is eligible to receive off-chain proposal bounty payouts.  Eligibility Exceptions Proposals concerning collateral onboarding are not eligible for off-chain proposal bounties. Proposals requesting funds from the Maker Protocol are not eligible for off-chain proposal bounties. Core Unit members are not eligible to receive off-chain proposal bounties. This includes Core Unit Facilitators. We want to encourage MKR holders and the community in general to participate in this initiative. We want them to lead the process of formulating and establishing the rules that shape our community interaction.  Exclusions GovAlpha Facilitators may exclude any community member from bounty payouts at any time, for any reason. GovAlpha Facilitators must communicate a reason publicly if a given community member is being excluded from off-chain proposal bounty payouts. All recurring proposals around the general functioning of the Core Units are excluded from this proposal, i.e., MIP40c3, MIP41c4/5 sub proposals.  Management The pool will be managed by GovAlpha through the Concrete Actions Reward Tracker to do the monthly follow-up of the approved initiatives. GovAlpha will build a base of contributors, take care of managing monthly payouts, and post every month a short report with the initiatives and the users rewarded.  Budgetary Impact The Off-Chain Proposal Bounties won’t require any extra budget expenditure. It will be financed with 27% of the resources currently allocated to SourceCred contributions funding. This is part of a budgetary diversification strategy for the year 2022 where GovAlpha will try to allocate monetary incentives more efficiently in different complementary initiatives aimed at encouraging participation and enriching community discussion. We believe that it is possible to promote continuous improvement in management and at the same time responsibly care for the DAO’s resources.  How to Opt-In Community members must provide an Ethereum mainnet address in order to receive payouts. This address will be publicly visible. Rewards will be distributed at the start of each month, covering proposals that concluded in the previous month. Contributors who have opted in will be eligible to receive DAI on-chain and payouts will be distributed by GovAlpha from the GovAlpha multisig wallet.  Next Steps GovAlpha is aiming to start implementing the new off-chain proposal bounties in June. ",
                    "links": [
                        "https://forum.makerdao.com/t/off-chain-governance-list-of-options-and-recommendations/13373",
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-objectives/13298",
                        "https://docs.google.com/spreadsheets/d/1t1VEezNpqn6Zvjm4yXn1SJm8xg3IztwXH50Zi1_Dceg/edit#gid=0",
                        "https://docs.google.com/spreadsheets/d/1wo8Uf52ntrZwDUSQUX42cph7YwjbzV2gWVlzVkDUieY/edit#gid=0",
                        "https://forum.makerdao.com/t/delegate-sourcecred/15365/6",
                        "https://forum.makerdao.com/t/weekly-relay-may-31-june-06-2022/15654",
                        "https://forum.makerdao.com/t/recompensas-de-propuestas-off-chain-traduccion/15426",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-15/18478/3",
                        "https://forum.makerdao.com/t/poll-notice-signal-support-for-ending-dai-funding-for-sourcecred/18204/11",
                        "https://forum.makerdao.com/t/relay-semanal-31-de-mayo-6-de-junio-2022/15684",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-7/15618",
                        "https://forum.makerdao.com/t/mip97-the-dao-level-objective-framework/19390/10",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397",
                        "https://forum.makerdao.com/t/cambios-en-los-incentivos-off-chain-a-la-gobernanza-sourcecred-traduccion/15393",
                        "https://forum.makerdao.com/t/off-chain-governance-incentive-changes-sourcecred/15362"
                    ],
                    "GPT-summary": "The post explains GovAlpha's strategy to improve the MakerDAO off-chain incentive system by introducing a new off-chain reward system that incentivizes concrete and outcome-producing governance initiatives. The proposal aims to remedy the limitations of SourceCred and develop complementary strategies to improve the system as a whole. The post provides details on the pool of funds, eligible proposal types, rewards, eligibility, exclusions, management, budgetary impact, and how to opt-in. The post also invites the community to participate in the initiative and provides next steps.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.753213350435573
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "25/05/2022-17:36:32",
                    "content": "Please provide the link for the new enrollment. Thanxs! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.852272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/05/2022-18:18:10",
                    "content": "I think it’s very good, the proposal is a way to incentivize CU members after their separation from lifelong sourcecred. Common and mortal members like me, we can debate with them if their proposal is good or bad, and they will have to defend it, having that extra incentive to participate in it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#4",
                    "likes": "1",
                    "time": "25/05/2022-22:08:07",
                    "content": "I’ll reach out to all authors once their proposals get successfully voted on to confirm their wallet addresses and to add them to the contributors base. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#5",
                    "likes": "2",
                    "time": "26/05/2022-11:46:15",
                    "content": "    Saludiego_201:  I think it’s very good, the proposal is a way to incentivize CU members after their separation from lifelong sourcecred.   Hi Diego, I think there’s a slight misunderstanding here. This proposal specifically excludes CU members from the bounties. The proposal is intended to incentivise non-CU forum members to make governance proposals. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.072222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#6",
                    "likes": "6",
                    "time": "26/05/2022-16:04:40",
                    "content": "Some links for those who are interested in doing this but not familiar with these processes. Maker Improvement Proposals - MIPs Portal MIP Subproposals - MIPs Portal Signal Requests - Guide to the Signaling Process ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP0#subproposals",
                        "https://forum.makerdao.com/t/guide-to-the-signaling-process/9400"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.15625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CYJFC",
                    "index": "#7",
                    "likes": "1",
                    "time": "28/05/2022-19:41:30",
                    "content": "This is super cool. Maybe I’ll try to revive that “nice” MIP that @Deimos guy did  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.708333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "0",
                    "time": "29/05/2022-08:00:25",
                    "content": "Does this also go to delegates who make successful proposals? I feel like they shouldn’t be included (as they have separate Sourcecred budget now) but only saw CU members are not included ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "5",
                    "time": "30/05/2022-13:00:10",
                    "content": "In many ways delegates are the group we most want to incentivise to create proposals - so yes, they are included even though they are also paid through other mechanisms. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#10",
                    "likes": "7",
                    "time": "02/06/2022-22:21:48",
                    "content": "We need a vetting process to better filter some proposals because if this is going to create a volume of additional posts and information simply to earn bounties, it’s going to make a lot of things worse. The Delegate governance needs to implement a divide and conquer approach as it is. Not enthusiastic about a proposal on this topic unless it’s narrowly targeted to screen for quality ex ante. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TheExistence",
                    "index": "#11",
                    "likes": "1",
                    "time": "03/06/2022-22:55:06",
                    "content": "It is an understandable concern, but what better than governance itself through participation and voting to assess the quality of the proposals? Personally, I believe that in a constrictive scenario, promoting greater discussion with more proposals is something necessary, at least as a first step. In addition to that, we will monitor the results and prepare to make the necessary adjustments. On the other hand, certain eligibility criteria were established to restrict ex-ante some types of proposals, but not evaluating their quality, the community will take care of that ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.769642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#12",
                    "likes": "7",
                    "time": "05/06/2022-13:44:08",
                    "content": "MakerDAO is now too large and complex to continue undifferentiated governance and delegate responsibilities. Vastly more proposals and discussions that are not segmented or categorized for quality and relevance to DAO priorities, needs or otherwise will dilute the effectiveness and robustness of governance as currently structured. If we are going to protect and provide for the success of the protocol through, for example, scaling sophisticated DeFi versions of RWA TradFi structures, we cannot have all delegates responsible to understand and vet those deals while also holding responsibility to engage with anything any bounty hunter wants to put forward. The status quo is a governance attack vector, frankly. Overwhelming the forum with proposals or extremely lengthy comments can be an effective tactic for weakening the focus and capability of CUs to produce results. It can also be useful for obscuring important information, or lack thereof, that might be critical to inform voting. Delegates thereby may be less able to follow or hone in on such details within a reasonable investment of time as a result of the deluge. I’m in favor of some level or method of sponsorship being required for certain items to come before delegates and MKR holders for consideration. Openness and permissionlessness are values I hold dearly and staunchly to heart, but these do not mean formlessness with a zero filtering process can work at scale. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip97-the-dao-level-objective-framework/19390/10"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.04828869047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#13",
                    "likes": "0",
                    "time": "04/09/2022-19:44:27",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#14",
                    "likes": "0",
                    "time": "29/09/2022-18:24:36",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#15",
                    "likes": "9",
                    "time": "29/09/2022-18:27:55",
                    "content": "Wanted to bump this thread by reporting our first payout took place this Month  (you can view that transaction to @twblack88 here)! Reminder that while Core Unit members are excluded, @Recognized-Delegates can profit off of proposing Governance Actions that are then approved by MKR voters. Where can the protocol improve? Nothing happens without someone taking action! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#16",
                    "likes": "2",
                    "time": "30/09/2022-02:16:20",
                    "content": "Congrats @twblack88 ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#17",
                    "likes": "2",
                    "time": "30/09/2022-04:46:21",
                    "content": "@gfxlabs next ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#18",
                    "likes": "0",
                    "time": "02/02/2023-18:42:10",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}