{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/reacting-to-the-october-23rd-executive/4961",
            "title": "Reacting to the October 23rd Executive ",
            "index": 4961,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "flash-loans"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "3",
                    "time": "02/11/2020-11:15:11",
                    "content": "Hey all, as most of you are aware, the October 23rd executive was passed using 13k flash-loaned MKR by the team at B.Protocol. See this post for details. The immediate danger of malicious governance attacks is in the process of being mitigated with by the new executive (increasing the GSM Pause Delay to 72 hours.) PLEASE VOTE if you haven’t already. However, in addition to the problem of malicious governance attacks, we also have to figure out some method for dealing with a flash-loan being used in the manner that B.Protocol used one to pass the October 23rd executive. The problem statement is stated below: Actors can pass non-malicious governance proposals they have a vested interest in using the available flash-loan liquidity without owning MKR. Now, in the longer term, this issue will be resolved by the update the DssGov contract. In the short-medium term the Smart Contracts Domain Team are working on a fix as well. However, until that fix is implemented we will need to deal with this no-longer theoretical problem. Additionally, we need to attempt to come to some sort of consensus as what to do with regards to the October 23rd executive itself. B.Protocol have communicated that they did not have ill intent, however, the actual intent behind the action is irrelevant. The outcome of their actions is that a proposal has passed that was not agreed on by MKR Holders. The aim of this post is to prompt discussion and hopefully some movement towards a decision with regards to the above issues. What follows is a list of factors to consider.  1. B.Protocol admitted their actions and claims to have meant no ill-intent. As I hope most have seen elsewhere, @yaronvel admitted to their actions and has claimed to have no ill-intent. Additionally, the B.Protocol platform appears to benefit MKR Holders and the Maker Protocol by reducing the likelihood of liquidations at the protocol level. It is possible that @yaronvel is not dealing in good faith and just wanted to push the proposal through the executive vote once the possibility of failure became likely. Realistically it’s difficult to judge another’s intentions. 2. B.Protocol’s actions were reckless and they appear to have given little thought to the consequences. I’m not entirely sure what @yaronvel and others at B.Protocol were thinking when they did this. I can only assume it was the result of a lack of understanding in the Maker governance process and poor judgement or intentional action. If an actor wanted to showcase a vulnerability in the protocol (which Maker Governance were already aware of) then it makes exceeding little sense to showcase that vulnerability in a vote that directly benefits them, as exploiting that vulnerability throws the result of the vote into doubt, and leads to a post like this. It’s this point that causes me to doubt B.Protocol’s claims that showcasing the vulnerability was their driving motivation, though I am trying to keep in mind Hanlon’s Razor. Also worth noting is that B.Protocol have consistently played off the impact of their actions as causing no harm. 3. Failing to react to flash-loans being used in this way invites further abuse of the vulnerability. Failing to react to B.Protocol using flash-loans in this way invites other parties to use them in the same manner. Namely, to pass proposals that benefit them without owning MKR and being exposed to the consequences. 4. Reacting too strongly to flash-loans being used in this way invites abuse in the opposite manner. If Maker Governance passes something draconic along the lines of ‘Proposals passed using flash-loans are not valid and should be reversed’ then this is open to abuse from actors that benefit from a certain proposal failing to pass. An actor could pass a proposal using the flash loan which should then be reverted based on the above statement.  I’m sure there may be additional factors to consider. If you have any other thoughts, please leave them in the comments below and I’ll add them to this post. In terms of the possible responses we could make, here’s a non-exhaustive list of some ideas in order of severity. To be clear, I am not advocating for any of these, just listing suggestions. It goes without saying that these would need to be voted on before being implemented.  Do nothing Require a formal apology from B.Protocol for abusing MakerDAO’s governance process. Revoke the ‘first year free’ for B.Protocol’s oracle access and require them to pay for access effective immediately. Revoke B.Protocol’s oracle access for a period of time. Revoke B.Protocol’s oracle access permanently. A combination of the above.  Once again, if anyone has other ideas on how we should react to this issue, please share them below and I will add them to this list. ",
                    "links": [
                        "https://vote.makerdao.com/executive/mitigating-flash-loan-risk?network=mainnet#proposal-detail",
                        "https://en.wikipedia.org/wiki/Hanlon%27s_razor",
                        "https://forum.makerdao.com/t/maker-relay-ep-19-en-espanol/4981",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-19/4975",
                        "https://forum.makerdao.com/t/week-23-dai-distributions-sourcecred-funding-mip13c3-sp6/5117"
                    ],
                    "GPT-summary": "The post discusses the issue of flash-loans being used to pass non-malicious governance proposals without owning MKR, as was done by B.Protocol to pass the October 23rd executive. The author prompts discussion on how to deal with this issue and what to do with regards to the October 23rd executive. The post lists factors to consider and suggests a non-exhaustive list of possible responses in order of severity. The author invites others to share their thoughts and ideas on how to react to this issue.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.297955747955748
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#3",
                    "likes": "8",
                    "time": "02/11/2020-11:29:55",
                    "content": "    LongForWisdom:  Do nothing   This. Let’s focus on improving the protocol. All other things are mostly symbolic. On second thought, we might ask for ‘formal apology’ to get some laughs in the cryptosphere. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "1",
                    "time": "02/11/2020-12:14:30",
                    "content": "It is my understanding that this flashloan just added some grease in the governance wheels. Everything was already agreed on governance polls. MKR holders were able to express their concerns before the executive. I already stated that I think that their action was legally legit. Nevertheless, they obviously wanted to have their proposal to pass in their interest (which might be the interest of Maker as well but this isn’t relevant here). Is that a sound foundation for a business relationship? I don’t think so. But mistakes and bad judgement happen. The response is not easy to define and depend on what we are expected to gain with the B.Protocol relationship, the alternatives, the PR impact, the personal relationships between them and us, and who they are (I would make them pay a bit if they are VC-backed but not if they are without funding for instance). I would suggest someone study all those aspects and propose something to the governance. I agree with all solutions. Obviously, the next business partner doing a flash loan in that way can expect more stronger consequences. This sets a precedent. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "5",
                    "time": "02/11/2020-12:30:14",
                    "content": "    LongForWisdom:  Do nothing   In my opinion I want to believe this was Hanlon’s Razor, similar to what Compound did when Yield Farming took off like a rocket ship. The truth of the matter is–Nobody was going to be oppose to B.Protocol being denied access. And since no MKR holder that were Against B.Protocol did not vote, or could care-less about voting, than–we should do nada, rien, niets, nichts.      LongForWisdom:  Require a formal apology from B.Protocol for abusing MakerDAO’s governance process.   I believe they did this already via their Twitter Account.     LongForWisdom:  Revoke the ‘first year free’ for B.Protocol’s oracle access and require them to pay for access effective immediately.   I believe this stifles innovation. I am totally against stopping innovations with good long-term intentions. And I believe this protocol can help Maker, not hamper it. Again, this is all my personal opinion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.3
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "9",
                    "time": "02/11/2020-12:39:14",
                    "content": "    LongForWisdom:  Do nothing   I am also in favour of do nothing. In my opinion sentences like:  The outcome of their actions is that a proposal has passed that was not agreed on by MKR Holders.  or  I can only assume it was the result of a lack of understanding in the Maker governance process and poor judgement or intentional action.  are a bit exagerated. We, the MKR community, knew and were informed about the possibility of these governance attacks for months. At the very least since December 2019 with @MicahZoltu post:    Medium – 25 Aug 20    How to turn $20M into $340M in 15 seconds The TL;DR Reading time: 9 min read       And nothing (or, at least, not much) has been done to prevent them. It is now our responsibility to take this ``B.Protocol attack’’, as an opportunity to increase the security and efficiency of the system. Too many MKR holders are not voting. Too many MKR holders are incentivised to lend their MKR, rather than vote in a healthy way. THESE are the real issues. And hopefully we can start fixing them sooner rather than later, with the help of the new governance code (under dev) and governance discussions here in the forum. ",
                    "links": [
                        "https://medium.com/coinmonks/how-to-turn-20m-into-340m-in-15-seconds-48d161a42311",
                        "https://forum.makerdao.com/t/week-23-dai-distributions-sourcecred-funding-mip13c3-sp6/5117"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.310984848484849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#7",
                    "likes": "13",
                    "time": "02/11/2020-15:48:20",
                    "content": "Hey, this is the founder of B.Protocol. I would like to give a three answer part. First I will present how B.Protocol helps MakerDAO community, and my personal history with MakerDAO. Then I will give some more details on our state of mind during the 23rd vote. And finally, based on that will argue my opinion on why severe steps would not benefit the MakerDAO ecosystem. B.Protocol contribution to MakerDAO B.Protocol makes lending platforms more stable, by providing clearer and quantifiable incentives to be a keeper. It is doing that by providing a smart contract interface that shares liquidation proceeds, in return to priority in the liquidation process. This way MakerDAO gets new and more committed liquidators, MakerDAO users get ETH rewards, and liquidators get more certainty, and avoid the gas wars. We went live almost a week ago, and currently over $2.5m of user funds were deposited, and over 1M dai was generated. We spent enormous amount of work bringing new keepers and guiding them through MakerDAO code so they could integrate. In addition, we have subsidized MakerDAO users with $10k in ETH that were seeded in the contract when going live. My history with MakerDAO While I was the CTO at Kyber Network, I led the first integration with Oasis DEX, long before it became the standard to aggregate liquidity. While designing the WBTC smart contract and its DAO, I helped MakerDAO to try an on-board more custodians. On black Thursday, I gave technical support, without any payment, to one of the keepers who almost single handedly saved MakerDAO that day. Hence, when founded B.Protocol, it was only natural to select MakerDAO as a first integration. The events of the 23rd A proposal to whitelist B.Protocol contract was put up to executive vote on the 23rd. On Sunday, the 25th, I started, for the first time, to dive deeper into the MakerDAO voting system, in order to understand the exact time it would be expected to pass. Already on that day I realized that a flash loan could help speed the process. I took a conscious decision to deploy the voting contract on that day, and to do it from the same account B.Protocol smart contracts were deployed. Fully knowing it could backfire on me, out of respect to the MakerDAO team, I decided not to play a cat and mouse game, and to do it with my own identity. Though I regret not disclosing it in a more responsible way, I am still mostly under the impression that without it, MakerDAO would have been less safe today. This issue was well known for months, and yet no action was taken. Proposed verdict Despite the above, I now realize that my actions led to an unfortunate turn of events. It forced MakerDAO to act urgently and spend effort on a mitigation, on the expense or working on other great features. Forced to by the governance or not, I do apologies (we already apologized at our social media), and will make it formal if instructed. As for the other options, the community should be aware that to date, MakerDAO is one of the most difficult projects to integrate with. Other than technical difficulties, the white-listing process delays all integrations by weeks. Integrating with over 60 projects at my time in Kyber, and integrating with other lending platforms, I could honestly say I believe that revoking access could just push away future projects from integrating with MakerDAO. In addition, personal sanctions in a decentralized world without identity can not play significant role towards preventing such actions from happening. I paid my respect for MakerDAO by not doing what I did under anonymous identity, and hope MakerDAO community will learn to understand the benefits of B.Protocol and the importance of keeping it operational. ",
                    "links": [
                        "https://medium.com/b-protocol/the-genesis-backstop-b-protocol-brings-new-players-to-defi-liquidations-74619b11486e",
                        "https://forum.makerdao.com/t/week-23-dai-distributions-sourcecred-funding-mip13c3-sp6/5117"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.56599025974026
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "1",
                    "time": "02/11/2020-16:29:05",
                    "content": "To be clear, I had no prior knowledge of your history, not that I think it’s really that relevant to this particular issue. That said, thanks for what you’ve done in the past to help MakerDAO.     yaronvel:  On Sunday, the 25th, I started, for the first time, to dive deeper into the MakerDAO voting system, in order to understand the exact time it would be expected to pass.   See this is another thing that I find confusing. You mentioned you hadn’t dived into MakerDAO’s voting and governance systems. But then you end up using a flash loan to pass your own proposal. I don’t understand a chain of logic that leads to this that doesn’t include ‘we need our oracle proposal to pass.’     yaronvel:  Already on that day I realized that a flash loan could help speed the process.   I feel like this is a dangerous point of misunderstanding. A flash-loan doesn’t just speed-up the process. It invalidates the process because after it happens there is no way to be sure of what the outcome would have been prior to the flash loan taking place.     yaronvel:  Though I regret not disclosing it in a more responsible way, I am still mostly under the impression that without it, MakerDAO would have been less safe today. This issue was well known for months, and yet no action was taken.   Action was taken when the issue initial arose.  The GSM Delay was turned on. Everyone started more carefully monitoring the available on-chain MKR liquidity so that we’d be aware if there was a non-theoretical danger of a malicious proposal being created and passed. A fix was planned for the next update of the governance contract.      yaronvel:  Forced to by the governance or not, I do apologies (we already apologized at our social media), and will make it formal if instructed.   I appreciate the explicit apology here. I will note that I checked the BProtocol twitter account and discord. I’ve seen words of regret and claims that you meant no harm. Fine and good, but these aren’t apologies in my eyes.     yaronvel:  Other than technical difficulties, the white-listing process delays all integrations by weeks. Integrating with over 60 projects at my time in Kyber, and integrating with other lending platforms, I could honestly say I believe that revoking access could just push away future projects from integrating with MakerDAO.   This is a fair point and is useful input, thanks.     yaronvel:  and hope MakerDAO community will learn to understand the benefits of B.Protocol and the importance of keeping it operational.   I don’t think anyone is doubting that BProtocol is useful and benefits MakerDAO, that’s part of what makes this whole situation so frustrating. It feels like a massive and unnecessary own goal on your guys part. Something that was a purely good thing is now an issue that we need to give consideration to managing. The situation we’re in is that flash loans were used to interfere with the governance of the protocol. How governance reacts to that is important, because despite it being a minor interference, it is the first known interference and how we react here will affect how we react to future votes including borrowed (flash loaned or not) MKR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7892156862745106
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#9",
                    "likes": "4",
                    "time": "02/11/2020-18:45:39",
                    "content": "    LongForWisdom:  I feel like this is a dangerous point of misunderstanding. A flash-loan doesn’t just speed-up the process. It invalidates the process because after it happens there is no way to be sure of what the outcome would have been prior to the flash loan taking place.   @LongForWisdom , I respect you a lot, but here you are possibly kind of taking your own personal point of view prevail over other ones (remind that your words have heavier weight given your role, and also since you started this thread). We are in the crypto space, smart-contracts and in numbers we trust. In my opinion the vote is completely valid, because the smart-contract and the blockchain says so. I personally don’t see why using flash loans should be considered invalid but, e.g., voting anonymously with MKR obtained with illegal money would count as valid. It’s the blockchain and we have to live in it. This is DeFi.     LongForWisdom:  I’ve seen words of regret and claims that you meant no harm. Fine and good, but these aren’t apologies in my eyes.   I am not sure anybody here is particularly interested in apologies, honest or not. I personally just care about improving the efficiency of the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.714126559714795
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#10",
                    "likes": "2",
                    "time": "02/11/2020-19:36:53",
                    "content": "Do nothing. The only time we should apply sanctions is if 1) the vote is at risk to cause significant damage to the MKR protocol and 2) the damage was done intentionally or with negligence. Neither can be shown. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#11",
                    "likes": "2",
                    "time": "03/11/2020-00:54:10",
                    "content": "Do nothing.  I think it was clearly not malicious, did no harm, and calls us to action against this kind of threat. However, B. Protocol is currently and openly executing an attack on MakerDAO designed to steal the Dai Credit System’s liquidation penalty income.  What should be done about that? (also nothing I think, since although they are doing that I think it’s a beneficial attack which will reduce the chances that a Vault is liquidated without recovering debt owed.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6499999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#12",
                    "likes": "4",
                    "time": "03/11/2020-01:09:25",
                    "content": "Just to concur with what several others have already said : we should do nothing when it comes to B.Protocol. Any action towards them would only impact the relationship between Maker and B.Protocol. Maybe we want to have an impact there (I don’t think so though). But it would create no incentive against future flashloaned votes. Anyone with a proposal to pass and the means to flashborrow can create however much plausible deniability they wish to. @iammeeoh I wouldn’t go as far as you: ‘this is DeFi’ for sure but let’s not surrender our judgment to whatever the code does today. We should reduce the expected future impact of flashloans on vote outcomes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.611111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#13",
                    "likes": "3",
                    "time": "03/11/2020-05:54:57",
                    "content": "As far as I know, also what I heard from discussions with the MakerDAO team, the liquidation penelty is not part of the MKR token model, and was set to prevent the auction grinding attack ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ilan_Doron",
                    "index": "#14",
                    "likes": "0",
                    "time": "03/11/2020-06:41:47",
                    "content": "I find it weird to read this attack with so many direct claims pointing to a specific person, and all are made by someone who doesn’t act under his own name and identity. I have been corrected that LongForWisdem is a known figure. Just not known to me. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 5.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#15",
                    "likes": "5",
                    "time": "03/11/2020-06:55:13",
                    "content": "The liquidation penalty predates discovery of the Auction Grinding Attack, however this attack vector ended prior discussions of potentially lowering the penalty percentage. The reality is that liquidation penalties have provided income to MakerDAO, but that is more of a side effect than it’s main purpose. I have little doubt that MakerDAO would choose to forgo all liquidation penalty income in exchange for vaults never getting liquidated without full recovery of outstanding debt.  Since B. Protocol can go a long way towards making that trade off a reality, I think it’s great. I was just kind of highlighting how it could potentially be seen differently, though, not entirely unlike how pushing an executive vote over the threshold with a flash loan could be seen in different ways. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.956845238095239
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#16",
                    "likes": "3",
                    "time": "03/11/2020-06:59:21",
                    "content": "@Ilan_Doron, @LongForWisdom is the current governance facilitator and leads weekly governance calls. He is a well known member of the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Ilan_Doron",
                    "index": "#17",
                    "likes": "1",
                    "time": "03/11/2020-07:01:24",
                    "content": "Ho I see my bad As an outside reader it looks weird. thanks ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#18",
                    "likes": "2",
                    "time": "03/11/2020-07:05:14",
                    "content": "     LongForWisdom:      yaronvel:  Already on that day I realized that a flash loan could help speed the process.   I feel like this is a dangerous point of misunderstanding. A flash-loan doesn’t just speed-up the process. It invalidates the process because after it happens there is no way to be sure of what the outcome would have been prior to the flash loan taking place.    Would you view it differently if someone bought MKR, voted to pass an executive, and sold the MKR the next day? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/yaronvel",
                    "index": "#19",
                    "likes": "2",
                    "time": "03/11/2020-07:14:11",
                    "content": "In Dai v1 the liquidation penelty didn’t go to MKR holders, but rather to PETH holders (afaik). But yeah, your observation is true. Again, from our sides, the message we got from the team is that this is a desirable outcome. And that it is MakerDAO interest to have others working on liquidation solutions as well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#20",
                    "likes": "1",
                    "time": "03/11/2020-08:04:32",
                    "content": "    LongForWisdom:  If you have any other thoughts, please leave them in the comments below and I’ll add them to this post.   I think we might be mixing two topics here:  The “rigged” vote The repercussions (if any) to the “offender”  Addressing the first topic: if we’re agreeing that this was an offence, and we should take measures against it, then might want to invalidate the vote (roll it back and have it again)? I’m not sure if this is possible and how complicated it is from a technical point, and also if the Community would want that. Once we have secured the system, we should put the vote forward again. The second topic is what is has been discussed at long in this thread.      Spidomo:  Would you view it differently if someone bought MKR, voted to pass an executive, and sold the MKR the next day?   It is a good point. (You would also need to consider that not everyone has access to 6.5+ Million USD; and that’s before we consider any type of slippage, which would be brutal.) But it is a good point. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.946428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#21",
                    "likes": "4",
                    "time": "03/11/2020-10:00:15",
                    "content": "A couple of people have asked me similar questions. My answer has mostly been:  There is a difference between someone passing their own proposal with borrowed MKR versus passing a proposal they favor with borrowed MKR. I view it more as a scale. The ideal is that someone owns MKR and is exposed to the potential fallout of their vote, the current system doesn’t support this (no lockup.) If someone buys MKR for a short period then sells after voting that is less good. If someone borrows MKR to vote that is least good. The amounts involved also affect severity. Pushing something over the line with 100 MKR is less bad than pushing it over the line with 10,000 MKR.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#22",
                    "likes": "4",
                    "time": "03/11/2020-12:46:26",
                    "content": "    iammeeoh:  I personally don’t see why using flash loans should be considered invalid but, e.g., voting anonymously with MKR obtained with illegal money would count as valid.   +1. code is law, that’s why i believe the vote is totally valid. BUT: and i think that is something we can do and should do - i think from a “skin in the game” perspective the system should incentivize those that lock up their MKR long term (whatever that means…, 1 block to months?) for voting because flash-loan-voters essentially have 0 skin in the game. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.208333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#23",
                    "likes": "6",
                    "time": "03/11/2020-14:28:27",
                    "content": "This exploit has been known for a long time.   From @MicahZoltu post, to the one I constructed regarding MKR seasoning proposal.   In fact if one considers the size of the markets now it only costs 513*50000=25.6M current to freeze ALL assets in the protocol by someone buying some amount of MKR (< 25.6M btw) and borrowing (can’t be done with a flash loan) the rest to ES the system and profit from the chaos that would ensue in the markets. For varying reasons this attack is considered unlikely, but we approach now what 1.5B in assets.deposited this attack only needs to capture 2% of the total value of deposits to be profitable.   A significant difference from when the protocol only had perhaps 150-200M assets deposited.   This attack vector only needs 50K to execute, to actually try a governance attack roughly 100K would be needed.  Even then with the GSM delay the governance attack is still mitigated (somewhat) by the GSM.   Ask another question.  Why was this executive not halted within the GSM delay if there were concerns?  (I missed these discussions) So while B.Protocol probably didn’t think through their actions in this regard.  I do not believe their actions to be malicous to the protocol even if they were aggressive in getting what they wanted passed. I would urge strongly that the actions of B.Protocol should be applauded because it will force the DAO to finally address these issues in a serious way.   DO NOT be deceived that the GSM does anything here with respect to the above ES attack scenario that still exists in the protocol TODAY. If MakerDAO wants to only allow actors with significant MKR to act in the system responsibly then adjust the protocol so that result is achieved. Right now someone can borrow MKR and do the same thing again.  The GSM delay does not stop voting attacks (if they can be considered such) only gives a pause before they can try to do anything of substance to the system.    My MKR seasoning proposal implemented on both the ES and DSSChief would.     MKR seasoning proposal for system control access       Greetings Maker community.  There is a lot going on and my apologies to add but I wanted to get this idea off my plate for risk-governance consideration as well as community consideration.  There has been a lot of discussion about attack vectors in the Maker system.  I have in my own analysis identified two primary attack vectors that I outline quickly below.    General governance attack via obtaining sufficient MKR.   The first line of defense for the MCD here that has been recently enacted is …     What is a reasonable length of time to force a wallet to hold MKR before it can be deposited into DSSChief or the ES module??   And what are the pros and cons of having a seasoning check in all the MKR deposit points? Is it unreasonable to have as a constraint on depositing MKR into any of the MCD contracts a 7-14 day delay?   Do we want wild unseasoned (or flash loaned MKR) able to DO ANYTHING in the system?  Is 7-14 days enough of a seasoning period? These are the real questions to be asking and the real discussion to be having.  Not slapping on the wrist a company acting in good faith using the means that MakerDAO has made available to anyone including bad actors.   B.Protocol used the system as designed and implemented.   In the loosest sense they did NOTHING WRONG and simply acted against what would be considered rules of decorum and they didn’t even try to disguise these actions. So my take.  DO NOTHING to B. Protocol here Fix the problem where it is broken.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.383219954648526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hyman",
                    "index": "#24",
                    "likes": "3",
                    "time": "04/11/2020-00:12:13",
                    "content": "I am glad that B.Protocol utilized flash loans to get the vote passed. I think “requiring” them to post a formal apology is vapid, and the majority of the community would not back this. I think most of us follow the ‘code is law’ dogma. As far as I know (correct me) there was no official guidance that ‘using flash loans to pass votes is discouraged.’ And even if there were, a real malicious actor discards discouragement. As stated, using a flash loan to vote was a known issue. It probably wouldn’t have been fixed before it was utilized. But now it’s getting fixed, and that’s great. I am glad that it was utilized for something trivial rather than something dangerous. As to why they did it? Advertisement, good press, helping to improve MKR protocol, being disruptive, who knows. I don’t see any malice or stupidity in their actions ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.769230769230768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#25",
                    "likes": "0",
                    "time": "04/11/2020-09:53:43",
                    "content": "    MakerMan:  DO NOTHING to B. Protocol here   B. Protocol irrelevant It reminds us of the problems in the agreement. Although there is no friendly communication in advance, we have to be more generous. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#26",
                    "likes": "16",
                    "time": "04/11/2020-11:53:01",
                    "content": "Given that a large majority of responders so far are strongly in favour of doing nothing, we’ll be dropping this issue unless we hear some compelling arguments in favour by the end of the week. Thanks to all that have shared their opinion so far. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.1230158730158735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#27",
                    "likes": "0",
                    "time": "09/11/2020-09:00:20",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#28",
                    "likes": "0",
                    "time": "08/02/2021-15:00:21",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}