{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-may-24-30-2022/15488",
            "title": "Weekly Relay | May 24 - 30, 2022 ",
            "index": 15488,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "1",
                    "time": "31/05/2022-21:03:55",
                    "content": " 1727×390 308 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop shop for MakerDAO updates.  Online PDF Version  We have some new ideas for improvement and would appreciate your feedback to help make the Weekly Relay more enjoyable publication.     Amended MIP40: Important Information for Core Units From “Actual Expenses vs Budget” reports to fifty-comment forum threads on the best way to determine compensation levels in a remote-first, global organization, budgeting is a perennially hot topic in internal MakerDAO discussion. The latest development of the ongoing discussion, MIP40, defines a framework for managing and modifying Core Unit budgets has been amended with several substantial changes. Primary Changes   Budget Submission Windows: Budget Submission Windows is a new aspect of Core Unit budgets outlined by MIP40. Budget requests can only be submitted quarterly in March, June, September, and November.  Budget Start and End Dates: Budgets now have a maximum duration of 12 months and cannot start later than three months after being formally submitted.  Budget Composition: Budget requests are now required to provide more specific details, including:  How revenue growth and/or the potential for improvement in operational efficiency will be increased. How the Core Unit could guarantee viable business if operating Bear/Superbear/Bull context. A timeline for specific deliverables.    Transparency, Return of Funds, Unwinding: To increase transparency, Core Units are now required to:  List expenses by time. Specify the percentage of the budget going toward ongoing and one-time expenses. Disclose the number of members in the unit. In the case of budget increases greater than 10%, including variance analysis. Core Units are now required to return all funds (with qualifications) in excess of three months of budget. Core Units are now required to define how they are to be wound down in the event of a governance vote to defund them, with accompanying rationale (period, use of funds, return of funds).    MIP40c3 Subproposal Parameters: Ratification Polls for MIP40c3 sub proposals no longer use binary voting. Instead, they now use ranked-choice voting with the following options:  Approve existing budget only (business as usual). Approve increased budget. Reject budget. Abstain.    @prose11 commented that a grace period had been established for budgets posted to RFC for the June cycle before these amendments passed—i.e., MIP40 budget proposals will not be required to adhere to the rules outlined in this amendment. To illustrate the timeline, @adcv provided an example of the budget sequence for the March cycle:  Through to the end of January: Design of budget proposal Beginning in February: Post on the forums for RFC within the submission window Beginning in March: Formal submission of the budget March: Vote April: First effective date  GovAlpha will be hosting a public “Know Your MIP” call for discussion on this amendment in the near future. A MIP4c3 amendment to clarify some points of this MIP is currently in progress. Review the original forum submission for this amendment and the ratification poll for more information. Contact @Gala, @blimpa, or @sebix on the forums for questions or comments.  Beware of the Most Recent NFT Scam Happening!! There’s a new NFT scam where victims receive an NFT airdrop from an unknown collection into their wallets with a 1 wETH offer. The fraud wETH offer allows users to approve the collection for sale, but the offer will revert when they try to accept it, which will waste gas. The revert message directs the user to a phishing site. Keep an eye out for this  and share with the community! For more information, check out this thread.     Executive Vote(s) Raise the ESM Minimum Threshold, MKR Vesting, Adjust the lid Parameter on the Rate-limited Flapper This executive proposal passed, and the following changes occurred within the Maker Protocol:  ESM Minimum Threshold Increase As per this Governance Poll, the ESM Minimum Threshold (min) -i.e., the minimum MKR amount required for triggering an Emergency Shutdown- was increased from 100,000 MKR to 150,000 MKR. For further information, please read the originating Signal Request.  Core Unit MKR Vesting Transfers     Core Unit Amount Budget Proposal     Development and UX Core Unit 355.86 MKR Budget Proposal   Sidestream Auction Services Core Unit 243.7953 MKR Budget Proposal     lid Parameter Adjustment of the Rate-limited Flapper As per this Governance Poll, the lid parameter (which sets the total value of DAI allowed to be sent out to surplus (flap) auctions at once) was adjusted from 150,000 DAI to 30,000 DAI, effectively reducing the amount of parallel flap auctions from five to one. For further information, please read the originating Signal Request.  Governance Polls | May 23 - 30, 2022 Please, check out the feedback survey mentioned at the head of this publication to help us improve Active Governance Polls. Last week contained three polls, which all passed:     Poll Name Discussion     Launch Maker Teleport with 1 Basis Point Fee Discussion   Investigate Deploying the MakerDAO Balance Sheet in ETH Discussion   Investigate Implementation of an Antalpha Institutional Vault Discussion    Check out May 23rd’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls Please, check out the feedback survey mentioned at the head of this publication to help us improve Community Greenlight Polls. There was one community greenlight poll for the week of May 16 - 30, 2022.     Greenlight Poll Vote Breakdown Start Date End Date     FEI (Fei USD)  2265×517 82.1 KB  May 16, 2022 at 16:00 UTC May 30, 2022 at 16:00 UTC    Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.    Last Week’s Call Recordings:  Open Decentralized Voter Committee: May 24, 2022 | Video | Forum  Governance & Risk Episode 192 | Video | Forum  Meet Your Delegate 12 | Video | Forum   Upcoming Calls:  Open Decentralized Voter Committee | Forum | Join Link - Wednesdays at 15:00 UTC Governance & Risk Call | Join Link | Agenda - Thursdays at 17:00 UTC  Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Real World Finance - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC  Join Link | 6S Capital - Every Other Wednesday 14:00 UTC     MIPs, Links, and Resources Open Weekly MIPs Update Ratification polls, proposals, and pre-MIP discussions. Forum and Maker Discord Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auction data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.    Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @nothsa and @Artem_Gordon ",
                    "links": [
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://forum.makerdao.com/t/amended-mip40-important-information-for-core-units/15450",
                        "https://forum.makerdao.com/t/makerdao-actual-expenses-vs-budget-february-2022/14327",
                        "https://forum.makerdao.com/t/compensation-levels-in-a-global-organization/15342",
                        "https://mips.makerdao.com/mips/details/MIP40",
                        "https://mips.makerdao.com/mips/details/MIP40#return-of-funds",
                        "https://mips.makerdao.com/mips/details/MIP40#unwinding-and-defunding",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
                        "https://vote.makerdao.com/polling/QmXVjbWG#vote-breakdown",
                        "https://threadreaderapp.com/thread/1531397484840374285.html",
                        "https://vote.makerdao.com/executive/template-executive-vote-raise-the-esm-minimum-threshold-mkr-vesting-adjust-the-lid-parameter-on-the-rate-limited-flapper-may-25-2022#proposal-detail",
                        "https://vote.makerdao.com/polling/QmQgab4a",
                        "https://makerdao.world/en/learn/governance/emergency-shutdown",
                        "https://forum.makerdao.com/t/signal-request-increase-the-esm-minimum-threshold/15006",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP18",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP27",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP25",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP44",
                        "https://vote.makerdao.com/polling/QmREdTJK",
                        "https://auctions.makerdao.com/flap",
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688",
                        "https://vote.makerdao.com/polling/QmahjYA2#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-launch-maker-teleport-with-1-basis-point-fee/15109",
                        "https://vote.makerdao.com/polling/QmQRhmQa#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://vote.makerdao.com/polling/QmNpELvR#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-antalpha-institutional-vault/15030",
                        "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346",
                        "https://vote.makerdao.com/polling/Qmbzebcq#poll-detail",
                        "https://makerburn.com/#/rundown",
                        "https://youtu.be/6ArOPRZhf6o",
                        "https://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqbGlCT285ME5PcDhBc1lFc0NDcUxtQWVLWTNCQXxBQ3Jtc0tuS2lOaWsza3Z5bDcxX1BvOEhnZ0MzRlBfaHNSTXFQcVpwZnNxMzY1YmEzeHZSaG13bmJnTGc1Y0FiYzRGbU5CX2VCQUJBc3picW81cWJPXzNwUFJEalFadHRmcGhYU01VTnowQ0JBRklsbExDZEg2dw&q=https%3A%2F%2Fforum.makerdao.com%2Ft%2Fopen-decentralized-voter-committee-tuesday-5pm-cest-join-if-you-are-an-mkr-holder%2F15330&v=6ArOPRZhf6o",
                        "https://youtu.be/96GowcgqSBM",
                        "https://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqbHQzSEpkdGJTcTR4ODdfc1czUGJkM1ZlWGd5Z3xBQ3Jtc0trQ3JpQUFfR3Rhd0lKMUU1eGdWRGNxWWkxM2tFUWNjcnVpNmEzTGREQms3VUVuaUttNGxoT3p4QmF2ak9FNG5PQV9vZWlRNzlRZzBDcmZBaEg4RmUzRWxoRU5mcWFqYWs4TkRTeE9pbXY4SXQ5SFNjRQ&q=https%3A%2F%2Fforum.makerdao.com%2Ft%2Fgovernance-and-risk-192-thursday-may-26-at-21-00-utc%2F15372&v=96GowcgqSBM",
                        "https://youtu.be/9B-gDrEiK6o",
                        "https://forum.makerdao.com/t/meet-your-delegate-12-london-business-school-lbs-and-blockchain-columbia/15218",
                        "https://forum.makerdao.com/t/decentralized-voter-committees-startup-phase-wednesdays-5pm-cest-all-mkr-holders-welcome/15330",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/81436458345&sa=D&source=calendar&ust=1654445893399659&usg=AOvVaw0-CBSXWDpRLmmAO6XGLV0G",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/weekly-mips-update-89/15464",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-26-june-01-2022/15569",
                        "https://forum.makerdao.com/t/weekly-relay-may-31-june-06-2022/15654",
                        "https://forum.makerdao.com/t/relay-semanal-24-30-de-mayo-de-2022/15594"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.798565363782755
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/06/2022-21:04:19",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
            "title": "Weekly Relay | May 3 - 9, 2022 ",
            "index": 15084,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "5",
                    "time": "10/05/2022-16:10:30",
                    "content": " 1727×390 306 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop-shop for MakerDAO updates.  Online PDF Version | Show some love to our Medium account   We have some new ideas for improvement and would appreciate your feedback to help make the Weekly Relay a more enjoyable publication.   Check this out!   SES and Julian are researching challenges and opportunities for Maker involving environmental, social, and corporate governance (ESG). They are currently asking the community’s opinion to help identify topics with potential business relevance. Check out the survey here. For more information:         Improved Governance Cycle The Protocol Engineering Core Unit has announced that executive proposals will be posted weekly on Wednesdays instead of Fridays. Increasing the time between polling and the executive will give development teams more time to safely deploy any contracts introducing protocol-level changes. Previously, polls have been made available on Mondays to finish on Thursday for deployment on Friday.  The limited-time available to deploy approved contracts led to several impactful issues, including:  It was not possible to adequately test spells on the Goerli testnet Working on two spells in parallel (Goerli and mainnet) is not a best practice It did not provide enough time to review and accept pull requests from other engineering teams  Moving the deployment of spells to Wednesday enables our engineers to address these issues and ensure a safer, more thorough development and deployment process.  In more detail:  GovAlpha will continue to launch polls as they do today, starting on Mondays and ending on Thursdays.  At the same time:  Protocol Engineering will have begun Goerli spell preparation at the beginning of the week, working with CES, Oracles, and others to merge pull requests into the Goerli spell. Protocol Engineering will update the Goerli spell with the spell copy provided by GovAlpha by Friday.  The following week:  Protocol Engineering will deploy the Goerli spell on Monday before starting the mainnet spell targeting deployment on Tuesday. Protocol Engineering will inform GovAlpha of the completed spell, who will then post it on the Governance Portal.  The next executive vote will take place on Wednesday, May 11th, instead of Friday, May 6th.     Maker Improvement Proposals (MIPs) Weekly MIPs Update #86 by @blimpa  1380×778 23.2 KB   May’s Formal Submission Window closed last Thursday; five proposals entered it and are now on-chain as Ratification Polls. These will run for two weeks and close on May 23. The latest possible date for posting proposals* that will enter June’s Governance Cycle is Wednesday 11. Ratification Polls will close in two weeks, on May 23. June’s Formal Submission Window opens on June 6.  RFC and FS Dates for reference and existing proposals can be seen on this proposal tracker. If you have any questions about the voting process at MakerDAO, the Practical Guide to Voting will be useful.  Executive Vote(s) There was no executive last week; all future executives will now be posted on Wednesdays as part of the new and improved Governance Cycle.  Active Governance Polls Please, check out the feedback survey mentioned at the head of this publication to help us improve Active Governance Polls. There are five active polls:     Poll Name Discussion     Monetalis Clydesdale, Liquid Bond Strategy & Execution (MIP65) Discussion   Monetalis Lusitano, UK Green Economy SME Wholesale Lending (MIP68) Discussion   L2-to-L1 Fast Withdrawals (MIP69) Discussion   MIP40 Budget Process Amendment (MIP4c2-SP19) Discussion   Strategic Happiness (SH-001) Core Unit Budget Modification (MIP40c3-SP67) Discussion    Check out May 2nd’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls Please, check out the feedback survey mentioned at the head of this publication to help us improve Community Greenlight Polls. There are two active community greenlight polls for the week of April 12 - April 18, 2022.     Greenlight Poll Current Vote Breakdown Begin Date End Date     ATDC (ATD Combustors)  2270×527 80.4 KB  May 2nd, 2022 at 16:00 UTC May 16th, 2022 at 16:00 UTC   IPCL (India Power Green Bonds)  2257×510 79.6 KB  May 2nd, 2022 at 16:00 UTC May 16th, 2022 at 16:00 UTC    Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests Maker Accessing Mortgage loans Through Bacon Protocol This proposal from @abdalla requests the onboarding of a Dai Direct Deposit Module (D3M) to create a Bacon Protocol Dai pool. BaconCoin is a stablecoin backed by US mortgages. Potential benefits include:  A single onboarding procedure that can scale both the amount of capital used and the number of home loans over time Broad distribution of Dai to homeowners in the US Higher risk-adjusted yields across a diversified set of home loans Maker selects the underwriting criteria to use, allowing for investing in loans that are highly aligned with Maker’s vision of funding sustainability initiatives Bacon will develop and maintain the D3M integration in line with the CES enablement strategy Governance has direct control over the Dai supply added to Bacon through the Debt Ceiling  @abdalla lists smart contract risk as a potential con but also offers two ideas for mitigating risks:  Whitelisting addresses with deposit functionality can reduce exploit risk (Maker would be the only liquidity provider) Credit risk assessment of borrowers can be performed by loan originators using the industry-standard FICO score  The vote will run until May 19th, 2022 Here are the current voting results:  1702×685 97.4 KB   Increase the ESM Minimum Threshold GovAlpha submitted a Signal Request to gauge support for increasing the minimum threshold to trigger the Emergency Shutdown Module (ESM) from 100,000 MKR to 150,000 MKR. GovAlpha recommends this adjustment to minimize the threat of a hostile emergency shutdown occurring. With the recent fall in the MKR price, triggering an emergency shutdown has become significantly cheaper based on the current minimum threshold. The goal is to find the right balance between making it very expensive for a bad actor to acquire or borrow enough MKR to trigger an emergency shutdown without making it overly difficult for a legitimate emergency shutdown to be triggered if necessary (for example, in response to the discovery of a critical bug in the Maker Protocol or the prevention of a malicious governance attack). The vote will run until May 20th, 2022 Here are the current voting results:  1655×687 109 KB   Antalpha Institutional Vault @William_Chiu has compiled recent discussions between the Growth, Risk, and Protocol Engineering Core Unites and Antalpha to propose a new institutional vault. The post outlines both the goals of the proposal and the mechanisms for achieving them. Goals  Boosting DAI Supply Generating greater revenue for MakerDAO and our partners Enhancing capital efficiency for our partners Longer-term borrowing commitment with a level of borrowing rate-predictability  Mechanisms  Boosting DAI Supply Generating greater revenue for MakerDAO and our partners Enhancing capital efficiency for our partners Longer-term borrowing commitment with a level of borrowing rate-predictability Origination fee: will be applied to all DAI at the time of minting. This is not restricted and is open to change via Governance (specifically the Parameter Changes Proposal group). Meaning that any partner will have a lead time of 2-3 weeks before any changes are implemented. Stability fee: is determined upfront and fixed for a period of time. This fixed rate can be reduced as additional collateral is added. Vault starting size: to ensure that such vaults will mint a minimum amount of DAI to gain favorable rates. Antalpha intends to utilize a DAI loan to strengthen the stable coin portion of the balance sheet to support one of its primary lending and borrowing businesses. Antalpha will take on collateral at a higher level than the level borrowing from DAI to implement proper credit risk management and utilize systems and algorithmic trading to facilitate managing the loans and collateral.  Proposed Terms     Institutional Vault Type Permissioned ETH and wBTC Vaults (INST-WBTC-5, INST-ETH-5)     Qualifying Vault size: 200MM   Debt Ceiling 1B, 500MM for ETH, and 500MM for wBTC   Origination fee: 1% of DAI minted   Origination fee behavior: Origination fee is not restricted and can be changed through Governance via a Parameter Changes Proposal. Antalpha has a 2-3 week lead-time to any Origination fee rate change.   Origination fee future commitments Maker and Antalpha will work together to propose reductions to the origination fee if the vault size grows significantly.   Stability fee: WBTC-A stability fee1 - 50bps & ETH-A stability fee2 - 50bps   Stability fee3 behavior: Fixed for six months. After the 200m DAI minted, an additional 100m DAI minted will reduce the stability fee by ten basis points (per vault) to a minimum of Stability fee-30bps for six months. The stability fee reduction will be manual via an executive vote. After six months, open community dialogue facilitated by the Growth CU will determine ongoing stability fees.   Collateral Ratio: 150%   Collateral Ratio Behavior: Failure to maintain 200% CR4 over the majority of seven days will increase the SF to 5% and the LR to 150%. The seven days would be calculated by ensuring that 95% of the OSM updates show that the CR is equal to or greater than 200%.   Liquidation Ratio: 120%    The vote will run until May 19th, 2022 Here are the current voting results:  1697×680 111 KB   Restart The Burn @aburban90 presents his request in favor of reactivating the MKR burn. He states that shutting down the burn also shut down our only revenue distribution model and that we have yet to replace it with anything better. These actions have caused some OG stakeholders to lose faith in our ability to deliver. Our community and stakeholders are very important, and there is a possibility we may be risking their confidence in us if we continue not to burn MKR during times of such low prices. In conclusion, Andrew asks the community whether we want to restart the burn with a reduced lid parameter to mitigate many of the inefficiencies. The vote will run until May 14th, 2022 Here are the current voting results:  1697×902 179 KB   Deploy the balance sheet in ETH As expressed in Towards taking asset risk and A balance sheet approach to an Aggressive Growth Strategy, ETH seems like a sound investment for MakerDAO. Sebastian from Strategic Finance moves forward on the Balance Sheet Approach toward an Aggressive Growth Strategy by gauging community sentiment on whether we would like to begin working on allocating some of the MakerDAO balance sheets into ETH and/or ETH derivatives: Pros:  MakerDAO is using Ethereum as its home base and is therefore linked to the success of ETH. ETH is a strategic asset for the operations of the DAO because it pays gas fees for on-chain transactions and oracles. Competitors like Celo, TribeDAO, and Angle are holding ETH on their balance sheet, and not holding ETH puts Maker at a distinct competitive disadvantage. The upcoming Merge will significantly reduce the issuance of new ETH and create a competitive market for balance sheets with a high degree of exposure to ETH. Post-Merge staking fees are currently estimated at 7-11%, doubling current staking yields overnight and making ETH a truly productive asset.  Cons:  ETH is a volatile asset whose ETH/DAI price can wildly fluctuate and occasionally go down over significant periods The Merge and L2 impacts can have unexpected long-term impacts on price.  Sebastian also notes that this Signal Request aims to understand whether there is a community desire to work on this topic. No priority is currently being attributed, and a formal implementation for such actions will have to go through the governance processes. The vote will run until May 12th, 2022 Here are the current voting results:  1705×912 190 KB   Change lid Parameter on the Rate Limiter The passing and introduction of the Rate Limiting Flapper have been successful, but it only allows to kick off a new auction if the new auction does not increase the total-DAI-currently-in-auction above a certain threshold - the lid unless it’s at the same value as the bump. Currently, the value for the lid is set to 150k Dai, which can run five flap auctions at once. However, ultraschuppi believes there is no good reason to burn so much MKR and proposes setting the lid to the same value as bump - 30,000 Dai. Having a 1:1 ‘lid’ to ‘bump’ ratio will ensure that there is only one parallel flap auction running at any given time. What’s good about this is that in the case of a huge spike on the System Surplus causing spillage to the Surplus Buffer, the time spread of those resulting auctions will be 5x compared to the current setting, thereby producing a more steady burn. However, we will limit the maximum MKR burnt per day from 7.2MM Dai to 1.44MM Dai in sacrifice. Vote will run until May 13, 2022. Here are the current voting results:  1697×632 104 KB       Tweet of the Week  For those who need some joy in times of market uncertainty     twitter.com    kianga.eth 🌍 1000 ACRE DAOs in 1000 Days @fhomoney  OMG, just found this video looking for something in my phone!   ⁦⁦@degenwizard⁩ is a national treasure. Drove out of his way to meet me.   Behold the power of SWAG love. To all the haters in the ⁦@MakerDAO⁩ Forum… you can’t put a price on this kind of Joy.  😜😘 https://t.co/GQQAYSbxaK         3:32 PM - 5 May 2022           40                4             In The News   Oasis.app Launches Stop-Loss Protection  1240×688 156 KB  A new feature is available for Maker vaults on Oasis.app called Stop-Loss Protection. Stop-Loss Protection will ensure that a vault will close out automatically if the collateralization ratio hits a preset threshold and protect against liquidation. Setting it up has no additional cost except the gas fees for the transaction. However, it is impossible to know the gas and swap costs at the moment of the transaction. The value shown before execution is an approximate value that may slightly differ from the actual value. To learn how to set up a Stop-Loss Protection or how it works, check out their blog.     Today!  Collateral Onboarding Call #42: Monetalis MIP65 & MIP68 AMA | May 10 at 5PM UTC   Forum | Join Call      Last Week’s Call Recordings  Governance & Risk: Episode 189 | Video | Forum    Governance & Risk   Join Link | Agenda - Thursdays at 17:00 UTC  Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Real World Finance - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC     Useful Links Open Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auction data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.    Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @nothsa and @Artem_Gordon ",
                    "links": [
                        "https://medium.com/@MkrGovComms",
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://docs.google.com/forms/d/e/1FAIpQLSc0MsZv8qFQfoJh5w15atJHfC-UknCNChoEP-jU5UfDXMVewQ/viewform?usp=sf_link",
                        "https://www.youtube.com/watch?v=V5bliF28cbM",
                        "https://forum.makerdao.com/t/governance-cadence-improvement/14972",
                        "https://forum.makerdao.com/t/weekly-mips-update-86-may-9-2022/15058",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://forum.makerdao.com/t/governance-cadence-improvement/14972",
                        "https://vote.makerdao.com/polling/QmXHM6us#poll-detail",
                        "https://forum.makerdao.com/t/mip40c3-sp62-modify-core-unit-budget-com-001/13724",
                        "https://vote.makerdao.com/polling/QmS7UyQT#poll-detail",
                        "https://forum.makerdao.com/t/mip68-monetalis-lusitano-uk-green-economy-sme-wholesale-lending/13789",
                        "https://vote.makerdao.com/polling/QmWZvSpa#poll-detail",
                        "https://forum.makerdao.com/t/mip69-l2-to-l1-fast-withdrawals/14041",
                        "https://vote.makerdao.com/polling/QmXVjbWG#poll-detail",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
                        "https://vote.makerdao.com/polling/QmQkxx16#poll-detail",
                        "https://forum.makerdao.com/t/mip40c3-sp67-modify-core-unit-budget-strategic-happiness-sh-001/13805",
                        "https://forum.makerdao.com/t/weekly-relay-april-26-may-2-2022/14939",
                        "https://vote.makerdao.com/polling/QmRH6Bf6#poll-detail",
                        "https://vote.makerdao.com/polling/QmUQ7VDA#poll-detail",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-maker-accessing-mortgage-loans-through-bacon-protocol/15043",
                        "https://www.baconcoin.finance/",
                        "https://forum.makerdao.com/t/signal-request-increase-the-esm-minimum-threshold/15006",
                        "https://forum.makerdao.com/t/signal-request-antalpha-institutional-vault/15030",
                        "https://www.antalpha.com/",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn-v2/14918",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688",
                        "https://twitter.com/fhomoney/status/1522237761331286025",
                        "https://twitter.com/fhomoney/status/1522237761331286025",
                        "https://twitter.com/fhomoney/status/1522237761331286025",
                        "https://t.co/GQQAYSbxaK",
                        "https://twitter.com/fhomoney/status/1522237761331286025",
                        "https://blog.oasis.app/oasis-app-launches-stop-loss-protection/",
                        "https://blog.oasis.app/oasis-app-launches-stop-loss-protection/",
                        "https://www.google.com/url?q=https://forum.makerdao.com/t/collateral-onboarding-call-42-monetalis-mip65-mip68-ama/14829&sa=D&source=calendar&ust=1652630699341674&usg=AOvVaw0JSicO26bUbRsk2mAhd-WP",
                        "https://www.google.com/url?q=https://www.crowdcast.io/c/collateral-call-42&sa=D&source=calendar&ust=1652630699341674&usg=AOvVaw0-L_cGUuBOMQruh3UV_AdP",
                        "https://www.youtube.com/watch?v=ZJSmzCTSbsA",
                        "https://forum.makerdao.com/t/governance-and-risk-189-thursday-may-05-17-00-utc/14965",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-may-2022/15742"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5675513588975125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "0",
                    "time": "13/05/2022-16:29:00",
                    "content": "    Artem_Gordon:  Tweet of the Week   Handing out Swag to those who need it most hehe. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/05/2022-16:29:35",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346",
            "title": "Weekly Relay | May 17 - 23, 2022 ",
            "index": 15346,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "8",
                    "time": "24/05/2022-15:52:18",
                    "content": " 1727×390 306 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop shop for MakerDAO updates.  Online PDF Version | Show some love to our Medium account   We have some new ideas for improvement and would appreciate your feedback to help make the Weekly Relay more enjoyable publication.     The Endgame Plan and Voter Committees  Last Thursday, MakerDAO co-founder @rune made a public presentation of the Endgame Plan, a long-term plan for MakerDAO with “a fully defined, immutable steady state as its end goal.” The idea involves a comprehensive overhaul of MakerDAO governance practices, narrowing the focus so that MKR holders can realistically stay up to date with important happenings in Maker governance. The plan centers around the idea of MetaDAOs, in turn, an evolution of the idea of SubDAOs or DAO Pods—in essence, “smaller and specialized DAOs that are connected to a main ‘mothership DAO’ (Maker in this case) through shared tokenomics, incentives and/or infrastructure.” @rune argues that MetaDAOs can help us solve most or all of the problems MakerDAO is currently being confronted with, as well as helping us make the best decisions in cases where trade-offs are unavoidable. Discussion of @rune’s latest series of calls and ideas is ongoing in The MKR holder Confessional. The MKR Holder Voter Committee Public Call is available every Tuesday at 3 PM UTC  Join Link  Real World Finance: Decision-Making and Delegated Committee Proposal @christiancdpetersen of the Real World Finance Core Unit made a post outlining a proposal for a decision-making methodology for Real-World Assets (RWAs) after they have already been onboarded as collateral. In a nutshell, the proposal involves delegating a slice of decision-making to a committee of volunteers approved by MKR token holders. This proposal’s primary motivation is that RWAs require a wider range of decision-making than crypto-native assets.  Maker needs a methodology for managing onboarded RWA collateral that is:  Transparent Practical Commercially reasonable Responsive to MKR token holders  In the TradFi world, “high-impact” decisions are referred to as “Lender’s Sacred Rights.” In the context of MakerDAO, we can view these rights as follows:  Once these rights are well defined, other, lower-impact decisions can be delegated to an independent third-party committee of volunteers.  The Real World Finance Core Unit proposes establishing an independent Committee of Delegated Maker Representatives to handle decision-making for issues not included in the high-impact “sacred rights” category.  Some initial ideas for criteria potential volunteers should satisfy include:  Traditional finance experience (commercial, legal, executive, risk, etc.) and/or experience with the particular asset class at hand Willingness to be a decision-maker on matters delegated to the Committee Willingness to review and make decisions on complex issues quickly, given commercial timelines Willingness to sign a Non-Disclosure Agreement with the borrower, as the delegate may have access to confidential, non-public information Willingness to represent the Maker community No economic interest in the proposed borrower or the proposed asset (subject to standard carve-outs for non-material ownership interests in public companies) No economic interest in an existing borrower or an asset already onboarded into Maker  If interested, contact @eumenes or @christiancdpetersen on the forums. Governance Stats and Tracker Dashboard  761×215 10.1 KB  GovAlpha has introduced v1 of its Governance Dashboard, providing visualization tools for important stats and metrics related to governance and delegation.  Some of the data available includes:  MKR delegated and delegator count for all recognized and shadow delegates, as well as total amounts for all delegates Total and individual amount of MKR staked and delegated Current and historical vote weights for delegates Number of poll voters per month   The Tracker section includes GovAlpha’s Governance Tracker, together with extra functionality, such as custom filters for active proposals, high-impact proposals, and proposals ending this week. [Postponed] Focus On #12: Centrifuge Indenture Trust Agreement Deep Dive The 12th episode of Focus On, originally scheduled for May 21st, has been postponed due to illness. If you’re interested in a joint discussion by Centrifuge and the Legal & Transaction Services Core Unit (currently under incubation) to discuss the development of Centrifuge’s legal structure, keep an eye on the forums for an announcement about the new date. General Counsel of Centrifuge Eli Cohen (@elidco) and Legal & Transaction Services Core Unit member Christian Petersen (@christiancdpetersen) will explore:  The goal of the agreement How the agreement works in practice How the structure will scale real-world assets for both Centrifuge and MakerDAO      Executive Vote Foundational L2 Work, Authorize New Flash Mint Module, MKR Vesting - May 18, 2022 This executive proposal passed, and the following changes occurred within the Maker Protocol:  Core Unit MKR Vesting Transfer As per their successful MKR budget proposal, a total of 541.47 MKR was transferred to the Sustainable Ecosystem Scaling Core Unit (SES-001).  Foundational L2 Work The Maker Teleport initiative, previously known as Maker Wormhole, will be bringing canonical DAI capability onto L2 domains. As part of this development and to support L2->L1 fast-withdrawal functionality, it is necessary to introduce a new module called DssCure and update the existing MCD_END module to interact with it.  A new DssCure module was added to the Maker Protocol as MCD_CURE in the chainlog. The MCD_END module was replaced by a new version that interacts with MCD_CURE. The existing ESM contract MCD_ESM was made to point to the new MCD_END.  For more details, please read this forum post by the Protocol Engineering Core Unit (PE-001).  New Flash Mint Module  As described in this forum post, the following changes occurred:  A new Flash Mint Module was deployed and authorized. The new module has no fee parameter and charges no fee to save on gas. The Debt Ceiling was set to 250M on the new module and reduced to 250M on the existing module to maintain 500M total. Both modules are available in the chainlog as MCD_FLASH_LEGACY and MCD_FLASH. The intention is to remove the MCD_FLASH_LEGACY contract in a future executive proposal once usage has shifted to the new version.   Active Governance Polls Please, check out the feedback survey mentioned at the head of this publication to help us improve Active Governance Polls. There are three active polls:     Poll Name Discussion     Investigate Implementation of an Antalpha Institutional Vault Discussion   Investigate Deploying the MakerDAO Balance Sheet in ETH Discussion   Launch Maker Teleport with 1 Basis Point Fee Discussion    Check out May 16th’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls Please, check out the feedback survey mentioned at the head of this publication to help us improve Community Greenlight Polls. There is one active community greenlight poll for the week of May 10 - 16, 2022.     Greenlight Poll Current Vote Breakdown Begin Date End Date     FEI (Fei USD)  2327×610 82.1 KB  May 16th, 2022 at 16:00 UTC May 30th, 2022 at 16:00 UTC    Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests Do you believe Signal Requests are valuable in the Weekly Relay? Should we omit them and keep them only in the Forum at a Glance? We are discussing trimming any redundancies and low-value sections from the GovComm publications; let us know if you have any ideas, opinions, or feedback. Thanks! Request Return of MKR Tokens Inadvertently Sent to Governance Address wingstick_99942 inadvertently sent 3.1994 MKR to the MKR Governance Address and submitted a signal request in hopes of a way to return that MKR to the sender’s address. Several Core Unit members and Recognized Delegates stated the unfortunate reality that it is impossible to return MKR from the Governance Address because nobody has keys or control over that address. The vote will run until May 30th, 2022 Here are the current voting results:  1675×737 103 KB   Offboard UNI, UNIV2DAIETH, UNIV2WBTCETH, UNIV2UNIETH, and UNIV2WBTCDAI This signal request was prepared by the CMON (Collateral Management On-chain) initiative and its stakeholders, including different CES-led core units. Due to lack, they propose to offboard UNI-A, UNIV2DAIETH-A, UNIV2WBTCETH-A, UNIV2UNIETH-A, and UNIV2WBTCDAI-A of demand and consequent negative cash flow. The main problem with these vault types is pure lack of demand as the underlying assets (ETH, WBTC, and UNI) have relatively high on-chain liquidity. MOMC attempted to make them more attractive by lowering the SF at the end of January, but demand, unfortunately, didn’t increase. Proposed parameters were set in a way where we try to minimize the damage done to existing vault owners while ensuring that sufficient amounts of debt will either be repaid or, less desirable, liquidated with minimal costs for the vault owners. Proposed parameter changes;  Set liquidation penalty to 0% Set debt ceiling to 0 Set tip to 0 Set duration of dss-lerp for liquidation ratio to 30 days Set the end parameter of dss-lerp for liquidation ratio for each vault type as the following; highest collateral ratio vault within each vault type multiplied by 3, rounded on hundred.  The vote will run until May 26th, 2022 Outcomes will either result in on-chain polls assuming the outcomes are yes, or will be reinitiated with different parameters and/or strategies. Here are the current voting results:  1685×722 108 KB   1670×670 109 KB   1670×670 110 KB   1670×680 106 KB   1670×680 111 KB       Last Week’s Call Recordings:  Governance & Risk Episode 191 | Video | Forum   Upcoming Calls:  Meet Your Delegate #12 - London Business School (LBS) and [email protected] | Forum | Join  Open Decentralized Voter Committee | Forum | Join Link  Governance & Risk Call | Join Link | Agenda - Thursdays at 17:00 UTC  Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Real World Finance - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC  Join Link | 6S Capital - Every Other Wednesday 14:00 UTC     MIPs, Links, and Resources Open Weekly MIPs Update Ratification polls, proposals, and pre-MIP discussions. Forum and Maker Discord Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auction data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.    Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @nothsa and @Artem_Gordon ",
                    "links": [
                        "https://medium.com/@MkrGovComms",
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://forum.makerdao.com/t/the-endgame-plan-call-thursday-5pm-cest-everyone-welcome/15263",
                        "https://forum.makerdao.com/t/the-mkr-holder-confessional/15164/38",
                        "https://us02web.zoom.us/j/88228343729",
                        "https://forum.makerdao.com/t/real-world-finance-decision-making-and-delegated-committee-proposal/15276",
                        "https://forum.makerdao.com/t/introducing-the-governance-stats-and-tracker-dashboard/15324",
                        "https://www.makerdao-governance-dashboard.com",
                        "https://docs.google.com/spreadsheets/d/1LWNlv6hr8oXebk8rvXZBPRVDjN-3OrzI0IgLwBVk0vM/edit#gid=0",
                        "https://forum.makerdao.com/t/postponed-focus-on-12-centrifuge-indenture-trust-agreement-deep-dive/15262",
                        "https://vote.makerdao.com/executive/template-executive-vote-foundational-l2-work-authorize-new-flash-mint-module-mkr-vesting-may-18-2022#proposal-detail",
                        "https://mips.makerdao.com/mips/details/MIP40c3SP17",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP10",
                        "https://forum.makerdao.com/t/introducing-maker-wormhole/11550",
                        "https://forum.makerdao.com/t/maker-wormhole-new-name-maker-teleport/15115",
                        "https://forum.makerdao.com/t/wednesday-18th-may-executive-dsscure-technical-enhancement/15175",
                        "https://manual.makerdao.com/module-index/module-flash-mint-module",
                        "https://forum.makerdao.com/t/wednesday-18th-may-executive-flash-mint-module-technical-enhancement/15176",
                        "https://vote.makerdao.com/polling/QmNpELvR#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-antalpha-institutional-vault/15030",
                        "https://vote.makerdao.com/polling/QmQRhmQa#poll-detail",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://vote.makerdao.com/polling/QmahjYA2",
                        "https://forum.makerdao.com/t/signal-request-launch-maker-teleport-with-1-basis-point-fee/15109",
                        "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
                        "https://vote.makerdao.com/polling/Qmbzebcq",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/request-return-of-mkr-tokens-inadvertantly-sent-to-governance-address/15221",
                        "https://forum.makerdao.com/t/signal-request-offboard-uni-univ2daieth-univ2wbtceth-univ2unieth-and-univ2wbtcdai/15160",
                        "https://www.youtube.com/watch?v=sSKWsFlNBz4",
                        "https://forum.makerdao.com/t/governance-and-risk-191-thursday-may-19-at-17-00-utc/15252",
                        "https://forum.makerdao.com/t/meet-your-delegate-12-london-business-school-lbs-and-blockchain-columbia/15218",
                        "https://www.google.com/url?q=https://us02web.zoom.us/j/81440375268?pwd%3DGwPHyS5sNota-EOXOwxinf8cpOPBnu.1&sa=D&source=calendar&ust=1653748401660467&usg=AOvVaw1JowlqM6O-2dIgLY2AM8BL",
                        "https://forum.makerdao.com/t/the-endgame-plan-call-thursday-5pm-cest-everyone-welcome/15263",
                        "https://us02web.zoom.us/j/88228343729",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://us02web.zoom.us/j/81560369659",
                        "https://forum.makerdao.com/t/weekly-mips-update-88/15329",
                        "https://forum.makerdao.com",
                        "https://discord.gg/YtBXXYuVDB",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-17-23-de-mayo-del-2022/15392",
                        "https://forum.makerdao.com/t/weekly-relay-may-24-30-2022/15488",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-may-2022/15742"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.519960872460873
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/06/2022-15:52:41",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/weekly-relay-may-10-16-2022/15238",
            "title": "Weekly Relay | May 10 - 16, 2022 ",
            "index": 15238,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "weekly-relay"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "5",
                    "time": "17/05/2022-19:23:33",
                    "content": " 1727×390 307 KB  Hi everyone, thanks for checking out the Weekly Relay! Whether you hold MKR or DAI, own a vault, or want to get more involved in governance, this is your one-stop-shop for MakerDAO updates.  Online PDF Version | Show some love to our Medium account   We have some new ideas for improvement and would appreciate your feedback to help make the Weekly Relay a more enjoyable publication.     Decentralized Voter Committee Citing the decentralization risk inherent in any large system such as a DAO that falls prey to a “complexity spiral”—in which it becomes increasingly difficult for anyone but a full-time professional DAO member to develop and maintain a complete understanding of the inner workings of the DAO and how decisions are made—MakerDAO co-founder @rune has shared his Endgame Plan strategy, which aims to:  Establish principles that enshrine radical decentralization and transparency as fundamental pillars for how governance works Create a bounded, immutable scope of Maker Governance it cannot expand beyond to prevent organic complexity growth  The first step of the Endgame Plan is to establish Decentralized Voter Committees, in which MKR holders are provided a “safe space” to air their concerns, discuss their interests, and coordinate on votes. These committees will take the form of transparent, recorded conference calls available both to members of the DAO and to the general public. The first Decentralized Voter Committee took place on Tuesday, May 17th, at 5 pm CEST (3 pm UTC). The video recording will soon be available along with a semi-transcription summary. The first Decentralized Voter Committee was designed to serve as “a bit of a test run” and will likely focus on bringing in larger MKR holders, who “have more skin in the game and a larger sway on votes.” A thread for discussing potential topics and ideas for the first meeting is available here.     Maker Improvement Proposals (MIPs) Weekly MIPs Update #87 by @gala  1124×755 27.2 KB  Proposals:  Five proposals that have been formally submitted for the May Governance Cycle are now entering their second-week on-chain as Ratification Polls. The current leading option is Yes for all of them. We have eight active proposals currently in RFC.  Dates:  Ratification Polls will close next Monday, May 23. Last day of modifications for Proposals entering June’s Governance Cycle is Wednesday, June 1st. June’s Formal Submission Window opens on June 6.  Resources:  RFC and FS Dates for reference and existing proposals can be seen on this proposal tracker. If you have any questions about the voting process at MakerDAO, the Practical Guide to Voting will be useful.   Executive Vote(s) Recognized Delegate Payments, Lowering WBTC Stability Fees, and Onboarding wstETH-B - May 11, 2022 This executive proposal passed, and the following changes occurred within the Maker Protocol:  Recognized Delegate Compensation As per MIP61: Recognized Delegate Compensation, a total of 79,647 DAI was distributed to ten Recognized Delegates: Recognized Delegate Compensation Payments: May 2022 A total of 77,183 DAI was distributed to nine Recognized Delegates:     DAI Transferred Delegate     12,000 DAI FlipFlopFlap Delegate LLC   12,000 DAI schuppi   12,000 DAI Feedblack Loops LLC   10,929 DAI MakerMan   9,347 DAI ACREinvest   8,626 DAI monetsupply   7,522 DAI JustinCase   6,607 DAI GFX Labs   351 DAI Doo   265 DAI Flipside Crypto      Lower WBTC-A and WBTC-B Stability Fees As per this governance poll on the latest proposal from the MakerDAO Open Market Committee, the following Stability Fee changes were made in the Maker Protocol:  Lowered the WBTC-A Stability Fee from 3.25% to 2.25%. Lowered the WBTC-B Stability Fee from 4.5% to 4.0%.   Onboard wstETH-B as a New Vault Type As per this governance poll, following this recomendation from the Risk Core Unit, wstETH-B was onboarded to the Maker Protocol with the following parameters: Note that this proposed Vault Type was previously discussed as wstETH-C; however, it will be added under the wstETH-B ilk name to maintain sequential naming conventions as discussed here.     Parameter Amount     Stability Fee 0.75%   Liquidation Ratio 185%   Maximum Debt Ceiling 150MM DAI   Debt Floor 5,000 DAI   Target Available Debt 15MM DAI   Ceiling Increase Cooldown 8 hours   Auction Price Function Exponential Stair Step   Price Change Multiplier 0.99   Price Change Interval 90 seconds   Auction Price Multiplier 1.2   Liquidation Penalty 13%   Local Liquidation Limit 10MM DAI   Maximum Auction Drawdown 0.4   Maximum Auction Duration 140 minutes   Breaker Price Tolerance 0.5   Proportional Kick Incentive 0.1%   Flat Kick Incentive 300 DAI     Active Governance Polls Please, check out the feedback survey mentioned at the head of this publication to help us improve Active Governance Polls. There are five active polls:     Poll Name Discussion     Raise the ESM Minimum Threshold Discussion   Adjust the lid Parameter on the Rate Limited Flapper Discussion   Ratification Poll for Monetalis Clydesdale, Liquid Bond Strategy & Execution Discussion   Ratification Poll for Monetalis Lusitano, UK Green Economy SME Wholesale Lending Discussion   Ratification Poll for L2-to-L1 Fast Withdrawals Discussion   Ratification Poll for MIP40 Budget Process Amendment Discussion   Ratification Poll for Strategic Happiness (SH-001) Core Unit Budget Modification Discussion    Check out May 9th’s issue of Weekly Relay for more information on the most recently concluded polls.  Community Greenlight Polls Please, check out the feedback survey mentioned at the head of this publication to help us improve Community Greenlight Polls. There is one active community greenlight poll for the week of May 10 - 16, 2022.     Greenlight Poll Current Vote Breakdown Begin Date End Date     FEI (Fei USD)  2325×607 75.5 KB  May 16th, 2022 at 16:00 UTC May 30th, 2022 at 16:00 UTC    Check out an “at-a-glance” view of the current Vault types and their parameters on MakerBurn.  Active Signal Requests Request Return of MKR Tokens Inadvertently Sent to Governance Address wingstick_99942 inadvertently sent 3.1994 MKR to the MKR Governance Address and submitted a signal request in hopes of a way to return that MKR to the sender’s address. Several Core Unit members and Recognized Delegates stated the unfortunate reality that it is impossible to return MKR from the Governance Address because nobody has keys or control over that address. The vote will run until May 30th, 2022 Here are the current voting results:  1692×692 88.8 KB   Offboard UNI, UNIV2DAIETH, UNIV2WBTCETH, UNIV2UNIETH, and UNIV2WBTCDAI This signal request was prepared by the CMON (Collateral Management On-chain) initiative and its stakeholders, including different Core Units led by CES. Due to lack, they propose to offboard UNI-A, UNIV2DAIETH-A, UNIV2WBTCETH-A, UNIV2UNIETH-A, and UNIV2WBTCDAI-A of demand and consequent negative cash flow. The main problem with these vault types is pure lack of demand as the underlying assets (ETH, WBTC, and UNI) have relatively high on-chain liquidity. MOMC attempted to make them more attractive by lowering the SF at the end of January, but demand, unfortunately, didn’t increase. Proposed parameters were set in a way where we try to minimize the damage done to existing vault owners while ensuring that sufficient amounts of debt will either be repaid or, less desirable, liquidated with minimal costs for the vault owners. Proposed parameter changes;  Set liquidation penalty to 0% Set debt ceiling to 0 Set tip to 0 Set duration of dss-lerp for liquidation ratio to 30 days Set the end parameter of dss-lerp for liquidation ratio for each vault type as the following; highest collateral ratio vault within each vault type multiplied by 3, rounded on hundred.  The vote will run until May 26th, 2022 Outcomes will either result in on-chain polls assuming the outcomes are yes, or will be reinitiated with different parameters and/or strategies. Here are the current voting results:  1677×725 99 KB   1677×662 96 KB   1677×662 97.7 KB   1690×685 96.9 KB   1690×685 96.4 KB   Launch Maker Teleport with one basis point fee Maker Teleport, known until recently as Maker Wormhole, will launch with two key advantages over other asset bridges:  Teleport will allow users to withdraw L2 funds at near-instant speeds by side-stepping the need to wait for fraud-proof. Teleport will burn Dai on the origin chain and mint it on the destination chain without any need for a centralized party.  With these features in place, Maker Teleport is expected to be faster and more secure than an existing competitor; even with a one basis point fee, Teleport is estimated to remain 75-99% cheaper than competing protocols. While one basis point may seem low, the Strategic Finance Core Unit believes that Teleport will experience strong growth, leading to significant revenues for Maker. Teleport Fee Parameters per Domain  Set the Arbitrum Wormhole Fee parameter to 1 bp Set the Optimism Wormhole Fee parameter to 1 bp  The vote will run until May 19th, 2022 Here are the current voting results:  1702×797 135 KB   Maker Accessing Mortgage loans Through Bacon Protocol This proposal from @abdalla requests the onboarding of a Dai Direct Deposit Module (D3M) to create a Bacon Protocol Dai pool. BaconCoin is a stablecoin backed by US mortgages. Potential benefits include:  A single onboarding procedure that can scale both the amount of capital used and the number of home loans over time Broad distribution of Dai to homeowners in the US Higher risk-adjusted yields across a diversified set of home loans Maker selects the underwriting criteria to use, allowing for investing in loans that are highly aligned with Maker’s vision of funding sustainability initiatives Bacon will develop and maintain the D3M integration in line with the CES enablement strategy Governance has direct control over the Dai supply added to Bacon through the Debt Ceiling  @abdalla lists smart contract risk as a potential con but also offers two ideas for mitigating risks:  Whitelisting addresses with deposit functionality can reduce exploit risk (Maker would be the only liquidity provider) Credit risk assessment of borrowers can be performed by loan originators using the industry-standard FICO score  The vote will run until May 19th, 2022 Here are the current voting results:  1695×685 112 KB   Increase the ESM Minimum Threshold GovAlpha submitted a Signal Request to gauge support for increasing the minimum threshold to trigger the Emergency Shutdown Module (ESM) from 100,000 MKR to 150,000 MKR. GovAlpha recommends this adjustment to minimize the threat of a hostile emergency shutdown occurring. With the recent fall in the MKR price, triggering an emergency shutdown has become significantly cheaper based on the current minimum threshold. The goal is to find the right balance between making it very expensive for a bad actor to acquire or borrow enough MKR to trigger an emergency shutdown without making it overly difficult for a legitimate emergency shutdown to be triggered if necessary (for example, in response to the discovery of a critical bug in the Maker Protocol or the prevention of a malicious governance attack). The vote will run until May 20th, 2022 Here are the current voting results:  1700×702 110 KB   Antalpha Institutional Vault @William_Chiu has compiled recent discussions between the Growth, Risk, and Protocol Engineering Core Unites and Antalpha to propose a new institutional vault. The post outlines both the goals of the proposal and the mechanisms for achieving them. Goals  Boosting DAI Supply Generating greater revenue for MakerDAO and our partners Enhancing capital efficiency for our partners Longer-term borrowing commitment with a level of borrowing rate-predictability  Mechanisms  Boosting DAI Supply Generating greater revenue for MakerDAO and our partners Enhancing capital efficiency for our partners Longer-term borrowing commitment with a level of borrowing rate-predictability-   Origination fee: will be applied to all DAI at the time of minting. This is not restricted and is open to change via Governance (specifically the Parameter Changes Proposal group). Meaning that any partner will have a lead time of 2-3 weeks before any changes are implemented. Stability fee: is determined upfront and fixed for a period of time. This fixed rate can be reduced as additional collateral is added. Vault starting size: to ensure that such vaults will mint a minimum amount of DAI to gain favorable rates. Antalpha intends to utilize a DAI loan to strengthen the stable coin portion of the balance sheet to support one of its primary lending and borrowing businesses. Antalpha will take on collateral at a higher level than the level borrowing from DAI to implement proper credit risk management and utilize systems and algorithmic trading to facilitate managing the loans and collateral.  Proposed Terms     Institutional Vault Type Permissioned ETH and wBTC Vaults (INST-WBTC-5, INST-ETH-5)     Qualifying Vault size: 200MM   Debt Ceiling 1B, 500MM for ETH, and 500MM for wBTC   Origination fee: 1% of DAI minted   Origination fee behavior: Origination fee is not restricted and can be changed through Governance via a Parameter Changes Proposal. Antalpha has a 2-3 week lead-time to any Origination fee rate change.   Origination fee future commitments Maker and Antalpha will work together to propose reductions to the origination fee if the vault size grows significantly.   Stability fee: WBTC-A stability fee1 - 50bps & ETH-A stability fee2 - 50bps   Stability fee3 behavior: Fixed for six months. After the 200m DAI minted, an additional 100m DAI minted will reduce the stability fee by ten basis points (per vault) to a minimum of Stability fee-30bps for six months. The stability fee reduction will be manual via an executive vote. After six months, open community dialogue facilitated by the Growth CU will determine ongoing stability fees.   Collateral Ratio: 150%   Collateral Ratio Behavior: Failure to maintain 200% CR4 over the majority of seven days will increase the SF to 5% and the LR to 150%. The seven days would be calculated by ensuring that 95% of the OSM updates show that the CR is equal to or greater than 200%.   Liquidation Ratio: 120%     Here are the current voting results:  1690×690 116 KB   The vote will run until May 19th, 2022    Last Week’s Call Recordings:  Governance & Risk: Episode 190 | Video | Forum  Collateral Onboarding Call #43 | Fei & Rari Pools Use Cases   video | Forum    Collateral Onboarding Call #42 | Monetalis MIP65 & MIP68 AMA   video | Forum     Upcoming Calls:  Meet Your Delegate #12 - London Business School (LBS)   Forum | Join Link 2022-05-25T18:30:00Z     Governance & Risk Call:   Join Link | Agenda - Thursdays at 17:00 UTC  Core Unit Office Hours   Join Link | GovAlpha Governance Q&As - Mondays 17:00 UTC  Join Link | Immunefi Security - Tuesdays 00:00 UTC  Join Link | Protocol Engineering - Tuesdays 15:00 UTC  Join Link | Sustainable Ecosystem Scaling - Tuesdays 15:30 UTC  Join Link | Growth - Wednesdays 17:00 UTC  Join Link | Real World Finance - Wednesdays 17:00 UTC  Join Link | Governance Communications - Fridays 18:00 UTC     Useful Links Open Forum and Maker Chat Discuss and debate MakerDAO. Call Calender | Votes & Event Calendar Subscribe to both for all public calls, votes, and other reminders. Participation Tools Library of useful links for stakeholders: protocol analytics, DAI analytics, collateral & liquidation metrics, governance history, and auction data. Governance Portal Voting dashboard for MKR voters. MIPs Portal MIPs dashboard for everyone. Learning Portal and Technical Documentation Learn more about the Maker protocol.    Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @nothsa and @Artem_Gordon ",
                    "links": [
                        "https://medium.com/@MkrGovComms",
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://forum.makerdao.com/t/decentralized-voter-committee-on-tuesday-5pm-cest-all-mkr-holders-welcome/15166",
                        "https://forum.makerdao.com/t/the-mkr-holder-confessional/15164/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-87/15220",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://vote.makerdao.com/executive/template-executive-vote-recognized-delegate-payments-lowering-wbtc-stability-fees-and-onboarding-wsteth-b-may-11-2022",
                        "https://mips.makerdao.com/mips/details/MIP61",
                        "https://vote.makerdao.com/address/0xaf8aa6846539033eaf0c3ca4c9c7373e370e039b",
                        "https://vote.makerdao.com/address/0xb21e535fb349e4ef0520318acfe589e174b0126b",
                        "https://vote.makerdao.com/address/0x845b36e1e4f41a361dd711bda8ea239bf191fe95",
                        "https://vote.makerdao.com/address/0x22d5294a23d49294bf11d9db8beda36e104ad9b3",
                        "https://vote.makerdao.com/address/0x4d3ac33ab1dd7b0f352b8e590fe8b62c4c39ead5",
                        "https://vote.makerdao.com/address/0x45127ec92b58c3a89e89f63553073adcaf2f1f5f",
                        "https://vote.makerdao.com/address/0xcdb792c14391f7115ba77a7cd27f724fc9ea2091",
                        "https://vote.makerdao.com/address/0xf60d7a62c98f65480725255e831de531efe3fe14",
                        "https://vote.makerdao.com/address/0x8804d391472126da56b9a560aef6c6d5aaa7607b#delegate-credentials",
                        "https://vote.makerdao.com/address/0x84b05b0a30b6ae620f393d1037f217e607ad1b96",
                        "https://vote.makerdao.com/polling/QmTmehbz#poll-detail",
                        "https://forum.makerdao.com/t/parameter-changes-proposal-ppg-omc-001-28-april-2022/14863",
                        "https://forum.makerdao.com/t/parameter-proposal-group-makerdao-open-market-committee/7355",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://manual.makerdao.com/parameter-index/vault-risk/param-stability-fee",
                        "https://vote.makerdao.com/polling/QmaE5doB#poll-detail",
                        "https://forum.makerdao.com/t/introduction-risk-parameters-for-wsteth-c-vault/14669",
                        "https://mips.makerdao.com/mips/details/MIP39c2SP2",
                        "https://forum.makerdao.com/t/ilk-names-versus-display-names-for-vault-types/14759",
                        "https://vote.makerdao.com/polling/QmQgab4a",
                        "https://forum.makerdao.com/t/signal-request-increase-the-esm-minimum-threshold/15006",
                        "https://vote.makerdao.com/polling/QmREdTJK",
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688",
                        "https://vote.makerdao.com/polling/QmXHM6us",
                        "https://forum.makerdao.com/t/mip65-monetalis-clydesdale-liquid-bond-strategy-execution/13148",
                        "https://vote.makerdao.com/polling/QmS7UyQT",
                        "https://forum.makerdao.com/t/mip68-monetalis-lusitano-uk-green-economy-sme-wholesale-lending/13789",
                        "https://vote.makerdao.com/polling/QmWZvSpa",
                        "https://forum.makerdao.com/t/mip69-l2-to-l1-fast-withdrawals/14041",
                        "https://vote.makerdao.com/polling/QmXVjbWG",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
                        "https://vote.makerdao.com/polling/QmQkxx16",
                        "https://forum.makerdao.com/t/mip40c3-sp67-modify-core-unit-budget-strategic-happiness-sh-001/13805",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://vote.makerdao.com/polling/Qmbzebcq",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/request-return-of-mkr-tokens-inadvertantly-sent-to-governance-address/15221",
                        "https://forum.makerdao.com/t/signal-request-offboard-uni-univ2daieth-univ2wbtceth-univ2unieth-and-univ2wbtcdai/15160",
                        "https://forum.makerdao.com/t/signal-request-launch-maker-teleport-with-1-basis-point-fee/15109",
                        "https://forum.makerdao.com/t/signal-request-maker-accessing-mortgage-loans-through-bacon-protocol/15043",
                        "https://www.baconcoin.finance/",
                        "https://forum.makerdao.com/t/signal-request-increase-the-esm-minimum-threshold/15006",
                        "https://forum.makerdao.com/t/signal-request-antalpha-institutional-vault/15030",
                        "https://www.antalpha.com/",
                        "https://youtu.be/jK2VtNUHuGE",
                        "https://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqbFBzM0NNWVUyT3VVODBvTE9TYjhlM0VFb0w3d3xBQ3Jtc0trSjdtV09HeHBUUUtpWldKaV9oMFZPN0hkRXN5elhEN3lSd2h1UnhoUHNWWVBRcXVMSzUtMlplOFdkbGRUQndQSjhPVm9TOG9yaU1DQ1B3N3oyV1JLZVc5YlU2dUNhNXhfNU1DTGNuTmZueHNVdjFBTQ&q=https%3A%2F%2Fforum.makerdao.com%2Ft%2Fgovernance-and-risk-190-thursday-may-12-at-17-00-utc%2F15106&v=jK2VtNUHuGE",
                        "https://www.youtube.com/watch?v=6pvggvsHpv0",
                        "https://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqa3lVOUZiSXNETFEyVVpKMEdQS0k0cjc3LTg2QXxBQ3Jtc0ttUkdweV94dHY5RTZnbXpJMmdHT2dWaDZvdTE0QkVHQjBiYlh1cEFaa0wyc1h3M3c3dlZ1bjJuczJsUlJET3Qta0N2QV9uVmlmQzdKcUpqd3dqdGRqcWF2YUNQa2k3eUV3Ry1FdHdKSGV2OWhBdnd3VQ&q=https%3A%2F%2Fforum.makerdao.com%2Ft%2Fcollateral-onboarding-call-43-fei-rari-pools-use-cases%2F15009&v=6pvggvsHpv0",
                        "https://www.youtube.com/watch?v=Zm9_RYBv68g",
                        "https://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqbUJPYlBwOGpHaFN3MXFJMjdrZXR2Mmp0bklwUXxBQ3Jtc0tscm55dEhoRnZEcEVDU1dZYmJidGl0ZmRZeTFZYWFwclVYcVpzMUxveWctWDIwbHVrWDhWeHNNSWx5c3pWaXdtandXNXA0cEpkQVhxZGU0Sm5sdWotMXZXV0JmNG94QW1wZmctQkxydXlvOXRUNEV4Zw&q=https%3A%2F%2Fforum.makerdao.com%2Ft%2Fcollateral-onboarding-call-42-monetalis-mip65-mip68-ama%2F14829&v=Zm9_RYBv68g",
                        "https://forum.makerdao.com/t/meet-your-delegate-12-london-business-school-lbs/15218",
                        "https://us02web.zoom.us/j/81440375268?pwd=GwPHyS5sNota-EOXOwxinf8cpOPBnu.1",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/relay-semanal-10-16-de-mayo-de-2022/15289",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-may-2022/15742",
                        "https://forum.makerdao.com/t/weekly-relay-june-21-27-2022/16158",
                        "https://forum.makerdao.com/t/relay-semanal-21-27-de-junio-del-2022/16272",
                        "https://forum.makerdao.com/t/weekly-relay-may-17-23-2022/15346",
                        "https://forum.makerdao.com/t/relay-semanal-17-23-de-mayo-del-2022/15392"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.422021284271285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "31/05/2022-19:24:12",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1065"
}