{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/have-you-heard-about-https-www-tigweb-org-for-young-and-enthousiast-people/974",
            "title": "Have You Heard About https://www.tigweb.org/ For Young and Enthousiast People? ",
            "index": 974,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "community"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#1",
                    "likes": "0",
                    "time": "18/12/2019-17:14:20",
                    "content": "Hi all, i hope you guys are all having a good day ! Here i found some nice web site , that looks like they want to achieve some of the goal we are doing here. https://www.tigweb.org/ Environment , Health, Culture, Education, Technologie, Peace… I wish John Lennon was here… Not to make promotion for them, but i found out its good diversification. And also we can compare what they do and what we do. At the end, is all a community that we want to relay, imagine a partnership with one of them, it would be great no ? @rich.brown @Davidutro What you think ? I hope you like it  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/12/2019-17:39:16",
                    "content": "This looks like an interesting org. They are trying to educate and inspire activism in the youth for a lot of great things. I wonder what our connection to them would be. Crypto falls under human rights at some level. Especially when you consider an individual’s right to hold custody over their own hard-earned assets. How do you you see us working with this org? Personally, I think it would be cool to involve university programs and students who would be interested in helping contribute to the open-source governance of the protocol and to the interesting problems and decisions we are continuously working through. We have quite a lot of growing to do. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.4935064935064934
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/12/2019-17:45:25",
                    "content": "Exactly, just to get involved with them and have a cooperation started. Who knows where it could lead. When i was reading it, i found it really looking like us, deeper a little bit but still. For me, money , we don’t need. I wish we don’t need money. But imagine you don’t have the money concerns, and you have all these tools close to you ready to go. This have inspired me this morning. I think, it’s the second time i see this. The first time was with you @Davidutro , allowing a grants to me for a hosting event and spreading the words about MakerDAO… I never seen a website that is willing to give, and want in return, just nothing but hapiness. But also, aim for young people that is willing to go further in their career… like me i presume and a lot of people here @LongForWisdom Since you guys are really busy with other important things here, un-busy guys like me could manage this. They want to share and teach knowledge, to expand community etc. While we want to expand MakerDAO, i think this fit perfectly in our needs for world developpement.  I would need to get in touch with your Dev team. I am not sure what, but a cooperation between us and them, would be great. I might start to work on that project if you approve it.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.06985294117647
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#4",
                    "likes": "1",
                    "time": "18/12/2019-21:01:56",
                    "content": "A few points:  I wouldn’t reach out to them on our behalf without a clear plan. We are already partnering with a couple of blockchain academies to create educational tracks for Maker and Dai, reaching out to an org like this that is more general would need a clearer plan and someone committed to leading this relationship and project. I don’t think we(The Foundation) have that bandwidth at the moment. We give and want in return a growing community and people to be aware of Dai, what it is, how it works, etc. Happiness is always great   I would say the dev team is somewhat unrelated, since it seems this would be an educational initiative more than anything else.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/12/2019-21:15:27",
                    "content": "Yes you are more than right about this. There is too much to do now i think to get more involved and start doing business trip etc. But still , and here i seek your advice @Davidutro What about maybe just reserving our seat with them, by that i mean, just to have a foot in the place. Maybe we will never need it, but maybe , after these Holidays, in march, i don’t know, it could be interesting. Then they will remember that we took our name there already. I did read somewhere, when something new is going on, no need to put yourself into it, but , revendicate the name ( our name ) and holding it for now. Maybe if could be interesting. It’s just an idea. I am far away from you into this, so you know what to look for. Give me your opinion please regarding this.  Thanks sir    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.304788961038961
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#6",
                    "likes": "1",
                    "time": "18/12/2019-21:24:15",
                    "content": "They could be an interesting org to approach for a wider campaign promoting Dai, but in the meantime I don’t think it is worth it for us at this stage. Larger more general organizations will have an easier time taking Dai seriously after it has had some time to exist and thrive. I would put this one on the shelf for the time being. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.847222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#7",
                    "likes": "1",
                    "time": "18/12/2019-21:25:54",
                    "content": "Sound Good, I really thanks you for your reply and opinion. It do Matter to me. So i can take example out of you , if you don’t mind of course . I will steal all the good from each one here. And do like a Master Node of good things for 2020 ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/12/2019-17:54:56",
                    "content": "    Davidutro:  A few points:  I wouldn’t reach out to them on our behalf without a clear plan. We are already partnering with a couple of blockchain academies to create educational tracks for Maker and Dai, reaching out to an org like this that is more general would need a clearer plan and someone committed to leading this relationship and project. I don’t think we(The Foundation) have that bandwidth at the moment. We give and want in return a growing community and people to be aware of Dai, what it is, how it works, etc. Happiness is always great   I would say the dev team is somewhat unrelated, since it seems this would be an educational initiative more than anything else.    That is so great , can’t believe there is still humans on heart … Thanks @Davidutro I should pin this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                }
            ]
        }
    ]
}