{
    "poll_list": [
        {
            "title": "Decrease the RETH-A Dust Parameter - March 6, 2023",
            "index": "20021",
            "option": "Yes",
            "supporting_mkr": "70,326",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/adjusting-reth-a-dust-parameter-march-2023/20021",
            "title": "Adjusting RETH-A Dust Parameter (March 2023) ",
            "index": 20021,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "risk",
                "dust",
                "reth",
                "impact-:-medium"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "2",
                    "time": "01/03/2023-19:28:31",
                    "content": " Dust Parameter Definition dust is the minimum permitted debt for a vault. Users must borrow at least this amount to open a vault, and cannot repay their debt below this amount unless they pay off the entire remaining balance. Higher dust values make vaults less accessible for smaller users, but also protect Maker from risk of vaults being too small to liquidate profitably. You can learn more in the documentation here.  Dust Limit Review Dust parameters for core large cap vault types were recently adjusted through governance. The forum discussion, on chain poll, and executive vote resulted in the following parameter adjustments:  Reduce dust for ETH-A, WBTC-A, and WSTETH-A to 7,500 DAI Reduce dust for ETH-B and WBTC-B to 25,000 DAI Reduce dust for ETH-C, WBTC-C, and WSTETH-B to 3,500 DAI  At the time, RETH-A was not included in the proposed parameter changes because the vault was still relatively new with a limited debt ceiling. Now that the vault has been live for some time without issues, and the latest parameter changes proposal has increased RETH-A’s debt ceiling and is expected to lead to additional usage, it’s a suitable time to update the RETH-A dust parameter to align with similar vault types. Based on current ETH price, gas market dynamics, and parameters of the RETH-A vault, 7,500 DAI dust provides more than sufficient buffers against potential losses from small vault liquidation during dust price spikes. It should also be more economical for 7,500 DAI debt RETH-A vaults to repay vs allowing their position to liquidate up to around 1,250 gwei gas at current ETH prices.  1532×650 121 KB  Source: Maker Dust Analysis (March 2023 RETH-A), Risk Dashboard  Proposed Changes  Reduce RETH-A dust parameter from 15,000 DAI to 7,500 DAI  RETH-A is comparable to the ETH-A and WSTETH-A vault types, with a somewhat higher collateral ratio to account for RETH’s lower market liquidity. Therefore, it is proposed to reduce RETH-A dust parameter from current value of 15,000 DAI to 7,500 DAI, aligning with the above mentioned vault types.  Next Steps Risk CU is requesting to submit the proposed dust parameter change for governance polling next week, and assuming voter support is given, it will be included in the next available executive vote thereafter. ",
                    "links": [
                        "https://forum.makerdao.com/t/discussion-adjusting-dust-parameter-november-2022/18767/12",
                        "https://vote.makerdao.com/polling/QmRfegL4#vote-breakdown",
                        "https://vote.makerdao.com/executive/template-executive-proposal-dust-parameter-changes-chainlink-automation-keeper-network-stream-setup-recognized-delegate-compensation-for-january-february-8-2023#proposal-detail",
                        "https://vote.makerdao.com/polling/QmUMyywc#poll-detail",
                        "https://docs.google.com/spreadsheets/d/1ifb9ePno6KHNNGQA8s6u8KG7BRWa7fhUYH3Z5JGOxag/edit?usp=sharing",
                        "https://maker.blockanalitica.com/simulations/dust/?base_debt=1&ilk=RETH-A",
                        "https://forum.makerdao.com/t/coldiron-eth-delegate-platform/11193/168",
                        "https://forum.makerdao.com/t/consensys-delegate-platform/18246/20",
                        "https://forum.makerdao.com/t/onestone-delegate-platform/17854/44",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/125",
                        "https://forum.makerdao.com/t/codeknight-delegate-platform/16806/57",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/65",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/103",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/49"
                    ],
                    "GPT-summary": "The post explains the concept of dust parameter and proposes to reduce the dust parameter for RETH-A vault type from 15,000 DAI to 7,500 DAI, aligning it with similar vault types. The proposal is based on the current ETH price, gas market dynamics, and parameters of the RETH-A vault. The post also mentions the proposed next steps for the change to be implemented. A 3rd party could provide constructive criticism or audit the proposal.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Smart contract updates"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.526351174078447
                }
            ]
        }
    ],
    "group_index": "2231"
}