{
    "poll_list": [
        {
            "title": "Ratification Poll for Modify Core Unit Budget, MKT-001 (MIP40c3-SP33) - October 11, 2021",
            "index": "10150",
            "option": "No",
            "supporting_mkr": "40,454",
            "highest_fraction": 0.61
        },
        {
            "title": "Ratification Poll for Modify Core Unit Budget, MKT-001 (MIP40c3-SP33) - November 8, 2021",
            "index": "10150",
            "option": "Yes",
            "supporting_mkr": "71,960",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150",
            "title": "# MIP40c3-SP33: Modify Core Unit Budget, MKT-001 ",
            "index": 10150,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "core-unit",
                "core-unit-budget"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#1",
                    "likes": "6",
                    "time": "03/09/2021-23:24:30",
                    "content": " MIP40c3-SP33: Modify Core Unit Budget - Content Production (MKT-001)  Preamble MIP40c3-SP#: 33 Author(s): @seth Contributors: @JerryAG @Kat @Alec @JMarshall Tags: core-unit, cu-mkt-001, budget, dai-budget Status: Accepted Date Applied: 2021-09-03 Date Ratified: 2021-11-22 Forum URL: https://forum.makerdao.com/t/mip40c3-sp33-modify-core-unit-budget-mkt-001/10150   Sentence Summary MIP40c3-SP33 adds the budget for Core Unit MKT-001: Content Production for December 2021 through May 2022.  Paragraph Summary MIP40c3-SP33 adds the budget for Core Unit MKT-001: Content Production for December 2021 through May 2022. We are requesting a 6-month budget allocation of 424,944 DAI.  Motivation We’re proposing this Core Unit Budget modification to provide funds for the Content Production team to continue fulfilling its mandate. We’re proposing to move from a 3-month budget cycle to a 6-month budget cycle, as the tight turnaround on a 3-month cycle makes it difficult to assess needs and provide transparency, and we feel we’ve started proving ourselves as a Core Unit.  Core Unit Name Content Production (MKT-001)  Budget Implementation Simple Budget Implementation The Content Production multi-sig wallet is here.  A total of 424,944 Dai DAI will be streamed to 0xDCAF2C84e1154c8DdD3203880e5db965bfF09B60 address starting 2021-12-01 and ending 2022-04-30.   Budget Breakdown  Budget (December - May) People (Current)     Role Name     Full-Time    Facilitator @seth   Audio Engineer/Podcast Producer @JerryAG   Video Director @jmarshall   Design/Community Manager @kat   Writer @alec    People (Proposed)     Role Name     Full-Time    Marketing Strategist TBD   Press Relations TBD   Part-Time    Video Production Assistant TBD   Podcast Host TBD   Writer TBD    Programs Ambassador Pilot Program - 7,000 Admin/Software/Gas/Travel Admin/Software - 1800 Gas - 400 Travel - 20,000  Breakdown     Item Amount Percentage     People     Salaries 349,744 DAI 82.30%        Programs     Ambassador Pilot Program 7,000 DAI 1.60%   Subtotal 7,000 DAI 1.60%        Admin/Software/Gas     Admin/Software 1,800 DAI    Gas 400 DAI    Subtotal 2,200 DAI 0.51%        Contingency, Continuity, & Travel     Contingency 38,000 DAI    Continuity 8,000 DAI    Travel 20,000 DAI    Subtotal 66,000 DAI 15.31%        Total 424,944 DAI 100%     November - January Focus Looking back at the Quarterly Focus from our last budget proposal, we’ve conducted content audits of the Portal and makerdao.com to plan what content should live where. We’ll begin implementing those plans to sync the content across those properties as well as the Community and makerdao.com blogs when we gain access to these channels. We’ve focused on publishing content on Reddit, Twitter, and Youtube until we can get access to the accounts currently with the Dai Foundation and anticipate that happening once an Asset Allocation MIP is passed.  Explainer Videos The team put together a plan to produce animated explainer videos to help new community members get up-to-speed on the inner workings of MakerDAO and drive SEO on Youtube. These will consist of 2-5 minute animated videos organized to help people understand governance, liquidation, collateral onboarding, and system parameters. Animations for a 3-5 minute explainer can take two weeks per video but certain elements can also be recycled for different videos and we’re proposing to bring on an Assistant Video Producer so we can speed the production of explainer videos and continue producing other video content when needed.  Community To help address concerns in the community about MakerDAO’s marketing program, we’re proposing to conduct a pilot to resurrect MakerDAO’s Ambassador Program and bring on two new full-time roles to coordinate Press Relations and Marketing Strategy. At the suggestion of the @Growth-Core-Unit, @kat will be coordinating a pilot to resurrect MakerDAO’s Ambassador Program. The pilot will focus on Latin America and involve building regional teams to host meetups, manage localized social media accounts, moderate communications channels, and generally help MakerDAO gain recognition in different parts of the world. The Content team has been approached about doing Press Relations and hasn’t felt like we’ve had the bandwidth to manage it effectively, but we believe it would be a valuable tool in communicating what’s happening at MakerDAO with the wider crypto ecosystem. Last but not least, several teams (notably GovAlpha and Protocol Engineering) have expressed the desire for a marketing team that they can go to in order to help promote new products/services/initiatives. For now, we’re proposing to bring on a marketing strategist to field these requests and either help the Content team expand to accommodate the DAO’s needs with regard to marketing, or form a Core Unit focused on general marketing.  Research The brand research we’ve been working on (see the Announcement and Initial Results and schedule an interview here) will be an ongoing study to help inform our messaging and help the DAO understand how people think about MakerDAO. We plan to incorporate this into market research to gain more insights into the reasons people use Vaults and Dai.  February - May Focus Depending on how things go with the Ambassador Program pilot and our Marketing Strategist, we’ll be looking to expand the Ambassador Program beyond Latin America into advantageous regions where communications can be difficult due to: A) language barrier and B) differences in primary social channels. In addition to explainer videos, the team has talked about coordinating professional video recording for larger sponsored events once there’s more certainty around travel. We’ve also discussed collaborating with Ambassadors on closed captioning or doing voice-overs in foreign languages to expand the reach of explainer videos. This budget also includes funds for two travel opportunities so the team can represent MakerDAO at conferences and meet fellow team members.  Modifications After reviewing our accounting, we’ve updated our budget proposal with a more accurate view of our needs and to reflect that the budget will now apply for December to May. Thanks @PaperImperium and @Aes for encouraging us to take a closer look at our books. With regard to salaries, we’ve carried forward a surplus of 51,056 Dai mostly accrued during our first couple of months with hiring. We’ve also added 38,000 Dai to replenish the funds we’ll take from our Continuity buffer to get through November, 8,000 Dai to replenish our Contingency funds (we’ve spent 3000 on insurance and 5000 on legal fees), and reduced the funds for the Ambassador Program from 10,000 to 7,000 Dai due to a surplus in the Community Management funds from the last budget period. ",
                    "links": [
                        "https://forum.makerdao.com/t/adding-content-production-multisig/8428",
                        "https://forum.makerdao.com/t/mip40c3-sp21-modify-core-unit-budget-mkt-001/8427#quarterly-focus-5",
                        "https://miro.com/app/board/o9J_l0vK27E=/",
                        "https://miro.com/app/board/o9J_l0vLTC0=/",
                        "http://makerdao.com",
                        "https://www.reddit.com/r/MakerDAO/",
                        "https://twitter.com/MakerMegaphone",
                        "https://www.youtube.com/c/MakerDAO/videos",
                        "https://docs.google.com/document/d/191PU8wMkm3BB2pOkbJLgLu1xPA6dk4pCId-mArlB-1M/edit",
                        "https://forum.makerdao.com/t/participate-in-brand-research-support-marketing-efforts-for-makerdao/9341",
                        "https://forum.makerdao.com/t/informal-poll-brand-research-results-seeking-opinions-on-new-messaging/10020",
                        "http://calendly.com/humansofmaker",
                        "https://forum.makerdao.com/t/video-producing-under-mip41c5-sp3-facilitator-offboarding-mkt-001/12654/5",
                        "https://forum.makerdao.com/t/under-construction/12274/3",
                        "https://forum.makerdao.com/t/maker-governance-review-november-2021/12000",
                        "https://forum.makerdao.com/t/content-production-core-unit-offboarding-post-mortem/13756",
                        "https://forum.makerdao.com/t/content-production-quarterly-update-aug-oct-2021/11618",
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517",
                        "https://forum.makerdao.com/t/weekly-mips-update-60/11347",
                        "https://forum.makerdao.com/t/weekly-mips-update-59/11186",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/weekly-mips-update-58/11074",
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950",
                        "https://forum.makerdao.com/t/weekly-mips-update-57/10921",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/10",
                        "https://forum.makerdao.com/t/weekly-mips-update-56/10691",
                        "https://forum.makerdao.com/t/weekly-mips-update-55/10539",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712",
                        "https://forum.makerdao.com/t/weekly-mips-update-54/10398",
                        "https://forum.makerdao.com/t/maker-relay-ep-61-en-espanol/10376",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/51",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-update-9-2-9-15/10353",
                        "https://forum.makerdao.com/t/maker-relay-ep-61/10214",
                        "https://forum.makerdao.com/t/weekly-mips-update-53/10310"
                    ],
                    "GPT-summary": "The post is a proposal for a budget modification for Core Unit MKT-001: Content Production for December 2021 through May 2022. The proposal includes a breakdown of the budget, a summary of the team's focus for November to May, and modifications to the budget proposal. The post explains the proposal in detail and provides information on the team's plans for the future. The post also invites feedback and questions from third parties and proposes collaboration opportunities.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.4008161976911975
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "3",
                    "time": "08/10/2021-20:49:20",
                    "content": "Without getting into specific salaries of each contributor, can you give a little color on how that 400k DAI/6 months breaks down? Back in March, the 3 month budget was for 5 FTE and 1 Part Time for a total salary budget of 109,700 DAI. In May, the 3 month budget was for 5 FTE and 2 Part Time for a total salary budget of 139,500 DAI. This 6 month budget is for a 7 FTE and 4 Part Time for a total salary budget of 400,800 DAI. Assuming (just to compare the budgets) that Part Time is 1/2 of a FTE, then average salary was: March-May: ~6650 DAI/month Aug-Oct: ~7750 DAI/month Proposed: ~7420 DAI/month Since currently there are only 5 FTE and 0 Part Time contributors, and at the previous budget request on May 29th there were only 2 FTE and 2 Part Time contributors, presumably you have been under budget on salaries, which is the largest expense for this CU. I don’t want to micromanage, as the bottom line amount is what’s important and not what the actual salaries are. But it seems like salary requests should be going down, due to stockpiled cash from unfilled positions that were already granted full funding? If the cash position of this CU is high (I don’t know if it is or is not), then we should probably carry forward some of that to apply to this and future budgets, especially since there is already a contingency buffer of 66500 DAI granted in the first two budgets. It’s wonderful to come in under budget! But it seems appropriate to at some point pare back budget requests if it’s consistently not being spent. Thanks for any extra background if there’s something I missed! I’ll make sure to look at this for other CUs as well, as it’s an easy thing to forget and just roll forward the same budget forecast from last time. CC: @Aes ",
                    "links": [
                        "https://forum.makerdao.com/t/mip40c3-sp21-modify-core-unit-budget-mkt-001/8427"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.379250841750842
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#3",
                    "likes": "1",
                    "time": "08/10/2021-22:32:13",
                    "content": "No problem, I’ll follow up on Monday. edit/following up: Hey, so the short answer is yes, we are under budget on salaries and have essentially been rolling our budget forecast forward. We do plan to roll that surplus into the following proposal and the reason we didn’t for this proposal is partially due to the quirks involved in writing these budget proposals the first month into a three-month period and because we figure it’s better to have the extra funds on hand in case any surprises come up during our first tax season. To be clear about the 66,500 Dai, 46,500 is earmarked for continuity in case there’s an unforeseen gap between budget proposals and we need to cover salaries and the other 20,000 is our contingency fund. It’s too late for us to modify this budget proposal but if there’s a better way to handle that surplus than rolling it into the next budget proposal, I’m open to suggestions. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#4",
                    "likes": "0",
                    "time": "12/10/2021-18:49:16",
                    "content": "    seth:  we are under budget on salaries and have essentially been rolling our budget forecast forward.       seth:  To be clear about the 66,500 Dai, 46,500 is earmarked for continuity in case there’s an unforeseen gap between budget proposals and we need to cover salaries and the other 20,000 is our contingency fund.   Ok. It sounds like the CU has the cash to keep operating, so let’s just resubmit this budget with all the T’s crossed and I’s dotted. It would be helpful to see how much surplus has accumulated with regards to total salaries allocated - total salaries paid. @prose11 or @LongForWisdom can advise us on how quickly a revised budget can get through governance once submitted. Thanks in advance to everyone! I know this is boring work, but we can knock it out quickly ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/25"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.045833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#5",
                    "likes": "1",
                    "time": "12/10/2021-19:10:24",
                    "content": "    PaperImperium:  @prose11 or @LongForWisdom can advise us on how quickly a revised budget can get through governance once submitted.   If it’s modified soon (before the frozen period begins for November) and doesn’t pass the current vote, then it can go in again in the November governance cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#6",
                    "likes": "4",
                    "time": "14/10/2021-14:45:36",
                    "content": "No problem, we’ll get our numbers updated and resubmit. I gotta give credit to everyone involved in delegation, it’s much nicer knowing this is happening than seeing a failed proposal and wondering why. @LongForWisdom @Davidutro When exactly is the freeze? I don’t see it on the public calendars anymore. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.9375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "1",
                    "time": "14/10/2021-14:49:04",
                    "content": "    seth:  it’s much nicer knowing this is happening than seeing a failed proposal and wondering why.   My apologies for not getting to it earlier in the process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 4.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "2",
                    "time": "14/10/2021-14:51:55",
                    "content": "    MIP RFC and Formal Submission Dates Maker Improvement Proposals   MIP RFC and Formal Submission Dates Everyone more or less knows the formal phases a MIP goes through during its life cycle. However, how long these phases last and which are their limits seems to be impenetrable and shrouded in mystery to many.  This table aims to be of aid to MIP Authors who get dizzy trying to figure out when they should be posting their MIP so that it can make it into the next earliest Formal Submission window.      Cycle Latest RFC Submission Date Last Days for Changes Form…     October 25th - 27th ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match. The comment does not relate to the proposal for a budget modification for Core Unit MKT-001: Content Production for December 2021 through May 2022, but rather provides information on the MIP RFC and Formal Submission Dates."
                    ],
                    "Sentiment": 5.802083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#9",
                    "likes": "1",
                    "time": "27/10/2021-18:54:52",
                    "content": "Updated for Formal Submission ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#10",
                    "likes": "12",
                    "time": "25/10/2021-12:41:45",
                    "content": " RE-VOTE: Ratification Poll for Modify Core Unit Budget, MKT-001 (MIP40c3-SP33) - October 11, 2021 After further review, we have changed our Vote to “No”. It’s no secret that Delegates are currently operating outside of the Maker black box, and have an opaque view into Core Units accomplishments (conversion rates), KPIs & deliverables, quantified metrics, and other components that help MKR token owners and Delegates Vote more accurately for the benefit of the DAO. With that in mind, we are confused by the direction the Content Production Core Unit is taking. Are they looking to be a Marketing team? Are they looking to do Media and/or, Public Relations when GovComms has already taken-on this role? Or, are they focus on creating Content? If the goal is to produce content, the Content team was highly missed and much needed at Liscon (Lisbon). Not only was there an opportunity to capture content, but to also skill-mill with other Core Units that are here. It seems like some CU are overlapping each other. A good face-to-face conversation between CUs would have helped, IMO. We have unanswered questions and I urge @Content-Production to reassess their core mission and communicate to the community what exactly they want to accomplish. If the goal is to do Marketing, again the opportunity was here at Liscon. The recent announcement of “Clean Money” could have been showcased at this event. If the idea is to do Content your production team could have captured a ton of content with CU Team members, as well as with the entire Crypto community. And yes, I understand it is difficult to travel, but Coverage in regions such as Europe are vital. Please focus on establishing resources within Europe. I urge you @seth as the facilitator to communicate to the community more clearly on what is the direction you are taking Content-Production, and workout the overlapping expenditures that this approach will create. @Growth-Core-Unit You are All very talented and I know you are working hard-long hours, but in our opinion Content Production lacks direction. Therefore we have changed our Vote to “No”. ",
                    "links": [
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/47",
                        "https://forum.makerdao.com/t/flip-flop-flap-delegate-llc-platform/9106/31"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.4766025641025635
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#11",
                    "likes": "3",
                    "time": "25/10/2021-17:59:58",
                    "content": "Hey Frank, happy to clarify. Our goal from the beginning has been to focus on content and work alongside other CUs providing marketing and communications services where they make sense. Since things didn’t work out with the Strategic MarComms proposal, we’ve heard a number of community members express the desire for a “general purpose” marketing team; GovAlpha and PE, in particular, have both expressed a desire for an individual or team that can help them promote new products/initiatives/etc.     seth:  To help address concerns in the community about MakerDAO’s marketing program, we’re proposing to conduct a pilot to resurrect MakerDAO’s Ambassador Program and bring on two new full-time roles to coordinate Press Relations and Marketing Strategy.   The solution we’ve proposed is to bring on a Marketing Strategist who can assess the situation and help other teams start organizing smaller campaigns and from there, decide whether it makes more sense to propose a new mandate and pivot the Content CU toward marketing or organize a new Marketing CU. We have a candidate referred by @Davidutro we believe would make a good fit for this but are waiting for clarity on our budget before making an offer. With regard to Press Relations (specifically Press, not more general Public Relations), we’ve spoken with @gov-comms-core-unit on multiple occasions about the need/desire for someone to handle press relations and they expressed to us that the scope of their interest in that was limited to managing incoming requests from journalists, which they’ve started tackling with the “Media Inquires” channels in the Forum and on Discord. We’re proposing to bring someone on who maintains relations with journalists and is willing to manage press releases and interactions with members of the DAO. Kat tried to make it to Lisbon but didn’t receive her passport in time and the rest of the team had personal conflicts that prevented us from attending but I’ll be attending ETH Portland later this week and we’ll have team members at NFT.NYC next week. I realize these events aren’t as high profile as ETH Lisbon and I would’ve loved to have been able to meet everyone and chat face-to-face but there was nothing preventing regular communications in the meantime. I have to say, I’m pretty confused about how we got from “Voted “Yes” – it is vital that we support our Core Units.” to “we are confused by the direction the Content Production Core Unit is taking.” and I’m disappointed you didn’t reach out to talk about any of this before changing your decision. I appreciate you sharing your concerns but it’s not fair to say there are “unanswered questions” when the questions haven’t been asked until now. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.4141707251082245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#12",
                    "likes": "5",
                    "time": "26/10/2021-09:08:42",
                    "content": "Dear Seth, Thanks for your message. Here are some points, and we will be happy to follow up.  Default Yes? We don’t believe that your (or any) Core Unit should assume that their proposal will pass unless asked questions. It is up to the Core Unit not only to provide value but also to show it. We are sorry about your disappointment.  Marketing / Press / Public Relations We have yet to meet a person that believes that Maker doesn’t need marketing. Many activities that could fall into your mandate seem to overlap with marketing, hence our comments. Other than “we’re trying to bring someone new,” we have not seen a lot of concrete steps.  Events It is not about “going” to the events. It is more about making sure that Maker is in the conversation: having a booth, giving talks, organizing events… We have seen efforts from other Core Units (notably Growth), but not from MKT-001.  Output Going back to our original point: we have not seen a lot of output based on the input (DAI) that Content Production is receiving. Your Core Unit has a full-time writer, a full-time video director, a full-time producer (and other full-time members that could help), and we have not seen an increase in the output of content that Maker has produced. Three full-time contributors during two weeks are 240 person-hours, which have yielded this:    Content Production Bi-Weekly Update: 9/30 - 10/14   Video   Published   [Maker Relay] Votes & Polls (9/28 - 10/04) & (10/5 - 10/12)   [Maker Relay] The State of Dai (9/28-10/04) & (10/05 - 10/12)     Hosted an AMA with Pairwyse   Organized Issue Discussion #2 | Fixed Rate Maker Vaults in collaboration with GovComms   Uploaded videos to the MakerDAO Youtube Channel for other CUs     This situation only compounds if we go back in time. Could this budget be allocated differently and make sure that we start producing helpful content?  KPIs and a clear direction How many views are we getting in the content (videos and others) that we produce? What is working? What is not? What else are we trying? I’m not a marketing expert, but these things should be clear (in a mandate, some living document, or any other form that your team chooses.) Looking forward to your next iteration, Flip Flop Flap Delegate LLC ",
                    "links": [
                        "https://www.youtube.com/watch?v=XKkyoPZsItY",
                        "https://www.youtube.com/watch?v=cJF7N_Mg4Cc",
                        "https://www.youtube.com/watch?v=pJ8nnieMkCc",
                        "https://www.youtube.com/watch?v=Ctn7zlBMXyQ",
                        "https://youtu.be/mjfMNKmHUhg",
                        "https://www.youtube.com/watch?v=44l1BQUQ9Os",
                        "https://www.notion.so/Video-55ad4684afc0416c917be8f745eaac43"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5740740740740735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#13",
                    "likes": "2",
                    "time": "26/10/2021-14:45:29",
                    "content": "Adding some clarity here.     flipflopflapdelegate:  Are they looking to do Media and/or, Public Relations when GovComms has already taken-on this role?   FYI GovComms does not have Public Relations on our mandate. One piece of our scope is Press Relations/Media Relations support. Meaning we maintain relationships, route, and coordinate activity around this. We discussed the idea of press releases with Content Production and were considering a model where Content provides us writers to support the production of these written communications.    Flip Flop Flap Delegate LLC Platform   we’ve spoken with @gov-comms-core-unit on multiple occasions about the need/desire for someone to handle press relations and they expressed to us that the scope of their interest in that was limited to managing incoming requests from journalists, which they’ve started tackling with the “Media Inquires” channels in the Forum and on Discord. We’re proposing to bring someone on who maintains relations with journalists and is willing to manage press releases and interactions with members of the DAO.   As a general note on this, we did have conversations but I don’t think this is accurate. Our team was clear about where we were in our current Media Relations practices and what we were doing to progress on that part of our mandate; ie hiring an Engagement Lead, whose role includes Media/Press Relations. It’s not clear to me why this role would live in your team versus ours for example, and we never had a conversation about this because we were already in the process of hiring an Engagement Lead. Clearly there was some misunderstanding and lack of communication between our Core Units on this point. edit: I do see the case for a press relations role that might be more externally focused. I was reminded by @twblack88 of the push and pull model for press relations we once envisioned where one team handles incoming requests while the other handles distribution, press releases, active outreach. Our team is not opposed to this kind of setup @flipflopflapdelegate ",
                    "links": [
                        "https://forum.makerdao.com/t/help-wanted-engagement-lead/9711"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.516647568118156
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monkey.irish",
                    "index": "#14",
                    "likes": "2",
                    "time": "27/10/2021-04:37:15",
                    "content": "Much of this is covered in product planning. We have some great hires lined up and I hope to announce them soon to get going on this and a bunch of other activities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.458333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#15",
                    "likes": "0",
                    "time": "28/10/2021-16:42:25",
                    "content": "Here’s a timeline of events from my perspective:  ElPro reaches out to @JerryAG in response to his post about collaborating with community members on podcasting and they begin collaborating on a podcast. During the course of this, ElPro tells Jerry how much he supports our CU, appreciates our work, etc. They have a meeting scheduled last week; ElPro fails to show up and goes silent for the past week. I wake up on Monday to this message from ElPro stating that he’s switching his vote, accusing us of having “unanswered questions,” and generally trashing our work.  In the DAO, we give a lot of lip service to the idea that those participating in governance should do so in good faith. The Code of Conduct that Recognised Delegates agree to adhere to states:    Recognised Delegate Code of Conduct   Good Faith Delegates should act at all times with honesty, integrity, and transparency.      Recognised Delegate Code of Conduct   Due Care and Attention Delegates should make a professional and unbiased review of each proposal prior to the submission of their vote.   I’m having a difficult time coming up with a better way to operate in bad faith than telling someone you support them to their face, supporting their proposal, and not only withdrawing that support at the 11th hour but suddenly claiming you have “unanswered questions” and trashing their work. I made an attempt to address these concerns and this response is confusing and disingenuous at best. I also asked to speak with Frank privately but he didn’t show up to the meeting and has yet to follow-up to let me know when he’ll be available. I’m always happy to address concerns when they’re expressed appropriately but this is abusive behavior and clearly more geared toward making a statement than fostering productive communication. If other delegates share any of these concerns, I’ll be happy to address them but this is so inaccurate and disrespectful that I don’t believe it merits a direct response. ",
                    "links": [
                        "https://forum.makerdao.com/t/recognised-delegate-code-of-conduct/9384/1",
                        "https://forum.makerdao.com/t/mip40c3-sp49-modify-core-unit-budget-mkt-001/12059/2"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7592592592592595
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#16",
                    "likes": "1",
                    "time": "28/10/2021-16:43:32",
                    "content": "    Davidutro:  we did have conversations but I don’t think this is accurate.   @twblack88 and @JerryAG were involved in those conversations and can confirm that yes, this is accurate. We discussed the role you wanted GovComms to play in Press Relations and you specifically said you want the scope of your team’s involvement to be limited to incoming requests from journalists and that you didn’t want to be involved further. We re-iterated this in a conversation prior to you submitting your proposal to start GovComms. This is also consistent with the description of the Engagement Lead’s involvement:    Help Wanted: Engagement Lead    Act as a point-person for a media inquiries email, as well as manage the forum’s Media section.    As we’ve stated elsewhere, we’ve proposed this role because the desire has been expressed for someone to handle these responsibilities and you specifically said you weren’t interested in GovComms taking that on. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.877551020408164
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#17",
                    "likes": "0",
                    "time": "28/10/2021-16:58:44",
                    "content": "    seth:  We re-iterated this in a conversation prior to you submitting your proposal to start GovComms   Yes, this conversation must have happened…in May, June, July 2021? Hence why my memory was fuzzy on the agreed-upon setup. I want to thank Tim mainly for reminding me of the in/out dichotomy we modeled for splitting the media relations responsibilities. I am in full support of what your team is going after now. Apologies for the misunderstanding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.861111111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#18",
                    "likes": "0",
                    "time": "28/10/2021-18:03:00",
                    "content": "    Davidutro:  I want to thank Tim mainly for reminding me of the in/out dichotomy we modeled for splitting the media relations responsibilities.    no probs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#19",
                    "likes": "5",
                    "time": "28/10/2021-18:20:39",
                    "content": "    seth:  ElPro reaches out to @JerryAG in response to his post about collaborating with community members on podcasting and they begin collaborating on a podcast. During the course of this, ElPro tells Jerry how much he supports our CU, appreciates our work, etc.    Community Members Volunteering Absolutely. Out of the goodness-of-my heart and dedication to the Maker Community I Volunteer to do a Podcast with the Content CU–with my own Resources–paid with my earned money–and created the title: “Meet The Makers”.  Liscon Attendee     seth:  They have a meeting scheduled last week; ElPro fails to show up and goes silent for the past week.   I decided to attend Liscon back in August and arrived on Monday, October 18. While here, @JerryAG wanted to review the content I recorded and his work for the “Meet the Makers” podcast. Jerry attempted to review the content during a week that I am attending Liscon–there is an understanding that we are on a time-difference and I am here for events that Flip Flop Flap Delegate LLC, has PAID for. Therefore, my plans and a lot of my attention was geared towards Liscon and representing MakerDAO as one of its Recognized Delegates. I also intended to meet with CU team members and gather as much internal data as possible. Which IMO is key to Delegates making decisions.  Findings Attend Liscon and felt deep disappointed when protocols, podcast producers, journalist, and All type of promoters I have never heard of walk around producing and capturing CONTENT. I control my dissatisfaction with a reminder that not everyone can travel these days. I then proceed to dig a little deeper and perform due-diligence and receive opinions and concerns for the lack of content being produced. Some ask why I voted “Yes” to a CU who is not performing and under budget? I express that I believe in the Content CU, that they are talented and I am okay with the CU having excess DAI–as I don’t believe the Content CU team members are malicious–therefore it is in my opinion that they should receive their next budget request. I then proceeded to review the new findings, and make a decision that I must do what is Right on-behalf of MKR token owners. It was a gut-wrenching decision, as I truly believe in the talent and possibilities this team possesses.     seth:  I’m having a difficult time coming up with a better way to operate in bad faith than telling someone you support them to their face, supporting their proposal, and not only withdrawing that support at the 11th hour but suddenly claiming you have “unanswered questions” and trashing their work.    We Fully Support The Content Core Unit We believe the talent and resources are there and ask @Content-Production to start a movement. It is desperately needed. Believe me.  Available     seth:  I also asked to speak with Frank privately but he didn’t show up to the meeting and has yet to follow-up to let me know when he’ll be available.   I am currently at NEARCON and I got caught-up in a conversation with a Founder of another protocol and joined our scheduled meeting 10-12 minutes late. Apologies on my end. You stated that you only waited 5 minutes after our scheduled time:  image1546×250 57.1 KB  Please let me know when you’re available and note that there is currently an 8 hour difference between you and I. Will also keep-in-mind that you have a 5-minute policy for waiting for participants to join scheduled meetings. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1153791061879295
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jmarshall",
                    "index": "#20",
                    "likes": "7",
                    "time": "29/10/2021-14:17:01",
                    "content": "Hey Frank, As video producer of the content production core unit, I wanted to address some of your and the community’s concerns since I feel that so much of what I do gets lost in translation, and it appears that our video content output seems to be a cornerstone of your concerns. I would like to clarify some of the work that we’ve been doing, what we have coming, some of our future plans, my current strategy towards producing video content within the DAO, and a few reasons we did not attend Liscon (Lisbon). The logistics and costs of video production tend to be mysterious to anyone outside of the industry, so hopefully, I can shed some light on that as well. You mentioned:  Screen Shot 2021-10-28 at 11.52.28 PM1422×148 18.8 KB  ​This is not entirely accurate, it’s important to note that ​I serve as both the full-time video director and producer​ for the core unit. In addition, I edit and animate/VFX for all of the video content we create as well. I essentially operate as a vertically integrated video production company inside of the content production core unit. We currently have two writers on staff with their own specialties and the entire unit does support one another on these efforts and we collaborate with other core units on various content. Our unit does much more than just video content (see CU updates), but for this post, I am going to speak directly to video production content. In concerns to our output: you highlight the video section in particular:  Screen Shot 2021-10-28 at 11.52.33 PM1424×654 68.1 KB  ​If this was our only output in terms of video content, I would agree this would be a limited use of resources. However, this is only the video content that we released in this time frame and is not indicative of the quality or quantity we will release over a year. Assuming these videos multiplied by 26 will give you a solid prediction of our anticipated output across a year is a flawed model that is not even close to our targeted output. This assumes a linear curve of output, while we are operating exponentially, at least during this start-up phase. I understand that it’s easy to break down our video output in that manner to arrive at a KPI, but once I explain my strategy and the types of projects we’re working on, it should be more clear what kind of output you can expect in the future. ​Strategy​ Producing video content for a DAO is challenging to say the least. ​I come from a commercial and corporate background which is radically different. I’ve had to take my knowledge and experience and reshape it into new strategies to cost-effectively produce content. Some content can turn around in a day, others take months to complete. These various types of projects are constantly being juggled simultaneously. The easiest way for me to convey the various types of video projects we are developing would be a tier system. Tier 1 This is topical content, meant to be viewed for the day, week, or month. Or general content with a quick turnaround, taking a day to a week to create. Current examples include Maker Relay videos, NFT Animations, AMA calls and clips, social media video promos for events or contests, various content requests from the DAO Tier 2 This is evergreen content, meant to be viewed indefinitely. These projects take a week to a month to create. Examples include educational videos and event promotion videos (currently in development) Tier 3 This is high production value content that is generally evergreen and intended to reach a large audience. These require months of prep to develop, film, edit, and release. Examples include documentaries, commercials, etc. We are developing content at all of these levels and constantly shifting our approach based on community reaction and online viewing metrics. Since I’ve entered the core unit in June, we’ve started with Tier 1 content. This includes animating bumpers for videos, creating formats for AMA-type videos, and developing the format for the Maker Relay videos. Once these elements became standardized, we started development on our tier 2 content, concurrently while creating tier 1. The first educational video “How to Vote” should be released very shortly as we are putting the finishing touches on it now. You are more than welcome to see the working version. We have shared it with various members of the DAO and have both received positive feedback and made adjustments based on technical criticism. Since this project is currently in post-production, its progress is vague in terms of a KPI. Also, since it is the first of a very long series, many of the assets, format considerations, and SOPs took extra time on the front end to figure out. This one took about 8 weeks or so to finish with some crossover for the next one, “Governance Processes” which is currently in post-production. They also require core unit collaboration which we are very thankful for all the help and support we have received. I anticipate these to be completed on a biweekly basis once our process and formats are refined in addition to now having assets that can be recycled into the other videos. In the last month, we have just started discussions for tier 3 content. For now, we are discussing doing short sub-10 minute documentaries with in-person interviews and high production value. An example we have discussed is a history of Maker video, to explore its origin, accomplishments, and community. Tier 3 projects can be incredibly expensive to produce, 10k-100k+ per video. They require travel, camera equipment, sound equipment, special insurance, lighting and grip equipment, and a hired production crew. The issue is compounded by working in a DAO as it’s obviously not cost-effective to constantly fly around the globe interviewing key stakeholders as enjoyable as it might be. The solution we’ve decided upon is to use big events as a centralized location to get all of the interviews and the majority of the b-roll we need at once. In order to provide the most value and utilize our resources responsibly, the plan is to develop 3-4 of these videos in pre-production and film the interviews and content across one or two events. This is in addition to filming a promotional video for the event itself. Since we would be spending the money on a crew and resources for both short documentaries and event promotional videos, it makes the most sense to film them all at once, saving at least 3x the money and maximizing quality by being able to afford better equipment and a larger crew. This strategy would work perfectly for an event like the one mentioned by @Davidutro yesterday in G&R where we attempt to have the largest Maker presence possible at one event in 2022. As a video producer, I’m all about stretching DAI. Hence, why we could not make Liscon work for video production. There has not been enough time for us to plan the tier 3 content, as we have up to this point been building up our foundational tier 1 and 2. These short documentaries require extensive pre-production including outlining, question lists, treatments, identifying stakeholders, shot lists, and complex logistics planning that looks at not just one video, but aggregates the needs of all of the content we plan to create and organize it in the most time-effective, resource-effective, and ultimately cost-effective way. Also, by taking the extra time in pre-production, it will save us time in post-production as well by being more specific in the interview process. If we film only an event promotional video at Liscon, then we’re spending tier 3 money on a tier 2 project and getting limited content in return. Also, time away from the current content we are creating. This is in addition to the challenges we currently faced as a group to make it to Portugal, as much as we wanted to go. While I can produce this content remotely by utilizing subcontracting resources, we felt it was better to wait until we have the pre-production in place for additional content. Moving Forward Over the next months, you will start seeing the fruits of tier 2, and eventually tier 3 content begin to develop, they just take longer than what you have currently seen as they are tied up in pre and post-production. Since we are in the process of scaling our content efforts, there is a production assistant on this cycle’s budget to directly assist me. It’s been quite an honor and privilege to get paid to work on something I genuinely believe in, and I cannot wait to flex my creative muscles. I am itching to make the tier 3 level high production value content for the DAO, but I want to make sure we do it right and provide as much value as possible. I think the DAO needs video content with people, faces, and an emotional connection to the community and its vision. It’s a special opportunity to stand out across the entire market. We are building towards this. I apologize for the long read, but I hope it gives you and the community a little more transparency into the video side of things. Feel free to reach out anytime if you have any questions about video content or have any ideas, I’d love to hear them. ",
                    "links": [
                        "https://forum.makerdao.com/t/video-producing-under-mip41c5-sp3-facilitator-offboarding-mkt-001/12654/6",
                        "https://forum.makerdao.com/t/video-producing-concerns-addressed/11294",
                        "https://forum.makerdao.com/t/video-producing-under-mip41c5-sp3-facilitator-offboarding-mkt-001/12654/5"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.630947041847042
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jmarshall",
                    "index": "#22",
                    "likes": "3",
                    "time": "29/10/2021-14:55:38",
                    "content": "That post was in good faith and was by no means an attempt to bully anyone. Just wanted to provide the video producer’s perspective since concerns related to video content were addressed. It is not up to delegates or anyone else to reach out to me for content, it was just an open and friendly invitation for discussion since this is a team effort in the DAO, and I genuinely like to hear people’s ideas for video content. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.475
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#23",
                    "likes": "0",
                    "time": "29/10/2021-15:19:41",
                    "content": "    seth:  I’m having a difficult time coming up with a better way to operate in bad faith than telling someone you support them to their face, supporting their proposal, and not only withdrawing that support at the 11th hour but suddenly claiming you have “unanswered questions” and trashing their work.   your boss is bullying ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#24",
                    "likes": "3",
                    "time": "30/10/2021-05:28:14",
                    "content": "This is not a good faith engagement Deimos. Please address things from a factual point of view and help solve the issue here. There is an issue here and regardless of who you believe is at fault, there is little to be gained by such posts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 4.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/liberuum",
                    "index": "#25",
                    "likes": "1",
                    "time": "16/11/2021-11:39:29",
                    "content": "As part of our broader effort to bring more transparency to the CU budget structure, we have documented the wallet setup of this CU and others;  1428×785 69.6 KB  Read more about it here: Introducing the CU Budget Transparency Map ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#26",
                    "likes": "3",
                    "time": "17/11/2021-21:51:28",
                    "content": "For the sake of transparency and simplification:  TotalSpent-Budgeted-Received759×369 20.3 KB   This compares the six-month total spend on salaries from May to October with our projected spend from December to May. While the aggregate spending and the spend/month are expected to increase, the total spend per employee shouldn’t increase significantly.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.34375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#27",
                    "likes": "1",
                    "time": "29/11/2021-13:13:37",
                    "content": "some expensive AMAs is anyone checking the engagement this team is making? crazy is trying the same thing that does not work and maker has been funding this experiment for much too long ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving negative feedback on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Deimos",
                    "index": "#28",
                    "likes": "0",
                    "time": "02/12/2021-18:13:41",
                    "content": "hi mkt001 can you please show kpis and a clear road map for your plans and what you have you think to do with the dai that governance is giving mkt001 every month? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.5
                }
            ]
        }
    ],
    "group_index": "60"
}