{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/paper-on-stablecoins/12960",
            "title": "Paper on Stablecoins ",
            "index": 12960,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#1",
                    "likes": "5",
                    "time": "01/02/2022-12:17:59",
                    "content": "I have seen the paper at the FED, but the paper does not reflect the FED’s view of stablecoins. It is to be understood as economic research. But the Paper is still pretty cool because it is quite neutral and highly focused on stablecoins mechanisms and the use cases, some points are very interesting. And DAI is mentioned server times for public algorithmic stablecoins. Some interesting points. Just as DeFi can provide more inclusion in the financial system, the negative points such as hacks, smart contracts risks, etc. are also clearly recognized at present, should DeFi out grow them the authors see that financial products can be tokenized with stablecoins and DeFi with stablecoins can play a central role in this, which is a key growth driver for stablecoins. The authors of this paper even know about the [Security Tokens Refinancing] MIP6 Application for OFH Tokens it is mentioned in a footer. The paper then describes further growth potentials for stablecoins such as tokenization and innovation drivers for WEB 3.0, for example. In the paper the PEG is mentioned, unfortunately DAI is not mentioned in this section, maybe we should send a mail to the authors. However, the events of Black Thursday are mentioned, the authors see here that the stablecoins were a kind of safe haven which is true, but maybe do not know, that a major point such as fear on chain liquidation rushing into stablecoins no matter what to prevent the liquidation also played a role or were not mentioned for other reasons. The last and largest section, the potential impact of stablecoins on credit intermediation, is mainly about reserve-backed stablecoins because they currently have the greatest market dominance and the closest tie to financial institutions. It is refreshing to read something neutral with facts.   federalreserve.gov    ifdp1334.pdf 1206.63 KB      ",
                    "links": [
                        "https://www.federalreserve.gov/econres/ifdp/files/ifdp1334.pdf",
                        "https://www.federalreserve.gov/econres/ifdp/files/ifdp1334.pdf",
                        "https://www.federalreserve.gov/econres/ifdp/files/ifdp1334.pdf"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.73702731092437
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "01/02/2022-20:08:41",
                    "content": "    makercaesar:  The paper then describes further growth potentials for stablecoins such as tokenization and innovation drivers for WEB 3.0, for example.   Right, so—essentially the Fed believes the stablecoins could see further use cases outside of trading.   cool. Also—seems like ”a two-tiered banking system can support both stablecoin issuance and maintain traditional forms of credit creation” is an indication that they want stablecoin issuers to become banks? Am I interpreting that correctly? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.454081632653062
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#3",
                    "likes": "2",
                    "time": "01/02/2022-22:13:11",
                    "content": "Could be or this means the technical service, what is understood as banking. Let’s quote Bill Gates “the world needs banking but it does not need banks”. But yes I doubt that the FED has an interest in opening up the banking system, I understand it more as a co existence. I think you have to distinguish, it is not the opinion of the FED but of two scientists. It is already somewhere in the framework of the FED so maybe this paper will already have an influence at the FED. I don’t think the Fed has the authority to determine who is a bank and who is not, this has to come from the government side. But it feels like the FED is more on the innovation side than the current US government. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "2",
                    "time": "01/02/2022-22:16:46",
                    "content": "It is really quite accurate as you say all the references or applications of the stablecoins. I find it strange that Dai is not mentioned in any aspect, is there any lack of knowledge about Maker or is it something intentional? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.916666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mr.maxwell.moody",
                    "index": "#5",
                    "likes": "4",
                    "time": "02/02/2022-07:42:22",
                    "content": "To build on this, The President’s Working Group on Financial Markets, the Federal Deposit Insurance Corporation, and the Office of the Comptroller of the Currency collaborated on another report, the “Report on Stablecoins,” which came across as similarly neutral but also mainly focused on reserve-backed stablecoins. It broadly covered stablecoin activities and risks, concluding with these legislative recommendations (for stablecoin issuers): (1) Appropriate risk-management standards for money laundering, terrorist financing, and protecting end users.  - I believe MakerDAO is taking care of this in their own interest. (2) Examination and enforcement authority to certain agencies over stablecoin activities - Maker protocol is such that stablecoin activities are inherently transparent. (3) Limit stablecoin issuance, redemption and maintenance of reserve assets to entities that are “insured depository institutions”…defined as offering an insured guarantee to redeem US dollars to the customer and limiting riskiness of the balance sheet - I believe MakerDAO’s risk core unit manages the latter, but as for the redemption guarantee, that might become a challenge due to having mostly non-USD reserves. As of now there exist no standards regarding the composition of stablecoin reserve assets. Generally, the liquidation ratios take this idea into account. (4) Limit stablecoin issuers’ affiliation with commercial entities - Again, I believe MakerDAO achieves this in their own interest. (5) Interoperability among stablecoins, or between stablecoins and other payment instruments - DAI is traded across virtually all centralized digital asset exchanges. So basically, MakerDAO is in a pretty good spot right now and looking forward when it comes to compliance! Let me know if I missed anything or if you have any comments about either report. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.750148809523809
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#6",
                    "likes": "2",
                    "time": "02/02/2022-10:03:19",
                    "content": "    mr.maxwell.moody:  defined as offering an insured guarantee to redeem US dollars to the customer and limiting riskiness of the balance sheet - I believe MakerDAO’s risk core unit manages the latter, but as for the redemption guarantee, that might become a challenge due to having mostly non-USD reserves. As of now there exist no standards regarding the composition of stablecoin reserve assets. Generally, the liquidation ratios take this idea into account.   Because of the nature of decentralized stablecoins, do you believe that their should be two (2) frameworks for dealing with reserves stablecoins versus “collateralized/asset-backed” stablecoins? And as you mentioned—“non-USD reserves”—how should Regulators view each vehicle when it comes to protecting consumers? Because the reality of it all—most folks don’t care how something is engineered—they just want to make sure it’s user-friendly and it works within a network that their peers are connected to. Sort-of like what instagram is to it’s end-users—a network. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.925000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mr.maxwell.moody",
                    "index": "#7",
                    "likes": "2",
                    "time": "02/02/2022-13:46:44",
                    "content": "    flipflopflapdelegate:  most folks don’t care how something is engineered—they just want to make sure it’s user-friendly and it works within a network that their peers are connected to.   I would have to agree with this sentiment, and applaud the analogy to Instagram. Governments will definitely need two or more frameworks for dealing with stablecoin reserves and collateralization. But DAI makes up too significant an amount of stablecoin market capitalization and has been around too long for governments to dismiss algorithmic/asset-backed stablecoins outright. Take a look at these two graphs that were in the Report on Stablecoins, and you’ll see that the agencies recognize DAI among the top stablecoins in circulation.  1241×848 190 KB   1351×816 165 KB  Even if the Maker Protocol fails to return its users their collateral in a large-scale catastrophic event, legislation such as certain emergency liquidity requirements could be created, instead of a strict one-to-one USD to stablecoin backing requirement. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.019642857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#8",
                    "likes": "2",
                    "time": "02/02/2022-19:56:24",
                    "content": "    Alefcripto:  It is really quite accurate as you say all the references or applications of the stablecoins. I find it strange that Dai is not mentioned in any aspect, is there any lack of knowledge about Maker or is it something intentional?   I don’t think it was with any intention that Dai was not mentioned in the last section, but Dai is mentioned in the public algorithmic stablecoins. It is more about the basic mechanics of stablecoins and their application and potential, and not to present individual projects, of course, MakerDAO is the best, hopefully we will see detailed papers on the subject. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.878205128205129
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#9",
                    "likes": "2",
                    "time": "02/02/2022-20:22:14",
                    "content": "Of course you are right, I was referring to the fact that they mention more the operation of the stablecoins with bank reserve and leave out a little bit the other alternatives, maybe that reveals the intentions to create a stablecoin of their own? Maker is the best way to run a stablecoin with transparent economy without barriers all it offers is a world of possibilities. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.552295918367347
                }
            ]
        }
    ]
}