{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/a-symbolic-statement-restarting-a-micro-burn/19013",
            "title": "A Symbolic Statement -- Restarting a Micro-Burn ",
            "index": 19013,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Leritu",
                    "index": "#1",
                    "likes": "5",
                    "time": "01/12/2022-19:23:54",
                    "content": "I understand that we are in a crypto bear market – and that we likely will be for some time. As it turns out, shutting down the burn of MKR tokens when we did has been very smart. As a community, I believe that we know a core part of the appeal of holding MKR tokens is the “burn” feature that should drive value to MKR holders over time. It makes sense why that feature is turned off right now… but I fear that if it is turned off for too long, prospective MKR investors may forget that it is a feature all together. How would the communities appetite be to restarting a burn that is super small – just a symbolic token of a $100/day burn. This keeps the concept alive that a burn is a core part of driving MKR value… assures MKR investors that the concept is not dead forever… but does not drain our surplus at a time where we need it to expand. I believe this step would be viewed positively by prospective investors and would be an affirmation of the protocol’s intentions of some day returning to a more robust burning strategy for the MKR holders. I welcome the thoughts of the forum! ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.987223424723425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "2",
                    "time": "02/12/2022-03:09:57",
                    "content": "If you are interested in this, you can put it forward as a proposal(AKA a MIP). If you post a rough draft by the 7th, it should be eligible for voting in January. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#3",
                    "likes": "2",
                    "time": "02/12/2022-15:02:15",
                    "content": "I would support this, similar to the DSR feature which was lowered to 0.01% but not removed all together. I think having an active feature even if minimal reminds the protocol and MKR holders of its potential and allows the community to weigh pros and cons of changing the burn % instead of a discussion of whether to turn it on or off (which is painful to have). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.066666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Leritu",
                    "index": "#4",
                    "likes": "3",
                    "time": "02/12/2022-17:46:38",
                    "content": "Thanks for the early feedback/support! I am drafting a modification to MIP74 with the help of this amazing community. More from me soon! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.9375
                }
            ]
        }
    ]
}