{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/risk-of-pro-cyclical-mkr-issuance/1693",
            "title": "Risk of pro cyclical MKR issuance ",
            "index": 1693,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "alignment",
                "flop-auction",
                "reserves"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#1",
                    "likes": "5",
                    "time": "18/03/2020-21:07:20",
                    "content": "The prospect of MKR issuance to recapitalize the system leads to decline in MKR price. Recapitalization is also likely to be needed when overall market sentiment is low. Basically the system is set up to buy high and sell low. Over time this could lead to excessive dilution of MKR holders and make MKR a less valuable asset, which diminishes its value as a system backstop. I’m wondering how the mint/burn mechanics could be set up counter cyclically to avoid minting MKR at low prices? My first impression is to greatly increase the surplus threshold before excess DAI is auctioned for MKR, to allow the system to cover losses from reserves instead of new issuance. Is this a concern of anyone else? Any other prospective solutions or ideas to mitigate this? ",
                    "links": [
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaracion-de-intenciones-fondo-de-reservas-estrategicas-srf/5385",
                        "https://forum.makerdao.com/t/makerdao-protocol-cover-using-nexus-mutual/4761/33",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3352904040404034
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#2",
                    "likes": "3",
                    "time": "18/03/2020-21:15:17",
                    "content": "My opinion is that there needs to be flop auctions when there is no system debt (and especially when there is system surplus) so the proceeds can be used to boost surplus reserves. That way during periods of drawdown we will have enough cash to cover the losses. Setting a high surplus threshold is important but not enough. Thats because institutional Dai demand grows as a function of system surplus. And if we rely solely on revenues to boost surplus it will take decades before MakerDAO is of global significance. Thats why I believe surplus threshold should be as high as possible with as much inflows of Dai from as many directions as possible. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6454545454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#3",
                    "likes": "0",
                    "time": "18/03/2020-21:23:31",
                    "content": "Another benefit is that Maker doesn’t pay the DSR on DAI stored in the surplus buffer. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#4",
                    "likes": "4",
                    "time": "18/03/2020-22:03:32",
                    "content": "I wonder if maker governance could solicit offers of cash secured (or DAI secured) put options on MKR, so if MKR price falls below 200 DAI or some other arbitrary threshold, governance could exercise the option to recapitalize the system with limited downside pricing/slippage risk. The system participants selling the put options could earn a return on their locked DAI, and MKR holders would be able to hedge systemic risk. I’m thinking of it sort of like Coco (contingent convertible) bonds used by European financial institutions. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.127232142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#5",
                    "likes": "2",
                    "time": "18/03/2020-22:07:19",
                    "content": "I think MKR as a collateral could be useless if we had bigger losses… I mean it took almost 8 m DAI to burn less than 15k MKR… and now we are going to mint almost 25k MKR for 5.3 m DAI I like the idea of increasing surplus… but I think the surplus shouldn’t be DAI… because if we locked too much DAI it will create artificial scarcity of DAI so instead our surplus should be stored in the same assets used as collateral with the same % for example 90% ETH, 5% BAT, 5%USDC and we can start burning MKR when we have large surplus and when we feel we will get the highest return of MKR burn ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.352843915343915
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#6",
                    "likes": "3",
                    "time": "18/03/2020-22:43:04",
                    "content": "Keeping the surplus in collateral assets helps alleviate DAI liquidity issues, but on the other hand it increases the risk to MKR holders of a fall in collateral prices. So it would increase the overall system collateralization but I’m not sure if I’d really consider this to be reserves. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#7",
                    "likes": "1",
                    "time": "18/03/2020-23:07:16",
                    "content": "Selling MKR put options in exchange for DAI could also be an efficient and countercyclical method of enforce monetary policy by restricting liquid supply when DAI is trading below the peg. If a triggering event occurs, much or all of the DAI needed to recapitalize the system would already be out of circulation, so it should not result in as large of a liquidity crisis as we’ve seen this past week ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.273809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#8",
                    "likes": "2",
                    "time": "19/03/2020-02:44:16",
                    "content": "Yup, I think it’s a great idea to increase the surplus threshold. I think there’d be a lot of support. Stakeholders probably didn’t understand how much was enough, and maybe we were too excited for the buybacks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pragmaticadam",
                    "index": "#9",
                    "likes": "2",
                    "time": "19/03/2020-05:08:36",
                    "content": "I think introducing MKR put (but also call options) is a great idea. that can be done without changes to core system. Another thing is to have realistic risks parameters. Having 0 DSR Spread was just stupid, and now we pay the price, we should have bigger income stream in a good times, because risk of DAI in DSR is much bigger than it was anticipated, by many (I remember outrage here, when someone voted 2% DSR spread, which probably is reasonable value) Also one quick remark - historically on a stock market having roboust options market of some base asset decreased volatility of that asset ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "5",
                    "time": "19/03/2020-11:48:34",
                    "content": "    pragmaticadam:  Having 0 DSR Spread was just stupid, and now we pay the price, we should have bigger income stream in a good times   This is not a foregone conclusion. It is still good policy to have a 0% DSR spread because it encourages DAI adoption, grows the DAI ecosystem, and increases the future income stream. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6000000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#11",
                    "likes": "0",
                    "time": "19/03/2020-13:38:59",
                    "content": "    pragmaticadam:  Having 0 DSR Spread was just stupid, and now we pay the price, we should have bigger income stream in a good times, because risk of DAI in DSR is much bigger than it was anticipated, by many (I remember outrage here, when someone voted 2% DSR spread, which probably is reasonable value)   No, it was stupid to have 8% SF when the rest of the world had near zero interest rates. Had the SF been 3% or lower we would have much more DAI in circulation which is always a good thing (the system is more stable when it is bigger). I’m pretty sure DAI price would not be significantly lower because of the lower SF. Instead of 100M DAI with 5M bad debt we could’ve had 200M DAI with 10M bad debt. I’m not sure if that is better - I hope it is. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4144736842105265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "1",
                    "time": "19/03/2020-14:02:40",
                    "content": "    bit:  I’m pretty sure DAI price would not be significantly lower because of the lower SF.   I am very unsure about this. Realistically we should have set a higher surplus. I think that is the main takeaway. There is an argument that the DSR spread should have been higher, but realistically the job of that parameter isn’t to balance risk, it’s to control growth. The risk parameter for Eth would have been set once we got the risk analysis through for Eth (which will now be further delayed  ) An argument could be made that we should have been using the DSR Spread to compensate for risk in the short term. But yeah, hindsight, etc. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.106481481481482
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pragmaticadam",
                    "index": "#13",
                    "likes": "1",
                    "time": "19/03/2020-14:31:03",
                    "content": "You cannot increase adoption in expense of system solvency, and by having DSR spread equal 0 was doing exacly that. Pretending that DAI in DSR do not impose risks on MKR Holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pragmaticadam",
                    "index": "#14",
                    "likes": "1",
                    "time": "19/03/2020-14:33:50",
                    "content": "    bit:  No, it was stupid to have 8% SF when the rest of the world had near zero interest rates   What “rest of the world?” comparing MakerDAO to FED or ECB is naive at best. And bigger supply of DAI = more exposure of vaults that generated this DAI = more auctions to liquidate them in black swan event = even higher network congestion = even higher bad debt ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.287878787878788
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#15",
                    "likes": "0",
                    "time": "19/03/2020-14:40:52",
                    "content": "    pragmaticadam:  And bigger supply of DAI = more exposure of vaults that generated this DAI = more auctions to liquidate them in black swan event = even higher network congestion = even higher bad debt   If auctions work as intended then the 13% penalty fees will cover any losses and contribute to surplus. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4523809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pragmaticadam",
                    "index": "#16",
                    "likes": "0",
                    "time": "19/03/2020-16:09:59",
                    "content": "    psychonaut:  If auctions work as intended   That is a big if, looks like there are fundamental reasons for auctions not being scalable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#17",
                    "likes": "0",
                    "time": "20/03/2020-14:10:58",
                    "content": "Well, the good thing with the 6.5 day delay in this case is that it gave some time for the ETH price to recover. It’s slightly anti cyclical.  Also, responding to some of the other replies. I think this is why we want healthy sustainable growth. We need to always be cognizant of the risk factors. We can’t shrug them aside. We also don’t need to keep the gas pedal floored the whole time (0% DAI spread). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.108333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mmoossttaaffaa",
                    "index": "#18",
                    "likes": "0",
                    "time": "20/03/2020-14:45:06",
                    "content": "yeah the 6.5-day delay was very helpful… maybe auctions should be done on longer more distributed schedule for example over one year so that 2% auctioned per week… this will also give time for collected fees during this period to pay for some or most of the debt ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneBiteLawnOrder",
                    "index": "#19",
                    "likes": "2",
                    "time": "20/03/2020-15:36:10",
                    "content": "I think the cyclical nature of the risk described here is more of a feature rather than a bug. It highly incentivizes MKR holders to govern in a way that prevents the system accumulating bad debt, even in the depths of a cycle or black swan. This current event is clearly a growing pain and that is the system working as intended, however going forward it is clear that Governance will be doing everything they can to ensure that flop auctions do not become a normal cyclical occurrence. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.089583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#20",
                    "likes": "0",
                    "time": "20/03/2020-18:53:20",
                    "content": "There has been a lot of consternation recently regarding the US fed setting bank reserve requirements to 0%, but in hindsight MKR has been operating on a 0% reserve structure as well. System surplus of 0-50k DAI compared with 100MM DAI market cap is basically 0 reserves. It’s as if a bank lent out 100% of deposits for mortgages that are 150% backed by real estate - if any single loan defaults, the bank becomes immediately insolvent. Collateral ≠ reserves ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pragmaticadam",
                    "index": "#21",
                    "likes": "0",
                    "time": "24/03/2020-10:58:24",
                    "content": "One remark, At exacly same time when there was 5 mln of bad debt DAI was trading 0.06-0.1 $ above a peg. Maybe MakerDAO should have right to Issue “Empty DAI” (and buy back MKR token for those DAI) to bring peg down and also responsibility to buy them back (minting MKR) when situation stabilize / DAI peg breaks down. I’m aware that it play wit a concept of every single DAI being overcollateralized all the time, but there Is strange mismatch in current dynamics: Maker ecosystem is most useful for crypto people in the moment of market crash, providing safe harbour (DAI) but it do not benefit from that service it provides. Instead it takes a hit. What MakerDAO benefits from is providing leverage in good times, which, I would argue, Is neither main reason for its existence nor it biggest advantage/utility In other words there is a mismatch between source of revenue of MakerDAO and most useful services it provides to the market / risks it takes, such mismatch is never good for a system. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.390182884748103
                }
            ]
        }
    ]
}