{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/lets-get-dsr-above-0-again/6166",
            "title": "Lets get DSR above 0% again ",
            "index": 6166,
            "category": [
                "Governance"
            ],
            "tags": [
                "dsr"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#1",
                    "likes": "14",
                    "time": "23/01/2021-13:15:14",
                    "content": "We haven’t talked about the DSR for a long time since we decided to keep it at 0% in September. We did this, because we were heavily above peg and had ~0% stability fees. Since we fixed the peg and made major steps to improve the supply side of DAI (LP tokens, 101% LR stablecoin vaults, and finally the PSM lerping up to 500M), we should now start to look at the demand side of DAI. Let’s face it: a uncensorable stablecoin is not providing an edge in the stablecoin competition. It is a nice thing for all crypto maximalists, but the average Jane and Joe will look for something different that we can offer: earn interest on DAI. Compound has the DSR already integrated, so does Coinbase. My bet: if we can make DAI favorable compared to USDC and Tether, we will get a lot of demand. We do have the tools in place or about to get to production (LP tokens as collateral, IAM for DCs, PSM so everybody can be sure we stay pegged to USD) to provide the supply. We can go ballistic on DAI demand by providing a non-zero DSR, that will eventually also lead to more 3rd party integrations. Obvious downside: we are losing a non negligible fraction of the fees. But we are in the very beginning of the stable coin market and I rather not make any money for a year and instead claim the #1 place in the competition. Right now we are doing a good dollar of fees per second, I hope we are going to laugh about this in a year.  Next Steps I would like to kick off the discussion about raising the DSR again here. I have no idea what would be reasonable: is 0.25% enough? 0.5%? 1%? even more? Or is this just a stupid idea? I hope for some  here, in case there is even a slight chance of the community likes this idea, I will set up a Signal Request on that topic in a couple of days (kind of a lesson I learned from my infamous ETH-B-DC-signal: let’s first discuss before setting up poll) - hopefully leading to an on-chain poll. ",
                    "links": [
                        "https://vote.makerdao.com/executive/collateral-onboarding-debt-ceiling-adjustments-other-changes?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/signal-request-adjust-eth-b-line-iam-ceiling/5731",
                        "https://forum.makerdao.com/t/signal-request-raise-dsr/6241",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-24th-2021-updated-payout-formula/6246",
                        "https://forum.makerdao.com/t/maker-relay-ep-29-en-espanol/6220",
                        "https://forum.makerdao.com/t/maker-relay-ep-29/6214"
                    ],
                    "GPT-summary": "The author of the post is proposing to raise the DSR (Dai Savings Rate) to attract more demand for DAI. They explain that they have the necessary tools to provide the supply and that a non-zero DSR will eventually lead to more 3rd party integrations. The author asks for feedback on what would be a reasonable DSR to set and plans to set up a Signal Request on the topic.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.579916225749559
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#2",
                    "likes": "2",
                    "time": "23/01/2021-13:22:40",
                    "content": "0.25% is probably not enough but it will send a signal. It is a good idea to start a signal request. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "2",
                    "time": "23/01/2021-14:07:40",
                    "content": "Agree with @alexis. We have to be careful about raising it too high (internal cost +upward pressure on the Peg), but IMO the benefits of encouraging new devs to incorporate the DSR and allowing a “safe” option for DAI holders to gain some yield make it well worth it. My online “high interest savings account” is only paying out 0.4% APY, so a small amount for DAI holders would put us on par with what CeFi Banks are offering. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.175974025974027
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "11",
                    "time": "23/01/2021-14:08:37",
                    "content": "First, I want to state that making any revenue should be used for two things:  Increase our capital base to keep the system secure Spend on growth  Our assets generate 2.5% currently ($36M). Raising DSR to 25bps would take up to 10% of our revenues or $3.6M/year. I can see some value in having a DSR but really I’m not sure it will change my behavior. I’m not sure retail users will use it because of gas costs and lack of tools. Sure Compound will turn it on but I don’t really think it will change behavior neither. It’s just throwing money at whales. I would suggest deciding to burn $4M this year on Marketing. The first step would probably be customer development, the “Get out of the building” from Steve Blank. I just find out that if you don’t have DAI oasis is providing you a nice onboarding. But the result is not great. 5k DAI purchased this week? Like at max 5 new customers from this channel? Not acceptable.  We currently have 12% transaction volume market share (it’s similar for monthly active users). This is the metric we should aim to increase. image832×431 10.5 KB We need to understand while retail and business are using USDT over DAI, what are their need. Then, and only then, do something. Maybe it will be giving 100 DAI for each new Argent user or I don’t know. I have hope we have our own DAI-ecosystem mobile app which provides a nice L2 experience for banking the unbanked (I wouldn’t care investing $1M on such core unit). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.463498622589532
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#5",
                    "likes": "1",
                    "time": "23/01/2021-14:35:30",
                    "content": "Imho we can just try it with a fairly small percentage (0.5%) and watch if this does increase demand. I don’t think that will do a significant harm to the peg, I instead think it will just do a significant impact on the supply side: a lot of new DAI will get minted eventually even providing more fees for us. Could even happen that we don’t even make a loss here. Looking at the past when we had a positive DSR, there was usually not more than 50% of DAI deposited there… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.539772727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#6",
                    "likes": "0",
                    "time": "23/01/2021-14:40:01",
                    "content": "    SebVentures:  Our assets generate 2.5% currently ($36M). Raising DSR to 25bps would take up to 10% of our revenues or $3.6M/year.   Oh that is interesting! Based on which DSR utilization?     SebVentures:  I’m not sure retail users will use it because of gas cost   Retail users are on coinbase so don’t care about gas. They will just want to have DAI because coinbase takes care of the interest.     SebVentures:  I would suggest deciding to burn $4M this year on Marketing. The first step would probably be customer development, the “Get out of the building” from Steve Blank.   Totally agree, but this is not conflicting with trying “word of mouth” marketing - which can just happen with natural adoption getting fueled by DSR. Maybe I am wrong, but I guess it is at least worth to try. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#7",
                    "likes": "4",
                    "time": "23/01/2021-14:46:59",
                    "content": "i recommend 0.01%  (basically something immaterial but also non-zero). PR more than anything. and then increasing 1 / 5 / 10bps at a time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#8",
                    "likes": "0",
                    "time": "23/01/2021-16:25:47",
                    "content": "Right now we make 35M on fees every year (based on ~1.5billion DAI), that is more than 2% for every DAI issued. If we would assume that half of the DAI supply gets locked into DSR (which is probably the top we had around compound-craze), we would lose  17M every year if we would go for 2% (which would probably get gamed by USD-PSM-swaps, so probably not a good idea) 8.5M every year if we would go for 1% 4M every year if we would go for 0.5% 2M every year if we would go for 0.25%  almost nothing if we would go for 0.01%  am I doing the math right? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.878968253968254
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#9",
                    "likes": "6",
                    "time": "23/01/2021-17:04:28",
                    "content": "    ultraschuppi:  Since we fixed the peg and made major steps to improve the supply side of DAI (LP tokens, 101% LR stablecoin vaults, and finally the PSM lerping up to 500M), we should now start to look at the demand side of DAI.   I think this is debatable. Yes, we have fixed the peg. But we did this at the cost of embarking a lot of centralised stablecoins. We currently have more than 400m USD in stablecoins on MakerDAO vaults… I think we should not just relax and assume we have fixed the peg. We have temporarily fixed the peg, yes, but at the cost of weakening the:     ultraschuppi:  a uncensorable stablecoin   i.e., main selling point of DAI. I am afraid that introducing a positive DSR will create upward pressure on the peg. This pressure will be absorbed by the PSM but, again, probably at the cost of embarking more and more USDC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.734442640692641
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#10",
                    "likes": "1",
                    "time": "23/01/2021-17:06:30",
                    "content": "    SebVentures:  I would suggest deciding to burn $4M this year on Marketing. The first step would probably be customer development, the “Get out of the building” from Steve Blank.   I feel this is better too, because let’s face it, giving even 2% or 4% APY won’t be attractive in front of other plattforms like Aave, Compound, Yearn or Curve, people will still choose those among the DSR. So is better to focus on expand Dai adoption and opening more Vault types first. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.671875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#11",
                    "likes": "1",
                    "time": "23/01/2021-17:45:21",
                    "content": "    iammeeoh:  Yes, we have fixed the peg. But we did this at the cost of embarking a lot of centralised stablecoins. We currently have more than 400m USD in stablecoins on MakerDAO vaults   We already had times were we had more than half of the DAI backed by stablecoins. Not the case anymore, everytime I look DAI from Eth is growing while DAI from usdc is stagnating. DAI from TUSD silently shrinked by 15 M in the last week. But yes, we should try to decrease that even more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.895833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#12",
                    "likes": "2",
                    "time": "23/01/2021-18:14:31",
                    "content": "I’m seeing a lot of people saying that the DSR causes us to “lose” money. I think this is inaccurate. The money distributed via the DSR is then redistributed throughout the rest of the economy through various means. If there is not enough Dai in active circulation (i.e., not tied up in contracts or positions) then demand rises, and then either the price must go up or the supply must increase. An increase in supply, in our case, means more stability fees in the long run. My proposition is this: If we sprinkle a little extra Dai on the crypto-economy, surplus (no matter how small) will follow and people will find uses for the extra Dai. That creates velocity, which increases demand, which as stated, will bring us more fees. Thoughts? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.189583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#13",
                    "likes": "1",
                    "time": "23/01/2021-23:14:12",
                    "content": "Either MakerDAO is too greedy so it keeps all profit to itself or the system is not stable so it needs all buffer/reserve it can get. Either way we DAI holders get nothing unless we deposit to Compound, Aave or Uniswap. Of course I support raising the DSR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#14",
                    "likes": "1",
                    "time": "24/01/2021-00:15:55",
                    "content": "I feel that now is a good time to increase DSR appropriately, please start! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#15",
                    "likes": "3",
                    "time": "24/01/2021-00:56:37",
                    "content": "I oppose raising the DSR at this time. There is already ample natural demand for Dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#16",
                    "likes": "3",
                    "time": "24/01/2021-00:57:04",
                    "content": "    ccc:  If there is not enough Dai in active circulation (i.e., not tied up in contracts or positions) then demand rises, and then either the price must go up or the supply must increase. An increase in supply, in our case, means more stability fees in the long run.   The ability to generate debt is not that elastic. We may just end up generating more debt via stablecoins or the PSM at 0% SF. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.816666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#17",
                    "likes": "3",
                    "time": "24/01/2021-01:02:11",
                    "content": "    ultraschuppi:  We already had times were we had more than half of the DAI backed by stablecoins. Not the case anymore, everytime I look DAI from Eth is growing while DAI from usdc is stagnating. DAI from TUSD silently shrinked by 15 M in the last week. But yes, we should try to decrease that even more.   Yes, it would be much better if we were able to flush our stablecoin vaults first. Also it seems questionable what effect a 0.5% or lower DSR would be. Also depends how it’s implemented but it could add a lot of gas overhead for users. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.87962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo",
                    "index": "#18",
                    "likes": "2",
                    "time": "24/01/2021-05:36:34",
                    "content": "I hope it passes. DSR integrations including with both DeFi and legacy industries are getting rusty  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#19",
                    "likes": "2",
                    "time": "24/01/2021-09:05:30",
                    "content": "agreed. i recommend 0.01% for this reason. e we have a non-zero but immaterial amount. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#20",
                    "likes": "0",
                    "time": "24/01/2021-09:08:13",
                    "content": "There will come a time when the DSR is the best rate available (and lowest risk).  I’m not sure it matter that much of some projects wait until then to integrate the DSR. Edit: I’m not sure if a non-zero but insignificant DSR value would be helpful for integrations, PR, etc., but at worst it is harmless so I’m not opposed to it. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#21",
                    "likes": "0",
                    "time": "24/01/2021-09:10:43",
                    "content": "Nice initiative @ultraschuppi bringing this up. With regards to the peg there is presently no reason to increase the DSR to above 0%, demand for DAI is as high as ever. However, when looking at this from a system perspective there could be good reasons for increasing the DSR as we as a community should observe how the wider ecosystem responds to a DSR increase. What we could do is to steadily increase the DSR to levels to at least compete with a normal US savings bank account. If we consider online banks as the benchmark a DSR of about 1% should do it. Problem is that other defi players such as Aave have much higher rates on deposits so I kind of doubt it will have any effect. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.917361111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#22",
                    "likes": "2",
                    "time": "24/01/2021-09:11:58",
                    "content": "chicken and egg. when it matters, we don’t want to hope for timely integration … the sooner the better and 0% presents no motivation. that said there is no reason for a large DSR while we still have stablecoin exposure. recommending 0.01% ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.190476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/swakya",
                    "index": "#23",
                    "likes": "3",
                    "time": "24/01/2021-13:19:43",
                    "content": "I also support a nonzero DSR, to keep integrations alive. Too long at 0% and the DSR meme dies out. Anywhere between 0.01% and 0.25% is fine by me. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.777777777777777
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#24",
                    "likes": "0",
                    "time": "24/01/2021-14:44:06",
                    "content": "Are you serious with 0.01% or it is a joke? Do you want users to lose more money on gas than they get from DSR? Is anyone willing to change their code or activate it for 0.01% yearly gain? Am I missing something? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.270833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#25",
                    "likes": "1",
                    "time": "24/01/2021-15:22:47",
                    "content": "I don’t think this is being proposed for retail users. The normal user will go to Aave or Compound where they can get a better %. 0.01% - 0.25% would then be used mainly to keep integrations with other protocols, ie. Compound will put their DAI pool within the DSR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.864583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jeffshaw",
                    "index": "#26",
                    "likes": "0",
                    "time": "24/01/2021-15:37:27",
                    "content": "I’m not following the math here to arrive at 4 million in cost to raise DSR to 0.25%. With 6.7 million Dai in the DSR, this amounts to 17k in cost per year. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#27",
                    "likes": "0",
                    "time": "24/01/2021-16:25:39",
                    "content": "I think starting at 0.1% would make sense, and then potentially increase to 0.25% in order to lay the groundwork for future supply side expansion such as large scale RWA onboarding when the DSR will probably need to go to 2% ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#28",
                    "likes": "4",
                    "time": "24/01/2021-18:01:07",
                    "content": "While unlikely to be 100%, you can expect most protocols to enable DSR (at least Compound). Sure, most likely not 100% of DAI, but close to it at some point. 0.25% in DeFi is almost nothing. And it will mainly penalize small users. You need 4k DAI to generate enough gas value for calling the DSR. Not saying that raising the DSR is a bad idea. It can help and it’s easy to do. I’m mainly saying the fact that the obvious thing we can do is not likely to be the smarter thing to do. What about sending x DAI to each active user of DAI as a thank you? That would provide way more PR in my opinion. If we want to increase DAI adoption we need to understand our customer base. I think @amyjung had a tweet about someone in user research (it’s here). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0245098039215685
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#29",
                    "likes": "2",
                    "time": "24/01/2021-19:31:50",
                    "content": "    SebVentures:  What about sending x DAI to each active user of DAI as a thank you? That would provide way more PR in my opinion.   This is IMHO a ways better option than giving DAI away to other protocols. Something as small as 0.01% probably will not cause us any damage, but I’m not sure if it will really bring any benefits to us. Another idea is using 0.01% of our earning to support liquidation of small Vault owners. Returning the dust value to an acceptable level will bring more value to the protocol. If we have a vote to raise the DSR above 0%, it’ll be really good that this would be one of the options, to compete with others things we can do with those DAI. At the very end, the idea is to find out what brings more value to the protocol in the long run. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#30",
                    "likes": "10",
                    "time": "25/01/2021-01:14:17",
                    "content": "We still have over 1/3 of Dai supply generated from stablecoins. I can’t support turning on the DSR when demand is still so much higher than natural supply from vaults. In addition to the direct costs of paying for the DSR, it will also increase uncompensated risk from stablecoins, and could put more upward pressure on the peg. While I like the idea of turning on DSR at 0.01% to incentivize integrations, ultimately I think DSR should be used for monetary policy, not business development or marketing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely negative feedback on proposal"
                    ],
                    "Sentiment": 5.949999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#31",
                    "likes": "1",
                    "time": "25/01/2021-09:50:39",
                    "content": "I agree but the main concern here is that people are forgetting about it and dev don’t integrate with it anymore. As example you can take curve. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Replenish2030",
                    "index": "#32",
                    "likes": "1",
                    "time": "25/01/2021-10:06:02",
                    "content": " I agree but the main concern here is that people are forgetting about it and dev don’t integrate with it anymore. As example you can take curve.  Exactly this! its an integrations expense that is almost certainly worth it given the importance of integrations as the main moat in defi and crypto ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.182291666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OliverNChalk",
                    "index": "#33",
                    "likes": "2",
                    "time": "25/01/2021-12:05:44",
                    "content": "I collect 30% p.a. on compound, you’re 25bps on top will have zero impact on my habits. Raising dsr now is a waste of money. We should be pocketing the profits during this yield farming mania and raising the dsr post mania. Spending money on growth right now when comp holders are already subsidising it is low EV. Those dollars would buy 10x more growth if we instead spent them in a low interest rate environment. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.704081632653061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#34",
                    "likes": "4",
                    "time": "25/01/2021-12:08:49",
                    "content": "    monet-supply:  While I like the idea of turning on DSR at 0.01% to incentivize integrations, ultimately I think DSR should be used for monetary policy, not business development or marketing.   I very much agree that the fundamental purpose is monetary policy. No dispute. That said, for it to be an effective tool, it has to be integrated. Getting off zero to something immaterial (e.g 0.01%) facilitates / help that integration to make the DSR that much more effective when it is used. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.959999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#35",
                    "likes": "2",
                    "time": "25/01/2021-15:25:35",
                    "content": "since we still have 0% fees on stable-coin-vaults with >0 DC - could we run into people trying to game it by supplying e.g. USDC putting the minted DAI into DSR? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 3.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#36",
                    "likes": "0",
                    "time": "27/01/2021-21:38:13",
                    "content": "Signal started - please move over there for better visibility of your opinions. Thanks everybody! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#37",
                    "likes": "0",
                    "time": "27/01/2021-21:39:22",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}