{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/tl-dr-core-unit-mips-submission-process/6245",
            "title": "TL;DR Core Unit MIPs Submission Process ",
            "index": 6245,
            "category": [
                "Maker Improvement Proposals"
            ],
            "tags": [
                "summary",
                "mips",
                "core-unit"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/amyjung",
                    "index": "#1",
                    "likes": "13",
                    "time": "28/01/2021-02:58:52",
                    "content": "Summary If you are submitting Core Unit MIPs, the deadline for the MIPs to be submitted for the March Governance Monthly Cycle is February 3rd. It will go into Request for Comment (RFC) for a month, which means you can edit as necessary. At any time, may defer submission. If it goes through the complete Governance process outlined below, the MIP would be ratified March 26.** (The deadlines for the next April cycle is March 10th for April 26th vote.) You need the following MIPs submitted via Github:  MIP39c2: Adding Core Unit MIP40c2: Modify Core Unit Budget MIP41c4: Facilitator Onboarding  Other Details   Chat about Core Units: Join #core-unit-operating-model-onboarding to discuss, give and receive feedback.  Learn more about Core Unit Framework: Watch the Presentation from G&R Call and Know Your MIP recording for more details on the core unit framework and one international blockchain accounting and payroll service available for core units. (Operational Support will be keeping a resource list)  Submit a Core Unit: Reach out to @charlesstlouis, @longforwisdom or @Davidutro for support on submitting via Github (it’s okay if it’s your first time).  ** Note, the Core Unit MIP itself will be going through submission in the March cycle. MIP Process Expanded (Skip if you’re familiar with Governance Process) Most MIPs in the standard Governance Cycle go through a minimum process of 2 months. All the Core Unit subpropsals have a minimum of one month RFC, then 1 week frozen period before formally submitting into the governance cycle for a vote. 1014×314 38.3 KB The complete process is outlined in the MIP Lifecycle section of MIP0. Key Elements Submission The lifecycle of a MIP begins when the MIP proposal is posted on the Maker forum. In order for a MIP to move to the next stage, it needs:  Submitted to the MIPs Discourse Forum with appropriate category and tags (Maker Improvement Proposals, RFC) Submitted to the MIPs Github repository (with a Pull Request created by the MIP Author or MIP Editor). The format must follow the appropriate MIP Template for its type.  Reach out to @charlesstlouis for the MIP number and support on submission. The (Request for Comments) RFC Phase This phase is when a MIP goes through a formal review period, including feedback from the community, further drafting and additions. There are two parts:   Minimum Feedback Period: The minimum amount of time within which the community is able to give feedback in response to a proposed MIP. All the Core Unit subproposals are one month.   Minimum Frozen Period: The minimum amount of time during which a MIP must remain unchanged (frozen) before it can be submitted for ratification/implementation. All the Core Unit subproposals are one week.   If you are not ready to submit your MIP from RFC to the Governance Cycle for a vote, you may Defer. Governance Cycle This phase is when MKR holders vote on whether to include the MIP in the governance poll, ultimately determining whether or not the MIP can formally enter the governance cycle. Once approved for the governance poll, MKR holders determine whether to accept or reject the package of proposals and finally to ratify the result in the executive vote. If all goes well, an example of the March Governance Cycle Dates: February 3rd: Submit MIP, it goes into RFC for a minimum of one month March 8th: Inclusion Poll March 22th: Executive Vote goes up The next deadline of the April Governance Cycle is: March 10th: Submit MIP, it goes into RFC for a minimum of one month April 12th: Inclusion Poll April 26th: Executive Vote goes up  That’s the TL;DR. Happy Submissions! ",
                    "links": [
                        "https://forum.makerdao.com/t/mip39-core-unit-framework/6096/2",
                        "https://forum.makerdao.com/t/mip40-budget-framework/6097/2",
                        "https://forum.makerdao.com/t/mip41-facilitator-framework/6098/2",
                        "https://chat.makerdao.com/channel/core-unit-operating-model-onboarding",
                        "https://youtu.be/9G6rUpOkJPE?t=2215",
                        "https://www.youtube.com/watch?v=iOu_x8OelEQ",
                        "http://accountable.dk/",
                        "https://github.com/makerdao/mips/blob/Accepted/MIP0/mip0.md#mip0c3-the-mip-lifecycle",
                        "https://github.com/makerdao/mips/tree/master",
                        "https://forum.makerdao.com/t/core-units-i-wish-existed/6248",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-126-thursday-january-28-17-00-utc/6149/2",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-31st-2021/6346",
                        "https://forum.makerdao.com/t/maker-relay-ep-30/6303",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-127-thursday-february-4-17-00-utc/6261/2",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/13",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-126-thursday-january-28-17-00-utc/6149/5",
                        "https://forum.makerdao.com/t/weekly-mips-update-26/6291",
                        "https://forum.makerdao.com/t/maker-relay-ep-30-en-espanol/6360"
                    ],
                    "GPT-summary": "The post explains the process for submitting Core Unit MIPs for the March Governance Monthly Cycle, including the deadlines and steps involved. It also provides details on the Core Unit Framework and how to submit a Core Unit. The post invites feedback and collaboration and provides resources for those interested in learning more.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.982142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#2",
                    "likes": "5",
                    "time": "28/01/2021-03:24:07",
                    "content": "How do you like a post multiple times? Great work @amyjung!!! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#3",
                    "likes": "1",
                    "time": "28/01/2021-14:58:23",
                    "content": "Thank you for posting this Amy, this is solid info to consider for teams. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}