{
    "poll_list": [
        {
            "title": "Vault Compensation Poll - April 06, 2020",
            "index": "1822",
            "option": "Yes",
            "supporting_mkr": "62,307",
            "highest_fraction": 0.65
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/on-chain-vault-compensation-poll-draft/1822",
            "title": "On-chain vault compensation poll, draft ",
            "index": 1822,
            "category": [
                "Governance"
            ],
            "tags": [
                "vault-compensation",
                "covid-crash"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#1",
                    "likes": "3",
                    "time": "26/03/2020-21:22:22",
                    "content": "See https://github.com/makerdao/community/pull/493 ",
                    "links": [
                        "https://forum.makerdao.com/t/compensating-vault-holders-that-liquidated-at-0-bid/1541/103",
                        "https://forum.makerdao.com/t/black-thursday-vault-owners-report-thread/1566/21",
                        "https://forum.makerdao.com/t/unable-to-withdraw-eth-collateral-from-cdp/1848/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-april-9-9am-pst-4-00-pm-utc/1938/3"
                    ],
                    "GPT-summary": "The post is a draft proposal for on-chain vault compensation poll, and the author is sharing it on GitHub for feedback and comments.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Community and engagement",
                        "Smart contract updates",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#2",
                    "likes": "0",
                    "time": "26/03/2020-23:25:42",
                    "content": " I suggest a Monte Carlo simulation to thoroughly explore possible outcomes. Do we really need this? Or is there a simple way to make a persuasive case to vault holders? If we need a simulation, can we spec out the requirements in enough detail without putting in too much effort and time? Raw data shall be extracted from the blockchain. https://www.dropbox.com/s/ovasjaf8gx03ko2/maker.csv?dl=0 shall be validated. The simulation shall consist of an easy to understand Python script that replays events under various assumptions about ETH and DAI liquidity. The OSM shall not be hindered by high gas prices. More than one keeper shall bid on auctions. Various assumptions will be made about keeper profit per auction. At the end of the events simulation, remaining collateral per vault will be output in terms of ETH and also the DAI value of residual ETH at the time of liquidation. The Python script shall be easy for anybody to run to verify the results.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.57534516765286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BlueSky",
                    "index": "#3",
                    "likes": "0",
                    "time": "27/03/2020-04:46:56",
                    "content": " Yes, in the DAI value of estimated remaining collateral at the time of liquidation  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#4",
                    "likes": "2",
                    "time": "27/03/2020-09:35:17",
                    "content": "    psychonaut:  ’m listening to the governance call. Where is the referenced medium post with the analysis of the losses? I haven’t seen a link to that. Somebody please post it.      Medium – 20 Mar 20    Black Thursday for MakerDAO: $8.32 million was liquidated for 0 DAI Data from the Ethereum shows that 36% of liquidations on March 12–13 were auctions with zero bids, liquidators earned 62K ETH for free Reading time: 6 min read       ",
                    "links": [
                        "https://medium.com/@whiterabbit_hq/black-thursday-for-makerdao-8-32-million-was-liquidated-for-0-dai-36b83cac56b6"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#5",
                    "likes": "2",
                    "time": "27/03/2020-10:41:39",
                    "content": "    BlueSky:  Yes, in the DAI value of estimated remaining collateral at the time of liquidation   This is not a place to express your opinion. The poll will be conducted on-chain. What is happening here is developing the presentation for the poll. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#6",
                    "likes": "4",
                    "time": "27/03/2020-11:33:27",
                    "content": "I was surprised to hear lots of discussion on the governance call to suggest that the risks of opening a vault were not adequately disclosed. This seems ludicrous to me. We have others reasons to compensate vault holders, but this reason just seems completely ridiculous. If some vault holders really didn’t understand the risks of leverage then they got what they deserve. I think it is dangerous for Maker to set a precedent that we accept liability for educating prospective vault holders. I’m in favor of education, but it’s not our fault if people are dumb. “Risks of leverage were not adequately disclosed” is a reasonable argument in favor of compensation,     Yes No     0 voters     ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 4.286458333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#7",
                    "likes": "2",
                    "time": "27/03/2020-15:38:17",
                    "content": "There was pretty significant support for lower compensation on the original polls. Something like 56% of people showed some support for the  < “high compensation” options. Should there be an option that captures compensation should be <  “estimated remaining collateral at the time of liquidation”     psychonaut:   Yes, in the DAI value of estimated remaining collateral at the time of liquidation Yes, in the ETH value of estimated remaining collateral at the time of liquidation    Current options seem pretty binary. No compensation or 100% compensation. There is no say 50% option. Might not even need to specify 50%. You could probably word it something like: “Compensate less than 100% of the estimated remaining collateral value at time of liquidation”. If that option were to win you could do further polls to figure out what the correct percentage should be. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.177083333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#8",
                    "likes": "1",
                    "time": "27/03/2020-17:02:07",
                    "content": "    Andy_McCall:  There was pretty significant support for lower compensation on the original polls. Something like 56% of people showed some support for the < “high compensation” options. Should there be an option that captures compensation should be < “estimated remaining collateral at the time of liquidation” Current options seem pretty binary. No compensation or 100% compensation. There is no say 50% option.   My impression is that most people just wanted an accurate estimate of compensation. However, I might have misjudged sentiment. In any case, I don’t think we can ask both questions in the same poll. I’ll adjust the wording and     Andy_McCall:  Might not even need to specify 50%. You could probably word it something like: “Compensate less than 100% of the estimated remaining collateral value at time of liquidation”. If that option were to win you could do further polls to figure out what the correct percentage should be.   I think it would have to be a separate poll since we don’t have rank-choice voting yet. We can’t present too many options per poll. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.262820512820513
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#9",
                    "likes": "4",
                    "time": "27/03/2020-19:00:28",
                    "content": "I think it would be wrong to compensate vaults liquidated at 0 unless we also compensate vaults liquidated at less than 70-80% market price, as the impact on vault holders is the same. And we shouldn’t compensate any of the above vaults without also compensating vault holders that paid back debt or deposited additional collateral on Black Friday to avoid liquidation. If we’re going to do this, we should be consistent, and not have tunnel vision about only looking at 0 DAI liquidations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.635416666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#10",
                    "likes": "1",
                    "time": "27/03/2020-19:09:59",
                    "content": "    monet-supply:  If we’re going to do this, we should be consistent, and not have tunnel vision about only looking at 0 DAI liquidations.   Agreed. I have added language to the draft in response to your comment. Does it look okay? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/HeyChristopher",
                    "index": "#11",
                    "likes": "4",
                    "time": "27/03/2020-21:57:35",
                    "content": "    psychonaut:  The protocol performed in a sub-optimal manner. Users (i.e. vault holders) were injured. It is in the interest of Maker holders to try to make their users happy. The purpose of the MKR token is to insure against precisely this kind of failure.   No it is not. MKR token is here to heal system debt, vaults that got liquidated above the liquidation threshold did not cause system debt and should not be covered by MKR token holders. At least that was my understanding when coming on board (read: purchased MKR). Where would it stop then? Will MKR holders then become insurance providers for all sorts of Maker related incidents? Why is no one, I repeat, not one person, arguing that, if the community decides for some kind of compensation scenario, that the Maker Foundation pays that? Multiple projects have set precedents for similar incidents and the Maker Foundation is sitting on a treasure chest of money - why is this such a taboo to talk about? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8106060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Vault2288",
                    "index": "#12",
                    "likes": "1",
                    "time": "28/03/2020-05:31:43",
                    "content": "Absolutely. I can vouch for this as somebody who was forced to close my vault in a panic to avoid 0 liquidation and salvage what I was able to. I believe if compensation is offered to those who were liquidated to 0 - those like me should be compensated in equal proportion so that the difference for all effected is made up fairly and evenly. See below for details:   gist.github.com   https://gist.github.com/OperationNine/cdae6635f14e89b16ae0632366d48770 Vault 2288 damage report as a result of 0 bid exploit.md Firstly - thank you for acknowleding my post.  Here is the link to my CDP Vault 2288:  https://defiexplore.com/cdp/2288  After seeing the 0 bid liquidations I realised I had to exit my CDP as the system was under failure.  The long story short is this. The events of the 0 bid liquidations caused me to have to ACT fast in order to avoid being liquidated to 0. I was even told in MakerDAO chat on the day as it was happening. \"Do not get liquidated.\"   This file has been truncated. show original        Again I say this because if say Vault#XXXX gets back what they should have under a set of liquidation parameters - Example: Work out the ETH-USD price that is used to compensate vaults in a certain time period. eg)  100 USD for 1 ETH + 13 % penalty 90 USD for 1 ETH + 13% penalty 80 … etc  Then those same liquidation parameters should be in fairness applied to those also effected so that everyone gets the same level of outcome. ",
                    "links": [
                        "https://gist.github.com/OperationNine/cdae6635f14e89b16ae0632366d48770",
                        "https://gist.github.com/OperationNine/cdae6635f14e89b16ae0632366d48770"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.590873015873016
                },
                {
                    "author_link": "https://forum.makerdao.com/u/neece",
                    "index": "#13",
                    "likes": "7",
                    "time": "28/03/2020-06:48:27",
                    "content": "Non  of these points are valid.     psychonaut:  This is crypto, all the information as to how the liquidations took place is available on-chain in the form of smart-contract code, due to this, you had the opportunity to be fully informed as to how it works, the fact that you were not is your mistake, not ours.   Maker is not an “experimental crypto project” targeting programmers, its trying to get mainstream adoption.     psychonaut:  The keeper bot code is open-source, as is the contract code. You were able to learn how to run a keeper in order to liquidate your own vault at a favourable rate. The fact that you didn’t is your mistake, not ours.   Maker was not expecting users to run keeper bots, no where on any page is it explained when taking out a cdp. If you were expecting why its it mentioned on Oasis when taking out a cdp?     psychonaut:  You were liquidated, and directly caused the Maker Protocol to lose money because you failed to keep a safe-enough collateralization ratio. This is intrinsically negative (hence why there is a liquidation penalty). When you opened a Vault you ‘agreed’ to keep it collateralized. You broke that agreement, so why should we compensate you?   My ratio was always in green or orange. I did agree to keep it collateralised and maker agreed to take my eth plus 13% to pay back my loan not all my eth.     psychonaut:  It’s your responsibility to understand the tools you use, the fact that you did not understand that 13% was the penalty after liquidation (which can return less than 150%) is your mistake, not ours.   No one is complaining about the 13%.    Compensating vault holders that liquidated at 0 bid?!   In the case of high network utilisation, users just need to set a higher gas price to get transactions through promptly, the responsibility for knowing how to use ethereum during times of high network congestion is also on you.   No one is complaining about this.    Compensating vault holders that liquidated at 0 bid?!   By compensating Vault users now, we set a precedent where we will compensate vault users in the future, this could undermine the game theoretical mechanisms underpinning the protocol.   Yes, it will force Maker not to make such mistakes in the future and take some responsibility in the way you market your products going forward. Again, as i said before the question should be how to compensate not if. Non of these points are valid or fair. ",
                    "links": [
                        "https://forum.makerdao.com/t/compensating-vault-holders-that-liquidated-at-0-bid/1541/76"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.309649122807017
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#14",
                    "likes": "2",
                    "time": "28/03/2020-16:23:56",
                    "content": "This is straying a little bit from the point of the thread. I’d love to hear people’s thoughts on proposed verbiage for on chain poll. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#15",
                    "likes": "2",
                    "time": "28/03/2020-16:57:38",
                    "content": "Personally I want to see at least 0, 50, 100% payment for exposure (maybe 0, 25, 50, 75, 100 are better valid options.    As I have made clear it has always been my own personal policy to ‘split the difference’ between what people thought they should get and what I thought they should get when there was an argument/discrepancy. One other point I am not sure if relevant.  Acceptance of the offer meant they simultaneously signed off on any litigation and negative PR.   The negative PR we can’t control but the litigation we can.   Simply because any litigation would have to involve the wallet ID and proof of ownership.  IF they accepted the payout - they accepted the terms that went along with it.  If they return the payout they don’t accept the payout nor the terms and can do whatever they want. The whole problem with this vote is that until we have real numbers to work off of we don’t know what the percents means other than 0 (no compensation). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#16",
                    "likes": "1",
                    "time": "28/03/2020-21:05:04",
                    "content": "    MakerMan:  Personally I want to see at least 0, 50, 100% payment for exposure (maybe 0, 25, 50, 75, 100 are better valid options. As I have made clear it has always been my own personal policy to ‘split the difference’ between what people thought they should get and what I thought they should get when there was an argument/discrepancy.   Others have already asked for this, but it would need to be a second poll.     MakerMan:  Acceptance of the offer meant they simultaneously signed off on any litigation and negative PR. The negative PR we can’t control but the litigation we can. Simply because any litigation would have to involve the wallet ID and proof of ownership. IF they accepted the payout - they accepted the terms that went along with it. If they return the payout they don’t accept the payout nor the terms and can do whatever they want.   I like your idea, but I’m not sure how to it could be made legally binding. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.104166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#17",
                    "likes": "1",
                    "time": "29/03/2020-11:42:01",
                    "content": "    MakerMan:  Acceptance of the offer meant they simultaneously signed off on any litigation   Please take a look at the paragraph I added at the end of the poll draft. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#18",
                    "likes": "1",
                    "time": "29/03/2020-16:56:31",
                    "content": "    MakerMan:  The whole problem with this vote is that until we have real numbers to work off of we don’t know what the percents means other than 0 (no compensation).   This is the most important point, no one in Maker is able to reasonably make a decision on this issue without the numbers being completely worked out… which is complex for the reason everyone have pointed to,people paying back debt, non quite zero bids, the market volatility itself, the state of ethereum (if this was a mempool attack what will that mean, should EF compensate…?), ect… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.619318181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#19",
                    "likes": "2",
                    "time": "29/03/2020-17:15:33",
                    "content": "Its not about the risk of leverage being disclosed or not. Its that Maker markets the product, its a completely novel system that we don’t know the behavior of and hasn’t even been stress tested like SCD. Acting like we were ready to reinvent finance as soon as MCD launched is an absurd perspective in context of the systems immaturity. We need to make it clear that EVERYONE could lose EVERYTHING at anytime (including mkr holders) (this is possible in multiple ways, successful governance, oracle attack, mixture of other complicating events, failed ES ect ect). Telling people anything else is a straight up lie. That reality isn’t restricted just to Maker, but crypto in general (and the whole universe for that matter… nothing is guaranteed). The point of scientific governance is to understand the complexities, design things to mitigate the risks involved with those complexities, and to be able to properly explain how we came to those designs, so other knowledgeable people can judge, and critique them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.265625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#20",
                    "likes": "0",
                    "time": "31/03/2020-12:35:17",
                    "content": "Detailed P&L analysis, https://ournetwork.substack.com/p/our-network-issue-14 How much is potentially owed to vault holders? My impression was that it was 1-3 million DAI, but these numbers seem much higher. Do I understand correctly?  Screenshot from 2020-03-31 08-50-401461×426 85.6 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.083333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#21",
                    "likes": "1",
                    "time": "31/03/2020-15:02:02",
                    "content": "Hey. Those Vault losses I presented are not truly representative for compensation purposes. Vault loss that I calculated also includes a penalty fee and ETH price decrease during auction time for particular vault. For compensation calcs, you need to exclude those two effects plus of course assume how high bids would be during that time. Finding a decent benchmark to compare to is going to involve a lot of bias though, because we haven’t had such high liquidation volume event in the past, accompanied by lowest DAI liquidity and highest ETH volatility seen during Maker existence. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.336111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#22",
                    "likes": "0",
                    "time": "31/03/2020-23:51:50",
                    "content": "    psychonaut:  Detailed P&L analysis, https://ournetwork.substack.com/p/our-network-issue-14  How much is potentially owed to vault holders? My impression was that it was 1-3 million DAI, but these numbers seem much higher. Do I understand correctly?   Is having an estimate for the impact a blocker for the purposes of this on-chain poll? Can accurately quantifying the impact be punted for purposes of this poll? It seems that if we could just drop the estimate in the draft, or just link to a few sources for estimates if we deem that necessary. There is already some language in here about doing further analysis maybe we can sort this out then. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.607142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#23",
                    "likes": "0",
                    "time": "01/04/2020-00:43:33",
                    "content": "    Andy_McCall:  Is having an estimate for the impact a blocker for the purposes of this on-chain poll?   No, I don’t think so unless somebody volunteers to do the work. It would be nice if we had a tighter upper bound though. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#25",
                    "likes": "3",
                    "time": "01/04/2020-05:45:35",
                    "content": "A couple of notes about this section:     psychonaut:  Arguments against compensation:  This is crypto, all the information as to how the liquidations took place is available on-chain in the form of smart-contract code, due to this, you had the opportunity to be fully informed as to how it works, the fact that you were not is your mistake, not ours. The keeper bot code is open-source, as is the contract code. You were able to learn how to run a keeper in order to liquidate your own vault at a favourable rate. The fact that you didn’t is your mistake, not ours. You were liquidated, and directly caused the Maker Protocol to lose money because you failed to keep a safe-enough collateralization ratio. This is intrinsically negative (hence why there is a liquidation penalty). When you opened a Vault you ‘agreed’ to keep it collateralized. You broke that agreement, so why should we compensate you? It’s your responsibility to understand the tools you use, the fact that you did not understand that 13% was the penalty after liquidation (which can return less than 150%) is your mistake, not ours. In the case of high network utilisation, users just need to set a higher gas price to get transactions through promptly, the responsibility for knowing how to use ethereum during times of high network congestion is also on you. By compensating Vault users now, we set a precedent where we will compensate vault users in the future, this could undermine the game theoretical mechanisms underpinning the protocol.    My number one piece of feedback is that the overall tone is a bit combative. It might be better to use language with a little less implied bias. Most important thing I would suggest would be to avoid us vs them language wherever possible. Just looking at this point:     psychonaut:  You were liquidated, and directly caused the Maker Protocol to lose money because you failed to keep a safe-enough collateralization ratio. This is intrinsically negative (hence why there is a liquidation penalty). When you opened a Vault you ‘agreed’ to keep it collateralized. You broke that agreement, so why should we compensate you?   I think you could probably reword that as something to the effect of: “Vaults were liquidated because they failed to meet the collateralization requirements of the protocol. By opening a vault users implicitly agreed to maintain an adequate collateralization ratio.” I think that gets the point across without all the finger pointing. There are several points in the “arguments against” section about not adequately understanding the risk of the system. Not sure they need to be called out separately. See:     psychonaut:  It’s your responsibility to understand the tools you use, the fact that you did not understand that 13% was the penalty after liquidation (which can return less than 150%) is your mistake, not ours.       psychonaut:  This is crypto, all the information as to how the liquidations took place is available on-chain in the form of smart-contract code, due to this, you had the opportunity to be fully informed as to how it works, the fact that you were not is your mistake, not ours.       psychonaut:  In the case of high network utilisation, users just need to set a higher gas price to get transactions through promptly, the responsibility for knowing how to use ethereum during times of high network congestion is also on you.   I think all of those arguments ultimately distill down to vault users are expected to understand the ethereum ecosystem. You could probably say something like: “Vault users are expected to understand the ethereum ecosystem and accept the liabilities associated with using that system. All contract code is open sourced and available to be audited. As such, by using the protocol it is understood that the users are adequately informed and accept the risk of their actions.” Also:     psychonaut:  The estimate shall be backed up by a written report and Monte Carlo simulation.   For this idk that we need to be that explicit. If and when analysis is done we can figure out some way to ratify it’s findings ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.17406330749354
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#26",
                    "likes": "1",
                    "time": "01/04/2020-07:11:59",
                    "content": "    psychonaut:  How much is potentially owed to vault holders? My impression was that it was 1-3 million DAI, but these numbers seem much higher. Do I understand correctly?   Primož’s numbers assume keepers paying near oracle prices which is unreasonable during market crash (he was not calculating compensation numbers, just profits/loses by ecosystem actors AFTER the event) At one point price went from 170$ to 140$ in less than an hour.  Rational keepers would bid very conservatively in such environment. They would need to sell eth very quickly (pay high gas fees, find best market etc…). All this would need to be coded in advance (detection of market crash, strategy during market crash, etc…). It’s the nature of eth collateral not having some ‘fundamental value’ that complicates things for keepers. If i would code my keeper, i would immediately shutdown (or go to special mode) in such conditions, send notifications (possibly to wake me up).  It is huge risk/reward situation for keepers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.051465201465201
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#27",
                    "likes": "0",
                    "time": "01/04/2020-20:16:39",
                    "content": "@Andy_McCall I have mostly adopted your suggestions. Please review the latest draft. Thank you! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#28",
                    "likes": "0",
                    "time": "01/04/2020-22:03:08",
                    "content": "@rich.brown I think we’re ready. Can you add this to the next set of polls? Thanks! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/energyone",
                    "index": "#29",
                    "likes": "0",
                    "time": "02/04/2020-00:07:55",
                    "content": "At the risk of being shamed for chiming in here, I lost 88 ETH during black Thursday - even though I spent most of the day trying to add collateral. I knew the risks and was watching the CDP carefully. The system failed, leaving my ETH deposits in a “pending” status for hours. The contract was liquidated and the problem I now face is that I can’t even withdraw the remaining 11ETH that shows as “available” in my vault and I don’t know who to contact for help resolving the issue. I use a Nano X and when I try to withdraw the ETH, the Nano shows a value of “0” and the withdrawal cancels. Any assistance would be appreciated. - Thank you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.861111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#30",
                    "likes": "0",
                    "time": "02/04/2020-01:51:43",
                    "content": "    energyone:  The contract was liquidated and the problem I now face is that I can’t even withdraw the remaining 11ETH that shows as “available” in my vault and I don’t know who to contact for help resolving the issue.   I’m sorry to hear about your experience. Try the #help channel at https://chat.makerdao.com/ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#31",
                    "likes": "1",
                    "time": "02/04/2020-04:11:18",
                    "content": "I’m trying to standardize the way these polls make it into the portal that doesn’t require any editorializing or interpretations from me. Can you use this as a template and replace everything with your content from the OP? Should probably add this step to the Signalling Guideline doc… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#32",
                    "likes": "0",
                    "time": "02/04/2020-10:43:56",
                    "content": "    rich.brown:  Can you use this  as a template and replace everything with your content from the OP?   @rich.brown Like this? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#33",
                    "likes": "0",
                    "time": "02/04/2020-14:57:25",
                    "content": "@Joshua_Pritikin Do you use github? Might be better to post this as a gist or to use that tool rich linked to edit the markdown. It looks like with hackmd you can maybe collaborate on the markdown so that might be preferable. I started on a markdown document for you here. You might want to review that document though it is a pretty quick copy pasta job. ",
                    "links": [
                        "https://hackmd.io/Ji0CzQttQZOKsbB82_wHog?both",
                        "https://hackmd.io/T0-pu614QgSNIrj8nbgV5Q?both"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.822916666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#34",
                    "likes": "0",
                    "time": "02/04/2020-15:05:47",
                    "content": "Might want to update the next steps to explicitly say that an estimate will be put together if the poll is approved. Currently it just mentions adjusting the estimate to compensate the analyist If this poll is decided as \"Yes\" then the cost of compensation should be increased to include a requisition (2000 DAI, approx. a week of analyst time) to produce an accurate estimate of the compensation amount for each affected vault. All vaults affected by suboptimal Maker/Ethereum performance are eligible for consideration, whether collateral was liquidated at zero or at some other level. Liquidated vaults that paid back debt or deposited additional collateral are also eligible. The estimate shall include sufficient documentation to facilitate replication.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.2749999999999995
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#35",
                    "likes": "0",
                    "time": "02/04/2020-15:07:50",
                    "content": "    Andy_McCall:  I started on a markdown document for you here . You might want to review that document though it is a pretty quick copy pasta job.   Hm, I’ve been edited the OP of this thread. You seemed to copy and older version so I replaced the hackmd doc with the text from my OP. I use GitHub all the time, but do we really need all that formality? Aren’t we done tweaking?     Andy_McCall:  Might want to update the next steps to explicitly say that an estimate will be put together if the poll is approved.   That’s a good idea. I guess the HackMD doc is where we’ll continue to refine. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#36",
                    "likes": "1",
                    "time": "02/04/2020-15:23:55",
                    "content": "    psychonaut:  I use GitHub all the time, but do we really need all that formality? Aren’t we done tweaking?   HackMD is probably fine. I’m assuming that @rich.brown probably just wants some markdown source that he can quickly copy and paste, so I was just trying to suggest some tools to make that easy. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#37",
                    "likes": "1",
                    "time": "02/04/2020-15:30:44",
                    "content": "Last comment from me I think. In the additional resources section. You might want to consider adding links to these two threads since this topic was also covered in there.  Signal Thread: Do we compensate vault holders that were completely liquidated? Compensating vault holders that liquidated at 0 bid?!  ",
                    "links": [
                        "https://forum.makerdao.com/t/compensating-vault-holders-that-liquidated-at-0-bid/1541"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#38",
                    "likes": "0",
                    "time": "02/04/2020-15:38:43",
                    "content": "    Andy_McCall:  In the additional resources section. You might want to consider adding links to these two threads since this topic was also covered in there.   Yeah, good idea. Added. ",
                    "links": [
                        "https://forum.makerdao.com/t/compensating-vault-holders-that-liquidated-at-0-bid/1541/100"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#39",
                    "likes": "1",
                    "time": "03/04/2020-16:41:27",
                    "content": "@MakerMan could we please have someone drafting the poll who is not so obviously against compensation? Many of the valid points “for compensation” are not being included from the other threads. If this is about fairness & governance in the interest of Maker surely we can’t have the guy drafting the poll be someone that says “…it’s not our fault if people are dumb”?! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#40",
                    "likes": "1",
                    "time": "03/04/2020-16:44:46",
                    "content": "    Sandhaai:  could we please have someone drafting the poll who is not so obviously against compensation?   What? I am actually in favor of compensation.     Sandhaai:  Many of the valid points “for compensation” are not being included from the other threads.   I think the case for compensation is already strong enough. What specific points do you have in mind?     Sandhaai:  we can’t have the guy drafting the poll be someone that says “…it’s not our fault if people are dumb”?!   I’ve done leveraged trading before and lost a lot of money. I’ve been in your shoes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.5773809523809526
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#41",
                    "likes": "3",
                    "time": "03/04/2020-16:53:43",
                    "content": "    Sandhaai:  could we please have someone drafting the poll who is not so obviously against compensation?   You guys should not be complaining at people that are working to get this issue resolved.     Sandhaai:  If this is about fairness & governance in the interest of Maker surely we can’t have the guy drafting the poll be someone that says “…it’s not our fault if people are dumb”?!   And for the record, I was the one who originally wrote those arguments against compensation acting as devils advocate because people were claiming that there were no arguments against compensation. Since then, my position has actually evolved somewhat in that I feel we should compensate zero-bids up to the best-guess of what those auctions would have reached if keepers had had the liquidity they had for some of the other auctions. Given that most of the other auctions also closed at maybe 70% of the collateral value, that doesn’t actually amount to much. Something that I think is essential to recognise is that Maker Governance is not responsible for creating UI or enforcing which UI’s can be used to interact with the protocol, and as such, we are not responsible for what any given UI does or does not say about liquidations. This whole ‘I expected 13% thing’ isn’t on governance, it’s on the makers of those UIs (if it’s on anyone, which arguably it isn’t.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.367647058823529
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#42",
                    "likes": "1",
                    "time": "03/04/2020-17:04:56",
                    "content": "Also @psychonaut , I feel like this poll could be better expressed multiple polls as below (not suggesting that we use these as final wording but you get the gist of what I’m going for.) Poll 1: Should we compensate Vault Holders to any degree (the specifics of which to be determined later)? Yes No Poll 2: Should any compensation be denominated in Dai or the collateral asset that was liquidated? Dai Collateral Asset in question Then, later, we can create a third poll to determine the amount to be compensated, and which assumptions we are using to generate that amount. Something along the lines of: Poll 3: What assumptions should be use to determine Vault Holder compensation amount? Market Price at Liquidation Market Price at Liquidation - x% Oracle Price at Liquidation Oracle Price at Liquidation - x% Successful Auction average price Successful Auction average price -x% …any others I haven’t considered, maybe flat rate given debt, I dunno. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.761363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#43",
                    "likes": "1",
                    "time": "03/04/2020-17:36:42",
                    "content": "    LongForWisdom:  I feel like this poll could be better expressed multiple polls   Hm, too bad we don’t have rank choice voting yet. I agree with your assessment. The HackMD draft is updated accordingly. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#44",
                    "likes": "2",
                    "time": "03/04/2020-18:06:52",
                    "content": "    LongForWisdom:  You guys should not be complaining at people that are working to get this issue resolved   Point taken. Apologies @psychonaut  for my tone - I’m probably too invested in this issue to be objective. I will try to limit my contribution to where I think I can add value and that is as an average (crypto-capable) user.     psychonaut:  I’ve done leveraged trading before and lost a lot of money. I’ve been in your shoes.   I appreciate that, and yes these shoes suck, but the issue at hand is not about the effect of leveraged trading. I think all concerned respect the risks taken and losses suffered due to leveraging.     psychonaut:  I think the case for compensation is already strong enough. What specific points do you have in mind?   For me, and from what I read on the other discussions, it misses out on the core question: Who are your users? Who do you want them to be? Two options > A: Users are very technically capable understanding the mechanics of Ethereum/auditing code and such. Well then you really need to limit your activities to a very small group of users and state clearly on all communication that this is a specialist product for coders. As a user I can honestly say I really did not get this impression from interacting with the ecosystem. B: The aim is mass adoption. Users are crypto-savvy probably, but you don’t expect them to be able to audit code. In this scenario you “as Maker” need to take on a lot of the non-obvious risk that’s in the system and compensate users for those. You can’t take the luxury of hiding behind the small print and open-source code. If you want the benefit of mass-adoption (Maker price going up etc) you need to also take on the down-side of this option. You can’t have both. You can’t be ethical, give your users a fair shake and have the benefits of both - then you’re just another ICO-type project if you get what I mean. These new systems need a degree of ethics to succeed. The thousands of ICO projects of 2017 can also say “you should have known the risks” and they’re right - if you invested in them you were an idiot and deserve to be burnt, but isn’t what you’re trying to do different from that? Do you want to tell your users that if they get burnt by your platform they’re stupid and they should have known the risks? There’s something wrong about not protecting users and hiding behind technicalities or a collective. If I were in your shoes I’d want to avoid that perception.You want to be decentralised, but be in the pioneering boat with your users because they are taking enough platform risk anyway and if this thing works out you both will do well. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.887127009894867
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#45",
                    "likes": "0",
                    "time": "03/04/2020-18:13:51",
                    "content": "    Sandhaai:  Who are your users? Who do you want them to be?   The point you raise seems impossible to answer in a dichotomous way. I’ll take some of both, but it’s hard to articulate exactly where the middle is. Hence, I’m not sure how to improve the poll draft language based on your suggestion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.041666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#46",
                    "likes": "1",
                    "time": "04/04/2020-01:07:04",
                    "content": "Let’s try to avoid ninja edits to original posts if we can. Makes it pretty hard to come in after the dust settles and review how the discussion evolved. Some of the comments in this thread don’t make sense without that context. Later: Particularly if the poll itself is going to be directing people to this thread for context. Now the OP is a link back to the poll that links to this thread… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#47",
                    "likes": "0",
                    "time": "04/04/2020-01:39:11",
                    "content": "Markdown in the final formatted template is fine but the end result of these proposal threads should ideally include a roll-up of current thinking, with a summary, and a link to a PR for the poll itself. Sam has an example here. All the past polls are stored in github to act as a historical record and are also used by the portal to generate the actual polling page. It also removes the possibility that a Governance Facilitator has to make last minute edits or tweaks to the text that might inadvertently alter the intent of the poll. ",
                    "links": [
                        "https://github.com/makerdao/community/tree/master/governance/polls"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#48",
                    "likes": "4",
                    "time": "04/04/2020-02:09:45",
                    "content": "I’ve made a number of edits to the markdown for clarity and syntax, please review the changelog to see them and feel free to revert if needed. Beyond the edits though, I have some questions here. Mostly related to various “ok, but how?”   “Another on-chain poll will be held to decide whether the compensation (amount to be determined) will be denominated in Dai or the collateral asset that was liquidated.”  Who will handle this conversion? I.e. where will the Dai/ETH/BAT come from? Who will custody it?    “To analyze the data, approx 2000 DAI (a week of analyst time) shall be requisioned.”  How was this number arrived at? Where will these funds come from?    “Vault holder compensation will be paid for with additional flop auctions. Once money is available, the assets will be put into a contract that vault holders can withdraw from.”  Where is this contract coming from? Who will own it? Will it be audited?    “To withdraw, vault holders will need to browse to a web page…”  Who will make and host this page?    “…where they agree to indemnify Maker and affiliates against any potential legal claims for their loss.”  What team has validated the legalities of an indemnity clause? For what jurisdictions could it be valid?    “The assets will be available for vault holders to claim for 30 days.”  Why 30 days?    There is a significant amount of mildly hand-wavy solutions baked into in this poll which will require numerous stakeholders to align on; both inside and outside the Foundation. I’m not convinced that it’s possible to guess at the actual on-chain implementation right now… Ultimately isn’t this poll only intended to determine if the intention to compensate is shared? Is there any utility in guessing at the mechanisms ahead of time? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8806022408963585
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Andy_McCall",
                    "index": "#49",
                    "likes": "2",
                    "time": "04/04/2020-03:05:25",
                    "content": "Rich brings up some good points here. maybe we should just limit this poll to say should we compensate users at some undetermined haircut number X and then pending a passing result we can go from there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#50",
                    "likes": "1",
                    "time": "04/04/2020-10:32:37",
                    "content": "    rich.brown:  Is there any utility in guessing at the mechanisms ahead of time?   Yeah, I think there is utility so people have a sense of what the process will be. We can certainly better acknowledge that the next steps are hand-wavy and subject to refinement.     rich.brown:  All the past polls are stored in github to act as a historical record and are also used by the portal to generate the actual polling page.   Oh, OK. I had no idea about the process. See https://github.com/makerdao/community/pull/493 ",
                    "links": [
                        "https://github.com/makerdao/community/pull/493"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#51",
                    "likes": "5",
                    "time": "05/04/2020-12:13:06",
                    "content": "I would suggest adding something like the following to the arguments for compensation: “No compensation may represent a distortion of symmetry and reciprocity i.e. the impression that we’re marketing the product and receiving the reward for growth of the platform, but leaving ecosystem/development risk entirely to the user. This could negatively impact reputation and future mass adoption.” I’ll leave it to you to edit that statement if needed and consider the spirit of the argument as a whole in the poll since I’m not that confident in my wording. Just fyi this passage in N. Taleb’s book “Skin in the game” summarizes the principle involved better than I can: \"Second, it is about the distortions of symmetry and reciprocity in life: If you have the rewards, you must also get some of the risks, not let others pay the price of your mistakes. If you inflict risk on others, and they are harmed, you need to pay some price for it. Just as you should treat others in the way you’d like to be treated,  you  would  like  to  share  the  responsibility  for  events without unfairness and inequity. If you give an opinion, and someone follows it, you are morally obligated to be, yourself, exposed to its consequences. In case you are giving economic views: Don’t tell me what you “think,” just tell me what’s in your portfolio\" If we steer off course on this principle how is defi going to be different than the bankers who took big bonuses while their clients suffered losses in 2008? They didn’t go to jail - they were legally/technically justified. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#52",
                    "likes": "1",
                    "time": "05/04/2020-13:04:48",
                    "content": "    Sandhaai:  I’ll leave it to you to edit that statement if needed and consider the spirit of the argument as a whole in the poll since I’m not that confident in my wording.   I like your suggestion. I used your wording to replace mine: “Set the precedent that vault holders will be treated fairly, encouraging DAI creation.” PR is updated. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianmcli",
                    "index": "#53",
                    "likes": "2",
                    "time": "05/04/2020-22:17:03",
                    "content": "There is still a lack of participation from the community in this thread. I think the draft of this poll should be seen by more than the handful of people in this thread. Any ideas on how we can solicit more people from the community to comment on this draft? I just want this to be as fair as possible. Because this could really REALLY blow up and screw with community confidence in Maker if this “slips by” and gets voted down. I can already predict the huge uproar on social media. I also agree that the discussion should take place on Github, not everyone has an account on this forum. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.361111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ta32",
                    "index": "#54",
                    "likes": "0",
                    "time": "05/04/2020-22:59:00",
                    "content": "look over the black thursday event and find all the non-zero vault liquidations, find the minimum ETH-USD price used to liquidate all vaults ( but not zero ) then use this rate to compensate everyone. CDP holders should not feel entitled to the ‘market’ rate in a flash crash where there was liquidity issues. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ta32",
                    "index": "#55",
                    "likes": "0",
                    "time": "05/04/2020-23:03:02",
                    "content": "    LongForWisdom:  I does or does not say about liquidations. This whole ‘I expected 13% thing’ isn’t on governance, it’s on the   how can we even define the ‘market price’ during a flash crash, it’s unfair to use the exchange rate at centralized exchanges which would perform more optimally even under normal conditions.  I think we should look at non-zero liquidations under the even find the medium and the minium ( non zero price ) - over the event. Then use that as a guideline for compensation.  This would mean we would have to compensate vaults that got liquidated below that price ( so we should reduce the liquidation price to minimize this ) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.947916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#56",
                    "likes": "1",
                    "time": "06/04/2020-01:13:08",
                    "content": "The only reason that I would favor compensation in this situation is because I don’t think that the risks of opening a CDP are adequately explained on the Oasis.app page and others.  For example, I think that an asterisk should be place on the liquidation penalty text saying e.g. “because the collateral is sold in an auction if it is liquidated, it is not possible to predict exactly how much ETH you will receive back in the case of a liquidation.  Typically, you will receive back about 24% of the ETH you have deposited in case of liquidation.  However, in some cases, you may receive zero ETH back depending on market conditions at the time of the auction”. Does this need to be covered in another poll (i.e. Should stronger warnings about the risks of collateral loss be placed on Oasis?) Or can we include this here as one of the action items.  Thanks ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#57",
                    "likes": "1",
                    "time": "06/04/2020-01:55:13",
                    "content": "Another poll would be my suggestion if it’s needed but just as an FYI, you can also just start a thread and start brainstorming with Oasis, they are real humans and are interested in community feedback. Or chat with them in the #oasis channel. I’m getting a little concerned that we can get trigger happy with polling. Maybe start a conversation, toss around ideas then think about a poll? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.328125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#58",
                    "likes": "0",
                    "time": "06/04/2020-01:57:41",
                    "content": "I don’t think there is a measurably larger demographic on github than could be addressed here. Although I am happy to be convinced otherwise. What are your suggestions for gathering additional visibility for the thread? You’ll have to talk to @psychonaut ASAP about a delay though as this is scheduled to go live in 12 hours or so. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.5606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianmcli",
                    "index": "#60",
                    "likes": "2",
                    "time": "06/04/2020-02:32:51",
                    "content": "An official blog post, tweet, and/or Reddit post coming from Maker would go a long long way. Forgive me as this will come across as harsh but I feel Maker’s community outreach efforts have been quite disappointing. Not all who participate in the MakerDAO ecosystem is on these forums (nor should we expect them to be). But they are all likely individuals who care about Ethereum and the DeFi space in general. So perhaps having more presence in those respective subreddits could be a lot better as well. Not to mention more participation in EIP discussions, EthDev tooling, etc. I have a lot more to say about Maker being “out of touch” with the community, but I’ll leave that for another discussion. I say these as points of constructive criticism only. I do not want to hurt anyone’s feeling, I do not want to see Maker go down this road, I wish for the project to succeed. We just need the right actions to be taken. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.457199546485261
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#61",
                    "likes": "2",
                    "time": "06/04/2020-02:51:24",
                    "content": "    adrianmcli:  An official blog post, tweet, and/or Reddit post coming from Maker would go a long long way.   This is a community led initiative. Feels like a fairly significant imposition for the foundation to make official statements on behalf of the people here who are governing the system and debating the issue in real-time. Having said that though, a thread related to the issue was included in a section of the recap post on April 1     adrianmcli:  Forgive me as this will come across as harsh but I feel Maker’s community outreach efforts have been quite disappointing.   Possibly. But you are the Maker community. Pointing out how other people have failed to meet your expectations without engaging with those people directly to problem solve seems counter productive to me.     adrianmcli:  Not all who participate in the MakerDAO ecosystem is on these forums (nor should we expect them to be). But they are all likely individuals who care about Ethereum and the DeFi space in general. So perhaps having more presence in those respective subreddits could be a lot better as well. Not to mention more participation in EIP discussions, EthDev tooling, etc.   Well, I disagree with you there. If someone in the community wishes to engage with the protocol and help change it, this forum is exactly where they should be. For general broadcasting and debate though: there are videos, podcasts, forum threads, reddit posts, tweets, weekly, sometimes daily, calls, blog posts, chat rooms, telegrams, etc, that have been exploring this very issue non-stop for weeks now. I’m struggling to imagine what other avenues are left.     adrianmcli:  I have a lot more to say about Maker being “out of touch” with the community, but I’ll leave that for another discussion. I say these as points of constructive criticism only. I do not want to hurt anyone’s feeling, I do not want to see Maker go down this road, I wish for the project to succeed. We just need the right actions to be taken.   It will be an interesting discussion because can’t think of an org that has deeper ties into the entire ecosystem than we do. Either way, there is no shortage of work to be done to improve things. It sounds like you would be a good addition to a new team that has organized to address these specific issues: Community Driven Governance Messaging - Project Plan (placeholder name). I’m sure they would love to have your input. ",
                    "links": [
                        "https://forum.makerdao.com/t/community-driven-governance-messaging-project-plan-placeholder-name/1875"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.6237532891944655
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#62",
                    "likes": "1",
                    "time": "06/04/2020-16:14:42",
                    "content": "This poll is now in the portal: https://vote.makerdao.com/polling-proposal/qmwfvvguaf8rz8xwgv2cqnzzt9t5h6epzh17qmk2ue99y4 If you have a vested interest in this issue it would be a good idea to broadcast this in your personal channels to increase awareness as @adrianmcli has pointed out. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#63",
                    "likes": "1",
                    "time": "07/04/2020-13:42:30",
                    "content": "It’s a bit early, but the poll appears likely to pass. Hence, I have prepared the next poll, https://github.com/makerdao/community/pull/496 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.166666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/juan",
                    "index": "#64",
                    "likes": "4",
                    "time": "07/04/2020-19:04:58",
                    "content": "Hey, not sure who’s the person deciding this, but I saw in the community call that we might need an analyst to calculate different scenarios and impact regarding compensation for the 0-ETH bids (On-chain vault compensation poll, draft). I’m quite interested in helping with this. It looks fun. Let me know. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party offering to collaborate on proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amosrendao",
                    "index": "#65",
                    "likes": "2",
                    "time": "08/04/2020-21:23:18",
                    "content": "I don’t know that it was the “risks of leverage” that was the issue for most. What I’ve mostly read is that people educated themselves using what materials MakerDAO presented and so they believed that there was a 13% liquidation fee and not a chance of losing 100% of remaining collateral. The only argument I’ve seen against this is that they should have examined the available code, but for so many that are not savvy in this area, that wasn’t an option. If MakerDAO community wants to appeal to a larger audience / mass adoption, then we need to have the risks of losing 100% of your collateral put up front, clear to read for all. And we need to compensate vault owners who suffered this to show the fairness of this community moving forward. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#66",
                    "likes": "0",
                    "time": "08/04/2020-22:46:33",
                    "content": "    amosrendao:  If MakerDAO community wants to appeal to a larger audience / mass adoption, then we need to have the risks of losing 100% of your collateral put up front, clear to read for all.   It’s really difficult for us to ensure that this is the case because we don’t control the UIs that can be used to interact with the platform. Now I’m definitely not saying that we can’t make the educational materials more prominent on the various documentation sites that we do control, but there is always going to be a risk that users interact with the system without having a sufficient understanding of how it works. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#67",
                    "likes": "2",
                    "time": "09/04/2020-00:19:16",
                    "content": "That’s fair and I know you and I have talked about this in the past, but if Maker can make that message very loud (maybe instead of marketing the product…), then the liability (not legal, social) is clearly on the the interfaces ignoring the message. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.511111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#68",
                    "likes": "2",
                    "time": "09/04/2020-02:29:15",
                    "content": "I have posted elsewhere on this but I finally have two independent full Maker liquidation data sets on hand for general analysis as well as to cross check against whiter4bbit.   Hopefully I will have some reports soon on this and probably will be posting it here or a new thread that pops up if this compensation poll passes.     Compensating vault holders that liquidated at 0 bid?! Governance       Thanks to the data above from @Bobface of https://maker-auctions.io  and https://defiexplore.com/liquidations  I am able to do a full liquidation analysis spreadsheet on ETH from auction 1 to 4857 (BAT will follow as soon as I flesh out analysis structures within the ETH spreadsheet and then put the data together for a time sequence based analysis)).   I now have two different full data sets with all liquidation data as well as the subsection of this data analyzed by whiter4bbit to look at that …     ",
                    "links": [
                        "https://maker-auctions.io",
                        "https://defiexplore.com/liquidations"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8210227272727275
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sandhaai",
                    "index": "#69",
                    "likes": "1",
                    "time": "09/04/2020-12:20:30",
                    "content": "  github.com/makerdao/community         Compensation poll seems likely to pass so prep next poll   makerdao:master ← jpritikin:master            opened 01:41PM - 07 Apr 20 UTC               jpritikin             +57 -0            This will decide whether compensation will occur in ETH/BAT or DAI and will have a big influence on the outcome. Please take time to review and give your input! ",
                    "links": [
                        "https://github.com/makerdao/community/pull/496",
                        "https://github.com/jpritikin",
                        "https://github.com/makerdao/community/pull/496/files"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianmcli",
                    "index": "#70",
                    "likes": "1",
                    "time": "09/04/2020-14:44:21",
                    "content": "    LongForWisdom:  It’s really difficult for us to ensure that this is the case because we don’t control the UIs that can be used to interact with the platform.   I understand that Oasis is now a separate “company” under Maker Ecosystem Growth Holdings, but it is also the go-to place recommended by the Maker community (and has roots in Oasis Dex, which was created by the foundation). I would venture to guess that the vast majority of people casually using the Maker system did not know about these details. To most people, it looks like there’s just one Maker, and Oasis is part of its suite of products. Perhaps not using the name Oasis after the switch would have alerted more people to the fact that it’s no longer the “responsibility” of Maker. I think it’s fair to say that the community (i.e. MKR holders) has at least some degree of responsibility here. And just a disclaimer, I might be wrong here since I haven’t had time to follow every little business decision the Maker foundation has decided to enact. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.840277777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#71",
                    "likes": "3",
                    "time": "09/04/2020-15:15:16",
                    "content": "    adrianmcli:  I would venture to guess that the vast majority of people casually using the Maker system did not know about these details. To most people, it looks like there’s just one Maker…   I completely agree, and I know how it looks. Unfortunately that doesn’t change the fact that ‘Maker’ is made up of lots of parts. The Maker Foundation, MakerDAO (which doesn’t have a good definition), MKR Token Holders, etc. I am not arguing that Oasis is not the responsibility of the Maker Foundation (regardless of whatever the company structure looks like for that.) I am arguing that Oasis and other UIs aren’t the responsibility of MKR Token Holders (who are the people who will be paying for the compensation). There was never a vote to create the Oasis UI, MKR Token Holders have no input into its operation, we don’t fund it. The same is true of the DefiSaver UI which shows the same 13% liquidation penalty. At best we can vote to say ‘Oasis (or UI’s generally) should do this’ and hope that they do what we asked them to. So I would disagree strongly that MKR Holders have responsibility for Oasis or any other UI. What MKR Token Holders do have responsibility for is the auction parameter settings that were active during Black Thursday which turned out to be inadequate, and there is an argument that this was predictable beforehand to some extent. If we do end up compensating Vault Holders, my hope is that it will be made clear why (though I know people have different opinions, and therefore in all likelihood this will remain muddy). As to the Maker Community recommending certain UI’s there is perhaps some level of responsibility there, but it’s probably not correct to equate the community directly to MKR Token Holders. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.428004535147393
                },
                {
                    "author_link": "https://forum.makerdao.com/u/adrianmcli",
                    "index": "#72",
                    "likes": "5",
                    "time": "09/04/2020-16:26:16",
                    "content": "Thanks for the elaboration of your points, was very helpful actually. In an ideal world I think many people would agree that the Maker Foundation should just fork over the money to compensate vault holders. MKR token holders however need a way to exert pressure upon the Maker Foundation because the decisions they are making have serious effects on the public’s trust of the system which in turn can be detrimental to MKR token holders. However, there is currently no way for MKR token holders to force the foundation to do anything and I think this is where there is a potential issue of moral hazard. I’m not saying that MKR tokens should be able to force the Foundation to fork over money, but there’s certainly a mismatch of consequence and power here. And to bring the point home, regardless of who’s fault it is, if people think the system feels “unfair” then it’s going to be detrimental to MKR token holders AND the Maker Foundation in the long run. I say this as a significant holder of MKR and someone who also lost their vault. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.044146825396826
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#73",
                    "likes": "5",
                    "time": "10/04/2020-13:08:22",
                    "content": "Currently 93,208.35 MKR voting, making it one of the most contested polls in history!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uvizhe",
                    "index": "#74",
                    "likes": "0",
                    "time": "11/04/2020-10:42:46",
                    "content": "I feel a bit sorry to raise this issue now when compensation poll is almost finished. But anyway.  Arguments for compensation in DAI (the DAI value of the residual collateral at the time of liquidation):  Not sure why the option to compensate “the DAI value of the residual collateral at the time of liquidation” has ever popped. What the compensation is about? If it’s about returning the lost collateral assets then this option is unfair. Why to use the collateral-to-DAI price at the time of liquidation? Why not use a price an asset was bought at or a price at the time when it was put to vault? Equally unreasonable any arbitrary time point is just meaningless without a time machine so anyone can buy back their collateral. Sure there’s a technical challenge to give a fair price to collateral assets at the time flop auctions will take place but that’s a minor thing as it can be largely mitigated by setting a price point the day/hour before auctions start. If the spirit of compensation is more like a moral compensation then this approach is ok. However it’s unreasonable to speak of any additional haircut to payouts in this context. And also there’s another drawback as this desincentivize Maker holders to resolve this issue ASAP (the longer it takes the better is MKR/DAI ratio). My proposal is to have two DAI options in the poll:  moral compensation with DAI proportional to lost collateral (ratio to be decided in a subsequent poll) compensation of lost collateral with DAI (due to its technical simplicity, haircut to be decided in a subsequent poll)  With this options I think it’s not necessary anymore to include an option to compensate vault holders with a liquidated asset. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2021103896103895
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#75",
                    "likes": "0",
                    "time": "11/04/2020-11:28:44",
                    "content": "    uvizhe:  I feel a bit sorry to raise this issue now when compensation poll is almost finished.   Your comment is more relevant to the next poll. Please review https://github.com/makerdao/community/pull/496 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uvizhe",
                    "index": "#76",
                    "likes": "0",
                    "time": "11/04/2020-12:12:28",
                    "content": "Yes, this is exactly the poll I’m referring to in the further comment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#77",
                    "likes": "0",
                    "time": "11/04/2020-12:13:58",
                    "content": "I couldn’t follow your comment. Can you propose changes in the github PR? The poll is not live yet so we could still change it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.659090909090909
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uvizhe",
                    "index": "#78",
                    "likes": "0",
                    "time": "11/04/2020-12:22:28",
                    "content": "I’m not sure how to correctly represent my suggestions in a poll text. I can copy-paste my comment to the PR to move this discussion there or you can tell me here what’s unclear to you. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#79",
                    "likes": "0",
                    "time": "11/04/2020-12:28:03",
                    "content": "OK, I read your comment again. Do my latest changes on github address your concerns? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/uvizhe",
                    "index": "#80",
                    "likes": "0",
                    "time": "11/04/2020-12:35:25",
                    "content": "No, it doesn’t. Let’s move to GitHub. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NOW_Mind_and_Body",
                    "index": "#81",
                    "likes": "0",
                    "time": "13/04/2020-01:40:26",
                    "content": "I lost my entire vault it seems. Idk my number so Idk how to check  but I think it was 23 ETH. Please kindly let me know what I need to do. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#82",
                    "likes": "9",
                    "time": "13/04/2020-03:10:45",
                    "content": "I’ve spent the last hour or two reviewing this thread, the GitHub PR, and the signalling guidelines, and I have some significant concerns I’d like to address surrounding the process, not the intent, of this poll. In summary: I’m not sure it’s a good idea to add this to the portal without some review of the signalling guidelines, seeing some more evidence that there’s been adequate discussion with the relevant stakeholders, and having clear signs that community consensus has been reached on the content of the poll. I’m going to run through a pile of stuff, please forgive the point form. Procedural Concerns   This thread is getting extremely unwieldy. I don’t think it’s very likely people are going to be able to come into this cold and understand what is going on here. Section 3 of the Guidelines addresses this issue: “The topic should seek to gather signals for only a single issue. If you want multiple signals, make multiple topics.” This is particularly important because the ecosystem needs a clear audit trail, a historical record, of the decision making that went into a change to the system. Especially in light of the tremendous amount of crypto press interest generated from the last compensation poll    Can we have a lock-down, or code freeze period here? The process in the other signal threads has generally been at least a few days beginning after the forum poll has ended; the proposer summarises the discussion and then it sits long enough for people to have enough time to find the proposal (people are busy) and express last-minute contention.   This proposal has also been altered in other venues after the debate here slowed down. If the content of the poll changes after the debate winds down it’s hard to assert that the community has actually agreed on a specific course of action.   Do we need the summaries of the arguments in the body of the poll? Is it possible to do that in a way that accurately reflects everyone’s thinking?   If not, doesn’t this addition imply that someone is editorialising? Can a few users encapsulate the arguments from all the people in the thread, and the ecosystem, without unintentionally introducing bias?   Can’t voters be referred back to the thread for summary review and leave the polling to clear decision making processes?     Consensus Concerns   The convention around all previous polls from the community has required an in-forum poll to gauge sentiment, this new poll does not have one. As per the guidelines: \"Polling Results should be made visible after a vote has been cast. ‘Show who voted’ should be enabled.\"   Can we keep the conversation in the forums so the less technical can remain engaged? I had no idea there are debates and edits going on in GitHub. Some of them are fairly significant, and recent, developments.   Planning and Feasibility Concerns I’m not sure I’m following the chain of events are here. The first poll was to determine if there is an appetite for compensation. Why is the second step to determine the denomination? Wouldn’t it make more sense to get the community aligned on a plan, map it out into a roadmap, then figure out which parts need to be put into the polling system? This feels a bit like it’s being invented week to week. I’m not sure there will be any resolution to this issue without a plan that involves the stakeholders and some discovery about who will do what, when. In the absence of, or until one arises, I would really like to avoid any mention of specific mechanics. This poll is still getting deeply into the territory of making assumptions about feasibility. There are an unbelievable amount of complexities hidden in these guesses at solutions. The community may find out that some of those implementations are not possible. What happens when voters get upset that what they signalled for isn’t the same things as what actually happened? For example, in this poll it’s not clear who is going to custody these funds or how the transactions will take place. Also: “To provide compensation, Maker would have to purchase this ETH at the current market rate”. Depending on how this is read it can have very different implications. Who is Maker in this context? Summary In light of this lack of established norms I’m going to recommend the community and the proposers address the missing process and consensus issues here before I add this to the portal. I am, as always, very reluctant to exercise any of the IGF mandate’s powers but this is an extremely sensitive issue with a wide number of stakeholders, lots of moving parts, and countless possible implementation plans. And, as the community seems to have signalled their intention to move ahead with compensation, I don’t believe a further review of this proposal will materially delay any eventual outcomes. Community, let me know your thoughts. ",
                    "links": [
                        "https://forum.makerdao.com/t/mandate-interim-governance-facilitators/264",
                        "https://forum.makerdao.com/t/what-is-the-next-step-for-compensating-vault-holders/1963",
                        "https://forum.makerdao.com/t/maker-vault-compensation-updates-and-status/2583/30",
                        "https://forum.makerdao.com/t/what-is-the-next-step-for-compensating-vault-holders/1963/3"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.2060882635882635
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#83",
                    "likes": "1",
                    "time": "13/04/2020-13:07:59",
                    "content": "@rich.brown Can you lock this thread so we don’t keep adding to it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Mitote",
                    "index": "#84",
                    "likes": "0",
                    "time": "13/04/2020-13:22:40",
                    "content": "I was confused about this poll, are there post-mortums going into what exactly happened? I wouldn’t want to vote on anything until a post-mortum involving Maker devs is available. Its interesting how much mkr voted. 90k is no joke. Edit: My mistake for the useless comment there is this https://blog.makerdao.com/the-market-collapse-of-march-12-2020-how-it-impacted-makerdao/ ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rich.brown",
                    "index": "#85",
                    "likes": "0",
                    "time": "13/04/2020-16:37:16",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ],
    "group_index": "1804"
}