{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-turn-off-burner-fuel-up-sagittarius-engine/10724",
            "title": "[Signal Request] Turn off burner, fuel up Sagittarius Engine ",
            "index": 10724,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "sig-status-rejected"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#1",
                    "likes": "1",
                    "time": "05/10/2021-06:26:22",
                    "content": "The Buy & Burn function was not a bad idea back in 2016, but it was never ideal for a startup such as Maker with many years of growth ahead of it - it is more of a late-game strategy. They say imitation is the sincerest form of flattery but when I come to think of it not many other crypto projects tried to copy this aspect of Maker - for various reasons. Anyway, time to retire the old furnace and get ourselves a brand new solution in the form of the Sagittarius Engine. Needless to say, Sagittarius has yet to be detailed, and precisely because we do not know how long it will take to implement, now is the time to start saving funds to start it. Do you agree to the following proposal:  The Buy & Burn function is turned off Surplus Buffer stays at DAI 60 million until otherwise decided Funds in excess of the Surplus Buffer is directed to the Sagittarius Engine for future use      Yes No Abstain     0 voters     Feel free to argue pros and cons in the comments.  Next Step This Poll will run until October 20, 2021, 1500 CET. The outcome will result in an on-chain-poll assuming the outcome of the poll deems it necessary. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-66-en-espanol/10982",
                        "https://forum.makerdao.com/t/maker-relay-ep-66/10950",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-30th-october-7th/10837",
                        "https://forum.makerdao.com/t/maker-governance-review-october-2021/11517"
                    ],
                    "GPT-summary": "The author of the post is explaining a proposal to turn off the Buy & Burn function and direct funds to a new solution called the Sagittarius Engine. The author is asking for feedback and opinions on the proposal, and a poll will be conducted to determine the outcome. A 3rd party can give constructive criticism, ask questions, or express interest in collaborating on the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.120006887052342
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#2",
                    "likes": "12",
                    "time": "05/10/2021-07:13:29",
                    "content": "Voted NO because this is at least a pre-mature issue. Also, this signal doesn’t seem to make a lot of sense to me--  We can’t really “direct” funds to something that doesn’t exist yet, and if we want to conserve Dai for a potential future use other than Buy and Burn, wouldn’t it make more sense to just raise the Surplus Buffer to a level that won’t be exceeded for the foreseeable future? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.196428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#3",
                    "likes": "6",
                    "time": "05/10/2021-07:17:39",
                    "content": "I agree with @Spidomo I appreciate the enthusiasm but this proposal was only described for the first time yesterday and at this stage I think it would be premature to make a major change to the protocol without further discussion of the intended changes. Note this is not a criticism of the Sagittarius engine itself which in my opinion is an exciting development for the Maker Protocol. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.612500000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#4",
                    "likes": "4",
                    "time": "05/10/2021-07:18:31",
                    "content": "I also agree with @Spidomo. Provide more information about Sagittarius Engine first. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#5",
                    "likes": "2",
                    "time": "05/10/2021-07:28:18",
                    "content": "I voted yes, Sagittarius is a game changer that we need, yes it was mentioned for first time yesterday but its still a better concept then the current burn and mint mechanism what we have now. It is not only better it comes with more features and positive side effects. Of course there is a lot of work thats need to be done. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.985795454545455
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#6",
                    "likes": "0",
                    "time": "05/10/2021-07:41:42",
                    "content": "    Spidomo:  wouldn’t it make more sense to just raise the Surplus Buffer to a level that won’t be exceeded for the foreseeable future?   In theory it is one and the same - you are correct about that. In practice many community members seem to have a ‘save every penny for a rainy day’ relationship with the Surplus Buffer leading to a ton of funds sitting in the buffer doing nothing. The only way realistic way to get the funds mobilized is to send them to a different fund with an explicit different purpose. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.729166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#7",
                    "likes": "3",
                    "time": "05/10/2021-09:19:50",
                    "content": "Intresting poll but premature. The SE, as I understand it, is a wonderful concept but at present is Rune’s thinking on paper and represents nothing yet designed or coded. It will take months, if not a year (or years) to arrive at a time when this is market ready. Until then, we shouldn’t change a design that works quite well, though not as “pump-inducing” as some would prefer. Everyone remembers the delays surrounding MCD, I hope. The same thing – prolonged discussion, (somewhat circular)  philosophical debate, then design, testing, auditing and FV, then more testing, amounting to years of development time – will happen here, no doubt. For those reasons, I voted “No.” NB - something like SE SHOULD take years, as it represents a radical change to Maker’s technical design, I believe, resulting in much new work. Given the engineering culture here (treat software releases much the same as hardware releases) I think that is a great thing. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.289256198347108
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#8",
                    "likes": "0",
                    "time": "05/10/2021-10:21:43",
                    "content": "I’m a little confused here–you have been an opponent of Raising the Surplus Buffer (something the majority of the Community ask for), I was under the impression you wanted to burn MKR?  I polled for “No” – as you said, Sagi is yet to be detailed and will take time to implement. But your idea is interesting. BTW, will Sagi be built on a Layer 2?  more eco friendly ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.989583333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#9",
                    "likes": "1",
                    "time": "05/10/2021-10:47:47",
                    "content": "    Tosh9.0:  NB - something like SE SHOULD take years, as it represents a radical change to Maker’s technical design, I believe, resulting in much new work.   This is not how I read it. Directly quoting Rune’s article    The case for Clean Money   The primary incentive to do this is the ability to borrow from the pool of Dai accumulated from protocol surplus in the Sagittarius Engine, using the locked up MKR as collateral.   This is a normal Vault for staked MKR with some interesting extras. We already have Vaults, we have MKR staked in the Gov contracts and we can adjust parameters. On top of that comes the bonus DAI from the Sagittarius Engine. I will go out on a limb here and say we are 80% done already. Additionally we could need a liquidity mining program (to soak up MKR prior and during dilution). Just maybe we could allow for normal use of MKR Vaults as well to cover all bases since the old arguments about not having MKR Vaults are already out the window. This is highly doable - maybe not ready for Christmas - but not long after. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.8885822510822505
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#10",
                    "likes": "1",
                    "time": "05/10/2021-11:10:06",
                    "content": "    Planet_X:  This is highly doable - maybe not ready for Christmas - but not long after.   Perhaps, but I am not sure it is doable so quickly in a meaningful way. Suppose we put 10m DAI in the SE, and allow MKR holders to borrow it at DSR rates (as suggested by rune in his post). This will last literally 30 seconds… Not sure if it is so useful this way. As rune said in the chat:  Screenshot 2021-10-05 at 13.08.541218×144 24.4 KB  so, as others suggested, this is actually quite a profound modification of the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.234166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#11",
                    "likes": "1",
                    "time": "05/10/2021-11:40:49",
                    "content": "We are not going to put DAI 10 million in the Sagittarius Engine. We are going to go for DAI 1.0 billion maybe, depending on how dilution works out. Then MKR holders (new and old) may lock up their MKR with longer lockups maybe giving more bonus. So the initial calcs for a MKR 100 salmon will be something like (assuming 1 MKR = 2500 DAI) Start Vault with 100 staked MKR. With let’s say 150% liquidation ratio, DSR-like Stability Fee and heavily lubricated liquidation settings we are looking at drawing DAI 1002500(1/1.5) = max DAI 167,000. Additionally there is the Sagittarius DAI at 1.0 billion / maybe 1.0 million staked MKR * 250 (Sally the Salmon’s holding) = DAI 250,000. That is a total whopping DAI 417,000 out of a position with a street value of DAI 250,000. And there is no overcollateralization - you just use the Sagittarius Engine to boost. And as time goes by profit will just continue to accumulate in Sagittarius, meaning this will only improve even more with time. All this and saving the environment. Plus NFTs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.647727272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#12",
                    "likes": "10",
                    "time": "05/10/2021-12:01:41",
                    "content": "Agree that this signal is premature, and also massively stretches what is appropriate in a signal request. Governance hasn’t even agreed to pursue Sagittarius at this point. You could achieve the same goal just by creating a signal to increase the surplus buffer, disregarding all the Sagittarius stuff. Given that @rune 's proposal represents a huge shift in what Maker is and how it operates, I would recommend giving it some time for discussion before jumping to votes. Further, when we do vote on it, it should be more clear exactly what we are voting for. Is a vote for this signal a vote for Rune’s entire proposal? It mentions ‘funds are directed to the SE’ so this is unclear. Also, even just turning buy-and-burn off permanently would need a more substantial proposal and discussion (IE, a MIP) rather than a signal. So, on balance I don’t think that we’ll be including this in the weekly cycle for an on-chain poll regardless of the outcome, given that other processes are much more appropriate for a change of this magnitude. I do appreciate the enthusiasm @Planet_X, everyone is excited, but yeah for this more than anything else, we need to ensure that the governance process is as bulletproof as possible. If you just want to prevent burns in the meantime, I’d suggest putting up a signal to increase the surplus buffer only. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.176470588235294
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#13",
                    "likes": "11",
                    "time": "05/10/2021-12:05:20",
                    "content": "Just to comment on the complexity of building the SE - I am quite sure it will take at least a year to finish and like others are mentioning, it is not something that should be rushed. Step one should be to have transparent discussions about its design and what we are really looking for in a tokenomics system. However, I am in favor of increasing the surplus buffer and not doing any more MKR burn because I think it is simply a waste of our resources. I dont believe it provides the kind of benefit we need at this point. I have also designed what I think is a much more sensible burn engine that is meant to run alongside the sagittarius engine, but at the current phase we are wrt growth, burning MKR should just not be a priority. I designed the basic concept of the buy and burn engine in 2015, it was one of the first ever tokenomics systems and for sure the oldest one still around today… its not really a surprise that it wasnt exactly the greatest solution ever, and there’s nothing wrong with admitting that. On the contrary if we can recognize why it is suboptimal, and recognize what we are looking for in a good alternative, we have demonstrated the power of a DAO to evolve and learn from its environment and itself. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#14",
                    "likes": "3",
                    "time": "06/10/2021-08:06:33",
                    "content": "Hey @rune first of all: really happy to see you back in the (visibile) game again  Like probably a lot of other folks here I haven’t made a final feeling about the Sagittarius Engine - but it is for a sure an interesting idea to think and debate about.     rune:  However, I am in favor of increasing the surplus buffer and not doing any more MKR burn because I think it is simply a waste of our resources.   Even without the perspective of creating another tokenomics around MKR, I pushed for increasing the Surplus Buffer multiple times (2020-12, 2021-01, 2021-03) but the last one did not get proper support onchain. If your new initiative is going to change the sentiment, I am more than happy to retry it  ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-adjust-the-surplus-buffer-2021-2/6250",
                        "https://forum.makerdao.com/t/signal-request-adjust-the-surplus-buffer-march-april-2021/6979",
                        "https://forum.makerdao.com/t/signal-request-adjust-the-surplus-buffer-september-2021/10120"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.019176136363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#15",
                    "likes": "0",
                    "time": "06/10/2021-08:18:43",
                    "content": "    ultraschuppi:  If your new initiative is going to change the sentiment, I am more than happy to retry it    The last onchain vote on this was September 20th (16days ago). While there is no strict lower bound (note1) on the intervals between onchain votes on a given subject, I’d find a bit weird if we rush to go vote again on this, soon after @rune post. This said, @Planet_X , the delegate that had a decise weight in the onchain vote, possibly changed his mind (form his last posts after @rune’s SE proposal)… so I don’t know. (note1:) as far as I know. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.622589531680441
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#16",
                    "likes": "5",
                    "time": "06/10/2021-08:34:05",
                    "content": "Setting aside the discussion about tokenomics, I think the best way to make it more appealing to accumulate cash to be spent on growth, rather than spend it on burn, is to start doing something productive with the extra reserves rather than just holding dai (which practically is equivalent to accumulating USDC into the protocol). A simple option could be to deposit assets into yearn, or if we are feeling more adventurous, taking an ETH/DAI LP position. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#17",
                    "likes": "1",
                    "time": "06/10/2021-08:38:58",
                    "content": "    iammeeoh:  This said, @Planet_X , the delegate that had a decise weight in the onchain vote, possibly changed his mind (form his last posts after @rune’s SE proposal)… so I don’t know.   Also notification to @ultraschuppi Yes - I voted against raising the Surplus Buffer. Why? Four reasons:  Because DAI 60 million is, in my opinion, more than sufficient for our current risk profile. RWA is still in its infancy, Liquidation 2.0 works fantastically well. I want the size of the Surplus Buffer to be determined by an agreed formula, not sentiment. The Surplus Buffer has moved from being a risk management tool to becoming more of a savings account. As long as there was no strategy, I felt that funds could just as well be spent on the burner.  With the announcement of Rune’s new proposal, saved up funds now actually have a purpose. Therefore my change of mind on this question. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.718181818181818
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#18",
                    "likes": "3",
                    "time": "06/10/2021-09:13:04",
                    "content": "    rune:  I think the best way to make it more appealing to accumulate cash to be spent on growth, rather than spend it on burn   I think everybody agrees with this. But I think there is an elephant in the room nobody talks about in the forum (rightly so, because our community is not about shills/pumps/announcement-of-announcements, etc): the price of MKR. In MakerDAO tokenomics (of today), the price of MKR is important in case of losses: e.g., during Black Thursday we lost a few millions usd (<10m) of value in bad liquidations, and we had to print-and-sell MKR to cover our losses. At that time this event almost killed MakerDAO (the price of MKR dropped by almost 60% in a couple of days from ~600Dai to 250Dai)… and all for ~10m usd of losses. Today we have 6.6b DAI outstanding and potential losses are way bigger than 10m usd. Sure, we have ~60m in Surplus. But what happens if we get a loss of 100m usd for some reason? Fact: The ratio (let me call it “safety ratio”)  Safety Ratio: (MKR marketcap)/(DAI outstanding)  has gone down a LOT in the last  2 years since BT: this is due to relative low MKR appreciation and huge increase of DAI outstanding. TL&DR: if the narrative of MKR-holders carrying the risk in case of bad events is still true, we need to massively increase the value of MKR, and dramatically increase its liquidity. How? Well, the buy&burn was the old answer. And I think in Dec 2020 when we kept burning for more than 1 month, we managed to absorb a big sell by Polychain and all of a sudden, after they sold their bags, the price of MKR shoot up. To conclude:     rune:  I think the best way to make it more appealing to accumulate cash to be spent on growth, rather than spend it on burn   Yeah I think 99.99% of the community agrees with growth vs burn, but we can’t keep lowering our Safety Ratio for much longer imho. EDIT: perhaps @Primoz can shed some professional light on how much DAI we can realistically imagine to be able to get (today) by printing MKR in case of accidents, like in a BT event. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.799806674806675
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#19",
                    "likes": "1",
                    "time": "06/10/2021-09:33:54",
                    "content": "Fully agree with these points, and I think this supports taking Dai and e.g. deposit it to Yearn (or another alternative, depending on security considerations). It would allow us to get returns on the assets that are now sitting in the surplus buffer, while still being able to access them in a situation where we suffer severe losses (and potentially have more available since they’ve been generating a return). But the overall concerns you are mentioning here is also why going down the path of more aggressive and advanced tokenomics combined with MKR issuance is the right move - it allows us to both benefit the MKR value proposition and remove MKR from circulation, while also growing our reserves and safety ratio. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.350088183421516
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#20",
                    "likes": "3",
                    "time": "06/10/2021-11:40:31",
                    "content": "    rune:  Fully agree with these points, and I think this supports taking Dai and e.g. deposit it to Yearn (or another alternative, depending on security considerations). It would allow us to get returns on the assets that are now sitting in the surplus buffer, while still being able to access them in a situation where we suffer severe losses (and potentially have more available since they’ve been generating a return).   We need to separate the cash from the capital discussion. The Surplus Buffer is the accumulation of profit/loss and proceeds from MKR burn/sold. Currently, it’s 55M. On the assets side, we have cash and cash equivalent-like stuff which are the PSMs. We have 3.5B of them ready to be invested and fully under our control. We also can expand the balance sheet as much as we want increasing the leverage. If we create a yvDAI-PSM with 1B DC, fill it, we would still a SB of 55M (you suck 1B from the SB, convert that to yvDAI-PSM, get 1 DAI back, refill the SB). It would increase DAI in circulation by 1B (increasing liabilities and leverage). Most likely than not, yvDAI yield would decrease due to the influx, so some people would exist and move to yvUSDC which would decrease the USDC-PSM. We could invest 100B in yvDAI. That would make DAI being 106B of market cap. The problem is our inability to invest in assets (hence why we have plenty of USDC), it is not at all the surplus buffer. If we want to deploy our assets to fight climate change it will mean taking more risks. Hence we need a bigger surplus buffer (or whatever the capital stack is called). You can’t invest in bonds and project finance at a 100x leverage (what we have currently). The only things that came from a 100x leverage were LTCM and the Global Financial Crisis. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GuyB",
                    "index": "#21",
                    "likes": "1",
                    "time": "06/10/2021-11:43:10",
                    "content": "    iammeeoh:  TL&DR: if the narrative of MKR-holders carrying the risk in case of bad events is still true, we need to massively increase the value of MKR, and dramatically increase its liquidity.   Probably like most people, I’m still digesting the implications of this model. But it seems like SE would completely change the risk profile of MakerDAO anyway by financing a massive injection of protocol-controlled liquidity with new MKR. Olympus DAO is an interesting precedent for this so there might be some insights to be gained there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.553977272727273
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#22",
                    "likes": "1",
                    "time": "13/10/2021-11:16:42",
                    "content": "Closing this out based on my previous comment. See here for the Clean Money signal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#23",
                    "likes": "0",
                    "time": "12/11/2021-21:17:05",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}