{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/circle-launches-stablecoin-euroc/16171",
            "title": "Circle launches stablecoin EUROC ",
            "index": 16171,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "usdc",
                "eur",
                "euroc",
                "circle"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "3",
                    "time": "29/06/2022-04:12:09",
                    "content": " Euro Coin, or EUROC, will be available for trading on June 30 Important news for Dai, because thanks to EUROC joining the ecosystem, this could increase Dai cash flow, and generate more revenue for Maker if implemented as another collateral for Dai. It is also positive for the crypto ecosystem in general because this means that people are demanding or wanting to handle euros in Defi, more options for users, and more money coming into crypto, this is good news.  EUROC965×870 78.3 KB   Market Cap stablecoins1389×929 175 KB     Cointelegraph    Circle launches euro-backed stablecoin EUROC The success of Circle's USDC stablecoin has paved the way for a euro-denominated equivalent.      ",
                    "links": [
                        "https://cointelegraph.com/news/circle-launches-euro-backed-stablecoin-euroc?_ga=2.124794893.665289049.1656468948-1715937331.1636054451",
                        "https://forum.makerdao.com/t/circle-discloses-full-breakdown-of-55-7b-usdc-reserves/16640"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.888636363636364
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/06/2022-13:13:44",
                    "content": "If you want to see the circulating EURCOIN you can use this wed, a pity personally that the creation of EURDAI has remained only in lacharla, but after all, I already live it with CELO network that have a stablecoin anchored to the euro that even the creators do not use it, in short.    euroc.cool    euroc.cool | The EUROC stablecoin supply scanner A live view into the circulating supply of the EUROC stablecoin across all chains. EUROC is cool. euroc.cool      ",
                    "links": [
                        "https://euroc.cool/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.373376623376624
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/06/2022-18:18:32",
                    "content": "After all, it seems to be better that only Dai exists 1:1 with the Dollar, unless this recession ends up unleashing an economic catastrophe that makes an even more radical change in the world monetary economy, and it would be better to anchor Dai to another fiat currency. The economy of the European Union has weakened a lot lately, but the block of Russia, China and India not so much, I think that if in the future they bring out an alternative Dai, it would be better that it is linked to the more robust economy of the East, that makes more sense than alternatives of Dai concentrated in the West. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.291666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/06/2022-18:24:55",
                    "content": " Screenshot_20220629-142020_Chrome2400×1008 170 KB  The total sum is 200% because each currency trade always involves a currency pair; one currency is sold (e.g. US$) and another bought (€). Therefore each trade is counted twice, once under the sold currency ($) and once under the bought currency (€). The percentages above are the percent of trades involving that currency regardless of whether it is bought or sold, e.g. the U.S. Dollar is bought or sold in 88% of all trades, whereas the Euro is bought or sold 32% of the time. I would think currency pegging priority should be based on real world currency demand. EUR is currently in 2nd place. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#5",
                    "likes": "1",
                    "time": "29/06/2022-19:44:24",
                    "content": "Right having alternatives can be positive, but if the use cases are not right, it will be a loss for the protocol. The euro is not as much in demand as the dollar, it is a more reliable currency from my point of view, but we follow the same centralized debt system. Adopting the least bad does not exempt us from a possible debacle in the global economy. We have to diversify, in my opinion, think outside the box. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.031877213695396
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#6",
                    "likes": "0",
                    "time": "29/06/2022-19:48:18",
                    "content": "Well once EUROC has launched, we could set up a eurodai stablecoin that is backed by EUROC just as Dai is backed by USDC. Could form a good base of support for the crypto. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#7",
                    "likes": "0",
                    "time": "29/06/2022-19:50:47",
                    "content": "Come on, my friend, you know that’s not true  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "1",
                    "time": "29/06/2022-20:03:34",
                    "content": "I saw many launch Euro, pounds, Canadian Dollar, and many other non-USD stablecoins. However, most failed to gain transaction and I would be surprised to see Circle Euro version being even 1/4th of current USDC size. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.696428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#9",
                    "likes": "1",
                    "time": "29/06/2022-20:04:52",
                    "content": "Remember that it’s not only that they need to mint EUROC, but also they need to encourage it to be integrated to various exchanges and dApps, which would take quite a lot of time. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#10",
                    "likes": "1",
                    "time": "29/06/2022-23:22:31",
                    "content": "Realy excited about EUROC from Circle… skeptical of their solvency? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#11",
                    "likes": "1",
                    "time": "29/06/2022-23:45:09",
                    "content": "You are right, most probably it will not have such a boom, but it will have some demand, there are people who all their lives have been using euros and they feel better with it. It will be interesting to see how the European Union regulators will take it, because of their CBDC. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.488095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#12",
                    "likes": "2",
                    "time": "29/06/2022-23:47:29",
                    "content": "I wonder, why skeptical of its solvency? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#13",
                    "likes": "1",
                    "time": "29/06/2022-23:57:26",
                    "content": "    cryptenthusiastic:  why skeptical   I’m in NYC rn, and it’s gotten so hectic here… everything is skeptical lol I get things done, but at what cost? I think a cycle like… two months out, two weeks of sprinting here here, would strike a good balance lol ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.3
                }
            ]
        }
    ]
}