{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - REINNO (REINNO Stablecoin) - February 15, 2021",
            "index": "6218",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "22,343",
            "highest_fraction": 0.63
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/reinno-mip6-collateral-onboarding-application-real-estate-new/6218",
            "title": "[REINNO] MIP6 Collateral Onboarding Application - Real Estate - NEW ",
            "index": 6218,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "real-world-finance",
                "real-assets"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Viktor_REINNO",
                    "index": "#1",
                    "likes": "2",
                    "time": "26/01/2021-10:37:41",
                    "content": "This is a new, updated MIP6 Proposal for the addition of REINNO’s tokenized commercial real estate backed loans to MCD by REINNO. 1. Who is the interested party for this collateral application? The asset originator is REINNO as is represented by Viktor Viktorov (@Viktor_REINNO, [email protected], Co-Founder and Chief Executive Officer), Hristo Piyankov (@Hristo_Piyankov, [email protected], Chief Data Officer) and Natalia Shirshova (@ natalia_reinno on Rocket.Chat, Co-Founder and Chief Marketing Officer). 2. Provide a brief high-level overview of the project, with a focus on the applying collateral token. REINNO is a financial technology company offering a new solution for lending and real estate tokenization with a focus on providing liquidity. Our services cover the technology, corporate structure, legal compliance and marketability of tokenized real estate assets. We are positioned to be the first company to accept tokenized real estate as loan collateral. Lending using tokenized real estate as collateral provides much higher flexibility, simplifies the application process and reduces costs for end customers. REINNO is a turnkey solution for anyone who wants to tokenize real estate and who is matching our eligibility criteria. Through our offerings, property owners obtain new ways of both replacing their existing bank mortgage and borrowing against their equity in a property. Using digital tokens as loan collateral allows for greater liquidity and cheaper funding, benefiting the end customer. Also, by tokenizing their assets users can trade real estate in fractions. REINNO’s ultimate goal is to build a fintech ecosystem for tokenized real estate, which will provide the full spectrum of blockchain-based financial services for consumers worldwide. REINNO is the company behind the very new Tokenized Instant Lending (TIL) concept for real estate. This new approach is possible because of the blockchain technology that underpins it and the rising security tokens popularity. TIL is making real estate associated loans (mortgage, HELOC and home equity loans) efficient, fast, flexible and with no need to foreclose. Using tokenized real estate as collateral allows REINNO to tremendously improve the way these loans work today. REINNO combines the benefits that you could have from having a mortgage, a HELOC or a home equity loan and bundles them in one product adding even more benefits. Usually a mortgage blocks the entire property, making it hard for the owner to sell any equity from it. Even if they have already repaid $4,900,000 of a $5,000,000 mortgage, the entire asset is blocked by the bank. However, by using tokens (fractional digital ownership) borrowers are able to take out an instant loan backed by a fraction of the real estate value. This way, only the tokens used as collateral get locked; the rest of the equity remains free and can be accessed for additional funding or sold as needed. Moreover, when a portion of principal is repaid, the borrower receives an equity equivalent back. The more principal is repaid, the more tokens are freed from the collateral. Furthermore, if two people are holding tokens that represent the same property, a loan taken by one person will not affect the tokens (or ownership) of the other in any way. REINNO will bundle multiple tokens representing tokenized real estate into a single REINNO stablecoin, which in turn will be used as collateral for obtaining DAI. Maker will be one of the capital sources used by REINNO. This will benefit both REINNO and Maker. Maker will know the average cost of capital set by traditional institutions (banks, insurance companies, investment funds) and have the opportunity to adjust its rates accordingly. This way Maker can never miss out on potential profit and always stay competitive. At the same time, REINNO will be able to grow the size of capital available for its lending services. It will also ensure stability and diversification. In case one source fails to provide capital, REINNO’s clients will not experience a service interruption. Moreover, these credit lines can provide liquidity to one another. If Maker investors want liquidity, REINNO can repay DAI before the loan maturity by refinancing it through another credit line or simply selling the loan. REINNO tokenizations to date:  US-based income-producing commercial real estate Total value tokenized : $355,137,266 Completed deals: 8 Deals in the pipeline: 13  Watch REINNO’s 2020 in review video. 3. Provide a brief history of the project. The idea for REINNO was born in December 2018 when Viktor Viktorov, it’s CEO, was working on another project related to cryptocurrencies. He saw the potential that tokenization had in the real estate space and decided to start a new company. Since then, REINNO has reached many important milestones. The company completed its first tokenization of a commercial real estate fund worth $105.5 mln in January 2020. It also created a unique legal and technical structure that allows REINNO to streamline the tokenization process. Since then, it tokenized a total of eight projects worth over $355 mln. All of them include income-producing properties located in the U.S., including residential, retail, healthcare and industrial real estate. REINNO launched the demo version of its lending platform in August 2019. The company created a proprietary lending model that accounts for the risks associated with both real estate and digital tokens. The company also built a marketplace where investors from all over the world can invest in tokenized real estate. With the recent amendments from SEC allowing investors with certain professional knowledge, experience or certification to qualify as accredited, even more people can participate in the offerings. The marketplace launched in September 2020 with five offerings. Since then, over $11 million has been secured through the platform. Other achievements include winning Startup World Cup regionals (2020 edition; the finale was postponed due to the COVID-19 complications), appearing as experts in industry-specific publications and media (e.g. Cointelegraph, Decrypt, Security Token Market, Value.Tokenized), and building a strong team. REINNO brings together experts in commercial real estate, fintech, IT, law and business growth. It also has a global tea of sales people around the world - from the USA and UK to China and Russia.  REINNO_timeline2088×1168 247 KB  4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Examples of tokens issued by REINNO: Token 1  Token 2  REPO LINK  Pitch deck Infographics:  This represents the process of taking a loan through app.reinno.io. The actions on the left side are performed by a user on the platform. The actions on the right side are performed (or automated) by REINNO in the backend. At the end when DAI is generated, REINNO sends it to the borrower’s wallet. From there, they can decide whether to use it directly or exchange it for USD.  We expect this to be the most popular scenario among our users.  user (2)1536×1800 162 KB   This represents a scenario when a user sends his CRE tokens directly to a smart contract and exchanges them for REINNO stablecoins (instead of REINNO doing it in the previous infographic). This allows them to stake REINNO stablecoins and borrow DAI directly from Maker, instead of going through REINNO’s front end. We expect only The most tech-savvy users (and DeFi enthusiasts) to interact with the system this way.   user, копия (1)1536×1800 164 KB  5. Link any available audits of the project. Both procedural and smart contract focused audits. The stablecoin smart contract is currently awaiting audit. 6. Link to any active communities relating to your project. LinkedIn Twitter  NEW: Reddit 7. How is the applying collateral type currently used? For the time being, REINNO tokenizes individual commercial real estate locations and real estate portfolios, and issues their own individual security tokens which represent fractional ownership of the building or portfolio (and the underlying cash flows). As part of the integration with Maker, REINNO will issue REINNO stablecoins to bundle multiple tokenized real estate assets. The stablecoin smart contract is ready and awaits auditing. The stablecoin will have a fixed price of one USD and it will essentially function the exact same way as multi-collateral DAI does. Subsequently, this token will be used as collateral in order to produce DAI. This will provide liquidity to the REINNO stablecoin in order to disburse loans to people who lock their CRE tokens in the REINNO protocol. 8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? We as Reinno Tokenization LLC or Reinno Property Management LLC, USA, Delaware 9. Where does exchange for the asset occur? The REINNO stablecoin has not been deployed yet. It is not part of the original REINNO technology stack, but rather a derivative tool, specifically designed to provide liquidity for tokenized real estate. The security tokens produced by REINNO as a result of commercial real estate tokenization are available for sale on REINNO’s marketplace. Subsequently they will be traded on secondary markets - those of our partners (e.g. ADAX) and REINNO’s own (now in development). After the REINNO stablecoin is created, it will be made available for trading on exchanges, such as Uniswap. There are two potential liquidation scenarios:  Obtain REINNO stablecoins in exchange for DAI at an auction. Sell REINNO stablecoins on an exchange for an arbitrage opportunity.  OR  Obtain REINNO stablecoins in exchange for DAI at an auction. Obtain CRE tokens in liquidation in exchange for REINNO stablecoins. Sell the CRE tokens on REINNO’s secondary market (or any other market where it is listed) OR hold them and benefit from % of their cashflows.  10. (Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. LINK  11. (Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. Reg D filings (the link might be unavailable outside the U.S.) 12. (Optional) List any possible oracle data sources for the proposed Collateral type. REINNO performs an independent assessment of each property which is subject to tokenization and subsequently loan disbursement. Furthermore, these properties will be reassessed on a regular basis. All the documents produced in the process will be made available to the appointed auditor. An important data source is REINNO Oracle - an application that calculates the value of real estate behind the tokens. It provides an estimate of a property value based on its characteristics (e.g. year built, size, layout) and similar buildings in the neighborhood. This number is used to calculate the lending parameters. If the real asset has to be sold, the assessed value can be used to determine the minimum amount to be made on a sale. REINNO uses the data from the Oracle as a base for its real estate index. The index categorizes properties based on their profile and risk factors, as well as current and future performance. It makes diversification and collateral portfolio management simple and efficient. For example, a freshly renovated (1) multifamily building (2) with good tenant history (3) in a fast-growing city (4) can be rated A. At the same time, an old (1) mall (2) with expired leases (3) in a city with growing unemployment (4) is likely to be rated E. A newly built (1) office building (2) with a good tenant mix - big and small companies from different industries - (3) in a convenient location (4) earns a C. Here we consider historic results, current situation and future projections. We expect this multifamily property to stay a strong performer and this mall to struggle. Despite its current success, this office building is still risky due to the pandemic and cannot get the highest rating. Of course, this is just a simplification of the index and more factors are taken into account. REINNO believes that collateral diversification is important for risk mitigation. To make it possible, REINNO will adjust the interest rates for the property time that the company wants to have more or less in the collateral pool. For instance, if the value of loans backed by tokenized multifamily buildings reaches a certain level, REINNO will increase the interest rates for the future users borrowing against such properties. Alternatively, if REINNO wants to issue more loans backed by tokenized industrial facilities, the interest rates for this collateral type will decrease. REINNO will use the same logic for geographical diversification (more loans collateralized by tokenized real estate in Texas - higher rates; few loans originated with buildings in Florida - lower rates). 13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type As mentioned earlier, having several capital sources will allow REINNO to liquidate or refinance loans. Moreover, they can be sold to third parties specializing in loan purchasing. REINNO loans are collateralized by a unique asset type and enable such companies to diversify their portfolios and expand their risk strategy. REINNO aims to attract individual liquidators too. When a liquidation is triggered, they will purchase REINNO stablecoins at a discount and then exchange them in search for arbitrage opportunities. REINNO is working on incentives for liquidity providers. An example of such incentive is governance tokens. REINNO will create a governance token pool specifically for this purpose. Liquidity providers will then use these tokens for voting or increasing their profits by selling these tokens. ",
                    "links": [
                        "https://forum.makerdao.com/u/hristo_piyankov",
                        "https://youtu.be/k4cwGelrz7A",
                        "https://cointelegraph.com/news/tokenized-real-estate-marketplace-launches-with-237m-in-assets",
                        "https://cointelegraph.com/news/morpher-labs-attempts-to-crack-knotty-prediction-market-problems",
                        "https://decrypt.co/16404/what-will-blockchain-look-like-in-2030-the-experts-speak",
                        "https://medium.com/security-token-group/security-token-market-industry-interviews-viktor-viktorov-ceo-co-founder-of-reinno-154496b1ea4e",
                        "https://youtu.be/lvtD-EPyR7c",
                        "https://etherscan.io/token/0x13e4ebac357d95e04b474ba7b555579df7607679",
                        "https://etherscan.io/token/0x677091e30C779181605d8F35c4D7244e0D2AC766",
                        "https://bitbucket.org/reinnodev/reinno-sc-public/src/master/",
                        "https://drive.google.com/file/d/19SqVVzXTfVjAQZnY0izL2k14VlcA-9Dq/view?usp=sharing",
                        "http://app.reinno.io",
                        "https://www.linkedin.com/company/reinno",
                        "https://twitter.com/reinno_io",
                        "https://www.reddit.com/r/REINNO/",
                        "https://drive.google.com/file/d/1QRPYksvz_njyVrflA-sVIP6GDAfg9jU2/view?usp=sharing",
                        "https://efdnasaa.org/Search?search=Reinno",
                        "https://forum.makerdao.com/t/mip13c3-sp10-a-real-estate-stablecoin-as-the-next-big-move-for-defi-joint-venture-with-reinno/6257",
                        "https://forum.makerdao.com/t/reinno-mip6-collateral-onboarding-application-old/3891",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-26-reinno-wednesday-february-3-18-00-utc/6242/2",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-26-reinno-wednesday-february-3-18-00-utc/6242",
                        "https://forum.makerdao.com/t/reinno-mip6-collateral-onboarding-application-old/3891/11",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/real-world-assets-strategy-for-2021/7570",
                        "https://forum.makerdao.com/t/rwa-report-2021-09/10423",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Token economics",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Community and engagement"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.61795236013986
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#2",
                    "likes": "3",
                    "time": "26/01/2021-11:24:26",
                    "content": "Hi @Viktor_REINNO, I have some questions:  How is CRE created? Your user interaction flowcharts do not show any assessment of the property, but      Viktor_REINNO:  REINNO performs an independent assessment of each property which is subject to tokenization and subsequently loan disbursement.   you still performs assessment. Could you maybe update the flowcharts so they represent a more detailed picture?     Viktor_REINNO:  An important data source is REINNO Oracle - an application that calculates the value of real estate behind the tokens. It provides an estimate of a property value based on its characteristics (e.g. year built, size, layout) and similar buildings in the neighborhood. This number is used to calculate the lending parameters. If the real asset has to be sold, the assessed value can be used to determine the minimum amount to be made on a sale.    Ouch. If collateral applicants would be allowed to have their own Oracle then Maker would be bent over a barrel by the first dishonest applicant. And that is not going to happen. So REINNO needs some firewall between itself and their oracle. This is of course easier said than done but I think you need to explain this? You operate both with a REINNO stablecoin and CRE. What are the differences?  Would it be possible for you to supply a fully worked out example with numbers? Step by step from start to finish? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.601190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Viktor_REINNO",
                    "index": "#3",
                    "likes": "4",
                    "time": "26/01/2021-15:09:33",
                    "content": "Hi @Planet_X, thank you for your questions.     Planet_X:  How is CRE created?   “CRE tokens” or “Commercial Real Estate tokens” is a general term for tokens created in the process of tokenizing commercial real estate. For instance, Boca Recovery Center listed on our marketplace is represented by DIXIE tokens, while Altitude Residential Portfolio is represented by ARMP tokens. Both DIXIE and ARMP are CRE tokens. As for the tokenization process, there are a few steps. We developed our tokenization solution with lending in mind. It is designed to be suitable for issuing loans instantly and keeping us and our liquidity providers protected. To tokenize a property, we execute due diligence and assessment (collecting and recording important data which we are using further in our Tokenized Instant Lending model). Then, transfer the property to an SPV. To make it eligible for lending, we secure the property with a UCC lien of the title. We issue digital shares on the SPV – tokens – that represent the property. If the client wants to sell the building, we prepare Reg D, offering memorandum, subscription agreement and shareholders agreement. Then, we can list the property on our marketplace. We are using a third-party escrow agent to protect our investors during the fundraise.     Planet_X:  Your user interaction flowcharts do not show any assessment of the property, but…   The initial property assessment is performed before the flowchart actions take place. In the flowchart, the user already has tokens representing commercial real estate in their account. The property assessment is performed during property onboarding. However, there is a check performed by the Oracle that is missing from the chart. It happens when CRE tokens are deposited. I will update the visual shortly.     Planet_X:  Ouch. If collateral applicants would be allowed to have their own Oracle then Maker would be bent over a barrel by the first dishonest applicant. And that is not going to happen. So REINNO needs some firewall between itself and their oracle. This is of course easier said than done but I think you need to explain this?   You are correct in principle, however the Reinno Oracle is used to price commercial real estate and trigger liquidations on CRE positions. This does not directly affect Maker, since Maker is dealing with the REINNO stablecoin and there can be an impartial Oracle for it. Obviously all those components are chained together, however if Maker treats the REINNO stablecoin as a regular coin (i.e. not stable), then the risk profile is exactly the same as any other collateral token and independent of REINNO’s price Oracle. Also, secondary markets can be used to check the price of CRE tokens (such as DIXIE) and REINNO stablecoin.     Planet_X:  You operate both with a REINNO stablecoin and CRE. What are the differences?   As mentioned earlier, “CRE tokens” is a general term, like “security tokens” or “digital assets”. All CRE tokens have different names and represent different properties (e.g. DIXIE for Boca Recovery Center). REINNO stablecoin, however, combines different CRE tokens (e.g. DIXIE, ARMP, etc). It is a bundle of multiple tokens representing tokenized real estate. REINNO stablecoin is what will be used as collateral for obtaining DAI instead of individual CRE tokens.     Planet_X:  Would it be possible for you to supply a fully worked out example with numbers? Step by step from start to finish?   Let me try. Our client has a medical building in Florida – Boca Recovery Center. He decides to tokenize it with REINNO. REINNO performs an assessment of the property and confirms that the property is worth $7M. REINNO also uses its real estate index to determine that this building falls under the A category. There are many reasons to classify it as A: medical businesses (and as a result – medical properties) are recession-proof, the property has a triple net (NNN) lease with nine years left, Florida is a great location for a recovery center, Boca’s cooperation with the government and insurance companies ensures constant flow of patients. These are just a few things taken into account. REINNO issues 7M tokens. Each token is worth $1 The token name is DIXIE; by definition, DIXIE is a CRE token. The client decides to sell Boca Recovery Center on REINNO’s marketplace. REINNO prepares the Reg D documentation, subscription agreement, and shareholders agreement; then lists Boca Recovery Center (DIXIE tokens) on the marketplace. Jack Pear is an investor who buys 3M DIXIE tokens on app.reinno.io/campaigns. He then decides to use 2M tokens as loan collateral and keep the other 1M of equity unlocked. Jack logs into our platform and goes to the Lending tab. He selects the token he wants to use as collateral – DIXIE, and inputs the number of tokens – 2M. The LTV is 70%. This is the final LTV Jack sees; it includes both REINNO’s and Maker’s collateralization ratios. Jack will receive 1,400,000 DAI. Jack selects when he wants the loan to mature – 3 years – and reviews the repayment plan. There he sees monthly interest payments (interest is calculated based on the grading and loan maturity date). Jack clicks “confirm”. This triggers the REINNO protocol. This paragraph is happening in the backend. When 2,000,000 DIXIE (CRE tokens) are deposited to the REINNO protocol, it checks the price of DIXIE (Boca Recovery Center) with the Oracle and returns 1,750,000 REINNO stablecoins (at 87.5%). These 1,750,000 REINNO stablecoins are then deposited to the Maker protocol. The Maker protocol returns 1,400,000 DAI (at 80%). These 1,400,000 DAI (70% of his initial 2M) are sent to Jack. Jack can see his repayment plan and his active loan in the “Loan History” at app.reinno.io. ",
                    "links": [
                        "http://app.reinno.io"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2771990740740735
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Viktor_REINNO",
                    "index": "#4",
                    "likes": "2",
                    "time": "28/01/2021-08:37:32",
                    "content": "Join us for a collateral onboarding call on  February 3rd! For more details: Collateral Onboarding Call #26: Reinno - Wednesday, February 3 18:00 UTC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Philinje",
                    "index": "#5",
                    "likes": "5",
                    "time": "28/01/2021-20:02:11",
                    "content": "Just want to add a few points based on review of the materials and initial discussion with three of the founders. First, the pitch deck is a bit buried in the post above but it is quite informative: Pitch deck Second, the token structure is not as clear as it could be, even given the discussion so far. The stablecoin, which I was told will have a name soon, will be a liquid token in a 3CRV pool, or possibly in Uniswap. There will be incentives for LPs and in general it will appear like a “normal” DeFi asset. This makes the oracle function less of an issue, I believe. The crypto side of their approach is relatively standard. Third, on the real world side, the oracle mentioned in the post is a way to automate valuation of real estate, a function that is important but very distinct from the Maker vault. In Centrifuge-based deals, Maker will evaluate the real estate underlying a loan portfolio and there is plenty of publicly available or third-party data to enable that. The REINNO model offers an enhancement: appraisals, or perhaps assessments, will happen regularly, which is not the case in normal mortgage underwriting (they happen once at the time of loan origination). Regardless, the Maker Risk team would continuously model and monitor the property values, despite and in addition to any automation by REINNO. Finally, the tokenization of real estate often suffers from an incomplete approach to securitization. Centrifuge “encapsulates” securitization with its unique approach and via a partner, but in this case REINNO has tackled securitization as part of their fundamental model, and provides “shareholder” management in a compliant manner as a sort of centralized service provider. The lending side of their approach addresses traditional finance sources as well as crypto sources and does both natively, meaning that the properties and investors must be managed in a traditional manner. It is also worth mentioning that in contrast to REITs, REINNO’s approach enables individual investor access to single properties, which is an enhancement compared to a managed fund approach. This creates a distinct positioning based on tokenization/blockchain, which is not unique to REINNO but something they seem to leverage well. Each property is addressed on its own merits, and their risk model steers clear of “black holes,” such as we have currently in some aspects of commercial real estate - namely, office buildings and malls. Just some initial thoughts. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.411309523809525
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Viktor_REINNO",
                    "index": "#6",
                    "likes": "2",
                    "time": "15/02/2021-15:42:41",
                    "content": "We would like to thank the community and the Maker Foundation for the feedback they have provided over the last few weeks – in the comments, on our collateral call and in private conversations. We are pleased to see how enthusiastic everyone is about the opportunity to bring commercial real estate to the Maker protocol. There are also some concerns about the implementation, which are all valid and important to us. We would like to emphasize that REINNO is always open to your suggestions and will consider implementing appropriate changes to better fit the needs of Maker, REINNO, and the overall DeFi ecosystem. As one of the leading tokenization companies, REINNO specializes in income-producing real estate. We have already tokenized $350M+ of commercial properties and have more clients who look forward to not only tokenizing their assets, but also using them for a loan. REINNO can bring these properties at scale and unlock a billion-dollar opportunity for Maker. If you have any questions or comments, please don’t hesitate to leave a comment in this application or reach out to us directly. We want to make sure that if REINNO’s application is approved, we go through with the best model possible. For that reason, we are listening closely to your feedback and are ready to make adjustments. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.227272727272728
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Estaetoken1",
                    "index": "#7",
                    "likes": "1",
                    "time": "26/02/2021-14:29:55",
                    "content": "I have a few questions, Was trying to see your smart contract and I see no activity on your contract listed above, when looking at your site I see only 6-8 clients. how do you intend to handle the lack of traction on your token and how are you going to create a valid market--   are you trying relying on The Maker community to kick start your project? You say you have completed 8 deals can you pls share the contract address of those deals so we can see the activity on the contracts and number of token holders.  On your site there is less then a day left on your Medical Boca Raton property and only 24% sold to 2 investors.I don’t see the use to have your token on Maker when you have no community to use it. from I what see on your site you are CEFI not DEFI and that worries me very much, I see this more as marketing stunt and noting else. I believe you are too young and premature to be on Maker. I truly hope the Maker community will not fall in being used as a marketing company and refuse this proposal until the applicant is more established. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.503174603174603
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CarlosMontoya",
                    "index": "#8",
                    "likes": "0",
                    "time": "26/02/2021-16:58:28",
                    "content": "I have been reading through this proposal and I am a little concerned that there hasn’t been more inquiries.  This is not All DeFi.  We have to careful or find ourselves at the center of serious legal problems. First, and unless I am mistaken, it seems you intend to use as collateral assets that are already mortgaged by a lending bank.  So they are in effect already used as collateral elsewhere.  Who are the guarantors of this 1st rank loan?  What are the claw back clauses?  Waterfalls and promotes?  These affect the value of the Collateral greatly.  If the bank calls back the loan and the owner can’t pay back, the bank is seizing the entire property.  Not Tokens of it.  In short,  how do you plan to use DeFI and a Lending bank both is very confusing and it seems fraught with additional risks and conflicts everywhere. Second, you say that you tokenised 300Million…. Ok.  But that is not the point is it?  The point is: have you sold those tokens, and to how MANY Token Holders? I echo the comment from Estatetoken1: we can see nothing from your smart contracts, which really should be the place where can see the entirety of the activity. Third, you speak about the SEC, but it seems to me that there is a compliance issue with the Tokens.  Your token is a Security Token, that is certain.  It has to be subject to KYC and AML and offerings.  I can’t imagine that the LENDERS are not subject to the same, or at least to some restrictions.  It would not be welcome if Maker was used to “lend” money originating from Bad Actors to US real estate assets.   How are you dealing with that? I think that there is much that needs to be addressed before this proposal can pass.  I absolutely love the concept, but I don’t want to see Maker being at the center of a regulatory scandal over a hasty approval. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.216313244047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#9",
                    "likes": "4",
                    "time": "26/02/2021-17:58:08",
                    "content": "@Estaetoken1 @CarlosMontoya, not sure where you guys are from, but this already looks suspiciously like brigading. If you want to be a part of this community, then great, you’re more than welcome. Accounts created for the sole purpose of responding to a single thread and pushing a single side of an issue will be viewed with suspicion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.219387755102041
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CarlosMontoya",
                    "index": "#10",
                    "likes": "0",
                    "time": "26/02/2021-18:10:59",
                    "content": "Understood.  I had no intent to push a single side of the issue.  As I said, I do love the concept.  Quite frankly, when I saw @estaetoken1 reply, that’s when a multitude of questions started to pop in my mind.  Regardless of the perception of my message, it’s intent is only to raise issues that I don’t think were well understood or at the very least mentioned.  IMHO, I think that they just might be quite important.  I will return to my “lurking” mode and no longer add to this thread.  Again, I have full admiration for Maker and I do love the concept of Reinno. Cheers ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.920408163265306
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#11",
                    "likes": "0",
                    "time": "26/02/2021-18:25:48",
                    "content": "Great. You’re more than welcome to give input, it’s just that in the past collateral application threads have seen a fair bit of negative behaviour. Perhaps I jumped the gun a little, though. Please feel free to contribute more widely on the forum, no need to go back to lurking. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.301136363636363
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Estaetoken1",
                    "index": "#12",
                    "likes": "0",
                    "time": "26/02/2021-22:05:43",
                    "content": "I’m very sorry if you have seen my interventions as negative. Nevertheless, the facts remain that while Reinno is a great concept, as of today they have absolutely no traction, and no transactions on their contract.  None.  On their own site, they show a result as of today of 7-8 clients with the most sold of 24%.  It won’t be the 1st project hoping to get a boost  from the Maker community. It is even more concerning because it is a Security Token and any advertising / solicitation can have a dangerous ripple effect on Maker (and give bad press to the entire DeFi space) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.025
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Viktor_REINNO",
                    "index": "#13",
                    "likes": "3",
                    "time": "27/02/2021-02:49:55",
                    "content": "Hi @Estaetoken1 and @CarlosMontoya. First of all, welcome, we hope you are having a great first day on the forum! Thank you for taking you time to go over REINNO’s application. Just like you, we are passionate about DeFi, security tokens and Maker’s success. We would like to clarify a few things. As you mentioned, there are 6-8 big clients on the marketplace who committed over $11M for tokenized real estate. This is already $11M that can be used as collateral. Moreover, a big portion of our lending clients is not coming from the marketplace. We work directly with commercial property owners who are not looking to sell their assets, but rather would like to use them for borrowing money. For instance, we are currently underwriting two loans (backed by two properties) for a client for a total of $12M. These tokens are not on the REINNO marketplace, as they have a different purpose. Similarly, one of our first tokenization projects, the $2.5M building in Connecticut was never intended for sale – the owner only wanted to use his tokens for a loan. Therefore, we have plenty of tokenized real estate to bring to Maker. When it comes to CeFi/DeFi, that’s a great topic for a long discussion. The progress that’s being made in the DeFi space is absolutely incredible. However, many people have been talking about bringing real-world assets to DeFi protocols, such as Maker. Unfortunately, because of the nature of real-world assets, there needs to be someone onboarding them on-chain, enabling initial valuations and creating the infrastructure. REINNO is always looking for ways to make our setup more decentralized, to give more power and freedom to investors and liquidity providers. The DeFi space keeps changing, and REINNO keeps improving. We believe that onboarding REINNO’s tokenized real estate as collateral for Maker can be a great first step for the greater goal of marrying DeFi and real estate. We are providing loans that are senior debt. Therefore, REINNO and its liquidity providers will always be prioritised in case of a borrower’s bankruptcy. If there is a pre-existing mortgage, it is replaced immediately by REINNO loans and the properties become free and clear. We have worked really hard to develop a proprietary legal setup. Now we are able to provide loans backed by tokenized CRE and keep us and our liquidity providers protected. Even with tokenization, we only consider projects that we would not hesitate to accept as collateral. REINNO is 100% compliant, and you can see the initial investment filings with SEC for the first $11m invested in the link below: https://efdnasaa.org/Search?search=Reinno. We have all KYC, AML, and accreditation checks in place. We’ve researched the topic thoroughly with our legal team and we keep cooperating on the KYC and AML efforts with our Escrow provider. We are also ensuring that no tokens are resold during the one-year lockup period, which is prohibited by the SEC under Reg D. This is another great use case for loans, as it allows investors to gain liquidity. We are also quite careful with our advertising and follow SEC’s solicitation rules. Maker will never be affected by any solicitation-related issues since Maker is not involved in the sale. We are happy to hear that you like the concept and hope that this addresses your concerns. If you would like to have a further discussion and contribute to bringing real-world assets to DeFi, we would like to invite you to a Zoom call where we could have a deeper conversation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.032738095238096
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#14",
                    "likes": "0",
                    "time": "02/05/2022-04:47:28",
                    "content": "Dear @Viktor_REINNO, The process for MIP6 applications for off-chain collateral, so called real-wold assets, has been under significant review by the teams involved in collateral onboarding (RWF, CES, Growth and incubating LTS and LOVE). See more for collateral onboarding process. The goal of this process update is to provide MKR tokenholders and respective delegates a comprehensive view of MIP6-RWA applications from a credit, legal and technology perspective so tokenholders can make a more informed decision before moving applications through the execution of the onboarding process after greenlight. As part of this review, MIP67 and the underlying Methodology for structured finance transactions were written to provide applicants with a more comprehensive set of guidelines and requirements so MIP6 applications are fit for purpose and closer to a state where they could be executed, if prioritised by tokenholders during polls. MIP67 is now part of the MIP6 process. It is designed to fill the gaps in the MIP6 application for RWAs. Our domain team is aligned to the approved MIP67 process and Methodology. We are asking MIP6-RWA applicants to express whether they will retrofit their MIP6 applications in line with MIP67/Methodology guidelines. We ask applicants to express their intention by Mon 9 May at 12pm UTC. The collateral application template is located here: MIPs Portal. Status of MIP6 applications that do not express their interest by 9 May will be considered “withdrawn” from a MIP6 collateral onboarding point of view by the aforementioned Core Units and reflected in the CSI. We understand that once applicants express their intentions, there will be a period for drafting and updating documentation of the newly proposed MIP6 applications. Our teams will be available to provide guidance to applicants during this time. Kind regards, William. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip67-methodology-and-review-process-for-structured-finance-transactions/13737",
                        "https://forum.makerdao.com/t/methodology-for-review-of-mip6-structured-finance-transactions/12697",
                        "https://vote.makerdao.com/polling/QmWt5fov#vote-breakdown",
                        "https://mips.makerdao.com/mips/details/MIP6#component-summary",
                        "https://docs.google.com/spreadsheets/d/1PDf_CzhGa7mLuOUfX6Bz3WrnCjDRhIjmu-vDZMMw4Qc/edit#gid=1077340672"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.713068181818182
                }
            ]
        }
    ],
    "group_index": "3202"
}