{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/wanted-senior-full-stack-web2-web3-developer/19309",
            "title": "Wanted: Senior full-stack web2<>web3 developer ",
            "index": 19309,
            "category": [
                "Resources",
                "Job Opportunities"
            ],
            "tags": [
                "dux-001",
                "hiring"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#1",
                    "likes": "11",
                    "time": "04/01/2023-11:53:25",
                    "content": "DUX Core Unit is looking for a full-stack web2<>web3 developer to join the team. This is a fulltime position for at least one year. Ideal starting date is February 1st, but this is negotiable.   NOTE: We are no longer accepting applications. Thank you!    What we are looking for  We are seeking a skilled and experienced full-stack web developer to collaborate closely with the rest of the team on a challenging new project using pioneering web technologies. The ideal candidate will have a wide range of experience with web2<>web3, web/mobile development, and automated testing, as well as a strong background in React, Typescript, and CSS. The ideal candidate will also be passionate about crypto and DeFi, with a good amount of relevant knowledge in these areas (web3, ethers.js). You will stand out if you have a keen eye for design and some experience with The Graph, SQL, GraphQL, and/or Solidity. As this is a fully remote and async position with no direct hierarchy, we need someone who’s a good collaborator, a true self-starter, and comfortable working independently. We are open to candidates in EU or USA timezones. We prefer someone with previous remote work experience. If you meet these qualifications and are excited about the opportunity to work on a pioneering project for MakerDAO, together with a tightly-knit team without a direct hierarchy, we encourage you to apply!   Job Requirements   5+ years of experience as engineer Wide range of experience with web2<>web3, web/mobile, and automated testing Comfortable and experienced working with React, Typescript, CSS Appreciation for testing and experience with automating testing processes Passionate about crypto and DeFi, with a good amount of relevant knowledge Self-starter and able to work fully remote and async In EU or USA timezones    You will stand out if   You have experience working with The Graph, GraphQL and/or Solidity You have previous remote work experience Have an eye for design You’re opportunistic and prefer upside and freedom over stability    What we offer   An opportunity to work in a small team of experienced and passionate engineers in a highly flexible working dynamic (we dislike calls and strive to minimize them) Competitive compensation denominated in USD Flexible payment options: Get paid in the DAI stablecoin or receive your native currency in your bank account without fees A competitive crypto bonus in MKR if you stay for one year Flexible PTO arrangement Remote working environment with a high degree of freedom Three AWESOME (fully paid) offsites per year to meet up with the team and attend Ethereum conferences (recent destinations were Lisbon, Denver and Colombia)  ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.279132231404959
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Cheslav_Zhuravsky",
                    "index": "#2",
                    "likes": "0",
                    "time": "19/01/2023-09:34:14",
                    "content": "Hey @0xdeniz , I am dev you are looking for  Also looking for good web3 project now, you can check my LinkedIn and lets talk;) https://www.linkedin.com/in/cheslav-zhuravsky ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#3",
                    "likes": "0",
                    "time": "19/01/2023-09:59:54",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}