{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/announcing-phoenix-labs-and-spark-protocol/19731",
            "title": "Announcing Phoenix Labs and Spark Protocol ",
            "index": 19731,
            "category": [
                "Governance"
            ],
            "tags": [
                "highlight-announcement",
                "endgame"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PhoenixLabs",
                    "index": "#1",
                    "likes": "28",
                    "time": "08/02/2023-16:56:27",
                    "content": " TL;DR The team formerly known as Crimson Cluster is announcing the launch of Phoenix Labs, an R&D company building the Spark Protocol. Phoenix Labs is focused on vertically integrating existing products into Maker and sharing the value creation with developers. Spark Protocol is a front-end for interacting with DAI. At launch, the first offering will be Spark Lend (SL), a lending market focused on the most liquid, decentralized, and highest market cap assets. Currently planned future releases will include resilient oracles and fixed rates.  1. Our Purpose A rising tide lifts all boats. Maker was one of the first DeFi protocols to build and establish itself in the space… Back in 2015/7, Maker had to overcome a lot of challenges. Nothing had been built before so not only did the early team build a stablecoin protocol but also had to build an oracle protocol (now Chronicle Labs), a DEX protocol (now Oasis.app), voting contracts, multicall and a plethora of awesome open source tooling. Maker developed a culture of building in-house out of necessity in response to a lack of a mature ecosystem. Since then the ecosystem has grown and flourished; great and innovative models have been brought into existence from DEXs, lending, oracles, streaming, abstractions, structured product, and more. The Endgame Plan will bring significant structural changes to both Maker Protocol and MakerDAO that will ensure we continue to scale while ensuring maximum resilience. That’s why we decided to create Phoenix Labs to support this new phase of growth and innovation by looking outwards and challenging our culture of building in-house because only together can we achieve greatness. We want to bring new decentralized products to Maker and start building for the future Creator subDAOs. Phoenix Labs will accelerate Maker development time by integrating solutions developed by the top DeFi developers in the ecosystem, bringing innovative ways to interact with the Maker Protocol.  2. Phoenix Labs Phoenix Labs is a research and development company created to introduce new decentralized products into the Maker Ecosystem. Our mission is to help MakerDAO grow and innovate in the decentralized realm. MakerDAO will own every product that Phoenix Labs creates; therefore, they will inherit Maker’s already well-established governance system. Maker Governance will administer all smart contracts with polls to adjust system parameters and add new collateral. Once the Creator subDAO model is established, Spark Protocol can be transitioned to one of them.  Our values   Value Sharing: Phoenix Labs is committed to building a healthy and sustainable developer ecosystem through value sharing models such as retroactive payment for public goods.  Plug and Play Model: Phoenix Labs plans to make all code open, owned by MakerDAO, and available for use by other teams under a revenue share agreement using the “Plug and Play” model of the Endgame proposal. It is one of our goals to provide a core toolbox that other subDAOs or Ecosystem Actors to build upon.  Continuous Innovation: Phoenix Labs wants to help Maker consolidate its position as the DeFi leading platform by integrating new and exciting solutions including everything Endgame will bring.  DAI-centric: Everything Phoenix Labs will build will have DAI as the centerpiece.   The Founding team Sam - Technical, @hexonaut Nadia - Operations, @Nadia Tadeo - Dev. Relations, @tadeo  3. Spark Protocol Phoenix Labs’ first solution is the Spark Protocol. This protocol will amplify the features of MakerDAO by enabling a liquidity market for supplying and borrowing scalable crypto assets with variable and fixed rates, supporting EtherDAI, and implementing the first resilient oracles to improve Maker’s strength. Spark Protocol will evolve over time, adding new features to the front end by integrating Maker’s products as they are available and the most innovative DeFi solutions in the space. The first product is Spark Lend, a lending market with a front end that will integrate Maker’s D3M and the PSM. After launching Spark Lend, Phoenix Labs aims to continue delivering new products and features. The ones included in the 2023 roadmap are Spark Fixed Rates, Resilient Oracles, cross-chain support, Maker teleport support, and bootstrapping of EtherDAI.  Roadmap1422×716 87.6 KB   Spark Lend (SL) Spark Lend (SL)’s D3M is the main differentiator from existing lending protocols. Maker has the cheapest credit in DeFi because there is no requirement for third-party liquidity providers. Because of this, SL will launch by allowing anyone to borrow DAI at the Dai Savings Rate (DSR), as stated in the Stability and Liquidity Scope Framework. This will be the best rate available in DeFi combined with all the killer features such as cross-margin, short positions, high leverage, and many more. Spark Lend will focus on scalable types of collateral that are highly liquid. SL will not compete with markets that offer “tail assets”. By focusing on highly liquid, decentralized assets with large market caps, SL will aim to be the most secure platform in all of DeFi. SL will support the following markets on launch:  DAI ETH [E-Mode Enabled] Lido wstETH [E-Mode Enabled] WBTC Savings DAI (DSR-locked DAI) [Collateral Only]  By including a tokenized Savings DAI and providing easy access to the 1:1 USDC PSM swap, users will be able to enter and exit the DSR from a single UI. Simple additions like this will help provide retail users access to the Dai Savings Rate from USDC. Something that currently does not exist in any UI. Screenshots:  3362×1996 415 KB   3364×1994 225 KB   3362×1996 308 KB   3358×1994 330 KB   3360×1996 326 KB   3358×2000 446 KB   Spark Fixed Rates (SFR) A critical piece that needs to be added to DeFi is fixed rates that work in a capital-efficient way. Spark Protocol plans to partner with fixed rate protocols such as Deco, Sense Finance and Element Finance to deliver this feature by the second half of 2023. These protocols have already done all the heavy lifting - Phoenix Labs will simply plug Spark Protocol into them. Two protocols Phoenix Labs are currently evaluating are: Element Finance’s Hyperdrive offers fixed rates as part of a variable/fixed market with no preset expiration dates and no fragmented liquidity between terms. You can read more details in Element’s blog. Sense Protocol, a permissionless fixed-income protocol that enables fixed rates and future yield trading atop existing yield-bearing assets. With Space, a capital-efficient fixed-rate AMM, and Rolling Liquidity Vaults (RLVs), Sense offers flexible infrastructure for offering fixed rates for Spark Lend users. You can read more about their protocol here.  SFR5773×2337 548 KB  Spark Protocol can onboard the PT token associated with either protocol with an e-mode attached to the DAI/sDAI markets to allow high leverage (~20x). This enables speculators/arbitrageurs to create a liquid market price on interest rates in a capital-efficient way. Phoenix Labs expects initial versions of this to roll out in Q2/Q3 2023. The above two are built for Spark Protocol, but Phoenix Labs will also evaluate using Deco’s Fixed Rate product when it becomes available for Maker Core.  Bootstrap EtherDAI  EtherDAI3600×3121 480 KB  EtherDAI has been approved as part of the Endgame plan. The above diagram illustrates a way to deploy EtherDAI using only the basic Maker contracts and using Spark Lend for the liquidity market. EtherDAI to ETH can be thought of in the exact same way as DAI to USD. There is a 1:1 pegged version called EtherDAI (DAI) and a yield-bearing version called sEtherDAI (sDAI). The PSMs for EtherDAI are other derivatives (possibly yield-bearing) or the underlying asset of ETH. This is similar to how the original MCD has PSMs for USDC and USD derivatives (some yield-bearing such as GUSD/MIP65/etc). Most of the complexity of the Multi-Collateral DAI (MCD) system comes from Global Settlement and Vaults/Liquidations. Although both of these systems are important for long-term security, Maker can deploy a stripped-down version much quicker and upgrade to the full version afterward. This will help us to capture market share in the rapidly growing Liquid Staking Derivatives (LSD) market. Besides minor changes, deploying this version of EtherDAI will only require existing contracts so that Maker can move on this quickly. Now that staked ETH withdrawals are being activated Phoenix Labs feel this is the right time to move on LSDs. To assist with building demand, Maker can also provide a subsidy (MKR or DAI) to the EtherDAI market via built-in liquidity mining support.  Oracle Improvement Research Spark Protocol is investigating improvements to existing oracle designs with redundant feeds of Chronicle (prev. Maker Oracles) and Chainlink. With redundant oracle networks as sources, Spark Protocol can withstand one of the networks being completely compromised and still operate. Spark Protocol will launch with Chainlink oracles with plans to upgrade later in the year. To achieve this, Spark Protocol is exploring adding several circuit-breakers to each feed. Circuit-breakers such as comparing to DEX prices, signed prices and flash crashes.  RO3117×1323 286 KB   ROF3117×1323 310 KB   Cross-Chain Support Phoenix Labs is committed to expanding the DAI ecosystem cross-chain. Spark Protocol will be deployed on L2s and side chains to meet user demand. First-class integration of Maker Teleport will enable users to interact with the front end in a way that abstracts the underlying blockchain.  4. Technical Details You can find all the technical details in the proposed D3M MIP. This will cover things such as debt ceilings, rates, etc on the Maker side. Spark Lend builds upon Aave V3 In exchange for all the hard work done at AaveDAO, Spark Protocol will send 10% of the profits earned on the DAI market for the next two years. A proposal to share the profit has been created on the Aave forum -Pending approval from Aave Governance-.  5. Financial Details Revenue generation At the start Spark Protocol will generate revenue via its borrowing and lending market mainly through variable-rate loans. At a later stage fixed rate loans and other adjacent revenue streams will be added. As a result, the main factors driving protocol revenue at the beginning include:  Variety of pools offered TVL - driven by general price levels through market cycles and overall market demand Utilization rates Interest rate curves  Scenario Analysis The following scenario analysis shall provide rough guidance to what adoption and corresponding profits Spark Protocol could achieve once properly ratified and funded with initial start up capital. General assumptions used are outlined below. Offered markets:  DAI ETH [E-Mode Enabled] Lido wstETH [E-Mode Enabled] WBTC Savings DAI (DSR-locked DAI) [Collateral Only]  Base Case  TVL: mid, TVLs of markets reach 50% of current relevant Secondary Market levels Utilization rates: mid, below optimal levels  Bear Case / protocol start  TVL: low, only reaching initial debt ceiling for DAI market and small TVL for other relevant pools Utilization rates: low, far below optimal levels  Bull Case / fully operational  TVL: high, reaching levels of previous bull market Utilization rates: high, at optimal levels  Based on these scenarios Spark Protocol could generate annual protocol profits (after funding costs) as per below while simultaneously generating high returns for MakerDAO as the sole supplier of DAI on the protocol. Spark Protocol profit  SPP699×80 3.06 KB  Revenue MakerDAO  RevMD709×90 2.86 KB  ",
                    "links": [
                        "https://forum.makerdao.com/t/mip103-the-stability-and-liquidity-scope-framework/19675",
                        "https://forum.makerdao.com/t/fixed-rate-vaults-proposal-with-deco-protocol/9707",
                        "https://sense.finance/",
                        "https://www.element.fi/",
                        "https://hyperdrive.element.fi/",
                        "https://blog.element.fi/spark-into-defi-hyperdrive/",
                        "https://docs.sense.finance/docs/space-pool-performance/#the-big-picture",
                        "https://medium.com/sensefinance/rolling-liquidity-vaults-are-live-67dd7475923c",
                        "https://docs.sense.finance/",
                        "https://twitter.com/chroniclelabs",
                        "https://chain.link/",
                        "https://forum.makerdao.com/t/mipxxx-d3m-to-spark-lend/19732",
                        "https://governance.aave.com/t/arc-spark-lend-profit-share-proposal/11615",
                        "https://forum.makerdao.com/t/mip55c3-sp15-phoenix-labs-initial-funding-spf/19733",
                        "https://forum.makerdao.com/t/the-team-thats-bringing-spark-back-to-maker-spark-me-up-on-drinks-w-makerdao-delegates/19776",
                        "https://forum.makerdao.com/t/4-boletin-de-noticias-febrero-de-2023/20078",
                        "https://forum.makerdao.com/t/request-for-proposals-for-a-on-chain-rwa-monitoring-solution/19535/37",
                        "https://forum.makerdao.com/t/frontier-research-delegate-platform/17298/46",
                        "https://forum.makerdao.com/t/governance-and-risk-call-226-thursday-february-16-2023-17-00-utc/19831"
                    ],
                    "GPT-summary": "The post announces the launch of Phoenix Labs, an R&D company building the Spark Protocol, which is a front-end for interacting with DAI. The post explains the purpose of Phoenix Labs, its values, and its first solution, the Spark Protocol. It also provides technical and financial details, including a scenario analysis of the potential profits of the protocol. The post does not contain any negative feedback or questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.657723710888268
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/02/2023-17:24:35",
                    "content": "Ok, several questions and please don’t take it personally.     PhoenixLabs:  The Founding team Sam - CTO, @hexonaut Nadia - COO, @Nadia Armin - CFO, @armin Tadeo - CDevRel @tadeo   So for CUs they are part of or even facilitators of, I understand some will be dissolved but maybe share more info about if this gets approved, what would happen to such? If you are not leaving such CU, then is the salary coming from both organizations?     PhoenixLabs:  Because of this, SL will launch by allowing anyone to borrow DAI at the Dai Savings Rate (DSR) plus 10%, as stated in the Stability and Liquidity Scope Framework. This will be the best rate available in DeFi   Doesn’t this cannibalize Maker’s own vault and also stability fee?     PhoenixLabs:  The above two are built for Spark Protocol, but Phoenix Labs will also evaluate using Deco’s Fixed Rate product when it becomes available for Maker Core.   If above two are already built, doesn’t it make sense for Maker to focus on those two rather than spending extra at DECO which is still building with likely later timeline compared to above?     PhoenixLabs:  Spark Protocol is investigating improvements to existing oracle designs with redundant feeds of Chronicle (prev. Maker Oracles) and Chainlink. With redundant oracle networks as sources, Spark Protocol can withstand one of the networks being completely compromised and still operate. Spark Protocol will launch with Chainlink oracles with plans to upgrade later in the year.   Considering both oracle setups have been costly in terms of gas, is this set up different from using own gas fee? if it is, wouldn’t it be quite costly.     PhoenixLabs:  Spark Protocol profit  Revenue MakerDAO    If it’s current DSR + 10% and assuming all the fees goes to Maker (instead to spark protocol), we are assuming  $8.4 billion which is bigger than Maker whole TVL including billions of stablecoin collateral. For Base Case, it’s $1.5 billion which is close to double of ETH TVL Maker holds. edit: asked about budget but found in other parts ",
                    "links": [
                        "https://twitter.com/chroniclelabs",
                        "https://chain.link/"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.530172413793103
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#3",
                    "likes": "7",
                    "time": "08/02/2023-17:34:58",
                    "content": "Excellent and much-needed proposal. I would love to see more products under this brand. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.333333333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "1",
                    "time": "08/02/2023-17:50:37",
                    "content": "But bear case one is pretty fair actually ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#5",
                    "likes": "5",
                    "time": "09/02/2023-09:08:39",
                    "content": "Bullish  Good luck to this all-star team, and kudos for the Tweet thread (which is arguably the clearest one on Endgame to date) ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/funkmasterflex",
                    "index": "#7",
                    "likes": "2",
                    "time": "09/02/2023-18:27:20",
                    "content": "Hi Phoenix Labs. I lead DeFi Partnerships at Index Coop. Our team was incredibly excited to see the launch of Spark Protocol. We were hoping to chat with the team @hexonaut @tadeo to discuss ways in which we can integrate some of our products and continue building new products with DAI. Would be great to connect on telegram @ funkmasterflex ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 7.185606060606061
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "6",
                    "time": "09/02/2023-20:00:05",
                    "content": "After reading more and discussing with more planners around the proposal, we also think it can introduce various development of Maker ecosystem, and it is also more cost effective way and collaborative than trying to build everything from ground up which was for better or worse, mantra of early Maker days. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 6.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/deco-cu",
                    "index": "#9",
                    "likes": "0",
                    "time": "10/02/2023-04:52:10",
                    "content": "    Doo_StableLab:  If above two are already built, doesn’t it make sense for Maker to focus on those two rather than spending extra at DECO which is still building with likely later timeline compared to above?   Fixed-Rate is an Adjective That Needs a Noun. It seems there may be some confusion between a “fixed-rate stability fee” and “fixed-rate savings rate.” A “fixed-rate savings rate” can be achieved by splitting the yield component from savings Dai. This is the implementation Spark mentions in its post. The Deco Protocol, Sense, and Element can decompose a yield token into its principal and yield components. The target user for this model is DAI users. In this use case, Spark uses Maker to supply leverage to traders through third party protocols interested in betting on a fixed-rate savings rate. Maker holds the leverage here (no pun intended). Members of the Deco CU were the first in the industry to pioneer this splitting design. We are happy to offer our expertise (and the Deco protocol) to Spark. To date, the “fixed-rate stability fee” was the sole focus of the Deco CU, building Claim-Fee, not the product described above. The “fixed rate” competitors for a fixed-rate stability fee are not “already built”, nor are they Sense or Element. Rather, it would be protocols like Yield or Notional. In order to integrate with these protocols, Maker had been poised to migrate both its own collateral from vaults and provide the liquidity needed in Dai. In short, it was not a great deal. In this scenario, Maker bears all the risk while losing TVL, Users (Vaults), and Revenue. This arrangement was for the benefit of Yield, and hence, why Yield brought the proposal to Maker at no cost. Deco saw the low ROI of these fixed-rate stability fee propositions. It took the opportunity to return value to MakerDAO and MKR holders by inventing a novel solution for Maker to offer its own native \"fixed-rate stability fee”. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.65625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#11",
                    "likes": "0",
                    "time": "10/02/2023-05:59:24",
                    "content": "    deco-cu:  confusion between a “fixed-rate stability fee” and “fixed-rate savings rate.”   That’s true. Thanks for clarifying. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#12",
                    "likes": "5",
                    "time": "10/02/2023-13:26:35",
                    "content": "This is incorrect. Spark Protocol will be offering a fixed borrow rate as can be seen in the diagram. Users borrow DAI-PTs from Spark Lend and sell them for a discount to DAI and this locks in a fixed borrow rate for the term. IE you sell 100 PTs under a 1 year term for 98 DAI then you have effectively paid 2% interest up-front. Phoenix Labs along with our partners plan to ship this by end of July and are happy to add Deco if/when it becomes available as well for Maker Core vaults. Phoenix Labs’ only interest is to deliver the best possible user experience. Whichever partner can provide this we will work with. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/BXSWSSMBDX",
                    "index": "#13",
                    "likes": "0",
                    "time": "10/02/2023-20:56:26",
                    "content": "Thank you very much for your inspirations. Looking forward to your cross-chain road!     PhoenixLabs:  resilient oracles   Can  you avoid the need for trusted oracles and bridges ，do so in a trustless manner? Best wishes! ",
                    "links": [
                        "https://wiki.internetcomputer.org/wiki/Canister_smart_contract"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 8.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#14",
                    "likes": "0",
                    "time": "13/02/2023-22:06:48",
                    "content": "Hi @PhoenixLabs, this is exciting! Will there be a structured process for proposing new decentralized asset markets, possibly similar to Aave’s new asset process? My team would like to start that process for an additional stablecoin, assuming this proposal passes governance approval. cc @hexonaut ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.809659090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/GFXlabs",
                    "index": "#15",
                    "likes": "0",
                    "time": "21/02/2023-17:59:19",
                    "content": "    PhoenixLabs:  Spark Protocol will send 10% of the profits earned on the DAI market for the next two years.   Would you be willing to retract that proposal over on Aave’s forum to get support for these proposals? Maker would be taking all of the risk and paying for the start up costs to create a competitor to Aave. It seems like paying Aave with profits that belong to Maker governance should not have already been communicated to Aave’s community. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PhoenixLabs",
                    "index": "#16",
                    "likes": "1",
                    "time": "22/02/2023-18:11:17",
                    "content": "    Doo_StableLab:  So for CUs they are part of or even facilitators of, I understand some will be dissolved but maybe share more info about if this gets approved, what would happen to such? If you are not leaving such CU, then is the salary coming from both organizations?   CU members will wait for directions provided by the Ecosystem Scope to initiate any transition. Until then, CU members are committed to their work at their respective CUs. As explained in the SPF, Phoenix Labs wants to use all available CU resources to launch the product (including the salaries for CU members). Because of the defined timeframe to launch SL, we decided to use an SPF to ask for the extra resources needed for the launch (Phonenix Labs considers launching Spark Lend (SL) as a way to give Maker a competitive advantage in the market). Still, we expect that the Ecosystem Scope provides a clear framework for the use of the DAO resources and with that in mind, being able to continue with the launch of other products as stated in the roadmap. In the meantime, due to the launching date, Derek has launched two polls asking Governance about shared resources between Phoenix Labs and PECU.     Doo_StableLab:  Doesn’t this cannibalize Maker’s own vault and also stability fee?   Phoenix Labs considers that SL is a different product with a different risk profile than Maker Vaults. Because of that, there’s no competition and SL will serve Maker and the Endgame with the objective of attracting more of the decentralized collateral as possible. Still, as stated in the paragraph you are quoting, SL must follow all definitions inside the Stability and Liquidity Scope.     Doo_StableLab:  If above two are already built, doesn’t it make sense for Maker to focus on those two rather than spending extra at DECO which is still building with likely later timeline compared to above?   Phoenix Labs is focused on integrating the best-in-class solutions that help Maker. Because of that, we will be continuously evaluating and talking with teams to find the best fit for Spark Protocol and Maker.     Doo_StableLab:  Considering both oracle setups have been costly in terms of gas, is this set up different from using own gas fee? if it is, wouldn’t it be quite costly.   Phoenix Labs’ goal is to build the most robust security system possible. SL launch will include  Chainlink oracles, allowing us to launch quickly as Aave v3 is already integrated with them. Looking into the near future, we will engage with Chronicle to improve the security model by introducing redundancy into the SL system. As mentioned in the roadmap, this feature is not included in the deliverables for the current SPF.     Doo_StableLab:  After reading more and discussing with more planners around the proposal, we also think it can introduce various development of Maker ecosystem, and it is also more cost effective way and collaborative than trying to build everything from ground up which was for better or worse, mantra of early Maker days.   Thanks Doo, appreciate your kind words. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.021825396825396
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PhoenixLabs",
                    "index": "#17",
                    "likes": "1",
                    "time": "22/02/2023-18:14:17",
                    "content": "Thanks @funkmasterflex . This announcement is under discussion by Maker Governance. If approved, we will contact you to discuss possible integrations. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PhoenixLabs",
                    "index": "#18",
                    "likes": "1",
                    "time": "22/02/2023-18:14:41",
                    "content": "As stated in the proposal, if approved, SL will launch and scale the aforementioned assets, for the time being, focusing on improving the feature offering. After the launch, we’ll look at creating a solid process to onboard decentralized collaterals to the platform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PhoenixLabs",
                    "index": "#19",
                    "likes": "2",
                    "time": "22/02/2023-18:23:56",
                    "content": "We think it’s fair to pay Aave for the code they built, and by doing it, setting a good precedent in the ecosystem. If you think Maker shouldn’t do it and MKR holders agree with you, we are open to revise the proposal ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 7.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/pete",
                    "index": "#20",
                    "likes": "0",
                    "time": "22/02/2023-18:32:27",
                    "content": "    PhoenixLabs:  After the launch, we’ll look at creating a solid process to onboard decentralized collaterals to the platform.   Thank you, this answers my question. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#21",
                    "likes": "6",
                    "time": "26/02/2023-20:29:03",
                    "content": "Risk has posted initial feedback on the Spark proposals in the D3M MIP thread:     MIP116: D3M to Spark Lend RFC   Spark Feedback Below is the Risk CU’s initial feedback on the Spark Lend protocol mechanisms and proposed D3M. We are generally very positive on Spark Lend and look forward to supporting its launch and further development. Below comments are intended to improve long term scalability and alignment of the Spark<>Maker core relationship, ensuring that the protocol has the greatest possible opportunity for success.  Comments are split into a few sections:   Spark Risk Parameters Maker D3M Parameter…     We’ll provide additional feedback and full risk assessments as Spark Lend and associated proposals progress. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-february-2023/20011"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.884297520661157
                }
            ]
        }
    ]
}