{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/usdc-could-destroy-defi/4166",
            "title": "USDC could destroy DeFi? ",
            "index": 4166,
            "category": [
                "Collateral Onboarding"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Matteo_Gelli",
                    "index": "#1",
                    "likes": "2",
                    "time": "15/09/2020-10:25:55",
                    "content": "Since the collateral level of USDC has reached percentage over 20% of the total assets which collateralize Vaults, a big question come to my mind: what will happen to DAI ecosystem if a US law will freeze all (or a part of these) USDC included in the Vaults? Consider that is something already happen in the past (Circle Confirms Freezing $100K in USDC at Law Enforcement's Request - CoinDesk). Hoping that US Attorney for the Southern District of New York doesn’t keep an eye on this, although everything will come to an end. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.886363636363637
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/09/2020-11:23:50",
                    "content": "It’s not so easy to freeze all USDC collateral overnight but it is a valid concern. DAI backed by USDC is partially unbacked DAI. We had a few discussions what the limit for centralized collateral should be but I think we haven’t reached the conclusion. The risk premium for stablecoins today does not reflect the real risk. Since the legislation around stablecoins is becoming more and more restrictive, the risk premium for stablecoins should automatically increase by i.e. 1% every month regardless of the peg. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.273809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "1",
                    "time": "15/09/2020-20:27:54",
                    "content": "This is a concern since the beginning when we first added USDC-A during days after Black Thursday. I think better question becomes what happens if 25-50% of all USDC is deposited into Maker and starts hurting USDC liquidity.   I honestly have to think this is good for centre btw since they can take the USD deposited and converted to USDC and earn interest on it. BUT this is and has been a concern.   I would add that given I have a USDC vault I would be one joining in a lawsuit against centre and the government for freezing my lawfully obtained USDC there.  It would be a hell of a case at 200-500M btw. They would do better simply by issuing some sort of warning with guidance on what is acceptable use than to just hammer down on 20% of the USDC liquidity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.237654320987654
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "1",
                    "time": "15/09/2020-20:53:00",
                    "content": "Fortunately for DeFi, Jeremy Allaire, Brian Armstrong, Roham Gharegozlou, Tim Draper, etc., have friends in high places, where the whiskey drowns, and the beer chases the USDC blues away–so, we’ll be okay  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.766666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/zenithlight",
                    "index": "#5",
                    "likes": "0",
                    "time": "15/09/2020-20:54:56",
                    "content": "It makes me a bit uncomfortable, because vaults are a risk-free place to launder USDC. There is no way to liquidate a frozen USDC vault because its value goes from $1 to $0 immediately. Essentially, MKR cannot protect itself from being stuck with the tab for a blacklisted USDC vault. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "1",
                    "time": "15/09/2020-21:02:08",
                    "content": "So at some point someone (I forget who, sorry!) pointed out that it would be much more effective to blacklist the owner of the vault rather than the vault itself. I think this probably holds true. It prevents the user from accessing their USDC (even though they don’t care about it anymore and have probably just run with the DAI.) But still allows Maker to liquidate it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Malgaph",
                    "index": "#7",
                    "likes": "0",
                    "time": "15/09/2020-22:15:38",
                    "content": "This same fear holds true for tether, since someone could deposit tether to receive dai then immediately ask Bitifinex to reverse the money since it “wasn’t them” who deposited the cash. The MakerDAO system only exists for as long as these transactions can remain final and true. The moment collateral that can be manipulated is allowed into the system, the whole idea of a trustless CDO is not possible. Now I don’t believe USDC or Tether will destroy DEFI, but rather create a new problem that the space will have to deal with. An increasingly globalized economy will have governments all around the world interacting with each other in order to hold control of the system. The system has to look towards introducing a varied and even approach to currencies rather than weighing one greater than the other. Nothing is failproof in the system, but with proper risk management, we can work towards greater longevity. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.512121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#8",
                    "likes": "1",
                    "time": "15/09/2020-22:24:33",
                    "content": "Freezing the assets of one person who has committed a crime is entirely different than freezing the assets of all CDP holders who are not accused of any crimes.  Its really not a realistic threat.  They would first give a warning and innocent people would have a chance to unwind their CDPs.  The problem would be finding something that could replace the USDC liquidity- which is planned to be real world assets. Until we have that, we should use USDC to restore the peg as its the least bad option.  Only other one is having unbacked Dai - which creates its own set of risks too. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.170833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jernejml",
                    "index": "#9",
                    "likes": "0",
                    "time": "16/09/2020-06:36:34",
                    "content": "    LongForWisdom:  So at some point someone (I forget who, sorry!) pointed out that it would be much more effective to blacklist the owner of the vault rather than the vault itself.   I’ve never thought of that. So he can still withdraw, but only to the blacklisted address, right? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.760714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "16/09/2020-10:07:33",
                    "content": "Realistically, by that point he’s probably already run off with the DAI because it can’t be blacklisted and doesn’t intend to return for the USDC. But yes, I would say it prevents the sanctioned person using the USDC, which is the point of blacklisting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ccc",
                    "index": "#11",
                    "likes": "2",
                    "time": "16/09/2020-18:10:52",
                    "content": "Since it was first ever brought up, I’ve thought that the idea of allowing centralized stablecoins to be used as collateral was a terrible one, for exactly this reason. Governments (most of which have no problems p***ing in our pool, since we’re not under their thumb) have been known to just arbitrarily do things sometimes, and crypto is just as subject to this as anything else. By allowing collateral to depend upon a single organization, a single point of failure, that makes it very easy for a government to target that single point of failure and cause massive damage to the Maker Vault Credit System. Someone in another thread pointed out that USDC collateral accounts for ~30% of Dai currently in circulation. If Centre ate it, at the time of writing that’s upwards of 175m Dai that is no longer backed by anything. Even at the conservative estimate given in the OP of ~20% of all collateral, that is still ~115m Dai. In either case, that would be a huge problem. Exposing ourselves to that risk for the sake of quickly stabilizing the peg, and then not reflecting that risk in the LR and SF, and then continuing to crank up the DC on it was shortsighted, and we should not have done it. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.056994047619048
                }
            ]
        }
    ]
}