{
    "poll_list": [
        {
            "title": "Offboard the COMP-A Vault Type - November 15, 2021",
            "index": "11184",
            "option": "Yes",
            "supporting_mkr": "71,686",
            "highest_fraction": 0.7
        },
        {
            "title": "Offboard the AAVE-A Vault Type - November 15, 2021",
            "index": "11184",
            "option": "Yes",
            "supporting_mkr": "71,686",
            "highest_fraction": 0.7
        },
        {
            "title": "Offboard the BAL-A Vault Type - November 15, 2021",
            "index": "11184",
            "option": "Yes",
            "supporting_mkr": "71,686",
            "highest_fraction": 0.7
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-offboarding-matic-comp-aave-and-bal/11184",
            "title": "[Signal Request] Offboarding MATIC, COMP, AAVE, and BAL ",
            "index": 11184,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "collateral-offboard"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#1",
                    "likes": "10",
                    "time": "25/10/2021-23:25:15",
                    "content": "I’d like to poll the sentiment from the community to begin the offboarding process for MATIC, COMP, AAVE, and BAL. The MATIC token is fairly clear cut. There was a deal in place with Polygon to on-board the MATIC token in exchange for them monetizing a significant part of their treasury. Discussions ranged from 30M Dai all the way to 100M Dai. Polygon did not hold up their end of the bargain, and after being confronted both digitally and in-person recently in ETH Lisbon gave no indication they have any intention of doing so. The community should off-board MATIC on principle for reneging on the deal irrespective of the fact that the vault has been performing extremely poorly (3,627 annual stability fees). The COMP, AAVE, and BAL vaults have very attractive rates (1% SF) compared to competitor platforms and have had ample time to build up a user-base. However, no usage has materialized. The stability fees generated are quite poor (see below) and don’t come close to covering the Oracle gas-costs. As such, I’m recommending the community offboard the COMP, AAVE, and BAL vaults.     Token Dai Minted Annual Stability Fees     COMP 13,722 137   BAL 171,470 1,715   AAVE 1,065,355 10,654       Offboard MATIC  Yes No Abstain     0 voters        Offboard COMP  Yes No Abstain     0 voters        Offboard AAVE  Yes No Abstain     0 voters        Offboard BAL  Yes No Abstain     0 voters     EDIT 10/30/21 The polls will close on 11/6/21 ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-71/11666",
                        "https://forum.makerdao.com/t/proposed-offboarding-collateral-parameters-2/11548",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-28th-november-4th/11441",
                        "https://forum.makerdao.com/t/maker-relay-ep-69-en-espanol/11439",
                        "https://forum.makerdao.com/t/ultraschuppi-delegate-platform/11193/4",
                        "https://forum.makerdao.com/t/maker-relay-ep-69/11345",
                        "https://forum.makerdao.com/t/growth-cu-weekly-update-october-15-october-28/11261/2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-october-21st-october-28th/11262",
                        "https://forum.makerdao.com/t/maker-relay-ep-74-en-espanol/12071",
                        "https://forum.makerdao.com/t/maker-relay-ep-74/12035",
                        "https://forum.makerdao.com/t/an-assessment-first-hand-experience-and-recommendations-from-the-aave-offboarding/11836",
                        "https://forum.makerdao.com/t/maker-relay-ep-71-en-espanol/11712"
                    ],
                    "GPT-summary": "The author of the post is proposing to offboard MATIC, COMP, AAVE, and BAL tokens from the community. The author explains the reasons behind the proposal, including the failure of Polygon to hold up their end of a deal and the poor performance of the vaults. The post includes polls for the community to vote on whether to offboard each token. A 3rd party could give constructive criticism by questioning the author's reasoning or suggesting alternative solutions.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Token economics",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 4.958333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jurajpetrik",
                    "index": "#2",
                    "likes": "3",
                    "time": "25/10/2021-23:41:23",
                    "content": "Would be nice to have a hard and fast offboarding rule. Sth like, if a token has been around for X amount of time and generated < Y in revenue, automatically start the offboarding process. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.847222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#3",
                    "likes": "4",
                    "time": "25/10/2021-23:52:05",
                    "content": "@NikKunkel can you recall here the total operational cost required for running each one of those Vaults (and therefore to break-even)? That would probably enlighten the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#4",
                    "likes": "6",
                    "time": "25/10/2021-23:54:12",
                    "content": "It is quite variable due to gas price fluctuations as well as the type of Oracle used (Medianizer/OSM vs UNI LP Oracle vs DSValue). All of these collateral types utilize the Medianizer/OSM configuration and have historically cost around $150,000 per year per Oracle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#5",
                    "likes": "3",
                    "time": "25/10/2021-23:57:21",
                    "content": "@NikKunkel Maybe like an annualised mean cost by oracle type (with some assumptions) would do the job. I think that can help all teams, including RWA, think how to evaluate onboardings and min utilisation rates required on the opex side. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 3.4375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "1",
                    "time": "26/10/2021-00:37:13",
                    "content": "The problem of trust that MATIC will generate from now on when listing new collateral is very serious. I think it is important to note that it would be interesting to see the history and everything that is taken into account when incorporating new collateral. If those behind the collateral wish to make an agreement as or signal intentions, block the capital for it, we are not school children to be believing in false promises. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.956709956709957
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#7",
                    "likes": "2",
                    "time": "26/10/2021-01:11:12",
                    "content": "    williamr:  Maybe like an annualised mean cost by oracle type   Dumb question: But how are we paying for gas costs for oracles now? Is the Foundation still picking those up? I’m fairly certain it doesn’t come out of the current Oracles CU budget. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.408482142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ceresbzns",
                    "index": "#8",
                    "likes": "0",
                    "time": "26/10/2021-01:33:38",
                    "content": "    NikKunkel:  There was a deal in place with Polygon to on-board the MATIC token in exchange for them monetizing a significant part of their treasury. Discussions ranged from 30M Dai all the way to 100M Dai. Polygon did not hold up their end of the bargain, and after being confronted both digitally and in-person recently in ETH Lisbon gave no indication they have any intention of doing so. The community should off-board MATIC on principle for reneging on the deal   For my edification, did MakerDAO and Polygon formalize this agreement anywhere, besides what was written on the forums in this topic? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/chonghe",
                    "index": "#9",
                    "likes": "3",
                    "time": "26/10/2021-02:01:48",
                    "content": "Off-boarding collateral with trust issue such as MATIC is fine. Compound low usage, ok But Aave has 1M DAI generated, perhaps it just needs time to get more users to on-board. DeFi is still very new to majority of people. Off boarding this collateral will push people away from Maker and go to other platforms, and once people go, it’s hard to come back. I incline to have more users as a priority. Same goes with BAL. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.7623966942148765
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#10",
                    "likes": "0",
                    "time": "26/10/2021-06:27:40",
                    "content": "Thanks for the post @NikKunkel I am pleased that we are trimming some of the bloat from the system. Currently 4 ilks - ETH-A, ETH-B, ETH-C and WBTC-A - generate 94.6% of our stability fees per makerburn. Perhaps we should look at this and think about whether WBTC-B and WBTC-C could generate some decent profit too without adding too much expense before adding new ilks that would require new oracles and other costs. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.758996212121213
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#11",
                    "likes": "16",
                    "time": "26/10/2021-07:35:32",
                    "content": "I support offboarding of these assets. COMP an AAVE users are normally using their native platforms to borrow, despite Maker offering lower rates. BAL users also prefer to farm on Balancer. Truth be told, there is not a lot of demand for other vanilla ERC20 tokens used as collateral, plus we have few limiting factors:  either they are very illiquid on-chain and we can not offer high debt ceilings those who are liquid and interesting are some recently hyped and heavily farmed tokens that are very risky on its own and haven’t really went through a stress test (OHM for instance) Maker doesn’t offer cross collateralization, which hurts users if they need to maintain every single vault. It costs >$400 to maintain your vault right now (withdraw collateral and repay).  It is probably only LINK, UNI and YFI where we truly saw some serious demand in the past. I think Maker should mainly focus on three categories when it comes to onboarding new crypto assets:  ETH and WBTC derivatives (different LR, fixed rates, stETH type of products, etc.) LPs (again mostly ETH and WBTC based) D3M type of modules  D3M type of modules are particularly interesting in my opinion. It is the easiest way to scale, at some cases we get other protocol’s backstop and offboarding is easiest. At Rari Capital Maker could even create a pool with its own set of rules. Of course there are also downsides to it, one is that we need to monitor them closely all the time and we start increasing Chainlink oracle dependancy. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-october-2021/11352"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.598796536796536
                },
                {
                    "author_link": "https://forum.makerdao.com/u/sourcex",
                    "index": "#12",
                    "likes": "14",
                    "time": "26/10/2021-10:27:20",
                    "content": "Maker Community, We stand by what we had committed. We initiated the process for it a long time ago. The challenges since then were mainly around chasing the multi-sig signers given that there are a series of transactions that require to be initiated to open a vault. During this time, we have always been in touch with the Maker team; now finally we got the first step done by doing a test transfer of depositing 100,000 MATIC, 16 hours ago. In the next few hours, we will execute the full amount transaction given the test txn is successful. Polygon is long-term committed to supporting Maker, and DAI. There are parallel conversations from the Maker team happening with different members of the Polygon team for the growth and support of DAI, and Maker across the ecosystem. We would request the community to consider this vote because DAI liquidity is dependent on MATIC. Still apologies for the delay, and thank you to the Maker team for supporting us at every step. ",
                    "links": [
                        "https://t.me/PolygonAnnouncements/2061",
                        "https://etherscan.io/tx/0xa29d82a8addfd6e1fe90d75d64be3488c309a5e223b978166b855b0c97db6b70"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.679487179487179
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#13",
                    "likes": "1",
                    "time": "26/10/2021-11:13:59",
                    "content": "    sourcex:  In the next few hours, we will execute the full amount transaction given the test txn is successful.   It looks like they are up against the temporary DC. Let’s see how it goes. It would also be great to get a breakdown of how we pay for oracle gas right now + some specifics on what the current oracle gas costs look like, Thanks, everyone! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.397321428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#14",
                    "likes": "3",
                    "time": "26/10/2021-14:40:19",
                    "content": "That’s why my vote was NO for MATIC’s Offboard, even though this act will set a precedent when it comes to making “deals”, it doesn’t cross my mind that Polygon would want to damage their reputation with a bad action with MakerDAO. Thank you, @sourcex,  for your willingness and clarification. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#15",
                    "likes": "5",
                    "time": "26/10/2021-15:40:29",
                    "content": "This should be enough not to offboard Matic. Is sad to have to offboard collaterals. Are there plans to lower the costs of running oracles? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#16",
                    "likes": "5",
                    "time": "26/10/2021-15:42:22",
                    "content": "    rafinskipg:  Are there plans to lower the costs of running oracles?   Constantly. The previous version of the Oracles (V1) would have cost about $1.5M per Oracle per year… Rather, I think the the solution is more getting sharded vaults on L2 online b/c Oracle costs will only be a fraction of what they are on L1. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rafinskipg",
                    "index": "#17",
                    "likes": "0",
                    "time": "26/10/2021-15:46:26",
                    "content": "Yeah that sounds great  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/KryptoKnight",
                    "index": "#18",
                    "likes": "1",
                    "time": "26/10/2021-16:01:02",
                    "content": "    PaperImperium:  It would also be great to get a breakdown of how we pay for oracle gas right now + some specifics on what the current oracle gas costs look like,   I second this. Given how much oracle gas costs seem to be informing the decisions regarding onboarding/offboarding collateral types, I think whatever clarity can be provided here (even if it’s a range) would be helpful. I assumed the costs were covered by the Oracles CU budget…is that correct? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#19",
                    "likes": "2",
                    "time": "26/10/2021-16:06:48",
                    "content": "I’ve mentioned this in the Governance & Risk call multiple times. Oracle Gas costs are currently not stipulated in the Oracle Core Unit budget. Although there is plenty of surplus OCU funds to do so, I don’t think it’s right to spend funds on items governance hasn’t specifically allocated budget for. I’ve been writing a MIP I hope to publish soon which will request funding from governance specifically for Oracle Gas Costs. Right now there is a gentleman’s agreement between the OCU and the Foundation. The OCU has taken over responsibility for the costs as of August 1st, however the remnants of the Foundation are fronting these costs until the OCU can get funding from governance to retroactively pay them back. This is a relationship we hope to dissolve before the end of the year as it’s one of the last remaining items blocking the Foundation shutdown. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#20",
                    "likes": "1",
                    "time": "26/10/2021-16:13:57",
                    "content": "    NikKunkel:  Right now there is a gentleman’s agreement between the OCU and the Foundation. The OCU has taken over responsibility for the costs as of August 1st, however the remnants of the Foundation are fronting these costs until the OCU can get funding from governance to retroactively pay them back. This is a relationship we hope to dissolve before the end of the year as it’s one of the last remaining items blocking the Foundation shutdown   Can you ballpark how much that has been from Aug 1 to now (or end of September or some other milestone)? Is there a reason why we need the Foundation to continue to bear these costs? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.360714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#21",
                    "likes": "5",
                    "time": "26/10/2021-16:15:43",
                    "content": "There is no reason for the Foundation to continue to bear these costs, and in fact they would prefer to stop doing so as soon as possible. The only reason it’s taken this long is because I’ve been extremely busy spinning up the Oracle Core Unit. This is on the top of my priority list to get sorted at the moment, I should have the MIP out within a week. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.550000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#22",
                    "likes": "0",
                    "time": "26/10/2021-16:19:31",
                    "content": "    NikKunkel:  This is on the top of my priority list to get sorted at the moment, I should have the MIP out within a week.   Thanks. Can you give us a rough estimate on what that amount is going to look like? This is an off-balance sheet item that any information would be pretty helpful to have — even if it’s just “between 3/4 and 1 million DAI” for example Thanks in advance! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#23",
                    "likes": "2",
                    "time": "26/10/2021-16:30:58",
                    "content": "It’s not the ‘actual cost’ that matters, it’s what multiple of the actual cost needs to be held in reserve in case gas increases by an order of magnitude. Think of the peak of NFT summer where 1500 gwei transactions were the norm for almost a month. Running out of ETH and the Oracles going offline while the OCU requests more funds from governance is not a viable scenario. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#24",
                    "likes": "0",
                    "time": "26/10/2021-16:33:06",
                    "content": "    NikKunkel:  It’s not the ‘actual cost’ that matters   I’m referring to how much we owe the Foundation. You’re spot on that forecasting is a different beast. But what do we need to make the Foundation whole on what they’ve spent since Aug 1? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#25",
                    "likes": "0",
                    "time": "28/10/2021-15:35:50",
                    "content": "Hey @NikKunkel, how long are you intending to keep this signal open for? Need to get an ending date added to the post so we can figure out the Governance cycle for it and so the people voting can be aware. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Spidomo",
                    "index": "#26",
                    "likes": "8",
                    "time": "30/10/2021-23:22:12",
                    "content": "To those who voted to off-board MATIC: In the last few days the MATIC vault has accrued 8.9 million DAI of debt, earning 267k of annual income (vs. historical $150k annual oracle cost). If you voted to off-board before this occurred, you may wish to re-consider. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#27",
                    "likes": "8",
                    "time": "31/10/2021-05:40:37",
                    "content": "Okay, will add an end date of 1 week from today (Saturday the 6th). That will enable us to have Polling Votes for offboarding going out that following Monday. @prose11 Let me know if there are any issues with this timeline. As for MATIC, @sourcex reaffirmed Polygon’s commitment to the original deal, followed by tangible actions from the Polygon team to lock up MATIC in the vault close to the current debt ceiling. In light of this new information I suggest the community temporarily suspends the offboarding process for MATIC as the @Growth-Core-Unit coordinates with the Polygon team on what the next steps/timeline are for completing the agreement. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.008116883116883
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#28",
                    "likes": "1",
                    "time": "31/10/2021-11:28:38",
                    "content": "Previous I also voted to offboard not profitable collateral types, on the one side it makes sense to cut out not necessary expanses due to oracle fees on the other side is it the right approach just to say that it is just not profitable? The parameters are exremly not attractive espesially the LR is for my opinion to high maybe we could lower them with a higher fee. There are other aspects for “low” demand like high gas fees mantain/open a vault, but this is a problem that hopefully will be resolve with L2 and ETH 2.0. Also lack of marketing. I would like to have offboarded collaterals back in the future those protocols are solid. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.966941391941392
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#29",
                    "likes": "3",
                    "time": "31/10/2021-19:30:21",
                    "content": "    makercaesar:  is it the right approach just to say that it is just not profitable?   yes, that’s what businesses do.     makercaesar:  There are other aspects for “low” demand like high gas fees mantain/open a vault, but this is a problem that hopefully will be resolve with L2 and ETH 2.0.   That may contribute to the cause, but the effect is that the vaults are unprofitable and hence we should offboard them. Once we have Maker deployed on L2s the community can vote to re-activate these vaults to see if they are more viable there. The Oracle costs on L2 are significantly lower hence the threshold will be much lower to reach profitability. I see no reason to keep them onboarded in the meantime. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.163095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#30",
                    "likes": "2",
                    "time": "02/11/2021-09:34:31",
                    "content": "Thank you for reminding me what businesses do. I think you got me wrong, let me clarify a little bit. I mean what we can do short term to push those vaults into a profit zone, maybe adjust parameters like for example reduce the LR I know its a risk problem so the tradeoff would be to increase the fee (be more dynamic) and encourage not to give up so fast on the products. Apparently there is an agreement with Polygon which turned out postitive in the end, maybe the other teams have similar intentions. When there is nothing else left to change the current situation then yes offboard them. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#31",
                    "likes": "0",
                    "time": "12/11/2021-19:20:38",
                    "content": "With only the Signal for Matic failing, polls for offboarding COMP-A, AAVE-A, and BAL-A will be live on Monday (2021-11-15) and will last for three days. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.227272727272727
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#32",
                    "likes": "1",
                    "time": "13/11/2021-03:17:52",
                    "content": "We do try to communicate with teams behind collaterals. However, sometimes teams are still not interested or unwilling to commit large amounts ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.482142857142858
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#33",
                    "likes": "0",
                    "time": "25/11/2021-12:24:32",
                    "content": "The executive containing these changes has now passed. Thanks to everyone that voted. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#34",
                    "likes": "0",
                    "time": "25/12/2021-22:25:21",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "246"
}