{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/state-of-dai-march-8-14-2022/13916",
            "title": "State of Dai: March 8 - 14, 2022 ",
            "index": 13916,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "state-of-dai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "2",
                    "time": "15/03/2022-15:29:40",
                    "content": " 1655×420 230 KB  Hi everyone, thanks for checking out the State of Dai. Now separate from the Weekly Relay with the objective to scale and improve all the information you need for your Dai escapades!  The public PDF version is available here.   Peg880×617 105 KB   Peg is quite solid except for a wobbly ETH market on the 9th. It seems like some folks got caught in the bull trap.   Real volume and spikes846×435 65.5 KB   According to Messari, 1.1 billion in “real volume.”    DAI Max and min had a much tighter band at 1.02 and .95, though on admittedly smaller volume.   DAI Supply1362×743 80.3 KB   Supply is the new stable—9.8 billion holding despite drawdowns across the market and vault refinancings.   Vault changes1106×905 145 KB   The most dramatic change in vaults over the week was WBTC-A (135 million less).    ETH-A still dominates the debt share.   Borrow/repay706×611 46.4 KB   Mints are positive, with a net of 78 million.  Visit Makerburn for an up-to-the-minute ilk breakdown.  Liquidation breakdown per drop902×437 51.6 KB   A 24% Price drop starts to ramp up liquidations.   high risk vault types1152×170 43.4 KB   After these highly volatile few weeks, 24% is a max pain moment. Using the blockanalytica sim, that drawdown hits 350 vaults, mostly WBTC and ETH vaults.  daistats.com | makerburn.com | maker.blockanalitica.com   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @twblack88 ",
                    "links": [
                        "https://makerburn.com/#/rundown",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-mar-14-mar-25/14263"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.522632575757576
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "15/03/2022-16:35:25",
                    "content": "    Weekly Relay: March 8 - 14, 2022 Updates   [image]  Every time I read all the summaries Artem makes about Maker Dao, DAI and its current status.     I told you so Artem hahaha ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "29/03/2022-16:36:03",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/state-of-dai-march-1-7-2022/13732",
            "title": "State of Dai: March 1 - 7, 2022 ",
            "index": 13732,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "state-of-dai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "3",
                    "time": "08/03/2022-00:16:50",
                    "content": " 1282×317 43.5 KB  Hi everyone, thanks for checking out the State of Dai. Now separate from the Weekly Relay with the objective to scale and improve all the information you need for your Dai escapades!  The public PDF version is available here.   Peg883×622 113 KB   Quiet week for DAI trades, balancing out to be fractions of a penny below peg.   Real volume and spikes969×488 66 KB   A volume spike on march fourth – 69 million– total weekly volume at 1.2 billion.    Tighter spread across the peg, with Max 1.04 and min .96.   DAI Supply1368×749 80.2 KB   Slight bump in supply to 9.8 billion. However, it’s the second week in a row below our recent 10 billion DAI milestone.   Vault changes1375×859 151 KB   Over the week, some redistribution to ilks with a high-risk premia: ETH-C WBTC-B&C, plus some growth in wstETH. A reduction in ETH and WBTC-A vaults.    Slight increase in organic demand, but the looming pain of the past month still dwarfs that growth.    Breaking the redistribution down further by vault type, bar charts help illustrate the reductions in organic WBTC-A and ETH-B demand.   Borrow/repay839×608 49.7 KB   An uptick on borrows overall, with march five the most active day. Mints at net +159 million.    Retention of DAI supply is still sticky for February, as Seb pointed out in the concentraiton analysis. However, big vaults make up the majority.  Visit Makerburn for an up-to-the-minute breakdown. Removing screenshots here since reading from the source is always better.  One auction settled in 36 mins1258×86 25.8 KB   One auction settled in 36 mins this last week.   Liquidation breakdown per drop1075×421 57.2 KB   The liquidation wall is steep at a 24% drop, which after an unpleasant weekend would be… more unpleasant.    Of the highest risk vaults, UNIV2 and ETH-C get the most collateral sent to the hole in that hypothetical scenario.  daistats.com | makerburn.com | maker.blockanalitica.com   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @twblack88 ",
                    "links": [
                        "https://forum.makerdao.com/t/borrowers-concentration-analysis/12014",
                        "https://makerburn.com/#/rundown",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-28-mar-11/13887"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.169802867383513
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/03/2022-00:17:42",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/state-of-dai-february-1-7-2022/13104",
            "title": "State of Dai: February 1 - 7, 2022 ",
            "index": 13104,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "state-of-dai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "4",
                    "time": "08/02/2022-02:51:08",
                    "content": " Screenshot (18)1920×785 34.1 KB  Hi everyone, thanks for checking out the State of Dai. Now separate from the Weekly Relay with the objective to scale and improve all the information you need for your Dai escapades!  The public PDF version is available here.   Peg905×648 117 KB   Peg was solid this last week. The big dot at the bottom of eb 4 was on Uniswap V2 DAI/ETH pairs.    Maximum and minimum at 1.07 and .96, respectively. Uniswap V2 pools continue to hit the large slippage trades, knocking the stats off.    There is only 30 million in liquidity in V2 DAI/ETH. Yet it is the route of choice for some larger wallets, which is…quite frustrating.   Messari volume1079×493 43.4 KB   2.29 billion in volume this last week, according to Messari.   DAI Supply1355×743 76.9 KB   Dai supply is currently hovering at 9.5 billion. However, the average collateralization ratio is 180%; we got that going for us.   Borrow/repay1346×291 36.1 KB   Borrows are 1.292 billion and repaid is 1.176 billion .    That leaves us with a net Mint of 115.6 million this last week.    52 vaults were created over the week.   Collateral 24 change881×601 107 KB   Past 24-hour changes in supply include some jumps into wstETH and ETH-A. Alongside more growth in the PSM.   Collateral list 1879×888 155 KB   Collateral list 2882×637 99 KB  MakerBurn rundown  PSM USDC 4.8 billion  ETH-A 1.9 billion WBTC-A 946 million PSM USDP 499 million ETH-C 280 million GUNI DAI-USDC (0.01%) 270 million Aave D3M 101 million wstEth 86 million LINK 78 million GUNI DAI-USDC (0.05%) 69 million UniV2DaiUSDC 60 million ETH-B 56 million MATIC-A 20 million YFI 15 million NSDROP 12 Million UniV2UsdcEth 11.5 million PSM GUSD 9.9 million MANA 4.7 million renBTC 3.8 million WBTC-B 2.8 million FFT1-DROP 2.6 million HTC-DROP 1.91 million UNI 1.7 million 6S Capital 1.4 million   Other vaults below 500K (UniV2WBTCEth, UniV2DaiEth, UniV2UniEth) at $1.3 million.   ETH in Maker605×602 36.9 KB   WBTC598×581 32.5 KB   Maker has been pac-manning a larger share of Defi, above 50% for ETH and MKR.   Maker Dominant again1044×463 49.8 KB   In all of DeFi, that dominance is 20.33%, but it is 43% for lending specifically.    Accompanying a rise in collateralization ratios and a rise in ETH price comes a safer liquidation wall at 30%.    There is a slight switch to medium-risk debt on staked ETH.  daistats.com | makerburn.com | maker.blockanalitica.com   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is purely for information and communication purposes only. ",
                    "links": [
                        "https://c.tenor.com/8WNmIZTkDe8AAAAd/going-for-me-which-is-nice.gif",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/help-wanted-writers-for-stakeholder-content-program/13122",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-jan-31-feb-11/13198"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.119868637110017
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "2",
                    "time": "08/02/2022-02:58:08",
                    "content": "What I like the most is literally how we are standing, we are “doing great and we are going to do even better”. I like to see how Maker is a black hole of ETH and WBTC more than half is in our vaults. I would like a comparison of DAI vs other Coins with CDP, like FEI, LUSD, USDP, it would be great. Nothing more to say, great job Artem. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.970833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "5",
                    "time": "08/02/2022-04:38:42",
                    "content": "Can we get some information on what vault owners are doing? I have been trying to get a handle on what vaults are minting or burning DAI.   I want to see these activities binned by vault TVL locked.    I have a concern that most of Maker’s DAI activities are now dominated by a few very large vaults. Once we isolate what vaults are minting or burning can we also get a least a rough handle on where they are deploying this DAI. We have growth wanting to figure out how to get more DAI out there yet as far as I can tell we don’t even really know the state of our vault users in terms of activity vs. size, much less what they are doing to either repay their DAI or when the mint it. Without real drill down information on our vault users here I feel like we are just making up a narrative that everything is fine, when in fact we have already passed 60% again with stablecoins backing DAI (this has happened a few times) and don’t really have a good handle on what the SF paying 40% DAI borrowers are up to. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.657671957671958
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#4",
                    "likes": "0",
                    "time": "10/02/2022-13:37:23",
                    "content": "Hey, didn’t mean to leave you hanging. I bookmarked this inquiry and wrote some notes. I plan to spend some time tomorrow to research our resources and see if we’re able to get enough information for this. I will update you  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "0",
                    "time": "10/02/2022-14:01:45",
                    "content": "Maybe a risk team intern can partner with us to write up some week to week content on the interesting happenings of vault owner behavior. Either that or maybe we hire a dedicated contributor to do this kind of segment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#6",
                    "likes": "0",
                    "time": "24/02/2022-14:02:20",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/state-of-dai-march-15-21-2022/14120",
            "title": "State of Dai: March 15 - 21, 2022 ",
            "index": 14120,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "state-of-dai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "5",
                    "time": "21/03/2022-21:28:17",
                    "content": " 1640×347 247 KB  Hi everyone, thanks for checking out the State of Dai. Now separate from the Weekly Relay with the objective to scale and improve all the information you need for your Dai escapades!  The public PDF version is available here.   Peg882×625 110 KB   Last week, the peg was rock solid, with only one notable slippage event on March 18.    DAI maximum and minimum mirror each other on either side of par: 1.05 and .95, respectively.   Real volume and spikes832×380 49.5 KB   Slight shave off the top in volume. Numbers, according to Messari, are 962 million in “real volume,” which includes centralized exchanges.   Nomics does report Cdai deposits890×661 95.3 KB   For what it’s worth, Nomics reports volume in interesting ways. This reporting is helpful to peek at weekly averages on cDAI volume. 172 million this last week.   PLus ayy blockcnalytica love for compound1371×629 98.1 KB   Risk team just keeps releasing hits, the Compound monitor indicates recursion strategies on borrow and supply. High recursion on both supply and borrow. (Pondering on data in Instadapp calls  )   DAI Supply1173×744 76.7 KB   A slight bump in overall supply to 9.9 billion.  Join discord and check out the Bot feed if you want up to minute mint alerts.  image1920×1668 120 KB   Vault usage, debt, and risk premium changes over the last 7 days.   D3M doing good on Aave1132×626 65.3 KB   D3M at a cozy 260 million.   AAVE v3 release spiked borrowers800×191 11.8 KB   With AAVE v3 in the wild, unique borrowers spiked. Maker had a nice bump, too (up from ~290 ish).    ETH-B gained a small uptick, likely refinancing from ETH-C. Share of debt still has ETH-A as the largest chunk.   Borrow/repay815×605 49.7 KB   Mints are positive this week, with a net of 145 million.  Visit Makerburn for an up-to-the-minute ilk breakdown.  Liquidation breakdown per drop967×421 60.5 KB   A 28% Price drop starts to ramp up liquidations.    Over time, capital at risk has greatly reduced to less than 2%. Of the debt share, we can assume active management and responsible borrowing. Looking forward to the MOMC recommendations and upcoming innovations. Onwards and upwards    daistats.com | makerburn.com | maker.blockanalitica.com   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @twblack88 ",
                    "links": [
                        "https://discord.com/channels/893112320329396265/897454097123409941",
                        "https://makerburn.com/#/rundown",
                        "https://survey.sogosurvey.com/r/OBV0Y7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.718453768453768
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "04/04/2022-21:28:45",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/state-of-dai-february-15-21-2022/13349",
            "title": "State of Dai: February 15 - 21, 2022 ",
            "index": 13349,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "state-of-dai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "2",
                    "time": "21/02/2022-23:54:12",
                    "content": " 1079×224 89.4 KB  Hi everyone, thanks for checking out the State of Dai. Now separate from the Weekly Relay with the objective to scale and improve all the information you need for your Dai escapades!  The public PDF version is available here.   Peg1770×1258 248 KB   Some larger ETH/DAI trades have been moving the peg around. However, DAI has been ever so slightly below the peg on average.    Maximum is 1.10  and the minimum is 0.93.   Uniswap Slippage via blockanalytica1214×812 58.8 KB   Uniswap V2 slippage over the past week tracks with the larger slippage points on the 7-day chart.   Uniswap v2 total liquidity2488×942 150 KB   Slight bump in total liquidity for V2 and double the volume week-over-week.   Uniswap v32490×1126 172 KB   V3 had a slight volume decrease but is trending back to its previous value locked.   Curve with 86% share dai2070×500 80 KB   Though Uniswap generates the slippage, Curve dominates as the ultimate settlement DEX. 86% of DAI eventually sits in Curve pools.   Messari volume1944×1066 269 KB   1.31 billion in volume this last week (according to Messari).   DAI Supply2692×1476 266 KB   Still floating above 10 billion in supply with 16 billion TVL; 52% in USDC PSM.   Borrow/repay1476×414 98.3 KB   Mints 350 million1474×800 83.3 KB   More repayments than borrows this week, with a (-)50 million DAI net.   58 Vaults1452×776 74 KB   58 Vaults created this week.   Collateral list 11756×1574 408 KB   Collateral list 21752×1464 318 KB   PSM USDC 5.1 billion  ETH-A 1.94 billion WBTC-A 847 million PSM USDP 499 million GUNI DAI-USDC (0.01%) 335 million ETH-C 296 million Aave D3M 119 million wstEth 117 million LINK 78 million GUNI DAI-USDC (0.05%) 67 million UniV2DaiUSDC 65 million ETH-B 47 million MATIC-A 19 million YFI 15 million WBTC-C 14 million NSDROP 12 Million UniV2UsdcEth 9.5 million MANA 4.7 million renBTC 3.8 million WBTC-B 2.9 million FFT1-DROP 2.6 million HTC-DROP 1.79 million PSM GUSD 1.4 million UNI 1.46 million 6S Capital 1.42 million   Other vaults below 500K (UniV2WBTCEth, UniV2DaiEth, UniV2UniEth) at $1.19 million.   Debt share mostly ETh and WBTC1124×1118 65.2 KB   Debt share mostly ETH and WBTC.   WBTC Nexo1208×1362 205 KB   Nexo had to pay back 100 million in WBTC-A.   Whales1308×754 72.1 KB   Whales are riding high seas of risk, mostly.   DAI on L2s2176×794 118 KB   23% drop is where liquidation walls get steep.   Liquidation breakdown per drop2350×1152 207 KB   In case you missed it, there is a per drop amount of debt liquidated tab. It’s nice to zoom out from time to time, as the amount liquidated per drop has reduced.  daistats.com | makerburn.com | maker.blockanalitica.com   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only. ",
                    "links": [
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-14-feb-25/13462"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.396717171717171
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/03/2022-23:54:32",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/state-of-dai-february-8-14-2022/13240",
            "title": "State of Dai: February 8 - 14, 2022 ",
            "index": 13240,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "state-of-dai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "2",
                    "time": "15/02/2022-01:54:49",
                    "content": " 1718×490 300 KB  Hi everyone, thanks for checking out the State of Dai. Now separate from the Weekly Relay with the objective to scale and improve all the information you need for your Dai escapades!  The public PDF version is available here.   Peg1798×1258 251 KB   Peg has been solid, with a few large ETH/DAI trades generating the majority of slippage.   7-Day Dai stats590×768 272 KB   Max at 1.09 and min at 0.93. This last week, DAI had a slight premium, especially on ETH pairs.   Slippage via blockanalytica1180×770 94.9 KB   Blockanalytica outlines exchange stats quite well. Uniswap V2 still sources most of the hits to price.   Uniswap v2 total liquidity2366×880 111 KB   Total DAI liquidity on Uniswap V2 has been consistently hovering at ~50 million.   UNiswap v32434×882 141 KB   However, total DAI liquidity on V3 has been growing month-over-month. V3 has both the lion’s share of volume and TVL.   Messari volume2430×1236 480 KB   1.65 billion in real volume, according to Messari. A few spikes last Tuesday and Thursday.   DAI Supply2716×1484 269 KB   We broke 10 billion in DAI supply! Note last year when we were excited about TVL at 10 billion.  Don’t forget to submit your memes for a chance at the NFT commemorating the moment. Also, @aes calls out the real truth, next milestone is 10 billion DAI from non-stables.   Borrow/repay2954×596 131 KB   Mints 350 million1436×672 171 KB   Net mints are 350 million this last week.   55 Vaults1450×778 71.2 KB   Corresponding to that net minting, it was a quiet week with only 55 vaults opening.   Collateral 24 change1788×744 146 KB   A few more mints on ETH-B and UNI stable LPs in the past 24 hours.   Collateral list 11750×1582 426 KB   Collateral list 21746×1456 324 KB  MakerBurn rundown  PSM USDC 5.15 billion  ETH-A 1.9 billion WBTC-A 959 million PSM USDP 499 million ETH-C 282 million GUNI DAI-USDC (0.01%) 268 million wstEth 118 million Aave D3M 116 million LINK 78 million GUNI DAI-USDC (0.05%) 67 million UniV2DaiUSDC 62 million ETH-B 51 million MATIC-A 19 million YFI 15 million NSDROP 13 Million WBTC-C 12.7 million UniV2UsdcEth 9.48 million MANA 4.7 million renBTC 3.8 million WBTC-B 3.2 million FFT1-DROP 2.6 million PSM GUSD 2.1 million HTC-DROP 1.79 million UNI 1.47 million 6S Capital 1.4 million   Other vaults below 500K (UniV2WBTCEth, UniV2DaiEth, UniV2UniEth) at $1.19 million.   ETH in Maker2356×1074 184 KB   Here is the top 10 vault holders’ positions shares. WBTC-B/A/C, YFI, LINK, UNI, wstETH, RENBTC, and ETH-B have the most concentrated whale dominance.   Vault changes2378×1288 274 KB   Not too much motion on vault changes. But WBTC has been growing across each of its vault types.   DAI on L2s2674×1312 366 KB   DAI deployed on L2’s, dominated by Avalanche.   20% drop1480×878 91.3 KB   With average collateralization sitting at 167%, liquidations hit significantly at a 20% price drop.   20% liquidation breakdown1084×622 340 KB   Breaking that drop down to the risk buckets, it is the low risk that gets tapped progressively more and more since that is where most of the debt outstanding is capitalized.  daistats.com | makerburn.com | maker.blockanalitica.com   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is purely for information and communication purposes only. ",
                    "links": [
                        "https://forum.makerdao.com/t/10b-tvl-reached/7697?",
                        "https://forum.makerdao.com/t/makerburns-10b-dai-nft-meme-competition/13113?",
                        "https://forum.makerdao.com/t/10-000-000-000-dai-reached/13106/8?",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-14-feb-25/13462"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.58399470899471
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/02/2022-15:20:49",
                    "content": "Excellent work Artem  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#3",
                    "likes": "0",
                    "time": "03/03/2022-15:21:13",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/state-of-dai-march-22-28-2022/14310",
            "title": "State of Dai: March 22 - 28, 2022 ",
            "index": 14310,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "state-of-dai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "2",
                    "time": "29/03/2022-14:57:13",
                    "content": " 1615×320 257 KB  Hi everyone, thanks for checking out the State of Dai. Now separate from the Weekly Relay with the objective to scale and improve all the information you need for your Dai escapades!  The public PDF version is available here.   Peg868×627 101 KB   A few premium trades above peg this week.    Max and min clock in at $1.15 and $0.81. Not a surprise by now, but Uniswap V2 was the primary source pushing peg variance. Meeting the sizeable market for arbitrage via semi-illiquid pools creates pricing outliers.   UNi v2 Liquidity746×383 35.1 KB   Zooming out on DAI pools, the liquidity there has been growing stepwise since i’s low at the beginning of the month.   Nomics top five1056×364 55 KB   The top five markets for DAI are still dominated by Uniswap V3 and Binance for ETH and stable pairs.   DAI Supply1355×742 76.8 KB   9.67 billion in DAI supply; nice to see the growing D3M slice on the “DAI generated” chart. Note: TVL added a billion dollars.   Vault changes990×843 160 KB   With 9.6 billion in supply and a short price rally, we’ve historically seen more collateral movement. Maybe vault owners know something   Yet, ETH-A and WBTC-A had the number of vaults reduced while the amount of debt grew. Price go up, people pay off their debt–simple enough.   58 vaults711×393 19.8 KB   58 vaults opened over the week.   Borrow/repay713×602 47.7 KB   Net negative with 300 million DAI burned.  Visit Makerburn for an up-to-the-minute ilk breakdown. There are lots of green arrows there today.  Liquidation breakdown per drop1043×418 63.7 KB   The first hill of liquidations sits at a 29% drop, where they start to affect low-risk vaults.   Current capital at risk538×813 96.5 KB   Current capital at risk is only 9.5 million, with the majority in ETH-A.  daistats.com | makerburn.com | maker.blockanalitica.com   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @twblack88 ",
                    "links": [
                        "https://makerburn.com/#/rundown",
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/create-a-fei-psm/10583/29"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.546296296296296
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "12/04/2022-14:57:41",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/state-of-dai-february-22-28-2022/13500",
            "title": "State of Dai: February 22 - 28, 2022 ",
            "index": 13500,
            "category": [
                "Updates"
            ],
            "tags": [
                "summary",
                "state-of-dai"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#1",
                    "likes": "2",
                    "time": "01/03/2022-02:04:59",
                    "content": " 2152×495 111 KB  Hi everyone, thanks for checking out the State of Dai. Now separate from the Weekly Relay with the objective to scale and improve all the information you need for your Dai escapades!  The public PDF version is available here.   Peg1766×1230 253 KB   In case you have been under a rock in the Baltic Sea, there is a hectic environment across all markets. This frenetic condition hit the peg most dramatically on ETH/DAI pairs.  Before a market wobble on the 24th, DAI traded at its largest premium.   Real volume and spikes1916×904 269 KB   With spikes in volume twice over the 24th, the peg held relatively stable. 1.5 billion in DAI trading volume over the last week.    Over the past week, any slippage has been upwards rather than far below peg.   Uniswap v32438×1170 253 KB   A Slight reduction in Uniswap V3 volume but a healthy spike in TVL on the DAI pools.   Curve and Compound with largest shares2950×818 250 KB   Compound and curve have the highest share of DAI in the wild. (627 million and 1.6 billion respectively).   DAI Supply2712×1490 297 KB   DAI supply had a slight drop below the 10 billion mark. With a wobbly market, there was a slight uptick in PSM-USDC usage.   Vault changes2342×1490 308 KB   Over the past week, that supply reduction was dominated by ETH-A vaults closing (~40 fewer vaults), and 11 million less WBTC (closed 14 vaults). Thanks to @risk for the new endpoint.     Borrow/repay1478×1212 152 KB   Net burn of -531 million.   Collateral list 11742×1596 415 KB   Collateral list 21736×1440 305 KB   PSM USDC 5.2 billion  ETH-A 1.58 billion WBTC-A 836 million PSM USDP 498 million GUNI DAI-USDC (0.01%) 328 million ETH-C 292 million wstEth 121 million GUNI DAI-USDC (0.05%) 67 million UniV2DaiUSDC 65 million LINK 65 million ETH-B 47 million MATIC-A 19 million YFI 15 million WBTC-C 14 million NSDROP 13 Million UniV2UsdcEth 9.2 million renBTC 4.9 million MANA 4.7 million WBTC-B 3.4 million FFT1-DROP 2.6 million HTC-DROP 1.63 million RWA001-A 1.4 million UNI 1.04 million 6S Capital 1.42 million   Other vaults below 500K (UniV2WBTCEth, UniV2DaiEth, UniV2UniEth, PSM GUSD) at $1.2 million. Aave D3M back to 0.   Debt share mostly ETh and WBTC1200×1272 72.9 KB   Despite rebalancing and removing some larger vaults, the debt share is still mostly ETH-A.   Liquidation breakdown per drop2220×906 121 KB   Liquidation drops hit at 29%.   30 %1140×970 143 KB   That hypothetical 30% drop is when liquidations hit low-risk buckets, topped by collateral in WBTC-A and wstETH.  daistats.com | makerburn.com | maker.blockanalitica.com   Have Feedback? We value your input! Take our survey to let us know what we might be missing or how to do better. Disclaimer: This update is assembled by a group of contributing members in the MakerDAO community. This does not serve as financial advice or an inducement to vote in any specific way. This update is for information and communication purposes only.  Credit @twblack88 ",
                    "links": [
                        "https://survey.sogosurvey.com/r/OBV0Y7",
                        "https://forum.makerdao.com/t/govcomms-biweekly-update-feb-28-mar-11/13887"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.370265151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "15/03/2022-02:05:39",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "655"
}