{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/coinbase-mip81-cfo-community-questions-monday-september-26/18037",
            "title": "Coinbase MIP81: CFO <> Community Questions - Monday, September 26 ",
            "index": 18037,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/blimpa",
                    "index": "#1",
                    "likes": "6",
                    "time": "22/09/2022-02:39:14",
                    "content": " Coinbase MIP81: CFO <> Community Questions  960×540 253 KB   Add it to Google Calendar Join the MakerDAO community as we host Coinbase CFO Alesia Haas for an interview regarding in-RFC MIP81: Coinbase USDC Institutional Rewards. This will be a one-on-one interview with pre-screened questions. Community questions have been submitted in advance and reviewed by Coinbase’s legal team. The call is scheduled for 30 mins, with no audience participation. All community members are invited to attend & listen in. There will be a dedicated channel in the MakerDAO Discord for real-time discussions during the interview. Hosted by @Prose11 and @Retro, the event will take place on 2022-09-26T16:30:00Z over the SES Crowdcast.  attn: @Recognized-Delegates ",
                    "links": [
                        "https://www.linkedin.com/in/alesia-haas-b776531/",
                        "https://forum.makerdao.com/t/mip81-coinbase-usdc-institutional-rewards/17703",
                        "https://forum.makerdao.com/t/coinbase-mip81-live-call-with-coinbase-cfo-questions-needed-asap/18007",
                        "https://chat.makerdao.com/",
                        "https://www.crowdcast.io/c/coinbase-mip81-session-1",
                        "https://forum.makerdao.com/t/coinbase-mip81-live-call-with-coinbase-cfo-questions-needed-asap/18007/14",
                        "https://forum.makerdao.com/t/paxos-makerdao-partnership-usdp-psm/19469/24",
                        "https://forum.makerdao.com/t/relay-semanal-21-de-septiembre-28-de-septiembre-de-2022/18275",
                        "https://forum.makerdao.com/t/governance-and-risk-209-thursday-september-22-at-17-00-utc/18020/3",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/18",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/18",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/17"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#2",
                    "likes": "0",
                    "time": "22/09/2022-04:15:49",
                    "content": "    blimpa:  This will be a one-on-one interview with pre-screened questions. Community questions have been submitted in advance  and reviewed by Coinbase’s legal team.   Is this a joke? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "0",
                    "time": "22/09/2022-04:38:19",
                    "content": "You don’t appear to be laughing, Chris. More access is generally preferable to less in my Governance Playbook.  We have 30 minutes for this call and intend to cover as much ground as possible. I responded to your comment in the other thread and look forward to passing along any questions you would like considered. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.381944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/09/2022-04:44:09",
                    "content": "    prose11:  look forward to passing along any questions you would like considered.   I will not be participating. This is an embarrassment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#7",
                    "likes": "6",
                    "time": "22/09/2022-17:21:01",
                    "content": "    ChrisBlec:      blimpa:  This will be a one-on-one interview with pre-screened questions. Community questions have been submitted in advance  and reviewed by Coinbase’s legal team.   Is this a joke?   this is absolutely common, if you were the CFO of Coinbase you would do the same. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#9",
                    "likes": "0",
                    "time": "26/09/2022-23:24:44",
                    "content": "Was the session recorded? Was not able to view the interview live… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#10",
                    "likes": "1",
                    "time": "27/09/2022-07:14:52",
                    "content": "    TRUEMAKER:  Was the session recorded? Was not able to view the interview live…   Yes. Here  MIP81: Coinbase CFO Response to Community Questions - YouTube     prose11:  You don’t appear to be laughing, Chris. More access is generally preferable to less in my Governance Playbook. We have 30 minutes for this call and intend to cover as much ground as possible. I responded to your comment in the other thread and look forward to passing along any questions you would like considered.   @ChrisBlec this is pretty common with a public company and financial institutions. I also think this is actually a good thing because it makes sure that we can get through as many questions as possible and have them answered clearly and accurately, and on record. Especially since the SEC will undoubtedly be looking at this which would impact Maker, DAI, USDC and Coinbase. I wasn’t able to attend live, so I just watched. A lot was covered! Thanks for organizing it @prose11.  @ChrisBlec I think the concern you brought up in the main MIP81 proposal around having 4 co-signers without clarity around who those co-signers are, due diligence on them, and how Maker governance will impact their actions is very valid. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.67409090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#11",
                    "likes": "1",
                    "time": "27/09/2022-18:19:33",
                    "content": "    ekryski:  @ChrisBlec this is pretty common with a public company and financial institutions.   This isn’t a public company and it’s not a financial institution. It is (was) a “decentralized autonomous organization” and this type of non-communication has no place in or around it. The call was only 17 minutes long, was embarassingly light on details and was shameful in that it didn’t allow any dialogue to occur. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.3500000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ekryski",
                    "index": "#12",
                    "likes": "1",
                    "time": "27/09/2022-20:51:43",
                    "content": "    ChrisBlec:      ekryski:  @ChrisBlec this is pretty common with a public company and financial institutions.   This isn’t a public company and it’s not a financial institution. It is (was) a “decentralized autonomous organization” and this type of non-communication has no place in or around it.   I was referring to Coinbase. They are a regulated financial institution (MTL) and are a public company. Whenever they do a public engagement that involves business activity that could impact their investors  they will have to ensure their answers are legally accurate and offer appropriate disclosure of the risk without being offside with the SEC. So yes, this is normal for them to have questions provided up front and have their legal and executive team review them and help craft accurate answers. Especially in a novel situation such as this. It’s fine to be critical of the deal and the mechanisms. And the answers may not be to your satisfaction. Which is also fine. I share some of your same concerns as I’ve voiced on the actual MIP81. But, respectfully, criticism for simply having an open and recorded call with a busy CFO of a large public company that is likely fighting a bunch of fires seems unwarranted. The call did cover a lot of the open questions in the MIP81 post. You left a great comment around the mult-sig on the MIP (which I also seconded). If you have more unanswered questions or would like more detail please put them in the MIP81 post before the MIP is frozen.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.728835978835979
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#13",
                    "likes": "0",
                    "time": "27/09/2022-21:02:07",
                    "content": "    ekryski:  But, respectfully, criticism for simply having an open and recorded call with a busy CFO of a large public company that is likely fighting a bunch of fires seems unwarranted.   The criticism is twofold.   Coinbase, for having the audacity to launch this proposal into Maker’s forum and believing that it doesn’t owe MKR holders a 2-way conversation on the topic before it goes to a vote.   Every MakerDAO CU member and delegate who believes that #1 is acceptable.   ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.581632653061225
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#14",
                    "likes": "2",
                    "time": "27/09/2022-21:47:02",
                    "content": " Summary & Timelinks of the Q&A Call  Agenda   00:04: Introduction  00:19: Q&A  17:16: Conclusion   Video https://www.youtube.com/watch?v=3W7medDj6Z8  Questions & Answers 00:19   Prose11: I am honored to host this call to discuss MIP81. There is a proposal from Coinbase, and I am joined by the Coinbase CFO, Alicia. Let’s get started with the intro. Why you’re here?   Alesia Haas: We are delighted to be able to make this proposal. Maker becomes Coinbase’s first client in our USDC institutional rewards program and then transfers a portion of the PSM USDC balance to Coinbase prime. In return, receive 1.5% rewards on a balance of $1.6 billion USDC. We are excited to continue partnering with Maker to find unique situations and solutions that address the community’s goals. We first partnered with Maker as part of our USDC bootstrap fund that provided early liquidity to protocols. We considered one or two organizations strong partners as we watched the web3 ecosystems grow. Subsequently, we helped Maker with the initial listing of Dai on the Coinbase exchange and launched an urn campaign. Then recently, we have now discussed the appetite for treasury management solutions with the Strategic Finance and growth core units. We found that we could offer a secure liquid offering that would enable you to see a return on your USDC balance while limiting risk and reducing friction. We are a partner with Center and circle for the advancement of USDC. We are excited to continue growing this stable coin’s utility and to inaugurate Maker as our first partner on the Prime program for this rewards program.    02:27   Prose11: We are giving our USDC over to this Coinbase account; what happens in the event of a Coinbase insolvency or bankruptcy?   Alesia Haas: I want to acknowledge this as a remote risk. We have a strong balance sheet; we have 6 billion in liquidity and resources, and what is important about our balance sheet is that we do not rehypothecate Customer Balances. When you look at our balance sheet, we segregate Fiat and crypto customer assets as separate accounts. There are two things: First is our terms of service with our customers. In our terms of service, we say these are customer assets. Our client agreements explicitly state that Coinbase does not have a property interest in the digital assets we hold for our customers; the contractual terms between Maker and Coinbase will further state that you’re going to hold these assets in custody with Coinbase custody International Limited CCI as the acronym we use, and they are held in a segregated account just for Maker, they are segregated from all their client accounts from all of their Coinbase assets that we may have. Further, we agree in this contract that the digital assets constitute custodial assets and client property. We first have robust contractual protections. Second, we have strong operational protections because we have these segregated accounts. We do audits of these accounts; we ensure through robust testing that we segregate these accounts on behalf of our customers. Look at our balance sheet and our publicly disclosed balance sheet. You will see a line item that says crypto assets held for customers, and you see that asset, and it has a corresponding liability of the same amount so that there is no rehypothecation; we are never taking a risk on your behalf on the customers that we have. Therefore, your asset is your asset, and that is what makes us confident that in the event of bankruptcy or insolvency, which is remote, we believe that we have the proper protections that a court would determine that these assets are yours.    04:36   Prose11: Can Coinbase guarantee that Maker and all the funds will be returned upon demand, even under pressure from government or state actors? Does Coinbase have any concerns about the fact that Maker may be unable to comply with OFAC sanctions?   Alesia Haas: We [Coinbase] are a US company. We must comply with OFAC and follow this law in all countries we operate. What is essential to understand is we are onboarding a specific entity representing Maker. We are exclusively concerned about this entity being off the SDN list, so that entity cannot be out of compliance with OFAC, just that one entity. As long as that one entity that is our customer remains off the OFAC list, we are good and will be able to transact with that entity. As you can see from those separate and apart from our tornado Cash Lawsuit, we strongly feel that OFAC restrictions should apply to individuals, not technology. It is in our ethos to continue to fight for rules and clarity to ensure that we are partnering with folks like you to grow DeFi and comply with US regulations. I want to share that the Maker representatives elect the same entity that will be onboarding to work when base platform. We have onboarded entities in the past representing Maker and feel good about the process here. There have been no issues, but it is incumbent on Maker to continue suggesting onboarding legal entities that comply with OFAC rules.    06:52   Retro: What benefits does a Coinbase derive from this arrangement, knowing the uses of the funds?   Alesia Haas: As you can read in our financials, assets on the platform or accumulating assets on our platform is a key metric we look to grow. Being a large custodian is one of our key goals. Accumulating assets on the platform is crucial to our success as we believe in holding customer assets. If you think about the products we offer in custody or our wallet solution, offering safe, secure storage of assets is the bedrock of our platform. The second goal, in addition to accumulating assets, is we are looking to grow USDC: we are a partner with a circle to create Center, which is the governance organization around USDC. We support USDC and believe it can grow utility in the ecosystem, so growing USDC balance is the second most important to us. Thirdly, Maker is an essential relationship to us that we are looking to expand the ecosystem via Define: and we want to make sure that we can be a trusted partner to continue to help our customer’s goals as well. We are looking to kind those three pillars driving benefit to us by adding assets on the platform, continuing to be a large custodian, supporting the growth of USDC, and being a strong business partner to Maker.    08:20   Prose11: Can we get communication regarding the program rate after the FOMC meetings in which changes, increase in decrease are made to the fund target program rate? Basically, how will we hear about those updates?   Alesia Haas: Let me break this into two pieces. We will convey updated terms for 2023 by December 1st, 2022. Assuming this pilot program continues, we will also provide 30 days’ notice on the Maker forum, any updated terms, so that is part one on just notification. Part Two, specifically regarding the FOMC meetings, I want to ensure there is no confusion around this. Our institutional rewards program is determined slowly at our discretion; this specific rate, any potential changes to that rate is a business decision. And it is not tied in any shape or form to the FOMC meetings. While the fed funds target rate may change the overall macro environment conditions and may be an indirect aspect of what we look to, I want to ensure these commercial objectives meet. We are not performing any mathematical or formulaic connection between FOMC and the institutional rewards rate.    09:36   Prose11: Is Maker, as a client, capped at 1.6 billion, given that guidance on rates? Can we add more if our PSM continues to grow?   Alesia Haas: We would love to grow with Maker, so going back to my first stated goal, we would love to grow assets on our platform. We would love to grow USDC, so there is no cap, and we would strongly encourage leveraging our custody solution to keep more of your balances and assets as secure as possible.    10:25   Prose11: What rights and access to funds under the custody does Coinbase have and plan to have? What can happen with these funds while they are under your control?   Alesia Haas: You need to know two things. Under our terms of service, you always have access to your assets. Coinbase cannot unilaterally act on your behalf. We will not do anything unless explicitly directed to do so by those whom Maker designates to act on this account. Some commenters have speculated that Coinbase would control Makers assets, and there has been some erroneous assumption that this is some loan arrangement. We want to make it very clear this is not alone. There is no unsecured lending proposal here. We will not have any control; we will not be rehypothecation; we will not be doing anything to put these assets at risk. This is purely a custody arrangement where you will put the assets in custody on the Coinbase platform, and we will be paying a reward rate, as we previously discussed. There is nothing that we will be doing with these assets.    11:52   Prose11: What is the ideal counterparty in this scenario, given if Maker can not be its legal entity?   Alesia Haas: It is a little bit tricky. What I think is most important here is that we have some minimal minimum eligibility criteria, we need to have a tax ID, and we need to make sure that the selected legal entity has legal substance, but ultimately, this is Maker’s decision. As we shared earlier, Maker is on onboard of several entities at Coinbase. We have a team standing by to help Maker make that decision about what is the best legal entity on your side. We are agnostic as to what legal entity is on-boarded as long as it meets those basic eligibility criteria.    12:51   Prose11: What relationship does this current product offering have with the services Coinbase discontinued a year ago? What were those services, and why was this shifting group?   Alesia Haas: There is no relationship between the Coinbase institutional reward program we are discussing today and the Coinbase lend product. I think you are referring to a retail product that we had announced but failed to move forward due to SEC concerns over the product. First of all, no correlation, no relationship between these two products. One was a retail product; this was an institutional product. There are different rules and different structures for these two products. We feel very confident in the program that we are offering you with the Instant Rewards Program.    13:54   Prose11: Could you share if there are any plans to expand the rewards program beyond custody services?   Alesia Haas: This is a beta product; as you recognize, you are the first client we are onboarding to this program. When we think about these things in beta, we are learning from them and building our muscles in them, and if successful, we would be delighted to expand this product and service. It is important to note that this is a receiving reward on its balance at Coinbase. This includes assets in custody, cold storage, and anything in your trading balance that you may have. We have ambitious plans for the institutional rewards program to move forward and will keep the community apprised of developments as opportunities may or may not expand. Again, because it is a pilot program, we will learn we will expect to revisit the reward structure periodically. If successful, we hope to expand and grow in everything we do.    15:15   Prose11: Is there a set communication frequency or guideline Coinbase is looking to keep up on for clients like Maker?   Alesia Haas: At this point, the rates are the most important because we would not change any terms of service. Still, with any change to our contractual terms of service or our products, similar to the rates, we will provide notice and typically follow the 30-day notice program. If that changes, we will return it to the community and share it for future dates.     Conclusion 17:16   Prose11: I want to add a slight disclaimer at the end. This is a joint venture with GovAlpha and SES to put this call on. We work with Coinbase to get these questions out there through the forum and its threads. Please let us know if you feel your question was not answered.   Credit  Andrea Suarez produced this summary. Everyone who spoke and presented on the call.  ",
                    "links": [
                        "https://youtu.be/3W7medDj6Z8?t=19",
                        "https://youtu.be/3W7medDj6Z8?t=1036",
                        "https://www.youtube.com/watch?v=3W7medDj6Z8",
                        "https://youtu.be/3W7medDj6Z8?t=19",
                        "https://youtu.be/3W7medDj6Z8?t=147",
                        "https://youtu.be/3W7medDj6Z8?t=276",
                        "https://youtu.be/3W7medDj6Z8?t=412",
                        "https://youtu.be/3W7medDj6Z8?t=500",
                        "https://youtu.be/3W7medDj6Z8?t=576",
                        "https://youtu.be/3W7medDj6Z8?t=625",
                        "https://youtu.be/3W7medDj6Z8?t=712",
                        "https://youtu.be/3W7medDj6Z8?t=771",
                        "https://youtu.be/3W7medDj6Z8?t=834",
                        "https://youtu.be/3W7medDj6Z8?t=915",
                        "https://youtu.be/3W7medDj6Z8?t=1036",
                        "https://forum.makerdao.com/t/govcomms-monthly-update-september-2022/18396",
                        "https://forum.makerdao.com/t/relay-semanal-21-de-septiembre-28-de-septiembre-de-2022/18275",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/18"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.853727324263039
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#15",
                    "likes": "0",
                    "time": "28/09/2022-01:27:36",
                    "content": "Thanks for posting the link. Great job facilitating the interview and curating community questions. A few highlights below:   Rehypothecation: Assets (PSM USDC) are Maker assets and Coinbase hold them in a segregated account just holding MKR’s USDC, Coinbase does not have the ability to rehypothecate Maker’s assets. Coinbase is not taking additional risk with client assets.    OFAC-related: Coinbase has to comply with OFAC, and it would Maker’s representing entity that needs to be OFAC compliant. Its Maker that decides which entity it chooses to represent it and therefore remain OFAC compliant.    Coinbase Incentive: Accumulating assets on platform is a key metric that Coinbase reports to its investors. Coinbase is looking to grow USDC and by retaining USDC in Coinbase’s custody they ensure it stays on track. By expanding Coinbase partnership with Maker, its signal Coinbase’s long-term strategic goals    Program Rate Notifications: Coinbase will be updated by December 2022 for the reward rates to the 2023 program. 30 day notice period will be conveyed in the Maker Forum ahead of any rate changes. Coinbase’s reward rate is not tied to FOMC rate changes in any way    Program Balances: There is no program cap, Maker can add more balances at its discretion    Fund Accessibility: Maker account signers/representatives are the only persons that can move/transfer funds between Maker’s account at Coinbase and Maker’s account    Maker Counterparty: Maker is currently onboarded to Coinbase and its our decision which one to onboard that meets Coinbase’s minimum eligibility criteria (TIN)    Product Discontinuation: No relationship between Institutional Rewards Program and the Retail Lent program    Program Expansion: If this pilot program is successful, there are plans for expansion    Based on the MIP, discussion and interview, this is a very interesting proposal from a key crypto counter party with a lot of clear benefits, limited risks and future growth opportunities. My only concerns at this point are   Maker’s accessibility to withdraw or deposit more funds: what criteria does Coinbase utilize to grant transfers, are the criteria related to authorization (confirming that the request is coming from an authorized party), are there transfer limits (e.g. daily limits), FCC/KYC related or something else?   Are risks mitigated to prevent Maker representatives from transferring funds outside the program accounts? Are there guardrails setup in place to ensure safe transfer of funds, i.e. only allow transfers between Maker’s PSM to Maker’s account at Coinbase and vice versa. Can it be setup so that governance polls trigger transfers instead (if this is beneficial to a trustless/decentralized operation?   ",
                    "links": [
                        "https://forum.makerdao.com/t/relay-semanal-21-de-septiembre-28-de-septiembre-de-2022/18275"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.887755102040816
                }
            ]
        }
    ]
}