{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/why-not-be-on-etc-platform/2903",
            "title": "Why not be on Etc platform ",
            "index": 2903,
            "category": [
                "Governance"
            ],
            "tags": [
                "idea"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Jaybro91",
                    "index": "#1",
                    "likes": "0",
                    "time": "20/06/2020-15:41:27",
                    "content": "can someone help me understand platforms. My question is, why are we built on Ethereum and not Ethereum Classic? Do we not want code to be law? My other question is from my understanding Ethereum Classic is a layer 1 and Ethereum is layer 2. So if that’s true would that make MakerDao level 3? ",
                    "links": [],
                    "GPT-summary": "The author is asking for clarification on why a certain platform was chosen over another and is seeking to understand the differences between them. The post does not contain a proposal, but rather a question about the technology being used.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.697916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#2",
                    "likes": "4",
                    "time": "21/06/2020-00:16:12",
                    "content": "Both Ethereum Classic and Ethereum are layer 1. Ethereum is the most used of the two platforms, which is the reason that makerdao and essentially all defi apps are built on Ethereum. People pushing ETC may not like this, but Ethereum has kind of won as the platform of choice between the two. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.583333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jaybro91",
                    "index": "#3",
                    "likes": "0",
                    "time": "21/06/2020-00:46:08",
                    "content": "The only problem I see is transactions can be reverse. I don’t know if a hacker can come in and start reversing contract transactions. I’m not so sure how safe MakerDao is with reverse transactions. Its my belief later people will switch to Etc for security. From my understanding Ethereum was created in order for people to get there money back. I wouldn’t be surprised if MakerDao get caught in a heavy loan failure due to eth etc convert. Seems like  great tool to use later in life. To get money on a loan failure. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.392361111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#4",
                    "likes": "5",
                    "time": "21/06/2020-00:56:13",
                    "content": "    Jaybro91:  The only problem I see is transactions can be reverse.   The ETH/ETC debate goes back to the DAO hack from 2016, and subsequent hard fork to recover funds. Note that ETH has not has any other hard forks to recover funds since then, e.g. the Parity multisig issue. ETC on the other hand has had a well publicized 51% attack, and many exchanges require 1000+ confirmations before crediting ETC deposits. For now, ETH is far and away the most reliable base layer. ",
                    "links": [
                        "https://www.parity.io/security-alert-2/",
                        "https://blog.coinbase.com/ethereum-classic-etc-is-currently-being-51-attacked-33be13ce32de",
                        "https://forum.makerdao.com/t/week-3-dai-distributions-sourcecred-trial/2920"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.757575757575758
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChainLinkGod",
                    "index": "#5",
                    "likes": "2",
                    "time": "21/06/2020-01:01:05",
                    "content": "I would also like to add to this, Ethereum has a thriving ecosystem of tokens which can be used as collateral for minting DAI (https://coinmarketcap.com/tokens/), a vast array of DeFi applications that uses DAI as a currency (https://defipulse.com), and it is a blockchain with by far the largest network effect of users and developers. Ethereum Classic, as far as I’m aware, doesn’t have any users to speak of, very minimal amount of tokens that generally nobody sees value in, a nearly non-existent developer community, and like Monet mentioned has already been 51% attacked. ",
                    "links": [
                        "https://defipulse.com"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.397916666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jaybro91",
                    "index": "#6",
                    "likes": "0",
                    "time": "21/06/2020-01:09:24",
                    "content": "Thats because no one is really using etc low hashing power if people was using etc there 51% attack probaly wouldn’t have happened. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jaybro91",
                    "index": "#7",
                    "likes": "0",
                    "time": "21/06/2020-01:16:00",
                    "content": "I agree thats why it got 51% attack. People diffently think etc has value. Perhaps people are take postion over time on coins in order to get price averaging. Ethereum Classic is the original chain, before the bad coding not really hack. People just got trick out there money through coding. Now y’all are trying to make etc sound like a bad system. I see how people lose there money. With the lack of open mind on this topic I now see how this coin can get heavily diluted. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.526041666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#8",
                    "likes": "0",
                    "time": "21/06/2020-04:13:47",
                    "content": "The ETH ecosystem is unmatched by other public chains. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/wjmelements",
                    "index": "#9",
                    "likes": "1",
                    "time": "21/06/2020-09:10:57",
                    "content": "ETC is an empty blockchain. MKR is not on it. Maker should only create value for MKR holders. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/befitsandpiper",
                    "index": "#10",
                    "likes": "0",
                    "time": "21/06/2020-14:36:45",
                    "content": "You’re making it sound like the reversal on the DAO hack was this horrible thing. Most people disagree. Those funds were hacked, aka stolen, and the hard fork returned funds to their rightful owners. Also keep in mind the transactions were not actually reversed, they were hard forked. A hacker can’t come in and reverse transactions, at least without a 51% attack. Someone could hard fork Ethereum and try to make it more popular than than the original… but uhhh… good luck! Unless the community agrees with you by nearly consensus, the new fork will not go anywhere. So there’s no security issue here based on the DAO forking. ETH is much more secure than ETC. At the core of your questions though is a legitimate philosophical discussion: whether it is better to have an immutable ledger that accepts catastrophic errors as the responsibility of individuals and the community at large because “code is law”, or that blockchains should be symbiotic democratic systems between code and people and a situation we all agree is bad should be able to be fixed in a democratic way. Personally I find the second option of people able to use all tools we have available, including hard fork when bad things happen, the most robust way for blockchains to grow and function. Code errors happen inevitably, humans are fickle. If code is faulty it will produce poor results and sometimes it makes sense for that to be fixed. The fact that code issues can be fixed retroactively with public blockchains is a feature, not a bug. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.4028761642398
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jaybro91",
                    "index": "#11",
                    "likes": "0",
                    "time": "21/06/2020-20:09:20",
                    "content": "Ok, y’all are the experts im just an investor looking in from the outside. Im not saying fork is a bad thing, I’m just saying how the majority decided to fork the majority can decide to convert to ect then there wouldn’t be easy for a 51% attack. It will just as secure as eth infact more secure due to code is law. Which won’t be a problem as long as are eth collateral is not over weighted by eth. I know this is the risk you take when investing but I just wanted the community to seriously think about that. We will all most likely make money due to our entry level. But what happens to the new investor 10yrs from now if we are over levered in bad collateral. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None"
                    ],
                    "Sentiment": 5.278787878787878
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#12",
                    "likes": "0",
                    "time": "30/08/2022-15:56:41",
                    "content": "Dropping in on this old thread to cross post my comment here:     Merge Risks and Market Impacts Research       I’m thinking  - plot twist - it’s more likely miners will switch to ETC and things get really interesting. Opportunity may be ahead to deploy there and/or add ETC as a new crypto collateral with potential to mitigate vault demand loss from ETH staking.     Full disclosure: ACREinvest affiliates have been involved in ETC ASIC mining, but on a small scale for research purposes. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.742424242424242
                }
            ]
        }
    ]
}