{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/summary-discussion-of-parameters-for-scd-shutdown/1130",
            "title": "Summary/Discussion of Parameters for SCD Shutdown ",
            "index": 1130,
            "category": [
                "Governance"
            ],
            "tags": [
                "summary",
                "emergency-shutdown",
                "scd-shutdown"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "5",
                    "time": "16/01/2020-15:25:43",
                    "content": "The results are in! After weeks of discussion and voting, I have closed the final signal polls for SCD Shutdown. To recap, with the community currently trying to maintain 2 separate Dai credit systems, I thought it imperative to begin the process of collecting opinion on when we should shut down the legacy system. Especially since there seemed to be a lack of consensus on the issue. This led me to begin with a signal on “When should we trigger SCD Global Shutdown”.     Signal Request / Poll: When should we trigger SCD Global Shutdown? Governance       Now that MCD Dai has flipped SCD Sai, I think now is a good time to begin discussions on what a timeline for global settlement of SCD could look like. I would like to gather sentiment on whether governance prefers a date threshold, a supply threshold, a peg threshold, a combination of the three, or something completely different. If we can come to some sort of consensus on what type of threshold makes sense, we can begin to get granular about the actual threshold parameters.  In summary: I will …     With this first signal I asked the community to vote for which parameters they wanted to see used to determine when SCD should shut down. Here is an image of the results:  Screen Shot 2020-01-16 at 9.11.03 AM698×439 17.6 KB  At the conclusion of this poll I determined that the vote was inconclusive and wanted to confirm that the community indeed wanted both supply and date to be used as deciding factors in shut down. I had discussions with @LongForWisdom  on the peg stability and we determined that regardless of vote outcome it would be important to have some signal data on peg deviation from a risk perspective. I may have taken some liberties on unilateral decision making in this regard so I wanted to be transparent about that. After these conclusions I made 2 more signal requests. The first one for determining whether Date and/or Supply should be included as shut down parameters.     Signal Request: Parameters for SCD Shutdown - Date vs Supply Governance       This post is a continuation of my previous signal request here:    I have now concluded that poll and come to the conclusion that the voting is quite split. Due to this turn of events I can gleam the following information:    The options of date and supply as shutdown parameters need to be ratified in a single poll to ensure voters want one or both options.    The peg stability % (while not receiving as many votes as the other 2) is an important facet of the shutdown decision making and should r…     Here are the results:  Screen Shot 2020-01-16 at 9.40.56 AM701×336 12.8 KB  The second poll was to determine the specific threshold of peg deviation required to trigger SCD shutdown.     Signal Request: Parameters for SCD Shutdown - Peg Stability Governance       This post is a continuation of my previous signal request here:    As well as directly connected to the ongoing polling process here:    In this forum post we will determine whether a parameter for Sai peg stability should be included in the Global Shutdown parameters and what that value will be. The following question must thus be answered:  At what value does Sai have to be in order to trigger SCD Global Shutdown?  poll I found writing these options confusing so if you don’t understand or have…     Here are the results:  Screen Shot 2020-01-16 at 9.42.58 AM698×532 14.9 KB  Once it was clear that community members wanted both date and supply as parameters, I could create signal requests more specific to each. First I created a signal request for Shutdown Date.     Signal Request: Parameters for SCD Shutdown - Date Governance       Now that the previous poll has closed here:    we can further clarify the final Shutdown Parameters. Specifically Shutdown Date in this post.  In the following section I will post a poll that includes options for # of months before SCD Shutdown. Please note that I think it’s in our best interest to not get too granular in our options so the options won’t be all encompassing but should give enough room for fair choice. Please choose the option that is closest to your viewpoint. If you don’t like …     Here are the results:  Screen Shot 2020-01-16 at 9.54.07 AM699×487 12.1 KB  Next I created a signal request for Supply threshold required to trigger Shutdown.     Signal Request: Parameters for SCD Shutdown - Supply Governance       Now that the previous poll has closed here:    We can further clarify the final Shutdown Parameters. Specifically Shutdown Supply in this post.  In the following section I will post a poll that includes options for Sai supply left to trigger SCD Shutdown. Please note that I think it’s in our best interest to not get too granular in our options so the options won’t be all encompassing but should give enough room for fair choice. Please choose the option that is closest to your viewpoint. If you d…     Here are the results:  Screen Shot 2020-01-16 at 9.56.34 AM697×490 18.7 KB  In conclusion (TL;DR):  Determined data from community was required to determine when/if to shut down SCD system Created Poll to determine which factors were important Created Polls to determine specific thresholds required to activate SCD Shutdown  Poll Results Summary:  Peg Stability - +/- $0.05 (38% Consensus) Sai Supply - < 10 Million (44% Consensus) Date - 6 Months (39% Consensus)  Next Steps Now that we have determined some consensus on SCD Shutdown Parameters I would like to use this post for final discussion on the topic. If community members have strong opinions that have not been brought forward or others would just like to talk through more options, now would be the time. I am aware of discussion ongoing about the Tax function of SCD to repatriate unpaid CDP fees and this is something we should be aware of as discussion continues. Here is another great discussion on the topic.     Global Settlement of Single Collateral Dai Governance       It’ll stay there until the owner of the sai trades it in for equivalent ETH$ at shutdown time.     Once some time has passed (7-14 days) I think we can use this information in tandem with Foundation members to create a formal proposal to move these parameters on-chain. I look forward to discussion on next steps. Thank you for your participation! ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-parameters-for-scd-shutdown-date-vs-supply/970",
                        "https://forum.makerdao.com/t/signal-request-parameters-for-scd-shutdown-peg-stability/971",
                        "https://forum.makerdao.com/t/signal-request-parameters-for-scd-shutdown-date/1044",
                        "https://forum.makerdao.com/t/signal-request-parameters-for-scd-shutdown-supply/1067",
                        "https://forum.makerdao.com/t/global-settlement-of-single-collateral-dai/1121/12",
                        "https://forum.makerdao.com/t/single-collateral-dai-shutdown-details-and-context/1978",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-friday-life-comes-at-you-fast-edition-march-20-9am-pst-4-00-pm-utc/1725/3",
                        "https://forum.makerdao.com/t/signal-thread-scd-shutdown/1673",
                        "https://forum.makerdao.com/t/signal-request-parameters-for-scd-shutdown-supply/1067/3",
                        "https://forum.makerdao.com/t/signal-request-parameters-for-scd-shutdown-date/1044/9",
                        "https://forum.makerdao.com/t/signal-request-parameters-for-scd-shutdown-peg-stability/971/11",
                        "https://forum.makerdao.com/t/huge-reputational-market-and-operational-risks-in-the-current-scd-shutdown-plan/2293/3",
                        "https://forum.makerdao.com/t/signal-request-discussion-should-we-implement-a-tax-during-scd-shutdown-to-recuperate-unpaid-stability-fees/1166/32",
                        "https://forum.makerdao.com/t/signal-request-discussion-should-we-implement-a-tax-during-scd-shutdown-to-recuperate-unpaid-stability-fees/1166",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-january-16-9am-pst-5-00-pm-utc/1126/2",
                        "https://forum.makerdao.com/t/weekly-maker-recap-pilot/1137/4",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-january-23-9am-pst-5-00-pm-utc/1165/2"
                    ],
                    "GPT-summary": "The author of the post is explaining the process of collecting opinions on when to shut down the legacy Dai credit system, and the results of the polls conducted to determine the parameters for SCD shutdown. The post also invites further discussion on the topic and mentions ongoing discussions about the tax function of SCD. A 3rd party gives constructive criticism and asks questions about the parameters for SCD shutdown.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.517573696145125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#2",
                    "likes": "2",
                    "time": "22/01/2020-01:44:27",
                    "content": "@Primoz did a presentation last Thursday and had some very interesting data points which describe the last 2 months of behavior of the remaining 100 top CDP owners that account for 90% of Sai debt. I feel these stats may be relevant to this conversation, so here they are:  Also want to point out Cyrus’s inquiry and the ensuing dialogue about the role of the 12m inactive Sai vs the 8m Sai from debt-increasing CDPs. It’s worth rewatching to understand the logic for what could be a solid basis for deciding the appropriate Sai supply for Global Settlement: 1:00:34 ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.305555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "4",
                    "time": "22/01/2020-02:38:23",
                    "content": "It’s interesting that heuristically the crowd reached consensus on Supply threshold of 10M when that aligns so well with the data, meaning ~8-12M may never get migrated. The one thing that concerns me is having supply/peg thresholds while at the same time having the tax strategy. If we planned on taxing CDPs in the last 4 days but supply hit 10M the month before that, that would be a problem as we would no longer be able to extract the remaining stability fees. Anyone have thoughts on how we can reach consensus on this issue? Do we need to set up another signal request to see if the tax idea is even a good one? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 6.699999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "3",
                    "time": "22/01/2020-09:56:06",
                    "content": "Personally I am not a fan of the tax idea, it’s difficult to tell how many people agree or disagree with it currently. I think a tax related signal request would be a good idea. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.583333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#5",
                    "likes": "2",
                    "time": "18/03/2020-03:11:17",
                    "content": "Due to a lack of movement on lowering the SCD Debt Ceiling/migration contract, we had decided to postpone polling on SCD Shutdown. Now that market conditions have changed drastically we are again initiating discussion on this topic. Therefore, a new thread has been opened here:     Signal Thread: SCD Shutdown       With the extreme market changes we have seen in the past week, we have decided now would be a good time to once again engage in discussion about shutting down Single Collateral Dai.  During today’s call, @Primoz and @Vishesh  presented information on the state of SCD. In summary of their findings it became apparent that peg instability and liquidity issues were beginning to hinder the efficiency of the protocol. Liquidations were no longer taking place in an ideal fashion due to cost inefficienc…     Thank you all for participating in this thread. I hope to see you all in the next thread! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.424717958808868
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "0",
                    "time": "18/03/2020-10:27:32",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}