{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/money-creation-mechanism/8986",
            "title": "Money creation mechanism ",
            "index": 8986,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/ivomarin1995",
                    "index": "#1",
                    "likes": "0",
                    "time": "28/06/2021-06:04:04",
                    "content": "Hey guys just one ide to pass along. Why are you building the same system we currently have with the banks when we could simplify the money creation mechanism. Instead of bringing money into economy a through the debt mechanism why wouldn’t we simply create money as a part of production mechanism. For example a simple car manufacturing company would with every car they produce also could produce the money that car is worth. There would be no debt in the system the car company has to carry and also if the car company is forsed to spend all of earned and created money there would be enough money for the private person to purchase the car. There would be no need for debt. Maker could be a service provider for companies that want to issue their own money, ‘credit’. I know this is novel to think about but it would put liabilities on companies for money creation just like they are liable for creating products. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.444444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "2",
                    "time": "28/06/2021-10:45:39",
                    "content": "So my very first thought is that there would be no price discovery mechanism if the production was automatically paired with a price. You would quickly run into central planning, with the money-creator effectively deciding how much things were worth — and thus how much of each is produced. This was the Achilles heel of communism (along with more well known incentive and lack of freedom problems) and is known in economics as the Calculation Problem. You’d never be able to determine a price level for something without some form of mechanism (like a market) that measures both the direction and the magnitude of preference. Remember that money is a way to ration finite resources amongst infinite wants. There are other methods — like standing in line — but resources cannot be magicked into existence, even by a central bank. We do need more people thinking about monetarism, though, so thanks for bringing this idea forward. It’s really important that the DAO begin to immerse itself in the ebbs and flows of money supply as Maker grows. We probably only have a few years before our decisions will have measurable impacts on the real world economy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.148148148148148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "3",
                    "time": "28/06/2021-14:39:41",
                    "content": "Besides, you cannot create money out of nothing, see my country Venezuela. Money must go hand in hand with certain guarantees that see it as a store of value and unit of account. In an over-producing economy money as you put it would have no value, because how do you generate demand for the product in the first place and how do you pay for it afterwards? A similar case that I invite you to read is EOS MICROLOAN, from the EOS chain, where they proposed a credit system, for example I bought a $400 motorcycle, I had that credit open and I was paying it in parts, when I paid it I generated a token that also had a value. The project failed because how do you give money, credits or a product without guarantees? the system has no way to protect itself against an attack of actors from ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.964285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#4",
                    "likes": "1",
                    "time": "28/06/2021-15:45:20",
                    "content": "It’s not a novel approach. It has done so many times in crypto and failed miserably. For example, look at most of algo stablecoins without collateral and minted aggressively. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#5",
                    "likes": "1",
                    "time": "28/06/2021-16:21:35",
                    "content": "It’s almost by rule that they are a scam or for sure they dumpe them for exploits xd. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ivomarin1995",
                    "index": "#7",
                    "likes": "1",
                    "time": "29/06/2021-09:55:07",
                    "content": "Hey, thanks for a response. central planing not possible because the cost of a product would equal material + labor + profit = cost of a product, anyone could come to the free market and compete by issuing their own credit and promising to deliver products at lower price. Notice the difference right now we issue our own credit through the banks, banks don’t loan money to us they create money into existence. With a self issued credit there would be no debt in the system like we have now, the debt that threatens to destroy whole countries World Debt Clocks and also in self issued credit you are responsible to pay back in products and services. Not in money, if there is no money you can’t pay back your debt, so you go bankrupt. Here if you can’t deliver products and services your assets or what you pledged as collateral is seized, but you should be in control of your production, which is not same in terms of money. We don’t know if there is enough money to pay back the debts plus interest which banks requere us to do. Yes money should be a finite resource just like our ability to produce. If you can produce something then you should be able to deliver the money for customers to purchase your production. Today we have no idea if you are gonna produce something and people could afford it. Nice to have a conversation about these topics please if you have time watch this serie please https://youtu.be/hBj8YrHJru0 ",
                    "links": [
                        "https://youtu.be/hBj8YrHJru0"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.943609022556391
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ivomarin1995",
                    "index": "#8",
                    "likes": "1",
                    "time": "29/06/2021-10:17:45",
                    "content": "Hey thanks for response. The problem with small countries is not only irresponsible governments but lack of faith in the currency. Whenever you get paid in Venezuelian currency you quickly spend it or change it for dollars. remember you need HODLers, nobody wants to hodl Venezuealian currency that is why it starts to inflate. In overproducing economy you would have abundance of product and if people don’t want some products the issuer would not be able to issue more credit and produce that product any more. The design would be a full recycling if you produce something and create a credit for it, people will have a claim on your product. If people don’t want your product and you can’t sell it then your credit is worthless. Also if you produce efficiently, sell well and try to hodl on your profits your credit will be worth more creating imbalance, people would be able to spend less in order to buy your products. The full recycling would be put in place. If there are products and services the money should be there to purchase these. Money as scarce commodity creates problems if we were to go back to gold standard, only one who have gold are the one with the real money and if they lend it at interest they could end up with the whole money supply. bitcoin is not money because there is finite supply and it creates wealth gap. The people with bitcoin have no obligation to spend so that you can earn it. hey if you would like to know more about money please watch this serie https://youtu.be/hBj8YrHJru0 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.932539682539683
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ivomarin1995",
                    "index": "#9",
                    "likes": "0",
                    "time": "29/06/2021-10:20:04",
                    "content": "Hey tnx for response. No I do not propose money creation out of nothing. Money would be backed by production. It would be backed by local builders and firms which do create the real wealth in the world. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#10",
                    "likes": "3",
                    "time": "29/06/2021-11:37:08",
                    "content": "I don’t wanna be harsh but even car companies and etc that you mentioned don’t create money. They have to sell their cars for money. Why don’t they do what you are proposing? It’s not because they are dumb but because it doesn’t work. Also Maker is a DeFi protocol. How are we going to plug in offchain stuff like local builders and firms? Now if you are meaning having real world assets as collateral to mint Dai then sure, that is already happening. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#11",
                    "likes": "3",
                    "time": "29/06/2021-19:11:06",
                    "content": "I think you have to understand that the economy is driven by incentives and not necessarily by the creation of a good or thing. Most of the money we know is created based on credits (a very basic understanding so as not to fall into technicalities), which stimulate the growth of a company or person and makes the cycle continue in a downward chain. As @Doo_StableLab says around here the closest thing we have nowadays is the RWA which is to put a property as collateral to obtain a credit. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ivomarin1995",
                    "index": "#12",
                    "likes": "1",
                    "time": "30/06/2021-08:20:55",
                    "content": "No problem. I think they never had a chance before to experiment. Everyone assumes there is enough money in circulation but time and time again we see that people want good quality products which are unaffordable for them, in turn they are thrown away and replaced by cheap products which are the only ones people can afford. Again nobody thinks about this “how much money is there”? and if all what can be produced can be bought?, another point we never had technology to experiment with this stuff but with ethereum and the down of L2 stuff finally there is the tech. Companies just assumed banks are responsible for money creation and they focused on production. I think the maker is awesome and the decentralized dollar is a great first step but if maker continues to issue dollars backed by real assets through credit we didn’t accomplish anything new, just transferred risk from the banks to maker holders. Maker will also become too big to fail in the end just like banks. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.076936026936027
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ivomarin1995",
                    "index": "#13",
                    "likes": "1",
                    "time": "30/06/2021-08:43:15",
                    "content": "Hey thank you for taking the time to respond to this thread. Yes I agree incentives are what drives the humans and if you create an incetive for people to borrow money into existence you put them under the pressure to perform a job and payoff that credit in money that may be there or may not. Money creation through credit has led rich countries into poverty. I work in Germany and boy everybody just barely gets by here, people are so much in debt slavery it’s almost as if they are forced to work. they don’t work because they want to but because they have to pay back the debt, and the fact is you can never pay back the debt because “the debt is money”, if you pay back the debt as a general society there would be no money in existence. We should create the technology to serve people and we are here to solve the ones of the most pressing issues of humanity, peer to peer money. If we relay on maker instead of banks, we didn’t accomplish much. Maker could be service technology and service provider for the companies that want to experiment with new approaches and of course back them up with credit for the start, but the maker should never bare the burden of the whole society to be responsible for money creation, replacing the banks with the new fancier blockchain banks. please if you want to educate yourself of the true nature of money and the destruction of money creation through debt follow these links :     https://youtu.be/Vw0RTGoGn1g https://youtu.be/hBj8YrHJru0 ",
                    "links": [
                        "https://youtu.be/Vw0RTGoGn1g",
                        "https://youtu.be/hBj8YrHJru0"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.609625668449198
                }
            ]
        }
    ]
}