{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/vault-holder-advocacy-group-legal-risk-in-makerdao-meeting-w-a-special-guest-and-former-financial-services-regulatory-and-transactional-lawyer-sam-proctor/3846",
            "title": "Vault Holder Advocacy Group: Legal Risk in MakerDAO Meeting w/ A Special Guest and Former Financial Services Regulatory and Transactional Lawyer: Sam Proctor ",
            "index": 3846,
            "category": [
                "Core Units",
                "Risk"
            ],
            "tags": [
                "alignment",
                "rates",
                "mips",
                "legal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#1",
                    "likes": "13",
                    "time": "27/08/2020-14:36:16",
                    "content": "Guided by the ambition of onboarding RWA, We announce the following: Subject to the enactment of the Vault Holder Advocacy Group by Executive vote: A meeting hosted by @akiva will take place on Monday September 14th 9am Pacific Noon Eastern 4pm UTC with special guest Sam Proctor CEO of Genesis Block to discuss the following topics:  Legal structures available at our disposal to be utilized for the sake of onboarding RWA The pricing of Risk Parameters which are appropriate for such structures  An invite link shall be posted subject to the passing of the August Monthly Mips Executive. ABOUT Sam Proctor is CEO of Genesis Block, a firm which advises on legal strategy and other related business matters. It also owns as a subsidiary GB Capital Markets, a FINRA registered Broker-Dealer with Investment Banking activities. @akiva (Akiva Dubrofsky) is CEO of Akiva Capital, a firm that specializes in providing the necessary tech for the execution, settlement and clearing of derivative contracts that help Maker users hedge DSR and Base Rate exposure. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.999627976190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#2",
                    "likes": "0",
                    "time": "28/08/2020-14:26:46",
                    "content": "@Akiva this is a great idea. There are a few avenues we’ve been looking at for dealing with RWAs in MCD. When dealing with security tokens (which DROP fall into) this is one way we have identified. Treating the keeper auction as sale of regulated securities and making sure that this is done in a compliant way. Broker-Dealers and Transfer Agents are a likely component of this ecosystem and I’m looking forward to hear what Sam is going to share with us about this. I think though this probably is better named: Legal Risk for Security Tokens Meeting and not Legal Risk in RWA Meeting as neither @mrabino1’s proposal using the trust structure without any collateral onchain and our proposed liquidation mechanism for short term assets are a different category but both considered RWAs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.944444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Akiva",
                    "index": "#3",
                    "likes": "1",
                    "time": "28/08/2020-17:20:50",
                    "content": "Thank you for your feedback Lucas Ok as per your suggestion I changed the title to something that will hopefully be more palatable to you. It turns out the event will not be happening as planned because the executive vote didnt pass. Instead I may do a working group for my subproposal. Btw the question we are dealing with does not have to do with keepers broker-dealers or transfer agents. The question we wanted to deal with is “how can MakerDAO participate in contracts given that MakerDAO is not a legal entity” Hopefully we can reschedule this for October or November after some proposal passes for dealing with risk parameters. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#4",
                    "likes": "0",
                    "time": "29/08/2020-03:52:42",
                    "content": "I will put forward some questions about Centrifuge’s proposal, but it does not seem right to couch mrabino1’s proposal with your company’s. I’ll detail my thoughts on why soon. Still, I think the DAO would do well to learn the legal/securities positioning your team is relying on to make statements about the new model no longer needing a broker-dealer at any point. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.055194805194805
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#5",
                    "likes": "0",
                    "time": "29/08/2020-06:08:27",
                    "content": "    Akiva:  Btw the question we are dealing with does not have to do with keepers broker-dealers or transfer agents. The question we wanted to deal with is “how can MakerDAO participate in contracts given that MakerDAO is not a legal entity”   I think the discussion is a good to have and it needs to happen. If you are doing a working group, Centrifuge would gladly join. We are actively working on the topic of security tokens in liquidations on our end. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#6",
                    "likes": "0",
                    "time": "29/08/2020-06:14:53",
                    "content": "    Tosh9.0:  I will put forward some questions about Centrifuge’s proposal, but it does not seem right to couch mrabino1’s proposal with your company’s.   That was never the intention, I said those two concepts are distinctly different from security tokens offered through a broker dealer which is what this call was supposed to be about. I’m actually curious though, what do you think of mrabino1’s proposal? Your comments have been good questions in all of our applications so far. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.985714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#7",
                    "likes": "0",
                    "time": "29/08/2020-22:29:09",
                    "content": "Re mrabino, it’s interesting, tbh. I like the idea of relying on the historicaly trusted actor to initiate the asset pull in case borrow co is delinquent payments. I might be crazy but a Trust Co. has a reputational risk for its general business if it fails to act. We’ll see how it evolves though. The more options, the better for the DAO at the end of the day. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#8",
                    "likes": "1",
                    "time": "30/08/2020-08:32:31",
                    "content": "The trust structure in the US is quite unique and can be an interesting venue for us. I don’t see @mrabino1’s proposal as conflicting with what we’re doing. In fact using a trust as the legal entity coupled with our tech stack can probably add a layer of security that the SPV we use right now currently does not have (although with a backup servicer in place today, we already have an entity that can directly interfere in the SPVs operations should the asset originator stop servicing it adequately). Our efforts in the liquidation mechanism that we proposed are twofold:  It is an efficient way of liquidating short term collateral independent of the legal questions that you face otherwise It is a simple and safe solution that we can deploy quickly. This is is a major advantage over a solution with a trust and a BD setup.  In our conversations with our legal counsel we did evaluate using a professional trustee to take this role and while legally possible, as you said “they have a reputation at stake” and are very very careful with doing anything that is out of the ordinary. The risk for them is simply too high given the at the moment relatively small opportunity for them. It will cost hundreds of thousands if not millions in legal fees (I’m not exaggerating) to go through this and will take months. That itself shouldn’t be holding us back to actually pursuing it as long term it will probably be worth it. But launching at a small scale with other options has big advantages: we learn about all the other issues that come with onboarding this new collateral to Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.438475716991342
                }
            ]
        }
    ]
}