{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/reddit-seems-to-dislike-the-expenses-of-running-the-protocol/18924",
            "title": "Reddit seems to dislike the expenses of running the protocol! ",
            "index": 18924,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "NONE"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MungoBlakey",
                    "index": "#1",
                    "likes": "1",
                    "time": "24/11/2022-17:26:48",
                    "content": "Is reddit relevant to the community discussion and is the post a signal of larger discontent amongst smaller MKR holders? The Post ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "2",
                    "time": "24/11/2022-17:41:17",
                    "content": "I don’t think the forums are happy about the expenses either.  The problem is that CUs are strongly incentivized to fight for higher budgets. They will spend quite a bit of time and effort justifying them. They also don’t have much oversight on spending. MKR holders, meanwhile, are barely involved in budgeting. They rely on Delegates, who are politicians and don’t have a direct stake in spending. Governance also generally isn’t very knowledgeable about spending(partly due to lack of oversight on it), so is afraid of breaking something if they fight too hard against budget proposals. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.484848484848484
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#3",
                    "likes": "2",
                    "time": "24/11/2022-18:04:11",
                    "content": "    CodeKnight:  I don’t think the forums are happy about the expenses either.   Agreed and I think overall the governance is hopefully moving in a direction to reduce budget (as evidenced by most recent budgets having bear market budget option). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.625
                }
            ]
        }
    ]
}