{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/enabling-usdc-a-vault-liquidations/4138",
            "title": "Enabling USDC-A Vault liquidations ",
            "index": 4138,
            "category": [
                "Governance"
            ],
            "tags": [
                "liquidation-system",
                "usdc-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#1",
                    "likes": "1",
                    "time": "14/09/2020-17:21:21",
                    "content": "What is process for enabling USDC liquidations?  Now that we are generating a lot of fee income from USDC vaults (and more coming), we need to enable liquidations to make sure the fee income is paid.  Also the 13% liquidation penalty could be a large source of income for MKR.   I would think this would be straightforward to do.  What is holding us back? ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback on the process for enabling USDC liquidations and is also asking what is holding them back from doing so. The post does not fit perfectly into any of the listed topics, but the closest matches are the author asking for feedback and a 3rd party asking questions about the proposal.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 6.589285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "2",
                    "time": "14/09/2020-17:23:59",
                    "content": "The fee income accrues on a block-by-block basis, it doesn’t need users to close out their vaults / be liquidated. This was true in SCD, but is no longer the case in MCD. As far as I’m aware, what is holding us back is the inefficiencies in current auction process combined with the fact that liquidating USDC vaults actually makes the peg worse. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.214285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#3",
                    "likes": "0",
                    "time": "14/09/2020-17:33:18",
                    "content": "I realize that the fee accrual is block-by-block- but if the vault is abandoned as fees go up and there is no way to liquidate it, we would eventually have the equivalent of unbacked Dai - the amount owed could exceed value of collateral- at this point the fee income doesn’t help anymore. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "14/09/2020-17:34:39",
                    "content": "That is true. At 2% we’re like 6 months away from that happening even at 101% though. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/latetot",
                    "index": "#5",
                    "likes": "1",
                    "time": "14/09/2020-17:35:13",
                    "content": "right good point- we have time ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.464285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#6",
                    "likes": "2",
                    "time": "14/09/2020-17:58:04",
                    "content": "The plan is to wait until liquidations 2.0 where this won’t be an issue anymore due to the dutch auction style of clearing. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#7",
                    "likes": "0",
                    "time": "20/11/2020-08:36:28",
                    "content": "I’d like to revive this thread as I’m still not sure what’s going on. First - why the USDC price is fixed to $1? I guess there was no time to develop a reliable USDC oracle at the time of the USDC launch - but is it possible to do it now? I understand that liquidating USDC vaults incures loss for the system but  that is no excuse for allowing even bigger losses in the future. We have some surplus so it’s a loss or not depending on your viewpoint. What’s the status of the USDC liquidations? Are they disabled (meaning that it requires just one executive vote to enable them) or unsupported (requires coding)? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.953125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#8",
                    "likes": "1",
                    "time": "20/11/2020-08:59:44",
                    "content": "    Aaron_Bartsch:  The plan is to wait until liquidations 2.0 where this won’t be an issue anymore due to the dutch auction style of clearing.   Liquidation 2.0 is coming soon, tho PSM should solve the issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.375
                }
            ]
        }
    ]
}