{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/nuevo-portal-de-votacion/4827",
            "title": "Nuevo Portal de Votaci\\xc3\\xb3n ",
            "index": 4827,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "voting-portal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#1",
                    "likes": "4",
                    "time": "21/10/2020-18:00:21",
                    "content": "Nuevo Portal de Votación ¡Hola a todos! En la Llamada de la Comunidad del día de hoy 20 de octubre se realizó una demostración del nuevo Portal de Votación. Para mejores referencias, a continuación se mostrará una descripción escrita y visual de las mejoras que se discutieron. El Portal de Votación (vote.makerdao.com 18) posee tres secciones diferenciadas: la Página de Inicio, la Página de Encuestas y la Página de Votos Ejecutivos. Página de Inicio: La nueva página de inicio incluye unas etiquetas de “llamado a la acción” para obtener una descripción general de cuales son las acciones de gobernanza disponibles en ese momento. Esta página también incluye algunos puntos de partida para un fácil acceso a las fuentes de información relacionadas, como estadísticas del sistema, sitios de la comunidad, herramientas y discusiones del foro: Screenshot 2020-10-20 at 14.19.061436×987 229 KB  La Página de Inicio también destaca los votos ejecutivos más recientes así como los últimos votos de las encuestas y permite navegar a través de las encuestas/propuestas históricas: Screenshot 2020-10-20 at 14.19.501437×1081 92.2 KB  Los últimos blogs y publicaciones de la Gobernanza también pueden ser encontrados en la página de inicio: Screenshot 2020-10-20 at 14.20.181436×551 112 KB  Página de Encuestas: la página de encuestas ha sido renovada para permitir votación por lotes. Los usuarios ahora pueden enviar sus elecciones clasificadas y sus votos uninominales en una sola transacción usando la función “ballot”. Otras funciones incluyen el filtrado y la información de la tarjeta de la encuesta para robustecer el conocimiento y participación de los usuarios: New Polling Pg1435×1061 133 KB  Página de Votos Ejecutivos: la página de votos ejecutivos ahora también muestra las propuestas ejecutivas pasadas y sus respectivas fechas de ejecución y la cantidad de MKR que tuvieron a favor. Los usuarios ahora pueden añadir comentarios junto con su voto así la comunidad puede comprender mejor la razón por la que votan de cierta manera. Exec Page1436×1192 145 KB  Al hacer clic en los detalles de un voto ejecutivo, al usuario se le presentan 3 pestañas:Detalle de la propuesta, Efectos On-Chain y Comentarios. Detalle de la Propuesta incluye todos los detalles tal como fueron incluidos por el Facilitador de Gobernanza: Executive Page1005×1033 145 KB  Los Efectos On-Chain muestran la dirección del “spell” que vincula externamente a Etherscan para observar el código del contrato. Esto es seguido por los cambios de Vat y Jug leídos del contrato mismo:  Y finalmente, el campo de comentarios del “spell”, que es una base de datos off-chain de comentarios firmados por los usuarios cuando emiten su voto: Comments Field932×535 60.2 KB  Este nuevo Portal de Gobernanza reemplazará el antiguo sitio en vote.makerdao.com 18.  El antiguo sitio permanecerá activo en v1.vote.makerdao.com 1 ya que aún siguen existiendo funcionalidades de incorporación y de módulo ES irresueltas que necesitamos migrar. Todavía será posible continuar votando a través de este sitio si los usuarios así lo desean. Todos los comentarios y sugerencias son bienvenidos conforme continuamos optimizando el acceso a la información de la gobernanza y la participación de los votantes. ¡Gracias! Esta es una traducción libre del artículo original en inglés. Gracias a @Lozadaluis12 y @blimpa por la traducción. ",
                    "links": [
                        "http://vote.makerdao.com/",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/2X/c/c38429a84baba9b6150f9e62683fa238549f1f98.jpeg",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/2X/7/750cda40b17a071c37ecc41b177b2cb28399e68e.png",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/2X/c/c9a6fd95dbf32a03babed73b97c2a21cbc06d8db.png",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/2X/4/4b2f730f03378f0935d1b331394b789d6fc599fe.png",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/2X/6/6953be415fa96e691dd37bc008a0561e96c9ba72.png",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/2X/c/c7bd5a3f0179a9fa4960549dfa104fff9afea013.png",
                        "https://makerdao-forum-backup.s3.dualstack.us-east-1.amazonaws.com/original/2X/3/3780c3c2fec88f1c28a471f7532b26b934e7b4d6.png",
                        "http://vote.makerdao.com/",
                        "http://v1.vote.makerdao.com/",
                        "https://forum.makerdao.com/t/new-voting-portal/4806",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/2"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.5613636363636365
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lorena",
                    "index": "#2",
                    "likes": "2",
                    "time": "22/10/2020-13:53:14",
                    "content": "Muchas gracias. muy interesante y que este en espanol.  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/10/2020-19:42:34",
                    "content": "Gracias a ti por leer, seguiremos traduciendo todo el contenido relevante por acá ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "2",
                    "time": "22/10/2020-20:21:15",
                    "content": "Este es un gran trabajo que estás haciendo! Y no es facil. Gracias por todo! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Lozadaluis12",
                    "index": "#5",
                    "likes": "1",
                    "time": "22/10/2020-22:41:49",
                    "content": "Gracias a ti por estar atento, seguiremos trayendo el mejor contenido del inglés para acá  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}