{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/relay-semanal-3-9-de-mayo-de-2022/15157",
            "title": "Relay Semanal | 3 - 9 de Mayo de 2022 ",
            "index": 15157,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "actualizaciones",
                "relay-semanal"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#1",
                    "likes": "1",
                    "time": "13/05/2022-00:02:40",
                    "content": " 1727×390 306 KB  ¡Hola a todos! ¡Gracias por consultar el Relay Semanal! Ya sea que tengas Maker (MKR) o DAI, poseas una Vault o quieras involucrarte más en la Gobernanza de MakerDAO, esta es tu parada rápida para estar al tanto de las actualizaciones del ecosistema de MakerDAO.  Versión PDF en ingles | Dale un poco de amor a nuestra cuenta en Medium   Tenemos algunas nuevas ideas para mejorar y agradeceríamos tu feedback para ayudarnos hacer que el Realay Semanal sea una publicación mas disfrutable.   ¡Chequea esto!   SES y Julian están investigando desafíos y oportunidades para Maker en materia ambiental, social y de gobernanza (ESG - “Environmental, Social, Governance”). Actualmente están solicitando la opinión de la comunidad para ayudar a identificar temas con potencial relevancia comercial. Puedes ver la encuesta aqui. Para más información:         Mejoramiento del Ciclo de Gobernanza  La Core Unit de Ingeniería del Protocolo ha anunciado que las propuestas ejecutivas serán posteadas semanalmente los días miércoles en lugar de  los viernes. Aumentar el tiempo entre el sondeo y la propuesta ejecutiva, brindara mas tiempo a los equipos de desarrollo para desplegar de forma segura cualquier contrato que introduzca cambios a nivel del protocolo. Anteriormente, las encuestas han estado disponibles los lunes para terminar el jueves y desplegarse el viernes.  El escaso tiempo disponible para desplegar los contratos aprobados genero varios problemas de impacto, incluyendo que:  No fue posible poner a prueba adecuadamente los spells en la tesnet de Goerli Trabajar en dos spells en paralelo (Goerli y mainnet) no es una buena practica No se disponía de tiempo suficiente para revisar y aceptar solicitudes de extracción por parte de otros equipos de ingeniería  Trasladar el despliegue de los spells al día miércoles le permite a nuestros ingenieros abordar estos problemas y garantizar un proceso de desarrollo y despliegue que sea mas seguro y completo.  Con mas detalle:  GovAlpha continuara sacando encuestas como lo ha vendió haciendo hasta hoy, comenzando los lunes y terminando los jueves.  Al mismo tiempo:   Ingeniería del Protocolo comenzara la preparación del spell Goerli al inicio de la semana, trabajando con CES, Oráculos y otros para fusionar las solicitudes de extracción con el spell  Goerli.   Ingeniería del Protocolo comenzara a actualizar el spell Goerli con el spell copy proporcionado por GovAlpha para el viernes.   La siguiente semana:   Ingeniería del Protocolo desplegara el spell Goerli el lunes antes que comience el despliegue del spell de la mainnet el martes.   Ingeniería del Protocolo informara a GovAlpha del spell completado, quienes lo publicaran en el Portal de Gobernanza.   La próxima votación ejecutiva tomara lugar el miércoles 11 de mayo, en lugar del viernes 6 de Mayo.     MIPs Actualizaciones de MIPs Semanales #86 por @blimpa  1380×778 23.2 KB   La Ventana de Presentación Formal de mayo cerro el jueves pasado; cinco propuestas entraron y están on-chain como Propuestas de Ratificación. Estas se extenderán durante dos semanas y cerrarán el 23 de mayo. La ultima fecha probable para postear propuestas que entren en el Ciclo de Gobernanza, es el miércoles 11. Las Encuestas de Ratificación cerrarán el 23 de mayo. La Ventana de Presentación Formal de junio abrirá el 6 de junio.  Las fechas de RFC y FS para referencia y las propuestas existentes pueden verse en este rastreador de propuestas. Si tienes alguna pregunta sobre es el proceso de votación en MakerDAO, la Guía Practica de Votaciones te será de ayuda.  Votación(es) Ejecutiva(s) No hubo votaciones ejecutivas la semana pasada; todas las votaciones ejecutivas futuras serán posteadas el miércoles como parte del nuevo y mejorado ciclo de Gobernanza.  Encuestas de Gobernanza Activa Por favor, échale un vistazo a la encuesta mencionada al principio de esta publicación para ayudarnos a mejorar las Encuestas de Gobernanza Activa. Hay cinco encuestas de gobernanza activas:     Nombre de la Encuesta Debate     Monetalis Clydesdale, Estrategia y Ejecución de Bonos Líquidos (MIP65) Debate   Monetalis Lusitano, Préstamos Mayoristas para PyMEs de Economía Verde del Reino Unido (MIP68) Debate   Retiros Rápidos de L2 a L1 (MIP69) Debate   Enmendar el Proceso de Presupuestos de la MIP40 (MIP4c2-SP19) Debate   Felicidad Estratégica (SH-001): Modificación de Presupuesto de Core Unit (MIP40c3-SP67) Debate     Échale un ojo al Relay Semanal del 2 de Mayo para mas información sobre las encuestas concluidas.*   Encuestas del Visto Bueno de Comunidad  Por favor, échale un vistazo a la encuesta mencionada al principio de la publicación para ayudarnos a mejorar las Encuestas del Visto Bueno de la Comunidad.*  Hay dos encuestas del visto bueno de la comunidad activas para la semana del 12 - 18 de abril del 2022.     Encuesta del Visto Bueno Desglose del Voto Actual Fecha de Inicio Fecha de Finalización     ATDC (Combustores ATD)  2270×527 80.4 KB  2 de mayo del 2022  a las 16:00 UTC 16 de mayo del 2022 a las 16:00 UTC   IPCL (Bonos Verdes de Energía de la India)  2257×510 79.6 KB  2 de mayo del 2022  a las 16:00 UTC 16 de mayo del 2022 a las 16:00 UTC    Consulta el punto de vista de “De Un Vistazo” sobre los tipos de Vault actuales y sus parámetros en MakerBurn.  Petición de Señales Activas Maker Accede a prestamos Hipotecarios a través del Protocolo Bacon Esta propuesta de @abdalla necesita la incorporación de un Modulo de Deposito Directo de DAI (D3M) para crear un DAI pool del Protocolo Bacon. BaconCoin es una stablecoin respaldada por hipotecas de US. Los posibles beneficios incluyen:  Un solo procedimiento de incorporación que puede escalar tanto la cantidad de capital utilizado como el numero de  prestamos para la vivienda a lo largo del tiempo Amplia distribución de DAI a los propietarios de viviendas en US Mayores rendimientos ajustados al riesgo a través de un conjunto diversificado de prestamos para la vivienda Maker selecciona los criterios de suscripción a utilizar, permitiendo invertir en prestamos que están muy alineados con la visión de Maker de financiar iniciativas de sostenibilidad Bacon desarrollara y mantendrá la integración D3M en linea con la estrategia de habilitación de CES La Gobernanza tiene control directo sobre el suministro de DAI agregado a Bacon a través del Techo de Deuda  @abdalla enumera el riesgo de los contratos inteligentes como un posible contra pero también ofrece dos ideas para mitigar riesgos:  Las direcciones de la lista blanca con la función de depositar pueden reducir el riesgo de exploit (Maker seria el único proveedor de liquidez) La evaluación del riesgo de crédito de los prestatarios puede llevarse a cabo por los originadores de prestamos utilizando la puntuación FICO estándar de la industria  La votación durara hasta el 19 de mayo del 2022 Aquí puedes ver cómo va la votación:  1702×685 97.4 KB   Aumentar el Umbral Mínimo del ESM GovAlpha presento una Petición de Señal de calibrar el apoyo para incrementar el umbral mínimo y así activar el Modulo de Apagado de Emergencia (ESM) desde 100,000 MKR hasta 150,000 MKR. GovAlpha recomienda este ajuste para minimizar la amenaza de que ocurra un apagado de emergencia hostil. Con la reciente caída en el precio del MKR, activar un apagado de emergencia se ha vuelto significativamente barato basándose en el umbral mínimo actual. El objetivo es encontrar el balance correcto entre hacer que sea muy costoso para que un actor malo adquiera o pida prestado suficiente MKR para activar un apagado de emergencia, sin hacerlo demasiado difícil para que un apagado de emergencia legitimo sea activado si es necesario (por ejemplo, en respuesta al descubrimiento de un bug critico en el Protocolo de Maker o la prevención de un ataque de gobernanza malicioso). La votación durara hasta el 20 de mayo del 2022 Aquí puedes ver cómo va la votación:  1655×687 109 KB   Vault Institucional de Antalpha @William_Chiu ha recopilado debates recientes entre las Core Units de Crecimiento, Riesgo e Ingeniería del Protocolo y Antalpha para proponer una nueva vault institucional. El post expone tanto los objetivos de la propuesta como los mecanismos para lograrlos. Objetivos  Impulsar el suministro de DAI Generar mayores ingresos para MakerDAO y nuestros socios Mejorar la eficiencia del capital para nuestros socios Compromiso de préstamo a largo plazo con un nivel de previsibilidad de los tipos de préstamo  Mecanismos  Tarifa de Originario: será aplicada a todos los DAI al momento de la acuñación. Esto no esta restringido y esta abierto a cambios mediante la Gobernanza (específicamente el grupo de propuestas de cambios de parámetros). Esto significa que cualquier socio tendrá un plazo de entrega de 2-3 semanas antes de implementar cualquier cambio. Tarifa de Estabilidad: esta determinada por adelantado y se fija durante un periodo de tiempo. Esta tarifa fijada puede reducirse mientras que se añade colateral adicional. Tamaño inicial de la Vault: para garantizar que tales vaults acuñen una cantidad mínima de DAI para obtener tasas favorables.  Antalpha intenta utilizar un préstamo de DAI para fortalecer la parte de monedas estables del balance general y apoyar así una de sus principales actividades de préstamo y empréstito. Antalpha asumirá el colateral a un nivel mas alto que el nivel de préstamo de DAI para implementar una gestión adecuada del riesgo de crédito y utilizar sistemas y comercio algorítmico para facilitar la gestión de prestamos y colateral. Términos Propuestos     Tipo de Vault Institucional  Vaults de ETH y wBTC (INST-WBTC-5, INST-ETH-5)     Tamaño de la Vault Calificada: 200MM   Techo de Deuda 1B, 500MM para ETH y 500MM para wBTC   Tasa de Originación: 1% de DAI acuñado   Comportamiento de la Tasa de Originación: La Tasa de Originación no esta restringida y puede cambiarse a través de la Gobernanza mediante una Propuesta de Cambios de Parámetros. Antalpha tiene un tiempo de espera de 2-3 semanas para cualquier cambio en la tasa de originación.   Compromisos futuros de la Tasa de Originación Maker y Antalpha trabajaran juntos para proponer reducciones a la tasa de originación si el tamaño de la vault crece significativamente.   Tarifa de Estabilidad: WBTC-A tarifa de estabilidad1 - 50bps & ETH-A tarifa de estabilidad2 - 50bps   Comportamiento de la tarifa de estabilidad3: Fijada durante seis meses. Después de la acuñación de 200m DAI y la acuñación de 100m DAI adicionales reducirá la tarifa de estabilidad en 10 puntos básicos (por vault) hasta un mínimo de tarifa de estabilidad-30bps durante seis meses. La reducción de la tarifa de estabilidad será manual a través de una votación ejecutiva. Después de 6 meses, el dialogo abierto de la comunidad facilitara que la CU de Crecimiento determine las tarifas de estabilidad en curso.   Ratio de Colateral: 150%   Comportamiento del Ratio de Colateral: Si no se mantiene el 200% CR4 durante la mayor parte de los siete días, se incrementara el SF al 5% y el LR al 150%. Los siete días se calcularían asegurando que el 95% de las actualizaciones del OMS muestran que el CR es igual o mayor que 200%.   Ratio de Liquidación: 120%    La votación durara hasta el 19 de mayo del 2022 Aquí puedes ver cómo va la votación:  1697×680 111 KB   Poner en marcha la Quema nuevamente @aburban90 presento su petición a favor de reactivar la quema de MKR. Afirma que apagar de la quema también apaga nuestro único modelo de distribución de ingresos y que aun no lo hemos sustituido con nada mejor. Estas acciones han hecho que algunas de las partes OG interesadas pierdan la fe en nuestra capacidad para cumplir. Nuestra comunidad y las partes interesadas son muy importantes y existe una posibilidad de que estemos arriesgando su confianza en nosotros, si no continuamos con la quema de MKR en estos tiempos de precios tan bajos. En conclusión, Andrew consulto si la comunidad quiere reiniciar la quema con un parámetro de tapa reducido para mitigar varias ineficiencias. La votación durara hasta el 14 de mayo del 2022 Aquí puedes ver cómo va la votación:  1697×902 179 KB   Despliegue del balance en ETH Como es expresado en Sobre asumir el riesgo de los activos y en Un enfoque del balance para una Estrategia de Crecimiento Agresiva, ETH parece una buena inversión para MakerDAO. Sebastián de Finanzas Estratégicas avanza en el Enfoque del Balance hacia una Estrategia de Crecimiento Agresivo al medir el sentimiento de la comunidad sobre si les gustaría empezar a trabajar en la asignación de algunos de los balances de MakerDAO en ETH y/o derivados de ETH: Pros:  MakerDAO esta utilizando Ethereum como su base de operaciones y por lo tanto, esta vinculado al éxito de ETH. ETH es un activo estratégico para las operaciones de la DAO porque paga tarifas de gas para las transacciones on-chain y oráculos. Competidores como Celo, TribeDAO y Angle holdean  ETH en sus balances generales y no holdear ETH pone a Maker en una clara desventaja competitiva. La próxima función reducirá significativamente la emisión de nuevo ETH y creara un mercado competitivo para balances generales con un alto grado de exposición a ETH. Las tarifas de staking Post-Fusión están estimadas a un 7-11%, duplicando los rendimientos de staking actuales de la noche a la mañana y convierte a ETH en un activo verdaderamente productivo.  Contras:  ETH es un activo volátil cuyo precio ETH/DAI puede fluctuar salvajemente y ocasionalmente bajar durante  periodos significativos Los impactos de Merge (“fusión”) y L2 pueden tener efectos inesperados en el precio a largo plazo  Sebastián también señala que esta Petición de Señal tiene como objetivo entender si la comunidad desea trabajar sobre este tema. Actualmente no se atribuye ninguna prioridad y una implementación formal para tales acciones tendrá que pasar por los procesos de gobernanza. La votación durara hasta el 12 de mayo del 2022 Aquí puedes ver cómo va la votación:  1705×912 190 KB   Cambiar el Parámetro lid del Limitador de la Tasa La aprobación e introducción del Limitador de Tasa Flapper ha sido un éxito, pero solo permite iniciar  una nueva subasta si  la nueva subasta no incrementa el total de DAI actualmente en subasta por encima cierto umbral - el lid a menos que esté en el mismo valor que el bump. Actualmente, el valor del lid es fijado a 150k DAI, lo que permite realizar cinco subastas flap al mismo tiempo. Sin embargo, ultraschuppi cree que no hay una buena razón para quemar tanto MKR y propone establecer el lid al mismo valor que bump - 30,000 DAI. Tener una relación de 1:1 entre la ‘lid’ y ‘bump’ garantizara que solo haya una subasta flap en paralelo ejecutándose en cualquier momento. Lo bueno de esto es que en caso de un gran pico en el Excedente del Sistema provoque un derrame al Buffer de Excedente, el intervalo de tiempo de esas subastas resultantes será 5x comparado con la configuración actual, produciendo así una quema mas constante. Sin embargo, limitaremos el máximo de MKR quemado por día de 7,2MM DAI a 1,44MM DAI en sacrificio. La votación durara hasta el 13 de mayo del 2022. Como va la votación:  1697×632 104 KB       Tweet de la Semana  Para los que necesitan un poco de alegría en tiempos de incertidumbre en el mercado     twitter.com    kianga.eth 🌍 1000 ACRE DAOs in 1000 Days @fhomoney  OMG, just found this video looking for something in my phone!   ⁦⁦@degenwizard⁩ is a national treasure. Drove out of his way to meet me.   Behold the power of SWAG love. To all the haters in the ⁦@MakerDAO⁩ Forum… you can’t put a price on this kind of Joy.  😜😘 https://t.co/GQQAYSbxaK         3:32 PM - 5 May 2022           40                4             En las Noticias   Oasis.app lanzo la Protección Stop-Loss  1240×688 156 KB  Una nueva función esta disponible para las vaults de Maker en Oasis.app llamada Protección Stop-Loss. La Protección Stop-Loss garantizara que una vault cerrara automáticamente si el ratio de colateralización alcanza un umbral prestablecido y se protege contra la liquidación. La puesta en marcha no tiene ningún coste adicional, salvo los gastos de gasolina de la transacción. Sin embargo, es imposible conocer los costos de gas y swap en el momento de la transacción. El valor mostrado antes de la ejecución es un valor aproximado que puede diferir ligeramente del valor actual. Para saber como configurar una Protección Stop-Loss o como funciona, consulta su blog.     Llamada de Incorporación de Colateral #42: Monetalis MIP65 & MIP68 AMA | 10 de Mayo a las 5PM UTC   Foro | Únete a la llamada      Grabaciones de las Llamadas de la Semana Pasada  Gobernanza y Riesgo: Episodio 189 | Video | Foro    Gobernanza y Riesgo   Link para Unirse | Agenda - Jueves a las 17:00 UTC  Horarios de Oficina de las Core Units   Link para Unirse | GovAlpha - Preguntas y Respuestas de la Gobernanza - Lunes 17:00 UTC  Link para Unirse | Seguridad Immunefi - Martes 00:00 UTC  Link para Unirse | Ingeniería del Protocolo - Martes 15:00 UTC  Link para Unirse | Escalado de Ecosistemas Sostenibles - Martes 15:30 UTC  Link para Unirse | Crecimiento - Miércoles 17:00 UTC  Link para Unirse | Finanzas del Mundo Real - Miércoles 17:00 UTC  Link para Unirse | Comunicaciones de Gobernanza - Viernes 18:00 UTC     Links Útiles Abrir Foro y Chat de Maker Discusiones y debates en MakerDAO. Calendario de Llamadas Público |  Calendario de Votación & Eventos Público Suscripción para todas las llamadas públicas, votaciones y otros recordatorios. Herramientas de Participación Biblioteca de enlaces útiles para los Stakeholders; análisis de Protocolo, análisis de DAI, las métricas de colateral y liquidación, historia de la Gobernanza e información sobre las subastas. Portal de Gobernanza Tabla de Votaciones para los votantes de MKR. Portal de MIPs Tabla de MIPs para todos. Portal de Aprendizaje y Portal de Documentación Técnica Aprende más sobre el protocolo de Maker.    ¿Tienes algún Feedback? ¡Valoramos tu opinión! Haz nuestra encuesta para hacernos saber qué se nos está pasando por alto o podemos mejorar. Descargo: Esta actualización fue ensamblada por un grupo de miembros que contribuyen a la comunidad de MakerDAO. La misma no debería servir como asesoría financiera ni como incentivo para votar de alguna forma específica. Esta actualización es meramente informativa y para fines de comunicación solamente.  Créditos @nothsa @Artem_Gordon  Esta es una traducción libre del artículo original en inglés gracias a @joserjimz y @Sebix. ",
                    "links": [
                        "https://medium.com/@MkrGovComms",
                        "https://forms.gle/nPfNEvrCog9gSF768",
                        "https://docs.google.com/forms/d/e/1FAIpQLSc0MsZv8qFQfoJh5w15atJHfC-UknCNChoEP-jU5UfDXMVewQ/viewform?usp=sf_link",
                        "https://www.youtube.com/watch?v=V5bliF28cbM",
                        "https://forum.makerdao.com/t/governance-cadence-improvement/14972",
                        "https://forum.makerdao.com/t/weekly-mips-update-86-may-9-2022/15058",
                        "https://docs.google.com/spreadsheets/d/1OHZa-f4C2Z8PteZBb1Mfiz-MJn5Ky_PM15mM1QLgIRY/",
                        "https://manual.makerdao.com/governance/voting-in-makerdao/practical-guide-voting",
                        "https://forum.makerdao.com/t/governance-cadence-improvement/14972",
                        "https://vote.makerdao.com/polling/QmXHM6us#poll-detail",
                        "https://forum.makerdao.com/t/mip40c3-sp62-modify-core-unit-budget-com-001/13724",
                        "https://vote.makerdao.com/polling/QmS7UyQT#poll-detail",
                        "https://forum.makerdao.com/t/mip68-monetalis-lusitano-uk-green-economy-sme-wholesale-lending/13789",
                        "https://vote.makerdao.com/polling/QmWZvSpa#poll-detail",
                        "https://forum.makerdao.com/t/mip69-l2-to-l1-fast-withdrawals/14041",
                        "https://vote.makerdao.com/polling/QmXVjbWG#poll-detail",
                        "https://forum.makerdao.com/t/mip4c2-sp19-mip40-budget-process-amendment/14250",
                        "https://vote.makerdao.com/polling/QmQkxx16#poll-detail",
                        "https://forum.makerdao.com/t/mip40c3-sp67-modify-core-unit-budget-strategic-happiness-sh-001/13805",
                        "https://forum.makerdao.com/t/weekly-relay-april-26-may-2-2022/14939",
                        "https://vote.makerdao.com/polling/QmRH6Bf6#poll-detail",
                        "https://vote.makerdao.com/polling/QmUQ7VDA#poll-detail",
                        "https://makerburn.com/#/rundown",
                        "https://forum.makerdao.com/t/signal-request-maker-accessing-mortgage-loans-through-bacon-protocol/15043",
                        "https://www.baconcoin.finance/",
                        "https://forum.makerdao.com/t/signal-request-increase-the-esm-minimum-threshold/15006",
                        "https://forum.makerdao.com/t/signal-request-antalpha-institutional-vault/15030",
                        "https://www.antalpha.com/",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn-v2/14918",
                        "https://forum.makerdao.com/t/signal-request-deploy-the-balance-sheet-in-eth/14834",
                        "https://forum.makerdao.com/t/towards-taking-asset-risks-a-primer/14265",
                        "https://forum.makerdao.com/t/a-balance-sheet-approach-to-executing-an-aggressive-growth-strategy-the-road-to-300m-revenues/14818",
                        "https://forum.makerdao.com/t/signal-request-change-lid-parameter-on-the-rate-limiter/14688",
                        "https://twitter.com/fhomoney/status/1522237761331286025",
                        "https://twitter.com/fhomoney/status/1522237761331286025",
                        "https://twitter.com/fhomoney/status/1522237761331286025",
                        "https://t.co/GQQAYSbxaK",
                        "https://twitter.com/fhomoney/status/1522237761331286025",
                        "https://blog.oasis.app/oasis-app-launches-stop-loss-protection/",
                        "https://blog.oasis.app/oasis-app-launches-stop-loss-protection/",
                        "https://www.google.com/url?q=https://forum.makerdao.com/t/collateral-onboarding-call-42-monetalis-mip65-mip68-ama/14829&sa=D&source=calendar&ust=1652630699341674&usg=AOvVaw0JSicO26bUbRsk2mAhd-WP",
                        "https://www.google.com/url?q=https://www.crowdcast.io/c/collateral-call-42&sa=D&source=calendar&ust=1652630699341674&usg=AOvVaw0-L_cGUuBOMQruh3UV_AdP",
                        "https://www.youtube.com/watch?v=ZJSmzCTSbsA",
                        "https://forum.makerdao.com/t/governance-and-risk-189-thursday-may-05-17-00-utc/14965",
                        "https://zoom.us/j/697074715",
                        "https://forum.makerdao.com/c/governance/gnr/8",
                        "https://us02web.zoom.us/j/82603350722?pwd=RThleVo5QlBRT1FuOWxiRCs3K0k2Zz09",
                        "https://www.google.com/url?q=https://meet.google.com/bjm-qiup-hif&sa=D&source=calendar&ust=1620493080631000&usg=AOvVaw056SKuyQn3F67FAtJTPIbl",
                        "https://us02web.zoom.us/j/85252786103?pwd=bEZaZXdEcGlSWWd5bmpxMDBvVjdEUT09",
                        "https://meet.google.com/sap-nttu-xga",
                        "https://meet.google.com/kwf-qayf-xdq",
                        "https://meet.google.com/nio-jrqq-guu",
                        "https://forum.makerdao.com",
                        "https://chat.makerdao.com",
                        "https://calendar.google.com/calendar/u/0?cid=bWFrZXJkYW8uY29tXzNlZmhtMmdoaXBrc2VnbDAwOWt0bmlvbWRrQGdyb3VwLmNhbGVuZGFyLmdvb2dsZS5jb20",
                        "https://calendar.google.com/calendar/embed?src=bdf4un05hpg0611lg3ieue4t3c%40group.calendar.google.com&ctz=America%2FNew_York",
                        "https://community-development.makerdao.com/en/learn/governance/participate",
                        "https://makerdao.com/en/governance",
                        "https://mips.makerdao.com/mips/list",
                        "https://community-development.makerdao.com/en/learn/",
                        "https://docs.makerdao.com/",
                        "https://forms.gle/Z2QAgywU2Sesm7Vy6",
                        "https://forum.makerdao.com/t/weekly-relay-may-3-9-2022/15084",
                        "https://forum.makerdao.com/t/relay-semanal-10-16-de-mayo-de-2022/15289"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.657738095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#2",
                    "likes": "1",
                    "time": "15/05/2022-16:49:02",
                    "content": "Excelente trabajo Jose  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Joserjimz",
                    "index": "#3",
                    "likes": "1",
                    "time": "15/05/2022-22:58:01",
                    "content": "Gracias Ale  estamos trabajando en mas contenido ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#4",
                    "likes": "1",
                    "time": "16/05/2022-15:16:27",
                    "content": "Otro gran trabajo José ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gonzalo_Napolitano",
                    "index": "#5",
                    "likes": "1",
                    "time": "16/05/2022-15:25:25",
                    "content": "Excelente Jose, gran laburo Abrazo! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}