{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/speaker-series-1-st-louis-federal-reserve-senior-vp-june-29-3-00-pm-utc-11-00-am-et/8080",
            "title": "[Speaker Series] #1 -- St. Louis Federal Reserve Senior VP; June 29 3:00 PM UTC/11:00 AM ET ",
            "index": 8080,
            "category": [
                "Resources",
                "Public Calls"
            ],
            "tags": [
                "public-call",
                "guest-speaker",
                "pubcall-:-speaker-series"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#1",
                    "likes": "38",
                    "time": "14/05/2021-14:30:03",
                    "content": "We now have an anonymous way to submit questions.  Link.  I am pleased to announce that MakerDAO will be hosting its first in (what I hope is) a series of speakers and discussions around the intersection of economic theory, practical finance, and crypto markets. On June 29, 2021 at 11:00 am EST (3:00 UTC), we will be joined by David Andolfatto, who is Senior Vice President of the St. Louis Federal Reserve. The topic is tentatively how monetary policy interacts with large crypto financial markets, but feel free to submit questions that are less narrowly focused. The format will likely be short remarks by Mr. Andolfatto followed by a Q&A. Questions may be submitted beforehand, as well as during the event, and the host (TBD) will ask them on behalf of the DAO community. More details to follow as the date approaches on how to join this virtual event, and how to submit questions anonymously. We unfortunately will only have Mr. Andolfatto for a short time, so there may not be time for all questions to be asked. Thoughtful questions that are also immediately relevant to the DAO will be prioritized. I am currently working on a second speaker, and would appreciate any suggestions for what kinds of topics people would like to learn more about. This series will (I hope) also function as a means of introducing MakerDAO to other organizations and individuals that are prominently involved in crypto, finance, and research on the intersection of the two. Edited to add: @seth @JerryAG let me know if there’s anything you need to make this better material for you to work with Edited to add 2: Promo graphic – feel free to share!  Promo Graphic Dark - 3 (2)1130×720 1010 KB  ",
                    "links": [
                        "https://www.crowdcast.io/e/makerdao-speaker-series",
                        "https://www.stlouisfed.org/about-us/leadership-governance/bank-officers/executive-bios/david-andolfatto",
                        "https://www.crowdcast.io/e/makerdao-speaker-series",
                        "https://forum.makerdao.com/t/discussion-press-releases-at-makerdao/8323/8",
                        "https://forum.makerdao.com/t/monetary-theory-makers-unusual-superpowers/8301",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-may-16th-2021/8248",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-14-20-2021/8194",
                        "https://forum.makerdao.com/t/maker-relay-ep-45-en-espanol/8141",
                        "https://forum.makerdao.com/t/maker-relay-ep-45/8127",
                        "https://forum.makerdao.com/t/maker-relay-ep-52-en-espanol/9209",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-142-thursday-may-20-17-00-utc/8116/4",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-may-27-june-9-2021/8686",
                        "https://forum.makerdao.com/t/maker-relay-ep-51/9011",
                        "https://forum.makerdao.com/t/maker-relay-ep-51-en-espanol/9063",
                        "https://forum.makerdao.com/t/maker-relay-ep-52/9191"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.715888278388278
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "2",
                    "time": "14/05/2021-15:05:26",
                    "content": "Nice job Paper!! Thank you for putting this together. Unfortunately I will be traveling on that day, but I will try to submit a question, or two. Thnxs again, and I look forward to watching the recording. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.09375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#3",
                    "likes": "4",
                    "time": "14/05/2021-18:06:42",
                    "content": "As far as making this material useable, it really just needs to be recorded. Crowdcast or zoom are the most recommended platforms, and allow you to record the calls directly. We can discuss the recording settings on any platform you’d prefer to use (I know zoom specifically has a couple different ways you can record the call). Aside from that, we’d be happy to help with editing (if necessary) and get this posted in appropriate channels. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#4",
                    "likes": "4",
                    "time": "15/05/2021-02:58:39",
                    "content": "This is awesome, @JerryAG @PaperImperium . Keep bringing high profile to the group. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.9
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#5",
                    "likes": "3",
                    "time": "15/05/2021-13:43:45",
                    "content": "this is great @PaperImperium and we should keep doing this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#6",
                    "likes": "3",
                    "time": "17/05/2021-23:39:02",
                    "content": "It looks like this will indeed become a series, so let’s make sure we have good attendance and smart questions to keep drawing speakers. I’ll announce the second speaker when we have a specific date confirmed! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.595238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Gaucho",
                    "index": "#7",
                    "likes": "2",
                    "time": "18/05/2021-03:13:12",
                    "content": "This is really cool. What art of other speakers are you looking for? I have some crypto law types who could be interested but this seems more economics-focused. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.21875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AdrienDLT",
                    "index": "#8",
                    "likes": "4",
                    "time": "21/05/2021-10:46:52",
                    "content": "Well done in getting Mr Andolfatto on stage. I believe it’s also a great opportunity for our community to shine by showing knowledge and genuine interest while also asking hard questions. I will ask here a couple of questions in case I forget to follow up on this.  This world pandemic triggered an unprecedented action by the US Federal Reserve: according to stlouisfed.org website (c.f. chart below), it created 4.5 times more USD in 1 year than in the previous 20 years — $14.4 Trillion between March 2020-21 vs “only” $3.17 Trillion between March 2000-2020 — hyper inflation in the USA seems unavoidable, the world is watching and everyone is very concerned about the impact this might have on the global scale. What are the measures in place to try limit the damage for the US and its allies in the likely case of upcoming global financial crisis?   Screenshot 2021-05-21 at 11.45.151928×1330 234 KB    This world pandemic also triggered an unprecedented action by the IMF: it revived its world currency project called Special Drawing Rights (SDR) by creating 2.2 times more SDR “at once” in March 2020 than in the previous 50 years — from 204.9 to approx 655 billion ($650B worth of SDR created in March 2020). For our listeners and readers who may not know: this is a basket currency made of 41.73% USD, 30.93% EUR, 10.92% CNY, 8.33% JPY and 8.09% GBP where all of the IMF’s 190 member countries get a share of SDRs created, essentially “helicopter money at a global scale” (an airdrop in crypto jargon). Although a currently a very small fraction in the global economy, do you think that in the long term SDR can be a more sustainable solution to deal with global financial crisis rather than “individual” actions taken by central banks or coordinated actions taken in a small group of central banks ? Resources: Making sense of SDR, by the IMF Explaining SDR, by the IMF FAQ on SDR, by Aljazeera   I have many more questions in mind on both topics, but I believe that bringing them up is the most important. ",
                    "links": [
                        "https://en.wikipedia.org/wiki/Special_drawing_rights",
                        "https://www.bloomberg.com/news/articles/2021-03-23/imf-considers-plan-to-issue-as-much-as-650-billion-in-reserves",
                        "https://www.youtube.com/watch?v=67hNp-vsFew",
                        "https://www.youtube.com/watch?v=Dlvtd3kMCqc",
                        "https://www.aljazeera.com/economy/2021/4/6/what-is-an-sdr"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.801020408163265
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#9",
                    "likes": "3",
                    "time": "25/05/2021-09:33:14",
                    "content": "Seems like the Media is all over DeFi and Bitcoin (Claiming every move is based on an Elon Musk comment). Although most of their headlines are based on the need to have readers click on an article—I do think there are some smart journalists who don’t get what we do. Joe Weisenthal (Bloomberg) being one of them. Maybe we should invite him over—he doesn’t think DeFi is doing anything to change the “real world” — besides trading coins between each other…   twitter.com    Joe Weisenthal (TheStalwart)  It's possible that I'm too stupid to get DeFi and Ethereum. Bitcoin I get. It's money. And people hold it and sometimes they even spend it.   Tokenomics, Web 3.0, DAOs. It just goes over my head. That's cool. Will keep trying to learn though.  9:22 AM - 25 May 2021     68          1            ",
                    "links": [
                        "https://twitter.com/thestalwart/status/1397120965130260480?s=21",
                        "https://twitter.com/thestalwart/status/1397120965130260480?s=21"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.386904761904762
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#10",
                    "likes": "2",
                    "time": "26/05/2021-10:24:38",
                    "content": "I really like how useful this is to both sides. We get to hear from people on the other side and Maker gets great exposure to audiences who haven’t heard of us yet. That’s exactly what we need to get more people onboard. Nice job @PaperImperium ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.803571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#11",
                    "likes": "3",
                    "time": "21/06/2021-18:08:15",
                    "content": "Heads up that we now have — inspired by the G&R calls — an anonymous way to submit questions to our guest ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/seth",
                    "index": "#12",
                    "likes": "1",
                    "time": "28/06/2021-21:23:19",
                    "content": "Heads up, this is happening tomorrow! Looking forward to the discussion. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#13",
                    "likes": "4",
                    "time": "28/06/2021-21:31:44",
                    "content": "    seth:  Looking forward to the discussion.   I promise to present Maker as we truly are: immaculately polished, with the spirit of a hustler and the swagger of a college kid… who can print money from thin digital air ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#16",
                    "likes": "6",
                    "time": "09/07/2021-19:25:35",
                    "content": " Episode 1: June 29th, 2021: Senior VP of St. Louis Federal Reserve, David Andolfatto  Agenda   00:00: Introduction  01:08: Questions and Answers   Introduction  Chris Cameron 00:00 Suggestion Box Questions for SVP David Andolfatto Biography  Good morning, MakerDAO community. I am Chris Cameron, also known as @PaperImperium. I am joined here with David Andolfatto, Sr. VP of research at the St.Louis Federal Reserve. Let me go ahead and make the standard disclosure that the views and opinions expressed here today are not necessarily reflected by either the St. Louis Federal Reserve or by MakerDAO. We’re just two folks who came in through the front door of both places and are having a chat over ‘coffee.’ I know your time is short with us so let’s lead with the question asked the most in our anonymous suggestion box. It’s not my favorite question, but we’ll get it out of the way.   Questions and Answers  David Andolfatto  Q: Given that central bank digital currencies are often abbreviated as CBDC, what other acronyms can the FED or other central banks use so that people don’t think that they’re talking about cannabis-based derivative points? 01:08  I guess one could use the acronym CB for the central bank. I don’t know which came first, the cannabis or central bank. Maybe in the context of the United States, we might use something like FedCoin or something like that, but I think it’s going to be very hard to change now.   Q: Given that stablecoins, such as DAI issued by Maker, very closely resemble the banknotes issued by earlier banks in the United States and elsewhere. What can Maker do to discourage or easily handle government regulation and intervention in the stablecoin space? 02:07  The question presumes that the stablecoin has this bearer kind of property to it or is a bearer instrument because that’s the closest analogy I can think of as to the old-style private banknotes that used to be issued. The question becomes how do the stablecoins navigate this regulatory environment? But can you repeat the question?  Chris Cameron: How can the asset as a bearer zero-coupon perpetual maturity debt instrument avoid or prepare for incoming regulation?   David Andolfatto: Avoiding will be tough, especially for any product that becomes important and is wide. It’s going to come on the radar of regulators around the world. In the United States, in particular, several regulatory agencies would handle these things, depending on their structures. I think that it’s going to be very, very difficult to avoid regulation. At the very least, I think it would be regulated in the same way that Paypal is regulated. In that kind of money services business, in the United States, you would likely need 50 licenses to operate. Another idea considers the models that structure themselves to look a little bit like fractions of reserve banks. It will be very difficult to escape being regulated in the way that normal depository institutions are. Mark Carney recently gave a speech suggesting that stablecoins to be granted access to the central bank balance sheets in the same way that depository institutions are. If that were to be the case, it would surely render the stablecoins officially stable to the extent that they’re pegging against the US dollar. Of course, there are other versions where they can peg to something else. But it’s hard for me to imagine a world where these products wouldn’t be regulated in the way that existing products have been regulated in the past; Money market funds, depository institutions, and money services businesses.   Q: Let’s say that it’s determined that Maker or other stable coin issuers do need these licenses. How does a non-legal entity, like a DAO, interact with regulatory entities? If there’s not an entity to regulate this, how does a DAO act in goodwill? 05:34  Let’s take Bitcoin, for example. There’s no direct negotiation with Bitcoin because it’s a decentralized autonomous organization. Regarding the context of MakerDAO, and I apologize I’ve only recently had time to school myself on your product, but Maker does have a community and governance community. It does have a governance token. It does have a community that is concerned with the governance structure of the protocol. Presumably, and I don’t want to speculate, but imagine some very, very tough laws coming down that say that basically you can not use these types of objects in transactions or you’ll be heavily taxed. You can try to evade them, but then you’re playing a game with the IRS. Imagine some sort of more or less draconian government action, which would not necessarily snuff out the DAO, of course, but you don’t want that. You want the product to be part of the community and enhance the economic well-being of the broader public. I could well imagine, I think, that the Maker community, the people with a stake in the system, might negotiate in some manner. I’m not exactly sure how the communication would take place. But obviously, they receive feedback about what the desirable protocols are and perhaps structure the protocol to make them regulatorily compliant, for example. This is an excellent question. I’m not exactly sure how this would work, but I imagine that something like that could happen.   Q: There’s much talk about CBDCs these days. What role can be decentralized or privately issued stablecoins fill that CBDCs are unlikely to fill? What niche are CBDCs likely to leave unfilled that privately issued stablecoins can still address? 08:21  So much depends on the specific design of the CBDC, for example. And so much depends on the regulatory culture of the country that we’re talking about. For example, some people have talked about CBDC being offered in a more or less conventional account-based system, which is very straightforward where people, in addition to opening up their regular bank account at the Bank of America, could also now open up an account at the Federal Reserve Bank or the same way that you can open up an account with the US Treasury right now at www.treasurydirect.gov. That’s a very straightforward way of just permitting people to have access to the electronic components in an account-based way. Then there’s the question of to what extent does the Fed want to offer security that more closely resembles the physical currency in terms of its privacy of properties that is something that is also highly valued in our society and among societies. There is some discussion about whether or not the central bank, as part of the CBDC, should offer a token-based product as well. And if so, how would that be structured? But let’s suppose not-Suppose the design is just the regular account-based one that will naturally have some limitations in terms of privacy. In that world, I could imagine that gap being filled by various stablecoins, for example. If to the extent that they offered that property not forthcoming from the central bank digital currency. I’m speculating about possible outcomes so much; so many things could happen depending on how things are structured and how regulators react. But that would be an example of how I could see some coexistence where the central bank provides, perhaps a basic public option no-frills account where every American is hooked up. You can just make a free payment. The same way that you can walk on any sidewalk in the country and not pay a toll or drive down the interstate highway system without paying a toll. We would just make it free and finance it out of it in a general way. And then we could imagine the private sector layering on top of that offering more elaborate products such as things in demand by various constituencies. That’s just one example. I could imagine that type of coexistence of these products filling the gaps of what this basic public option would be offering.   Q: A comments from the head of our Real World Finance unit: In your opinion, what are the differences and similarities between shadow banking and asset-backed stablecoins like DAI? 12:25  Shadow banking, as the name suggests, is not dark economics. What you have are regular banking retail depository institutions. To access the Fed’s balance sheet and have a settlement balance account or a reserve account with the Fed, a bank has to be a depository institution that is also a legal designation. If you are chartered as a depository institution, you must abide by a certain set of regulations. In the old days, you had reserve requirements, for example. Still, there’s a host of regulatory requirements on the asset side, such as what you can do with the liquidity coverage ratio, for example. On the asset side, there are capital requirements, such as the capital buffer that you have to hold. Therefore for these banks to become depository institutions, you’re under great regulatory scrutiny, which should be the case because you also have many privileges; You have access to the lender of last resort facility at the Fed, the Fed will help you out in the case of a liquidity crisis. You’re supported in many ways by a variety of state apparatus. Shadow banks operate outside that way. Things like the money market funds, for example, emerged in the early 1970s. In fact, I just tweeted out this morning that the stablecoins that we see rising today very much seem to look like these money funds that were emerging in the 1970s. They were emerging because they were exploiting the variety of regulations that were prohibiting banks. For example, banks were prohibited on how high of an interest rate they could pay on a savings account. And this was at a time when T-bills were earning quite a bit higher. These money funds were basically doing what the stablecoins are doing now; They were collecting an underlying set of securities or assets like high-yielding treasuries and issuing a stable asset on the liability side, which permitted me to earn a stable asset higher interest rate on my deposit with the shadow bank. Now, unlike the depository institutions, my balances in the depository institutions were insured by the Federal Deposit Insurance Corporation up to $100,000 at the time. Today it is up to $250,000. My money in the shadow banks is not insured in that manner, so, therefore, you’re exposing yourself to additional risk. In that way, I think that the stablecoins today really resemble what was happening in the money fund industry. I kind of lost the train of thought of the question in my description. What was the specific question?  Chris Cameron: Are asset-backed stablecoin issuers similar to shadow banks or some other species of financial instrument?   Given the way that I just described the money funds, they look like and smell like shadow banks and even to a greater extent because today, as we just spoke about the DAO structure, shadow means outside the realm of regulatory scrutiny. Therefore they truly are operating in the shadows. I would say yes.   Q: Given that Maker and perhaps other protocols can potentially lend to RWAs at negative real interest rates and do so profitably and at scale; Assuming Maker ever gets big enough to make an impact on the economy, how does that affect inflation? Is that possible to have an impact on inflation rates if you’re still able to generate funds to lend but at a rate lower than the real rate of inflation? 16:37  Questions relating to determinants of inflation are great questions. It’s actually a little bit embarrassing that in the context of economic theory, we still don’t really have that great of a theory of inflation that I could appeal to, which would answer that question in any satisfactory manner. The weakest thing I can say is that these types of developments will likely have all sorts of effects on productive capacity and perhaps on the ability of people to secure funding for projects that they might not have had the funding available through conventional financial markets. It could be that the stablecoins, to the extent that they use US Treasury securities as collateral, would increase the demand for US Treasury securities. In that sense, it would serve as a very disinflationary phenomenon because they’re just soaking up this government paper that’s being printed. I don’t have an exact answer to that question. So many things impinge on inflation. My own views are that the primary determinants of inflation are ultimately rooted in fiscal policies. In particular, deficit spending due to the size of the deficit covers how much paper the government is issuing. It’s not actually in paper these days. They are also digital interest-bearing accounts. But the private sector has to absorb that. Somebody’s got to be holding these government T-bills, and the deficit is pumping them out. On the other side is the demand for these securities. Where’s that demand coming from? To an extent, these stablecoins are contributing to the demand for these US Treasury securities, or these stable coins become a large phenomenon as I suspect they might; you could well see how they may impinge on the inflationary dynamic. That’s really all I can say. There are so many moving parts in the global economy that it’s hard to say what will happen.   Q: If Maker or other protocols end up emerging at such scale that they begin moving large financial markets in the real world, does that mean that state-sponsored Central Banks then have to try to find a way to integrate with them, capture them for their own policy purposes, or just use bigger muscles than they do now? 20:17  That depends a lot on what we, broadly as a society, perceived to be the risks of these types of structures. At root, these structures are being driven by a demand for these services. I often hear opponents in this space advocate for consumer surplus. They’re cutting out the middleman and offering a certain type of service for a lower cost. How can that be a bad thing? To a first approximation, that’s correct. We do need to be careful, though, because we saw, for example, what happened to shadow banks. As I mentioned, the shadow banks also arose in the 1970s to service customers like ourselves. It permitted us to, for example, earn a higher interest rate on our deposits than were offered by the banks. That was a way to get around the regulations. An entirely new space grew up in the money market industry. We had commercial paper with money funds backed by student debt. They monetized all sorts of assets, and there’s a lot of good rationale for why that’s a good thing. It effectively transforms what are illiquid assets into liquid security that people find useful. The problem is, and I know probably a number of your libertarian viewers will take issue, is that history shows us that this kind of development, these financial markets, do not operate seamlessly without any problems. For example, there’s a natural tendency for these products to issue paper against riskier and riskier securities. Why? Because they’re offering you marginally more and more attractive returns. The risk may or may not appear for decades, but then suddenly it manifests itself like in the 2007 and 2008 financial crisis and boom! Suddenly this risk that everybody didn’t think was there somehow fell back into itself within the economic system and contributed to a massive financial crisis, as we all know. Those lessons lead us to think about the emergence of stablecoins in the same way. We have to appreciate that it is good here. This is part of a process of innovation in financial markets. The question is, how much of this innovation is fundamental? Is it fundamentally economizing on, say, record-keeping costs? Is it permitting people to process payments faster, more securely, with more privacy? These are fundamental innovations that the broader public should have available; Just normal technological innovation. On the other hand, to what extent are these financial instruments engaged in what people might label regulatory arbitrage? They’re not really offering anything fundamentally better or new, but they’re permitting these organizations to circumvent an existing regulatory structure. And here you can take a viewpoint; You can say perhaps this regulatory structure was designed for a purpose to keep the structure safe and offer consumer protection. Or, you could argue that the regulatory structure is out of date. And yes, you could argue that these structures are performing regulatory arbitrage. Still, they’re circumventing these out-of-date regulations, and that’s a good thing. There’s a variety of views you can take here. My view is it’s somewhere in the middle. I’m radically agnostic, and therefore I end up disappointing everybody. Still, I think it’s something that the researchers and members of the community, and society as a whole, have to talk about, discuss, debate, and evaluate. That’s where I’ll leave that.   Q: Recently, El Salvador stated that they would make bitcoin a legal currency. Suppose a dollar-picked stable coin became a legal tender in a non-U.S. country. Would the effects of that look different from just accepting dollars as a legal tender? What would we expect to happen with regard to which currency would end up dominating? Presumably, the least desirable currency would be dominated as the medium of exchange? 25:48  The least desirable currency?  Chris Cameron: Yes, such as gold or silver.   I see, so like Gresham’s Law. For non-U.S. based, many non-U.S. based economies already use the U.S. dollar. El Salvador and Panama are such countries. What would happen if they adopt a stable coin version of that? On the surface, I could see very little difference. The stable coin, presumably, if it is structured as a narrow bank, could be holding close to 100% U.S. dollar reserves in some way. From a macroeconomic perspective, it would just be a different representation of the same U.S. dollar. Now, the country’s people might have all the benefits that the stable coin governance structure offers, but that’s kind of more of a microeconomic phenomenon. From a macroeconomic perspective, it’s just like adopting U.S. dollars.   Q: If assets backing a shadow bank’s currency are fully transparent and visible, does this mitigate the issues with the 1970s shadow banks, as the risk would be visible, and customers would be able to operate according to their risk preference? 28:41  Great question. Who doesn’t like transparency and things like that? There’s actually literature on this question, and the results are not what you think. It’s a tough line to draw, but I’m just going to report to you some of the results in the literature that suggests that full transparency is not always a good thing in a second-best world. I know this comes across very badly, especially from a central banker. Still, I can refer you to the academic literature that is, in fact, disinterested in central banking. They asked the question: “Under what circumstances is more or less opacity desired?” The second thing is I find it curious to take a look at the economics literature, the seminal papers in banking fragility, which is called the Diamond–Dybvig Model. Diamond–Dybvig Model is a theoretical framework that many economists use as a basic thought organizing framework, such as how to think about financial instability and bank runs. This model is appointed by many as providing the theoretical foundations for why fractional reserve banking or stable coins that are similar in structure would be subject to self-fulfilling runs that the framework demonstrates the conditions under which this instability exists. It’s really interesting to note that the banks’ balance sheet in this model is completely transparent. You still get bank runs in a theoretical world where everything is completely transparent to everybody. The point of highlighting this is to say the following; first of all, I’m all in favor of transparency, who isn’t, but in the shadow banking sector, more transparency would surely have been very good for regulators in particular, because much of the shadow banking sector operates over the counter but kind of hidden from regulators. More visibility would have been a good thing, but it’s not necessarily sufficient. That’s the lesson of the Diamond–Dybvig Model. Therefore, greater transparency is probably a great thing, but not necessarily a sufficient condition.   Q: What if the institution was capable of instantaneous settlement of all debts? You could imagine several scenarios where possible, but instead of a fractional reserve, it would be fully backed. 32:18  Being fully backed can still get the runs. It’s a technical kind of a structure. What happens in the Diamond–Dybvig Model is this technical thing called the sequential service constraint, which simply means that you’ve served on a first-come, first-serve basis when you go to a bank. That’s very common in most retail establishments, but in retail level banking, at least, it’s kind of pervasive. The bank has fundamentally sound assets in the Diamond–Dybvig Model; however, they’re illiquid. The whole purpose of the bank and likewise with the stable coins is to transform the illiquid security into a payment instrument that people find more convenient to make payments. The problem with the asset side of the balance sheet is that the assets are illiquid. What does that mean? Suppose I’m a stable coin and offer my depositors a high interest rate using first-come, first-serve. In that case, you can withdraw your money in an instant. How does that help? I’m promising you a high rate of return, kind of projecting that not all of you are going to want to withdraw your money at the same time and that I’ll be able to manage the outflow in a reasonable manner. Suppose something happens that causes everybody to demand their money to be pulled out instantaneously. The question is, how does the bank honor the obligations and the promises that it’s made? If there’s a sudden mass withdrawal event, the stable coin that allows instantaneous withdrawal would actually exacerbate that because if the withdrawals were at least somewhat delayed, the bank would have some time to negotiate the sale of its assets in an orderly manner and not get excessively discounted in a secondary fire-sale market. What happens in the traditional story is that the bank is compelled to dispose of its assets at fire-sale prices, and now it doesn’t have the wherewithal to make good on the obligations that it issued. In that way, the run can become self-fulfilling. The fact that you can withdraw your money instantaneously would make the potential problem worse instead of better.   Q: Turning back to central bank digital currencies, if you were king of the federal reserve and in charge of at least a CBDC that was going to be issued, would you go the route of issuing on the blockchain? Why or why not? People also have asked what would you make the logo look like? 35:36  When people say blockchain, I think it’s kind of important to define what you mean by that term. I have my own view of what constitutes a blockchain. To me, the central property of a blockchain is very different than what you can get with conventional database protocols due to the notion of blockchain being a decentralized consensus. This can be done in a variety of ways. We know bitcoin does it through proof of work where these miners play this non-cooperative game to achieve this reward for their accounting services. The key thing is the whole community is involved in managing this shared ledger. I think that model is great. I’ve blogged before about how this is actually, in fact, a very ancient form of record keeping. Hunter-gatherer societies have used reciprocal gift exchange models, where the community keeps track of a virtual ledger in the collective minds of the community and its shared history. This is something that progressed and is continuously updated without the aid of any delegated historian or anything like that. This is what we mean when we say blockchain is basically pointless for a central bank to adopt. Why would you trust your central bank to manage your payments? It’s not like the central bank’s going to steal your money or whatever. Central banks don’t have to steal your money because they can print all the money they want. In terms of the machinery, the actual kind of machinery that debits and credits accounts is just bookkeeping and accounting. It’s not rocket science. You have to worry about keeping the account secure and whether or not you want to make them visible to the public, which isn’t something that requires blockchain. I can post my diary online and make it open access if I want. I don’t think blockchain is something that central banks need to appeal to. What about distributed ledger? No. The Fed already keeps four copies of the fed wire. They could keep more. All the desirable properties of managing a database from a central bank’s perspective can draw on the innovations in database management protocols that don’t involve blockchain. Blockchain is for the set of people who value permissionless access. Those are the things that I think blockchain has a comparative advantage to, but I don’t see its application for central banking as of right now. I could be wrong, but that’s my view.   Q: Regarding assets on central banks’ balance sheets and whether or not central banks would ever consider tokenizing reserves? Perhaps you could explain how that process works today and if that would make any difference so that banks could use their excess reserves at the fed as collateral. 39:50  This concerns tokenizing reserves. There’s a sense in which the banks could already tokenize their reserves to convert them all into physical currency. I guess these reserves are already tokenizable in the sense that they could be converted into that physical currency. Still, of course, that’s not a very practical alternative given that the maximum denomination size for a U.S. bill is a hundred dollars. We’re talking about trillions of dollars of reserves. Since 2008, congress has permitted the fed to pay interest on reserves that the Fed was not permitted to before 2008. It had nothing to do with the financial crisis; It was actually legislation coming from earlier. The idea is that banks should not be penalized for holding this security that was more or less interest rate security. Therefore, they thought, “why don’t we permit them to earn some interest in it” and so it’s very safe security, of course. The way to think about it is it’s basically like a T-bill; It’s just an interest-bearing account, that to me, is indistinguishable from an account at the www.treasurydirect.com. In this sense, these reserves are already on the asset side of the bank’s balance sheets. They’re already used as collateral to support the deposit liabilities issued on the liability side and are somewhat already acting as collateral. If I understood correctly, the question was, could these banks be permitted in some way to rehypothecate these securities that were actually were tokenized?  Chris Cameron: Yes, so they could use them effectively for cash-secured loans.   Why would banks want to get a loan? They’re the ones who create the money. Banks are the money creators in our economy. They are the primary source of money. If I tell a bank I need a mortgage for my house, the credit officer evaluates my purchase. Suppose I want to start a business and I need to borrow some money. In that case, the credit officer evaluates my business, and then they say whether it’s a good idea. The bank doesn’t have to get reserves for this. The bank just presses a keystroke, and deposits appear in your account. These deposits are redeemable at par for currency. Let’s say it’s a $100,000 loan; I’m not just going to cash it out. I’m going to leave it in the banking system. The banks don’t need reserves to make these loans, to begin with. I think maybe this is kind of where the question might be a little bit off track. The bank needs reserves perhaps to settle interbank payments. It can borrow reserves on the interbank market overnight or from the fed if it runs shorter reserves. Therefore, it doesn’t really need to tokenize reserves to rehypothecate them or anything like that.   Conclusion  Chris Cameron  I want to thank our guest David Andolfatto. I want to give a brief shout-out to Andrew Burban, who gave me a sweet MakerDAO t-shirt. You may have gotten an email. I tried to tell them you’re not allowed to accept gifts. I also want to let listeners know that on July 13th, at the same time same we will have Professor Campbell Harvey of Duke’s Fuqua School of Business for our next Speaker Series to discuss his forthcoming book on DeFi. Apparently, we’re in it! Thank you.  David Andolfatto: If people would like to continue to have a conversation with me, I’d be very happy to do that. You can follow me on Twitter or just send me an email. I’m very happy to have more conversations. I learn a lot from people out there. I’m learning along with the rest of you. My views are going to be evolved over time.     Common Abbreviated Terms CBDC: Central Bank Digital Currency DAO: Decentralized Autonomous Organization RWA: Real World Asset  Credits  Artem Gordon produced this summary. David Utrobin produced this summary. John Izii produced this summary. Jose Ferrari produced this summary. Everyone who spoke and presented on the call, listed in the headers.  ",
                    "links": [
                        "https://youtu.be/CJ4vqE__f8g?t=68",
                        "https://www.youtube.com/watch?v=CJ4vqE__f8g&t=1s",
                        "https://www.crowdcast.io/e/makerdao-speaker-series",
                        "https://www.stlouisfed.org/about-us/leadership-governance/bank-officers/executive-bios/david-andolfatto",
                        "https://youtu.be/CJ4vqE__f8g?t=68",
                        "https://youtu.be/CJ4vqE__f8g?t=127",
                        "https://www.ledgerinsights.com/mark-carney-stablecoins-access-to-central-bank-balance-sheet/",
                        "https://youtu.be/CJ4vqE__f8g?t=334",
                        "https://youtu.be/CJ4vqE__f8g?t=501",
                        "https://youtu.be/CJ4vqE__f8g?t=745",
                        "https://twitter.com/dandolfa/status/1409883448307822597",
                        "https://youtu.be/CJ4vqE__f8g?t=997",
                        "https://youtu.be/CJ4vqE__f8g?t=1217",
                        "https://youtu.be/CJ4vqE__f8g?t=1548",
                        "https://en.wikipedia.org/wiki/Gresham%27s_law",
                        "https://youtu.be/CJ4vqE__f8g?t=1721",
                        "https://en.wikipedia.org/wiki/Diamond%E2%80%93Dybvig_model",
                        "https://youtu.be/CJ4vqE__f8g?t=1938",
                        "https://youtu.be/CJ4vqE__f8g?t=2136",
                        "https://youtu.be/CJ4vqE__f8g?t=2390",
                        "https://forum.makerdao.com/t/speaker-series-2-duke-university-fuqua-business-school-professor-campbell-harvey-july-13-3-00-pm-utc-11-00-am-edt/9035",
                        "https://twitter.com/dandolfa?lang=en"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.63461267559918
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#17",
                    "likes": "3",
                    "time": "09/07/2021-19:28:07",
                    "content": "Thanks for this. Just got a request today for a transcript or semi-transcript! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#18",
                    "likes": "4",
                    "time": "09/07/2021-20:47:42",
                    "content": "Yes, thank you to All contributors (Artem, David, John, Jose) for putting this transcript together. I missed this episode, so this is super cool. My Fav Question and Discussion was about Shadow Banking  – good stuff, and Thank you @PaperImperium for creating this series. Looking forward to many more! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.508333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Artem_Gordon",
                    "index": "#19",
                    "likes": "2",
                    "time": "10/07/2021-20:23:40",
                    "content": "Yes, I actually found David’s opinions between the early money market funds and current yielding farming and etc quite interesting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.75
                }
            ]
        }
    ]
}