{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - OFH (Security Tokens Refinancing) - October 18, 2021",
            "index": "10605",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "108,694",
            "highest_fraction": 0.98
        },
        {
            "title": "Add RWA-008 (OFH) as a new Vault Type - July 11, 2022",
            "index": "10605",
            "option": "Yes",
            "supporting_mkr": "96,551",
            "highest_fraction": 0.83
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/security-tokens-refinancing-mip6-application-for-ofh-tokens/10605",
            "title": "[Security Tokens Refinancing] MIP6 Application for OFH Tokens ",
            "index": 10605,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "socgen"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SylvFromSG-Forge",
                    "index": "#1",
                    "likes": "56",
                    "time": "30/09/2021-19:16:07",
                    "content": "Dear MakerDAO Community, We submit to you, on behalf of European investment firm Societe Generale-Forge, this MIP6 application for discussion and approval of Security Tokens refinancing. This first experiment at the crossroads between regulated and open source initiatives, as described below, is intended to refinance a Covered Bond Token that has been issued last year on the Ethereum public blockchain. We let you take into consideration all the details, and we look forward to receiving your feedback. Thank you. 1.\tWho is the interested party for this collateral application? Societe Generale – Forge (“SG – Forge”) is a regulated subsidiary of Societe Generale (“SG”) licensed as an investment firm under MiFID 2 regulation, and dedicated to digital assets and blockchain-based projects. SG is one of the leading European financial services groups with over 138,000 members of staff in 62 countries and supports on a daily basis 29 million individual clients, businesses and institutional investors around the world by offering a wide range of advisory services and tailored financial solutions. This refinancing transaction experimentation is in line with the innovative process and solutions developed by SG-Forge. This experimentation combines traditional capital market activities with the decentralized finance (“DeFi”) emerging and growing ecosystem. For the purpose of this MIP6 application, we define and assume following elements that will be used along the application:   The “OFH Tokens”: the OFH Tokens are characterized as covered bonds under French Law backed by home loans and benefiting from a statutory privilege, issued by Societe Generale SFH (SG SFH) a specialized credit institution with the status of Société de Financement de l’Habitat delivered by the Authorité de Contrôle Prudentiel (as further described below) in the form of security tokens in the Ethereum public blockchain.   The OFH Tokens are not admitted to trading on a trading venue, so that they can only be traded over the counter (“OTC”).   The main characteristics of the OFH Tokens are the followings:  ISIN: FR0013510518; Nominal Amount: 40MEUR; Interests: Fixed rate at 0%; Final Redemption Amount: 100% of the Nominal Amount; Issue Date: 14/05/2020; Maturity Date: 14/05/2025; Rating: aaa by Moody’s and AAA by Fitch; Form of the OFH Tokens: dematerialized Notes in fully registered form, registered in Ethereum public blockchain; Governing Law: French Law.    The DAIs have been characterized as digital assets as defined under French Law.   For comprehensive purpose, terms in square brackets are still to be determined or to be discussed. 2.\tProvide a brief history of the project and a brief high-level overview of the project, with a focus on the applying collateral token SG-Forge aims to provide issuers and qualified investors, with end-to-end services to issue, manage and trade digital-native financial instruments registered on the blockchain (“Security Tokens”). SG-Forge’s service offering is based on the open source framework CAST (Compliant Architecture for Security Tokens). Further information on CAST can be found at www.cast-framework.com. CAST is a new market standard and open-source (available under Apache 2.0 license) set of components, designed for the issuance, custody, and trades of Security Tokens. The CAST Framework has been approved and trialed in significant issuances of Security Tokens realized in 2019 with the first worldwide security tokens issuance of a native security on the Ethereum public blockchain (SG SFH €100,000,000 issuance of OFH Tokens), 2020 with the first security tokens issuance settled in Central Bank Digital Currencies (CBDCs) in partnership with Banque de France (SG SFH €40,000,000 issuance of OFH Tokens), and 2021 the issuance of bond tokens by the European Investment Bank on the Ethereum public blockchain settled in CBDCs issued by Banque de France (EIB €100,000,000 issuance of bond tokens), as well as the first worldwide issuance of a structured product in the form of native Security Tokens on Tezos public blockchain (Societe Generale €5,000,000 issuance of Notes tokens). Through this first pilot use case SG-Forge aims to :   Refinance the OFH Tokens held by Societe Generale.   Set-up the legal structure of the refinancing and apply the appropriate accounting and operational principles;   Integrate with one of the largest DeFi protocols;   Help to shape and promote an experiment under the French legal framework:  security tokens; the pledge on security tokens in a blockchain; the use of a security agent;    Enhance a profitable service and foster liquidity for digital bonds.   Also, this transaction allows MakerDAO to have a different type of collateral assets from the cryptocurrencies. While the stability fees will be close to the interest rate paid under classical covered bonds, it provides access to a non-volatile type of collateral assets. General description of the refinancing structure of the OFH Tokens:  SG Forge would grant a USD loan to SG (the “USD Loan”); As security for the performance and discharge of its obligations under the USD Loan, SG would transfer by way of security to SG Forge the ownership of the OFH Tokens with a right of reuse; SG-Forge would borrow DAI from the Maker Representative (the “DAI Loan”). For the purpose of the DAI Loan, SG-Forge would pledge the OFH Tokens to the benefit of the Maker Representative and located in a Vault (the “Pledge”). The Pledge does not imply a transfer of ownership of the OFH Tokens to MakerDAO, unless the Pledge is enforced; SG-Forge would enter into an agreement with an exchange agent (the “Exchange Agent”), whereby it would deliver the DAI it received pursuant to the DAI Loan against US dollars. The US dollars obtained pursuant to the Exchange Agreement would allow SG-Forge to make the USD Loan; and Upon the unwinding of the transaction, the following would simultaneously occur: (i) the USD Loan would be redeemed by SG to SG-Forge, (ii) SG-Forge would exchange with the Exchange Agent the U.S. dollars received from SG against DAI, (iii) the DAI obtained by SG Forge would be redeemed under the DAI Loan, (iv) the Pledge of the OFH Tokens would be released, and (v) the OFH Tokens would be transferred back by SG-Forge to SG.  StructureJPG823×408 35.1 KB    DAI loan features:  Up to 20MDAI ; Maturity: 6 to 9 months.  Description of the Parties:   The Registrar: Societe Generale – Forge, an investment firm incorporated under French Law, having its registered office at 17 Cours Valmy, 92800 Puteaux, France, registered with Nanterre Commercial and Company Registry under number 882 696 628. The Registrar maintains the register of the security tokens issued by Societe Generale SFH and held by Societe Generale. The Registrar will record the transfer and the pledge of the OFH Tokens as required by the structure.   Societe Generale: a credit institution (établissement de credit) incorporated under the laws of France, having its registered office at 29, boulevard Haussmann, 75009 Paris, France, registered with Paris Commercial and Companies Registry under number 552 120 222. Societe Generale is currently holding the OFH Tokens on Ethereum.   MakerDAO (« The Community »). The Community is composed by MKR Token holders. The Community is then a collection of unknown people or legal entities.   Maker Representative: The Community is not a legal entity, so that the Community cannot execute a legal document by itself. The Community will then need to appoint a natural person or a legal entity to represent and act for the account of The Community. In that respect, The Community will process to a vote to appoint a Maker Representative that will execute legal documentation. The Maker Representative serve as administrative role (interest payment/reception, bills, etc.). To clearly define the Maker Representative role, The Community should assign the Maker Representative obligations and duties and appoint it by voting.   Security Agent: refers to DIIS Group (https://www.diisgroup.com/) who will act as Maker Representative and as Security Agent of the Community according to article 2488-6 and seq of the French Code civil in order to take, create, manage, release and enforce the pledge for the account of the Community.   Exchange Agent: Societe Generale – Forge will exchange DAI with USD with an exchange agent that will be revealed in due time.   4.\tLink the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated.    CAST Framework   CAST Framework | Bridging the gap between Capital Markets and Digital Assets Societe Generale – FORGE provides issuers and investors with innovative services to issue and manage digital-native financial products registered on the blockchain, leveraging on Societe Generale Group internal teams expertise         SG FORGE   SG FORGE | Bridging the gap between Capital Markets and Digital Assets Societe Generale – FORGE provides issuers and investors with innovative services to issue and manage digital-native financial products registered on the blockchain, leveraging on Societe Generale Group internal teams expertise      Smart contract address: 0x9915CeD2820082a25A8992752AA43bCB0E1d1097 5.\tLink any available audits of the project. Both procedural and smart contract focused audits. The Smart contract has been audited by a leading audit firm and will be provided to MakerDAO Core Units. 6.\tLink to any active communities relating to your project. To facilitate the gradual adoption of the CAST Framework and common market practices by various stakeholders and foster their participation and contributions for various use cases, a Governance Body for the CAST Framework will be set up. The “CAST Governance Body” will bring together the main stakeholders interested in digital asset and Security Token projects (banks, start-ups, technology service providers, financial institutions, etc.) to govern the CAST Framework and amend it from time to time if necessary. The philosophy of the CAST Governance Body will be based on the following pillars: the development of new business models based on digital technology and open-source digital ecosystems, breakthrough innovations, and the technological modernization of market participants and of financial services provided to clients. A dedicated forum to discuss the CAST Framework will soon be added on CAST website: https://www.cast-framework.com/ 7.\tHow is the applying collateral type currently used? The OFH Token, that will serve as collateral in this refinancing use case, is currently held by Societe Generale. 8.\tDoes one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? As a reminder, SG-Forge would borrow DAI from MakerDAO through the Maker Representative. As a condition precedent to the DAI Loan and as security for the performance and discharge of its obligation of restitution of the DAI, SG-Forge would pledge to the Security Agent, acting in its own name but on behalf of MakerDAO, the OFH Tokens, so that the market value of the OFH Tokens on that date shall correspond at least to the value of the DAI Loan with an overcollateralization percentage. The Security Agent will be in charge of the completion of any pledge formalities that may be required. The rights and obligations of the parties under the Pledge shall remain in full force and effect until the DAI have been fully redelivered by SG Forge to The Community (through the Maker Representative) under the DAI Loan. In that case, the Security Agent shall execute and deliver all such instruments and documents and take all such action, as may be reasonably necessary or appropriate for the purpose of granting a definitive release in respect of the Pledge. DIIS Group (https://www.diisgroup.com/) will act as Security Agent (under French jurisdiction) and the Maker Representative for the structure. The appointment of DIIS Group by the Community needs to be passed through a vote. Collateral Test and Liquidation Procedure: On each Business Day, a collateral agent performs a collateral test (the “Collateral Test”) in order to verify that the market value of the OFH Tokens is at least equal to the collateral percentage that has been fixed. In the event that the Collateral Test is not satisfied on any calculation date (a “Collateral Event”), the collateral agent shall inform SG and the Security Agent of the occurrence of such Collateral Event through a collateral event notice (“Collateral Event Notice”). From the date on which the Collateral Event Notice has been received, Societe Generale shall on following the [five (5)] Business Days either:  Send additional Collateral Assets on the Vault in order for the Collateral Assets value to comply with the Collateral Test; Transfer an amount of USD that reduces the loan of DAIs in order to perform the Collateral Test.  In the event SG does not, within the [five (5)] Business Days period after the delivery of the Collateral Event Notice, such event shall constitute a liquidation event (a “Liquidation Event”), and the collateral agent shall inform SG and the Security Agent of the occurrence of such Liquidation Event through a liquidation event notice (“Liquidation Event Notice”). The delivery of a Liquidation Event Notice shall trigger:  the automatic termination of the DAI Loan which will become immediately due and payable; and the automatic termination of the USD Loan which will become immediately due and payable.  Appropriation or sale of the OFH Tokens following a Liquidation Event Notice Upon receipt of a Liquidation Event Notice, the Security Agent shall enforce the Pledge and hold the OFH Tokens for the account of the Community until the maturity date and their final redemption, or will proceed with the sale of the OFH Tokens to the extent there is a sufficiently liquid market. If the redemption amount paid by SG SFH to the Security Agent exceeds the amount due under the DAI Loan plus the unwinding costs, the Security Agent will transfer the exceeding amount to SG. If the redemption amount paid by SG SFH to the Security Agent is less than the amount due under the DAI Loan plus the unwinding costs, the shortfall will be deemed to be at zero and will not be due to the Security Agent. 9.\tWhere does exchange for the asset occur? The exchange will occur as sequenced in the above diagram. 10.\t(Optional) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. This refinancing transaction experimentation has been approved by  the supervision committee of SG Forge with the relevant validations from Business, Compliance,  Legal and Risks departments of Societe Generale. We benefit from a legal structure memorandum from Gide Loyrette Nouel (one of the major French law firm) that cannot be shared for confidentiality purposes. In the same way, the OFH Tokens that will be used as collateral has been characterized as debt obligations, qualified as covered bonds, issued and governed by French law. They are fungible, negotiable and they provide the same right per securities to the holder and they represent a claim against the issuer. 11.\t(Optional) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable. The OFH tokens (Obligations de Financement de l’Habitat) are issued by Societe Generale Société de Financement de l’Habitat (SG SFH), a specialised credit instritution duly licensed by the Autorité de Contrôle Prudentiel. The OFH tokens constitute debt securities (obligations) in accordance with Article L.211-3 of the French Monetary and Financial Code and, constitute are direct, unconditional, unsubordinated and privileged obligations of the Issuer in accordance with Article L.513-11 of the French Monetary and Financial Code. They are fungible, negotiable and they represent, they provide the same right per securities to the holder and they represent a claim against the issuer. The OFH Tokens are issued and registered in a distributed ledger technology in accordance with Article L.211-3 et seq. and R.211-11 et seq. of the French Monetary and Financial Code. The OFH Tokens are issued under the Euro Medium Term Note Programme described in the prospectus approved by the Autorité des Marchés Financiers and downloadable through https://prospectus.socgen.com/ with criteria (i) Issuer: SOCIETE GENERALE SFH, (ii) Program: DEBT ISSUANCE PROGRAM, (iii) Document type: Base Prospectus. On the date of this Base Prospectus, the legal and regulatory regime applicable to SFH results from the following provisions:  (a) Articles L.513-3, L.513-5, L.513-7 to L.513-26 and L.513-28 et seq. of the French Monetary and Financial Code (as amended from time to time); (b) Article 74 of law n°. 2010-1249 of 22 October 2010 on banking and financial regulation; (c) Articles R.513-1, R.513-3, R.513-4, R.513-6 to R.513-12, R.513-14 and R.513-15 to R.513-21 of the French Monetary and Financial Code (as amended from time to time); (d) the Regulation (réglement) no. 99-10 dated 9 July 1999 issued by the Comité de la Réglementation Bancaire et Financière (Banking and Financial Regulation Committee) as it may be amended from time to time (the CRBF Regulation); (e) the various ACPR’s instructions applicable to SFH.  The exclusive legal purpose of the SFH is to grant or finance home loans and hold securities and instruments under the conditions set out in the French Monetary and Financial Code. The proceeds of the issuance are lent by SG SFH to Societe Generale in accordance with the provisions of the Facility Agreement and that are fully secured by the transfers by way of security of the full title (remise en pleine propriété à titre de garantie) of guaranteed home loan receivables in favour of the Issuer pursuant to the provisions of Articles L.211-36 et seq. of the French Monetary and Financial Code and the provisions of the Collateral Security Agreement. Pursuant to Article L. 513-11 of the French Monetary Code, the sums deriving from the loans, or assimilated receivables, exposures and securities eligible to the assets of a SFH are allocated in priority to the payment of the OFH and, in accordance with Article R.513-7, a SFH must ensure that at any time the funding of its liquidity need over a period at 180 days, taking into account the provisional fund flows arising from the principal and interest amounts over its assets and the net flows relating to the forward financial instruments. Article L.513-20 of the French Monetary and Financial Code precludes the extension of any safeguard procedure (procédure de sauvegarde), judicial reorganisation (redressement judiciaire) or liquidation (liquidation judiciaire) in respect of the SFH’s shareholders to the SFH and, provides for a regime which derogates in many ways from the French legal provisions relating to insolvency proceedings. 12.\t(Optional) List any possible oracle data sources for the proposed Collateral type. The OFH Token is on Bloomberg (ISIN FR0013510518). 13.\t(Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. This first experimentation of a refinancing structure of security tokens through a DeFi protocol will allow us to shape the future for bond refinancing business activity. For this first step, we cannot rely on a liquid market, mainly because there is no exchange for security tokens. However, the new European regulation known as “Pilot Regime” that will enter into forth in the coming month, could offer some DLT-based multilateral trading facilities for Security Tokens, and OTC platforms should bloom with the growth of the Security Token ecosystem. Future transactions would help to propose a liquidation process with interested parties and more in line with the MakerDAO keeper feature. DISCLAIMER This document has been prepared by Societe Generale - Forge, a subsidiary of Societe Generale (“Societe Generale”) exclusively for the benefit of MakerDAO. In preparing this document, Societe Generale – Forge has used information available from public sources. No express or implied representation or warranty as to the accuracy, completeness or relevance of such information is made by Societe Generale - Forge, or any other party. Societe Generale - Forge has neither performed nor obtained any independent verification of information obtained from external sources. No responsibility or liability (express or implied) is accepted for any errors, omissions or misstatements by Societe Generale – Forge or for the consequences arising from the use of the information contained in this document, except in the case of fraud or any other liability which cannot lawfully be excluded. The contents of this document are subject to amendment or change at any time and Societe Generale – Forge will not inform MakerDAO of any such amendment or change. This document is of an information and not of a commercial or of a regulatory nature. Opinions expressed are the opinions of the authors and do not necessarily represent the opinion of Societe Generale - Forge. Any views, opinions or conclusions contained in this document are indicative only, are not based on independent research and do not represent an offer or commitment, express or implied, on the part of Societe Generale _ Forge to underwrite or purchase any securities or any financial instrument(s) or digital assets referred to herein or to commit any capital, nor does it commit Societe Generale to enter into an underwriting agreement or similar commitment to finance, such an offer being subject to contract,  the completion of satisfactory due diligence and all necessary credit, management and other approvals being obtained. The market information displayed in this document is based on data at a given moment and may change from time to time. Any information in this document is purely indicative and has no contractual value. The commercial merits or suitability or expected profitability or benefit of any transaction described in this document to MakerDAO particular situation should be independently determined by MakerDAO.  Any such determination should involve an assessment of the legal, tax, accounting, regulatory, financial, credit and other related aspects of any such transaction, based on such information and advice from MakerDAO’s own advisers and such other experts as the MakerDAO deems relevant.  Societe Generale – Forge shall not be liable for any failure by MakerDAO to obtain such information and advice. Societe Generale and its affiliates (the “SG Group”) comprise a full service securities firm and commercial bank engaged in securities, commodities and derivatives trading, foreign exchange and other brokerage activities, as well as providing investment, corporate banking, asset and investment management, financing and strategic advisory services and other commercial services and products to a wide range of corporations, governments and institutions from which conflicting interests or duties, or a perception thereof, may arise.  In the ordinary course of these activities, parts of the SG Group at any time may invest on a principal basis or manage funds that invest, make or hold long or short positions, finance positions or trade or otherwise effect transactions, for their own accounts or the accounts of customers, in debt, equity or other securities or financial instruments (including derivatives, bank loans or other obligations) of institutional or corporate clients, potential counterparties or any other company that may be involved in a transaction. The publication of this document may be restricted by law or regulation in certain jurisdictions, and in accessing to this document all persons into whose possession it comes are deemed to confirm that they are aware of, and are able to receive this information without contravening, any such restrictions in the jurisdictions in which they are incorporated or carry on business. By accessing to this document you agree to the above terms and conditions. You will find our complaint handling process management policy at: https://cib.societegenerale.com/en/who-are/compliance-regulatory-information/useful-information/client-claim/. This document is issued in France by Societe Generale  - Forge and shall be governed by and construed in accordance with French law. Societe Generale – Forge is an investment firm that is authorized and supervised by the Autorité de Contrôle Prudentiel et de Résolution (ACPR) (the French Prudential Control and Resolution Authority) and regulated by the Autorité des marchés financiers (AMF) (the French financial markets regulator). Details about the extent of our authorisation, supervision and regulation by the above-mentioned authorities are available from us on request. Société Générale-Forge is a limited liability company (société anonyme), with a registered office at 17 Cour Valmy 92800 Puteaux, registered at the Nanterre Trade register under number 882 696 628. ",
                    "links": [
                        "https://www.diisgroup.com/",
                        "https://www.cast-framework.com/",
                        "https://www.cast-framework.com/",
                        "https://www.sgforge.com/",
                        "https://www.sgforge.com/",
                        "https://www.cast-framework.com/",
                        "https://www.diisgroup.com/",
                        "https://prospectus.socgen.com/",
                        "https://cib.societegenerale.com/en/who-are/compliance-regulatory-information/useful-information/client-claim/.",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-09/10825",
                        "https://forum.makerdao.com/t/maker-relay-ep-65/10697",
                        "https://forum.makerdao.com/t/collateral-status-index/2231",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/signal-request-set-psm-fees-to-0/10894",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/52",
                        "https://forum.makerdao.com/t/acreinvest-delegate-platform/11943/31",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/83",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/89",
                        "https://forum.makerdao.com/t/governance-house-delegate-platform/15191/10",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/84",
                        "https://forum.makerdao.com/t/sg-forge-socgen-risk-assessment/15638/14",
                        "https://forum.makerdao.com/t/rwa-008-ofh-evaluacion-del-oraculo-para-la-incorporacion-de-garantias-traduccion/15281",
                        "https://forum.makerdao.com/t/rwa-008-ofh-collateral-onboarding-oracle-assessment/15268",
                        "https://forum.makerdao.com/t/rwa008-ofh-mip21-token-ces-domain-team-assessment/15239",
                        "https://forum.makerdao.com/t/sg-forge-ofh-token-transaction-update/14334",
                        "https://forum.makerdao.com/t/paper-on-stablecoins/12960",
                        "https://forum.makerdao.com/t/collateral-management-lifecycle-cml/12751",
                        "https://forum.makerdao.com/t/maker-relay-ep-68-en-espanol/11250",
                        "https://forum.makerdao.com/t/maker-relay-ep-68/11182",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/ses-project-real-world-sandbox/10910",
                        "https://forum.makerdao.com/t/maker-relay-ep-65-en-espanol/10784",
                        "https://forum.makerdao.com/t/growth-cu-monthly-update-january-2023/19828",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2023-01-19/19463",
                        "https://forum.makerdao.com/t/collateral-onboarding-and-management-update/17441",
                        "https://forum.makerdao.com/t/3-boletin-de-noticias-enero-del-2023/19672",
                        "https://forum.makerdao.com/t/relay-semanal-26-de-julio-01-de-agosto-del-2022/17049",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/7"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.175377785794453
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#2",
                    "likes": "19",
                    "time": "30/09/2021-21:08:58",
                    "content": "Glad to see this out in public. Huge thanks to those who had a hand in getting it this far. They all know who they are, so I won’t doxx them unless they want the public accolades. Maker and SocGen-Forge are standing at the precipice of financial history. What a time to be alive. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.8125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#3",
                    "likes": "35",
                    "time": "30/09/2021-21:13:01",
                    "content": "This MIP6 is a new landmark in DeFi and showing how DeFi and TradFi are merging together to create Finance 2.0. Need to thanks @Growth-Core-Unit for the amazing work. I joined only at the end. On a risk side, this deal doesn’t have a good risk/reward, you can see LIBOR 1 week, it’s not much. Risk is super low on the collateral (AAA, quite a good haircut even taking in account the currency risk, as safe as it gets) but there is always an execution risk and there will be quite a bit of work. This collateral should be seen as step 1 of what is next to come. Integrating all publicly traded bonds (that will be on Ethereum as we all know) and providing repo. Quite a huge market. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.334498834498834
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bneiluj",
                    "index": "#4",
                    "likes": "11",
                    "time": "30/09/2021-22:40:21",
                    "content": "Amazing! Very clear and elaborated proposal. Security Tokens refinancing. by SocGen using MakerDAO…we are living a real hinge of history ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.883333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#5",
                    "likes": "10",
                    "time": "30/09/2021-22:51:12",
                    "content": "Great to see this application coming through. The first of many interactions at the frontier of the regulated bond market. Having more solid players and securities should be the way forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.05
                },
                {
                    "author_link": "https://forum.makerdao.com/u/AXA",
                    "index": "#6",
                    "likes": "3",
                    "time": "01/10/2021-01:45:45",
                    "content": "No info about the stability fee , or any existing rate had been announced ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jason",
                    "index": "#7",
                    "likes": "13",
                    "time": "01/10/2021-04:08:18",
                    "content": "It is great to see a fully rated AAA bond get proposed as a collateral asset from a top notch institution! In addition, the open source CAST Framework for security tokens is certainly something to explore further. It looks like the bonds are 5 year bonds that were issued in 2020 and mature in 2025 with 0% interest. Did I read that right? Wow - @SebVentures wasn’t kidding when he said there would not be much interest earned. Is that rate in line with comps? The US effective AAA corporate bond rate is currently 1.93%, I’m not sure what it is in France but I am sure it is a lower than the US. There was very little provided on the details of the underlying real estate loans. Are we talking about residential mortgages? Commercial office lending? Construction loans? I would suggest that the due diligence team dig into their real estate lending transaction history, the subscription agreement, and the ratings analysis to truly understand the cash flow characteristics, the credit enhancements, and why this is rated AAA. Here are some more areas for due diligence: the proposal suggests that Maker’s term will be 6-9 months. So Maker acts as a source of liquidity for SG-Forge for a bond that does not otherwise have an active secondary market? And will SG-Forge pay back the DAI loan and close the vault in 6-9 months? Will there be cash flows expected during that time frame? What will be SG-Forge’s intended use of capital? The risk seems low on this deal. The risk that the bond value will change is minimal, the counterparty risk (SG-Forge) is really low, the regulatory risk is likely lower, and the pool will be overcollateralized. From that perspective it seems like a excellent experiment and a safe, non-correlated asset for the Maker Vaults. I just wish it paid some interest. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.717405913978495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#8",
                    "likes": "7",
                    "time": "01/10/2021-07:02:58",
                    "content": "A landmark day, even more for traditional credit institutions than MakerDAO. A day that is putting again the focus on how responsibilities can be shared and decentralised across an ecosystem of borrowers, structurers, intermediaries, and financiers. Immense kudos to those who contributed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lester-B-Cool",
                    "index": "#9",
                    "likes": "3",
                    "time": "01/10/2021-07:30:09",
                    "content": "This is big! Congrats to Maker and SG-Forge on being the first in the tradfi-DeFi blend. Point #8 Maker community will vote a community representative. Maker community will vote the security representative jurisdiction in France. Might need some due diligence here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.208333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#10",
                    "likes": "2",
                    "time": "01/10/2021-08:33:12",
                    "content": "    SylvFromSG-Forge:  ough this first pilot use case SG-Forge aims to :  Refinance the OFH Tokens held by Societe Generale. Set-up the legal structure of the refinancing and apply the appropriate accounting and operational principles; Integrate with one of the largest DeFi protocols; Help to shape and promote an experiment under the French legal framework:  security tokens; the pledge on security tokens in a blockchain; the use of a security agent;   Enhance a profitable service and foster liquidity for digital bonds.  Also, this transaction allows MakerDAO to have a different type of collateral assets from the cryptocurrencies. While the stability fees will be close to the interest rate paid under classical covered bonds, it provides access to a non-volatile type of collateral assets.   this application shares many traits conceived in CSC proposal. I have capture some genuine good schemas of this application which could help bring clarity starting with the monies flow. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.145833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#11",
                    "likes": "9",
                    "time": "01/10/2021-17:16:16",
                    "content": "Although I do not intend in no way to play down this monumental advancement in connecting DeFi to TradFi, a few open points emerge from a quick read of this MIP6. I am sure that collateral onboarding will help clarifying. I paste my random questions below hoping they can be useful,  What would be the effective yield, I.e. would OFH tokens be contributed at par vs. third-party valuation? What is the reason behind a mismatch between the maturity of the underlying security and the vault? Given the centralised nature of the collateral pledge, where an agent actually would take ownership of the tokens rather than a programmatic contract, what is the view of the onboarding team circa the adherence to the standards of security and decentralisation? The same applies to the valuation oracles. How does the community intend to enforce virtuous behaviour of the Maker Delegate? Given, as stated, the lack of liquidity for this type of tokens in approved otc venues, wouldn’t have been more appropriate to wait for this ecosystem to emerge or, in the interim, for the sponsor to offer some kind of buyback guarantee / backstop to protect maximum downside in the remote case of impairment? Couldn’t the sponsor have facilitated trading of those tokens in the DEX ecosystem in parallel? In order to provide liquidity to the market? Does it intend to do so in the future? Given the costs of onboarding such collateral, in terms of time spent and advisory costs for the community, what is the sponsor’s view of a pipeline for this type of transactions going forward? How does SG view Maker alongside other sources of financing within DeFi and in connection to the CBDC projects they have been participating in?  I personally truly believe this type of collaboration goes in the right direction of expanding Maker’s footprint via diversifying underlying exposures, while outsourcing to others most of the structuring and legal work. I am looking forward for the DD to proceed on this collateral onboarding application. Again, as usual, these are my personal opinions without any legal or investment implication attached. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4978689006466785
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Brady_Dale",
                    "index": "#12",
                    "likes": "7",
                    "time": "01/10/2021-18:15:36",
                    "content": "Hi all, my name is Brady Dale and I’m a reporter with The Defiant. I don’t really know how to talk to MakerDAO any longer now that the Foundation is gone. I’m trying to do a deeper dive into this deal and have some questions. How can I get started talking to the DAO about those things? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "4",
                    "time": "01/10/2021-18:26:02",
                    "content": "The Defiant! What took you so long?  There’s a Media Forum Media - The Maker Forum you can also reach out to @Davidutro ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Brady_Dale",
                    "index": "#14",
                    "likes": "1",
                    "time": "01/10/2021-18:29:03",
                    "content": "Oh great, will do, thx! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jenn",
                    "index": "#15",
                    "likes": "3",
                    "time": "01/10/2021-18:47:16",
                    "content": "    Brady_Dale:  Hi all, my name is Brady Dale and I’m a reporter with The Defiant. I don’t really know how to talk to MakerDAO any longer now that the Foundation is gone. I’m trying to do a deeper dive into this deal and have some questions. How can I get started talking to the DAO about those things?   Hey Brady, you can also speak to @Growth-Core-Unit about this ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#16",
                    "likes": "2",
                    "time": "01/10/2021-19:55:44",
                    "content": "MakerDAO !!! This is huge, big congratulations to the teams involved in procuring this MIP6. Can’t say enough about how exciting this is, and could be, for the future of MakerDAO! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.700000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tru_Greg",
                    "index": "#17",
                    "likes": "2",
                    "time": "01/10/2021-20:51:08",
                    "content": "   Great day, monumental achievement @SebVentures and the invincible Maker Team. To the Moon!    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ciao",
                    "index": "#18",
                    "likes": "2",
                    "time": "02/10/2021-14:21:16",
                    "content": "    SylvFromSG-Forge:  The Pledge does not imply a transfer of ownership of the OFH Tokens to MakerDAO, unless the Pledge is enforced;   “The Pledge does not imply a transfer of ownership of the OFH Tokens to MakerDAO, unless the Pledge is enforced;” Not clear to me, what the above legal language exactly mean, since I lack a legal background? Without the transfer of ownership, can the collateral be sold to mitigate potential losses? Given the unique nature of the collateral, how would one go about sourcing a bid to sell such a collateral and be able to settle into proceeds? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.506944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#19",
                    "likes": "2",
                    "time": "02/10/2021-16:09:04",
                    "content": "    ciao:  Given the unique nature of the collateral, how would one go about sourcing a bid to sell such a collateral and be able to settle into proceeds?   Given the maturity is less than 4 years away and the extent of the over collateralization vs face value, it would be an option to just hold the zero-coupon bond to maturity for something like a 20%+ annualized return. Not to say that is what we would choose to do. But we would not, strictly speaking, need to locate a buyer if we had faith in the bond being paid in full at maturity.     ciao:  “The Pledge does not imply a transfer of ownership of the OFH Tokens to MakerDAO, unless the Pledge is enforced;”   Not a lawyer, and there may also be translation going on. But probably means that we do not own the collateral unless/until claims on it are enforced. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.631944444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#20",
                    "likes": "2",
                    "time": "02/10/2021-16:56:39",
                    "content": "Interesting points @PaperImperium. I fully agree with you with the huge margin of safety - that would be enhanced by the over-collateralisation, but I struggle to reconcile the 20% return calculations. I think the nature of the collateral, and the structure, offer great downside protection, but the return is capped unless there is a ‘purchase’ below par of the token which I don’t think would be the case. I think that the absence of the transfer of ownership is related to the need, for policy and maybe regulation, of having a recognised intermediary (the Agent) dealing with the collateral. It is more than fair and customary, but it is not in line with the (long-term) ambition of decentralisation - still, a great step forward. I’d truly appreciate the CUs or anybody else providing more detail on a review of the application, as I’m sure it will happen. I’m studying this myself, although limiting myself only to public info. As usual, if the community believes my expertise to be of any use, I’m happy to get involved. As usual, no legally enforcing opinion nor investment advice or advice of any kind. Again, kudos to everyone, this is truly a monumental step forward. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.6139705882352935
                },
                {
                    "author_link": "https://forum.makerdao.com/u/itsgiangiacomo",
                    "index": "#21",
                    "likes": "2",
                    "time": "02/10/2021-17:51:48",
                    "content": "    PaperImperium:  Not a lawyer, and there may also be translation going on. But probably means that we do not own the collateral unless/until claims on it are enforced.   I’m not a french lawyer either, but in TradFi secured financings a lender usually advances a loan to a borrower who grants a security in favour of the lender over specific assets owned by the borrower itself. The borrower maintains ownership of the asset until an event of default occurs and the security is enforced, resulting in the transfer of the ownership of the asset to the lender.     PaperImperium:  Given the maturity is less than 4 years away and the extent of the over collateralization vs face value, it would be an option to just hold the zero-coupon bond to maturity for something like a 20%+ annualized return.   The overcollateralization bit is not clear to me. The MIP6 Applications indicates that \"If the redemption amount paid by SG SFH to the Security Agent exceeds the amount due under the DAI Loan plus the unwinding costs, the Security Agent will transfer the exceeding amount to SG\". Thus, MakerDAO would not be entitled to get 100% of the redemption price at maturity, but only an amount equal to the DAI Loan plus unwinding costs. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.50462962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ciao",
                    "index": "#22",
                    "likes": "0",
                    "time": "03/10/2021-02:19:20",
                    "content": "    SylvFromSG-Forge:  collateral agent   I could not see how collateral agent is defined like with other participants, given that the collateral agent performs the important role of the collateral test to ensure that the collateral is valued correctly. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ciao",
                    "index": "#23",
                    "likes": "0",
                    "time": "03/10/2021-02:46:55",
                    "content": "Is compensation by SG via SG-Forge to MakerDao community for providing funds to fund their bond position, explicitly stated somewhere? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Naim",
                    "index": "#24",
                    "likes": "15",
                    "time": "04/10/2021-14:34:51",
                    "content": "Hello everyone, Here is GoldenNaim from sushi, and I want to share my personal opinion. Firstly, as a person living in France, i’m very proud and happy to see this MIP6 Application from one of the largest bank in France ( top 2 ) , in UE ( top 5 ) and in the world ( top 20 ) . It shows us how TradFI and DeFI protocol can work together. More important : I believe that an important part of institutional funds will probably come from the activity of refinancing & loan. It’s a win-win deal for TradFI & DeFI A small tech briefing : The transparency is important for the community. Let’s take a look of the ERC20 OFH Token contract 0x9915CeD2820082a25A8992752AA43bCB0E1d1097 :   Even if the source code isn’t open, we can retrieve these data : owner \t\t\t:\t0x7b66e68c64e051db9876f07c24d093a38389e825 initialSupply\t:\t400  (  ) currentSupply\t:\t400 name\t\t\t:\tVULC01  (  ) symbol\t\t:\tVULC01 (  ) ISIN\t\t\t:\tFR0013510518  (  ) undefined\t\t:\t100000\t\t\t\t( NB : 400*100000 = 40,000,000€ - same amount) divisor\t\t\t:\t100 startDate\t\t:\t1588896000 — Friday 8 May 2020 00:00:00 undefined\t\t:\t1747180800 — Wednesday 14 May 2025 00:00:00 —\tMaturity Date\t (  ) undefined\t\t:\t1747180800 undefined\t\t:\t1620950400 — Friday 14 May 2021 00:00:00 — undefined\t\t:\t12 undefined\t\t:\t0 undefined\t\t:\t257 These data correspond with the bond here : Covered Bond Label   Even if it’s an ERC20 Token, by reading the potential failed log events, a lot of improvement have been done with, it seems, the goal to match traditional standard for this type of bonds ( whitelisted investors, possibility to lock/unlock the token, impossibility to transfer the token after a date ). List of errors which can be emitted by the contract :   ERROR\t: Only issuer can perform this action  (  ) ERROR\t: Subscription ticket not locked ERROR\t: Transfer balances failed ERROR\t: Issuance has matured. Tokens cannot be transferred anymore  (  ) ERROR\t: Only operator with registrar role can unlock token  (  )    The contract has been created by another contract ( CAST FRAMEWORK ? )  : 0x62eacbd2801ee8ae866ef57909eebbf407dd1dd7 We can still use the function : getTokenByName(string name) , getAllTokens().   getTokenByName(“VULC01”) returns the correct address of the OFH Tokens held by Societe generale : 0x9915CeD2820082a25A8992752AA43bCB0E1d1097 .  (  ) Only a whitelisted address can use the contract, otherwise you the contract will return the error : Calling address should match registrar agent     Short resume of the OFH Tokens / covered bonds : If I read correctly, from multiple sources, they are 100% backed by home loans. The cover pool is composed of multiple mortgage, which represent a large over-collateralization , up to 140%  (  ) Every trimester, a global report can be downloaded here for people who want to know more about what  is behind : https://www.crh-bonds.com/Info/ECBC_Label.html These bonds had ( and still have ) a strong AAA from Fitch & Moody, with a stable outlook, official source :   (  ) https://assets.fitchratings.com/enhancedWorkbooks/90486077/9067d910-8bdf-4076-bd8a-1b0c85fa06d3 OTC Trading // exchange for security tokens     SylvFromSG-Forge:  For this first step, we cannot rely on a liquid market, mainly because there is no exchange for security tokens   Following the launch of Trident,  Sushi will begin formalizing franchised pools for institutional and other permissioned use cases. Franchised pools are a way to allow users to provide liquidity on decentralized exchanges while meeting their compliance needs. As such, these pools will be differentiated from the main Trident AMM system and will allow whitelisting and similar features for liquidity providers and swappers. Let’s discuss another day about Franchised pools available soon on Sushi. Risks & Benefits For this specific DAI Loan, the risk seems extremely low, especially because of the over-collateralized percentage ( the french Law want a minimum of 125% , it’s around 140% ). Otherwise, the liquidation process can be done quickly. Well, all DeFI’s actor must be happy of this news. The bond refinancing is a big market, with serious institutional investors, who are able to inject hundred of billions inside our eco-system, which is exactly what we want and I’m personally very happy for this potential collaboration between Maker & SG . ",
                    "links": [
                        "https://coveredbondlabel.com/issuer/83/bond/11614",
                        "https://etherscan.io/address/0x62eacbd2801ee8ae866ef57909eebbf407dd1dd7#code",
                        "https://www.crh-bonds.com/Info/ECBC_Label.html",
                        "https://assets.fitchratings.com/enhancedWorkbooks/90486077/9067d910-8bdf-4076-bd8a-1b0c85fa06d3"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.721726190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#25",
                    "likes": "3",
                    "time": "04/10/2021-14:55:12",
                    "content": "This is an exciting transaction - with a top tier counterparty and excellent collateral!  And rated AAA. Here are some thoughts on the structure and risk of the proposed transaction. I think its important to remember this proposed transaction is a covered bond structure as opposed to a securitization structure.  Covered bonds are senior secured debt instruments typically issued by a bank. In addition to the recourse to the issuer a covered bond investor also has a preferential claim to a separate “cover pool” of mortgage loans or other high quality assets meant to be isolated from the issuer in an insolvency.  Thus the risk analysis of a covered bond covers the (1) corporate issuer, the (2) “cover pool” of assets and (3) the cover structure that gives investors a preferential claim to the “cover pool” if needed. This covered bond deal is rated AAA by Fitch (aaa by Moodys). SocGen is currently rated A- by Fitch The credit of SocGen and the covered pool together are AAA Implicitly the covered pool must be rated AAA When Fitch rates this covered bond AAA that means that it can withstand a AA+ rating stress and still pay out timely principal and interest.  Given that a AA+ rating stress would cause Soc Gen (rated A-) to default, this implies that the covered bond must look mainly to the covered pool of assets to pay its timely principal and interest and that the covered bond structure functions as designed.  Note that the ratings stress is not just credit focused but also interest rate focused so if the covered pool are interest rate sensitive (such as fixed rate mortgages), they must be able to withstand both a AA+ credit stress and a AA+ interest rate stress. The covered bonds and the covered pool of French mortgages are denominated in Euros and hence there is not currency risk to the covered bond.  However, the MarkerDao loan will be in DAI so the currency risk needs to be addressed. I have provided links below for A)  the underlying covered pool below (by Fitch) B)  Fitch’s Covered Bond rating criteria C)  A thoughtful discussion on covered bond risks by PIMCO A)  Link to Fitch data on covered asset pool: https://assets.fitchratings.com/enhancedWorkbooks/90486077/9067d910-8bdf-4076-bd8a-1b0c85fa06d3 B)  Link to Fitch Covered Bond Rating Criteria: https://www.fitchratings.com/research/structured-finance/covered-bonds/covered-bonds-cdos-public-entities-asset-analysis-rating-criteria-24-09-2021 C)  Here is a good discussion from PIMCO on covered bonds   Pacific Investment Management Company LLC    Dual Recourse – the Covered Bond Advantage Kristion Mierau, portfolio manager, European covered bonds, discusses the characteristics of covered bonds and how an allocation to these securities can serve as an alternative to European sovereign debt.      ",
                    "links": [
                        "https://www.fitchratings.com/research/structured-finance/covered-bonds/covered-bonds-cdos-public-entities-asset-analysis-rating-criteria-24-09-2021",
                        "https://europe.pimco.com/en-eu/insights/investment-strategies/featured-solutions/dual-recourse-the-covered-bond-advantage",
                        "https://europe.pimco.com/en-eu/insights/investment-strategies/featured-solutions/dual-recourse-the-covered-bond-advantage"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.061842105263158
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#26",
                    "likes": "5",
                    "time": "04/10/2021-15:31:05",
                    "content": "Some details on the covered asset pool (Fitch data on covered asset pool) as of June 30 2021: (currency in euros) POOL STATISTICS 42.83 billion in mortgages in pool 60 covered bonds in pool 37.04 billion covered bonds 1.6 billion average covered bond 5.6 year WA maturity in covered bonds 3.15 billion covered bonds with maturity in less than 1 year MORTGAGE STATISTICS 350,976 mortgages in pool 122,749 average mortgage (Euros) 99% fixed rate mortgages 46.6 months WA seasoning of mortgages 14.8 year WA maturity of mortgages 68.2% WA CLTV of mortgages 100% guaranteed mortgages 78.3% owned occupied mortgages 0.0% mortgages in arrears 100% French mortgages 36.9% Ile-de-France (incl. Paris) 9.3% Nord-Pas-de-Calais OVERCOLLATERALIZATION: 15.6% overcollateralization (OC) 5.0% minimum regulatory OC% 5.0% minimum contractual OC% 7.0% break even OC% 2.9% break even credit loss OC% 4.2% break even ALM loss OC% ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.069444444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jason",
                    "index": "#27",
                    "likes": "6",
                    "time": "04/10/2021-19:26:24",
                    "content": "While this is a very positive first step, let’s not forget that we should remain focused on a future where we tokenize all 350k mortgages in the pool for full on-chain transparency. We should see all tranches, not just the AAA tranche on-chain. A protocol is a system of collaboration and this is a perfect example where multiple parties can collaborate on-chain. The issuer, the credit ratings agencies, the valuation firms, the auditors, the security agents, the exchange agents, the Maker representative, and any investors in the junior tranches should work in unison to establish the risk, get it priced, and then get it funded. Such a structure will help solve some of the audit deficiencies that surfaced in 2008 and it will lead towards removing the friction in the TradFi system that will result in greater access to capital and a lower cost of capital delivered by DeFi. This is the future of finance and the future of DeFi. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.197727272727272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#28",
                    "likes": "3",
                    "time": "05/10/2021-11:50:33",
                    "content": "This is a great development and congrats to the CU teams. We are meeting with a U.K. ‘high street’ bank later this week and this would be a great story to share, especially as the initiative is coming a French bank  Whilst this is inevitable - the DeFi and CeFi interoperability - their choice of partner is a proof point of how competitive Maker can be in terms of funding costs. As MKR holders, we probably won’t get much in terms of direct benefits either as stability fee or at liquidation. Going with Maker or not, SC has plenty of other funding options eg retail deposits and bond markets. Other borrowers do not have the same luxury, especially those from high growth emerging markets. So hope this sort of deals don’t crowd out other deal where Maker can make a huge difference in terms of financial inclusion and revenue for the protocol too. Cover bonds do have cover pools which may or may not sit in a separate SPV but all the while should be trackable on chain, ultimately. The memory of 2008 is still fresh and our bank partner was bailed due to the loss of nexus between underlying mortgages and the myriad of instruments that were layered on top of them. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.695238095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#29",
                    "likes": "0",
                    "time": "06/10/2021-17:15:59",
                    "content": "Agreed - all the underlying assets should be on-chain BUT they contain personal info on the mortgage holders that cannot be broadly shared.  Is it easy enough to sufficiently anonymize the mortgage personal info to protect the mortgage holders but also include enough info to help the investors? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.413194444444445
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#30",
                    "likes": "1",
                    "time": "06/10/2021-18:49:08",
                    "content": "I don’t think that securing personal info is a real concern for the current tech, but bringing natively on-chain the whole chain will definitely be a true challenge. Especially considering the fact that some authorities and counterparts will have to get comfortable with the lack of central enforcement of certain actions - which is the reason to exist of authorities and the reason not to of DeFi. Still, incredible step forward. I am working on a piece for Dirt Roads, the newsletter I host, that goes into the details of the deal - my very personal opinions over it. I will share this here in the thread for anybody interested. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0476190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/quntangled",
                    "index": "#31",
                    "likes": "1",
                    "time": "07/10/2021-10:50:04",
                    "content": "Data Privacy and Security Law in Europe GDPR requires very strict handling of personal data on Europeans. But agreed with @luca_pro it should not be an issue for current tech. Depending on granularity of the underlying assets it is not even necessary to look at every individual exposures (apart from verifying existence and claims) but to use statistical analyses to assess portfolio risk. This technique is used by rating agencies and is accepted by institutional investors. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SylvFromSG-Forge",
                    "index": "#32",
                    "likes": "10",
                    "time": "07/10/2021-12:55:26",
                    "content": "Dear MakerDAO community, First, thank you for all your messages. On reading your messages, Iet me clarify/precise the following points. Purpose of the experimentation: This first use case is designed to shape our future refinancing offering on Security Tokens.  This first step focuses on legal, operational, and technical integration feasibility. To ease the realization of this experimentation:  We will use a series of OFH Tokens issued by SG SFH and currently held by SG and for which SG-Forge is the Registrar; and The OFH Tokens are fixed rate covered bonds at 0% in order to avoid asset servicing complexity.  If this first experimentation is conclusive, we would propose this refinancing setup to our clients, i.e. the investors in Security Tokens issuances. At this stage, SG-Forge is structuring debt instruments in the form of Security Tokens covered bonds, Notes (secured and unsecured) and structured products (Notes linked to underlying assets). Experimentation concerns and scale-up option: We are aware of the weakness of the liquidation process and collateral valorization in this experimentation framework. We think that below elements mitigate these drawbacks:  The covered bond tokens are highly rated. In the context of this experimentation, the DAI Loan will be overcollateralized enough with such a high quality assets. For information purposes, retained covered bonds have a haircut between 8% to 10%. We invite the community to request the ECB collateral eligible assets (Query eligible assets) with comparable OFH bonds issued by SG SFH (e.g. FR0013358496, FR0013232071, FR0013259413). At inception, the DAI Loan will be collateralized at least at 130%. We propose a liquidation ratio at or around [115%]. We will also ensure a minimum operational ratio that will be higher than the liquidation ratio [at or around 120%] (either to add collateral, or to refund DAI or to unwind the structure). It will be a short-term refinancing experiment. We expect to terminate the refinancing structure after a period of 6 to 9 months maximum to be efficient enough. In case of the enforcement of the pledge, the covered bonds will have a short remaining maturity (less than 4Y). Because the OFH Tokens are not liquid, we assume that the price will be close to par. However, the French Law covered bonds are a highly regulated and transparent. I complete the Naïm post (thank you by the way for the clarity of your post) with the following link that provides all the information regarding the SFH covered bonds issuances and the cover pool: Investisseurs dette - Société Générale under “Société de financement de l’habitat” and “HTT Covered Bonds Label Reporting / Asset Reports”.  In a second time, to offer this refinancing solution to security token holders and to comfort MakerDAO, we will work on an efficient liquidation process with appropriate market data oracles for this kind of assets. Those features should be assessed post experimentation.  For example, several initiatives could be looked at like a network of keeper for Security Token or a SushiSwap facility for Security Token (as suggested by Naïm). Also, the European regulation is under progress to enable Security Token exchanges (i.e. Pilot Regime Regulation). Parameters of the experimentation:  Maturity of the refinancing: from 6 to 9 months. Stability fees: stability fees should be close to the refinancing rate (repo rate) of a covered bond asset plus a liquidity premium. Liquidation ratio: we propose at or around [115%]. An internal operational threshold at or around [120%] will be monitored to avoid liquidation.  OFH Token Smart Contract: The smart contract relies on CAST that complies with legal and regulatory frameworks. For that purpose, only whitelisted operators can interact with the smart contract. We can of course make a workshop with MakerDAO core units to explain the CAST framework and to discuss the technical integration. But I think it will be the case if the greenlight is granted. Thank you, SG-Forge, ",
                    "links": [
                        "https://investors.societegenerale.com/fr/informations-financieres-et-extra-financiere/investisseurs-dette"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.535582010582011
                },
                {
                    "author_link": "https://forum.makerdao.com/u/M1CHEN_EntroFi",
                    "index": "#33",
                    "likes": "1",
                    "time": "13/10/2021-07:20:29",
                    "content": "An truly exciting proposal from SG; this is just another example to show that yields generated by off-chain real world asset (RWA) is the future destinatino for DeFi liquidity.  Although DeFi TVL has exceeded $100bn over the past 18month, such number is still dwarfed by the size of real world finance, which is measured in $trillions. Me and my team have also launched a project called EntroFi to connect DeFi capitals directly with loan borrowers who use real world assets (account receivables, real estate properties, pledges of securities, etc.) or existing NFTs as collaterals.  We envision a world where liquidity and assets alike flow freely between on chain and off chain, and therefore would love to work with anyone team or platform who share such vision with us. This could be something truly extraordinary. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.83974358974359
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JasonYang4738",
                    "index": "#35",
                    "likes": "0",
                    "time": "13/10/2021-08:30:29",
                    "content": "That’s Awesome, looking forward to witnessing this EntroFi project!    ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 10.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#36",
                    "likes": "2",
                    "time": "13/10/2021-09:02:21",
                    "content": "I believe that this project is setting the bar for the quality of the interactions that intermediaries should and will have with the Maker ecosystem, independently from the outcome of the collateral onboarding process. I am looking forward to read more from the teams which are DD’ing the deal on what is the community’s reaction to this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#37",
                    "likes": "0",
                    "time": "13/10/2021-09:48:57",
                    "content": "i particularly like the diagram that includes monies flows back and forth; in fact; I have gone ahead and implemented a similar one to our application which I will be submitting promptly. A question however remains open whether MakerDAO is open to use a Security Agent and if so, to onboard more than 1 proposed in the application. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555555555555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Fernando_Verboonen",
                    "index": "#38",
                    "likes": "0",
                    "time": "13/10/2021-09:57:13",
                    "content": "Dear SG-Forge, The CurioDAO, a collaborator with MakerDAO, proposes a unique solution that could perhaps help alleviate some of the weaknesses of the liquidation process. We are of the opinion, utility tokens and security tokens are converging, and provided our solution supports this collab, I would be more than happy to do an intro with our legal consul respectively share more about this solution. By bringing additional liquidity to security tokens via a novel Wrapped token module via a token that represents solely the ownership to the underlying asset is not considered as a security. For more about this topic, see option 2 in CurioDAO’s legal opinion [Analysis on wrapped token_20210428_final.pdf - Google Drive](https://4.- Wrapping Token Legal Note) More about CurioDAO here https://forum.makerdao.com/t/csc-mip6-application-curiodao-s-stablecoin-backed-by-tokenized-physical-real-world-assets/10495/2 ",
                    "links": [
                        "https://forum.makerdao.com/t/csc-mip6-application-curiodao-s-stablecoin-backed-by-tokenized-physical-real-world-assets/10495"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.887499999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/justacru1ser",
                    "index": "#39",
                    "likes": "1",
                    "time": "17/10/2021-15:22:49",
                    "content": "Hi, I’m new to this, and I haven’t fully understood the MakerDao whitepaper, so these questions may be dumb. As a lawyer think I fairly understand the proposal though. Anyhow:   How is the collateral test made to ensure the loan is sufficiently collateralized ? Are the OFH tokens or their underlying assets publicly traded anywhere ?   Why is the entity making the collateral test (the Security agent) the same as the Maker representative ? Why was it chosen by SG and what legal obligations will it have towards individual members of the community as a representative ?   In the event that the collateral crashes in value, won’t the value of the emitted DAI crash as well ? Would that not give SG 5 business days to buy DAI back at a very low value with its USD and reimburse its loan ?   Love the initiative. Just wondering who’s taking most of the risk in this transaction. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.755165289256199
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#40",
                    "likes": "4",
                    "time": "17/10/2021-21:04:44",
                    "content": "    justacru1ser:  In the event that the collateral crashes in value, won’t the value of the emitted DAI crash as well ?   DAI generated by OFH is not only backed by OFH. DAI is backed by the total value locked in the protocol plus the market cap of MKR. If OFH becomes worthless then any shortfall will be made up by selling MKR. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#41",
                    "likes": "2",
                    "time": "20/10/2021-00:53:21",
                    "content": "Going to vote yes for this assuming DD will be completed. A lot of questions.  One of them is regarding the DC here.   I understand this being an experiment sounds like SF is going to be 0 here and it looks like the DC is going to be roughly full value to CR of 130% which seems somewhat odd for an experimental deployment. Supportive of experiments but my issue is containing risk on these things to something the protocol can handle (i.e. SB on hand which is around 50M). I also get concerned when I heard the following from the RWF CU lead.     SebVentures:  On a risk side, this deal doesn’t have a good risk/reward, you can see LIBOR 1 week, it’s not much. Risk is super low on the collateral (AAA, quite a good haircut even taking in account the currency risk, as safe as it gets) but there is always an execution risk and there will be quite a bit of work.   Even so I see no reason to stop this from next stages and expect relevant CUs to step forward with analysis and commentary here vs. just leaving this for governance to go/no go.   We really need good color from people who are being paid to do these jobs (risk, RWF, and if PECO has anything). I agree with others this is exciting if Maker can properly get this under its belts. With so much going on I have some concerns of over work and some critical issues falling through cracks due to how these are being pressed forward.  It was my hope we would have something of a standard model for RWF before bringing on so many new RFW players. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.136528326745719
                },
                {
                    "author_link": "https://forum.makerdao.com/u/StephaneFromSG-FORGE",
                    "index": "#42",
                    "likes": "10",
                    "time": "04/08/2022-18:48:14",
                    "content": "Dear MakerDAO community, as a proof of ownership of SocGen address 0x03f1A14A5b31e2f1751b6db368451dFCEA5A0439, please find below a message and its signature using corresponding wallet: Message: RWA008_A_OPERATOR Signed message: { “address”: “0x03f1a14a5b31e2f1751b6db368451dfcea5a0439”, “msg”: “0x5257413030385f415f4f50455241544f52”, “sig”: “d330b917f8871cf6be803f67409228eb2ac69f8253869425ea94f69e5408ef3b527f94242daa124b4472e258e61f798cdebd5aa5969a5e5db48d832fa7cdc2f500”, “version”: “3”, “signer”: “ledger” } Best regards Stéphane Duzan, SG-Forge COO ",
                    "links": [
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/108",
                        "https://forum.makerdao.com/t/relay-semanal-09-15-de-agosto-del-2022/17353",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/10"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#43",
                    "likes": "1",
                    "time": "04/08/2022-19:04:21",
                    "content": "Great to see SG Forge posting for the SG OFH Token deal ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 9.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/amusingaxl",
                    "index": "#44",
                    "likes": "8",
                    "time": "04/08/2022-20:04:19",
                    "content": "For anyone interested in checking by themselves, you can use Etherscan Signature Verification tool. #donttrustverify NOTICE: You will need to prepend the 0x prefix to the sig value posted above. Parameters:  Signer Address: 0x03f1a14a5b31e2f1751b6db368451dfcea5a0439  Signature Message: RWA008_A_OPERATOR  Signature Hash:0xd330b917f8871cf6be803f67409228eb2ac69f8253869425ea94f69e5408ef3b527f94242daa124b4472e258e61f798cdebd5aa5969a5e5db48d832fa7cdc2f500    Here’s a screenshot after the verification:  image1390×748 163 KB  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#45",
                    "likes": "0",
                    "time": "04/08/2022-20:11:29",
                    "content": "thanks!  Its good to see it all coming together ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/csmith",
                    "index": "#46",
                    "likes": "5",
                    "time": "04/08/2022-20:22:26",
                    "content": "As the spell author this week. I have also verified this signature using Etherscan Verification Tool: Address: 0x03f1A14A5b31e2f1751b6db368451dFCEA5A0439 Message: RWA008_A_OPERATOR Signature Hash: 0xd330b917f8871cf6be803f67409228eb2ac69f8253869425ea94f69e5408ef3b527f94242daa124b4472e258e61f798cdebd5aa5969a5e5db48d832fa7cdc2f500 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#47",
                    "likes": "1",
                    "time": "05/08/2022-19:27:16",
                    "content": "Also have verified the signature as one of this week’s spell reviewers. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SylvFromSG-Forge",
                    "index": "#49",
                    "likes": "15",
                    "time": "06/03/2023-18:41:54",
                    "content": "Dear MakerDAO Community, The Societe Generale - Forge team would like to warmly thank you for this first innovative trade. Your collaboration and your support have been much appreciated. The overall transaction was a success. It has demonstrated that on-chain refinancing markets could be opened to real money asset owners, in full compliance with banking standards, with potentially significant improvements of financial terms, operational efficiency, settlement and counterparty risks. We confirm that we burnt the RWA-008 Token in accordance with the procedure and that we don’t have access to the credit line anymore. We, hereby, confirm to the community that the vault can be closed. We will continue working on expanding Security Tokens refinancing by scaling such DeFi solutions. Notably with the entry into force of the EU Pilot Regime which will definitely improve the liquidity for Security Tokens’ secondary market and as a result enhance MakerDAO liquidation process. In the meantime, we intend to :  Improve our Security Tokens integration with MakerDAO, and Follow closely “end game” developments and evaluate possible associated business development opportunities that may arise with the protocol.  On behalf of Societe Generale - Forge team, we reiterate our most sincere thanks, and we look forward to the next steps. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hajive",
                    "index": "#50",
                    "likes": "1",
                    "time": "08/03/2023-12:11:26",
                    "content": "Thanks for the update @SylvFromSG-Forge , and for the constant partnership from you and the SG-Forge team. I know there were huge learnings on both sides of what it really takes to structure and implement a market reference TradFi-DeFi integration in compliance with banking standards ! As our markets and structure evolve, look forward to collaborating on the next steps ! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Patrick_J",
                    "index": "#51",
                    "likes": "3",
                    "time": "09/03/2023-11:07:18",
                    "content": "With the burning of the RWA-008 token (relevant transaction), the vault is defunct - no further DAI can be drawn from this vault, and all debt has been paid back. This presents an interesting question of what should be done with the vault next. GovAlpha, CES, and PE are now exploring the best next steps to carry out an orderly offboarding of this vault. In the meantime, for completeness, the next executive will include an item to set the Debt Ceiling of the RWA-008 vault to 0. Additional offboarding logic may or may not be included in future executive votes; depending on the outcome of these discussions, we will keep the community updated regarding this. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.055555555555555
                }
            ]
        }
    ],
    "group_index": "156"
}