{
    "poll_list": [
        {
            "title": "Prioritization Sentiment - Technical Resource Deployment - June 6, 2022",
            "index": "15554",
            "option": "Compound D3M",
            "supporting_mkr": "57,032",
            "highest_fraction": -1
        },
        {
            "title": "Prioritization Sentiment - Collateral Class - June 6, 2022",
            "index": "15554",
            "option": "Core Crypto Collateral",
            "supporting_mkr": "55,686",
            "highest_fraction": -1
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/prioritization-framework-sentiment-polling/15554",
            "title": "Prioritization Framework - Sentiment Polling ",
            "index": 15554,
            "category": [
                "Governance"
            ],
            "tags": [
                "governance-poll",
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "15",
                    "time": "01/06/2022-23:49:22",
                    "content": " Prioritization Framework As announced in a previous Governance and Risk call GovAlpha has been spending time building on this priority framework. Given the increasing need for Governance to communicate priority to Core Units, we are proposing a simple first implementation to open the conversation on coordinating priority items between MKR holders and Core Units.  Executive Summary  Starting in June we will have our first round of monthly prioritization voting, in the form of two sentiment polls. Polls will be in the form of Ranked Choice Voting (Instant Run-Off Vote), where MKR holders are invited to indicate their sentiment toward DAO-wide Priority. These sentiment polls will run continuously for 30 days, with data visualization from DIN-001 and weekly updates from GovAlpha. The first set of polls will be Technical Resource Deployment + Collateral Class Sentiment. The results of these polls will not be binding in any way but offer more data for both Core Units and the broader community to consider when making resource allocation decisions. These polls will count toward Recognized Delegate Compensation Metrics.   Context and Motivation Somewhat unsurprisingly, Governance can approve ideas they support much faster than the Core Units can implement them. Moreover, ideation is simpler than implementation so what sounds like a straightforward concept may require a complex technical solution. Topics such as the Sagittarius Engine, Aggressive Growth Strategy, flapper distributor/upgrade to the flapper, and many more have been ideated but not formally voted on. Considering the ever-shifting landscape of DeFi, we must consider that MKR holders may wish to prioritize these items as well despite having voted in other intentions previously. Core Units have ample ways to communicate their priority framework, both through formal processes like Budget MIPs and informal processes such as Core Unit updates. This recurring priority sentiment poll would give counterbalance to the DAO by providing MKR holders the opportunity to signal their prioritization preferences. By holding these polls every month, more data about shifting sentiment and group cohesion become available. If functioning well, this structure will provide a continual snapshot of where MKR voters and delegates would like to see resources deployed.  Structure The vision for this framework is a reoccurring set of monthly polls that will allow MKR holders to express their sentiment on prioritization through the DAO. Multiple polls will be used to allow for a wide range of voter feedback and the potential for “nested” polls. These nested polls would result when a prioritization item has many sub-items that would also need to be prioritized. Using the example from the first trial, one option for Technical Resource Deployment will be “Collateral Onboarding” which would indicate deferral to the outcome of the Collateral Class Sentiment Poll. The voting UI for these polls will be very familiar to all MKR voters, as we are utilizing features already in place on the voting portal. By using our existing voting structure, MKR holders should be able to express prioritization input when they go to the voting portal to vote on regular governance proposals. These sentiment polls will utilize Ranked Choice voting (otherwise known as Instant Run-off Voting), which allows users to input their sentiments for project prioritization. Voters should ONLY RANK options that they want to see the DAO pursue. Sentiment Polls for prioritization will be posted on the first Monday of the Governance Cycle, with voting lasting four weeks. Voters have the option of resubmitting their preferences at any time and are encouraged to do so if their sentiment has changed. Updates will be posted weekly to the forum, with a final result posted at the end of the voting period. Remember that the prioritization resulting from polls is non-binding, meaning that no further action will be mandated from these polls. The following month, the new sentiment poll(s) will be posted. However, the bottom two performing options on all polls will be dropped and replaced. This will also be done for any items fully delivered. For these replacements, the Core Units collectively will be able to add an option, as well as one option from the Recognized Delegates. Open slots from delivered items will be split equally among the two groups, with preference toward the Recognized Delegates. GovAlpha will coordinate these replacement options. At anytime community members may submit an item they would like to see considered for sentiment polling. Relevant submissions will be shared with the Core Units and Recognized delegates for their consideration.  First Trial The first trial of this Prioritization Sentiment Polling will go live on the voting portal on Monday, June 6th. We will start with two polls for consideration:  Technical Resource Deployment Collateral Class Sentiment   Technical Resource Deployment Options  Flapper Distributor/upgrade to the flapper Sagittarius Engine Collateral Onboarding Compound D3M MIP43: Term Lending Module (TLM) Maker Teleport DssKiln  DssSnog - (if implemented, authorizes the Oracle Core Unit to give readers access to oracle prices without having to give authorization via a governance executive, mentioned here) DssGate MIP20: Target Price Adjustment Module (Vox) ESM Simulations Technical Solution to Returning “Lost” DAI   Collateral Class Sentiment Options  Broader Market Demand-Based Solutions (like Aave D3M) Real-World Assets Vaults Real-World Asset Arrangers Core Crypto Collateral (BTC and ETH implementations and derivatives) Alternative Ethereum-based Crypto Collateral (any other ERC20s) Crypto collateral from other chains Traditional instruments (Bonds/Treasuries) Peg Stability Solutions (like USDC PSM)   Other Details Selection for items on these polls was made by GovAlpha with input from relevant Core Units. Additionally, an intentional decision was made to have the Technical Resource Deployment be fairly specific with the Collateral Class Sentiment being more general. Data Insights (DIN-001) will be launching a live vote weight explorer for the community to explore. Additionally, GovAlpha will publish a weekly report on the state of the vote. This will serve not only to remind voters to express their opinion but will allow those who have already voted to see how their prioritization stacks up. By continuing these polls month to month, we will see shifting sentiment within the community. Note that the month-end “results” should not be seen as more significant than other weekly updates. Sentiment Polls will count toward Recognized Delegate Compensation in order to encourage broad participation, but this decision may be revisited in the future.  Shortcomings of the System It is worth noting this system for priority is not optimal. Ranked Choice voting has its limitations and if the feedback generated from these polls is meaningful we may wish to invest resources for a new voting type. Potential drawbacks include:  Ranked Choice over-emphasizes the top choices of each voter. Results may be different when calculating the traditional winner of this format (stopping once one option has over 50% support) vs running the trial until only one option remains. Different initiatives require different resources, meaning that a ranked list may not be actionable even if Core Units are in total agreement with the priority sentiment. Hosting this on-chain will incur an economic cost to voters.   Feedback This structure represents a collaboration with several CUs and has been through a few versions. Feedback is welcomed and encouraged. While I suspect the most valuable lessons will come after we launch the first two polls on June 6th, if there are any concerns before this process launches it would be great to hear from them ASAP. Input from voters on specificity (prefer precise or more general)  will be particularly useful before the second iteration goes live in July. Tagging @Core-Facilitators and @Recognized-Delegates as major stakeholders for this initiative, but questions comments, and concerns can come from anyone  ",
                    "links": [
                        "https://forum.makerdao.com/t/prioritization-in-makerdao/10261",
                        "https://forum.makerdao.com/t/sagittarius-engine/10852",
                        "https://forum.makerdao.com/t/maker-growth-strategy-we-must-act-now/14501",
                        "https://forum.makerdao.com/t/flapperdistributor-a-way-to-distribute-system-surplus-while-minimizing-governance/4591",
                        "https://vote.makerdao.com/",
                        "https://docs.google.com/forms/d/e/1FAIpQLScGMqLqzV-ySAiU_AhqeVuwGwgYFGpTYpEDvdNSzXo9Wi4U-w/viewform?usp=sf_link",
                        "https://forum.makerdao.com/t/flapperdistributor-a-way-to-distribute-system-surplus-while-minimizing-governance/4591",
                        "https://forum.makerdao.com/t/sagittarius-engine/10852",
                        "https://forum.makerdao.com/t/signal-request-should-maker-prioritize-onboarding-a-compound-d3m/11997",
                        "https://forum.makerdao.com/t/mip43-term-lending-module-tlm/6153",
                        "https://forum.makerdao.com/t/maker-wormhole-new-name-maker-teleport/15115",
                        "https://forum.makerdao.com/t/dsskiln-a-permissionless-token-purchasing-tool/14943",
                        "https://github.com/brianmcmichael/dss-snog/blob/master/src/DssSnog.sol",
                        "https://forum.makerdao.com/t/pecu-month-in-review-april-2022/14942#prototyping-5",
                        "https://forum.makerdao.com/t/governance-and-risk-173-thursday-january-06-17-00-utc/12480/2#updates-dssgate-and-future-parameter-management-9",
                        "https://forum.makerdao.com/t/mip20-target-price-adjustment-module-vox/3196",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-163-thursday-october-14-17-00-utc/10972/2#governance-security-and-flexibility-esm-delay-parameters-9",
                        "https://forum.makerdao.com/t/minting-new-dai-to-offset-lost-dai/6396",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-27-de-junio-del-2022/16243",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-7-traduccion/15632",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-7/15618",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-06-03/15600",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/5",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/82",
                        "https://forum.makerdao.com/t/dao-resilience-improvement-initiative-status-update/16413",
                        "https://forum.makerdao.com/t/delegate-priority-surfacing-tool-round-1-results/17341/6",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2022-06-10/15738",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-6-de-junio-de-2022/15740",
                        "https://forum.makerdao.com/t/relay-semanal-31-de-mayo-6-de-junio-2022/15684",
                        "https://forum.makerdao.com/t/jun8-22-post-mortem-for-irv-poll-issues/15671",
                        "https://forum.makerdao.com/t/weekly-relay-may-31-june-06-2022/15654",
                        "https://forum.makerdao.com/t/feedblack-loops-llc-delegate-platform-fbl/9366/84",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-13-de-junio-de-2022/15883",
                        "https://forum.makerdao.com/t/makerman-delegate-platform/9891/79"
                    ],
                    "GPT-summary": "The post introduces a prioritization framework for the DAO to coordinate priority items between MKR holders and Core Units. The framework involves monthly sentiment polls in the form of Ranked Choice Voting, where MKR holders can indicate their sentiment toward DAO-wide priority. The post provides details on the structure, context, motivation, and shortcomings of the system. The author invites feedback from stakeholders and encourages participation in the first trial of the Prioritization Sentiment Polling.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Change to proposal pipeline",
                        "Board composition",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.629673089591568
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MFeinberg",
                    "index": "#2",
                    "likes": "2",
                    "time": "02/06/2022-00:10:15",
                    "content": "Good stuff. Looking forward to the results of the polls. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "2",
                    "time": "02/06/2022-00:40:26",
                    "content": "    prose11:  These sentiment polls will utilize Ranked Choice voting (otherwise known as Instant Run-off Voting), which allows users to input their sentiments for project prioritization. Voters should ONLY RANK options that they want to see the DAO pursue.   ooff, not a fan of RCV-- because NYC ended with an awful Mayor candidate–and Maine’s move toward RCV is being challenged in court–but okay let’s give it a punt.  Will the order of preference repeat until a choice receives a majority, and what is consider a “majority”? 50%? Also, with the possibility that Delegate voters do not rank all of the given choices, will this effect DelComp Metrics?     prose11:  Voters should ONLY RANK options that they want to see the DAO pursue.   I guess this  answers my last question? With that in mind, does a Poll who receive fewer first-choice votes can result as the chosen outcome, correct.     prose11:  Collateral Class Sentiment Options   Assume that this category includes L2s/cross-chain Initiatives, or nah? And last but not least, can you provide more simpler details on how GovAlpha will be nesting the polls? Not sure I understood your explanation properly. Thanks in advance Payton! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#4",
                    "likes": "1",
                    "time": "02/06/2022-01:04:24",
                    "content": "Is this on the agenda to present and explain on the G&R call tomorrow? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#5",
                    "likes": "2",
                    "time": "02/06/2022-05:13:04",
                    "content": "Great idea!  I’m kind of excited about this just as a way to know what’s going on and can see it representing a fluid roadmap.  Perhaps if there is some way to quantify or describe progress that’s already been done on each item and the anticipated amount of the work, you might get a more well-informed result. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.4750000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#6",
                    "likes": "4",
                    "time": "02/06/2022-06:03:36",
                    "content": "RCV isn’t the best choice for signal here. I will give an example that gives a much better signal. Give the voter the ability to allocate say 1000 points to the choices.  This way I as a voter can choose to allocate as follows to the choices.     prose11:  100 * Flapper Distributor/upgrade to the flapper  0 * Sagittarius Engine  50 * Collateral Onboarding 400 * Compound D3M 0 * MIP43: Term Lending Module (TLM) 150 * Maker Teleport 50 * DssKiln 50 * DssSnog - (if implemented, authorizes the Oracle Core Unit to give readers access to oracle prices without having to give authorization via a governance executive, mentioned here) 50 * DssGate 0 * MIP20: Target Price Adjustment Module (Vox) 50 * ESM Simulations 100 * Technical Solution to Returning “Lost” DAI   The above is an example vote for illustrative purposes only. So rather than rank these in some order (which may be useful but doesn’t give a clear signal of importance) the above basically gives a very clear signal of importance that has a value ranking associated. I want the highest resources (40% in my vote above) to go to D3m, 15% to Maker Teleport,10% to Technical solution to Lost DAI, and 5% equally to a number of other options and 0% to a number of others…   Then multiply these numbers by the MKR I am voting in the poll and add them up and normalize to the total.   This gives a very clean signal to the DAO of how much resources for the month to allocate to particular projects when multiplied by the MKR voting and summing over the total voters (then normalizing to the total MKR). In the end you will have numbers like 27% to Compound D3M 24% to Collateral onboarding. 19% to FLapper etc. etc.  which will give a real comparative set of resource allocation numbers to the DAO and CUs. Since 100% is a better total to distribute using 1000 basically allows for voters to allocate resources in 1/10% increments vs. 1%. Please lets not use RCV here but a point allocation system as this when aggregated with all voters votes and their MKR weight give the DAO a much better signal than RCV. Thank you! ",
                    "links": [
                        "https://forum.makerdao.com/t/sagittarius-engine/10852",
                        "https://forum.makerdao.com/t/signal-request-should-maker-prioritize-onboarding-a-compound-d3m/11997",
                        "https://forum.makerdao.com/t/mip43-term-lending-module-tlm/6153",
                        "https://forum.makerdao.com/t/maker-wormhole-new-name-maker-teleport/15115",
                        "https://forum.makerdao.com/t/dsskiln-a-permissionless-token-purchasing-tool/14943",
                        "https://github.com/brianmcmichael/dss-snog/blob/master/src/DssSnog.sol",
                        "https://forum.makerdao.com/t/pecu-month-in-review-april-2022/14942#prototyping-5",
                        "https://forum.makerdao.com/t/governance-and-risk-173-thursday-january-06-17-00-utc/12480/2#updates-dssgate-and-future-parameter-management-9",
                        "https://forum.makerdao.com/t/mip20-target-price-adjustment-module-vox/3196",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-163-thursday-october-14-17-00-utc/10972/2#governance-security-and-flexibility-esm-delay-parameters-9",
                        "https://forum.makerdao.com/t/minting-new-dai-to-offset-lost-dai/6396"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.6546666666666665
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#7",
                    "likes": "3",
                    "time": "02/06/2022-11:41:43",
                    "content": "I’ll add here that DUX and GovAlpha have explored new (ie. more advanced) poll types for this trial, but the decision was made to stick with the current Ranked Choice poll types in order to keep things simple and recognisable for users during this trial. We did however lay the foundation (ie. a new governance metadata system used by the Voting Portal) for introducing new and more advanced poll types that are better suited for polling priorities. This will be explored later, after this trial.     prose11:   Hosting this on-chain will incur an economic cost to voters.    By then DUX team should also have a solution to this problem live  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.171328671328671
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hexonaut",
                    "index": "#8",
                    "likes": "4",
                    "time": "02/06/2022-12:12:20",
                    "content": "In general I don’t think we should be polling at this level of detail. I like the idea of continuous polling, but it should be more broad like voting for a political party. The highest voted could then just set the agenda/roadmap/etc. For example:  Growth-Oriented Party Austerity-Oriented Party Turn DAI into RAI Party etc  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.765625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#9",
                    "likes": "6",
                    "time": "02/06/2022-13:37:23",
                    "content": "This is a great initiative and I am a big fan of trying to tie MKR signalling towards prioritization of resources. Also very important to highlight:   The results of these polls will not be binding in any way but offer more data for both Core Units and the broader community to consider when making resource allocation decisions.   This experiment will probably give us some good intel about how bad governance can be when there is extremely high information cost and no proper context given to any of these things, so hopefully core units will be smart enough to ignore the voting behaviour that isn’t tied to some form of coherent, holistic line of thinking. One thing I don’t like about this, though, is that we can’t add additional options here. It would also be useful to have a way to downvote, and signal things that MKR holders are ready to actively block, so as to save core units time from working on something that will not be implemented. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.093197278911565
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#10",
                    "likes": "5",
                    "time": "02/06/2022-14:26:30",
                    "content": "We’ve added it to the initiative updates segment, it will be covered in today’s GnR call. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#11",
                    "likes": "3",
                    "time": "02/06/2022-14:31:25",
                    "content": "Hey Frank! Will dive into the Ranked Choice stuff a little later when replying to MakerMan, but TL;DR is that we’re aware of the limitations of using IRV to process results, but felt that the data will still be valuable. Moreover, this setup gives us a chance to test this feedback mechanism with little technical overhead, so we don’t waste resources before figuring out if we’re on the right track.     flipflopflapdelegate:  Also, with the possibility that Delegate voters do not rank all of the given choices, will this effect DelComp Metrics?   Just like with other votes, all that matters is a vote is submitted and communicated on the metrics. You can rank as few options as you see fit, as long as you participate at some point during the month (sooner the better though  )     flipflopflapdelegate:  Assume that this category includes L2s/cross-chain Initiatives, or nah?   So L2/Cross chain is addressed a few different ways on the polls. On the Technical one, we have Maker Teleport, which is a prerequisite for any L2 MCD deployment. Will make sure that is communicated clearly when this goes up for vote. On the Collateral Class poll, this would be under “Crypto collateral from other chains.”     flipflopflapdelegate:  can you provide more simpler details on how GovAlpha will be nesting the polls? Not sure I understood your explanation properly.   Still playing around with this one, so I apologize for not being more clear. The idea is that in one poll you could broadly rank your prioritization with items that could be broken down further. So in the example given “Collateral Onboarding” is an option on the Technical poll. This gives us a chance to see how MKR holders would like to see resources prioritized for adding new collaterals. Then we are able to put up a second poll (Collateral Class Sentiment) to see what should be prioritized within the collateral onboarding category. So random example, if Collateral Onboarding is the 2nd most prioritized option within the Technical poll, and Peg Stability Solutions is at the top of the Collateral poll, CUs could say alright we might need to put some more people on PSMs because it is the most important Collateral Class to voters, and Collateral Onboarding ranked 2nd for total technical resource allocation. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.271763905286633
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#12",
                    "likes": "2",
                    "time": "02/06/2022-14:45:36",
                    "content": "    MakerMan:  RCV isn’t the best choice for signal here.   We broadly agree and that’s why I added in a “shortcomings” section. With that said, any other solution will take development to integrate with our system and we want to be sure we’re on the right track before dedicating expensive resources.     MakerMan:  Give the voter the ability to allocate say 1000 points to the choices. This way I as a voter can choose to allocate as follows to the choices.   We discussed a points based allocation system, but it was rejected for a few reasons:  How should CUs interpret the difference between points? Is 1 point a big difference, 5, 10? In the example you gave you gave several options the same amount of points, how would a CU interpret this? The goal is to help generate feedback on prioritization and saying things are equally important to voters isn’t much of an improvement over the current system where things are voted in with equal weight. Design-wise we would either need to use a 3rd party solution or come up with a custom solution, both of which have drawbacks. @dux-core-unit  has indicated they are willing to add voting methods for us, but this obviously takes away from other priorities. If we can get the same (or better!) level of feedback using already existing systems it will be more efficient to do so.  We very well might pivot to a points based system in a future iteration, but it would likely be based on point outputs from a ranked list. The idea here is to get prioritization feedback, which inherently means placing some deliverables over others. This would allow the data to be useful at both the individual voter and aggregate level. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.648695054945056
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#13",
                    "likes": "4",
                    "time": "02/06/2022-14:53:47",
                    "content": "Gonna combine replies to Sam and Rune to save some space, sorry for spamming the feeds      hexonaut:  In general I don’t think we should be polling at this level of detail.   This is one bit we weren’t sure about, so we desired to make the Technical section specific and the Collateral sentiment more general. Am open to leaning more general, but also want to get some input on this from voters. I think CUs might feel micromanaged by specific categories which is a danger, but this process was designed to get MKR holder feedback so I would defer to voter sentiment if the groups are in conflict on the level of specificity.     rune:  One thing I don’t like about this, though, is that we can’t add additional options here. It would also be useful to have a way to downvote, and signal things that MKR holders are ready to actively block, so as to save core units time from working on something that will not be implemented.   We talked about how to add additional options and that is certainly a difficulty in this system, hopefully the feedback loop of removing less favored/complete items and subbing in new ideas from delegates and Core Units should help. Note the submission form for other stakeholders to make sure new ideas are considered. On the “blocking” front, this is one bit the set up should achieve quite well. Voters should ONLY rank options they want to see considered in a priority framework, so not ranking options is a signal that they should not be prioritized. Combined with the replacement system for new sentiment options, this should keep the list fresh and responsive month to month. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.385078463203463
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#14",
                    "likes": "1",
                    "time": "02/06/2022-17:11:23",
                    "content": "    prose11:  How should CUs interpret the difference between points? Is 1 point a big difference, 5, 10?   I already suggested what totals would look like after the appropriate MKR*points/(total MKR).  Each one of these categories would end up with a % resource prioritization directly decided entirely by governance. If for any reason a number of these happened to get the same prioritization via that method then the point is you take say 5% resources and allocate them to that project.   This isn’t that hard and the signal is very clear here when constructed as I did.    Do you want me to post the math behind how this signal basically gives a clear % CU resource allocation via the point vote?   If a CU has to make a practical choice whether to allocate 10% on one 5% choice and leave another at 0 to make tangible progress I want them to make that choice.   But if the type of poll suggests we do 27% on one, 21% on another then to me IF I am that CU I am going to allocate my FTEs as suggested (25% on one, 20% on another etc. breaking up my resources as governance suggests to achieve the things that were ranked highest in the resource allocation in the time needed using that resource allocation). Tell me what happens if 3 things end up with very close ranked choice vote ranking or so bloody close that there isn’t much distinction if you look carefully at the RCV votes.   Also RCV doesn’t say anything about ‘how’ important something is - just that governance ranks it higher than another.  Does that mean allocate 100% to each RCV choice and complete them in queue fashion or break up the resources?   Who decides which of the RCVs to work on, etc?   Points system at least gives a value with a rank which I believe is critical to business projections and functioning.   No business says do this first, this second, etc.  They allocate resources to the projects based on many factors.     prose11:  Design-wise we would either need to use a 3rd party solution or come up with a custom solution, both of which have drawbacks. @dux-core-unit has indicated they are willing to add voting methods for us, but this obviously takes away from other priorities. If we can get the same (or better!) level of feedback using already existing systems it will be more efficient to do so.   I understand the desire to use the same tools for other purposes, and that some kind of work would need to be done here.   Literally since most formal delegates are known it would be an easy matter to have such a poll on forums and just tally up the numbers (this isn’t hard).  In fact that should be done as a contrast to the RCV method proposed (at least with the formal delegates that communicate) just to see how different the signal would look.  Also there appears to be no way in RCV to actually take into account the MKR being voted as a power factor to the RCV. Polling has never needed to be on-chain and we have been waiting for a long time for any sort of off-chain solution to polling so this could and should be included. Heads up here.  I am going to make a formal post to use a similar point mechanism to give governance better control over budgets, and if governance comes to agree and approve of such a model to propose MIP40 be modified.   We could even use the same point model to come to agree to a long term vision for the DAO. This problem isn’t just related to prioritization but also to how to manage budgets, what is important in vision etc…  Literally the way choices are being constructed now (and not what I anticipated) is the DAO are not allowing for any kinds of weight to be applied to choices (MKR weight, point allocations, etc.)  I am coming to believe one of the primary issues limiting Maker is the limited voting structures that do not allow governance the means to send more informative messages to CUs and the DAO generally. @Rune is talking about voter committees, perhaps another issue to discuss is the voting mechanics in relation to decision making, both short and long term. Look at the choices being given for Growth budget.  The only one that includes a decrease is to ‘reject’ the budget fully.  There is no 95% or 90% or anything.  ‘reject’, ‘abstain’, ‘same’, higher1, higher2. Use the same model on budgets (allocate 2000 points) and we can basically put up a poll on budgets that has 0(0 points), 100%(1000 points), 90% (900 points), 110% (1100 points), 200% (2000 points) and everything in between as valid choices.  0 effectively is a ‘reject’ but also has the potential to signal to ‘off board’. The point here is when looking at certain signals you want to have a magnitude associated, not a RCV or a YES/NO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.358928571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/aburban90",
                    "index": "#15",
                    "likes": "2",
                    "time": "02/06/2022-17:38:21",
                    "content": "    MakerMan:  Give the voter the ability to allocate say 1000 points to the choices.   I like this idea tbh. It’s just like RCV in a way, but gives the voter more granularity in what they prioritize. I forget where, but I’ve voted in some other DAO that used a model like this and liked it. I don’t think this would be much more involved to architect than RCV either. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#16",
                    "likes": "5",
                    "time": "02/06/2022-18:48:46",
                    "content": "@prose11 Thank you! Terrific call today. My anxiety has been reduced by 95% by the discussion and socializing/context for this plan and how we should approach it. @Davidutro also really wonderful job leading us in the vision exercise. It was fun, and personally very encouraging to hear from strong voices in favor of liberty and what we need to be in the face of what’s coming for the world. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.933333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#17",
                    "likes": "2",
                    "time": "02/06/2022-23:09:23",
                    "content": "FYI:  Looks like snapshot actually has the feature I am suggesting (or at least something like it). Thanks to @aburban90 for finding this. Example of using points based voting on snapshot:  Snapshot Point here is that it looks like (I need to see if they document this voting model) snapshot (an off-chain voting system) already has implemented what I am suggesting above. So Maker could kill two birds with one stone simply by adopting snapshot as the polling model, and using the features it provides for all MKR holders removing the bar to participation without having to code up an interface and code the contracts.  Now accessing the voting data (not entirely clear how data insights could connect to the snapshot vote data). ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Hasu",
                    "index": "#18",
                    "likes": "9",
                    "time": "03/06/2022-07:29:22",
                    "content": " In my opinion, this is the opposite direction of where Maker should be going. It seems we agree on the problems: CUs lack input what to work on; the input they get is not consistent over time nor across different CUs. Imo this is entirely expected if you ask a diverse, unmotivated, short-term optimizing, and overwhelmingly unqualified group of people (MKR holders) to micro-manage a project as complex as MakerDAO. Delegation in its current form doesn’t solve the problem either, as delegates don’t follow the same strategy, and some don’t have a strategy at all. Not all delegates vote on all proposals, and some proposals are shoved through by self-interested parties. Further, there is no mechanism by which good delegates rise to the top, and Maker itself actively rewards vanity metrics like vote participation and number of forum posts. In my opinion, the solution to these problems cannot be to add even more MKR holder voting but instead acknowledge that there are only two viable paths for Maker:  Reduce complexity → most of the protocol is ossified/automated, rest of decisions is simple enough to be ratified by token holders Keep or increase the current complexity (our current trajectory) → move away from coin voting in favor of a more efficient + coherent decision making body.  This is what I would describe as the “Efficient Governance Frontier”  image1302×775 40.3 KB  My alternative solution to the one proposed in this thread would be for MKR holders to step away from any micromanagement, and instead elect a board of directors (BoD). This board would only hire and fire mandated actors (MAs), discuss and define a high-level strategy with them, set an overall budget, decide over dividends/M&As etc. It would otherwise leave the day-to-day management to the MAs and their core units. The key motivation here is that specialization and long-term thinking in leadership must be actively encouraged and incentivized. Putting even more responsibility on MKR holders is only going to hurt Maker. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.751488095238095
                },
                {
                    "author_link": "https://forum.makerdao.com/u/0xdeniz",
                    "index": "#19",
                    "likes": "6",
                    "time": "03/06/2022-12:07:46",
                    "content": "I’ve seen Snapshot being mentioned quite a few times over the past few weeks so I wanted to jump in here and provide some context on why we aren’t using Snapshot at Maker. We’ve been looking into gasless voting since February and considered a range of options, including using Snapshot and building upon that framework. Quite early on we concluded that Snapshot would not be a good option for MakerDAO. Let me share the main arguments, some of which are technical and some more fundamental in nature:  Maker’s voting system is complex and unique, compared to other protocol governance systems out there. For example our user’s voting power is determined by aggregating MKR balances over various addresses and contracts. In addition to a users holdings we have a user’s MKR deposited in delegate contracts, in vote proxy contracts, and in on-chain governance contracts (chief). The way that we’re calculating a user’s poll voting weight currently is by aggregating all of these balances in a service called gov-polling-db. There are ways to account for this on Snapshot which we’ve considered (ie. developing a custom ‘strategy’ which is JavaScript function to determine a user’s score), but it would require additional work such as developing a subgraph which would require dedicated efforts for a few development sprints. Users of Snapshot are limited to their selection and implementation of voting systems. Using our bespoke voting system we (or rather, GovAlpha) are in charge of when to introduce which voting system based on today’s needs, and in what form (ie. granularity). We don’t want to rely on a third-party codebase and roadmap for something as critical as poll voting. Using Snapshot would likely exclude institutional voters (through custodians) from participation. Snapshot is less censorship resistant due to reliance on ‘hubs’ which are servers used for various purposes (eg. upload user signed messages to IPFS, store an index of IPFS hashes for all the proposals per tokens and all the votes per proposals on a database to make interface load faster) but could be mitigated by having Maker fork this and run its own hub. Using Snapshot would introduce fragmentation to our voting system as we’d have to deal with various frontends for various purposes.  We have been in touch with people on the Snapshot team though, and we’re excited about their work on Snapshot X which is built on StarkNet. It won’t be live until later this year, and in a very limited form initially (gated access, no support for advanced ‘strategies’ or poll type). Earlier this year we made the decision to build a bespoke system for gasless poll voting instead, and it’s currently in development. In our opinion it is a good tradeoff between lowering user friction & cost, security, and neutrality. Most importantly; it’s fully bespoke to Maker and therefore does not introduce fragmentation or reliance on third-party infrastructure. A bespoke voting system is more costly vs using a framework like Snapshot, but we’ve already paid the cost a long time ago back when Maker’s governance system was designed and built. We might as well get the benefits of a bespoke system now. We can’t wait to get it out there, but please bear with us as the work is not trivial… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.483168147641831
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#20",
                    "likes": "6",
                    "time": "03/06/2022-12:37:59",
                    "content": "    prose11:  We discussed a points based allocation system, but it was rejected for a few reasons:   @MakerMan I’d like to expand on these.  A points-based system makes voting your preferences accurately significantly harder. I cannot quickly and accurately quantify the amount to which I want each of 12 (or even 8, or 5) things in relation to the other 11. I sincerely doubt this is a personal issue. If you’re expected to do this accurately, the complexity is O(n^2). Whereas in a pure ranked input, you can get a lot closer to O(n). A point-based system will devolve to a single-choice system, because the best way to get your way is to put all of your points on the option which you prefer, and not to score the others. This ends up providing less information than a positionally scored system, which I believe is currently the front-runner for implementation. We already have the UI for ranked input so avoiding a points system saves us a little implementation time.      Hasu:  It seems we agree on the problems: CUs lack input what to work on; the input they get is not consistent over time nor across different CUs. Imo this is entirely expected if you ask a diverse, unmotivated, short-term optimizing, and overwhelmingly unqualified group of people (MKR holders) to micro-manage a project as complex as MakerDAO.   Yes and no. The input as it stands is not quantifiable (we don’t know how much MKR wants what), nor is it comparative (we don’t know how much MKR wants x in relation to y). This framework will help to fix both of those issues - though I agree it will not change the fundamental nature of MKR Holders.     Hasu:  My alternative solution to the one proposed in this thread would be for MKR holders to step away from any micromanagement, and instead elect a board of directors (BoD). This board would only hire and fire mandated actors (MAs), discuss and define a high-level strategy with them, set an overall budget, decide over dividends/M&As etc. It would otherwise leave the day-to-day management to the MAs and their core units.   Personally, I don’t see this as mutually exclusive with the proposed prioritization framework, if MakerDAO chose to go that route. I still see value in communicating MKR Holders sentiments (regardless of how ill-informed, short-sighted, etc) they are to the Board of Directors and mandated actors.     Hasu:  The key motivation here is that specialization and long-term thinking in leadership must be actively encouraged and incentivized. Putting even more responsibility on MKR holders is only going to hurt Maker.   I don’t see this as putting responsibility on MKR Holders. The polls are specifically non-binding, meaning the responsibility to determine work priorities remains with Core Units. They are an optional signalling mechanism with which to communicate in a quantifiable and comparitive way, versus the existing signalling that is both informal, non-quantifiable and non-comparitive. Even if this mechanism only provides information in the form of: “x MKR cared enough to vote on this priority poll, and they voted for this”, that is still more information in a more structured form than we’re getting today. If you have information, you can optionally disregard it, but you can’t tie information you don’t have into your decision-making framework. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.701445578231292
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#21",
                    "likes": "3",
                    "time": "03/06/2022-13:07:35",
                    "content": "    0xdeniz:  I’ve seen Snapshot being mentioned quite a few times over the past few weeks so I wanted to jump in here and provide some context on why we aren’t using Snapshot at Maker.   One item I wanted to add to this detailed list is the incompatibility of using any snapshot based system in a continuous voting system. By definition, snapshot votes take voting weight values as a fixed point in time. This means that over the course of a month you would be getting inputs from what the voting were, regardless of any changes in accumulation or delegation since the vote went live.     Hasu:  In my opinion, this is the opposite direction of where Maker should be going.   Always appreciate a good meme  and it makes a very valid point. However, this is a feedback look that is objectively lacking in our protocol. We set up a system where MKR token holders are in charge of the future of the protocol. That can be changed with some of the solutions you mentioned, but it doesn’t change the fundamental issue if we are to make changes to the state of the protocol we need MKR support to do so. Requesting prioritization sentiment from voters at least once a month seems like a low bar to get that conversation going. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.225524475524476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#22",
                    "likes": "3",
                    "time": "03/06/2022-15:19:34",
                    "content": "    Hasu:  My alternative solution to the one proposed in this thread would be for MKR holders to step away from any micromanagement, and instead elect a board of directors (BoD). This board would only hire and fire mandated actors (MAs), discuss and define a high-level strategy with them, set an overall budget, decide over dividends/M&As etc. It would otherwise leave the day-to-day management to the MAs and their core units.   This sounds like the ultimate vision for decentralized voter committees except that they are decentralized (so resilient vs single BoD) and have domain knowledge and content depth focused on single focus objectives. Is that a fair comparison  ? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.969387755102042
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#23",
                    "likes": "1",
                    "time": "03/06/2022-15:28:49",
                    "content": "Complexity is even more reason to outsource it. If Maker is going to be decentralized, it needs to be as simple as possible and outsource everything it reasonabky can to more centralized entities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Traster_Tray",
                    "index": "#24",
                    "likes": "1",
                    "time": "03/06/2022-16:21:56",
                    "content": "I consider the delegate system to basically be the equivalent to a board of directors with unequal power.  MKR holders are essentially already voting in representatives that are supposed to set direction for the protocol and hold CUs accountable.  This prioritization framework simply gives us a clearer picture of what direction our delegates, weighted by decision making power, want the protocol to work towards.  This direction is something many MKR holders themselves often have no grasp of and I’m looking forward to being able to better and more quickly gauge the collective thoughts of delegates without having to parse through every delegate platform. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.666666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#25",
                    "likes": "1",
                    "time": "03/06/2022-16:50:46",
                    "content": "    Hasu:  diverse, unmotivated, short-term optimizing, and overwhelmingly unqualified group of people (MKR holders) to micro-manage a project as complex as MakerDAO.   Subject matter expertise is definitely needed for voting wisely on many key issues ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.444444444444444
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#26",
                    "likes": "8",
                    "time": "04/06/2022-00:20:25",
                    "content": "I agree with @Hasu and others that few MKR holders/community members are well-placed to understand and thoughtfully assess the relative value of different technical resource priorities. I also agree that adding in a points-based allocations system (that the pol-sci major in me really loves) would only make that task more difficult for the average community member, and essentially dilute the value Maker gets from conducting the exercise. However, having delegates complete the exercise each month seems extremely useful. It can be hard to gauge the differences between delegates as to how they envisage the future direction of Maker, particularly when it comes to making tricky trade-offs between development priorities. Having a single thread each month to compare each delegate’s position on priorities might help provide some of the coherence the whole protocol is searching for. In an ideal future state, of course, MKR holders would move their delegations around the delegates whose priorities they prefer most. Also, limiting the exercise to delegates who can be expected to understand the various trade-offs at play provides more scope for more sophisticated systems for displaying preferences (quadratic voting jumps to mind). We could even explore a two-track system for sentiment polling: a more granular system for delegates as set out above, and a much higher-level ‘political’ system like @hexonaut describes for the wider MKR community. There are some issues with doing so, but it would drastically increase accessibility for lay community members. You wouldn’t need to be able to describe the difference between DssSnog and DssGate etc in such a system. Instead, you would just need a view on whether Maker should go “maximum growth/investment” vs “minimise expenses and focus on core product” etc, which is more intuitive. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.790313852813853
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#27",
                    "likes": "4",
                    "time": "06/06/2022-21:40:14",
                    "content": "The first trial of the Prioritization Polls are live! EDIT: Links removed while voting issue is being investigated, sorry for any inconvenience and/or confusion. As a reminder, the voting portal will not display the full sentiment of voters and by default looks for the winner of the IRV set up. GovAlpha will be posting weekly updates on Mondays (intended before the weekly polls go live), which will then be linked on the voting portal text. As a reminder to @Recognized-Delegates and anyone else voting, please rank ONLY the options you support being considered for prioritization. If you do not believe the DAO should be spending resources on a specific item, please do not rank it. As always, feel free to reach out with any questions, comments or concerns. We will be incorporating feedback from last Thursday’s G&R call in the next month’s polls, as well as any lessons and learnings from this first trial. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.252622377622378
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#28",
                    "likes": "4",
                    "time": "07/06/2022-14:54:27",
                    "content": "Hey folks, We were informed of some irregularities with the voting output on the Prioritization Polls, so we have removed them from the UI while the matter is being looked into. We apologize for the inconvenience and will post updates as soon as they are available. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 7.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#29",
                    "likes": "5",
                    "time": "20/06/2022-01:57:42",
                    "content": "@prose11 Is “abstain” a valid vote for both polls? I appreciate the effort here and intentions. I truly have approached the exercise with an open mind. However, I find that I cannot get comfortable that the choices as presented are defined with enough specificity and context to communicate what exactly my views are with respect to each choice. I do not want to send a sentiment signal without knowing how that signal is being interpreted. Some members of the community express the view that Delegates should be setting priorities for the DAO and holding Core Units accountable. However, the issue of who should be responsible for priority setting and holding others accountable is a subject of significant debate and is currently NOT specified as a responsibility of Recognized Delegates. Perhaps it’s the lawyer wiring of my brain, but I look at the list asking me to rank choices and all I can think is… “It depends…”! One of the dependencies is how I should view my role as a Delegate for purposes of answering. Should I cast the ACREinvest vote based on how “Kianga” might like to see the DAO evolve? What if my approach in governance is to evaluate consensus in the community and/or views of specific MKR holders who have delegated to the ACREinvest platform as important inputs? For the technology resource choices, I’ll be honest in saying it would be irresponsible for me at this time to rank them without a significant deep dive, study and lengthy Q&As with our engineers to justify any such prioritization. For the collateral class choices, I don’t know how these options are specifically distinct from one another or where they may overlap. So, if it’s acceptable to opt out of the sentiment polling by voting Abstain that’s what I would like to do. Please advise, thank you! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.296568627450981
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#30",
                    "likes": "1",
                    "time": "20/06/2022-12:14:06",
                    "content": "    ACREinvest:  @prose11 Is “abstain” a valid vote for both polls?   Absolutely! Just like with any vote, you’d wanna explain your reasoning (though I think this post does a god job, so that’s probably already covered).     ACREinvest:  However, the issue of who should be responsible for priority setting and holding others accountable is a subject of significant debate and is currently NOT specified as a responsibility of Recognized Delegates.   The intention here was to get a more direct feedback mechanism from MKR holders. Core Units already do shape the prioritization of the DAO (to some criticism from the community), so these polls were to generate the sentiment of MKR holders as a way to encourage more discourse between holders and CU facilitators.     ACREinvest:  Perhaps it’s the lawyer wiring of my brain, but I look at the list asking me to rank choices and all I can think is… “It depends…”!   I don’t wanna speak for other CUs, but with so many items voted through for investigation and implementation, this feeling is likely shared by Core Unit Members. Definitely open to feedback and hearing other ideas for solving the prioritization problem. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.3601190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#31",
                    "likes": "0",
                    "time": "19/09/2022-18:14:35",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "1179"
}