{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-makerdao-in-5-years/3804",
            "title": "[Discussion] MakerDAO in 5 years ",
            "index": 3804,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "alignment",
                "strategy"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#1",
                    "likes": "6",
                    "time": "25/08/2020-15:41:39",
                    "content": "This post is way to probe the MakerDAO community on what will happen with Maker in the medium term. I assume the medium term as being MakerDAO more or less self-governed with a Foundation less present than currently. I also assume DeFi being way bigger than it is currently with maybe 100M users (1B?), with some only through CeFi (Square, Nexo, …). The overall market cap of all projects (excluding infrastructure) being around 100-1000 billions. BlockFi is a public company with 1000+ employees and 10B of asset under management (AUM), same for Nexo and Aave (the company not the protocol, cf this announcement). In such world, I see 2 possibilities for MakerDAO. The protocol future The first one is focussing around the Maker Protocol and being the minter of DAI. MKR valuation is around DAI minted * natural rate of interest * price earning ratio of the day.  Evolutions are expected to be done by either the foundation, the rest of the ecosystem or through some DAI taken from the surplus buffer. Maker would be the lego brick to mint DAI. It is more or less like today but with more collateral and some fat stability fees that burn MKR. What changes is the environment. Currently, Nexo is the only institution using Maker. Yearn will come soon. We can expect the trend to grow larger and larger. For instance, Yearn has 70% of aDAI in circulation (was more earlier). It’s more than the DAI liquidity on Aave ( ). Big businesses and other protocols will use Maker Protocol as an underlying. Now what can happen when your main clients are big fishs and you are a protocol? My guess is that they take control. If the Maker Protocol is important to them, they will put 10 FTE to work on it. Obviously, they will prioritize their work according to their needs. They will also have more power in lobbying, credit and marketing than any other MKR community member. They also have the financial power to buy/borrow MKR shares as needed. Or fork the whole thing, if it’s too much pain to handle a community. You can look toward Mooniswap that already have a third of the liquidity of Uniswap with a steady adoption (and not even cutting fees, neither having a big marketing budget). Now that feels a bit like SWIFT . It’s an awesome (for the time) protocol that runs the financial world. Now if we compare revenues and profit with Paypal or Stripe, it’s almost insignificant. Another example that I can think of is the Bank of England (in 1800 era where it was having private shareholders and without support/supervision from the state). Bagehot explains how it was an underperforming bank because there was no incentive to perform. The bank directors didn’t care much of the performance it was more of an utility. The Bank of Scotland was more profitable for its shareholders (until the 2009 subprime crisis). Last example is GitHub. I think GitHub earning are not the main driver for Microsoft. What matter is the PR, the marketing and cross-selling. Would you buy a GITHUB token? The business future The alternative is to play the business way and having resources. MIP13c3-SP3: Declaration of Intent - Strategic reserves fund (SRF) is a step towards that (financial resoucres). Another great post by @Mitote earlier this year goes in that direction MakerDao needs a Treasury to provide Compensation to its Workers post foundation (focus on workers for now) (financial + HR resources, a lot of good insight here). Another part is adding RWA which is like having a B2B baking relationship. It doesn’t come cheap on labor at scale. Basically, if you want to compete against 1000+ employees you need to have the same size. Having a DAO governing at this scale would be a first, a challenge that the Maker community can probably accomplish. The way forward While I’m sure that the protocol way isn’t profitable for MKR holders (but I would love to see convincing arguments), there is most likely a continuum of futures between the protocol one and the business one. And getting there (whatever that there is) will demand some kind of path as well. Therefore, I would love to know what is on your mind regarding this subject. What MakerDAO should look like in 5 years for you (using the context provided in preambule or providing your own) and how to get there if you have an idea. You can be creative obviously (  it’s uncharted territory!) or more inspired by existing DAO / theoretical frameworks. It seems important to have a consensus on where we are going to get there right? . Edit: Linking to Long Term Vision for Maker which is similar but more open. Feel free to contribute in any thread. ",
                    "links": [
                        "https://forum.makerdao.com/t/mip10c9-sp6-whitelist-yearn-finance-on-ethusd-oracle/3773",
                        "https://etherscan.io/token/0xfC1E690f61EFd961294b3e1Ce3313fBD8aa4f85d#balances",
                        "https://en.wikipedia.org/wiki/Society_for_Worldwide_Interbank_Financial_Telecommunication",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765/1",
                        "https://forum.makerdao.com/t/makerdao-needs-a-treasury-to-provide-compensation-to-its-workers-post-foundation-focus-on-workers-for-now/1091",
                        "https://forum.makerdao.com/t/adding-real-world-assets-rwa-as-dai-collateral-is-a-critical-step-for-maker-to-stabilize-the-peg-and-in-doing-so-we-change-the-world/3653",
                        "https://forum.makerdao.com/t/long-term-vision-for-maker/3969",
                        "https://forum.makerdao.com/t/long-term-vision-for-maker/3969",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-109-thursday-september-10-16-00-utc/3971/5",
                        "https://forum.makerdao.com/t/maker-relay-ep-10/3907",
                        "https://forum.makerdao.com/t/discussion-legal-structures-of-makerdao/4390/6",
                        "https://forum.makerdao.com/t/mip13c3-sp3-declaration-of-intent-strategic-reserves-fund-srf/3765/11",
                        "https://forum.makerdao.com/t/strategic-direction-integration-with-defi-or-protocol-base-layer/5646/2",
                        "https://forum.makerdao.com/t/brainstorm-2021-mission-and-objectives/5809",
                        "https://forum.makerdao.com/t/project-compass-conceptual-framework/8845"
                    ],
                    "GPT-summary": "The author of the post is seeking feedback and opinions from the MakerDAO community on the future of the protocol in the next five years. The post discusses two possibilities for the future of MakerDAO, one being the protocol future and the other being the business future. The author invites the community to share their thoughts and ideas on what MakerDAO should look like in the future and how to get there.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.814496684749849
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#2",
                    "likes": "5",
                    "time": "25/08/2020-16:33:52",
                    "content": "Part of the reason why the RWA angle is so compelling is specifically because MKR does NOT have to govern or manage that staff. Rather, it would rely on known reporting requirements and allow MKR governance pull the levers as needed. The LendCo in that construct would then have to meet those requirements or be liquidated. LendCo could have 10 BorrowCos or 10,000. The rolled-up reporting would be the same to MKR governance. MKR governance would need Maker Representatives to review and attest to the reporting and being in compliance, but with no question the scale is there. It is for the above reason why I believe RWA are an essential critical path for the ecosystem as a whole. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#3",
                    "likes": "12",
                    "time": "25/08/2020-17:36:59",
                    "content": "In 5 years the local restaurant in my hood will have access to a low interest rate Loan via a smartphone App. Will the restaurateur fully understand, or know that the Loan is coming from MakerDAO? No, and they probably won’t care to know–99% of the Worlds population could care less about the technical architecture of the internet. In 5 years there will be “apps” from folks such as Dharma, Linen, etc., build on top of Compound–who will be dependent of DAI & MakerDAO. It’s only a matter of time folks–don’t let the TVL Marines pull-the-wool over your eyes. Keep your focus on the prize–in 5 years, the only regret you’re going to have, is that you wasted too much ETH on chasing Yield Farming and Gas fees–while you made PoW miners more profitable–when you could have used that same ETH to accumulated a lot more MKR. Think about that. Enough said. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party extending to proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party or author is advertising proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#4",
                    "likes": "4",
                    "time": "25/08/2020-18:58:23",
                    "content": "Thank you @SebVentures for the very interesting post. One of your main points/questions, which I feel is at heart of the value proposition of MKR is:  Or fork the whole thing, if it’s too much pain to handle a community.  Now, this is just one sentence from your elaborated post, but I think it’s key to discuss this in depth. Me: I am of the opinion that the main value of DAI (i.e., the product of MakerDAO) is that it is a decentralised stable-coin. This means that:  it is a stablecoin backed by assets (like Libra was supposed to be) no matter who you are and how you got your DAI, those DAI have value because they are accepted by a smart contract (no humans).  Opponent: but the governance can change the smart contract and blacklist some wallets/DAI ! Me: True. This is why MakerDAO is decentralised (and therefore imho has value) only as long as the Governance is dispersed (not dominated by big single entities) for two reasons:  big single entities could be bully and blacklist some users more seriously, they could be forced to do so, after Governments pressure.  Note that Libra has been postponed/cancelled due to regulation difficulties. Opponent: Ok, fair enough. But will MakerDAO’s governance become or remain(?) decentralised? Me: I claim that it will because this is the game-theoretic incentive. Let me ask you a question. Why do you think Rune and the other founders decided to create a DAO? Instead of having their own project that they could govern in the best way possible? Opponent: uh? Because they are crypto anarchists? Me: I don’t know about that… But I think the DAO, and the corresponding MKR token, offered the founders the following PROs/CONSs: CONS 1: they have to deal with random people in the chats. CONS 2: they need to spend time to explain obvious stuff to uneducated people. CONS 3: when it’s time to act, sometime they need to fight with governance forces that don’t see clearly the big picture. PRO 1: they got money selling MKR, so they could finance the development of the project and also gain some good money for themselves. PRO 2: Crucially, they have declined to a large extent legal responsibilities. Formally, MakerDAO is run by MKR holders, whoever they are, and it’s a distributed protocol hard to regulate (currently) and purely based on smart contracts. PRO 3: Effectively, they keep control anyway through the foundation and can steer the development/strategic strategies (more or less) where  they want. Opponent: I see… clearly the PROs where greater than the CONs. OK. But your point PRO3 seems a negative one! It looks like MakerDAO is quite centralised now, if it is run by the Foundation ! Me: Yes, currently it’s still very centralised, obviously: just note that most voting processes hardly get to 50 single voters… But, for the legal troubles they could get when Maker becomes much bigger, they plan to dissolve the Foundation. Again, the point is that they NEED to do this, as opposed to WANT, to avoid legal troubles in the coming future. This is the underlying ‘game theoretic incentive’ I mentioned earlier. Opponent: Mmm, ok. But many of the points of SebVentures make a lot of sense. Me. Absolutely! With this discussion I wanted simply to say that I don’t believe (as suggested by @SebVentures) we will see in the near future a centralised (or owned by a few players) MakerDAO, nor a centralised fork. Or rather, maybe we’ll see some forms of them (forks will surely appear) but the winning product will be the most decentralised one. Opponent. Ok, I got your point of view, thanks. Me. You are welcome. But I hope the great post of @SebVentures gets more answers, as the value proposition of MKR is still very unclear to me, and I’d love to hear more thoughts. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.949464285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#5",
                    "likes": "5",
                    "time": "25/08/2020-19:13:55",
                    "content": "Perhaps my vision is simple but increase dai minting will enable encrease mkr burning which will increase mkr price, this discounting opex & safety net. As per other protocols controlling maker applies the same logic, if they can control maker they have to purchase it which will imply an increase in value, they could collude with other protocols to agree but then centralization risks emerge and in comes the prior arguments stated here. As per were I see maker in five years I see RWA applied, perhaps credit card incorporations were one party assumes the credit risk and operates as a middle man between the final customer and mkr, I see synthetic assets offered by maker as well, integration of dai in business, invoice factoring being the first stage, I see scaled centralized domain teams with descentralized decision making fast tracked through delegated voting mechanism. Also I’d love to see how oracle revenues start increasing and offer other lines of revenue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.239583333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#6",
                    "likes": "1",
                    "time": "25/08/2020-21:13:10",
                    "content": "Thanks @iammeeoh I really like your regulatory approach as it makes a lot of sense (and it is most convincing).  I would argue that the government can force business NOT to use any protocol that is on top of Maker. Then, a bit later you will have MakerDAO clones from US banks under regulation.  In fact, any bank can do that already since the OCC letter. You can get a loan for ETH like you can get margin on stocks. So you would get USDC or PAX instead of DAI but what’s the issue? They are better at keeping the peg due to the redeemability. Just wait to get the US government to insure USDC loss. Now, we will not like it, it’s not DeFi. But for the average customer, it’s just a better value proposition. It can live at the fringe of the crypto world. But is that market size then? Didn’t think about that before, but it seems to make sense anyhow.  Even keeping it in DeFi, you still need to fight for market share versus opponents. Suppose META taking the Maker smart contract to mint mUSD and provide some yield farming. Now Maker as a great first mover advantage in the space. But I keep being amazed at the traction in Synthetic sUSD. YFI show us that a $400M can pop very quickly.  Is the Maker moat strong enough to allow only small expenses? Maybe but it’s risky. Okay, I’m not convinced by myself. We should ask a Synthetic, META or Reserve founder if they really think they can be a major player.     mario:  I see scaled centralized domain teams with decentralized decision making fast tracked through delegated voting mechanism   That’s the idea, I’m 100% on board. How to get there and how to structure it that is more complex. Also what is the expected size of those domain teams? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.097080003330003
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#7",
                    "likes": "7",
                    "time": "28/08/2020-00:34:28",
                    "content": "In five years I will be able to use my reputation as collateral. My hefty bags of sourcecred DAI will be staked to back synthetic assets. I will have refinanced my third house through the protocol at a fraction of the traditional market rate. But most importantly, I will have won my third straight wet T-shirt contest at MakerCON ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.833333333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#8",
                    "likes": "0",
                    "time": "09/09/2020-20:15:38",
                    "content": "Just 15 days after the initial post, SushiSwap is taking over Uniswap. Swaps are better there than Uniswap. And SushiSwap is now under direct influence of FTX/Alemada/Solana. The ink is still not dry on this story, but the facts are there. Value accretive activities seems to concentrate under the hand of the biggest players. Let’s see how that play out in the next years. It’s a go big or go home play. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 5.527777777777779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#9",
                    "likes": "3",
                    "time": "09/09/2020-21:18:06",
                    "content": "I’m more curious to see what happens once rewards dry up and if Sushi can innovate other than forking uniswap tech and adding farming/LP incentives. That will be the true test. It’s easy to imitate, much harder to innovate. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.636904761904762
                }
            ]
        }
    ]
}