{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/centrifuge-maker-a-partner-s-view-of-real-world-assets/17439",
            "title": "Centrifuge & Maker: A Partner\\xe2\\x80\\x99s View of Real-World Assets ",
            "index": 17439,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "real-world-finance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#1",
                    "likes": "26",
                    "time": "25/08/2022-14:24:40",
                    "content": " 624x3511600×900 90.6 KB   Centrifuge & Maker: A Partner’s View of Real-World Assets  TL;DR Real-World Assets are the asset class of the future for DeFi, and Dai can serve a leading role in bringing this asset class to life. The Centrifuge-Maker partnership has been remarkably successful so far, but there is so much more potential in what can be achieved together. As our working relationship enters its third year this November, we want to reiterate the case for real-world assets and how Centrifuge and MakerDAO can continue to push this forward.  The Story So Far The history of Real-World Assets in DeFi is the story of MakerDAO. As far back as Maker has been an idea, real-world assets (RWA) and their use cases have been a priority for the community and core team. Since the launch of multi-collateral Dai, various RWA initiatives have been championed and executed upon, with Centrifuge serving as the first protocol to bring real-world assets on-chain. We worked on the first proof of concepts, based on the original Single Collateral Dai, together with New Silver back in 2019. From the very beginning, our focus at Centrifuge has always been on leveraging decentralized infrastructure to create accessible credit for all - and MakerDAO has proven to be a mission aligned partner on that journey. However, real-world assets in DeFi aren’t easy. There are numerous design challenges, countless risks, and unknown unknowns. Ultimately, a delicate balance must be established between novel cutting-edge technology and the legacy traditional financial systems we are required to interface with. Lately, RWA has been top of mind for the DAO and a continuous conversation topic in the community. As far as we’ve come, there is clearly significant work to be done to establish a scalable path for financing RWAs within Maker. In the heart of the bear market, we believe we are at a critical juncture for these opportunities to make strides and to build towards the future. There has never been a better opportunity to pursue the vision of Dai backed by real-world asset collateral.  The Crypto Challenge The DeFi industry is a roller-coaster of adventure. The core activities of today’s crypto market do not have stable and predictable supply and demand streams as seen in conventional markets. In addition, the regulatory uncertainty associated with decentralized products creates a constant fear of displacement. As such, DeFi has routinely defaulted to its comfort zone – native crypto assets – to build a business upon. This creates a perpetual circular dependency in which crypto volatility is the key determinant of lending activity. Last year, this developed into an echo chamber of unsustainable yield that reached incredible heights, before a spectacular collapse which saw default contagion spread to nearly every corner of the ecosystem. While crypto-native assets are a critical component of DeFi and a long-term value differentiator, there is a critical link missing to secular and long-term demand drivers. In the face of this volatility, Maker’s opportunities for growth are minimized, and the only focus can be on survival and endurance - just as it’s survived through many crypto winters before.  1600×510 97.7 KB  This is not sustainable. This does not create value. This will not help DeFi, or Dai, reach impactful success.  1600×451 73.9 KB  DeFi needs a baselayer level of collateral that is attached to more secular supply and demand; RWAs are one step towards this reality and can bring:  Greater levels of transparency of market risk and asset usage Superior composability as a financial primitive Improved accessibility for the underbanked and underfunded Increased revenue opportunities from a larger and more stable addressable market   Reconnecting with Why The conversation occurring around RWA has centered on issues that have been present since some of the very first discussions in the Maker community. Maker has always had an aspiration to focus on real-world value; funding real businesses or providing Dai to individual people. It’s important now to reiterate how we think about real-world assets in the first place and why we believe in the opportunity they bring. Real-World Assets are a specific reference to an ownable item, usually in the physical off-chain world, from which the owner can derive an expected dollar-denominated value. Codified by the legal system and embedded in our civilizations’ social contract, traditional finance offers levers to transform these assets into opportunities for wealth creation or to facilitate economic business activity at scale. Rather than individual loans, these are most commonly packaged together into asset-backed securities and offered as structured debt securitizations. Through these instruments, a broad array of lenders can invest along the risk curve and provide liquidity to previously illiquid assets. For crypto, RWA represents an opportunity for crypto capital to directly fund value-add real-world activity. Protocols like Centrifuge offer the ability to bring these assets into on-chain securities structures, tailored towards the investment of protocols like Maker. This allows us to leverage the transparency and credibility offered by a blockchain, while maintaining the necessary integrations into the real-world that provide the linkage between the on-chain and off-chain representations.  |624x249.655788770053421600×641 41.3 KB   The Case for Real-World Assets RWA helps Dai in two critical areas: Stability and volume. We’ve written about this before, but fundamentally, Dai can best scale its usage and maintain its peg by issuing against non-correlated, yield bearing, and reliable assets. Especially in today’s context, with crypto-native yields at all time lows, the opportunity for RWA-based yield couldn’t be more appealing. Maker can continue to scale and grow, through the bear market, and be perfectly poised for the next bull cycle. The case for real-world assets bringing stability to DeFi continues to become clearer, as real-world asset growth has outpaced DeFi growth in both bull and bear markets.  1600×900 128 KB  Most importantly, RWAs help serve a dream that is bigger than just Maker: Allowing credibly neutral, decentralized rails to add significant utility to the needs of everyday people and businesses. Real-world assets are the critical use case in bringing crypto to the world and the world to crypto. While the risks are significant and real, especially considering the recent regulatory environment, we believe strongly that these risks can be overcome by an approach that utilizes a long-term strategic vision, rigorous governance structure, healthy diversified portfolio, effective asset management, and high-quality partners.  Our Vision for the Future Crypto is a story of builders, and RWA is no different. There is no shortage of arguments claiming it’s not yet possible to effectively combine the “real” and “decentralized” worlds. We believe differently and have always faced this monumental task with a long-term mindset and a focused approach. We are building an open, community-driven decentralized protocol with a vision to bring the entire world of credit on-chain. We believe this is the best way to facilitate the financing of trillions of dollars worth of assets, in a programmatic manner, and principally enabled by decentralized infrastructure. Our platform of on-chain assets and native DeFi integrations helps to unlock a new world of capital markets by leveraging the transparency and efficiency of blockchain networks. Within Maker, we have rebuilt our legal structure from the ground up. Collaborating closely with the DAO, we have provided a scalable and reusable framework that fully serves and protects the concerns of the Maker community, while maintaining legal recognition of our assets. The community has recently seen MIP6 collateral applications from our latest issuers, Blocktower and RFA Bank, both long-term focused deal partners who believe in building alongside Maker as an arranger partner. Together, this represents a critical next-step in our journey - of becoming an institutional-grade protocol of the highest-quality. Using Centrifuge, Maker should be able to work with professional partners, a broad and diversified set of collateral, with true guarantees (i.e.legal recourse to the underlying assets), combined with maximum on-chain transparency. While the market has turned bearish and sentiment is low, we are heads down focused on our roadmap and executing on our mission. We are building a protocol to support the entire world of credit coming on-chain. And we believe Maker plays a significant role in that future. Together, we believe we can scale to 1B Dai through Centrifuge by the end of 2023.  Forging Ahead, Together  624x3051600×785 98.4 KB  The Maker community is at an inflection point for Real-World Assets. The immense amount of collective knowledge created within the Maker community cannot be overlooked: from mistakes and lessons learned, to best practices and improved standards, to critical insights into how to execute RWA at scale. The discourse around governance, the debate about operational and organizational structures, and the ever-present tension between crypto ethos and the current limitations of the real-world has shown Maker’s values - above all else, the Maker community will take a principled approach in engaging with real-world assets. The core values behind Dai, as a decentralized, credibly-neutral, and reliable stablecoin, should not be violated for the sake of any one deal or for lack of coherent strategy. Centrifuge agrees fully, and is here for the long-term to build alongside Maker in support of this ethos, and will continue to do so in whatever capacity the community desires. We strongly believe that with the challenges that stand before us - this is our moment to build together and define the future of DeFi.  Focus On Centrifuge On September 7th, SES will host a “Focus on Centrifuge” event where we will share our protocol’s perspective on the future of real-world assets. We’ll share our fundamental beliefs and the core principles that drive our products and platform. Our partners will show how they plan on using the Centrifuge platform and working with Maker to drive success. Please attend, please bring your questions, and please join us as we build towards a brighter and better future! @Khan Protocol Partnerships at Centrifuge @spin @ctcunning @Thespacecatjr @elidco @cass ",
                    "links": [
                        "https://medium.com/@MakerDAO/stablecoins-use-cases-44e696ba8633",
                        "https://forum.makerdao.com/t/using-tranches-to-insure-against-defaults-of-real-world-assets-and-providing-an-extremely-stable-asset/1286",
                        "https://www.reddit.com/r/MakerDAO/comments/7bgn8c/how_is_dai_decentralized_if_it_is_backed_mostly/",
                        "https://medium.com/centrifuge/defi-and-the-real-world-a-trust-issue-46f105eebe92",
                        "https://forum.makerdao.com/t/what-is-a-trust-indenture-what-is-an-indenture-trustee/14697",
                        "https://forum.makerdao.com/t/centrifuge-update-cornerstone-agreement-complete-to-onboard-rwas-to-maker-with-centrifuge-successful-collaboration-with-incubating-lts/15005",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-25-31-de-agosto-del-2022/17644",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/14",
                        "https://forum.makerdao.com/t/endgame-plan-timeline-to-free-floating-dai/17529/8",
                        "https://forum.makerdao.com/t/focus-on-13-centrifuge-q3-update/17626"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.879395318733555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#2",
                    "likes": "0",
                    "time": "25/08/2022-15:16:53",
                    "content": "    Khan:  Improved accessibility to the underbanked and underfunded   I have always doubted whether there will be a possibility that a medium-small investor let’s talk no more than (100k DAI) can request financing and he does not pay his loan term, in that case he would speak with the regulatory administration of the country where are you located? I strongly support RWA and have always thought that the opportunity to grow organically for DAI capital is by supporting small or medium investors from developing countries who want to start a business and are fighting inflammation, the only fear that enters me In my case, that loan does not get paid to the Maker protocol, how would we solve it? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.183333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Khan",
                    "index": "#3",
                    "likes": "2",
                    "time": "25/08/2022-17:31:30",
                    "content": "    Moi:  the only fear that enters me In my case, that loan does not get paid to the Maker protocol, how would we solve it?   The key here is structure and credit enhancement. Today, Maker’s investment in Tinlake Pools always occurs at the senior level, meaning there is a level of junior capital that protects the senior investment. In the event of a loan default, the junior capital investors are first to take on losses, and so the senior position is only impacted when this junior position has been exhausted. This is exactly the same principle as the overcollateralization ratios Maker vaults use. To really enable small businesses, Maker will need to keep moving towards a model that enables Arrangers and successfully establishes an economy of scale for Dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4
                },
                {
                    "author_link": "https://forum.makerdao.com/u/elidco",
                    "index": "#4",
                    "likes": "2",
                    "time": "25/08/2022-22:28:31",
                    "content": "    Moi:  the only fear that enters me In my case, that loan does not get paid to the Maker protocol, how would we solve it?   We are also working with the Maker community as noted above by Asad (see here and here and here) on a legal structure based on trust law concepts which will ensure that if the loan does not get repaid, there is a trustee already appointed in advance whose role it would be to ensure that the RWAs are sold and the proceeds of the sale are provided back to Maker. This is what it means to hold an asset-backed security. The risk for Maker is transparent – it is based solely on the value of the RWA without risk of being rugged or cheated. The trustee process is automatic and Maker would not need to sue or make any claim in a court of law. ",
                    "links": [
                        "https://forum.makerdao.com/t/what-is-a-trust-indenture-what-is-an-indenture-trustee/14697",
                        "https://forum.makerdao.com/t/progress-update-on-the-legal-structure-for-centrifuge-rwa-vaults/13307"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                }
            ]
        }
    ]
}