{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/how-to-boost-dais-liquidity-g-uni-usdp-dai-fei-dai/17327",
            "title": "How to boost DAI's liquidity? - G-UNI USDP/DAI FEI/DAI ",
            "index": 17327,
            "category": [
                "Governance",
                "Proposal Ideas"
            ],
            "tags": [
                "g-univ3"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#1",
                    "likes": "2",
                    "time": "18/08/2022-16:19:37",
                    "content": "DAI is the second most liquid cryptocurrency in Uniswap, this great success story is mainly due to the USDC/DAI group driven since the creation of pairs by “Arrakis Finance”. This allowed to increase the existing DAI liquidity not only through Uniswap but also from the MakerDAO protocol itself, allowing us to surpass the 7B barrier again.  We know that currently the MakerDAO protocol is in discussions to move away from centralized guarantees, I am one of the first to raise my voice against the problems of centralization. But we are in a crucial stage to be well positioned to face the next bull run in the crypto market, we know that one of the first problems of DAI is its liquidity, what do I do with my DAI? we can increase the use cases of DAI and its % of participation in the chain. I propose to integrate liquidity groups such as G-UNIV3 DAI/FEI and USDP/DAI (G-UNIV3 BUSD/DAI is already under discussion). This will increase the liquidity of the DAI by allowing for increased issuance and blocking in UNISWAP, as well as increasing the uses of the DAI.  image1224×416 29 KB  As an example and possible success story, currently the only use case for USDP in the PSM. In Liquidity it does not even reach 0.01% of what is in the SMP, how can you generate those arbitrage opportunities that allow you to generate interest in opening positions as it exists with USDC/DAI? Easily by generating that initial push through the inclusion of G-UNIv3 groups for DAI. This is part of an idea to add them as collateral, but by recommendation before the signal request @prose11  recommended me to first get feedback from you the forum community and study how we could approach this. ",
                    "links": [],
                    "GPT-summary": "The author proposes to integrate liquidity groups such as G-UNIV3 DAI/FEI and USDP/DAI to increase the liquidity of DAI and its use cases. The author acknowledges the need for feedback from the forum community and seeks to study how to approach this before adding them as collateral. A 3rd party could give constructive criticism, extend to the proposal, or ask questions about it.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.7785087719298245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/RoFz",
                    "index": "#2",
                    "likes": "0",
                    "time": "20/08/2022-14:47:42",
                    "content": "Juyst want to point out that FEI is shutting down:  twitter.com    Ignas | DeFi Research @DefiIgnas  1/ $FEI Protocol is shutting down.  At $188M market cap, it's one of the largest #DeFi stablecoins.  Yet, it's closing down.  Why? 🧵   1:03 AM - 20 Aug 2022           700                260            And by the other hand, do we still want to expose to USDC and other stables at this point? Don’t think so … ",
                    "links": [
                        "https://twitter.com/DefiIgnas/status/1560794521977626624",
                        "https://twitter.com/DefiIgnas/status/1560794521977626624",
                        "https://twitter.com/search?q=%23DeFi",
                        "https://twitter.com/DefiIgnas/status/1560794521977626624"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.283333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MadShills",
                    "index": "#3",
                    "likes": "1",
                    "time": "22/08/2022-00:03:16",
                    "content": "There was already a proposal to onboard FEI which was definitively voted down.    [FEI] MIP6 Collateral Onboarding Application   While filled as a MIP6, this proposal can be seen (and converted) to a D3M (or even a PSM). It is suggested to have a good overcollateralization, meaning that the only use case for this vault will be Tribe Protocol to put FEI as collateral to mint DAI. The Tribe DAO will use this loan to finance its balance sheet and provide a better peg for its users.   The proposal wanted to use Maker as a credit facility without requiring TribeDAO to bring their underlying Eth collateral. We can imagine how unfortunate that could have ended up. It seems reasonable for FEI to unwind while it is still ahead. Unfortunately, the project has suffered recurring setbacks since launch. ",
                    "links": [
                        "https://forum.makerdao.com/t/fei-mip6-collateral-onboarding-application/14895/1"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.402777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#4",
                    "likes": "0",
                    "time": "22/08/2022-16:43:50",
                    "content": "The main mistake is to believe that this only focuses on FEI, in fact I made the example with USDP because it makes more sense for the PSM that this is the first approach, don’t you think so? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 6.145833333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#5",
                    "likes": "4",
                    "time": "22/08/2022-16:58:19",
                    "content": "When you create a GUNI3 vault what you’re banking on is that there is some tx fees the generates a yield which we can multiply by enabling leverage. The windup/unwind process of acquiring this leverage requires that there is liquidity for the other asset available w/ reasonable slippage. In the case of GUNI3-DAI-USDC we have the PSM which gives 1:1 conversion and so allows leverage to be wound and unwound with no slippage. With USDP and BUSD I see two problems.  There is no sizeable liquidity pool to support any kind of significant leverage without massive slippage The LP fees are so low that even with maximum leverage the yield is still garbage. Now try to pump 15M of Dai liquidity into this and you’re looking at garbage^2 yield.  Without the yield you won’t see any Dai generation stimulated by onboarding these pairs. There’s really no point to onboarding any of this. It would be a massive waste of developer resources and Oracle costs that could better be spent elsewhere. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.596153846153847
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#6",
                    "likes": "0",
                    "time": "30/08/2022-02:39:23",
                    "content": "Okay, but I see it more in the case of BUSD perhaps, currently the protocol has the USDP SMP, imagine arbitrage opportunities that are generated with those trading pairs. In addition to the interest to be LP for the same rates that you can find for the same. Maybe the other currencies do not look competitive for this collateral idea, but you are leaving out the PSM with USDP. There are more than 500 million that are there. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.982142857142857
                }
            ]
        }
    ]
}