{
    "poll_list": [
        {
            "title": "MIP10c15-SP2 Governance Poll to Appoint Infura as Oracle Light Feed - June 15, 2020",
            "index": "2660",
            "option": "Yes",
            "supporting_mkr": "7,966",
            "highest_fraction": 1.0
        },
        {
            "title": "MIP10c15-SP3 Governance Poll to Appoint Etherscan as Oracle Light Feed - June 15, 2020",
            "index": "2798",
            "option": "Yes",
            "supporting_mkr": "7,636",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c14-sp2-proposal-appoint-infura-as-light-feed/2660",
            "title": "MIP10c14-SP2 Proposal: Appoint Infura as Light Feed ",
            "index": 2660,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-lightfeed-sp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/wuehler",
                    "index": "#1",
                    "likes": "3",
                    "time": "28/05/2020-19:46:04",
                    "content": "Please consider Infura as a Light Feed Oracle stakeholder. Please feel free to contact me should you require any further information.  MIP10c14: Subproposal to Appoint Light Feed  Preamble MIP10c14-SP2 Author(s): Michael Wuehler Contributors: Status: Formal Submission Date Proposed: 2020-05-28 Date Ratified: <yyyy-mm-dd>   Disclaimer MIP10 is meant to handle all of the Oracle related actions. Unfortunately MIP10 has inconsistencies and doesn’t conform to the monthly governance cadence that the Maker Improvement Proposal framework is built around. This has generated a backlog of Oracle proposals. While MIP10 is refactored to conform to the regular MIP process, Oracle proposals such as this one will utilize the more liberal weekly governance cycle. While strictly speaking this makes them not subproposals, they are included in the subproposal archive as a point of provenance to serve as a paper trail.  Specification  Organization  Name: Infura Website: https://infura.io  Github: Infura · GitHub  Number of Employees: 26 Email: [email protected]  Incorporated: Switzerland Domiciled: Switzerland When was the organization founded? 2014 Who are the major investors in your organization? Infura is a wholly owned operating unit of ConsenSys AG. How much funding has the organization raised either privately or through a token sale? ConsenSys AG is privately funded. Please provide public references for the above where possible. Not Available.   Introduction  Motivation for running a Light Feed  Infura has been an infrastructure provider for Ethereum API access for 4 years. We are a well funded team with experienced DevOps engineers delivering reliable, always-on access to Ethereum. We are excited at the process Maker is taking at decentralizing what has become a systemically critical piece of the Web3 ecosystem, we want to contribute to this mission and have the skills and reputation to do so.  Community  What has your organization contributed to the crypto community?  We are close partners with the client development teams and regularly provide feedback and contribute code based on our findings running nodes at scale. In addition, we have made several grants over the years to projects focused on improving the capabilities and efficiency of running node infrastructure. These include TurboGeth and VIPNode. We are extremely active in the conferences and Devcon, both in financially supporting them as well as participating in them.  Successful products, services, tools, libraries, thought-leadership  Infura has always been a free service for developers to get an easy entry into Ethereum development. We also have Infura+, a premium offering for projects as they mature and get to the stage of depending on their infrastructure in production. In addition, we have supported IPFS for 4 years and have a premium IPFS product set to launch this year. We have built and open-sourced the Versus tool that allows anyone to compare performance of RPC endpoints.  How will the Maker Community benefit from your inclusion as a Light Feed?  Infura will be a trusted addition to the existing oracle light feed providers. Our reputation will add to the already robust group of stakeholders.  Changelog  reformatted preamb le added disclaimer  ",
                    "links": [
                        "https://github.com/infura",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-11-9am-pst-4-00-pm-utc/2742/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Identity and reputation systems",
                        "Not a proposal",
                        "None"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.695075757575758
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#2",
                    "likes": "2",
                    "time": "28/05/2020-23:07:12",
                    "content": "Thanks for submitting your application Michael. Just FYI I edited your post to include the preamble header. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#3",
                    "likes": "2",
                    "time": "30/05/2020-05:57:38",
                    "content": "MIP10c15: Subproposal to Appoint Feed (OT) Preamble MIP10c15-SP2: Author(s): Niklas Kunkel Contributors: Status: Formal Submission Date Proposed: 2020-05-29 Date Ratified: <yyyy-mm-dd>  Disclaimer MIP10 is meant to handle all of the Oracle related actions. Unfortunately MIP10 has inconsistencies and doesn’t conform to the monthly governance cadence that the Maker Improvement Proposal framework is built around. This has generated a backlog of Oracle proposals. While MIP10 is refactored to conform to the regular MIP process, Oracle proposals such as this one will utilize the more liberal weekly governance cycle. While strictly speaking this makes them not subproposals, they are included in the subproposal archive as a point of provenance to serve as a paper trail. Specification Introduction If ratified, this subproposal would appoint Infura as a Light Feed. Feeds submit data to the Oracles for the prices of assets. They are an important part of ensuring that the Oracles are reliable and secure. Only entities with strong credentials that the community trusts should be permitted to be an Oracle Feed. Organization The following information was provided by Infura in their MIP10c14 application and verified by the Oracle Team to the best of its ability.   Name: Infura Website: https://infura.io  Github: https://github.com/infura  Email: [email protected]  Incorporated: Switzerland Domiciled: Switzerland Number of employees: 26 When was the organization founded? 2014 Who are the major investors in your organization? -Infura is a wholly owned operating unit of ConsenSys AG. How much funding has the organization raised either privately or through a token sale? ConsenSys AG is privately funded. Please provide public references for the above where possible. Not Available.   Light Feeds Reputation  Does the organization have a strong reputation in the crypto community?  Infura has been the bedrock of supplying connectivity to the Ethereum blockchain for tens of millions of cryptocurrency users. Serving as the networking layer for every day applications like MetaMask and many of the top dapps including the Maker Foundation, it’s no secret that Infura is a critical part of the Ethereum ecosystem and rightfully carries a reputation of reliability and ecosystem stalwart. Being a part of the Consensys brand which is responsible for shepherding Ethereum into enterprise partnership after enterprise partnership just further reinforces the credible forces behind Infura.  What contributions has this organization made to the crypto ecosystem?  Infura is close partners with the client development teams and regularly provides feedback and contributes code based on its findings running nodes at scale. In addition, Infura has made several grants over the years to projects focused on improving the capabilities and efficiency of running node infrastructure. These include TurboGeth and VIPNode. Infurai is extremely active in conferences, including Devcon, both in financially supporting them as well as participating in them.  Would including the organization as a Light Feed instill a sense of trust in the Oracles?  As noted above, the Oracle Team believes that Infura has a trustworthy reputation in the community and would further reinforce the reputation of the Maker Oracles.  Are there any public accusations of misconduct? How severe and numerous are they? Have they been confirmed?  The Oracle Team was not able to find any record of confirmed cases of misconduct on account of the organization nor its executive staff. Verification  Were sufficient public-facing resources provided or found that confirm the information in the application?  Yes, public records were able to verify most of the provided information.   Was the applicant honest with respect to:   the investors   Infura was acquired by Consensys on 10/04/19. The Oracle Team was able to find a public announcement of an investment of $10 million USD by SK Group on 07/02/19 into Infura’s parent company Consensys.  how much funding was raised  Outside of the $10 million USD investment by SK Group into Consensys, the Oracle Team was unable to identify any other public announcements of funding by neither Infura nor Consensys.  the number of employees  The Oracle Team was able to verify through its network that the number of employees claimed by Infura in their application is highly likely to be correct.  the location of incorporation & domicile  The Oracle Team was able to verify that Consensys AG is registered and domiciled in Zug, Switzerland at address Gartenstrasse 6, 6300 Zug via Zefix.  Given the applicant’s major investors, is there a risk adding this Light Feed would give a single investor too much influence over the Oracle protocol?  No.  Given the incorporation and domicile location of the organization, is there a risk adding this Light Feed would give a single jurisdiction too much influence over the Oracle protocol?  No. Identity  Did the Oracle Team get in contact with the organization to confirm their application?  Yes, the Oracle Team spoke to Michael Wuehler the CoFounder and Head of Operations at Infura over video conference who is listed on the company’s website. Cost-Benefit  Given the ratio of Dark Feeds : Light Feeds, does the Maker Protocol benefit from adding another Dark/Light Feed at this time?  Yes.  Given the extra cost of appointing a new Feed, does the benefit of the marginal security / marginal trust in the protocol exceed the cost?  Yes. Oracle Team Recommendation The Oracle Team recommends that Maker Governance ratify the proposal to appoint Infura as a Light Feed for the Maker Oracles. Their reputation within the industry as the backbone of connectivity to the Ethereum blockchain, present in everyday services like MetaMask, makes them a clear favorite to partner with to decentralize and secure Maker’s Oracles. Being owned by Consensys, itself founded and led by Ethereum cofounder Joe Lubin, just further cements the trustworthiness of Infura. The Oracle Team was able to verify the claims made by Infura in their application. Changelog  reformatted preamble  ",
                    "links": [
                        "https://github.com/infura",
                        "https://www.zefix.ch/en/search/entity/list/firm/1266173"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.716028560184404
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/06/2020-04:53:04",
                    "content": "Governance Poll is live. https://vote.makerdao.com/polling-proposal/qmratquzjbjmevw6eonbyfo1thms8nqdjgcmu2nrbza11c ",
                    "links": [
                        "https://forum.makerdao.com/t/set-of-oracle-proposals-included-in-july-3rd-executive-vote/2977",
                        "https://forum.makerdao.com/t/signal-request-temporarily-process-oracle-proposals-through-the-weekly-governance-cycle/2801"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/mip10c14-sp3-proposal-appoint-etherscan-as-light-feed/2798",
            "title": "MIP10c14-SP3 Proposal: Appoint Etherscan as Light Feed ",
            "index": 2798,
            "category": [
                "Core Units",
                "Oracles"
            ],
            "tags": [
                "oracle-lightfeed-sp",
                "mip-accepted"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Elvis_Hee",
                    "index": "#1",
                    "likes": "4",
                    "time": "11/06/2020-08:47:21",
                    "content": "Hi everyone, this is Etherscan’s submission as a Light Feed Price Oracle to MakerDAO. Thank you.  MIP10c14: Subproposal to Appoint Light Feed  Preamble MIP10c14-SP#: 3  Author(s): Elvis Hee Contributors: Status: Formal Submission Date Proposed: 2020-06-11 Date Ratified: <yyyy-mm-dd>   Name - Etherscan Website - https://etherscan.io/  Github - Etherscan · GitHub  Number of Employees - 15 Email - [email protected]  Incorporated - 2016 Domiciled - Malaysia When was the organization founded? - 2015 Who are the major investors in your organization? - BoostVC, Coinbase, DCG How much funding has the organization raised either privately or through a token sale? - Etherscan is privately funded Please provide public references for the above where possible. - https://etherscan.io/aboutus    Introduction  Motivation for running a Light Feed  To provide independent transparency and decentralization for the ecosystem.  Community  What has your organization contributed to the crypto community?  Etherscan has been a block explorer in the Ethereum ecosystem for the past 4 years. We have worked closely with countless projects in providing support to display on-chain and off-chain data.  Successful products, services, tools, libraries, thought-leadership  The leading Ethereum Block explorer, analytics and api service provider for the eco-system.  How will the Maker Community benefit from your inclusion as a Light Feed?  As a Light Feed we believe our ethos of neutrality and impartiality will help in providing a reliable source of pricing data.  Changelog  reformatted preamble  ",
                    "links": [
                        "https://github.com/etherscan/",
                        "https://etherscan.io/aboutus",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-thursday-june-11-9am-pst-4-00-pm-utc/2742/4",
                        "https://forum.makerdao.com/t/week-2-dai-distributions-sourcecred-trial/2846",
                        "https://forum.makerdao.com/t/set-of-oracle-proposals-included-in-july-3rd-executive-vote/2977",
                        "https://forum.makerdao.com/t/signal-request-temporarily-process-oracle-proposals-through-the-weekly-governance-cycle/2801"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Grants, Funding and resource allocation",
                        "Identity and reputation systems",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.959558823529411
                },
                {
                    "author_link": "https://forum.makerdao.com/u/andytudhope",
                    "index": "#2",
                    "likes": "3",
                    "time": "11/06/2020-10:16:18",
                    "content": "Welcome to the forum @Elvis_Hee!  I can’t think of any reasonable objections to this and would personally be very happy to see Etherscan running a LF. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.666666666666668
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#3",
                    "likes": "0",
                    "time": "15/06/2020-06:36:14",
                    "content": "MIP10c15: Subproposal to Appoint Feed (OT) Preamble MIP10c15-SP#: 3 Author(s): Nik Kunkel Contributors: Status: Formal Submission Date Proposed: 2020-06-14 Date Ratified: <yyyy-mm-dd>  Disclaimer MIP10 is meant to handle all of the Oracle related actions. Unfortunately MIP10 has inconsistencies and doesn’t conform to the monthly governance cadence that the Maker Improvement Proposal framework is built around. This has generated a backlog of Oracle proposals. While MIP10 is refactored to conform to the regular MIP process, Oracle proposals such as this one will utilize the more liberal weekly governance cycle. While strictly speaking this makes them not subproposals, they are included in the subproposal archive as a point of provenance to serve as a paper trail. Specification Introduction If ratified, this subproposal would appoint Etherscan as a Light Feed. Feeds submit data to the Oracles for the prices of assets. They are an important part of ensuring that the Oracles are reliable and secure. Only entities with strong credentials that the community trusts should be permitted to be an Oracle Feed. Organization   Name - Etherscan Website - https://etherscan.io/  Github - https://github.com/etherscan/  Number of Employees - 15 Email - [email protected]  Incorporated - 2016 Domiciled - Malaysia When was the organization founded? - 2015 Who are the major investors in your organization? - BoostVC, Digital Currency Group (DCG), Coinbase Ventures, How much funding has the organization raised either privately or through a token sale? - Etherscan is privately funded Please provide public references for the above where possible. - https://etherscan.io/aboutus    Light Feeds Reputation  Does the organization have a strong reputation in the crypto community?  Yes. Etherscan has been a public utility going back many years. It has become the de-facto standard when referencing Ethereum transactions and is used by a diverse array of casual users as well as developers.  What contributions has this organization made to the crypto ecosystem?  The team has developed a platform that embodies the ideas of decentralization and transparency that underpin the Ethereum blockchain. Users can track any on-chain activity, including the movement of tokens and the details surrounding pending and completed transactions. Projects verifying their smart contracts’ source code on Etherscan is so engrained in the Ethereum ecosystem it’s become not just a standard, but rather a requirement that users expect.  Would including the organization as a Light Feed instill a sense of trust in the Oracles?  Etherscan is a critical piece of infrastructure used daily by thousands of people around the world without which the quality of Ethereum ecosystem would not have become what it is today. It is the opinion of the Oracle Team that Etherscan has a trustworthy reputation in the community and would further reinforce the reputation of the Maker Oracles.  Are there any public accusations of misconduct? How severe and numerous are they? Have they been confirmed?  The Oracle Team was not able to find any record of confirmed cases of misconduct on account of the organization nor its executive staff. Verification  Were sufficient public-facing resources provided or found that confirm the information in the application?  Yes, public records were able to verify some of the provided information. No information provided was proven to be false that would give indication of malicious misrepresentation.   Was the applicant honest with respect to:   the investors   The Oracle Team was able to verify Etherscan: as a portfolio company on the BoostVC website. as a portfolio company on the Digital Currency Group (DCG) website. as a portfolio company on the Coinbase Ventures website.  how much funding was raised  The Oracle Team was not able to find any public figures relating to the amount of funding raised in the 11/01/16 Seed round composed of BoostVC and Digital Currency Group nor of the amount invested by Coinbase Ventures more recently.  the number of employees  The Oracle Team was not able to verify the number of employees. A cursory search through LinkedIn showed 7 profiles claiming to work at Etherscan that correspond to employees listed on the Etherscan About Us page.  the location of incorporation & domicile  The Oracle Team found multiple sources online citing that Etherscan.io was based out Kualu Lampur, Malaysia but was not able to find an entity registered under that name with the Companies Commission of Malaysia  Given the applicant’s major investors, is there a risk adding this Light Feed would give a single investor too much influence over the Oracle protocol?  No.  Given the incorporation and domicile location of the organization, is there a risk adding this Light Feed would give a single jurisdiction too much influence over the Oracle protocol?  No. Identity  Did the Oracle Team get in contact with the organization to confirm their application?  Yes, the Oracle Team spoke to representatives from the Etherscan team over video conference who are listed on the organization’s website. Cost-Benefit  Given the ratio of Dark Feeds : Light Feeds, does the Maker Protocol benefit from adding another Dark/Light Feed at this time?  Yes.  Given the extra cost of appointing a new Feed, does the benefit of the marginal security / marginal trust in the protocol exceed the cost?  Yes. Oracle Team Recommendation The Oracle Team recommends that Maker Governance ratify the proposal to appoint Etherscan as a Light Feed for the Maker Oracles. Having provided the infrastructure for a compelling web of decentralization and transparency of Ethereum since as far back as 2015, Etherscan has cemented itself as a core member of the Ethereum ecosystem that embodies its values. The Oracle Team was able to verify most of the information provided by Elvis in the MIP10c14 Light Feed application however was unable to confirm the amount of funding raised nor the existance of the legal entity in the claimed domicile.  No confirmed cases of misconduct related to the organization were found. Changelog ",
                    "links": [
                        "https://github.com/etherscan/",
                        "https://etherscan.io/aboutus",
                        "https://www.boost.vc/portfolio",
                        "https://dcg.co/portfolio/",
                        "https://ventures.coinbase.com/",
                        "https://etherscan.io/aboutus",
                        "http://Etherscan.io",
                        "https://www.ssm-einfo.my/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.555159667172655
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/06/2020-04:52:32",
                    "content": "Governance Poll is live. https://vote.makerdao.com/polling-proposal/qmty4p3lvezvnucmfcr5byacmmxvxq1kadf6zr1n47kcnu ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.681818181818182
                }
            ]
        }
    ],
    "group_index": "2389"
}