{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/discussion-sf-and-its-involvement-with-lido-steth/17585",
            "title": "Discussion: SF and its involvement with Lido (stETH) ",
            "index": 17585,
            "category": [
                "Governance"
            ],
            "tags": [
                "lido",
                "sf-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/welsh",
                    "index": "#1",
                    "likes": "10",
                    "time": "31/08/2022-21:01:33",
                    "content": "   Lido Governance – 23 Aug 22    Lido DAO Finance Workstream Proposal: Steakhouse Financial Summary Lido DAO onboards Steakhouse Financial as the Finance unit, partnering with Lido DAO contributors to build out full financial statements; develop, manage, and execute payroll processes end-to-end in concert with operations and legal...  Reading time: 2 mins 🕑 Likes: 15 ❤        Blockquote Four members of Steakhouse Financial will join as the Finance team at Lido DAO contributing equivalent capacity of 1.75-2.25 FTE (70-90h per week, more or less depending on workload) @McNut, @Aes, @adcv, @pipko Base salary per FTE of $184,000/year  Are these members of the Maker strategic finance core unit?  Seems like a pretty big conflict of interest. ",
                    "links": [
                        "https://research.lido.fi/t/lido-dao-finance-workstream-proposal-steakhouse-financial/2823",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-13-traduccion/17681",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/15",
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-13/17677",
                        "https://forum.makerdao.com/t/endgame-approval-mip-set-next-steps/17553/20",
                        "https://forum.makerdao.com/t/endgame-approval-mip-set-next-steps/17553/32"
                    ],
                    "GPT-summary": "The post is about a proposal by Lido DAO to partner with Steakhouse Financial as the Finance unit. The proposal is explained in detail, including the capacity and salary of the members of the Finance team. A 3rd party raises a question about a potential conflict of interest.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.151515151515151
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#2",
                    "likes": "6",
                    "time": "01/09/2022-00:14:51",
                    "content": "There do seem to be a confluence of conflicts of interests here. Strategic Finance members will be earning a significant salary from Lido, while also manually administering the purchase of stEth on behalf of MakerDAO and acting as a “Protector MetaDAO” with broad powers in collateral onboarding. Wrapped up in this, MakerDAO is being asked to consider a large Lido token purchase. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.814732142857143
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#3",
                    "likes": "0",
                    "time": "01/09/2022-03:35:46",
                    "content": "It is extremely common for contributors within the DAO to contribute to other DAOs and has been brought up both publicly and privately in the past. If you or anyone in the DAO would like to discuss this subject, I would request posting in the aforementioned linked thread where this was brought up. Many DAO members from CUs and Delegates alike participate in other DAOs which positively impact Maker, while some have even launched protocols that are direct competitors. There have also been Core Unit contributors that also served as Delegates, at the same time. Regarding Lido specifically, until Lido launches it’s own stablecoin and Maker launches it’s own staking as a service business, I don’t believe they are competing. Indeed, I believe the projects complement each other and having contributors active in both DAOs would only increase Maker’s success long term, especially once the End Game Plan passes in which MakerDAO will accumulate significant amounts of stETH.     CodeKnight:  There do seem to be a confluence of conflicts of interests here. Strategic Finance members will be earning a significant salary from Lido, while also manually administering the purchase of stEth on behalf of MakerDAO and acting as a “Protector MetaDAO” with broad powers in collateral onboarding. Wrapped up in this, MakerDAO is being asked to consider a large Lido token purchase.   I’m happy to address any concerns publicly or privately, but given the significance of this MIP I would request that such discussions occur in the previously linked thread. I have been discussing MetaDAOs with @rune for the past several weeks and we have discussed how the SFCU could fit within the End Game Plan - such discussions have been extremely fluid and continue to evolve. Given that Rune is a significant LDO holder, I also discussed the idea of part of SF providing services similar to what we perform for MakerDAO, for LidoDAO. Regarding the acquisition of stETH by MakerDAO - SF will still write proposals to the community in the event of the Endgame Approval MIP Set passing to seek community feedback for ensuring the DAO can acquire stETH at the best possible price. This is not something I have discussed with Rune, as he mentioned on the DVC call today, but sounds like something we could use DssKiln for. Related to the Protector MetaDAOs and collateral onboarding - we deeply appreciate the trust and autonomy to support the DAO with Rune’s sub-proposal to move forward with onboarding proposals that will help facilitate the Endgame Plan and Protector Clustering. There are some very exciting MIPs currently being drafted that we believe will provide the DAO with the resources needed to successfully launch the Endgame Plan and MetaDAOs. Throughout the onboarding process, we will be as transparent as possible and provide frequent updates to the DAO. ",
                    "links": [
                        "https://forum.makerdao.com/t/mandated-actors-neutrality-discussion/16025/59",
                        "https://forum.makerdao.com/t/discussion-is-gfxs-interest-protocol-a-direct-challenge-to-maker/15577"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.497594869669338
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#4",
                    "likes": "13",
                    "time": "01/09/2022-05:57:37",
                    "content": "Two issues I find with this, rather surprising, discovery: 1.) We learned about this not from SF CU disclosing their plans to MakerDAO up front, but from a recognized delegate’s diligent research. 2.) In the Lido forum Stakehouse Financial proposes to: build out full financial statements; develop, manage, and execute payroll processes end-to-end in concert with operations and legal workstreams; create standardized financial reports for the entire DAO including cash flow, grants, operating expenses; I feel that we could use plenty of that here in MakerDAO, and am wondering whether SF CU feels not compensated well enough or otherwise necessitated to seek alternative income with existing personell. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#5",
                    "likes": "10",
                    "time": "01/09/2022-07:20:07",
                    "content": "   Endgame Approval MIP Set - next steps   We learned about this not from SF CU disclosing their plans to MakerDAO up front, but from a recognized delegate’s diligent research.   I also don’t feel this issue can just be ignored.     Aes:  It is extremely common for contributors within the DAO to contribute to other DAOs   Ok perhaps it is time to stop using the word “contributors”, at least in the context of MakerDAO. It’s just ridiculous considering the amount of money you get as salaries. When we (MakerDAO) pay full salaries, we expect a full time commitment. If CU-members wish to take other (part-time, occasional) jobs outside MakerDAO, then they need to be very transparent about it, and MakerDAO should grant a special permission. @Aes I am not attacking you or any specifics, as this event sets a precedent (and therefore nobody can be explicitly blamed). But I am not comfortable paying the high salaries we currently pay and then discover (form the independent research of a forum user (@welsh ) that they are also working for  contributing equivalent capacity of 1.75-2.25 FTE (70-90h)  for another Project.    Endgame Approval MIP Set - next steps   I feel that we could use plenty of that here in MakerDAO, and am wondering whether SF CU feels not compensated well enough or otherwise necessitated to seek alternative income with existing personell.   @rspa you are a gentleman but I think in this case you are being too polite. ",
                    "links": [
                        "https://forum.makerdao.com/t/endgame-approval-mip-set-next-steps/17553/25"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.140476190476191
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#6",
                    "likes": "6",
                    "time": "01/09/2022-12:52:31",
                    "content": "Working for two DAOs is common. Conducting business between two DAOs that you work for is the issue. SF would be administering the purchase of stEth on behalf of MakerDAO while also working for Lido. That is a clear conflict of interest. There is also concern whether SF can both manage the large increase in its mandate that the endgame includes alongside this work for Lido. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None"
                    ],
                    "Sentiment": 5.023809523809524
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aes",
                    "index": "#7",
                    "likes": "11",
                    "time": "01/09/2022-14:21:40",
                    "content": "Firstly, to clarify a minor point: SF is not onboarding at Lido . We are developing Steakhouse Financial, a small DAO-to-DAO partnership with a mission to democratize complex information for a broad base of stakeholders. We envision this as a niche platform with a very small number of DAOs that grows organically, leveraging contributors and community members who are already on the inside, and for protocols we are invested in and care about deeply. This platform should allow embedded groups of passionate contributors to grow with their DAOs in a modular and scalable way that aligns incentives for all participants. Needless to say, it is not going to be a high-growth FAANG tech company that will one day compete with Maker. It is a group of DAO contributors with enough brain damage from working in the space who want to organize a little bit more than before.    Endgame Approval MIP Set - next steps   Two issues I find with this, rather surprising, discovery: 1.) We learned about this not from SF CU disclosing their plans to MakerDAO up front, but from a recognized delegate’s diligent research. 2.) In the Lido forum Stakehouse Financial proposes to: build out full financial statements; develop, manage, and execute payroll processes end-to-end in concert with operations and legal workstreams; create standardized financial reports for the entire DAO including cash flow, grants, operating expenses; I feel that we could use plenty of that here in MakerDAO, and am wondering whether SF CU feels not compensated well enough or otherwise necessitated to seek alternative income with existing personell.   1:  Given how public our proposal at Lido is and how we had envisioned fencing off responsibilities, we thought it would not be relevant discussing publicly at Maker until the proposal passed  Rune has, however, been aware of this proposal for some time Clearly these two alone missed the mark and may have given the wrong impression to people, and we regret not posting earlier     Strategic Finance is not asking to be onboarded to Lido  The proposal for Lido involves two members of Strategic Finance (Mark and Adrian), in a supervisory capacity, and two independent members, (Danny and Pipko) Pipko was a summer intern with us at Strategic Finance but this internship has come to an end as his school year restarts and McNut has never been part of a CU at Maker There are members of StratFi who are not part of the proposal   It does not take a lot of diligence to uncover this information  When we presented the proposal to the Lido community, we did not make any effort nor have any desire to hide who we are Our pfps and usernames are exactly the same, we are doxxed there as we are here and we specify clearly we are contributors at MakerDAO    2:  We have developed:  Full financial statements Standardized financial reports Cash flow forecasts Operating expenses reports and processes Further work on balance sheet management frameworks with developments and proposals incoming over the next few weeks Invite you to consult our monthly updates for more information on other initiatives   We are proud of this work as it is widely recognized as some of the best in the industry and we have begun collaborating with other industry participants and academics on the discussion around more broadly recognized standards for accounting practices  Tunnel vision at Maker may obscure the fact that people inside and outside MakerDAO greatly value and follow this information on a regular basis      twitter.com    Justin Trollip @jtrollip  This is inspirational. Good on @MakerDAO for this level of transparency and diligence in preparing such a clean set of financials. twitter.com/SebVentures/st…   Sébastien Derivaux @SebVentures  Last @MakerDAO financials are published. 📈 Crypto-backed lending is down so we are entering in a few month of negative results until short-term bonds RWA save the day. But really the financial deck is great and leader in financial communication. 🪙 https://t.co/juCwErraYA https://t.co/DjcPXjrU64    11:18 PM - 13 Jul 2022           5              twitter.com    | -\\/- | @mad_shills  Congrats to @AesPoker and team @adcv_ @SebVentures @lyt_eth . Leading the frontier in blockchain accounting! twitter.com/SebVentures/st…   Sébastien Derivaux @SebVentures  Last @MakerDAO financials are published. 📈 Crypto-backed lending is down so we are entering in a few month of negative results until short-term bonds RWA save the day. But really the financial deck is great and leader in financial communication. 🪙 https://t.co/juCwErraYA https://t.co/DjcPXjrU64    5:42 PM - 13 Jul 2022           3              twitter.com    Gabriel Gruber 𝚵 @GabrielGruber  DeFi is open and clear twitter.com/SebVentures/st…   Sébastien Derivaux @SebVentures  Last @MakerDAO financials are published. 📈 Crypto-backed lending is down so we are entering in a few month of negative results until short-term bonds RWA save the day. But really the financial deck is great and leader in financial communication. 🪙 https://t.co/juCwErraYA https://t.co/DjcPXjrU64    8:26 AM - 13 Jul 2022           5              twitter.com    0xValue @0xValue_  Transparencia, transparencia, transparencia twitter.com/SebVentures/st…   Sébastien Derivaux @SebVentures  Last @MakerDAO financials are published. 📈 Crypto-backed lending is down so we are entering in a few month of negative results until short-term bonds RWA save the day. But really the financial deck is great and leader in financial communication. 🪙 https://t.co/juCwErraYA https://t.co/DjcPXjrU64    8:14 PM - 13 Jul 2022           1              twitter.com    jackchong.eth @jackchong_jc  @SebVentures @MakerDAO Exactly what the industry needs   7:30 AM - 13 Jul 2022           3             That said, our door is always open regarding these topics as we rely on questions and feedback to improve  Should you have specific concerns that you believe have gone unaddressed, I would be grateful to hear them because we rely regularly on people’s feedback on the forum and in the G&R calls to improve the materials over time       Endgame Approval MIP Set - next steps   Ok perhaps it is time to stop using the word “contributors”, at least in the context of MakerDAO. It’s just ridiculous considering the amount of money you get as salaries. When we (MakerDAO) pay full salaries, we expect a full time commitment. If CU-members wish to take other (part-time, occasional) jobs outside MakerDAO, then they need to be very transparent about it, and MakerDAO should grant a special permission. @Aes I am not attacking you or any specifics, as this event sets a precedent (and therefore nobody can be explicitly blamed). But I am not comfortable paying the high salaries we currently pay and then discover (form the independent research of a forum user (@welsh ) that they are also working for    There is no MIP mandate that requires Core Units be exclusive employees of the protocol and Maker does not provide employment  Unless Maker also wants to pay social security charges, maternity and paternity leave, arbitrate in employment tribunals, issue jurisdiction-specific working contracts and open branches in countries where contributors are located   Other Core Units and Delegates regularly work for other protocols and companies  Broadly speaking this should be fine provided there are no overlapping positions of meaningful decision authority in either DAO, and even then the line is blurry Token holders are ultimately the decision-makers, if they prefer to have CUs with exclusive dedication they should voice that desire - but it would be one of the few to require it Some disclose it openly others don’t.   SF - including members who are not part of the Lido proposal - has an active offboarding post, from an anon account, that has only been addressed by a single delegate  We could be offboarded in weeks with no recourse, as there is no contractual or employer agreement with the DAO, as is the nature of working for a DAO Our future in the DAO is quite volatile and the opposite of an implied bargain to exclusivity        CodeKnight:  There do seem to be a confluence of conflicts of interests here. Strategic Finance members will be earning a significant salary from Lido, while also manually administering the purchase of stEth on behalf of MakerDAO and acting as a “Protector MetaDAO” with broad powers in collateral onboarding. Wrapped up in this, MakerDAO is being asked to consider a large Lido token purchase.    Our first thought on stETH is to not operate it actively  We learned about this plan at the same time as everyone else, reading this post Based off our experience with Makershire, our instinct is to not actually take ownership of the buy order but run it through a permissionless vault, such as a PSM or DSS Kiln, where final decision authority would remain with token holders   None of us has any decision authority in either DAO, nor do we have enough tokens to make any sort of meaningful decision in any camp  General Comment: Often the tone of discussions at Maker is for things to happen then nothing happens then all of a sudden it blows up for some reason and outrage is produced. The Lido proposal has been on their forums and their twitter accounts for some time now. Often this outrage tends to be coordinated by anon accounts. While we are obviously welcoming of all identities who may not have the desire to dox themselves while interacting here, these interactions also tend to be very short on substance, some of whom have significant conflicts of interest themselves. With some notable exceptions incl. @iammeeoh despite his evident disappointment. Let’s have a discussion on the issues to resolve them diligently and leave outrage at the threshold. We’ll be on the G&R to discuss our Offboarding Proposal though I am certain there are far more pressing matters to talk about for Maker than one more round of human drama. This thread is meant to be about the Endgame Plan and we would appreciate getting back to the matter on hand, as well as moderator’s help in merging this with the External Work thread or, even better, a new thread altogether. ",
                    "links": [
                        "https://docs.google.com/spreadsheets/d/1SZxZwqw4qwhP99F6NkoZ18vj624ik-ny/edit?usp=sharing&ouid=107540053169723534061&rtpof=true&sd=true",
                        "https://forum.makerdao.com/tag/financial-report",
                        "https://forum.makerdao.com/t/signal-request-budget-re-allocation-core-unit-accountability-framework/16788",
                        "https://forum.makerdao.com/tag/expense-reporting",
                        "https://www.ar.ca/blog/the-good-bad-ugly-of-voluntary-reporting-and-transparency",
                        "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=4200414",
                        "https://twitter.com/jtrollip/status/1547359803294380034",
                        "https://twitter.com/jtrollip/status/1547359803294380034",
                        "https://twitter.com/jtrollip/status/1547359803294380034",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/SebVentures/status/1547113013513273345",
                        "https://twitter.com/SebVentures/status/1547113013513273345",
                        "https://twitter.com/jtrollip/status/1547359803294380034",
                        "https://twitter.com/mad_shills/status/1547275276807090178",
                        "https://twitter.com/mad_shills/status/1547275276807090178",
                        "https://twitter.com/mad_shills/status/1547275276807090178",
                        "https://twitter.com/AesPoker",
                        "https://twitter.com/adcv_",
                        "https://twitter.com/SebVentures",
                        "https://twitter.com/lyt_eth",
                        "https://twitter.com/SebVentures/status/1547113013513273345",
                        "https://twitter.com/SebVentures/status/1547113013513273345",
                        "https://twitter.com/mad_shills/status/1547275276807090178",
                        "https://twitter.com/GabrielGruber/status/1547135322798145537",
                        "https://twitter.com/GabrielGruber/status/1547135322798145537",
                        "https://twitter.com/GabrielGruber/status/1547135322798145537",
                        "https://twitter.com/SebVentures/status/1547113013513273345",
                        "https://twitter.com/SebVentures/status/1547113013513273345",
                        "https://twitter.com/GabrielGruber/status/1547135322798145537",
                        "https://twitter.com/0xValue_/status/1547313521020600324",
                        "https://twitter.com/0xValue_/status/1547313521020600324",
                        "https://twitter.com/0xValue_/status/1547313521020600324",
                        "https://twitter.com/SebVentures/status/1547113013513273345",
                        "https://twitter.com/SebVentures/status/1547113013513273345",
                        "https://twitter.com/0xValue_/status/1547313521020600324",
                        "https://twitter.com/jackchong_jc/status/1547121250807549953",
                        "https://twitter.com/jackchong_jc/status/1547121250807549953",
                        "https://twitter.com/jackchong_jc/status/1547121250807549953",
                        "https://twitter.com/SebVentures",
                        "https://twitter.com/MakerDAO",
                        "https://twitter.com/jackchong_jc/status/1547121250807549953",
                        "https://forum.makerdao.com/t/endgame-approval-mip-set-next-steps/17553/28",
                        "https://forum.makerdao.com/t/discussion-external-work/15718"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None"
                    ],
                    "Sentiment": 5.3899869806119804
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#8",
                    "likes": "8",
                    "time": "01/09/2022-21:27:22",
                    "content": "While my view might be unpopular, I think it’s allowable for a Core Unit contributor or contributors to engage in different roles. In fact, the Maker protocol allows even anonymous contributors who in theory the community doesn’t even know they are engaged in other entities / protocols. However, if the CU or the members are under performing because they have to juggle between different roles, then the community and the governance will take notice and take actions. I think for now, SF CU has been functioning well but you can imagine if the performance deteriorate in the future, they would be encouraged to readjust their prioritization. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 4.84375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#9",
                    "likes": "10",
                    "time": "01/09/2022-22:24:02",
                    "content": "I tend to agree with @Doo_StableLab’s comments. It’s notable in this case that SF used their same names/identities in their Lido proposal (a public post) even though nothing really would have stopped them from doing so under other identities, or consulting privately, etc. As Aes says, we do not require CUs to work exclusively for Maker and there are plenty of examples of other CUs doing work for other protocols. It would be unfair to hold SF to a standard we haven’t held any other CU to. If we want to  have exclusive workers at the DAO, that should be its own broad conversation on a DAO-wide scale, rather than assert some kind of implied fidelity/contract on an ad-hoc basis. The other point I would make, though, is that this general practice (of CUs contributing work to multiple DAOs) seems like the direction of travel in any case for Maker. Take the possible shift to Project-Based Budgeting, for instance, where contributors’ tie to Maker would presumably be to complete a discrete scope of work. The Endgame Plan also envisages most CUs working as contributors to autonomous MetaDAOs, at arms’ length from the core protocol. None of this means that conflicts of interest won’t exist in the future, but the very nature of Maker’s workforce is fluid and evolving, which seems like important context for this discussion. ",
                    "links": [
                        "https://forum.makerdao.com/t/project-based-budgeting-revisited/17650"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.4975
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#10",
                    "likes": "4",
                    "time": "02/09/2022-16:02:18",
                    "content": "Folks time to be real here on some basic issues.  As contractors to MakerDAO as far as I know CUs have never had to sign any form of non-compete agreement (which actually is common in a lot of tech companies for many reasons).   Not even sure who could co-sign on this for the DAO actually. Many companies now as a condition of employment restrict employees from being employed elsewhere.  This is less common than (1) but it is a growing trend as far as I know. If one looks at contractors for the DAO as consultants then one has to consider it natural for these contractors to solicit and work for other clients.   In fact if you think there will be high variability on the work for these people you sign them with a ‘retainer’ so they continue to be available over periods of time vs. them just deciding they no longer have to work for you.  It was always my expectation that CUs would and should start to look like MakerDAO spinoff business units (BUs).  MakerDAO until the MetaDAO concept never really grasped the idea, much less practically, how to do BUs.  Given the complete lack of jurisdiction and legal accountability between a DAO and anything (except RWA through a trust, etc.) I couldn’t see how MakerDAO could actually spin off BUs and retain ownership/control via ownership stakes.    The point here is why would Maker spend millions on CU contractors to effectively start their own BUs and not retain any ownership stakes? Rune seems to think MetaDAOs solve the above.  Time will tell. I come back to something @PaperImperium said over a year ago now and I am paraphrasing him.   DAOs are basically are the worst of all organizations I will add that Maker failing to home in any jurisdiction is equivalent to floating a pirate flag on its business ship. The real issue here is that MakerDAO contractors have no explicit rules for conduct and no jurisdictional or legal frameworks to fall back on should agreements be broken.  This involves disclosure of conflicts of interest, non-disclosure agreements, non-compete, etc. No matter what is decided here - one thing should emerge - a uniform and equal treatment of all MakerDAO individuals within particular classes (whether this is contractors, vault owners, DAI holders, delegates or MKR holders) which in the case of CUs as contractors will mean a general rules of conduct for contractors equally applicable to all contractors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.273611111111112
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "2",
                    "time": "02/09/2022-18:56:50",
                    "content": "    MakerMan:   If one looks at contractors for the DAO as consultants then one has to consider it natural for these contractors to solicit and work for other clients. In fact if you think there will be high variability on the work for these people you sign them with a ‘retainer’ so they continue to be available over periods of time vs. them just deciding they no longer have to work for you.    Yeah. Fair enough. But then this remark of @NikKunkel  in a public chat is in order:  Screenshot 2022-09-02 at 20.56.441386×224 44.1 KB  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.882142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#12",
                    "likes": "1",
                    "time": "02/09/2022-21:14:44",
                    "content": "    iammeeoh:  Yeah. Fair enough. But then this remark of @NikKunkel in a public chat is in order:   I think that is a fair point since equity is for employees not consultants or contractors. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/luca_pro",
                    "index": "#13",
                    "likes": "4",
                    "time": "02/09/2022-21:42:26",
                    "content": "Probably limited experience - there are plenty of vendors for early stage clients that collect cash + equity compensation. I won’t repeat what said already, since @Matt_NZ has pretty much covered 99% of what I have to say on the matter. 1 extra thing: the double/ triple/ quadruple standards in this DAO are hilarious. I endorse completely SF to simply proceed doing what they see fit without worrying about stones thrown around. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.861607142857142
                },
                {
                    "author_link": "https://forum.makerdao.com/u/welsh",
                    "index": "#14",
                    "likes": "1",
                    "time": "02/09/2022-23:15:44",
                    "content": "In general I completely agree and I definitely don’t think SF should be called out specifically for working for other protocols in general.  The cost/productivity/value of many CUs is obviously an issue for Maker as a whole and can/should be addressed separately. The issue here is that SF seems to be involved with the administration and (this part is not clear to me) possibly the strategic usage of a protocol that they are (or will be) getting paid by.  This is as if the US government hired a firm to manage a new fighter jet program and the firm they hired was also on Lockheed’s payroll (or if RWF was on HVBanks payroll).  That would be absurd and the firm could not be expected to neutrally carry out those duties.  If SF is getting paid by Lido, they should not be involved in purchasing assets that directly benefit Lido or in making strategic decisions/recommendations that directly benefit Lido. ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 4.9614898989899
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#15",
                    "likes": "0",
                    "time": "02/09/2022-23:43:52",
                    "content": " Aes addressed this:      Aes:  Our first thought on stETH is to not operate it actively  We learned about this plan at the same time as everyone else, reading this post Based off our experience with Makershire, our instinct is to not actually take ownership of the buy order but run it through a permissionless vault, such as a PSM or DSS Kiln, where final decision authority would remain with token holders     (my stance, not representative of SF) Even if it was more active operation, there isn’t really room for a conflict of interest to be influential. All that is planned to happen is a DCA purchase of a preset amount of stETH at a preset cadence. How could execution of this possibly be influenced by a conflict of interest?  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.341666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/welsh",
                    "index": "#16",
                    "likes": "1",
                    "time": "03/09/2022-02:24:20",
                    "content": "Maybe I’m misunderstanding Strategic Finance’s role in Maker or reading the name too literally.  Isn’t one of the CU’s core responsibilities to advise the DAO on these types of decisions (i.e. deploying $100 million+ into stETH)? ",
                    "links": [],
                    "GPT-discussion-categories": [],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#17",
                    "likes": "13",
                    "time": "03/09/2022-03:46:36",
                    "content": "Some thoughts (personal, not representative of risk CU):  Echoing Matt, @juan’s post about project based budgeting seems relevant. What Maker really needs is quality work product and throughput, not FTEs per se (although I think having people who are “full time” committed to Maker has big, intangible benefits). Risk of the engagement seems low as SF actions must be thoroughly justified to pass governance, and SF team does not have the power to control protocol assets independently. If any conflict starts to emerge (eg favoring Lido at the expense of competitors or against the best interests of MakerDAO), I think this can be identified and corrected on a case by case basis, rather than preemptively based on the potential for future conflicts. Key DAO services may become cheaper over time if we let our CUs grow in scale by serving more organizations. Particularly in SFs case, I think generating financial statements and financial planning could benefit from supply side economies of scale. To the extent that DAI/MKR budgets are being justified to MakerDAO based on a certain number of FTEs, it does matter that these people are actually working for Maker full time. But in some cases the better solution may be rethinking our budget setting standards rather than discouraging work for external protocols. An alternative model for external protocol work is billing external protocols for benefit of MakerDAO (eg. risk team’s recent proposals at Aave and Compound included payments to MakerDAO). This may not work in all cases and maybe isn’t the best mechanism in the long run (eg would it be better for service providers / CUs to bill other protocols directly and be able to charge Maker less?) but worth considering.  Disclaimers:  I participated in LDO private sale last year and it remains one of my largest holdings I contribute to a few other DAOs (although generally not for pay)  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.7890926640926645
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#18",
                    "likes": "6",
                    "time": "03/09/2022-07:13:08",
                    "content": "    monet-supply:  To the extent that DAI/MKR budgets are being justified to MakerDAO based on a certain number of FTEs, it does matter that these people are actually working for Maker full time. But in some cases the better solution may be rethinking our budget setting standards rather than discouraging work for external protocols   I totally agree with this, and I don’t want to discourage any possible arrangement for work, as each has its PROs/CONs and can be useful for a given set of people/situations. My point is that with the current way most CUs have set up, that is  stating FTE positions in their budget proposals, and receiving MKR compensation  it’s not appropriate to just do additional paid work (with a commitment of a non-negligible hours/week) for other DAOs, especially if it is not well advertised in the forum and accepted by governance. In my view taking a role as a ‘full time’ at Maker, being paid pretty well (MakerDAO’s salaries are quite generous), receiving MKR compensation on top of it… and then coming up with a “uhm, technically we are not employees” and \"working for other DAOs brings value to the ecosystem and to maker’ etc is borderline intellectually dishonest. This, of course, is just my personal point of view. One last comment:     luca_pro:  the double/ triple/ quadruple standards in this DAO are hilarious.   This is the first time I noticed this behaviour (additional paid work for other DAOs on top of a FTE commitment at Maker). Surely due to my lack of attention. I have absolutely nothing specific against SF and I would just repeat myself on all other similar situation given the same circumstances. Let me quote myself:     iammeeoh:  @Aes I am not attacking you or any specifics, as this event sets a precedent (and therefore nobody can be explicitly blamed).   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.530529953917051
                },
                {
                    "author_link": "https://forum.makerdao.com/u/NikKunkel",
                    "index": "#19",
                    "likes": "5",
                    "time": "07/09/2022-12:14:01",
                    "content": "    monet-supply:  To the extent that DAI/MKR budgets are being justified to MakerDAO based on a certain number of FTEs, it does matter that these people are actually working for Maker full time. But in some cases the better solution may be rethinking our budget setting standards rather than discouraging work for external protocols.   Understood, OCU will be applying to be the Oracle Core Unit for every other DeFi protocol from now on and pocketing the money. Thank you for clarifying! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.934311224489796
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#20",
                    "likes": "1",
                    "time": "07/09/2022-17:58:02",
                    "content": "There’s a right and wrong way to do it, but oracle networks definitely have potential for supply side economies of scale. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.732142857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/WaterLily",
                    "index": "#21",
                    "likes": "0",
                    "time": "21/09/2022-18:17:17",
                    "content": "The public and the management will remain aware and intervene if indeed the CU or even the workers are operating below standards because they are managing multiple roles. I believe that SF CU has been operating effectively for the time being, but you can imagine that if performance were to decline in the future, they would be pushed to reevaluate their priorities. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.85
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#22",
                    "likes": "0",
                    "time": "22/12/2022-00:17:56",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}