{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/anuncio-de-pecu-protocolo-maker-la-fusion-y-futuros-forks-de-ethereum-traduccion/17847",
            "title": "Anuncio de PECU: Protocolo Maker, la fusi\\xc3\\xb3n y futuros forks de Ethereum [Traducci\\xc3\\xb3n] ",
            "index": 17847,
            "category": [
                "Latin America"
            ],
            "tags": [
                "espa\\xc3\\xb1ol",
                "latin-america",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cryptenthusiastic",
                    "index": "#1",
                    "likes": "6",
                    "time": "11/09/2022-23:50:33",
                    "content": " Anuncio de PECU: Protocolo Maker, la fusión y futuros forks de Ethereum *Debido a las recientes preguntas de la comunidad, la siguiente guía proporciona contexto e información sobre los ataques de repetición, un potencial fork duro de Ethereum y los posibles efectos en los contratos MakerDAO. También detalla los riesgos de usar la función de permiso de DAI en todos los forks de la red principal de Ethereum. La siguiente información no constituye ningún tipo de asesoramiento. Después de años de extensas pruebas y trabajo, la transición a proof of stake de Ethereum está lista, y se espera que tenga lugar entre el 14-15 de septiembre de 2022 . Sin embargo, en los últimos meses, los mineros junto con otras partes han planteado la posibilidad de un fork duro de Ethereum, creando una cadena de proof of work (PoW), así como una cadena de proof of stake (PoS).  ¿Qué es el consenso? En general, la mayoría de los protocolos y empresas están optando por el apoyo a la cadena PoS, con creadores de reyes como el emisor de USDC Circle , el proveedor de oráculos ChainLink y el custodio de WBTC BitGo que ya han anunciado su apoyo a la cadena PoS. El anuncio de BitGo afirma lo siguiente:  BitGo protege todas las transacciones que se originan en nuestra plataforma contra los ataques de repetición; por ejemplo, si usted tiene una transacción confirmada en la cadena PoS (que mantendrá el ID de la cadena actual), entonces esa transacción no puede ser “reproducida” en una cadena bifurcada determinada, ya que esta última tendrá necesariamente un ID de cadena diferente.  Es importante destacar la mención de BitGo a los ataques de repetición porque no se puede estar seguro de que ETH PoW cambiará el chainId para permitir que se produzca un fork duro sin problemas, como se describe a continuación:  Tweet 11182×1214 105 KB  *Este tema ya ha sido planteado.   PoW_PRs730×246 54.1 KB  Los pull requests abiertos que cambian el ID de la cadena permanecen sin fusionar.  En base a esto, parece que hay una posibilidad no nula de que ETH PoW utilice el mismo chainId que PoS ETH. La siguiente discusión asume que el chainId de el fork PoW será 1. Vamos a discutir por qué esto puede tener efectos adversos y cómo los usuarios pueden minimizar el riesgo de ser afectados por esto.  ¿Qué es un ataque de repetición? Un ataque de repetición es tomar una transacción de una red y usarla en otra. Si envías a alguien 100 wETH en el fork PoW; no querrías que esta acción se repitiera en la red principal de Ethereum sin tu permiso, sin embargo los ataques de repetición lo hacen posible. En más detalle, un ataque de repetición implica tomar una transacción en PoW ETH y reproducirla en PoS ETH. EIP-155  fue implementado para prevenir los ataques de repetición usando un valor único de chainId para diferentes redes (como Binance Smart Chain y Polygon así como redes de prueba como Rinkeby y Goerli) **sin embargo si el mismo chainId es usado en dos redes, los ataques de repetición se vuelven posibles.  ¿Cómo afectan los ataques de repetición a los propietarios de DAI y MKR? Los ataques de repetición no son específicos de los tokens DAI o MKR - el ether en bruto, los tokens ERC20, los NFT ERC721 y todos los demás activos digitales pueden ser transferidos mediante ataques de repetición. Cualquier transacción transmitida a la red PoW puede ser reproducida en la red PoS si comparten el mismo chainId. Algunos ejemplos de interacciones que pueden ser reproducidas:  Interactuar con cualquier contrato Maker en PoW directamente (desde la misma dirección que usabas antes del fork) Vender tokens PoW DAI o MKR a alguien en una transacción peer-to-peer Interactuar con tokens DAI o MKR de PoW a través de una dApp (como venderlos en UniSwap)  En resumen: cualquier cosa que hagas en PoW ETH puede ser reproducida en ETH PoS y debes asumir que puede ser reproducida en PoS.  ¿Cómo afectan los ataques de repetición al Protocolo Maker más allá de esto? Los usuarios deben ser conscientes y precavidos de los riesgos mencionados. Aquí están los principales elementos del sistema DSS que pueden causar problemas:  Oráculos El contrato median.sol (parte del módulo de oráculos) no tiene ninguna verificación del valor de chainId, lo que significa que los precios de los activos de PoS pueden ser utilizados (a través de ataques de repetición) para “forzar” que el sistema MCD “funcione”. Mientras que esto mantendría el precio del DAI a 1$ en teoría, forzar los valores del oráculo PoS en el MCD PoW probablemente sobrevaloraría la garantía subyacente, lo que significa que el DAI en PoW estaría respaldado por menos valor en la realidad de lo que el sistema pensaría. En este punto, no se espera que el DAI PoW subcolateralizado afecte al DAI PoS. Median puede utilizarse para forzar al DSS a seguir operando en PoW basándose en la alimentación de precios de PoS, sin embargo el verdadero ratio de colateralización será mucho, mucho más bajo que el objetivo.  token DAI El contrato de token DAI es inmutable y se le proporcionó un chainId en su constructor. El DAI permit deriva el compendio del DOMAIN_SEPARATOR que se basa en el chainId proporcionado en el constructor en lugar del chainId actual. Esto hace que las interacciones con DAI sean inseguras en cualquier fork “adecuado” (uno que cambie el chainId) de Ethereum mainnet. De nuevo, independientemente de si el chainId se actualiza en el fork, el uso de DAI en cualquier fork de mainnet podría resultar en la pérdida de DAI en mainnet a través de un ataque de repetición. El uso de permit en cualquier hard fork del estado actual de Ethereum podría ser utilizado para transferir los fondos de los usuarios a través de un ataque de repetición en otros forks, incluyendo mainnet.  ¿Qué significa esto para los titulares de DAI y MKR? Aquí hay algunas opciones para la interacción de la cadena PoW, de la más segura a la más arriesgada:  No interactuar con el fork PoW en absoluto (ninguna interacción). No interactuar con MKR, DAI o cualquier contrato asociado a MakerDAO en el fork PoW. Interactúe con el fork extremando las medidas de precaución y asuma que todas sus transacciones serán reproducidas en la mainnet. Evite el uso de permit y no asuma que DAI utilizará las fuentes de precios correctas o que está suficientemente colateralizado.   Conclusión Si los promotores de el fork PoW deciden utilizar un chainId de 1, el fork PoW será peligrosa para todos los usuarios, incluidos los técnicos y los experimentados. Bitcoin Cash y Ethereum Classic sufrieron ataques de repetición (incluso con ETC usando un chainId de 61) que se cobraron los fondos de los nuevos y viejos inversores por igual. Vale la pena señalar que interactuar con el Protocolo Maker en cualquier fork futuro del estado actual de la mainnet de Ethereum es peligroso - incluso si el fork utiliza un valor chainId diferente- debido a los problemas mencionados.  Esta es una traducción libre del topic PECU Announcement: Maker Protocol, the Merge and Future Forks of Ethereum de @Derek Créditos: Traducción @cryptenthusiastic - Revisión @Brigith238 ",
                    "links": [
                        "https://www.circle.com/blog/usdc-and-ethereums-upcoming-merge",
                        "https://docs.chain.link/docs/ethereum-proof-of-stake-merge/",
                        "https://blog.bitgo.com/bitgos-approach-to-the-ethereum-merge-60ef71a9c095?gi=718f898c3521",
                        "https://mobile.twitter.com/LefterisJP/status/1567077681786769409",
                        "https://github.com/ethereumpow/go-ethereum/pulls",
                        "https://github.com/ethereum/EIPs/issues/155",
                        "https://github.com/makerdao/median/blob/master/src/median.sol",
                        "https://docs.makerdao.com/smart-contract-modules/oracle-module",
                        "https://github.com/makerdao/dss/blob/master/src/dai.sol",
                        "https://www.circle.com/blog/preventing-replay-attacks-after-the-bch-hard-fork",
                        "https://www.coindesk.com/markets/2016/07/29/rise-of-replay-attacks-intensifies-ethereum-divide/",
                        "https://forum.makerdao.com/t/pecu-announcement-maker-protocol-the-merge-and-future-forks-of-ethereum/17789"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.779761904761905
                }
            ]
        }
    ]
}