{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-usdc-a-stability-fee-and-debt-ceiling-adjustments/3020",
            "title": "[Signal Request] USDC-A Stability Fee and Debt Ceiling adjustments ",
            "index": 3020,
            "category": [
                "Governance"
            ],
            "tags": [
                "rates",
                "comp",
                "debt-ceiling",
                "usdc",
                "emergency-response",
                "liquidity-mining"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#1",
                    "likes": "3",
                    "time": "02/07/2020-18:12:48",
                    "content": "Hey all, based on today’s governance call, we are putting up a signal request for potential adjustments to the USDC-A parameters in anticipation of any market impact due to the upcoming COMP distribution change.     LongForWisdom:  To just add some context as to the possible governance paths here.  This is an emergency governance action that is taking place outside of the usual governance processes. Due to the limited time for action, this will not have an on-chain governance poll. If nothing catastrophic happens before Friday’s executive. Any changes coming out of this poll will be included in the regular executive on Friday. If something catastrophic happens before Friday, the current state of this poll may be used to inform the contents of emergency executives before Friday.    This forum poll will be up for 24 hours and then will be bundled inside tomorrow’s executive vote (along with the W-BTC debt ceiling and base rate changes) Which of the following do you support as policy actions for governance?     No changes Increase Risk Premium, No Change to Debt Ceiling Increase Debt Ceiling, No Change to Risk Premium Increase both Risk Premium and Debt Ceiling     0 voters     What should the Risk Premium be for USDC-A?     No change 2% 4% 6% 8% 10%     0 voters     What should the Debt Ceiling be for USDC-A?     No change 30 million 40 million 50 million 60 million 70 million     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/signal-request-should-makerdao-signal-that-it-prefers-for-comp-rewards-for-dai-suppliers-and-borrowers-to-be-disabled/3112",
                        "https://forum.makerdao.com/t/maker-relay-ep-2/3097"
                    ],
                    "GPT-summary": "The author of the post is requesting feedback on potential adjustments to the USDC-A parameters in anticipation of any market impact due to the upcoming COMP distribution change. A 3rd party, LongForWisdom, provides context and explains the governance paths. The post includes a forum poll with questions about policy actions, risk premium, and debt ceiling for USDC-A.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.313775510204082
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#2",
                    "likes": "2",
                    "time": "02/07/2020-18:16:36",
                    "content": "One thing to note, Show who voted  is disabled? Fixed ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "02/07/2020-18:19:45",
                    "content": "So I was testing it and now can’t remove my vote. Please disregard my vote on the debt ceiling poll. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#4",
                    "likes": "0",
                    "time": "02/07/2020-18:23:36",
                    "content": "To just add some context as to the possible governance paths here.  This is an emergency governance action that is taking place outside of the usual governance processes. Due to the limited time for action, this will not have an on-chain governance poll. If nothing catastrophic happens before Friday’s executive. Any changes coming out of this poll will be included in the regular executive on Friday. If something catastrophic happens before Friday, the current state of this poll may be used to inform the contents of emergency executives before Friday.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 4.863095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#5",
                    "likes": "1",
                    "time": "02/07/2020-18:34:32",
                    "content": "If you’re polling above 50M DC you might want to do some soul searching imo. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#7",
                    "likes": "0",
                    "time": "03/07/2020-10:11:17",
                    "content": "I’m voting for the most extreme parameters because we will sooner reach the point where we see that the problem must be solved in a different way. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.625
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-eth-a-stability-fee-and-debt-ceiling-adjustments/3059",
            "title": "[Signal Request] ETH-A Stability Fee and Debt Ceiling adjustments ",
            "index": 3059,
            "category": [
                "Governance"
            ],
            "tags": [
                "rates",
                "comp",
                "debt-ceiling",
                "emergency-response",
                "liquidity-mining",
                "eth-a"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/cyrus",
                    "index": "#1",
                    "likes": "6",
                    "time": "05/07/2020-11:00:32",
                    "content": "Hey all, based on Thursday’s governance call, we are putting up a signal request for adjustments to the ETH-A parameters in response to potential market impact due to the COMP distribution change. This is an emergency governance action that is taking place outside of the usual governance processes. Due to the limited time for action, this will not have an on-chain governance poll. This forum poll will be up for 24 hours and then an executive vote may be held tomorrow. Which of the following do you support as policy actions for governance?     No changes Increase Risk Premium, No Change to Debt Ceiling Increase Debt Ceiling, No Change to Risk Premium Increase both Risk Premium and Debt Ceiling     0 voters     What should the Risk Premium be for ETH-A?     No change 1% 2% 3% 4% 5%     0 voters     What should the Debt Ceiling be for ETH-A?     No change 150 million 160 million 170 million 180 million 190 million     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-99-thursday-july-2-9am-pst-4-00-pm-utc/2944/3",
                        "https://forum.makerdao.com/t/emergency-debt-ceiling-raises/3031/3"
                    ],
                    "GPT-summary": "The author of the post is requesting feedback on proposed adjustments to the ETH-A parameters in response to potential market impact due to the COMP distribution change. The post includes a forum poll with questions about policy actions for governance, the risk premium, and the debt ceiling for ETH-A. The post also mentions that this is an emergency governance action that is taking place outside of the usual governance processes. The post does not include any advertising or collaboration requests.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.439285714285715
                },
                {
                    "author_link": "https://forum.makerdao.com/u/hongbiao_li",
                    "index": "#3",
                    "likes": "0",
                    "time": "06/07/2020-01:51:44",
                    "content": "A high proportion of single assets will bring risks, not to mention the inherent volatility risk of ETH tokens, don’t forget 3.12. Increasing the risk premium of ETH is obviously correct. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.147619047619047
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#4",
                    "likes": "1",
                    "time": "06/07/2020-05:07:52",
                    "content": "@hongbiao_li I think MKR holders prefer ETH colateral over USDC, WBTC collateral. Now isn’t exactly the time to be raising rates on DAI from ETH which makes up 79% of the DAI supply currently. (With DAI being above the peg). If you think rates should go up, there’s always the base rate poll which will get pushed to executive on friday. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.3125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ultraschuppi",
                    "index": "#5",
                    "likes": "1",
                    "time": "06/07/2020-05:12:05",
                    "content": "What about not touching ETH-A at all and instead add ETH-B with a DC of 20-30M and a RP of >0? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#6",
                    "likes": "1",
                    "time": "06/07/2020-08:24:03",
                    "content": "It’s the limited time action because someone waited for the last moment to raise the issue. Why don’t we have the “What should the Debt Ceiling be for ETH-A?” onchain poll every week along with the base rate and risk premium polls? ETH-A is responsible for creating 78% of DAI and it should be treated differently from other collateral types like BAT regarding the DC.     cyrus:  Due to the limited time for action, this will not have an on-chain governance poll. This forum poll will be up for 24 hours and then an executive vote may be held tomorrow.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.603571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "06/07/2020-18:04:07",
                    "content": "An executive vote containing the winning parameter change (Debt Ceiling only, 140M to 160M) is now live on the governance portal. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0606060606060606
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "0",
                    "time": "07/07/2020-18:07:06",
                    "content": "This topic was automatically closed 24 hours after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "2454"
}