{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip48-streaming-payments-via-the-keg/6340",
            "title": "MIP48: Streaming Payments via the Keg ",
            "index": 6340,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "mips",
                "keg"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "6",
                    "time": "03/02/2021-16:54:47",
                    "content": "MIP48: Streaming Payments via the Keg Preamble MIP#: 48 Title: Streaming Payments via the Keg Author(s): Payton Rose @prose11, Sam MacPherson (@hexonaut) Contributors: @amyjung, @LongForWisdom, @Elihu Type: General Status: Formal Submission Date Proposed: 2021-02-03 Date Ratified: <yyyy-mm-dd>  Dependencies: Replaces:  References  MIP34: Keg Streaming Payments Module The Flapper MIP48c2 Subproposal: Setting Fixed Distributions via the Keg MIP48c3 Subproposal: Setting Variable Distributions via the Keg MIP48c4 Subproposal: Stopping Distributions from the Keg  Sentence Summary MIP48 describes how to utilize the Keg, a method of streaming DAI to various addresses, at a defined rate. Paragraph Summary MIP48 details what properties must be defined for Maker Governance to utilize the Keg, a tool for distributing DAI. The Keg allows Maker Governance to distribute DAI in “flights,” sets of addresses receiving funds over time at a fixed ratio. Both the Surplus Buffer and the Flapper (Surplus Auctions) may be used as funding sources for the Keg. Component Summary MIP48c1: Defining Components of the Keg Describes the Keg and the components necessary to utilize it. MIP48c2:Setting Fixed Distributions via the Keg Describes how Maker Governance can dictate payments from the Surplus Buffer through the Keg, by use of a MIP48c2 subproposal. MIP48c3:Setting Variable Distributions via the Keg Describes how Maker Governance can dictate variable payments by redirecting a percentage of DAI otherwise destined for the Flapper through the Keg, by use of a MIP48c3 subproposal. MIP48c4: Stopping Distributions from the Keg Describes how Maker Governance can stop or pause payments through the Keg, by use of a MIP48c4 subproposal. Motivation The Keg was created as a way for Maker Governance to stream payments to different wallet addresses. Currently, every allocation of DAI must be dictated by Governance casting a spell for a single distribution. Enabling the Keg will allow Governance to distribute DAI continuously for projects of ongoing importance to the Maker Protocol, rather than requiring initiatives to continually request DAI every Governance cycle. Additionally, the ability to utilize funds otherwise going to the Flapper (Surplus Auctions) allows Governance to designate DAI to programs as a percentage of surplus revenue. Thus, certain projects can be funded if and when there is a surplus to operational requirements for the Maker Protocol. Specification / Proposal Details MIP48c1: Defining Components of the Keg The Keg is a smart contract implementation that allows DAI to be streamed to different addresses. Utilizing the following parameters, the Keg is able to draw funds from the Surplus Buffer, or redirect funds otherwise going to the Flapper (Surplus Auctions), as dictated by Maker Governance. A flight is defined by the Keg as a set of addresses that will be streamed DAI and the ratio of DAI each address will receive, relative to the entire allocation. Each flight represents a stream of funds that will need to be allocated by Governance. The rate is a parameter that must be set to define how much DAI per second will be streamed to a specified flight from the Surplus Buffer. The rate parameter is only utilized when Governance wishes to direct DAI from the Surplus Buffer. The flow is a parameter that indicates the percentage of DAI otherwise destined for the Flapper to be redirected to a specific flight. Flow is only set for initiatives that wish to utilize the surplus DAI from operational expenses. These parameters can be utilized to allow Maker Governance to set continuous DAI distributions for any number of initiatives. Particular attention should be paid to the source of DAI for each flight approved by Governance, as DAI streaming from the Surplus Buffer will be constant, whereas DAI streaming from excess revenue will vary based on Protocol performance. MIP48c2: Setting Fixed Distributions via the Keg When an initiative desires a constant rate of streamed amount of DAI, the funding must be requested through Governance and would be drawn from the Surplus Buffer. A MIP48c2 subproposal must be submitted when setting a new flight or updating a current one. The proposal will be subject to the following parameters:  Feedback Period: 4 weeks Frozen Period: 2 weeks  MIP48c3: Setting Variable Distributions via the Keg When an initiative desires DAI to be streamed at a variable rate, based on excess revenue to operational expenses, the funding must be requested through Governance. A MIP48c3 subproposal must be submitted when setting a new flight or updating a current one. Due to contract limitations, only one stream may be taken from funds otherwise going to the Flapper. Backend work must be done to define and split the stream from the excess revenues into any Governance approved initiatives. As a result, MIP48c3 subproposals will require a longer feedback period:  Feedback Period: 6 weeks Frozen Period: 2 weeks  MIP48c4: Stopping Distributions from the Keg In some time-sensitive scenarios, the Governance Facilitators may deem a Signal Request appropriate for stopping or pausing payments from the Keg. For any scenario not deemed urgent by Governance Facilitators, a MIP48c4 Subproposal must be utilized to stop the streaming of DAI to a particular flight. The proposal will be subject to the following parameters:  Feedback Period: 4 weeks Frozen Period: 2 weeks  ",
                    "links": [
                        "https://docs.makerdao.com/smart-contract-modules/system-stabilizer-module/flap-detailed-documentation",
                        "https://github.com/makerdao/mips/blob/master/MIP48/MIP48c2%20Subproposal%20%5BTemplate%5D.md",
                        "https://github.com/makerdao/mips/blob/master/MIP48/MIP48c3%20Subproposal%20%5BTemplate%5D.md",
                        "https://github.com/makerdao/mips/blob/master/MIP48/MIP48c4%20Subproposal%20%5BTemplate%5D.md",
                        "https://github.com/makerdao/mips/blob/master/MIP48/MIP48c2%20Subproposal%20%5BTemplate%5D.md",
                        "https://github.com/makerdao/mips/blob/master/MIP48/MIP48c3%20Subproposal%20%5BTemplate%5D.md",
                        "https://github.com/makerdao/mips/blob/master/MIP48/MIP48c4%20Subproposal%20%5BTemplate%5D.md",
                        "https://forum.makerdao.com/t/maker-relay-ep-31-en-espanol/6455",
                        "https://forum.makerdao.com/t/weekly-mips-update-30/7083",
                        "https://forum.makerdao.com/t/maker-relay-ep-36-en-espanol/7053",
                        "https://forum.makerdao.com/t/maker-relay-ep-36/7039",
                        "https://forum.makerdao.com/t/weekly-mips-update-29/7000",
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949",
                        "https://forum.makerdao.com/t/maker-relay-ep-35/6932",
                        "https://forum.makerdao.com/t/maker-relay-ep-34-en-espanol/6815",
                        "https://forum.makerdao.com/t/maker-relay-ep-34/6802",
                        "https://forum.makerdao.com/t/weekly-mips-update-28/6791",
                        "https://forum.makerdao.com/t/maker-relay-ep-33-en-espanol/6729",
                        "https://forum.makerdao.com/t/maker-relay-ep-33/6694",
                        "https://forum.makerdao.com/t/weekly-mips-update-27/6649",
                        "https://forum.makerdao.com/t/maker-relay-ep-32-en-espanol/6600",
                        "https://forum.makerdao.com/t/maker-relay-ep-32/6596",
                        "https://forum.makerdao.com/t/maker-relay-ep-31/6450",
                        "https://forum.makerdao.com/t/know-your-mip-04-keg-streaming-payments-module-friday-february-5th-18-00-utc/6237",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/16",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-127-thursday-february-4-17-00-utc/6261/5",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-jan-31st-2021/6346/3",
                        "https://forum.makerdao.com/t/working-group-autonomous-makerdao-closed/8320",
                        "https://forum.makerdao.com/t/mip41c4-sp12-govalpha-facilitator-onboarding/7994",
                        "https://forum.makerdao.com/t/maker-relay-ep-37/7154",
                        "https://forum.makerdao.com/t/maker-relay-ep-37-en-espanol/7168"
                    ],
                    "GPT-summary": "MIP48 proposes the use of the Keg, a tool for distributing DAI to various addresses at a defined rate. The Keg allows Maker Governance to distribute DAI in \"flights,\" sets of addresses receiving funds over time at a fixed ratio. The proposal details the components necessary to utilize the Keg and how Maker Governance can dictate payments from the Surplus Buffer or redirect funds otherwise going to the Flapper. The proposal also outlines the process for setting fixed and variable distributions and stopping distributions from the Keg. The post does not include any advertising or collaboration requests.",
                    "GPT-proposal-categories": [
                        "Grants, Funding and resource allocation",
                        "Smart contract updates",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.366008991008991
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "3",
                    "time": "03/02/2021-20:19:26",
                    "content": "    prose11:  In some time-sensitive scenarios, the Governance Facilitators may deem a Signal Request appropriate for stopping or pausing payments from the Keg.   Could this also pertain to an urgency to stream payments? Gov Facilitator post a Signal Request which she or, he deems necessary/urgent. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-35-en-espanol/6949"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#3",
                    "likes": "0",
                    "time": "05/02/2021-16:36:18",
                    "content": "Hey Frank! Yeah so in general, I would imagine most emergency payments could be cast directly through the executive spell as they would most likely be one-time occurrences. But if there were a situation where maybe we rapidly needed to pay down the debt of something without wrecking the Surplus Buffer, then maybe it would make sense. There are undoubtedly scenarios we aren’t imagining, but the idea behind having that clause in the Stopping payments section and not starting is that many imaginable emergency scenarios involve stopping payments and many attack vectors revolve around starting them. But that might have been short-sighted of me, so I’m happy to hear the case for adding the ability to start urgent/emergency streams. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.997685185185185
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#4",
                    "likes": "1",
                    "time": "05/02/2021-16:37:37",
                    "content": "I wanted to tag @MakerMan here and see if this answers some of the questions posted on the technical MIP. We are also having a presentation in about 1.5 hours if you were still seeking clarity and were available! Otherwise happy to correspond here.     Know Your MIP #04: Keg Streaming Payments Module - Friday, February 5th 18:00 UTC Maker Improvement Proposals       What The Keg is a tool for streaming ERC20 DAI to a preset group of addresses. You may have heard or read it in reference to the FlapperDistributor and mechanism for Core Units budgets.  @prose11 will be going over the non-technical elements of Keg Payments MIP.   MIPX: Streaming Payments via the Keg @hexonaut will be explaining and going over the technical details of:   MIP34: Keg Streaming Payments Module  More discussions around the Keg:  FlapperDistributor: A Way to Distribute System Surplu…   ",
                    "links": [
                        "https://forum.makerdao.com/t/flapperdistributor-a-way-to-distribute-system-surplus-while-minimizing-governance/4591",
                        "https://forum.makerdao.com/t/mipx-streaming-payments-via-the-keg/6340",
                        "https://forum.makerdao.com/t/mip34-keg-streaming-payments-module/6013",
                        "https://forum.makerdao.com/t/flapperdistributor-a-way-to-distribute-system-surplus-while-minimizing-governance/4591"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.799999999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#5",
                    "likes": "1",
                    "time": "24/02/2021-15:06:44",
                    "content": "Minor Edits and Moving to Formal Submission for the March Governance Cycle This MIP required the following minor edits before submission:  Links to subproposals updated to redirect to the makerdao/mips Github Repo Typo fixed under Component Summary that incorrectly labeled the MIP48c4 Subproposal  With those fixes in place, this MIP is moved to formal submission for the March Governance Cycle. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.0
                }
            ]
        }
    ]
}