{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-incentivizing-mkr-voters-via-mip-26-dssgov-governance-contract-redesign/5176",
            "title": "[Informal Poll] Incentivizing MKR Voters via MIP 26 DssGov - Governance Contract Redesign ",
            "index": 5176,
            "category": [
                "Governance"
            ],
            "tags": [
                "signaling",
                "informal-poll"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#1",
                    "likes": "4",
                    "time": "16/11/2020-20:52:35",
                    "content": "This in an informal poll (not a signal request). The Maker Community needs to start discussing and deciding on how to build incentives into DssGov–For me personally, I am hopeful that more community members will come up with great ideas, and those ideas will be innovative. We cannot sit back and wait for the Maker Foundation to implement any type of incentives–hence, it is our Duty to make it happen. With that in mind, I want to get this topic to warm-up/get the ball rolling sort-of-speak. So, let’s do an informal poll on comments/opinions that I believe are good ideas on how to incentivize MKR Voters. This Poll is based on super awesome suggestions made by our community members. Again, we the Community need to hear you’re opinion, as well as your ideas. This will be helpful in getting the ball rolling. I hope to see more Polls like this one, we need to motivate and gauge the Community on implementing incentives in 2021. I believe we can ALL agree on that. Here are some topics/suggestions/comments that have been throwned around: Combine locking with voting incentives (so you earn money when you vote and have locked MKR)     Agree Disagree Abstain     0 voters     Use the Strategic Reserves to stack the cash during the year and distribute it only to MKR that are stacked on the gov contract. This can be in the form of MKR bought on the market.     Agree Disagree Abstain     0 voters     Use MIP13c3-SP3: Declaration of Intent - Strategic reserves fund (SRF) to incentivize for Eth Gas Transactions and there’s no need to payout MKR Voters     Agree Disagree Abstain     0 voters     When choosing the Type of incentive that the Maker Community should implement, what is more important, the Game Theory, or the Economic Theory?     Game theory (gamification) Economic design theory  (monetary reward) Both Abstain     0 voters     Do you believe incentives for MKR Voter can lead to abusive behaviour?     Agree Disagree Abstain     0 voters     If you believe incentives should include earning money–what currency should be used to payout MKR Voters:     DAI MKR ETH Abstain     0 voters     If you have ideas on how we can incentivize MKR Voters, please comment below and thank you for your participation!  I’ll keep this open for a couple of weeks. ",
                    "links": [],
                    "GPT-summary": "The author of the post is asking for feedback and ideas from the Maker Community on how to incentivize MKR Voters. The post includes an informal poll with suggestions made by community members and asks for opinions on different topics related to the implementation of incentives. The author encourages participation and comments from the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 6.148148148148148
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#2",
                    "likes": "0",
                    "time": "16/11/2020-21:54:04",
                    "content": "Punishments, not rewards, please. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "5",
                    "time": "16/11/2020-22:17:16",
                    "content": "Thanks for doing this @flipflopflapdelegate. I’m really happy/excited to see the community finally tackling these issues seriously. From my perspective the most important questions that we as a community must tackle are:   MKR Inflation vs Deflation (existing)   Having a locking function for extra reward / other incentives   Appeasing current MKR holders / whales to get this passed   Paying out in MKR vs DAI   Interaction with current system (FLAP)   Frequency and function of “payouts”   Interaction / integration with a delegate system   If we can answer, compromise, and find consensus on these issues I think incentives will align to create a much better tokenomic and productive system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.609848484848485
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#4",
                    "likes": "0",
                    "time": "16/11/2020-22:39:11",
                    "content": "What would you suggest? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#5",
                    "likes": "3",
                    "time": "16/11/2020-22:40:23",
                    "content": "My personal preference is MKR inflation on top of the voting contract. In this scenario, no voting MKR holder (which we’d like to be all MKR holders) is punished by inflation as everyone’s stake is proportionately maintained. If they don’t vote, they are diluted out of the system. Seems like a win/win…no? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#6",
                    "likes": "0",
                    "time": "16/11/2020-23:07:41",
                    "content": "My only concern with that is getting current free rider whales to go along with a system that dilutes them. How do you suggest/propose we pass a new system that punishes existing holders? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.670454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#7",
                    "likes": "2",
                    "time": "16/11/2020-23:09:39",
                    "content": "If they aren’t voting, how will they vote it down? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.222222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#8",
                    "likes": "0",
                    "time": "16/11/2020-23:11:10",
                    "content": "Good point…haha. I was thinking about the governance/forum work, not just voting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#9",
                    "likes": "1",
                    "time": "17/11/2020-03:46:25",
                    "content": "I am on board with MKR inflation for not voting and implementing vote delegation. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#10",
                    "likes": "5",
                    "time": "17/11/2020-06:26:42",
                    "content": "Downsides: taxes, no income for Maker EDIT: and downward pressure on the MKR price ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#11",
                    "likes": "2",
                    "time": "17/11/2020-11:15:59",
                    "content": "Thanks for this post. I voted. I have only one remark about this (I abstained):     flipflopflapdelegate:  Use MIP13c3-SP3: Declaration of Intent - Strategic reserves fund (SRF) to incentivize for Eth Gas Transactions and there’s no need to payout MKR Voters   Rather than subsidising Ethereum fees, I think it’s about time to start thinking/discussing on how to vote on L2 solutions. The following is an “example” of solution. It is not something that should be done urgently as opposed to the discussion being pushed in this thread, which needs to move fast(er). It is just an example to show what can be done with L2. It seems less wasteful than subsidising Ethereum fees. Example:   In order to vote you need to lock MKR for a period of ‘maturing’ time (say, 1h or 1day or 1week). This also prevents flash-loans attacks.   After the MKR has ‘matured’, it is possible to bridge it to xDAI-Network (only one Ethereum tx) and obtain “matured MKR on xDAI”.   Voting happens on the xDAI-Network with the bridged ‘matured MKR on xDai’ tokens. It is basically fee-less.   Whenever you want, you can get back your Ethereum MKR tokens using the Bridge.   Repeat.   REMARKS:  The bridge infrastructure already exists, and it has been audited (by xDAI developers and 3rd party auditors) MakerDAO is a validator of the Network. See other thread about this topic. Since the fees are negligible on xDAI, we could have some many other Governance things onchain compared to now. Including badges, daily SourceCred payments (as opposed to monthly, due to fees), etc. No need to say, the ‘gas’ token of xDAI-Network is DAI.  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "3rd party or author wants to collaborate on proposal"
                    ],
                    "Sentiment": 5.060897435897436
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#12",
                    "likes": "1",
                    "time": "17/11/2020-11:42:56",
                    "content": "Thank you for the post… My general sense is that to encourage voter turn-out… we can  Compensate voters Penalize non-voters Combination of the above.  To this, definitely lean toward the penalize non-voters camp. The “rich get richer” echos in my head. The whales of MKR rightfully control the system; however, if compensated, that “lead” will likely never change. Alternatively, penalizing a lack of voting participation can actually make sense in my view as those not in the voting contract are not participating in governance. However, this will cause other game theory impacts. E.g. If so many people move their MKR to the voting contract and just vote blindly to not be diluted. It does however also cause the MKR price to move is we remove liquidity to be put in the voting contract. Which to select and why? I believe the answer painfully is somewhat to do nothing. It is important, but this issue is somewhat secondary to the state of MakerDAO as a whole and the ever-present risk that the DAO is exposed to by stablecoins. We could spend months sorting out how to maximize the MKR voting game theory. In the end, if it doesn’t benefit the whales, it won’t pass. During this valuable window (in my eyes), we should focus all eyes on how to bring on collateral (of all types, farming, on-chain, off-chain). If DAI is truly on an exponential expansion path, we NEED to get collateral code red. Relying on ETH won’t get us there (and if it does that would be awesome… but I don’t think it would be prudent for the community to use hope as the strategy of choice). MIPs like the one @equivrel just submitted are precisely what is needed from the community as whole. We just need any all-hands to realize that collateral (a LOT OF IT) on-boarding is just essential for the project to be valuable (and by the project I also mean the MKR token itself). Granted, I know the onboarding has been prioritized and we do have a process. My point more than anything, is that spending our scarce resources (time) on voting theory should be secondary to identifying collateral on-boarding bottlenecks. The project depends on our ability to keep collateral growth ahead of DAI issuance (and ideally collateral with sustainable credit demand such that the protocol can be compensated for the associated risk. /fin ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#13",
                    "likes": "0",
                    "time": "17/11/2020-15:31:54",
                    "content": "    iammeeoh:  Rather than subsidising Ethereum fees, I think it’s about time to start thinking/discussing on how to vote on L2 solutions.   I like this idea. But it will probably have to be a Community lead effort. TBH, the new voting portal is really efficient. You can now do  1 to 15 polls for one Tx Fee. And at times (evenings, & nights) you can get it done for under 1 quid/70p/$0.75 – although some won’t even spend that much to vote.     mrabino1:  I believe the answer painfully is somewhat to do nothing. It is important, but this issue is somewhat secondary to the state of MakerDAO as a whole and the ever-present risk that the DAO is exposed to by stablecoins.   Painfully this might be the answer. For sure, first and foremost we need to focus on bringing more collateral, making DAI available to the masses, promoting DAI, keeping the Peg at Par, etc. One thing I do have to ask–and I don’t believe we have a Tax Attorney here–but, when we use the System Surplus to burn Maker (FLAP auctions) who incurs the tax liability? MKR holders? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.452651515151516
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mrabino1",
                    "index": "#14",
                    "likes": "2",
                    "time": "17/11/2020-15:37:45",
                    "content": "    flipflopflapdelegate:  when we use the System Surplus to burn Maker (FLAP auctions) who incurs the tax liability? MKR holders?   Not an atty… but there shouldnt be any… should be no different than a stock buy-back plan from a corporation… ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#15",
                    "likes": "1",
                    "time": "17/11/2020-18:57:16",
                    "content": "As someone that has used xDAI by trading USDT-BTC on PERP protocol, I completely agree that we should be moving in that direction. The user experience is fantastic and if Optimistic Ethereum or some other L2 solution comes out down the road, we can always pivot at that point by taking a snapshot of all account balances and porting them over. I think scaling needs to happen ASAP by onboarding more collateral, encouraging more voter engagement, and minimizing transaction fees using xDAI for the time being. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal"
                    ],
                    "Sentiment": 6.016203703703704
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#16",
                    "likes": "0",
                    "time": "24/11/2020-18:00:36",
                    "content": "I will be closing this Informal Poll after Turkey Day Thursday–if you have NOT voted, please do so–voice your opinion. Check out the informal poll–scroll  More than likely it seems the community would move quicker to Voter Delegation via MIP 26 (DssGov) instead of incentives when you lock and vote with your MKR, or other type of incentives that will be highly debatable. But, you are The Maker Community–please speak on it! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.71875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#17",
                    "likes": "1",
                    "time": "24/11/2020-19:16:19",
                    "content": "I initially voted Yes on the idea of dropping MKR to voters, but I have changed it to Abstain as I’m concerned about the potential tax consequences. I remain unsure how to best tackle this issue. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.666666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#18",
                    "likes": "0",
                    "time": "24/02/2021-01:16:20",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}