{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/executive-delay-2021-08-21/9970",
            "title": "Executive Delay - 2021-08-21 ",
            "index": 9970,
            "category": [
                "Updates"
            ],
            "tags": [
                "executive"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "16",
                    "time": "21/08/2021-14:26:59",
                    "content": "Hello everyone, Just wanted to throw up a quick post detailing why this week’s executive didn’t go up until this morning. The extra time was to ensure everything was functioning properly with the proposal and not the result of any intentional delay. The delay was caused by two main factors:  The team needed to wait for some Oracle updates before pushing the vote live, specifically dealing with the MATIC collateral that is being onboarded by this Exec After the all-clear, we hit a wall in our checklist with the “Onchain Effects” tab of the voting portal no longer having a functional API. This part of the process is a sanity check on the proposal, but more to allow voters to see what is changing via the code directly on the voting portal. The issue returning onchain effects can be observed here.  The compounding of delays pushed the executive process well into the night. In absence of having the onchain effects as a final check on the code, we decided to run tests against the code one more time. At that point, I decided the 10-hour delay (already well past typical working hours both in UTC and out here in the US) would have minimal impact on voting and give more time to surface any issues in the absence of an item on our checklist. The new executive can be found here or as usual at the top of the list in the “Executive” tab. Note: this means that two executives are currently active, which hasn’t happened for quite a while. Please make sure you are supporting the proposal you intend when voting. As usual, I’m open to field questions, comments, and concerns  ",
                    "links": [
                        "https://vote.makerdao.com/executive/template-executive-vote-vault-onboarding-6s-updates-and-reducing-vault-liquidation-ratios-august-20-2021?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2021-08-26/10034",
                        "https://forum.makerdao.com/t/forum-at-a-glance-august-20-26/10032"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.532114624505928
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bainpm",
                    "index": "#3",
                    "likes": "5",
                    "time": "24/08/2021-20:00:32",
                    "content": "Thanks for the write up @prose11, sorry about the executive delay. The DUX team has also added a post mortem here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#4",
                    "likes": "0",
                    "time": "07/09/2021-20:00:38",
                    "content": "This topic was automatically closed 14 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}