{
    "poll_list": [
        {
            "title": "Ratification Poll for Intangible Asset Assignment (MIP60) - February 14, 2022",
            "index": "10319",
            "option": "Yes",
            "supporting_mkr": "81,415",
            "highest_fraction": 1.0
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/mip60-intangible-asset-assignment/10319",
            "title": "MIP60: Intangible Asset Assignment ",
            "index": 10319,
            "category": [
                "Maker Improvement Proposals",
                "Archive"
            ],
            "tags": [
                "dai-foundation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "9",
                    "time": "14/09/2021-14:14:50",
                    "content": " MIP60: Intangible Asset Assignment  Preamble MIP#: 60 Title: Intangible Asset Assignment Author(s): @LongForWisdom Contributors: Seth Goldfarb (@seth) Tags: process, living Type: Process Status: Accepted Date Proposed: 2021-09-14 Date Ratified: 2022-02-28 Dependencies: MIP24, MIP41 Replaces: N/A   Ratification Poll: Forum URL: https://forum.makerdao.com/t/mip60-intangible-asset-assignment   References MIP60c3-ForumPost-Template.md MIP60c4-Subproposal-Template.md Public Records Google Sheet  Sentence Summary MIP60 sets processes for MakerDAO to determine which actors manage which Intangible Assets (such as web domains, GitHub repositories, and social media accounts).  Paragraph Summary MIP60 sets processes for MakerDAO to determine which actors manage which Intangible Assets (such as web domains, GitHub repositories, and social media accounts). These processes are designed to be as lightweight as possible, requiring intervention by Maker Governance only in the case of disagreement between actors over the management of Intangible Assets. Included is a set of requirements for actors to meet when management control changes, and links to the records detailing which actors manage which assets.  Component Summary MIP60c1: Definitions and Assumptions MIP60c1 defines actors and processes that take place under MIP60, along with assumptions that it requires to operate effectively. MIP60c2: Intangible Asset Records MIP60c2 defines the records of Intangible Assets owned by MakerDAO. MIP60c3: Agreed Modification of Management MIP60c3 defines the requirements for an agreed Modification of Management of one or more Intangible Assets owned by MakerDAO. MIP60c4: Contested Modification of Management MIP60c4 is a process component that allows authors to appeal to Maker Governance to resolve a contested modification of management of one or more Intangible Assets owned by MakerDAO.  Motivation The goal of MIP60 is to provide a lightweight and efficient mechanism for the Modification of Management of any Intangible Assets owned by MakerDAO. I have attempted to meet that goal by only requiring an on-chain vote in the event of disagreement between parties over which should have control of an Intangible Asset. A secondary motivation of MIP60 is to create a publicly accessible asset registry that lists the key information about Intangible Assets owned by MakerDAO.  Specification / Proposal Details  MIP60c1: Definitions and Assumptions The following definitions are used within MIP60 to describe the processes and actors involved in the control and assignment of Intangible Assets.  Processes Agreed Modification of Management: An uncontested and mutually agreed-upon transfer of management control of an Intangible Asset owned by MakerDAO. A subproposal is not required for an agreed Modification of Management. Contested Modification of Management: A subproposal that enables the resolution of a contested transfer of management control of an Intangible Asset by appealing to Maker Governance.  Actors Asset Owner: An individual or organization that retains control of an asset on behalf of MakerDAO. An Asset Owner has the power to forcibly revoke access and control of an Intangible Asset from a Content Manager. An Asset Owner has the power to forcibly revoke access and control of a digital asset from a Platform Manager when the platform is not managed outside of the control of MakerDAO (Twitter, GitHub, etc.) The Dai Foundation is an example of an Asset Owner. Content Manager: An individual or organization that has been granted access to manage the content of an asset held by an Asset Owner. For example, controlling the content of a web domain, or creating posts on a social media account. Platform Manager: An individual or organization that runs the technical infrastructure that serves content to an asset held by an Asset Owner. This individual or entity may be outside MakerDAO’s direct control. For example, an individual or organization hosting the webserver that serves content on a given domain is a platform manager. As another example, a centralized organization such as Twitter or GitHub that manages a publicly available content platform is a Platform Manager.  Assumptions The following assumptions are made regarding control and ownership of Intangible Assets within MakerDAO for this MIP to be effectively used to manage the access of digital assets. Assumption #1: MIP60 assumes that some Asset Owner exists for the assets managed using this MIP. At the time of writing this MIP, the Asset Owner for many of MakerDAO’s Intangible Assets is the DAI Foundation. Assumption #2: MIP60 assumes that actors under the umbrella of MakerDAO usually have positive relationships with one another and can come to mutually satisfactory resolutions in the majority of situations that require a modification to the Content Managers or Platform Managers of an Intangible Asset. Assumption #3: MIP60 assumes that there are sufficient Core Unit Facilitators to meet the transparency requirements defined in MIP60c3.  MIP60c2: Intangible Asset Records The canonical Intangible Asset records will be maintained in the Dai Foundation Asset Registry github repository. The records will be stored in an appropriate open-source file format. It is the responsibility of the Asset Owner to ensure that changes to the canonical Intangible Asset record for an owned asset are accompanied by a relevant and specific commit-message explaining why the change took place. For convenience, a publicly accessible google sheet will be maintained in parallel to the canonical records. The canonical records will be maintained for each asset by the Asset Owner or an agent employed on their behalf. The google sheet can be found here. For each intangible asset, the records must contain the following information:  The asset type The asset owner The platform manager The content manager The purpose of the asset The last modification date A link to the last modification documentation   MIP60c3: Agreed Modification of Management In order for a Modification of Management to be valid under this component, it must meet the following requirements. In the event an asset has not yet been ‘claimed’ by any entity, the new managing entities must still follow the requirements listed in this component. Transparency An agreed modification of control must be made publicly accessible to Maker Governance using the MakerDAO discourse forum. It must remain publicly accessible for at least one week before being considered valid and actioned by the relevant Asset Owner. The agreed Modification of Management must use the template located at MIP60c3-ForumPost-Template.md. Well Defined An agreed Modification of Management must include a listed purpose for the asset and reasoning for why the change in management is desirable. Additionally, the new managers must provide a public contact address (email) and commit to responding promptly to contact requests from lawful authorities and mandated actors. Recordable An agreed Modification of Management must include the required information such that the Intangible Asset records can be updated. Supported An agreed Modification of Management must be publicly supported by at least three Core Unit Facilitators as defined in MIP41. In the case that an Intangible Asset is currently managed by one or more actors, the managing actor(s) must support the Modification of Management in order for it to be valid under this component. Uncontested An agreed Modification of Management can be contested by the following actors:  Any Core Unit Facilitators as defined in MIP41. Maker Governance. Maker Governance can use MIP24c4 to express contention quickly. Any of the current managers (content or platform) of the Intangible Asset.  If an agreed Modification of Management becomes contested, it is no longer valid, and the author must submit a Contested Modification of Management subproposal before any actions are taken.  MIP60c4: Contested Modification of Management MIP60c4 is a Process MIP component that allows for the resolution of contested control over an Intangible Asset by appealing to Maker Governance. A Contested Modification of Management must also meet the same requirements as an agreed Modification of Management, with the exception of the ‘Uncontested’ and ‘Supported’ headings. If a subproposal under MIP60c4 passes successfully, then the listed Modification of Management should be made by the Asset Owner of that Intangible Asset. MIP60c4 subproposals have the following parameters:   Feedback Period: 4 full weeks  Frozen Period: 1 full week  MIP60c4 subproposals must use the template located at MIP60c4-Subproposal-Template.md. This template is considered ratified if this MIP moves to Accepted status.  ",
                    "links": [
                        "https://github.com/makerdao/mips/blob/master/MIP60/MIP60c4-Subproposal-Template.md",
                        "https://docs.google.com/spreadsheets/d/1tW2FeaseSb4ExjRajbes9WURrIc416K6kIcrPc5l1zQ/edit#gid=0",
                        "https://github.com/makerdao/asset-registry",
                        "https://docs.google.com/spreadsheets/d/1tW2FeaseSb4ExjRajbes9WURrIc416K6kIcrPc5l1zQ/edit#gid=0",
                        "https://github.com/makerdao/mips/blob/master/MIP60/MIP60c4-Subproposal-Template.md",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2021-11-15/11646",
                        "https://forum.makerdao.com/t/gauntlet-delegate-platform/9675/16",
                        "https://forum.makerdao.com/t/monthly-governance-review-february-2022/13661",
                        "https://forum.makerdao.com/t/schuppi-delegate-platform/11193/36",
                        "https://forum.makerdao.com/t/relay-semanal-15-21-de-febrero-del-2022/13404",
                        "https://forum.makerdao.com/t/weekly-relay-february-15-21-2022/13348",
                        "https://forum.makerdao.com/t/gfx-labs-delegate-platform/11556/19",
                        "https://forum.makerdao.com/t/encuestas-de-la-semana-14-de-febrero-de-2022/13265",
                        "https://forum.makerdao.com/t/relay-semanal-8-14-de-febrero-de-2022/13294",
                        "https://forum.makerdao.com/t/weekly-relay-february-8-14-2022/13239",
                        "https://forum.makerdao.com/t/weekly-mips-update-73/13092",
                        "https://forum.makerdao.com/t/mip39c2-sp29-adding-techops-core-unit-tech-001/12070",
                        "https://forum.makerdao.com/t/weekly-mips-update-68/12460",
                        "https://forum.makerdao.com/t/weekly-mips-update-67/12387",
                        "https://forum.makerdao.com/t/weekly-mips-update-66/12190",
                        "https://forum.makerdao.com/t/daif-cu-update-q4-2021/11736",
                        "https://forum.makerdao.com/t/growth-cu-weekly-update-october-29-november-4/11438/3",
                        "https://forum.makerdao.com/t/weekly-mips-update-60/11347",
                        "https://forum.makerdao.com/t/weekly-mips-update-59/11186",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076",
                        "https://forum.makerdao.com/t/weekly-mips-update-58/11074",
                        "https://forum.makerdao.com/t/weekly-mips-update-57/10921",
                        "https://forum.makerdao.com/t/weekly-mips-update-56/10691",
                        "https://forum.makerdao.com/t/weekly-mips-update-55/10539",
                        "https://forum.makerdao.com/t/maker-relay-ep-63-en-espanol/10443",
                        "https://forum.makerdao.com/t/maker-relay-ep-63/10400",
                        "https://forum.makerdao.com/t/weekly-mips-update-54/10398",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2021-09-16/10349",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-10th-16th/10344",
                        "https://forum.makerdao.com/t/interim-intangible-asset-assignment/10320",
                        "https://forum.makerdao.com/t/content-production-bi-weekly-update-update-9-2-9-15/10353",
                        "https://forum.makerdao.com/t/daif-cu-update-q3-2022/18211",
                        "https://forum.makerdao.com/t/makerdao-network-has-now-been-transferred-to-dai-foundation/17257",
                        "https://forum.makerdao.com/t/daif-cu-update-q2-2022/16403",
                        "https://forum.makerdao.com/t/forum-at-a-glance-may-19-25-2022/15397",
                        "https://forum.makerdao.com/t/classification-and-cleanup-of-the-makerdao-github-request-for-comments/15306",
                        "https://forum.makerdao.com/t/asset-change-request-process/14956",
                        "https://forum.makerdao.com/t/daif-cu-update-q1-2022/14486"
                    ],
                    "GPT-summary": "MIP60 proposes processes for MakerDAO to determine which actors manage which Intangible Assets. The proposal aims to provide a lightweight and efficient mechanism for the Modification of Management of any Intangible Assets owned by MakerDAO. The proposal defines actors and processes that take place under MIP60, along with assumptions that it requires to operate effectively. The proposal also includes a set of requirements for actors to meet when management control changes, and links to the records detailing which actors manage which assets. The proposal is open for feedback, questions, and constructive criticism.",
                    "GPT-proposal-categories": [
                        "Community and engagement",
                        "Not a proposal",
                        "None",
                        "None",
                        "None"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.715686274509803
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#2",
                    "likes": "1",
                    "time": "02/02/2022-17:03:55",
                    "content": "Note, I just made some minor updates to this, mainly around how we record the records for the intangible assets. You can see the diff here. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.291666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "5",
                    "time": "08/02/2022-15:04:18",
                    "content": "I would like to move this proposal to formal submission. We are still missing the setup of the interim-asset-records repository. @dumitru will be working on this shortly, but I don’t believe that the lack is a good reason to delay this MIP for another month. Once the repository is setup, we will update the MIP to point to it. @MIP-Editors ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.833333333333334
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/interim-intangible-asset-assignment/10320",
            "title": "Interim Intangible Asset Assignment ",
            "index": 10320,
            "category": [
                "Governance"
            ],
            "tags": [
                "dai-foundation",
                "mips",
                "discussion",
                "intangible-asset"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#1",
                    "likes": "5",
                    "time": "14/09/2021-14:31:48",
                    "content": "As some may be aware, the DAI Foundation is now in a position to manage ownership of ‘Intangible Assets’ belonging to the Maker Protocol. Over the last little while, myself and @seth have been working on a MIP, which is now on the forum here: MIP60: Intangible Asset Assignment. Our hope is that governance can agree on a process to set who has management permissions for content and platforms that are ‘DAO official.’ The MIP above is a possible solution to that problem. In the meantime, assets still need to be managed and several groups have requested access to various things already. In the interim period while this MIP is in RFC, the DAI Foundation have agreed to follow my judgement in terms of which requests are valid and relevant. This is strictly only in the interim until governance can vote on a better process. Given that we’d been working on the MIP already, it makes the most sense to us to dog-food the process described in the MIP. So with that in mind, the interim process for requesting management access to an intangible asset is as follows:  Fill in the following template and post it on this forum (an abbreviated version of the template laid out in the MIP.)  Intangible Asset Agreed Modification of Management - YYYY-MM-DD  Action Date - YYYY-MM-DD (post date + 1 week)  Asset(s)  List the modified assets and managers using the following template:   asset name  Asset Type: <subdomain/twitter/etc> Asset Owner: <DAI Foundation/etc> Platform Manager: <core-unit/individual/etc + contact email>) Content Manager: <core-unit/individual/etc>+ contact email>) Purpose: <purpose (short)> Last Modification:    Supporters  List three supporting Core Unit Facilitators. Tag them using @. (this should go without saying, but speak to them ahead of time.)  One of them must be @LongForWisdom (given the interim requirements). @seth and @juan have also volunteered to help with the interim process, so unless you have a good reason to the contrary, this should be the three facilitators.  Reason for Modification  Why are these changes taking place?   Management changes may be contested as laid out in MIPX. Any contested changes will not be actioned prior to MIPX passing. Note that this means that no contested changes will take place until governance has agreed on a process for handling them. Please think carefully before formally contesting a change!  More detail and explanation of these processes can be found in MIPX. I’m also here to answer any questions and clarify the process. Any comments or suggestions on the MIP are also welcome, we’d like to make it as lightweight as possible while still ensuring it is robust and gives governance input into asset management. ",
                    "links": [
                        "https://forum.makerdao.com/t/mipx-intangible-asset-assignment/10319",
                        "https://forum.makerdao.com/t/growth-cu-weekly-update-october-29-november-4/11438/4",
                        "https://forum.makerdao.com/t/daif-cu-update-q4-2021/11736",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-01-03/12457",
                        "https://forum.makerdao.com/t/forum-at-a-glance-november-11-18/11713",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2021-11-15/11646",
                        "https://forum.makerdao.com/t/govalpha-weekly-update-2021-09-16/10349",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-10th-16th/10344",
                        "https://forum.makerdao.com/t/forum-at-a-glance-jan-27-feb-3-2022/13019",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-02-02/12995",
                        "https://forum.makerdao.com/t/intangible-asset-agreed-modification-of-management-2022-02-01/12980/2"
                    ],
                    "GPT-summary": "The author of the post explains the MIP60 proposal for managing ownership of intangible assets belonging to the Maker Protocol. The post also provides an interim process for requesting management access to an intangible asset until governance can vote on a better process. The author welcomes comments and suggestions on the MIP and is available to answer any questions.",
                    "GPT-proposal-categories": [
                        "Change to proposal pipeline",
                        "Community and engagement",
                        "Board composition",
                        "Grants, Funding and resource allocation",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.838068181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "14/12/2021-20:32:28",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-63-en-espanol/10443"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "100"
}