{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/dux-core-unit-update-december-16th/12267",
            "title": "DUX Core Unit Update - December 16th ",
            "index": 12267,
            "category": [
                "Core Units",
                "Development & UX"
            ],
            "tags": [
                "cu-update",
                "dux-001"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/bainpm",
                    "index": "#1",
                    "likes": "4",
                    "time": "17/12/2021-16:40:30",
                    "content": " DUX Core Unit Update - December 16th The DUX team has had a very productive month, here is a recap of what we have been up to recently.  Governance Portal Releases We’ve continued our cadence of bi-weekly product releases, and the the last month has seen quite a few new additions to the Governance Portal. A few of our more notable releases were:   November 23rd - including ENS address resolving, and a quick-view of participation stats on the polling cards.   December 6th - including a visual breakdown of delegators on the delegate profile page, and improved filtering and sorting on the delegates UI.   December 16th - including poll vote comments.    Budget MIP Upgrade This month we made a modification to our budget MIP with the help of SES, to onboard their new budgeting workflow. You can read the MIP here. This update replaces our initial budget, MIP40c3-SP26, aligning it with the new auditor setup and enabling DssVest for streaming payments to the auditor wallet.  Roadmap Spotlight Presentation Early next year we’ll host a Roadmap Spotlight presentation in which we’ll look back on our work these past three months and also the prioritized themes for the first quarter of 2022 and some team updates. We’re looking forward to the next year since we have some exciting roadmap work and larger Maker-wide initiatives planned. Stay tuned for more info on the DUX Roadmap Spotlight presentation!  Forum Activity   The Governance Portal experienced some brief downtime due to a regression introduced in a recent update. After triaging the issue, we created a post-mortem outlining what happened and mitigation steps.   In alignment with our mandate to improve the user experience around governance, our very own @0xdeniz  has provided his thoughts addressing governance participation, and posted this in the forum, which can be read here.    Holiday Time-Off Our team will be off from December 20th to January 2nd, we’ll be back to work on Monday January 3rd. Fear not, we’ll have two team members on-call each day of the holiday break in case any issues arise.  Thank You! The past six months since we formed our team has been a wild and exciting time. We are grateful to be part of the amazing MakerDAO community, and look forward to continuing to improve the governance user experience in 2022. On behalf of the DUX team, we wish you the best and hope you have a happy new year! ",
                    "links": [
                        "https://www.notion.so/Governance-Portal-Release-v0-2-5-December-6th-4a43b0e820a446debd7c8878f5056ae0",
                        "https://www.notion.so/Governance-Portal-Release-v0-2-6-December-16th-b46dbc9a727643a69466e7d7d7016e53",
                        "https://forum.makerdao.com/t/mip40c3-sp52-development-ux-core-unit-budget-dux-001/12085",
                        "https://forum.makerdao.com/t/mip40c3-sp26-development-ux-core-unit-budget-dux-001/9774",
                        "https://forum.makerdao.com/t/nov29-21-post-mortem-impaired-poll-voting-on-governance-portal/11884",
                        "https://forum.makerdao.com/t/improving-governance-participation-rate-at-makerdao/11706",
                        "https://forum.makerdao.com/t/monthly-core-unit-updates-december-2021/12692"
                    ],
                    "GPT-summary": "The post is an update from the DUX team about their recent activities, including bi-weekly product releases, modifications to their budget MIP, and plans for a roadmap spotlight presentation. The post also mentions a brief downtime of the Governance Portal and the team's holiday time-off. The post explains the team's progress and plans, and provides an opportunity for readers to ask questions or provide feedback.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.866154791154791
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "17/03/2022-16:41:16",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}