{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/signal-request-add-eth-b-vault/3349",
            "title": "Signal Request: Add ETH-B Vault ",
            "index": 3349,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "eth-b"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#1",
                    "likes": "7",
                    "time": "25/07/2020-01:20:09",
                    "content": "Overview Due to current market conditions, the DAI peg is still trending upwards, debt ceilings are being hit on the regular, and yet we still can’t find enough collateral to satiate DAI demand, all while capturing little value to insure the system against future unforeseen downturn events. Many community members have made it clear that we are playing a risky game by allowing the Maker protocol to take on this much risk while not making sure to backstop the system. Therefore I propose the creation of a new ETH vault option (ETH-B) to begin collecting a risk premium to be added to Maker surplus as well as giving us the ability to test different system parameters. Since we don’t want to rock the boat on current vault holders by raising the risk premium and possibly hampering DAI creation, I think that by creating ETH-B we can keep ETH-A at 0% and halt further DC raises, while simultaneously adjusting ETH-B liquidation ratio, debt ceiling, and risk premium. This would also give us the benefit of A/B testing different parameters to see what works best and adds an additional tool to our arsenal. Pros:  Allows MakerDAO to begin collecting risk premium from ETH vaults to insure the system Allows MakerDAO to test different parameters to see what works (A/B testing)  Cons:  Vault users may choose not to mint more DAI if stability fees are higher Lower Liquidation Ratios may put more risk on the system in the event of another liquidation event Removes DAI liquidity from the market if risk premium is too high  Should we add ETH-B as a vault option?     Yes No Abstain     0 voters     What starting Liquidation Ratio should ETH-B have?     150% 145% 140% Let Risk Team decide Abstain     0 voters     What starting Risk Premium should ETH-B have?     .25% .50% 1% 2% More than 2% Let Risk Team decide Abstain     0 voters     What starting Debt Ceiling should ETH-B have?     10 Million 20 Million 30 Million 40 Million 50 Million Let Risk Team decide Abstain     0 voters     These polls will run until Friday, July 31st, 12pm EDT. If consensus is reached I will push for it to be added to the following Monday’s on chain governance poll. If you can think of any other pros/cons I will be sure to add them to the overview. Looking forward to hearing the communities thoughts on the matter! Edit: Poll extended until Wednesday, August 5th in order to give facilitators time to review. ",
                    "links": [
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-104-thursday-august-6-4-00-pm-utc/3469/2",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-103-thursday-july-30-4-00-pm-utc/3318/2",
                        "https://forum.makerdao.com/t/stability-fees-should-always-be-above-0/3337/17"
                    ],
                    "GPT-summary": "The author proposes the creation of a new ETH vault option (ETH-B) to begin collecting a risk premium to be added to Maker surplus as well as giving us the ability to test different system parameters. The post includes polls to gather feedback on the proposed starting liquidation ratio, risk premium, and debt ceiling for ETH-B. The author also invites the community to provide additional pros and cons.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "None"
                    ],
                    "Sentiment": 5.688977272727272
                },
                {
                    "author_link": "https://forum.makerdao.com/u/OneBiteLawnOrder",
                    "index": "#2",
                    "likes": "1",
                    "time": "25/07/2020-02:21:38",
                    "content": "I like the idea of an ETH-B vault option but I would like to see it tailored as more of an “overflow” option. I would like to see perhaps very marginally lower CR and higher SF but I don’t think it should replace the DC raises on ETH-A. The function it could serve is to give users the ability to mint DAI against ETH in the time between when the ETH-A DC is hit and the next executive is executed to raise the ETH-A DC. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#3",
                    "likes": "1",
                    "time": "25/07/2020-02:23:30",
                    "content": "Thats ok. That part of the post was more of a possibility rather than a concrete function of the ETH-B option. It can be whatever the community wants it to be! Thats a great way of thinking about it, overflow. First come first serve to the cheaper option and then if people want to take on more risk we have other options for them to do so which allows us to capitalize on different user behaviour while still insuring the system. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.5375000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#4",
                    "likes": "0",
                    "time": "25/07/2020-06:43:05",
                    "content": "It doesn’t make sense to me. We could go all the way to ETH-Z, but why? We can just set the ETH-A DC to 500M and lower the LR. It’s like offering 2 same items in the store with different prices. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#5",
                    "likes": "0",
                    "time": "25/07/2020-09:18:42",
                    "content": "    bit:  It’s like offering 2 same items in the store with different prices.   This is precisely the intention. Offering multiple Vault variants opens up choice for Vault owners and more profit/less risk for Maker. Win-win. Especially when opening up for fiat assets or accounts payable financing like DROP I think the multiple Vault solution is a much better one. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#6",
                    "likes": "0",
                    "time": "25/07/2020-10:24:07",
                    "content": "On a procedural note, I will make the point that new collateral types should be onboarded through the MIPs process unless we’re in an emergency situation. This is a slightly different situation than the other signal, however as it’s a new version of an existing collateral type. I’m still not thrilled about having it happen through the weekly cycle, though. If this signal succeeds, we would have to start talking to the domain teams and figuring out how to fit ETH-B into their current on-boarding plans. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.592329545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#7",
                    "likes": "0",
                    "time": "25/07/2020-11:28:27",
                    "content": "Sure, let’s offer them also ETH-C with some free MKR tokens, ETH-D with PoolTogether-like lottery etc.  My point is that we are just adding complexity hoping we can fix the peg while doing pretty much the same thing that failed to fix the peg in the past. We need an approach that has never been tried before in MakerDAO. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.428571428571428
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#8",
                    "likes": "0",
                    "time": "25/07/2020-12:48:09",
                    "content": "Thanks for your input. What do you suggest? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#9",
                    "likes": "0",
                    "time": "25/07/2020-13:10:17",
                    "content": "Do we have a process for B vaults currently? Are they considered new collateral? Maybe we need to amend MIP6? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.340909090909091
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#10",
                    "likes": "0",
                    "time": "25/07/2020-17:21:47",
                    "content": "There is no process for them specifically, no. The USDC-B Vault was onboarded using the weekly cycle, but I’m pretty sure that was only because the MIPs onboarding process wasn’t very operational at the time. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving information about onboarding process"
                    ],
                    "Sentiment": 6.1875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#11",
                    "likes": "0",
                    "time": "26/07/2020-07:00:12",
                    "content": "Pause ETH liquidations. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#12",
                    "likes": "3",
                    "time": "26/07/2020-12:05:09",
                    "content": "That is way too risky. What if there’s a flash crash while liquidations are off and we can’t recoup any funds. The whole system is screwed then. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#13",
                    "likes": "0",
                    "time": "26/07/2020-12:35:19",
                    "content": "It will recover in a few weeks, just like after the black Thursday. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.083333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#14",
                    "likes": "3",
                    "time": "26/07/2020-12:57:48",
                    "content": "Sure, until it doesn’t like in 2018. It’s risky. It might recover, it might not recover. That’s why we have liquidations, because we want to reduce that high-downside gamble (holding and hoping it bounces back) with something that is more predictable (liquidations.) ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#15",
                    "likes": "0",
                    "time": "26/07/2020-16:58:52",
                    "content": "This idea seems sort of out there, but also very interesting. What if we created an ETH-B vault type with 0% risk premium and very high liquidation ratio e.g. 400-500% but no liquidations? Sort of similar to the SNX no-liquidation model. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.43
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#16",
                    "likes": "0",
                    "time": "26/07/2020-17:00:03",
                    "content": "If there are no liquidations what facilitates people from keeping their CR above 400%? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/monet-supply",
                    "index": "#17",
                    "likes": "0",
                    "time": "26/07/2020-17:05:50",
                    "content": "It could be enforced as a limit on new borrowing (as well as withdrawing collateral), but no other incentives to keep the LR up beyond that. Starting at an LR as low as 400%, the vault would remain solvent as long as ETH doesn’t decline by 75% or more. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.540719696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#18",
                    "likes": "0",
                    "time": "26/07/2020-17:51:28",
                    "content": "We have no choice. Either that or other equally risky/“unpopular” solutions if we want to keep the DAI price under control. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.6875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#19",
                    "likes": "0",
                    "time": "26/07/2020-19:31:53",
                    "content": "And if it were to fall below 75%? We would not be able to change the rules and liquidate, unless we don’t care about reputation. In that scenario we would have to absorb the loss without any stability fee to offset it. If there were no liquidations I would include a stability fee to offset the risk and increase to 500% the CR on a tight DC, depending on the evolution of eth price change the CR of the marginal loans to cover ourselves of eth price spikes. Also from a user perspective probably it would be a conservative way for a user to go long on eth or use the dai as an actual loan rather than deposit it in another defi dapp for yield farming. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.339285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/bit",
                    "index": "#20",
                    "likes": "0",
                    "time": "26/07/2020-19:59:50",
                    "content": "You are overcomplicating. Do not liquidate ETH until: a) DAI<$1 or b) ETH>$500 The LR can stay the same (150%) when opening a vault. We might even charge a small SF (1%), but we must not be greedy to profit before we have a stable coin. Nothing terrible is going to happen if DAI is not backed by 1 USD at all times. Something terrible will happen if DAI>$1 for more than 6 months (loss of trust, another stablecoin becoming #1…). I don’t pretend it is a permanent solution. It might take us to $1B in MCap which will bring more stability, but we need other methods to stimulate minting, arbitrage and voting. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 4.421875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/smaugho",
                    "index": "#21",
                    "likes": "1",
                    "time": "27/07/2020-17:56:58",
                    "content": "Would it be possible to create the ETH-B before raising further the debt ceiling for ETH-A?, or its implementation time would take longer? It would be very good if we place an ETH-B vault and do “an experiment” with 1% risk premium (or what the Risk team decides of course), before raising further ETH-A debt ceiling (or having to add a risk premium to ETH-A right now). . ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.195714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#22",
                    "likes": "3",
                    "time": "27/07/2020-18:00:46",
                    "content": "At this point in time I think rolling out ETH-B would be too slow as we need the DC raised right now. Unless Cyrus took the lead on greenlighting that implementation right now, we’re gonna have to wait a bit. I like that idea for the future though and is kind of what I was thinking in this proposal. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.871428571428572
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#23",
                    "likes": "3",
                    "time": "29/07/2020-12:35:06",
                    "content": "    Aaron_Bartsch:  These polls will run until Friday, July 31st, 12pm EDT. If consensus is reached I will push for it to be added to the following Monday’s on chain governance poll.   I should have mentioned this earlier, but recently I’ve been enforcing that any on-chain polls that want to go in on Monday need to have a PR submitted to the community github by end of day on the prior Wednesday. This requirement is documented in the practical guide. The reason for this is that it gives the facilitator(s) time to review the poll wording, and suggest any changes on Thursday, before the poll can be submitted on Friday to start on Monday. It also means that the facilitators don’t need to submit polls during the weekend. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-6/3517"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#24",
                    "likes": "1",
                    "time": "29/07/2020-13:17:24",
                    "content": "You’re right. I did that with the other signal request but based on when I posted this one I didn’t want to have to wait an additional week to add ETH-B. My personal bias for wanting this collateral expedited the governance process. I will extend the poll until the following Wednesday. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.200892857142857
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#25",
                    "likes": "0",
                    "time": "05/08/2020-12:52:03",
                    "content": "Just a friendly reminder that poll wording should be submitted on the community github here https://github.com/makerdao/community/tree/master/governance/polls by end of day. Please tag me as a reviewer on the PR. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#26",
                    "likes": "5",
                    "time": "06/08/2020-01:01:29",
                    "content": "These polls have now closed. The community has signalled support for the creation of an ETH-B vault with parameters determined by @cyrus and the risk team. I will be in contact with him for next steps. Thank you all for participating! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#27",
                    "likes": "0",
                    "time": "13/08/2020-01:01:33",
                    "content": "This topic was automatically closed 7 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}