{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/urgent-signal-request-set-aave-d3m-bar-to-0/15800",
            "title": "URGENT: Signal Request Set Aave D3M bar to 0% ",
            "index": 15800,
            "category": [
                "Governance",
                "Signal Archive"
            ],
            "tags": [
                "signaling",
                "sig-status-accepted",
                "d3m",
                "impact-:-high"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "11",
                    "time": "14/06/2022-19:57:06",
                    "content": " [Urgent Signal Request] Set Aave D3M bar to 0%  Overview As a result of this post from @Primoz, Risk Core Unit (RISK-001) Facilitator, GovAlpha is submitting an urgent Signal Request as detailed in MIP24c4. This Signal Request asks Maker Governance if the Aave D3M bar should be set to 0. Setting the bar to 0 makes the target supply 0 as an added check on the D3M implementation. It is possible to set the bar to 0 using a MOM, this will bypass the GSM Pause Delay and allow any change to take effect on the execution of an Executive Vote. As it is an urgent Signal Request, it will last for 24 hours, and if successful, it will be followed by an expedited Executive Vote, which will contain only this proposal.  Rationale    [Signal Request] Set the AAVE D3M DC to 0 (Zero)   After today’s proposal by Gauntlet  our team believes Maker should disable D3M for the time being. The proposed 90% liquidation threshold is a risky move, even though there’s some rationale behind the proposal. The reason we believe this is risky is because out of 200m DAI borrowed on Aave Ethereum v2, 100m DAI is being borrowed by Celsius and collateralized mostly by stETH. Although the 90% liquidation threshold can have some benefits against stETH/ETH depeg, it presents a high risk for users borrowing stablecoins collateralized by stETH, especially when knowing Celsius is under stress right now.  This Aave governance proposal hasn’t passed yet and there is a possibility that it won’t since part of the community objected to the proposal. That said, we believe that Maker should proceed with caution in this case, especially now when already the low revenue (1.40% APY) from this exposure doesn’t offset the potential tail risks. Depending on the developments in coming weeks, @Risk-Core-Unit will present their view on the situation at the next MOMC meeting in about 2 weeks (and potentially suggesting to enable D3M back on).    Pros  Protects the Surplus Buffer and Maker holders by reducing the risk posed by the Aave D3M.   Cons  Turns off the Aave D3M leading to reduced revenue for Maker     Should we set the Aave D3M bar to 0%?  Yes No Abstain     0 voters      Next Steps This Signal Request will run for 24 hours until Wednesday, June 15th at 20:00 UTC. If a majority of non-abstaining voters vote in favour, this will proceed to an expedited Executive Vote as soon as possible, GovAlpha and Protocol Engineering’s schedules allowing (likely ready on Wednesday, June 15th). This will be outside the usual Executive Vote cadence, as permitted in MIP24 and MIP41. If there is a positive outcome to this Urgent Signal Request, it will override the ongoing Signal Request here, which will be cancelled.  Resources Further information on the Aave D3M and the bar parameter can be found here.  cc: @Risk-Core-Unit @Protocol-Engineering @GovAlpha-Core-Unit @Recognized-Delegates @gov-comms-core-unit ",
                    "links": [
                        "https://mips.makerdao.com/mips/details/MIP24#MIP24c4",
                        "https://forum.makerdao.com/t/signal-request-set-the-aave-d3m-dc-to-0-zero/15775/15",
                        "https://app.aave.com/governance/proposal/83/",
                        "https://mips.makerdao.com/mips/details/MIP24",
                        "https://mips.makerdao.com/mips/details/MIP41#MIP41c2",
                        "https://forum.makerdao.com/t/signal-request-set-the-aave-d3m-dc-to-0-zero/15775",
                        "https://manual.makerdao.com/module-index/module-dai-direct-deposit",
                        "https://forum.makerdao.com/t/weekly-makerdao-recap/16382/10",
                        "https://forum.makerdao.com/t/relay-semanal-09-15-de-agosto-del-2022/17353",
                        "https://forum.makerdao.com/t/reporte-financiero-07-2022-traduccion/17263",
                        "https://forum.makerdao.com/t/financial-report-2022-07/17194",
                        "https://forum.makerdao.com/t/financial-report-2022-06/16562/13",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties-round-up-1/16509",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-8-traduccion/16133",
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-junio-del-2022/16062",
                        "https://forum.makerdao.com/t/governance-and-risk-195-thursday-june-16-at-17-00-utc/15816/2",
                        "https://forum.makerdao.com/t/weekly-relay-june-14-20-2022/15950",
                        "https://forum.makerdao.com/t/sourcecred-bi-weekly-happenings-8/15939",
                        "https://forum.makerdao.com/t/mhonkasalo-teemulau-delegate-platform/15473/2",
                        "https://forum.makerdao.com/t/forum-at-a-glance-june-09-15-2022/15843",
                        "https://forum.makerdao.com/t/governance-and-risk-195-thursday-june-16-at-17-00-utc/15816"
                    ],
                    "GPT-summary": "Maker Governance is submitting an urgent Signal Request to ask if the Aave D3M bar should be set to 0. The proposal is explained in detail, including the rationale behind it, the pros and cons, and the next steps. The post also includes a call for feedback and review from various units and delegates. One 3rd party provides constructive criticism of the proposal, highlighting the risks and suggesting caution. Another 3rd party is auditing and reviewing the proposal. The author of the proposal is explaining the proposal in detail.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal"
                    ],
                    "Sentiment": 5.21595904095904
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#3",
                    "likes": "3",
                    "time": "14/06/2022-19:58:28",
                    "content": "Next steps after this is to evaluate in the MOMC meeting in two weeks correct @Primoz ? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#4",
                    "likes": "3",
                    "time": "14/06/2022-20:05:19",
                    "content": "It looks like the aave proposal is unlikely to pass ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 2.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JustinCase",
                    "index": "#5",
                    "likes": "13",
                    "time": "14/06/2022-20:09:07",
                    "content": "I voted no, as this seems like an over reaction to a proposal that seem likely to fail. We should at least wait until it is actually passed before enacting this change. Furthermore, as the previous urgent signal request showed, this change must be assumed to be permanent until a full governance process can enact changes. Finally we should also consider that in the current environment, actions such as these might  even cause further instability. One of the main effects of the financial crisis was the breakdown of trust between banks which deepened and prolonged it. Right now everyone is looking for signs of further despair. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.941326530612245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rune",
                    "index": "#6",
                    "likes": "8",
                    "time": "14/06/2022-20:50:37",
                    "content": "I voted no to this particular urgent signal request, I think we should consider our role in the ecosystem and think when we can help create more stability. Aave is one of the most solid and tested defi platforms, and it is a strong signal to send that we continue to trust them and want to make dai easily accessible on their platform. I can understand the concern about the return being very low, though, and would prefer to support something that sets a higher target rate we think fits better with the risk, but still helps stabilize dai borrowing rate, rather than a panic unwind that potentially makes both maker and aave look bad. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.920454545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/inkymaze",
                    "index": "#7",
                    "likes": "5",
                    "time": "14/06/2022-20:52:32",
                    "content": "This is accurate and Gauntlet is continuing to monitor and model the situation. Should risk materially decrease we also have the option to cancel the proposal. Regardless of the outcome I will be sure to notify this community if we decide to proceed and queue (24 hour timelock) the proposal for execution. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 7.250000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/makercaesar",
                    "index": "#8",
                    "likes": "0",
                    "time": "14/06/2022-20:57:07",
                    "content": "Let’s assume it goes through, how long does it take to implement it probably very quickly since it is a parameter adjustment. And then we are sitting on a big risk. I don’t see it as over reaction, it is a reasonable decision due to changing market situation.     JustinCase:  One of the main effects of the financial crisis was the breakdown of trust between banks which deepened and prolonged it.   The banks did not trust each other because they did not know how much risk they were sitting on and how much they depended on each other’s risk, fortunately we can see how much risk there is at the moment because we can see everything, how individual market participants are behaving and how their portfolios look like. Even if aave is a solid protocol, bad debt is still bad debt. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.03125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ChrisBlec",
                    "index": "#9",
                    "likes": "3",
                    "time": "14/06/2022-21:01:43",
                    "content": "Yes, Aave has a solid history and a reputable dev team. However, the risks presented by this stETH situation in combination with the untenable 3rd party trust requirement in Chainlink are plenty of reason for pause. We shouldn’t allow “good will” and “trust” to result in passing unnecessary risk on to MKR holders. It makes a lot of sense to halt Aave D3M until:  we can get a clearer view of how the currently volatile stETH situation plays out, and Aave takes measures to decentralize its price feed situation so that it’s not 100% reliant on Chainlink  ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.1
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MightyOx",
                    "index": "#10",
                    "likes": "3",
                    "time": "14/06/2022-21:05:22",
                    "content": "    JustinCase:  I voted no, as this seems like an over reaction to a proposal that seem likely to fail. Furthermore, as the previous urgent signal request  showed, this change must be assumed to be permanent until a full governance process can enact changes.       rune:  I voted no to this particular urgent signal request, I think we should consider our role in the ecosystem and think when we can help create more stability. Aave is one of the most solid and tested defi platforms, and it is a strong signal to send that we continue to trust them and want to make dai easily accessible on their platform.   I also voted no for the same reasons. If the D3M is supposed to be a pillar of MakerDAO’s growth plans, then it would be a mistake to turn it off for the foreseeable future based on a kneejerk reaction. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.690972222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#11",
                    "likes": "2",
                    "time": "14/06/2022-21:06:15",
                    "content": "I would like to echo @ChrisBlec and repeat that if Chainlink sends bad price data for any asset, or if Chainlink’s 4-of-9 multisig is otherwise compromised, all lending positions on Aave could find themselves incorrectly liquidated. This is not a new risk, but was covered in the risk assessment. Whether this signal is approved or not, I encourage the Parameter Proposal Group to set a lower debt ceiling (not necessarily zero) on the Aave D3M. ",
                    "links": [
                        "https://forum.makerdao.com/t/d3m-risk-assessment/9353"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 3.7196969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#12",
                    "likes": "3",
                    "time": "14/06/2022-21:15:39",
                    "content": "    JustinCase:  One of the main effects of the financial crisis was the breakdown of trust between banks which deepened and prolonged it. Right now everyone is looking for signs of further despair.   I totally agree and appreciate this comment. However, the banks were correct. The system was insolvent and not trustworthy. On September 15, 2008 I still had a job at Lehman Brothers, but in Europe there was no money transferred overnight because of the credit freeze, so they all went home that day. In North America we lived long enough to get bought by Barclays. By September 22, 2008 I worked for Barclays… until I didn’t. I vote yes. Let’s not hesitate to act aggressively right now to protect this protocol. Anyone who panics more because of this action, perhaps they should. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.644047619047619
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#13",
                    "likes": "12",
                    "time": "14/06/2022-22:02:54",
                    "content": "Voted no as this looks like binary risk management. Lower the bar, and change the rate but going to identically 0 basically says Maker doesn’t trust AAVE AT ALL and I think that sends the wrong message. If this is a reaction to a proposal that hasn’t even passed it looks even worse honestly.    This whole assessment looks like Maker could lose ALL value in aDAI and I think Maker can mitigate this in a more measured way to basically raise the risk rate, and lower the bar to something the protocol can manage. While I consider protecting MKR and DAI holders of paramount importance I also consider the health and vitality of the entire DeFI community to be important as well and the message this sends about AAVE isn’t one of a measured risk move by Maker but more of a knee jerk over reaction that isn’t healthy. Appreciate Chris pointing out the oracle risks.   I don’t see this in the list of reasons to take this action above (is oracle risk even a factor here?).  In fact I still have yet to see a statement regarding the real risks here as it is not clear to me Maker takes a 100% haircut on aDAI unless this event is existential to AAVE (which it might).   I tend to do my own analysis in terms of type of event ‘and odds it happens’ and then weigh the risk/rewards and do this over a collection of event types, odds and loss scenarios.     ChrisBlec:  However, the risks presented by this stETH situation in combination with the untenable 3rd party trust requirement in Chainlink are plenty of reason for pause.   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.883333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#14",
                    "likes": "2",
                    "time": "15/06/2022-01:58:19",
                    "content": "   [Signal Request] Set the AAVE D3M DC to 0 (Zero)   100m DAI is being borrowed by Celsius and collateralized mostly by stETH   I didn’t appreciate the significance of this position until I listened to Celsius Collapsing: Causes, Concerns, and Catastrophe. In this interview, we learn that not only has Celsius bought a bunch of stETH but they actually staked a bunch of ETH. Maybe they can get a good return, but when? Such a long-term investment sets them up for a bank run. ",
                    "links": [
                        "https://podcasts.apple.com/us/podcast/crypto-critics-corner/id1557045965?i=1000566310209",
                        "https://dirtybubblemedia.substack.com/p/following-the-money?s=r"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 6.2
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#15",
                    "likes": "18",
                    "time": "15/06/2022-07:31:10",
                    "content": "    twblack88:  Next steps after this is to evaluate in the MOMC meeting in two weeks correct @Primoz ?   Correct, this is the default practice at monthly MOMC meetings. Let me be clear again that our proposal is of temporary nature. Contagion risks in DeFi are increasing - from UST blowup, we got potentially bankrupt Celsius this week, there are now rumors about 3AC having margin call problems, BlockFi could be next because it lends to 3AC and so on. You simply want to cut exposure in such times because there are so many unknown risks (Tether being a shareholder of Celsius comes next to mind). We could be dealing with Lehman’s moment in crypto. And everyone is probably overreacting but this makes risks even more severe. The beauty of D3M is that we can react in time unlike with other vaults so we can turn it off instantly. I also see some benefits in testing the instant unwind mom contract (no GSM delay). Finally, the downside of doing this is that we pull 50m out of Aave and lose 14k DAI of revenue per week. We also won’t affect rates much, the borrow rate will increase from 2.80% to 3.16%. If the community thinks we’ll affect our relationship with Aave by doing this temporarily and by cutting current 50m exposure then I don’t know how to respond. Now regarding potential risks, @LongForWisdom actually made a good thread on the other post about how many things need to go wrong here so that Maker actually starts carrying a decent loss from this exposure. I tend to agree, but then I look at our exposure to Celsius already at 230m and another 100m via Aave, mostly collateralized by stETH and liquidation threshold of 0.81 (LR of 123%), possibly to be increased to 0.9 (LR of 111%). In these times of distress you just want to hedge this if it can be done smoothly without affecting markets. Now if you want to hear a panic mode scenario at Aave from me, which I don’t want to publicize too much, here is one. Assume ETH supply at Aave shrinks further because suppliers need to cut down leverage from ETH to protect against getting liquidated. Or simply they need ETH liquidity such as AC3 possibly right now. ETH utilization increases to dangerous levels and ETH borrowers can’t repay since they can’t sell enough stETH. Rumor starts spreading aETH suppliers both face liquidity risk and they start pulling ETH out and ETH utilization and borrow rate increases further. Aave reacts by increasing kink on ETH rate curve so that rates are still favorable to stETH/ETH users so they don’t make a loss, which would force them to unwind. This again pushes ETH utilization to extreme levels. Essentially aETH starts carrying all the stETH illiquidity risks and finally stablecoin suppliers start realizing that their borrowed stablecoins are mostly collateralized by stETH indirectly (including us) instead of ETH and bank run on stablecoin deposits begins, also because the 1-2% supply rate is just not worth it. I am probably exaggerating the series of events here, but that’s part of my job. ",
                    "links": [
                        "https://forum.makerdao.com/t/relay-semanal-14-20-de-junio-del-2022/16062",
                        "https://forum.makerdao.com/t/weekly-relay-june-14-20-2022/15950"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.246645880574452
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#16",
                    "likes": "0",
                    "time": "15/06/2022-09:28:25",
                    "content": "    Primoz:  Or simply they need ETH liquidity such as AC3 possibly right now.   Forgot to add “or they get liquidated”, which happens if ETH drops another 2%. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.476190476190476
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#17",
                    "likes": "5",
                    "time": "15/06/2022-10:29:08",
                    "content": "I voted no on this Signal Request. Market panic is the only coin at an all-time high. But panic is bad counsel. Aave is one of the most trusted and well-developed protocols. I understand the push to become more isolated in turbulent times and create firewalls for market contagion, but feel this is rushed. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.460000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#18",
                    "likes": "3",
                    "time": "15/06/2022-11:46:55",
                    "content": "    rspa:  panic is bad counsel   There’s a big difference between “panic” and risk mitigation. Surely you understand the difference. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.666666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/rspa",
                    "index": "#19",
                    "likes": "3",
                    "time": "15/06/2022-13:04:30",
                    "content": "I certainly do, although where risk mitigation ends and panic begins is highly subjective. As MakerMan pointed out, there are ways to limit D3M risk, without turning it off completely. Aave is a valuable partner and this move would send a pretty bad signal. If we wanted to lower risk, let’s tighten the parameters. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party asking questions about proposal"
                    ],
                    "Sentiment": 5.024285714285714
                },
                {
                    "author_link": "https://forum.makerdao.com/u/inkymaze",
                    "index": "#20",
                    "likes": "6",
                    "time": "15/06/2022-13:07:03",
                    "content": "Update on the Aave parameter changes    Aave – 15 Jun 22    Staked ETH and AAVE Risk (June 11th Update) When time permits, Gauntlet prefers to discuss, poll (Snapshot), and then move to AIP. We always want to facilitate a better understanding of market risk and work with the community to reach a consensus. In this instance, our analysis indicated it...      ",
                    "links": [
                        "https://governance.aave.com/t/staked-eth-and-aave-risk-june-11th-update/8469/17"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#21",
                    "likes": "0",
                    "time": "15/06/2022-16:31:10",
                    "content": "“Updated analysis with regards to the stETH/ETH price deviation and largest user positions no longer necessitates the AIP-83 changes.” Would it still be prudent to enact one of the changes in AIP-83 (specifically, freezing stETH deposits) to reduce the chances of deterioration to the point where AIP-83 is necessary? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/twblack88",
                    "index": "#22",
                    "likes": "2",
                    "time": "15/06/2022-16:51:38",
                    "content": "Thank you, Primoz, that was the answer I was looking for. Though the panic mode is a little nutty it’s good to have it in the open. Turning the bar down without a plan was my main concern. That seemed like an overreaction which is a troubling way to make decisions. Avoiding the tail risk in the middle of a goblin run is prudent, as long as we have a plan to turn things back on …that sounds more reasonable. In addition, it sends signal to Aave that we’re confident this is a hiccup. IMO     Primoz:  In these times of distress you just want to hedge this   ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None"
                    ],
                    "Sentiment": 5.760732323232323
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#23",
                    "likes": "0",
                    "time": "15/06/2022-18:29:46",
                    "content": "About an hour and a half left in this Urgent Signal. Please vote if you haven’t done so and for those that have already voted, consider the debate and if you support your original position. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.347222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#24",
                    "likes": "1",
                    "time": "15/06/2022-20:01:12",
                    "content": "Closing the poll. Voting was strongly in favor, supporting the posting of an Out of Order Executive Proposal today. I will update this thread with the spell when it’s ready. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.472222222222222
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#25",
                    "likes": "1",
                    "time": "15/06/2022-20:17:33",
                    "content": "Executive proposal is live, please consider voting if you support the urgent change: https://vote.makerdao.com/executive/template-executive-vote-temporarily-disable-the-aave-dai-direct-deposit-module-d3m-june-15-2022#proposal-detail ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "Author of proposal is asking for feedback"
                    ],
                    "Sentiment": 5.681818181818182
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Doo_StableLab",
                    "index": "#26",
                    "likes": "1",
                    "time": "15/06/2022-20:51:24",
                    "content": "Voted no (by not voting) as AAVE’s proposal is likely to fail Aave - Freeze stETH, Increase stETH Liq. Threshold to 90%, Pause ETH Borrowing but even if passed, the likelihood of Dai liquidity getting stuck seems low as high rate from shortage will encourage more to supply Dai. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 5.16
                },
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#27",
                    "likes": "5",
                    "time": "15/06/2022-21:11:10",
                    "content": "Spell has passed and taken effect, Aave D3M exposure sitting at 0. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#28",
                    "likes": "3",
                    "time": "16/06/2022-18:30:12",
                    "content": "    Primoz:      Primoz:  Or simply they need ETH liquidity such as AC3 possibly right now.   Forgot to add “or they get liquidated”, which happens if ETH drops another 2%.   Want to retract my claims here - this wallet I was referring to which has dodged liquidation by few dollars in ETH price yesterday wasn’t 3AC’s as Nansen had wrong data or by Nansen words there was some crypto twitter confusion. In any case 200m liquidation would have been quite large for Aave if it happened. ",
                    "links": [
                        "https://forum.makerdao.com/t/risk-core-unit-month-in-review-june-2022/16316"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal"
                    ],
                    "Sentiment": 4.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#29",
                    "likes": "1",
                    "time": "16/06/2022-18:53:00",
                    "content": "Thanks Primoz–do you know what was the largest liquidation that AAVE was able to liquidate to date? And how is your modeling for liquidating, say 100m, 50m, versus 200m–have you or Gauntlet done any simulations of such? Is there an orderly way for liquidations to occur(also a delay). Also, the manipulating of oracles is an angle that any prop trading desk that’s currently short would benefit from. But okay I’m just Thinking out loud haha. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 6.071428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Primoz",
                    "index": "#30",
                    "likes": "1",
                    "time": "16/06/2022-21:29:13",
                    "content": "    flipflopflapdelegate:  Thanks Primoz–do you know what was the largest liquidation that AAVE was able to liquidate to date?   If our data we just started collecting is correct, it seems largest liquidation event on Aave v2 ethereum market was $5.7m.     flipflopflapdelegate:  And how is your modeling for liquidating, say 100m, 50m, versus 200m–have you or Gauntlet done any simulations of such?   It usually goes in tranches, because Aave liquidations work differently - up to 50% of debt can be liquidated at once and repeated until health factor improves. The simulation for this particular vault shows about $83m ETH gets liquidated if price crashes instantly by 15% and assuming keeper would liquidate 50% of debt available (even though the total debt size of it is $167m right now after repayments). This shows their liquidation system is actually quite efficient because they don’t need to rely on oracle delay as we do. But the $83m is a lot assuming such sized ETH sale carries 10% slippage on-chain which is higher than the liquidation bonus received by keepers. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "3rd party asking questions about proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.597069597069597
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#31",
                    "likes": "2",
                    "time": "18/06/2022-22:36:50",
                    "content": "    Primoz:  The simulation for this particular vault shows about $83m ETH gets liquidated if price crashes instantly by 15% and assuming keeper would liquidate 50% of debt available (even though the total debt size of it is $167m right now after repayments). This shows their liquidation system is actually quite efficient because they don’t need to rely on oracle delay as we do. But the $83m is a lot assuming such sized ETH sale carries 10% slippage on-chain which is higher than the liquidation bonus received by keepers.   Interesting. I just saw an AAVE keeper say that they can liquidate 10%, 20% and as you said, up to 50%. The important part is that the Health Rate improves above 1.00 — and the reason why this Keeper commented on this Telegram channel I follow is because we were watching this AAVE ETH vault deteriorate to a health ratio of 1.00 — nobody kicked the liquidation and ETH has bounced back from $870 and the vault is still alive at an HR of 1.05. Crazy stuff and glad the AAVE D3M has been disabled as a precaution until this deleveraging  stops. Here’s the vault: DeBank | Your DeFi wallet Supposedly the vault was supposed to be liquidated at $895 ETH but…   twitter.com    Dereek69 🫡 @Dereek70  He avoided it by 10 cents. Literally in disbelief https://t.co/8fjtEzfdjG    9:05 PM - 18 Jun 2022           88                15            ",
                    "links": [
                        "https://twitter.com/dereek70/status/1538266557016690688?s=21&t=TDxOznHaM1zvfqIeUVgMow",
                        "https://twitter.com/dereek70/status/1538266557016690688?s=21&t=TDxOznHaM1zvfqIeUVgMow",
                        "https://twitter.com/dereek70/status/1538266557016690688?s=21&t=TDxOznHaM1zvfqIeUVgMow",
                        "https://t.co/8fjtEzfdjG",
                        "https://twitter.com/dereek70/status/1538266557016690688?s=21&t=TDxOznHaM1zvfqIeUVgMow"
                    ],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.563244047619048
                },
                {
                    "author_link": "https://forum.makerdao.com/u/lyt",
                    "index": "#32",
                    "likes": "1",
                    "time": "20/06/2022-13:56:24",
                    "content": "The same address you posted was partially liquidated for $40m last week. It was in chunks of $1-2m but still, it was $40m ~at once. Larger than $5.7m ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#33",
                    "likes": "0",
                    "time": "20/07/2022-23:56:47",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}