{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/protocol-engineering-month-in-review-may-2021/8471",
            "title": "Protocol Engineering Month in Review: May 2021 ",
            "index": 8471,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "pe-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "16",
                    "time": "01/06/2021-10:58:20",
                    "content": " Protocol Engineering Month in Review: May 2021 Our first month as the Protocol Engineering Core Unit has seen some wild market fluctuations that have led to extensive discussion and debate about the robustness of Maker Liquidations. As the following illustrates, the team has continued to work not only on Liquidations but also on a variety of other initiatives across the protocol. This list serves to summarize the work completed during the month of May and provides a useful overview. Please feel free to review, ask any questions you may have, and we look forward to continuing this work in June!  Weekly Executives The month of May saw the usual Executive Proposal cadence. There was some delay passing the initial Liquidations 2.0 activation executive, however it was all in time for the sudden market downturn. Thank you to the other teams that worked with us to get these proposals up on the portal each week.   April 30: Liquidations 2.0 Activations and Oracle Feed Changes  May 7: Liquidations 2.0 Activations, Transfer May Core Unit Budgets  May 14: Parameter Changes and Oracle Updates  May 24: Approve May 2021 Governance Cycles  May 28: Urgent Changes, Oracle Whitelisting, Liquidations 2.0 Activations   Disclosures and Postmortems The team identified two potentially problematic threats to the protocol and therefore highlighted a number of mitigations based on a root cause analysis. This work identified what triggered the oversight and includes future considerations for improving our processes and ways of working.  End.flow() Overflow Bug Postmortem Emergency Shutdown Module and End Module Upgrades and Disclosures   Liquidations 2.0 Deserving its own section this month, Liquidations 2.0 underwent final parameter tweaks documented in the following forum posts:   MIP45 Parameter Changes and Updates  Adjustments to the tip parameter as final change to incentivise kicking off auctions   Auditor Engagement The Team conducted extensive back and forth discussion with auditors leading up to the release of the new auction mechanism. This included the following 3rd parties, all of which can be found on security.makerdao.com:  Quantstamp Trail of Bits ChainSecurity  Gauntlet for additional Economic Simulations   Keeper Development Working with the Integrations Team, we made final enhancements to the backstop keeper ensuring there was a supported ecosystem participating in Liquidations:   Backstop Keeper Enhancements as an example implementation to interact with Liq2.0  Updated Exchange Callees to support flash loan functionality within Liq2.0 auctions   Updates and Upgrades The Maker protocol requires updates to support the addition of new collateral types as well as weekly changes to parameter values to ensure safe operation. These are often needed across Kovan and Mainnet, and this month included:   Dss-deploy-scripts updates incl. tolerance, parameter, value changes etc  Spells-Kovan upgrades incl. new collateral types, authorizations, tests etc  MCD-Changelog updates incl. updated contracts and collateral types etc  DssExecLib Office Hour logic Updates for improving office hours implementation   Smart Contract Development The team reviewed and improved a number of important contracts, including:  DssVest Contract, testing scripts and forum post  Keg contract review, was superseded by DssVest  Delegate Voting Contract team review and improvement  MIP22 Centrifuge Direct Liquidation Module review/discussion with Centrifuge team  SushiJoin Adapter CropJoin + SushiJoin variant  Flash Mint Module incl. team review, update and preparation for release   Collateral Technical Assessments The following collateral types were reviewed this month. Thank you to Seb for preparing the Centrifuge collateral types for our review.  SC math review of MIP21 Trust Company RWA001 [SLP-USDC-ETH] ERC20 Token [SLP-WBTC-ETH] ERC20 Token [SLP-DAI-ETH] ERC20 Token [RWA003/CF4DRP] CF-DROP/MIP22 Token [RWA004/HT2DRP] HTC-DROP/MIP22 Token [RWA005/FF1DRP] FFT1-DROP/MIP22 Token [RWA006/PP1DRP] P1-DROP/MIP22 Token   Layer2 Development Layer2 discussion has really heated up this month with a variety of Layer2’s growing in TVL. We’ve been focusing on getting the initial Optimism Dai Bridge configured, while also working towards a multichain strategy:  Optimism Dai Bridge: Continuous Integration Testing, Slither CI Testing   A Multichain strategy and Roadmap for Maker forum post Subsequent discussions with other Layer2 contenders following our post   Oracles Interaction The team completed a number of audits and improvements to oracle operations:  LP Oracle Token audits  MegaPoker and OmegaPoker (Kovan) which ensures that oracles are being correctly updated   Overhead and Management Meetings In addition to the above development and reviews, much of this month included discussions covering;  Liq 2.0 Coordination with Integrations, Partners, Keepers and liquidity providers. Taking time to create tooling that maps out existing authorizations to improve security and visibility into contract authorizations. The team did a review and update of the Collateral Framework List for the Smart Contracts Domain. We are in the process of moving smart contract copyright to the DAI foundation. This is an incremental process as various code moves from external repositories. The team has also engaged in Growth Core unit discussions exploring whitelist vault options, and L2 exploratory discussions.   Team Admin A small detail worth mentioning - our team multisig has been transferred to the PauseProxy, meaning that Governance, if it so wishes, can vote to remove our access to monthly funding.   Protocol Engineering Core Unit Multisig added to DSPauseProxy ownership   New Hires We are pleased to announce three new additions to our team. They come with extensive smart contract experience, exposure to Layer2 technologies and engineering best practices. I look forward to welcoming them into our team as they join us during the following months, and will let them introduce themselves in upcoming calls and/or forum posts.  Julien Tal Olivier   Team Finances Our first month closed within budget, for transparency the following is a summary of transactions:  We converted 50k DAI into ETH to support current and future gas costs We transferred 8k DAI as payment to a 3rd party tooling provider that will be helping us with our Holistic Safety and Security Strategy  We transferred 20k DAI to the Liq2.0 Keeper to ensure that a keeper was funded to kick auctions. Once the tip parameter is updated, this should not be needed. The remainder of the transactions were for team member salaries, some of which have been deferred to June due to delays setting up corporate accounts.  Thank you to the community for all your interaction in the forum and on RocketChat since we’ve become a Core Unit. A reminder that we also hold an office hours meeting, 3pm UTC every Tuesday for those that would like to drop by, have a chat or ask questions  . The invite can be found on the Community Calendar. ",
                    "links": [
                        "https://vote.makerdao.com/executive/6095666defe023001bfeb318?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/609ebe2817a042001ae0b056?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/approve-may-2021-governance-cycle?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/urgent-changes-oracle-whitelisting-liquidations-2-0-activations?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/end-flow-overflow-bug-postmortem/8027",
                        "https://forum.makerdao.com/t/esm-end-module-upgrades-and-disclosures/7569",
                        "https://forum.makerdao.com/t/mip45-liquidations-2-0-liq-2-0-liquidation-system-redesign/6352",
                        "https://forum.makerdao.com/t/urgent-adjustments-to-tip-psm-usdc-a-dc/8274/7",
                        "http://security.makerdao.com",
                        "https://github.com/makerdao/mcd-security/raw/master/Audit%20Reports/Liquidations_2.0/Quantstamp_MakerDAO%20Liquidations%202.0%20-%20Final%20Report%20with%20Maker%20Comments.pdf",
                        "https://github.com/makerdao/mcd-security/raw/master/Audit%20Reports/Liquidations_2.0/Trail%20of%20Bits_MakerDAO%20Liquidations%202.0%20Final%20Report.pdf",
                        "https://github.com/makerdao/mcd-security/raw/master/Audit%20Reports/Liquidations_2.0/ChainSecurity_MakerDAO_Liquidations2.0_Final.pdf",
                        "https://maker-report.gauntlet.network/",
                        "https://github.com/makerdao/auction-demo-keeper",
                        "https://github.com/makerdao/exchange-callees",
                        "https://github.com/makerdao/dss-deploy-scripts",
                        "https://github.com/makerdao/spells-kovan",
                        "https://changelog.makerdao.com/",
                        "https://github.com/makerdao/dss-exec-lib/pull/74",
                        "https://forum.makerdao.com/t/mip-54-dssvest/8025",
                        "https://github.com/makerdao/keg",
                        "https://github.com/godsflaw/vote-delegate",
                        "https://github.com/centrifuge/tinlake-maker-lib",
                        "https://github.com/hexonaut/crop",
                        "https://github.com/makerdao/dss-flash",
                        "https://forum.makerdao.com/t/rwa001-verification-process-third-party/7722",
                        "https://forum.makerdao.com/t/slp-usdc-eth-erc20-token-smart-contract-technical-assessment/7952",
                        "https://forum.makerdao.com/t/slp-wbtc-eth-erc20-token-smart-contract-technical-assessment/7953",
                        "https://forum.makerdao.com/t/slp-dai-eth-erc20-token-smart-contract-technical-assessment/7954/2",
                        "https://forum.makerdao.com/t/rwa003-cf4drp-cf-drop-mip22-token-protocol-engineering-domain-team-assessment/8382/2",
                        "https://forum.makerdao.com/t/rwa004-ht2drp-htc-drop-mip22-token-protocol-engineering-domain-team-assessment/8416",
                        "https://forum.makerdao.com/t/rwa005-ff1drp-fft1-drop-mip22-token-protocol-engineering-domain-team-assessment/8417",
                        "https://forum.makerdao.com/t/rwa006-pp1drp-p1-drop-mip22-token-protocol-engineering-domain-team-assessment/8418/3",
                        "https://github.com/makerdao/optimism-dai-bridge/pull/13",
                        "https://github.com/makerdao/optimism-dai-bridge/pull/25",
                        "https://forum.makerdao.com/t/a-multichain-strategy-and-roadmap-for-maker/8380",
                        "https://github.com/makerdao/univ2-lp-oracle",
                        "https://etherscan.io/address/0x8e618fe8cfa64558c57790bd97be3ed4ea6300f2#code",
                        "https://kovan.etherscan.io/address/0x7e2531587d25b9fc58aa051d0f19c0ae809316e9#code",
                        "https://docs.google.com/spreadsheets/d/1IX9e2fyfz7djtDMKn5gMyGsyFxHoY75GncMbAjnSXrM/edit?ts=60918225#gid=0",
                        "https://forum.makerdao.com/t/adding-protocol-engineering-core-unit-multisig/7915",
                        "https://etherscan.io/tx/0x1a17481e1e7829d5c4010627b0018e32d9679587fea074d9886614880598cffa",
                        "https://etherscan.io/tx/0x7b40e2b6dd84e7772dd15790bdfdf3f15e0725a38bc187b8387915cd7d0664fa",
                        "https://forum.makerdao.com/t/protocol-engineering-the-road-to-defi-safety/7567",
                        "https://etherscan.io/tx/0x6284413dd138d63d4071b36782b098c413f6996f651d7c55ce7551f8b16c12fe",
                        "https://calendar.google.com/calendar/u/0/embed?src=makerdao.com_3efhm2ghipksegl009ktniomdk@group.calendar.google.com&ctz=America/Los_Angeles",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-143-thursday-may-27-17-00-utc/8228/3",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-june-6th-2021/8724"
                    ],
                    "GPT-summary": "The post provides a summary of the work completed by the Protocol Engineering Core Unit during the month of May. It includes updates on various initiatives across the protocol, such as Liquidations 2.0, Disclosures and Postmortems, Auditor Engagement, Keeper Development, Updates and Upgrades, Smart Contract Development, Collateral Technical Assessments, Layer2 Development, Oracles Interaction, Overhead and Management Meetings, Team Admin, New Hires, and Team Finances. The post invites the community to review and ask questions about the work completed and provides an invitation to attend office hours meetings.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.519271051529117
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "30/08/2021-10:58:54",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/protocol-engineering-month-in-review-july-2021/9663",
            "title": "Protocol Engineering Month in Review: July 2021 ",
            "index": 9663,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "pe-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "11",
                    "time": "03/08/2021-11:05:29",
                    "content": " Protocol Engineering Month in Review: July 2021 With Liquidations2.0 successfully launched, the team has broadened efforts to support Institutional Vaults, DssVest, DssCropJoin, and Layer2 initiatives in parallel with ongoing executive spells, technical assessments and supporting documentation. Overall, this was a productive month despite some development time being lost as a result of the Sushi team pivoting to a new AMM that introduced custom ranges to LP tokens. A summary of the month is as follows: Executive Spells  July 23 2021 Centrifuge Asset Onboarding  July 17 2021 FLAP Auction Adjustment and RAW-02 (NS-Drop) Debt Ceiling Increase  July 2 2021 Rates Changes, July Core Unit Budgets, and PSM DC-IAM   Smart Contract Work   DssVest: ABDK audit completed, incorporated feedback, and consistency improvements along with supporting Fuzz tests and proofs. dss-Crop-join updates, including a generalized clipper to prevent inheritance and ongoing formal verification proofs.  managed dss-gem-join with updated exit functions  dss-exec-lib enhancements  including lerp support  Delivery of the Optimism Dai Bridge, including: Dai Address deployed on Optimism, along with deployment Scripts including permissions and safety checks, Tests for the Governance L2 spell, Fuzz tests, and a ChainSecurity Audit  DssFlash and DssVest added to DssInterfaces  Working with Centrifuge to test DROP Tokens on Kovan   ds-pain to support dapphupp updates and dependency management  slosm Prototype lightweight OSM for providing delayed feeds Vote Delegate enhancements  Keeper implementation of Uniswap V2 LP tokens  ClipperCallee implementation for SushiJoin and Fuzzing tests Institutional Vaults: DssCharter contract to support institutional vaults and long term vaults, along with discussion with Risk and Growth CU’s for a Forum Post   Collateral Evaluations  Staked Eth (StETH) Technical Assessment Forum Post  MATIC Technical Assessment Forum Post  GUNI-DAI-USDC Technical Assessment Forum Post   Documentation   EVM Bytecode Programming HackMD guide to deploy bytecode contracts Layer 2 Risk Framework Forum Post  Faulty 2021-07-16 Executive Spell Postmortem  ESM Governance Permission Revocation Bug Postmortem   Infrastructure   Changelog updates to include ILK Registry and new collateral types. Goerli node testing and setup by the team in preparation for Kovan sunsetting  Layer 2 Specific  Internal team research into Oracle options on Optimism Ongoing work to implement the Arbitrum Dai Bridge Actively working with StarkWare to create a new independent core unit  Worthy Mention: EthCC During the 3rd week of July, some members of the Protocol Engineering team travelled to EthCC to meet the Ethereum community. Aside from attending technical workshops such as the Geth Workshop, we had productive meetings with many ecosystem partners, including but not limited to:  Lido; to discuss onboarding Staked ETH Witnet; to explore Oracle and Keeper solutions StarkWare; to discuss extending DAI on StarkNet Institutional; learnings with Aave and Uniswap Certora; to talk about formal verification proofs Optimism; to celebrate our recent Dai bridge and talk about future developments Gelato; to discuss GUNI and collateral onboarding  Last but not least, it was productive to meet with Oasis, TokenFlow, Growth and SES Core Units to discuss current and future work. It was also of particular pleasure to meet moneysupply, elpro, schuppi, saint.burban, Mariano.Conti, david.hoffman, swakya and other community members, where stability fees, NTFs, AMMs, collateral, yields, Layer2s were all hot topics of conversation. ",
                    "links": [
                        "https://vote.makerdao.com/executive/template-executive-vote-flap-auction-adjustment-and-rwa-02-ns-drop-debt-ceiling-increase-july-17-2021?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-rates-changes-july-core-unit-budgets-and-psm-dc-iam-july-2-2021?network=mainnet#proposal-detail",
                        "https://github.com/makerdao/dss-vest",
                        "https://github.com/makerdao/dss-vest/pull/34/commits",
                        "https://github.com/makerdao/dss-vest/pull/31",
                        "https://github.com/makerdao/dss-vest/pull/33",
                        "https://github.com/makerdao/dss-vest/pull/32",
                        "https://github.com/makerdao/dss-crop-join",
                        "https://github.com/makerdao/dss-crop-join/pull/9",
                        "https://github.com/makerdao/dss-crop-join/blob/certora-proofs/src/specs/CropJoinImp.spec",
                        "https://github.com/makerdao/dss-gem-joins",
                        "https://github.com/makerdao/dss-exec-lib=",
                        "https://github.com/makerdao/dss-exec-lib/pull/60",
                        "https://optimistic.etherscan.io/token/0xDA10009cBd5D07dd0CeCc66161FC93D7c9000da1",
                        "https://github.com/makerdao/optimism-dai-bridge/pull/49/files",
                        "https://github.com/makerdao/optimism-dai-bridge",
                        "https://github.com/makerdao/optimism-dai-bridge/pull/52",
                        "https://chainsecurity.com/security-audit/makerdao-optimism-dai-bridge/",
                        "https://github.com/makerdao/dss-interfaces",
                        "https://github.com/centrifuge/tinlake-maker-lib/pull/42",
                        "https://github.com/offerijns/spells-kovan/pull/1",
                        "https://github.com/dapphub/ds-pain/blob/master/update.sh",
                        "https://github.com/ServoFarms/SLOSM/",
                        "https://github.com/makerdao/vote-delegate",
                        "https://github.com/makerdao/exchange-callees",
                        "https://github.com/makerdao/dss-charter",
                        "https://forum.makerdao.com/t/institutional-and-long-term-vaults-proposal/9586",
                        "https://forum.makerdao.com/t/steth-erc20-token-smart-contract-technical-assessment/9284",
                        "https://forum.makerdao.com/t/matic-erc20-token-smart-contract-technical-assessment/9140/6",
                        "https://forum.makerdao.com/t/guni-dai-usdc-erc20-token-smart-contract-technical-assessment/9139",
                        "https://hackmd.io/@e18r/r1yM3rCCd",
                        "https://forum.makerdao.com/t/a-proposed-l2-risk-framework/9518/5",
                        "https://forum.makerdao.com/t/faulty-2021-07-16-executive-spell-postmortem/9596",
                        "https://forum.makerdao.com/t/esm-governance-permission-revocation-bug-postmortem/920",
                        "https://changelog.makerdao.com/",
                        "https://www.notion.so/Geth-Workshop-Paris-July-21-2021-6b2ab11b7ce7406ab30cefb24ea25ec2",
                        "https://forum.makerdao.com/t/maker-relay-ep-57/9760",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-153-thursday-august-5-17-00-utc/9671/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-57-en-espanol/9948"
                    ],
                    "GPT-summary": "The post provides an overview of the Protocol Engineering team's activities in July 2021, including the successful launch of Liquidations2.0 and efforts to support Institutional Vaults, DssVest, DssCropJoin, and Layer2 initiatives. The post also mentions the team's attendance at EthCC and productive meetings with various ecosystem partners. The post explains the team's technical work and achievements, and also includes positive feedback, constructive criticism, and collaboration opportunities.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.454660238751147
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "01/11/2021-11:05:48",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/protocol-engineering-month-in-review-september-2021/10985",
            "title": "Protocol Engineering Month in Review: September 2021 ",
            "index": 10985,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "pe-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "6",
                    "time": "13/10/2021-17:52:57",
                    "content": " Protocol Engineering Month in Review: September 2021 Summarising Protocol Engineering Core Unit efforts in September for community awareness.  September Executive Spells   September 3 Parameter Changes, September Core Unit Budgets, DssVest Streams  September 17 Collateral Onboarding and Off boarding, PSM DC-IAM changes  September 24 Adjusting Auction Parameters and Testing Layer 2 Components   Forum Posts   L2 Technical Detail supporting the Sept. 24th executive spell  Official DAI Token Bridge live on Arbitrum One   Smart Contract Development  Added MATIC-A support to the auction demo keeper Created a new Goerli testnet deployment  Improving process checklist for deploying spells to Goerli Deployed UNIV3LP Oracle and conducted sqrtX96 precision analysis and fuzz tests (to prevent price manipulation and overflows) Added PAX PSM and increased autoline to 500M to give the debt ceiling space to increase if needed Added GUNIV3DAIUSDC1-A to the ILK registry (an on-chain list of DSS ILK types) and the megapoker (to facilitate oracle poke and drip) Deployed DssVest for DAI and MKR vesting (to support CU initiatives) Lowered Flashmint fee from 0.05% to 0% Deployed new DssExecLib and aligned code across main/testnets Offboarded KNC by lowering the liquidation penalty and increased the liquidation ratio  Enhanced tests for existing vaults and onboarding future RWAs Completed migration sequence tests for DssCharter  Created standardization enhancements for the UNIV3LP Oracle and improved test coverage  DssCharter (institutional vaults) External Audit completed Incorporated Aave team feedback into the Direct Deposit Module (including; base borrow rate addition, improved calculation for determining current reserve debt levels, and comments for readability) Certora Specs for DssVest (to ensure full test coverage) and optimisation scripts (to ensure all functions behave as expected)   Layer 2  Launched Arbitrum Dai Bridge  Achieved governance message sending from L1 to L2 on Optimism and Arbitrum  Optimism Dai Bridge Specs, Arbitrum Dai Bridge Specs (to ensure rules are abided by, error messages are generated when functions revert, and that there is full test coverage for contract functions) Ongoing design and planning with StarkWare team PE Team Members met with Oracle team to design message passing infrastructure - in progress Discussions with Hop Protocol who now support the sending of DAI in minutes  ",
                    "links": [
                        "https://vote.makerdao.com/executive/template-executive-vote-collateral-onboarding-and-offboarding-psm-dc-iam-changes-september-17-2021?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/template-executive-vote-adjusting-auction-parameters-and-testing-layer-2-components-september-24-2021?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/friday-24th-september-2021-executive-spell-l2-technical-detail/10500",
                        "https://forum.makerdao.com/t/official-dai-token-bridge-now-live-on-arbitrum-one/10438",
                        "https://github.com/makerdao/auction-demo-keeper",
                        "https://changelog.makerdao.com/releases/goerli/1.9.6/contracts.json",
                        "https://github.com/makerdao/spells-goerli/pull/17",
                        "https://github.com/makerdao/univ3-lp-oracle",
                        "https://github.com/makerdao/dss-psm",
                        "https://github.com/makerdao/ilk-registry",
                        "https://github.com/makerdao/megapoker",
                        "https://github.com/makerdao/dss-vest",
                        "https://github.com/makerdao/dss-flash",
                        "https://github.com/makerdao/dss-exec-lib/releases/tag/v0.0.8",
                        "https://vote.makerdao.com/polling/QmQ4Jotm?network=mainnet",
                        "https://github.com/makerdao/MIP21-RWA-Example",
                        "https://github.com/makerdao/dss-charter/pull/3",
                        "https://github.com/makerdao/univ3-lp-oracle/pull/5",
                        "https://github.com/makerdao/univ3-lp-oracle/pull/2",
                        "https://forum.makerdao.com/t/mip59-dsscharter/10028/4",
                        "https://github.com/makerdao/dss-direct-deposit",
                        "https://github.com/makerdao/dss-vest/pull/32",
                        "https://github.com/makerdao/dss-vest/pull/40",
                        "https://github.com/makerdao/arbitrum-dai-bridge",
                        "https://twitter.com/krzKaczor/status/1442563786192441353",
                        "https://github.com/makerdao/optimism-dai-bridge/pull/45",
                        "https://github.com/makerdao/arbitrum-dai-bridge/pull/18",
                        "https://twitter.com/HopProtocol/status/1441093195387977737",
                        "https://forum.makerdao.com/t/maker-relay-ep-67-en-espanol/11113",
                        "https://forum.makerdao.com/t/maker-relay-ep-67/11076"
                    ],
                    "GPT-summary": "The post is an update on the Protocol Engineering Core Unit's efforts in September 2021. It includes a summary of the changes made to the protocol, forum posts, smart contract development, and layer 2 updates. The post explains the progress made by the team and provides information about the changes made to the protocol. It also includes some positive feedback and constructive criticism from third parties, as well as advertising the protocol and answering some questions.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.276205936920223
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "11/01/2022-17:53:15",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/protocol-engineering-month-in-review-august-2021/10293",
            "title": "Protocol Engineering Month in Review: August 2021 ",
            "index": 10293,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "pe-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "7",
                    "time": "12/09/2021-23:54:32",
                    "content": " Protocol Engineering Month in Review: August 2021 This post summarises the Protocol Engineering Core Unit’s work in August. As can be seen from the below, our work was quite diverse; from institutional vaults, to PSMs, and Layer2 engagements. Please ask any questions you may have.  Executive Spells   August 20th Vault Onboarding, 6s Updates, and Reducing Vault Liquidation Ratios  August 6th MOMC Proposal, August Core Unit Budgets, Housekeeping   Forum Posts  Institutional Vaults Forum Post and ensuing discussion with Risk and Growth MIP 59: DssCharter  Team post - Protocol Engineering, Governance and Evolution  PE August 5th Housekeeping Tasks  Domain Team Assessment for SolarX  Faulty 2021-07-16 Executive Spell Postmortem    Smart Contracts   DssVest small enhancements, team approvals, formal verification proofs and updated fuzz tests  Spell checklist for notifying external teams added to Spells-mainnet   ClipperCallee implementation for SushiJoin Internal and external reviews of D3M  Completed DssCharter and associated Certora Specs Updates to dss-deploy by updating CALC_FAB on the chainlog Enhancements to dss-deploy-scripts to fix permissions after deployment Changelog updates 1.9.2, 1.9.3, and 1.9.4, Pax-PSM development and spell deployment  Staked ETH - discussions with Risk to determine debt ceilings Completed the checklist to add MATIC gemJoin to Mainnet  RWA removal of deployer address and addition of broker/dealer address to RWA001 output conduit  PSM AuthGemJoin approvals  Ongoing DssCropJoin updates  Enhancing RWA Debt Ceiling tests  GUni Pool Review and function checks  Working with Gelato Team on UniswapV3-lp-oracle    Layer 2  Optimism Dai Bridge formal proofs and Dai Specs  Arbitrum Custom Dai Bridge design work    Infrastructure  Keeper upgrades in the lead-up to the London hardfork (5th August) Working with TechOps in support of a Goerli archive node (migrating away from Kovan) Auction-demo-keeper work to support MATIC-A    External Audits  ChainSecurity audit on Optimism Dai Bridge Audit  ",
                    "links": [
                        "https://vote.makerdao.com/executive/template-executive-vote-momc-proposal-august-core-unit-budgets-housekeeping-august-6-2021?network=mainnet#proposal-detail",
                        "https://forum.makerdao.com/t/institutional-and-long-term-vaults-proposal/9586",
                        "https://forum.makerdao.com/t/mip59-dsscharter/10028",
                        "https://forum.makerdao.com/t/protocol-engineering-governance-and-evolution/10041",
                        "https://forum.makerdao.com/t/protocol-engineering-housekeeping-tasks-6th-august-2021/9712",
                        "https://forum.makerdao.com/t/rwa007-solarx-mip21-token-protocol-engineering-domain-team-assessment/10016",
                        "https://forum.makerdao.com/t/faulty-2021-07-16-executive-spell-postmortem/9596",
                        "https://github.com/makerdao/dss-vest",
                        "https://github.com/makerdao/dss-vest/tree/master/certora",
                        "https://github.com/makerdao/dss-vest/pull/38",
                        "https://github.com/makerdao/spells-mainnet",
                        "https://github.com/makerdao/exchange-callees",
                        "https://github.com/makerdao/dss-direct-deposit",
                        "https://github.com/makerdao/dss-charter",
                        "https://github.com/makerdao/dss-deploy",
                        "https://github.com/makerdao/dss-deploy-scripts/commit/e0488866d4d6a5b80e92d50d7f0d429ecce75ebc",
                        "https://github.com/makerdao/mcd-changelog/pull/139",
                        "https://github.com/makerdao/mcd-changelog/tree/master/releases/mainnet/1.9.3",
                        "https://github.com/makerdao/mcd-changelog/tree/master/releases/mainnet/1.9.4",
                        "https://github.com/makerdao/spells-mainnet/pull/183",
                        "https://github.com/makerdao/dss-gem-joins/pull/25",
                        "https://github.com/makerdao/spells-mainnet/pull/180",
                        "https://github.com/BellwoodStudios/dss-psm/pull/16",
                        "https://github.com/makerdao/dss-crop-join/pull/15",
                        "https://github.com/makerdao/spells-mainnet/pull/176",
                        "https://hackmd.io/@naszam/r1pFnNegY",
                        "https://github.com/makerdao/univ3-lp-oracle",
                        "https://github.com/makerdao/optimism-dai-bridge/pull/45",
                        "https://github.com/makerdao/arbitrum-dai-bridge",
                        "https://github.com/makerdao/auction-demo-keeper/pull/51",
                        "https://chainsecurity.com/security-audit/makerdao-optimism-dai-bridge/",
                        "https://forum.makerdao.com/t/forum-at-a-glance-september-10th-16th/10344"
                    ],
                    "GPT-summary": "The post provides a summary of the Protocol Engineering Core Unit's work in August 2021, covering a diverse range of topics such as institutional vaults, PSMs, Layer2 engagements, and infrastructure upgrades. The author invites readers to ask any questions they may have about the work. Additionally, the post mentions an external audit conducted on the Optimism Dai Bridge.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 4.974489795918368
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#2",
                    "likes": "1",
                    "time": "13/09/2021-21:11:44",
                    "content": "Hey Derek–just a quick question with regards to competitive strategy–what are the short-term plans–will PE focus/continue on the current on-going maintenance, are there any plans for building the next big product, etc.? As an example, moving toward MCD was a clear goal, wondering if we have something that clear (or smaller subgoals), perhaps the bridges for both Optimism, and Arbi–onboarding StarkNet–are subgoals but trying to get the full picture here. Hopefully that makes sense. Also, not to pick on the little things–but for some folks that stop-by here–would it be possible to get a simpler explanation to what is being done when you say, changelog updates 1.9.2, 1.9.3, or “Updates to dss-deploy by updating CALC_FAB on the chainlog”–I find myself going to GitHub and I still have to bear down to figure out what exactly is going on haha  A good example of folks asking for where Maker is headed is this question submitted: will we be able to generate and pay back DAI on Arbitrum based of our vaults which are still on L1 Ethereum? ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party giving constructive criticism of proposal",
                        "3rd party extending to proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.684461805555555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#3",
                    "likes": "3",
                    "time": "15/09/2021-11:19:02",
                    "content": "Hi @flipflopflapdelegate , Good point! For future iterations I will include a bit more human readable text for awareness/description as it will help give a bit of colour to what side tasks are required to support the headline items we work on. Thank you for the feedback! In this instance: 1.9.2 - Included RWA address updates on Kovan and mainnet, including the input conduit (where broker dealers send DAI) and the output conduit (which has the Draw function ability to send DAI to broker dealer accounts as approved by governance). 1.9.3 - Included adding VoteDelegateFactory into the changelog so it is visible on the page that developers use to reference official MakerDAO smart contracts. 1.9.4 - Added MATIC to the changelog and updated IPFS links as a source of truth. Regarding Competitive Strategy; In the short term we are immediately focused on the following, as top of mind:  DssCharter (audit review and deployment) D3M undergoing team and audit review Arbitrum DAI Gateway (imminent! - this is a big focus point this week) stETH/ETH Curve pool investigation G-UNIV3-DAIUSDC prepping for poll next week  Zooming out a little - L2 is the main development area getting a lot of focus and has significant attention (namely fast withdrawals). As part of this we are working with the Oracles team to determine optimal message passing approaches. Possibly not as flashy, but the team are also looking at automating certain technical aspects of collateral onboarding (we call it creating factories which allow easier deployment of new collateral types including RWAs), we’re also working on cropJoin enhancements to support new reward earning pools. We also have some brainstormed ideas for NFTs, liquidation enhancements and Governance (dssGov) but these are not formally on the roadmap - would be something we’d put in-front of Governance first. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 5.938866341991343
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#4",
                    "likes": "0",
                    "time": "15/09/2021-13:12:32",
                    "content": "Thank you for the feedback Derek, the community and I really appreciate your response. Looking forward to All this innovation and hope that we can deliver a Gem. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-63/10400"
                    ],
                    "GPT-discussion-categories": [
                        "None of the topics listed match."
                    ],
                    "Sentiment": 6.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "14/12/2021-13:12:50",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        },
        {
            "thread_link": "https://forum.makerdao.com/t/protocol-engineering-month-in-review-june-2021/9083",
            "title": "Protocol Engineering Month in Review: June 2021 ",
            "index": 9083,
            "category": [
                "Core Units",
                "Protocol Engineering"
            ],
            "tags": [
                "pe-001",
                "cu-update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Derek",
                    "index": "#1",
                    "likes": "10",
                    "time": "01/07/2021-20:54:10",
                    "content": " Protocol Engineering Month in Review: June 2021 The following is a summary of Protocol Engineering team efforts for the month of June. As evidenced by the numerous code submissions, especially with respect to CropJoin, SushiJoin and Optimism contracts, we’ve been pretty heavily engaged in reviews, updates and enhancements across the board. Team discussion also moved towards increasing and broadening the DAI supply through conditional vaults and new collateral types. Similarly, L2 progress has been strong, involving close collaboration with Optimism, Arbitrum and StarkWare.  Weekly Executives Only three executives in June as we shifted the last executive (PSM autoline) into July:   June 4th: June Core Unit Budget Distributions, Other Changes (including Liq2.0 and PSM)  June 11th: Parameter Changes, Oracle Whitelisting, Other Changes (PSM DC, ETH vault parameters)  June 18th: Flash mint Implementation, Debt Floor Changes   Smart Contract Development A diverse list including periphery modules, proxy contracts, collateral adapters and interfaces:   Uniswap V3 Periphery Contracts: Peripheral contracts enabling profit reinvestment  Vote-Delegate: Contract updates, testing and the addition of a 1year expiry parameter  Flippers changed to Clippers for Stablecoins: Removed tech debt and updating all collaterals to Liq2.0  Updates to CropJoin and SushiJoin: New naming, manager implementation, and proxy patterns  DssFlash: Completed testing on Kovan and deployed the Flash Mint Module  DssProxy Actions: Updated integration with CropJoin, CdpManager, Sushi LPs and PAX-G  Direct Deposit Module: Enhanced gem redemption in the event of protocol shutdown  Oracles IAM: Created a solution allowing the addition but not removal of reader authorization  Adding Permissioned-Gem-Join: Updated for authorized users to interact with a join adapter without granting full auth access  Dss-Interfaces and Dss-Deploy-Scripts: updated to support DssFlash  PSM DC autoline: Introduced an IAM debt ceiling autoline to the PSM   Layer2 Development Our primary focus remains on delivering Optimism and Arbitrum as they are technically very similar. We have a number of dependencies with these teams as they wrap up their deployments and audits.   Optimism-dai-bridge: Fixes, fuzzing tests and improvements. Deployment is imminent! Arbitrum: Ongoing work for the Arbitrum Bridge (still private repo) StarkWare: Exploring options to bootstrap StarkNet development   Keeper Development With the move of the remaining collateral types to Liquidations 2.0 we had a final task to update the auction demo keeper:   Auction-demo-keeper: Support and enhancements for new collateral types   Auditor Engagement Ongoing engagement to ensure code correctness for new implementations:  ChainSecurity: Optimism-Dai-Bridge reviews and work on internal deployment scripts  ABDK: Vote Delegate review completed   Forum Posts and Documentation   Architectural Debt Cleanup: Migrating Remaining Collateral to Liquidations 2.0  Flash Mint Initial Parameters: Max set to 500m DAI and toll set to 0.05%  Defined Numerical Ranges Document: for all dss parameters and quantities ESM Postmortem: team discussion - pending publication Oracle Tail Risk Mitigation: team discussion - pending publication Staked Eth Technical Evaluation - pending publication   Internal Team Training  BlockScience: DSR scenario analysis, entity relationships and system modelling Certora: Extending proof assessments of the DAI Optimism-Dai-Bridge to ensure variables are consistent and that there are no code violations.   DAI Supply Discussions Worthy of mention this month are discussions that have been occurring between Protocol Engineering, the community and Mandated Actors exploring possibilities for increasing the DAI supply. This has led to focussed work regarding CropJoin and SushiJoin, and will lead to immediate work on defining conditional vaults in the coming week.  Team Admin and disclosure As introduced earlier this month, we welcomed two new hires; Tal and Julien. Both have been instrumental in writing and reviewing executive spells, conducting collateral assessments (StakedETH) and contributing to the team. We are super happy to be extending the team’s capability! Protocol Engineering team finances are temporarily trending slightly below budget due to outstanding payments to a number of team members and 3rd party auditors and tooling providers. We expect to clear KYC requirements to be able to make these outstanding payments within the coming weeks. ",
                    "links": [
                        "https://vote.makerdao.com/executive/parameter-changes-oracle-whitelisting-other-changes?network=mainnet#proposal-detail",
                        "https://vote.makerdao.com/executive/flash-mint-implementation-debt-floor-changes?network=mainnet#proposal-detail",
                        "https://github.com/hexonaut/uniswap-v3-periphery/blob/fixed-fungible/contracts/FixedFungibleERC20.sol",
                        "https://github.com/makerdao/vote-delegate",
                        "https://github.com/makerdao/vote-delegate/blob/master/src/VoteDelegate.t.sol",
                        "https://github.com/makerdao/spells-kovan/pull/63/files",
                        "https://github.com/makerdao/dss-crop-join",
                        "https://github.com/makerdao/dss-crop-join/blob/master/src/SushiJoin.sol",
                        "https://github.com/makerdao/dss-flash",
                        "https://github.com/makerdao/spells-kovan/tree/master/src",
                        "https://github.com/makerdao/dss-proxy-actions",
                        "https://github.com/makerdao/dss-direct-deposit",
                        "https://github.com/brianmcmichael/pythia/blob/master/src/Pythia.sol",
                        "https://github.com/makerdao/dss-gem-joins",
                        "https://github.com/makerdao/dss-interfaces",
                        "https://github.com/makerdao/dss-deploy-scripts",
                        "https://community-development.makerdao.com/en/learn/governance/module-dciam/",
                        "https://github.com/makerdao/optimism-dai-bridge",
                        "https://github.com/makerdao/optimism-dai-bridge/pull/28/commits",
                        "https://github.com/makerdao/auction-demo-keeper",
                        "https://github.com/makerdao/vote-delegate/pull/9/files",
                        "https://forum.makerdao.com/t/architectural-debt-cleanup-migrating-remaining-collaterals-to-liquidations-2-0/8515",
                        "https://forum.makerdao.com/t/flash-mint-module-initial-parameters/8835",
                        "https://github.com/makerdao/dss/wiki/Numerical-Ranges"
                    ],
                    "GPT-summary": "The post provides a summary of the Protocol Engineering team's efforts for the month of June, including their work on smart contract development, layer2 development, keeper development, auditor engagement, forum posts and documentation, internal team training, and DAI supply discussions. The post does not explicitly ask for feedback or constructive criticism, but it does provide information about ongoing work and potential collaborations.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party or author is advertising proposal"
                    ],
                    "Sentiment": 5.6672355422355425
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#2",
                    "likes": "0",
                    "time": "29/09/2021-20:54:29",
                    "content": "This topic was automatically closed 90 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ],
    "group_index": "96"
}