{
    "poll_list": [
        {
            "title": "Community Greenlight Poll - P1-DROP (Peoples Company DROP) - January 18, 2021",
            "index": "5518",
            "option": "Yes (Greenlight)",
            "supporting_mkr": "79,296",
            "highest_fraction": 0.95
        },
        {
            "title": "Add P1-DROP as a new RWA Vault Type - June 7, 2021",
            "index": "5518",
            "option": "Yes",
            "supporting_mkr": "30,356",
            "highest_fraction": 0.95
        }
    ],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/p1-drop-mip6-application-peoples-company-drop-us-agricultural-real-estate/5518",
            "title": "[P1-DROP] MIP6 Application: Peoples Company DROP: US Agricultural Real Estate ",
            "index": 5518,
            "category": [
                "Collateral Onboarding",
                "Collateral Onboarding Applications (MIP6)"
            ],
            "tags": [
                "collateral-app",
                "mips"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/mamoore930",
                    "index": "#1",
                    "likes": "11",
                    "time": "07/12/2020-03:52:17",
                    "content": "MIP6 PEOPLES COMPANY Thread Title:  [P1-DROP] MIP6 Application: Peoples Company DROP: US Agricultural Real Estate This MIP6 Proposal will finance an special purpose vehicle (“SPV”) established by Peoples Company or owners or affiliates thereof (the “Issuer”) to acquire U.S. farm properties. Upon acquisition of a farm property, the Issuer will be the legal owner of the farm property and will hold the title to each farm property. This is the sixth MIP6 application to use Centrifuge’s model.  1. Who is the interested party for this collateral application? The Issuer will source and manage farm properties. It will create and own non-fungible tokens (“NFTs”) that represent each farm property title. It will lock their NFT’s into the Tinlake protocol to serve as collateral. The Issuer will pool its assets and offer ERC-20 tokens to investors, specifically DROP Tokens and TIN Tokens. Centrifuge: will provide the technology and framework for bringing real-world assets to MCD. The main contact on Tinlake for the application is Jason Jones (@Jason, [email protected]) as well as Lucas Vogelsang (@spin, [email protected]) of Centrifuge.  2. Provide a brief high-level overview of the project, with a focus on the applying collateral token Peoples Company farmland real estate is part of Centrifuge’s real-world assets series. The Issuer will utilize MCD as a revolving line of credit to purchase new farmland. The Issuer expects to draw Dai up to its assigned debt ceiling in roughly six to nine months and will seek an increase to its debt ceiling once 75% of the initial line amount is disbursed. Farm land assets have the following characteristics: US Farmland offers several investment benefits including portfolio diversification, low to negative correlation with public equities and positive correlation with inflation. There is more than $3 trillion worth of farm real estate in the US and close to 400 million acres of cropland. The farmland asset class has been one of the best performing asset classes over the past twenty years.  631×541 39.1 KB  The following describes an exemplary use case  602×649 162 KB  In January 2020, SPV Larsen Farm, LLLP (the “Farm”), an affiliate of Peoples Company, acquired an 80-acre property located in South Central Iowa just outside of the Des Moines Metro area for approximately $320,000. The asset includes 70 acres of land suitable for transition to tillable farmland and a 5-acre building site. The Farm is eligible to receive USDA organic certification to produce organic fees grain products. Peoples Company owns and manages the farmland. Located in Madison Country, Iowa, the Farm was enrolled in a Conservation Reserve Program (CRP) through the Farm Service Agency in 2009. Due to there being no application of synthetic chemicals or fertilizer on the Farm throughout the ten-year duration of enrollment, the Farm became eligible for organic production immediately after exiting the program in October 2019. The Farm is eligible to grow organically certified corn, soybeans, oats, and edible beans. Organic certification is actively being pursued by the Farm through International Certification Services, Inc. Being in the heart of the Corn Belt and just outside of the Des Moines Metro, the Farm is highly sought after by farm operators. This location is associated with strong agricultural production and therefore experiences consistent tenant occupancy. The Farm has been transitioned to tillable farmland through a ground preparation process that entailed controlled burning, clearing trees and brush, and discing the land to prepare for planting, while improving soil health and stimulating growth. Opportunities exist for yield optimization through soil drainage improvements that will improve crop health and provide better condition for completing field operations. This collateral application uses the Centrifuge model and proposes the DROP token [P1-DROP] of Peoples Company’s asset pool as collateral. A detailed overview of Centrifuge’s technology stack can be found here. Legal Setup While the specific details of the legal setup are forthcoming, at a high level Peoples Company will form its own SPV for the acquisition of farm properties. The SPV will enter into a service agreement with Centrifuge to get support from Centrifuge while using Centrifuge’s open and decentralized infrastructure. The SPV will tokenize the titles of each of its farm properties into NFTs and will add those NFTs to Tinlake as collateral. The SPV will utilize Tinlake to issue P1-DROP and P1-TIN backed by the pool of NFTs that are locked in Tinlake. Peoples Company will purchase the P1-TIN tokens and will lock the P1-DROP tokens into a MakerDAO Vault. Find the documentation to the two-tranche structure here.  1298×641 47 KB   3. Provide a brief history of the project About Peoples Company  1153×272 87.1 KB  Peoples Company’s history began in the 1960s and was established in the farm management department of Peoples Trust and Savings Bank in Indianola, Iowa. In 1972, the farm management department and real estate brokerage separated from the bank into what is now known as Peoples Company. In 2002, the current ownership team acquired the majority interest of the company. Peoples Company operates one of the leading farm land brokerages in the country, with annual transaction volume of over $400 million. Peoples Company offers land brokerage, land management, land investment, and appraisal services in 26 states throughout the US. The company has consistently been named a “Top Brokerage in America” and a “Top 30 Auction House” by the Land Report, an industry-leading publication targeted toward the American landowner. About Centrifuge Centrifuge has built a technology solution for businesses such as Peoples Company to use their assets as collateral, turn them into fungible ERC20 tokens and borrow money against them through DeFi protocols. With Tinlake Centrifuge has over 1M DAI locked in a number of different asset pools since the launch of v3 end of October and deployed capital from over 100 real people around the world. Over the past months we have worked closely with the different domain teams to onboard the first two of our partners, New Silver and ConsolFreight shortly. This MIP6 application is the sixth MIP6 application to use Centrifuge (see previous applications: NS-DROP, CF-DROP, HTC-DROP, PC-DROP, KF-DROP) and there are more in the pipeline. We intend to grow DeFi massively and generate DAI from many different uncorrelated asset originators. Our goal is that Maker will be backed 30% by real word assets by the end of 2021.  4. Link the whitepaper, documentation portals, and source code for the system(s) that interact with the proposed collateral, and all relevant Ethereum addresses. If the system is complex, schematic(s) are especially appreciated. Peoples Company mainnet deployment will be accessible via tinlake.centrifuge.io Technical documentation about Tinlake can be found here: GitHub - centrifuge/tinlake: bringing individual, non-fungible assets to DeFi and the Maker specific implementation here: GitHub - centrifuge/tinlake-maker-lib  5. Link any available audits of the project. Both procedural and smart contract focused audits. Centrifuge has conducted several audits of its technology stack. The audits can be found here:  security/audits at master · centrifuge/security · GitHub   6. Link to any active communities relating to your project.   Centrifuge Discourse Forum Maker Collateral Onboarding Calls: [1], [2], [3], [4], [5], [6], [7]   7. How is the applying collateral type currently used? The SPV will be financed by issuing DROP Tokens for 90% of the net asset value of the pool of NFTs plus cash on hand (collectively “Pool Valuation”) and TIN Tokens for 10% of the Pool Valuation. The Issuer expects to launch with 10 million Dai increasing to 20 million Dai when 75% of the initial line amount is disbursed. It will initially seek 9 million Dai from MakerDAO, increasing to 18 million. The Issuer expects to invest in farmlands that have an average value of $500,000 to $1,000,000 and expects to hold farmland over the long period of time, potentially up to 30 years. Upon the sale of a farm property, the Issuer will repay the outstanding balance drawn against the farm property NFT and accrued interest thereon. All of the farms in the pool will have similar risk characteristics including high quality soil productivity, soil profile, slope characteristics, water availability and weather conditions. The Issuer will provide MakerDAO with a put option, which it can utilize if it ever needs to liquidate. After the first 6 months, MakerDAO will have the right, but not the obligation to sell its ownership of DROP tokens to the Issuer, in whole or in part, upon 90 days notice. The Issuer will work in good faith on a best efforts basis to find one or more buyers for farm properties and will only purchase the DROP tokens from MakerDAO if it successfully sells farm properties to a new buyer. If the farm properties are not sold within 90 days, then the Issuer will have another 90 days to sell the farm properties. This process will continue until the Issuer has fulfilled the MakerDAO’s sell request. The Issuer has a proven long term track record of selling farm properties. Peoples Company completes about $400 million in farm auctions per year, which is about 400 transactions per year. Peoples Company average time to sell a farm is 90 days. The Issuer is able to obtain bank financing for a revolving line of credit at about 3.26% fixed with an 80% loan-to-value or 2.67% fixed with a 50% loan-to-value (as of November 2020). The Issuer will seek a lower Stability Fee from MakerDAO because 1) the Stability Fee is variable versus the bank rates, which are fixed rates, 2) MakerDAO has a put option, and 3) the Issuer will be taking early stage risk versus taking a loan from the bank.  8. Does one organization bear legal responsibility for the collateral? What jurisdiction does that organization reside in? Peoples Company will bear legal responsibility for the collateral. This SPV structure creates a bankruptcy-remote entity whereby owners, debt holders or interested parties of this newly created SPV are left unaffected by the parent’s financial, operational and/or legal health.  9. Where does exchange for the asset occur? The SPV enters into a subscription agreement with lenders who receive DROP from the SPV in turn for providing DAI. The DROP token can be redeemed against the cash flows of the underlying collateral directly from the SPV by any DROP holder. This is ensured by the Tinlake smart contracts and the primary way for interacting with these tokens.  10. (Determined by Legal Domain Team) Has your project obtained any legal opinions or memoranda regarding the regulatory standing of the token or an explanation of the same from the perspective of any jurisdiction? If so, those materials should be provided for community review. We do not have any materials we can provide at this time.  11. (Determined by Legal Domain Team) Describe whether there are any regulatory registrations for the token and provide related documentation (including an explanation of any past or existing interactions with any regulatory authorities, regardless of jurisdiction), if applicable.  The issuance of DROP and TIN tokens is handled via Securitize, with AML/KYC procedures and compliance with US securities guidelines. Investors based in the US must be accredited investors (generally defined as having a net worth of at least $1 million). The SPV issues DROP tokens for the Maker vault, and Centrifuge will post legal discussion about potential implications for Maker.  12. (Optional) List any possible oracle data sources for the proposed Collateral type. The Issuer will provide annual appraisals for each farm property, which will be used to value the NFTs. If an appraisal submitted by the Issuer shows a decrease in the total appraised value of a farm property then the value of the NFT will be marked down. If, as a result of such mark down, the outstanding value of the DROP Tokens increases to more than 90% of the Pool Valuation, then Tinlake will lock the Issuer from drawing any further Dai and will lock the TIN investors from redeeming. The Issuer may restore balance and unlock Tinlake by: (1) buying additional TIN tokens so that the proceeds will increase the cash reserve in an amount necessary to cause the value of outstanding DROP Tokens to be no more than 90% of the Pool Valuation or (ii) redeem DROP Tokens in an amount necessary to restore the value of outstanding DROP Tokens to no more than 90% of the Pool Valuation. If an appraisal submitted by the Issuer shows an increase in the total appraised value of all farm properties, the Issuer may: (i) draw additional amounts from the Financing Line to be funded by DROP Tokens up to the amount that would cause the total outstanding DROP Tokens to equal 90% of the Pool Valuation or (ii) withdraw TIN Tokens to restore the ratio of the value of the outstanding DROP Tokens to the value of the outstanding TIN Tokens to 90/10 or (iii) do nothing, which will effectively over collateralize the pool of assets by the excess value of the TIN Tokens.  13. (Optional) List any parties interested in taking part in liquidations for the proposed Collateral type. The Issuer will provide MakerDAO with a put option, which it can utilize if it ever needs to liquidate. After the first 6 months, MakerDAO will have the right, but not the obligation to sell its ownership of DROP tokens to the Issuer, in whole or in part, upon 90 days notice. The Issuer will work in good faith on a best efforts basis to find one or more buyers for farm properties and will only purchase the DROP tokens from MakerDAO if it successfully sells farm properties to a new buyer. If the farm properties are not sold within 90 days, then the Issuer will have another 90 days to sell the farm properties. This process will continue until the Issuer has fulfilled the MakerDAO’s sell request. The Issuer has a proven long term track record of selling farm properties. Peoples Company completes about 400 farm auctions per year worth over $400 million. Peoples Company average time to sell a farm is 90 days. ",
                    "links": [
                        "https://peoplescompany.com/",
                        "https://forum.makerdao.com/t/poll-rwa-working-group-centrifuge-model/4381",
                        "https://developer.centrifuge.io/chain/overview/introduction/",
                        "https://developer.centrifuge.io/tinlake/overview/tranches/",
                        "https://peoplescompany.com/company/about",
                        "https://forum.makerdao.com/t/ns-drop-collateral-onboarding-risk-evaluation/5418",
                        "https://forum.makerdao.com/t/cf-drop-mip6-application-consolfreight-drop-tokenized-freight-shipping-invoices/2214",
                        "https://forum.makerdao.com/t/ns-drop-mip6-application-new-silver-drop-real-estate-backed-loans/3477",
                        "https://forum.makerdao.com/t/cf-drop-mip6-application-consolfreight-drop-tokenized-freight-shipping-invoices/2214/4",
                        "https://forum.makerdao.com/t/htc-drop-mip6-application-harbor-trade-credit-drop-short-term-trade-receivables/3502",
                        "https://forum.makerdao.com/t/pc-drop-mip6-application-paperchain-drop-tokenized-music-streaming-invoices/2215",
                        "https://forum.makerdao.com/t/htc-drop-mip6-application-harbor-trade-credit-drop-short-term-trade-receivables/3502",
                        "https://forum.makerdao.com/t/kf-drop-mip6-application-kickfurther-drop-consignment-inventory-finance-for-ecommerce-retail-brands/4064",
                        "https://tinlake.centrifuge.io/pool/kickfurther-1",
                        "https://github.com/centrifuge/tinlake",
                        "https://github.com/centrifuge/tinlake-maker-lib",
                        "https://github.com/centrifuge/security/tree/master/audits",
                        "https://discourse.centrifuge.io/",
                        "https://www.youtube.com/watch?v=336RkUuI6hA&t=4s",
                        "https://www.youtube.com/watch?v=3WyBwisQggk&t=10s",
                        "https://www.youtube.com/watch?v=PmUd5Ua6UJ4",
                        "https://www.youtube.com/watch?v=x44aQJEWpEQ",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-8-centrifuge-6s-capital-wednesday-september-16-17-00-utc/4062/3",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-13-consolfreight-wednesday-october-28-17-00-utc/4839",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-15-paperchain-wednesday-november-11-18-00-utc/4983/2",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-22-peoples-company-wednesday-january-6th-18-00-utc/5869",
                        "https://forum.makerdao.com/t/rwa006-pp1drp-p1-drop-mip22-token-protocol-engineering-domain-team-assessment/8418",
                        "https://forum.makerdao.com/t/poll-real-world-assets-using-long-term-loans/6109",
                        "https://forum.makerdao.com/t/poll-rwa-risk-onboarding-sections-most-valuable-insights/6123",
                        "https://forum.makerdao.com/t/weekly-mips-update-24/6052",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-22-peoples-company-wednesday-january-6th-18-00-utc/5869/2",
                        "https://forum.makerdao.com/t/maker-relay-ep-56/9649",
                        "https://forum.makerdao.com/t/maker-relay-ep-55-en-espanol/9715",
                        "https://forum.makerdao.com/t/monetsupply-delegate-platform/9545/17",
                        "https://forum.makerdao.com/t/weekly-mips-update-23/5914",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-21-rwa-2020-wrap-up-rwa-2021-3-asset-originators-wednesday-december-16-18-00-utc/5588/3",
                        "https://forum.makerdao.com/t/collateral-onboarding-call-21-rwa-2020-wrap-up-rwa-2021-3-asset-originators-wednesday-december-16-18-00-utc/5588",
                        "https://forum.makerdao.com/t/maker-relay-ep-56-en-espanol/9812",
                        "https://forum.makerdao.com/t/rbld-mip6-collateral-onboarding-application-real-estate-new/11911/10",
                        "https://forum.makerdao.com/t/maker-relay-ep-55/9531",
                        "https://forum.makerdao.com/t/rwa-006-p1-drop-collateral-onboarding-oracle-assessment-mip10c3-sp32/8402",
                        "https://forum.makerdao.com/t/p1-drop-mip6-risk-assessment-alternative-equity-advisors-drop-us-agricultural-real-estate/8232/4",
                        "https://forum.makerdao.com/t/real-world-assets-report-2021-04/7850",
                        "https://forum.makerdao.com/t/maker-relay-ep-48/8609",
                        "https://forum.makerdao.com/t/real-world-assets-strategy-for-2021/7570",
                        "https://forum.makerdao.com/t/real-world-finance-core-unit-report-2021-03/7289",
                        "https://forum.makerdao.com/t/maker-relay-ep-48-en-espanol/8636",
                        "https://forum.makerdao.com/t/solarx-mip6-application-uprets-solarx-industrial-real-estate-backed-loans/6718",
                        "https://forum.makerdao.com/t/ns-drop-and-sixs-implementation/6822/6",
                        "https://forum.makerdao.com/t/maker-relay-ep-29/6214",
                        "https://forum.makerdao.com/t/maker-relay-ep-29-en-espanol/6220",
                        "https://forum.makerdao.com/t/poll-rwa-risk-onboarding-sections-most-valuable-insights/6123/8",
                        "https://forum.makerdao.com/t/maker-relay-ep-28-en-espanol/6124",
                        "https://forum.makerdao.com/t/maker-relay-ep-28/6118",
                        "https://forum.makerdao.com/t/weekly-mips-update-25/6092"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": [
                        "Token economics",
                        "Grants, Funding and resource allocation",
                        "Law and regulations",
                        "Community and engagement",
                        "Not a proposal"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.701569373387555
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#2",
                    "likes": "0",
                    "time": "07/12/2020-06:16:22",
                    "content": "...The SPV issues DROP tokens for the Maker vault, and Centrifuge will post legal discussion about potential implications for Maker. This is forthcoming when? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#3",
                    "likes": "2",
                    "time": "07/12/2020-07:44:30",
                    "content": "Hi @mamoore930 and welcome to the community! Agricultural real estate has the potential to be a highly interesting use case for crypto collateral. If you look at the above chart the value of farmland is steadily growing and has since 1970 only had a few years with lower year-on-year prices. Farmland is however already used as fiat bank collateral so my question is more from a legal aspect: if a foreclosure should happen, what priority would be given to P1-DROP if Peoples Company already has fiat bank financing? Sidenote: @spin, @SebVentures, @mrabino1  I think maybe it is time to think about adding an abstraction layer to the Centrifuge real world assets. There are how many farms and businesses similar to Peoples Company? Multiple thousands in the US alone? There is no way Maker governance can handle this on a company level. I am going to make a bold suggestion: we need a fund with structure similar to 6s Capital but focused on agricultural real estate.  Then the Centrifuge applications go there instead of directly to Maker. At least the applications would have a chance of getting processed in a better timeframe. EDIT: I question the above rates of 2.67% - 3.26%. https://www.farmlandinvestorcenter.com/landowner-resources/farm-mortgage-rate-watch#:~:text=Banks%20charged%20an%20average%206.0,in%20the%20Minneapolis%20fed%20district the rates listed here are far higher. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.923913043478262
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#4",
                    "likes": "2",
                    "time": "07/12/2020-09:00:23",
                    "content": "    Planet_X:  Sidenote: @spin, @SebVentures, @mrabino1 I think maybe it is time to think about adding an abstraction layer to the Centrifuge real world assets. There are how many farms and businesses similar to Peoples Company? Multiple thousands in the US alone? There is no way Maker governance can handle this on a company level.   Fully agree, soon, IMO, we will do wholesale and expect the SPV to be managed by an asset manager that has no link with the borrower. That is needed to avoid any conflict of interest and having strong diversification. Currently, the cleanest structure is NS-DROP. Adding a trust doesn’t change much this problem. But I don’t feel we are BlackStone ready to ask them to manage assets under a Tinlake pool. And I personally like the fact that we have asset originators who really know their business. I like the farmland idea, but always a bit stressed when I see an asset that a performed so well in the previous years. We will see (just saw that the chart exclude dividends  ). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.712121212121212
                },
                {
                    "author_link": "https://forum.makerdao.com/u/_LS",
                    "index": "#5",
                    "likes": "1",
                    "time": "07/12/2020-10:07:03",
                    "content": "Maker needs to manage supply and demand of DAI. Typically the DAO uses the base rate to adjust interest rates on collateral types to incentivize Vault holders to repay their vaults when DAI demand goes down. Farm Land is slightly less liquid but this is structured never the less with this goal in mind:  Quickly scale up DAI supply by offering an attractive interest rate Reduce DAI supply whenever necessary through by making the debt in the Vault callable within 90 days  There isn’t really a comparable rate in the traditional world as all of these bank line of credits and traditional rates are for multiple years. The rates that are stated in the MIP6 above are the rates that Peoples Company is currently (as of November 2020) able to obtain depending on the LTV (3.26% with 80% LTV and 2.67% with a 50% LTV). As shown in the source you provided the average interest rate projection for December 2020 are at 3.55%. Peoples Company is asking Maker to be competitive with these rates as the loan would be callable by Maker short term (upon 90 days notice). This means for Maker that they have flexible Dai supply in substantial volumes and Peoples would profit making use of the low interest rates instead of the fixed rates they’d get from their bank. This short term option to liquidate comes at a cost for Peoples: they can’t just build up the portfolio and forget about it but need to have capacity to shrink the vault whenever necessary ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.078042328042328
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#6",
                    "likes": "2",
                    "time": "07/12/2020-10:09:38",
                    "content": "    SebVentures:  I like the farmland idea, but always a bit stressed when I see an asset that a performed so well in the previous years.   Like Warren Buffet says farmland they aren’t making any more of it. And people need to eat, so it is recession-resistant. Commodities like corn, soybeans, etc. are good inflation hedges. Buffett bought a 400-acre farm 50 miles north of Omaha in 1986 for $280,000. “Now, 28 years later, the farm has tripled its earnings and is worth five times or more what I paid. I still know nothing about farming and recently made just my second visit to the farm,” he writes. Farmland is far less volatile than malls, offices, or apartment buildings, especially during these uncertain times. I am a big fan of this asset and hope to see it succeed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.736111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#7",
                    "likes": "1",
                    "time": "07/12/2020-10:23:58",
                    "content": "    _LS:  As shown in the source you provided the average interest rate projection for December 2020 are at 3.55%.   The 3.55% figure is the rate for 10-year Treasury Bonds. The linked article indicates the average long term farm mortgage is 6.1%. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.416666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/_LS",
                    "index": "#8",
                    "likes": "1",
                    "time": "07/12/2020-11:45:27",
                    "content": "Oh I jumped to the 2020 projection too quickly. Maybe @mamoore930 can provide additional info on how the rates have developed in the last couple of years. Peoples stated their recent terms from Nov 2020 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.541666666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mamoore930",
                    "index": "#9",
                    "likes": "3",
                    "time": "07/12/2020-15:36:26",
                    "content": "Hi @Planet_X.  The farmland investments will not be levered with commercial banks so there will be no mortgages on these properties.  Also, the interest rates you reference are from 2018. Interest rates have come down substantially.  The rates quoted in the MIP6 are taken directly from rate sheets that we receive from relationship banks that we work with and are very reliable.  Also, the 10-year treasury rate is now .98% compared to the forecasted rate of ~3.5% referenced in the link you provided. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.180555555555556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#10",
                    "likes": "3",
                    "time": "07/12/2020-16:08:35",
                    "content": "Farmland overall should be a good asset for diversification.  I actually work agricultural lending space and am knowledgeable as well.  Farmland has good properties that often diverge from other asset classes.  It is a decent hedge against modest inflation, but not sharp inflation, and has obviously been a very investable asset class over time.  The questions that I would ask are 1) this particular farm with CRP is going to be a higher risk fringe farm.  Which is why it was taken out of production to begin with.  Nothing wrong with that, as there might be huge upside to converting it to organic tillable, but it isn’t the same as high quality Iowa farmground.  2)  My worry is that there is an inherent risk of peg breaking between dai and the real world asset.  In the case of farmground, would be lucky to get cash rents in the 2-3% range.  If the long term, dai appreciates vis a vi the dollar, there is a risk that the USD denominated rents can’t keep up.  This is why, it might make more sense in the near term to focus on higher risk, higher return real world assets.  3)  I do think that Peoples company would be a very good and reputable partner for these types of “property” management.  4)  The asset risk of depreciation is mitigated by the leverage rate obviously.  For lack of better term, the industry standard is probably 65% loan to value, with some periods of loan to asset going as high as 75%.  My 2c ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.022361111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mamoore930",
                    "index": "#11",
                    "likes": "2",
                    "time": "07/12/2020-16:22:14",
                    "content": "@ejbarraza touches on an important point about farmland.  Growing global population and increasing wealth in developing markets provide strong demand fundamentals for high quality farmland that produces basic crops like corn, soybeans, wheat, rice, etc.  Additionally, the U.S. is the #1 or #2 grower and exporter of key crops like corn and soybeans.  However, the supply of U.S. farmland is actually shrinking at gradual pace as cities/towns grow and land is converted to other uses.  These factors suggest (can’t guaranty of course) that farmland will grow in value.  Also important to land value performance is technology.  As farmers adopt technologies for better seeds, cost management, soil improvement, higher crop yields, etc., farming margins will improve and this should boost land values.  Finally, sustainable agricultural practices and organic production are becoming more widely adopted due to consumer demands.  These practices will protect and improve long term soil health and water resources and support land values. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.792156862745098
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Planet_X",
                    "index": "#12",
                    "likes": "2",
                    "time": "07/12/2020-16:25:56",
                    "content": "yes @mamoore930 I found a new and updated list of rates on this page scroll to bottom. I think you are right and the indicated rates in your applications sounds reasonable. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.036796536796537
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mamoore930",
                    "index": "#13",
                    "likes": "2",
                    "time": "07/12/2020-16:31:35",
                    "content": "The farm mentioned in the MIP6 that was taken out of CRP is an example of a completed investment, not one that needs financing.  Other assets like it could be found.  It was originally put into CRP when payments from the govt. for putting it in CRP provided a better return than farming.  It is not in a fringe area but in the heart of productive Iowa cropland. 2-3% lease yields is in the right range of rents for high quality farmland.  It is expected that the land would appreciate in value as well so the all in return is ~7% annually. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.913095238095238
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#14",
                    "likes": "7",
                    "time": "07/12/2020-17:11:39",
                    "content": "And they said Maker wasn’t doing yield farming… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#15",
                    "likes": "0",
                    "time": "07/12/2020-17:32:14",
                    "content": "The expectation of real estate appreciation might be good for a farmland investor, but this appears to be a lending relationship where the bet on the come approach, could result in a liquidation event.  Farmland is actually fairly volatile.  As is quite frankly DAI.  I don’t see much of a buffer (if any) in the lending facility.  For data purposes, here is a data source from the Kansas City Fed.  Click on “Land Values” to get the year over year appreciation/depreciation of farmland values.But the late 70’s and 80’s had farmland decreases that were brutal.  Farmland losing 80% of its value.  Point being is that between DAI losing its peg, going to 1.07-.1.15 and/or any marketable drop in farmland would result in the keepers earning their keep. https://www.kansascityfed.org/research/indicatorsdata/agcreditsurvey/articles/2020/2-13-2020/stronger-farmland-values-support-farm-economy ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.520833333333332
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#16",
                    "likes": "4",
                    "time": "07/12/2020-18:58:45",
                    "content": "@jameskmccall Would you be interested to use your knowledge to help us on this asset evaluation? You can shoot me a direct message on ping me on the chat.     g_dip:  And they said Maker wasn’t doing yield farming…   Okay, I’m convinced we need to onboard it asap. Let’s run the meme printer. Regarding the collateral application. I see some issues, but that may be just stuff to be worked on as this is a new frontier for Maker. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.232954545454545
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#17",
                    "likes": "0",
                    "time": "07/12/2020-20:06:32",
                    "content": "    jameskmccall:  But the late 70’s and 80’s had farmland decreases that were brutal.   I suspect the reason for this is related to interest rates being sky-high. In a world where the ten-year treasury is at 1% or less, I do not see a way for farmland to drop 80%. If interest rates do hit 15% why would MakerDAO bother lending to RWAs? Might as well just invest in treasuries and call it a day. Furthermore, the Fed has signaled that interest rates will remain where they are for the next 4 years (at least). So I expect asset price inflation to go up and interest rates down. DAI is volatile, but I hope RWAs will grow AUM enough to limit that volatility in the future.     g_dip:  And they said Maker wasn’t doing yield farming…   I vote for Maker DAO to change its logo to a happy face with a piece of wheat in its teeth to represent its pivot to RWA yield-farming. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.501388888888888
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#18",
                    "likes": "0",
                    "time": "07/12/2020-20:32:41",
                    "content": "Sure, will help if I can.  Not sure what all that entails or how to dm exactly on this platform ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.833333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#19",
                    "likes": "1",
                    "time": "07/12/2020-21:02:36",
                    "content": "Yes, the key is knowing what Treasuries are going to do.  If I knew that I would have my own island somewhere, and be farming coconuts.  But take farmground at 10,000 an acre.  Let’s say they can borrow $6,000 against it.  At 3% interest that is $180 in interest and assuming 30 year payments, another $126.  So payment is approx $306.  Which is probably where cash rents are.  Which are year to year, or maybe a 5 year lease.  Also with credit risk of tenant.  Interest rates go to 5%.  Ouch, payment goes to $390 per year per acre. Then Willie Nelson comes out and starts playing Farm Aid again.  I guess my point is that 1) I wouldn’t bank or model in a 7% capital appreciation of the asset to underwrite it which really only helps if you liquidate the collateral.  and 2) due to the less liquid nature of the asset and friction costs associated with disposal, the only way this works is if MKRDAO also has a long term commitment to keeping the stability fee low.  But I don’t really understand the explicit guarantees that are provided by the Tinlake system.  Maybe there is additional recourse to those assets drop/tin that I am not understanding.  Or maybe this is just a year to year revolver. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25462962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#20",
                    "likes": "0",
                    "time": "07/12/2020-21:40:50",
                    "content": "    mamoore930:  The farmland investments will not be levered with commercial banks so there will be no mortgages on these properties.   If they are not going to use debt, then the calculation changes. Although I do agree that the total return is not really a useful metric for debt servicing. I would like to know if there are any rent escalators or if the lease has a CPI index attached. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/jameskmccall",
                    "index": "#21",
                    "likes": "0",
                    "time": "07/12/2020-22:59:36",
                    "content": "Understood, but that is a driving metric in farmland value.  Basically the cash rents would need to be able to make a reasonable size debt payment.  Just more to show why farmland values are very interest rate sensitive.  I am sure these risks can be mitigated to a large degree through the advance rate, and loan terms cap on the length of the revolver.  Crystal balls are better 1 year in advance than 30.    But the farmland is a long-term investment.  Would be nice if there is a way to have a little longer fixed rate for dai, but that appears in its infancy. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.466720779220779
                },
                {
                    "author_link": "https://forum.makerdao.com/u/alexis",
                    "index": "#22",
                    "likes": "0",
                    "time": "08/12/2020-09:29:42",
                    "content": "I think, what is quite interesting here, it seems relatively easy to have a security token attached to the land. Well easy, at least there is a possibility. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.333333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jason",
                    "index": "#23",
                    "likes": "4",
                    "time": "10/12/2020-21:41:32",
                    "content": "Hey Everyone - The CEO of Peoples Company will present on the Real World Asset - Collateral Onboarding Call on Dec 16th. Here are the details: https://forum.makerdao.com/t/collateral-onboarding-call-21-rwa-2020-wrap-up-rwa-2021-3-asset-originators-wednesday-december-16-18-00-utc/5588 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#24",
                    "likes": "1",
                    "time": "16/12/2020-19:22:09",
                    "content": "Thank you for coming to the call, guys. One thing I wanted to bring up but didn’t have a chance to is the following:     mamoore930:  The Issuer will provide MakerDAO with a put option, which it can utilize if it ever needs to liquidate. After the first 6 months, MakerDAO will have the right, but not the obligation to sell its ownership of DROP tokens to the Issuer, in whole or in part, upon 90 days notice. The Issuer will work in good faith on a best efforts basis to find one or more buyers for farm properties and will only purchase the DROP tokens from MakerDAO if it successfully sells farm properties to a new buyer.   I’m afraid I don’t understand this at all - it’s just not how loans work. I think we need to have (at least) loose control over an entity that has the senior lien on the assets pledged to the facility. Do you have any ideas how to make this happen? Perhaps the structure used in MIP21? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.094290325059556
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#25",
                    "likes": "1",
                    "time": "16/12/2020-23:11:55",
                    "content": "    g_dip:  I’m afraid I don’t understand this at all - it’s just not how loans work. I think we need to have (at least) loose control over an entity that has the senior lien on the assets pledged to the facility. Do you have any ideas how to make this happen? Perhaps the structure used in MIP21?   The put option is there because this application recognizes that we want liquidity and that we don’t want to take duration risk. For 6S we have a one-year notice period and, for New Silver, the underlying loans are for less than 24 months (which leads to an average of 12 months). Here, the asset-originator provides the ability to sell the property if we want to end the loan. We can force the SPV to take an action. I fear that this put option will be quite expensive. I would prefer a medium/long-term fixed-interest loan (or indexed on the rent). But it’s a bit early to tell. We will see. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.19042994042994
                },
                {
                    "author_link": "https://forum.makerdao.com/u/flipflopflapdelegate",
                    "index": "#26",
                    "likes": "0",
                    "time": "17/12/2020-02:22:48",
                    "content": "First of all–thank you for introducing  the Maker Community to a collateral type that I believe represents the American spirit, and the beltway of hard work and commitment. Farmland has historically outperformed most major asset classes and I believe adding exposure to such can only benefit the DAO. With that in mind–can you please provide a sample pertaining to the “put option”, such as the Terms, Option Fees, Option Price, terms of the option, and binding effect? Also, will it include a clause stating that if you cannot find a buyer—the put option becomes null? This might be an unfair comparison, but looking at the PLC Gladstone Land (Symbol: LAND–Nasdaq) it is currently yielding a modest 3.7% and the stock has underperformed in the last 60 months. Is it possible that the Yield might get stagnant if the stars do not align? How dependent are you with regards to crop prices? And wheat and corn prices, among other crops, if they plummet–how does that effect the yield? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.998611111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#27",
                    "likes": "2",
                    "time": "17/12/2020-03:54:57",
                    "content": "I just don’t think that a put option is sufficient recourse. Ideally a Trust or the SPV (being managed by someone besides the issuer) would hold the senior lien against the property. This setup assumes that the issuer is still solvent and present enough to perform the liquidation themselves. I understand how this structure operates for short term loans, but this feels like forcing a square peg into a round hole. Placing this much trust in the issuer after something has already gone wrong enough for a liquidation to take place is not going to end well IMO. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#28",
                    "likes": "3",
                    "time": "17/12/2020-09:37:48",
                    "content": "    g_dip:  I understand how this structure operates for short term loans, but this feels like forcing a square peg into a round hole. Placing this much trust in the issuer after something has already gone wrong enough for a liquidation to take place is not going to end well IMO.   Fully agree. If there is a big price drop on farmland, we are asking the asset manager to sell something that will materialize a loss on his side (as he is the main/only TIN holder). There is an obvious conflict of interest. Happy to see so much interest from the community. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.277777777777778
                },
                {
                    "author_link": "https://forum.makerdao.com/u/_LS",
                    "index": "#29",
                    "likes": "2",
                    "time": "04/01/2021-08:17:11",
                    "content": "Peoples Company will be on this week’s Collateral Onboarding Call, Jan 6th, 6PM UTC: [📄] Collateral Onboarding Call #22: People's Company - Wednesday, January 6th 18:00 UTC ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 1.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/_LS",
                    "index": "#30",
                    "likes": "1",
                    "time": "12/01/2021-12:51:48",
                    "content": "The slides + recording of the Collateral Call have been added in case anyone wants to review. Thanks @blimpa for the effort! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Tosh9.0",
                    "index": "#31",
                    "likes": "2",
                    "time": "13/01/2021-03:59:44",
                    "content": "Is my understanding of this project correct: in case of liquidation, DAO gets a put option and People’s Company makes a “good faith” effort to sell? And if it can’t, we are on the hook waiting for them until … “[the land] is sold”? That sounds … less than ideal … putting aside the fact that the SPV, wholly owned by the issuer, is highly NOT bankruptcy remote, the DAO has no recourse here. Unlike 6S, the DAO has no standing to have someone acting on our behalf to drag the SPV or the issuer to court if the People’s Company’s “good faith efforts” fall short. I am very afraid that if we don’t pump the brakes on some of these projects, or give a very low debt ceiling for a considerable “trial” period, we are in for a rude awakening, either when this Centrifuge structure collapses or a project, like the People’s Company, after a “good faith” effort to sell their farmland, walks away and we are left holding the bag (and eating into the SB or, worse, printing MKR to cover the losses). ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.366666666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#32",
                    "likes": "1",
                    "time": "13/01/2021-10:05:35",
                    "content": "@Tosh9.0 as discussed in the posts above, everyone that commented agrees that this kind of put option is not really ideal. The current proposal has some flaws in it from a Maker perspective. Most are here to address some expected Maker needs that are not really important from my point of view. Nevertheless, the community shows interest in the underlying collateral is good. All that is needed is to find a good middle-ground. Work is being done on this front. But just thinking about how to structure that is not an easy question. I would recommend that, in the future, asset originators work with a Maker’s team first in order to present a term sheet that is already worked on. But this is a learning process for all parties. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.935897435897436
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jason",
                    "index": "#33",
                    "likes": "3",
                    "time": "13/01/2021-16:26:13",
                    "content": "Hey everyone - Jason here from Centrifuge. I just want to give an update on the status of Peoples Company. So far they have introduced their management team and the farmland asset class to the community. Peoples has brought in their CEO, their head of Asset Management, and a leading professor on farmland assets to talk to the Maker community. The purpose has been to give the community enough information to determine whether this team and this asset should pass the community greenlight process so that the Maker domain teams can work on structuring a deal. Hopefully Peoples has established that farmland assets are stable, that Peoples is a legitimate team, and that this project is worthy of a community greenlight. I think the community greenlight poll will start next Monday. If Peoples receives a community greenlight, then the next step will be to structure terms that work with Peoples and with Maker. Peoples will work through a framework for key terms with the RWA risk team with the premise that we should work together to design terms that will be conducive for the Maker community. We will look at how Peoples has previously structured deals with banks and then we will design something that works with Maker. We are at an early stage with this process and we invite anyone who wants to get into the details to join the risk team in these conversations as we focus on designing a term structure. Once we design the terms, then Peoples can present a proposed term sheet to the community for comments and we can iterate if the community generates legitimate ideas. We see the commentary in this thread and we will address every one of these concerns with the risk team as we design this structure. This is a collaborative effort. If we like the asset class and the team, then let’s vote for a greenlight and get to work on structuring the deal. If you have an questions, please feel free to share here, reach out to me or other members of the Centrifuge team, or reach out directly to Mark at Peoples. Thanks all! Jason ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.425595238095237
                },
                {
                    "author_link": "https://forum.makerdao.com/u/spin",
                    "index": "#34",
                    "likes": "2",
                    "time": "13/01/2021-16:37:51",
                    "content": "The idea with the put on the loans came up when we were thinking about how we could give Maker short term liquidity when unrelated to the asset’s performance Maker needed to reduce exposure to the asset class (for example the target DSR went above the stability fee of the collateral type or just in general DAI demand issues). If farmland as an asset class isn’t performing then indeed the PUT option is not the ideal structure here, but would still work: Peoples (and other junior investors) stand to loose all of their junior investment if the senior investors (incl. Maker) can’t be repaid.     Tosh9.0:  And if it can’t, we are on the hook waiting for them until … “[the land] is sold”? That sounds … less than ideal … putting aside the fact that the SPV, wholly owned by the issuer, is highly NOT bankruptcy remote, the DAO has no recourse here.   Why would you say the SPV is not bankruptcy remote? In case of an asset originator bankruptcy, the assets in the SPV can not be used to settle the AOs debts before any claims against the SPV are settled (this would be the junior & senior investors). A way to ensure these loans are serviced even when a the AO is not operational anymore is to instate a professional backup servicer to manage the SPV. This is a rather common structure used in the credit world. As @g_dip  mentioned, a rather interesting option for this collateral type could be to adopt the structure that MIP21 proposes. And in the long run this might be the safest option however there are still many open questions around it and to date I don’t think the trust with MakerDAO as a beneficiary has been formed yet. I’m looking forward to seeing the progress here! ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.57394419306184
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ejbarraza",
                    "index": "#35",
                    "likes": "2",
                    "time": "16/01/2021-17:14:11",
                    "content": "FYI Bill Gates is investing heavily in farmland.   twitter.com    Forbes (Forbes)  America’s biggest owner of farmland is now Bill Gates on.forbes.com/6018Hk8Hq https://t.co/0tZLJcGXfg  8:28 PM - 14 Jan 2021     1.7K          850            ",
                    "links": [
                        "https://twitter.com/Forbes/status/1349815704116199424?s=20",
                        "http://on.forbes.com/6018Hk8Hq",
                        "https://t.co/0tZLJcGXfg",
                        "https://twitter.com/Forbes/status/1349815704116199424?s=20"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/psychonaut",
                    "index": "#36",
                    "likes": "1",
                    "time": "16/01/2021-18:05:41",
                    "content": "Most farmland is used to support animal agriculture. If you know anything about nutrition, you should know that vastly better health outcomes are obtained on a plant-based diet in comparison to a diet that includes animal products (see What the Health). Hence, I expect agricultural real estate to decline in value dramatically over the next few decades because plant-based food takes a lot less space and water to grow in comparison to animal-based food products. A lot of this currently occupied land can be dedicated back to nature, rewilding, even as human populations grow numerically. ",
                    "links": [
                        "https://truenaturefoundation.org/what-is-rewilding/"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.462962962962963
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Viktor_Viktorov1",
                    "index": "#37",
                    "likes": "2",
                    "time": "21/01/2021-04:34:01",
                    "content": "I just saw this MIP6 application and I think that this is a great suggestion from @Planet_X. I can not agree more that reviewing company by company is not gonna be a working model in long term. That is why we are working to provide a working solution for this problem and will submit an official proposal by the end of the month. However, our proposal is not gonna solve the problem with all potential RWA as our expertise is in Commercial Real Estate. Nevertheless, the right teams are going to be able to replicate the model in other RWA as well. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1726190476190474
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iliadou",
                    "index": "#38",
                    "likes": "0",
                    "time": "08/02/2021-09:52:47",
                    "content": "    psychonaut:  What the Health   Interesting thought! A few remarks:  Pasture-fed cattle meat will become more popular. Its nutritional values and less presence of hormones, antibiotics etc compared to cage cattle farming will harvest a premium price. This requires more extensive agriculture leading to demand for quality pasturing land You assume that people will change behaviour because it is better for their health. Humans have been omnivores for millions of years, so I am not too sure easy it will be to go against evolution  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.645833333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/PaperImperium",
                    "index": "#39",
                    "likes": "0",
                    "time": "02/06/2021-01:35:51",
                    "content": "What was the final verdict on how liquidations would occur? MIP22 provides for Tinlake to be the liquidation route, but isn’t appropriate for this type of asset under management, and also hasn’t actually been tested in the real world yet, I believe? Is the only liquidation mechanism proposed that the party borrowing directly from Maker (the SPV) is in charge of its own liquidation process? As far as oracles go, how can we make this easier on the Oracles CU? Because at the moment we have plans for Oracle price being adjusted by executive vote, and then moving towards the DAO taking on the overhead of independent auditors. This seems in the first phase extremely risky and in the second extremely expensive. Thanks in advance for clarification. Very excited to see farmland assets under management and farmland revenues as the DROP collateral. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.604166666666667
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#40",
                    "likes": "1",
                    "time": "02/06/2021-07:56:39",
                    "content": "    PaperImperium:  Is the only liquidation mechanism proposed that the party borrowing directly from Maker (the SPV) is in charge of its own liquidation process?   Yes. Brokering and managing farms for third-party investors is what they do. This is a 5-year investment. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.166666666666667
                }
            ]
        }
    ],
    "group_index": "3045"
}