{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/guide-to-the-signaling-process/9400",
            "title": "Guide to the Signaling Process ",
            "index": 9400,
            "category": [
                "Governance",
                "Signal Requests"
            ],
            "tags": [
                "meta-governance",
                "guide"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/AstronautThis",
                    "index": "#1",
                    "likes": "15",
                    "time": "17/07/2021-09:53:13",
                    "content": " Overview This is an informal guide on how to participate in the signaling process at MakerDAO by starting a signal request. Signal requests and their role in the governance process are described here. This post covers the considerations before starting a signal request, how to construct a signal request, what the author is expected to do during the signal request and steps to follow after a signal request is concluded.  Before the signal request Consider starting a discussion on the forum and/or use an informal poll to gauge the community’s sentiment before starting a signal request. This step is not necessary for all issues and should always be skipped for urgent issues. Ensure that you have sufficient time for signalling. The signal request should last at least two weeks after going live. Anything less than two weeks does not give governance participants a decent chance to signal on the issue. Many participants do not frequent the forum every day, or even every week. In some situations however, the issue is urgent and some signal is better than no signal at all. In these cases, this two week length should be ignored with appropriate justification and subsequent approval from GovAlpha.  Constructing a signal request  Limit the signal request to a single issue This keeps the topic from becoming a confused mess of different conversations. This is not to say that there must be only one poll, only that all the polls should seek signals on the same issue.  Begin with a summary of the essential information This should take the form of a advantages/disadvantages, pros/cons, positives/negatives to the area being discussed and should be kept up-to-date as the thread progresses. In order to signal, the community should not need to read through the entire discussion, only the initial post. It is the thread owners responsibility to keep this summary as balanced and succinct as possible.  Aim to create consensus When you create a signaling thread, you are trying to gather consensus around a specific proposal, be aware that the proposal may need to compromise to suit as much of the community as possible. The aim is consensus rather than majority-rule, if there is irreconcilable disagreement, the proposal needs to change.  Use neutral phrasing The title, post content and poll options must all be framed in neutral language. Emotional or rhetorical language should not be used. Neutral framing is to ensure that you do not prejudice other community members into voting a particular way. This is vitally important no matter how strongly the author feels about the topic. For example, the poll option “No, we should not change the PPG process” is good. On the other hand, “No, the PPG process is perfect the way that it is.” is bad.  Use the correct category The governance:signal-requests category should be used for all signal requests. Using the same category for signal requests allows them to be accessed separately from the rest of the governance threads and helps keep everything organised. It also allows a custom post template which can help point people in the direction of the Signal Request resources.  Have the correct tags Using the same tag across the forum makes it easy to find all the signaling topics, it helps keep everything organised, it helps the community see if there are things to signal on, etc etc. The two tags that should be attached to a new signal are sig-status-active and signaling. Note that you need to add the sig-status-active tag first or else the signaling tag will not work  Link to appropriate resources If your signal request is related to an existing discussion or to a previous signal request, add a link for readers to give them context. If your signal request is related to frequently adjusted governance parameters, then you must add a link to the Governance Parameter Documentation here (look for the appropriate parameter on the left panel).  Have clear lines of progress The next steps of a signal thread should be communicated by the thread owner whenever anything changes. This can be as simple as a one-line comment explaining what will next happen, and when it will next happen. Note that when communicating the end-date for the poll, use the discourse timestamp feature as it handles timezone conversion and generally makes everyone’s lives easier.    Poll settings Creating a poll in the forum requires you to follow these steps. It is quite easy to create a poll that does not conform to the signal request guidelines so please follow these steps carefully. Insert a poll using the grey gear icon highlighted in the red box in the screenshot  758×400 17.2 KB  Next, you will see the image below. Click on the gear icon again as highlighted  You can now create a poll. The following settings are required for any signal request poll:  Set up a Multiple Choice poll unless your poll only has Yes, No and Abstain as options. Add a neutral Poll title that does not contradict with the thread title. Add the polling options and include an Abstain option. Ensure that each poll option says a single thing and is phrased neutrally. Ensure that the Min Choices is set to 1 and the Max Choices is set to the number of polling options (excluding the Abstain option). Set Limit voting to these groups to trust_level_2  Ensure that Show Results... is set to Only after voting. Enable the Show who voted checkbox. Disable the option to Automatically close poll.  These choices are made for the following reasons:  There are several advantages to including an Abstain option in a signal request. Firstly, it allows voters to signal ambivalence or protest in a active way. It also allows the Governance Facilitators to check the results of the vote in-progress while remaining neutral. Multiple choices allow voters to back more than one option that they would be happy to support in an on-chain poll. Restricting voting to trust_level_2 users ensures that the signal request is not brigaded and manipulated with new accounts. Showing results only after voting ensures that confirmation bias is avoided. People are susceptible to voting with the majority and hiding the results until after someone votes provides an extra incentive for voters to think critically about the issue for themselves. Making votes public after a vote has been cast allows the thread owner to prod dissenting signals to provide reasons for disagreement. Polls should not be automatically closed as it reduces flexibility.  Before inserting your poll, check to see if all the highlighted red boxes in the screenshot below are as shown.  The markdown you see in your thread should be as below [poll type=multiple results=on_vote min=1 max=2 public=true chartType=bar groups=trust_level_2] # Poll Title * Polling Option 1 * Polling Option 2 * Abstain [/poll]  Checklist  (Optional) Has there been an informal poll and/or discussion about the issue on the forum? Is the signal requested limited to a single issue? Is the question phrased in neutral language? Is there a summary of essential information? Are you using the governance:signal-requests category? Have you added the sig-status-active and signaling tags in that order? Have you added appropriate links including to governance parameter documentation, if applicable? Have the lines of progress been included at the end of the signal request post? Poll settings  Is the type of poll (Single Choice vs Multiple Choice) chosen correctly? Is the poll title neutral and not in contradiction with the thread title? Are the poll options neutrally phrased and refering to only one thing? Is there an Abstain option that voters can select? Is Min Choices set to 1? Is Max Choices set to the total number of polling options (excluding Abstain)? Is Limit voting to these groups set to trust_level_2? Is Automatically close poll: X selected and no date/time given? Is Show Results... set toOnly after voting? Is the checkbox forShow who voted checked?    If you’ve answered yes to all the questions in the checklist, congratulations! Your signal request is ready to go live.  During the signal request   Facilitating discussion and engagement in good faith: It is important to encourage people to participate in the signaling process and seek out opinions from both sides. Keeping the discussion going and engaging with all who participate is essential and this responsibility belongs to the thread starter. The thread starter does not have to remain neutral on the issue, but does need to run the signaling process in good faith to its conclusion.   Moving on-chain: A signal request cannot move on-chain until there is a majority for a polling option. The aim of the signaling process is to gather consensus and if it fails to do so then it has not achieved its aim. That said, it is difficult to argue against the poll moving on-chain if a polling option has a majority voting for it. Garnering significantly greater than a 50% majority should always be an aim for the thread owner. The closer the thread is to consensus in the polling stage, the more likely it will pass on-chain. In rare cases a plurality may be sufficient for a poll to move on-chain, however this should only be done if there is a clear reason of urgency.   Note that thread starters cannot close an active signal request thread once it has gone live.  After the signal request If a signal request moves on-chain, it should be summarized after all the off-chain and on-chain polls are complete. At this point the thread should be considered finished. The sig-status-active tag should be removed, and a member of GovAlpha should be pinged to set the thread to close 7 days after the last reply. If a signal request fails to achieve consensus after two weeks, the thread will be closed by GovAlpha.  Whom do I ask for help?     Name GitHub Forum     LongForWisdom LongForWisdom @LongForWisdom   Payton Rose prose11 @prose11   Patrick_J patrick-j-govalpha @Patrick_J   Tim Schuppener ultraschuppi @ultraschuppi    Consider also posting your question on Discord where any community member can help. ",
                    "links": [
                        "https://forum.makerdao.com/tags/c/governance/5/discussion",
                        "https://forum.makerdao.com/tags/c/governance/5/informal-poll",
                        "https://forum.makerdao.com/c/governance/signal-requests/25",
                        "https://forum.makerdao.com/tag/sig-status-active",
                        "https://forum.makerdao.com/tag/signaling",
                        "https://makerdao.world/en/learn/governance/",
                        "https://forum.makerdao.com/c/governance/signal-requests/25",
                        "https://forum.makerdao.com/tag/sig-status-active",
                        "https://forum.makerdao.com/tag/signaling",
                        "https://forum.makerdao.com/tag/sig-status-active",
                        "https://github.com/LongForWisdom",
                        "https://forum.makerdao.com/u/longforwisdom/summary",
                        "https://github.com/prose11",
                        "https://forum.makerdao.com/u/prose11/summary",
                        "https://github.com/patrick-j-govalpha",
                        "https://forum.makerdao.com/u/patrick_j",
                        "https://github.com/ultraschuppi",
                        "https://forum.makerdao.com/u/ultraschuppi/summary",
                        "https://chat.makerdao.com/",
                        "https://forum.makerdao.com/t/practical-guide-to-the-signaling-process/2623",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-151-thursday-july-22-17-00-utc/9423/2",
                        "https://forum.makerdao.com/t/informal-poll-require-2-3-approval-to-issue-mkr-or-debt/15427/7",
                        "https://forum.makerdao.com/t/off-chain-proposal-bounties/15363/6",
                        "https://forum.makerdao.com/t/signal-request-restart-the-burn/14903/19",
                        "https://forum.makerdao.com/t/signal-request-onboard-d3m-for-truefi/14563/3",
                        "https://forum.makerdao.com/t/gbmkr-a-proposal-to-benefit-long-term-mkr-holders/12756/15",
                        "https://forum.makerdao.com/t/signal-request-should-makerdao-assist-in-recovering-dai-locked-on-optimism-escrow/12307/3",
                        "https://forum.makerdao.com/t/govalpha-q3-2021-quarterly-review/11516",
                        "https://forum.makerdao.com/t/signal-request-prioritize-d3m-rollout-to-compound/11490/2",
                        "https://forum.makerdao.com/t/discussion-making-maker-fractionally-reserved-originally-posted-on-reddit/11103/2",
                        "https://forum.makerdao.com/t/signal-request-raise-the-esm-threshold-to-15-and-increase-the-governance-delay-to-4-days/10896/5",
                        "https://forum.makerdao.com/t/create-a-fei-psm/10583/15",
                        "https://forum.makerdao.com/t/signal-request-paperimperium-supplemental-compensation/10454/3",
                        "https://forum.makerdao.com/t/in-need-of-some-urgent-assistance/9507/6",
                        "https://forum.makerdao.com/t/forum-at-a-glance-july-15-22/9486",
                        "https://forum.makerdao.com/t/suggested-signaling-process/396",
                        "https://forum.makerdao.com/t/signal-request-clear-vaults-bad-debt-in-the-makerdao-protocol/18376/12",
                        "https://forum.makerdao.com/t/signal-request-mip65-asset-reallocation/18295/3",
                        "https://forum.makerdao.com/t/signal-request-modify-d3m-guidance-for-momc/18069/3",
                        "https://forum.makerdao.com/t/emergency-urgent-governance-process/3926",
                        "https://forum.makerdao.com/t/all-available-guides/16159",
                        "https://forum.makerdao.com/t/weather-proofing-existing-rwa-vaults-against-market-conditions/15859/2"
                    ],
                    "GPT-summary": "The post provides an informal guide on how to participate in the signaling process at MakerDAO by starting a signal request. It covers the considerations before starting a signal request, how to construct a signal request, what the author is expected to do during the signal request, and steps to follow after a signal request is concluded. The post also includes a checklist for creating a signal request and poll settings. It also explains the responsibilities of the thread starter during and after the signal request and whom to ask for help.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is explaining proposal",
                        "None"
                    ],
                    "Sentiment": 5.438391680782986
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#2",
                    "likes": "1",
                    "time": "18/07/2021-17:26:43",
                    "content": "I find this summary very excellent, the truth that there is this guide, for my part I do not think I use it because I do not work in a UC or something of vital importance in the protocol but to make community. But I will keep it just in case ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "Positive feedback on the guide",
                        "None",
                        "None",
                        "None",
                        "None"
                    ],
                    "Sentiment": 7.75
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "0",
                    "time": "19/07/2021-08:42:28",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Alefcripto",
                    "index": "#4",
                    "likes": "1",
                    "time": "19/07/2021-18:57:04",
                    "content": "Thank you for publishing this guide, I find it useful, I really did not know these tools, maybe in the future in the Latin America section I will use it, but it is good to have the knowledge. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "None",
                        "None",
                        "3rd party giving positive feedback on proposal",
                        "None",
                        "None"
                    ],
                    "Sentiment": 6.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "19/08/2021-04:58:01",
                    "content": "This topic was automatically closed 30 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}