{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/taking-advantage-of-the-farming-craze/3341",
            "title": "Taking advantage of the farming craze ",
            "index": 3341,
            "category": [
                "Miscellaneous",
                "Community Development"
            ],
            "tags": [
                "meta-governance"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#1",
                    "likes": "0",
                    "time": "24/07/2020-19:01:07",
                    "content": "I had a thought today - as usual I hear the sighs now - regarding how Maker could take advangate of the token farming craze that could help us in different ways. Consider making one or more MKR tokens to take advantage of this.  Those of us participating in forums basically get rewarded not just in DAI but say 1/5 of this new governance token. Those with vaults get another 1/5 Groups or individuals doing actual development 1/5-2/5 Another 1/5 for market operations (i.e going into the reserve surplus fund)  The above numbers are arbitrary.   The point here is that governance could mint another 1M say MKRG or MKRC and then give those away based on some above split as compensation for work done on the protocol and to people who have vaults open. Additionally registered sourCRED focum wallets that have MKR deposited in governance should get an additional multiplier based on the fact they don’t just participate in forums but also actually have MKR in governance and vote.   The key point being a vote is what garners the multiplier. Since we are doing the sourCRED report weekly perhaps we could do the distribution weekly. Finally when issued the statement that goes with the MKRC or MKRG is that eventually the MKRC and MKRG will be able to participate in governance directly (how long this takes to integrate or how much weight up to MKR governance proper).   Since we are already working on DSChief changes.  I am not saying we have to include this in the upcoming revision to DSChief but rather than seeing comp farming as a problem I think we should take advantage by minting a second MKRG/MKRC coin (maybe even a couple MKRC going to vault owners, MKRG going to sourCRED folks).   Don’t get me wrong I am not coupling this with sourCRED because I am #2 in cred or earnings but because I think it will help provide a reward and compensation route greater than DAI and we can directly see who is doing what simply by looking at MKRG and MKRC.   We also create greater value for the eco-system. The idea of parsing some of this out to MKR holders at this point I am mixed on.   I think they should get a piece - but honestly I am thinking more of trying to create multiple reward models to reward new contributors here as well as our vault holders.   The split is arbitrary but I wanted the same amount of new MKR to go to people here in forums, as well as 2x this to the real developers, EPCs, as go to the vault holders. Remember the key way to make this valuable is to ‘drip’ it out from the start vs. flooding.  I am not sure the market will bite on this but I toss it out as another positive idea to create value that rewards participation and work as well as vault owners.  In the end MKR holders will and do benefit not just from vault owners that take out loans but everyone contributing to helping to grow Maker and make it more robust>? I think to make this effective we need to strike while the iron is hot so ideas on how to do this fast and easily are welcome. ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.715816703621581
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#2",
                    "likes": "0",
                    "time": "24/07/2020-19:11:01",
                    "content": "Why not just make it MKR instead of a new token? I’m not sure how we could make it transparent/fair for the Sourcecred participation part. I am still interested in incentivizing governance participation/voting though. We should try to find some type of happy medium to make this goal achievable. Trying to find the “stickiest” way to keep community members should be researched and enacted if we are to stay competitive in this new DeFi paradigm. On further thought I’m not sure pure monetary incentives ever really work to retain a community long term. It’s usually the intrinsic values that keep people together. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.4259149940968125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#3",
                    "likes": "0",
                    "time": "24/07/2020-19:16:39",
                    "content": "    Aaron_Bartsch:  Why not just make it MKR instead of a new token?   Because then how MKR couples it into governance can be dealt with ‘independent of MKR’ it also doesn’t dilute MKR proper.  It also then tracks vs. using MKR everywhere.  It is a new token with a new distribution mode and this is what the farming craze folks seem to want. Literally MKR proper via governance could decide that MKRC votes in DSChief at a 10MKRC to 1MKR etc.  It gives governance complete control over its new ‘comp’ MKR babies.     Aaron_Bartsch:  On further thought I’m not sure pure monetary incentives ever really work to retain a community long term. It’s usually the intrinsic values that keep people together.   I disagree.   More tools are better and NOT rewarding people in almost every case I have seen tends to hollow out the volunteer groups.   Compensating them tends to create a more robust volunteer/work ‘market’.   But I believe this is a valid debatable point.   Which is why trying things, applying scientific method to optimizing is appropriate which is why I believe coupling it with sourCRED is ideal as that model is designed to take advantage of adatability to mitigate gaming for rewards to achieve greater community dynamism. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.809031877213695
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Aaron_Bartsch",
                    "index": "#4",
                    "likes": "0",
                    "time": "24/07/2020-19:17:57",
                    "content": "So we have a governance token that governs a governance token? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#5",
                    "likes": "0",
                    "time": "24/07/2020-19:21:52",
                    "content": "No we’d have a Maker comp token that ‘may’ at a later time be able to participate in governance.  That by itself measures participation in the community in ways not measured currently except by sourCRED - can’t even look at DAI to determine.    Could even tie two tokens together like ethtrader did. A MKRC_VALUE and MKRC_NFT the NFT simply does not move and to do anything with MKRC’s in governance use the MKRC_vote = min(MKRC_VALUE, MKRC_NFT).    But this is simply an idea to capture something of this value craze in farming not to absolutely create a new governance token. I just thought the idea of creating a comp token that ‘may’ participate in governance in the future might be an interesting way to take advantage of this farming craze.  It might flop who knows… ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.742424242424242
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jtathmann",
                    "index": "#6",
                    "likes": "5",
                    "time": "24/07/2020-19:39:08",
                    "content": "In my opinion, yield farming is useful to the protocol that issues a governance token for three reasons:  Fund-raising Creating awareness/on-boarding users Becoming sufficiently decentralized  I don’t see Maker needing fund-raising or bootstrapping adoption (and I would argue that yield farming is creating artificial adoption), and we already have MKR for governance.  I entirely agree that using incentives in the protocol is necessary - we have the arbitrage game for vault creation, and MKR burning to encourage proper governance. Maybe if Maker was just launching it would have been an option to farm MKR instead of an ICO, but I think the cat is out of the bag at this point ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.821428571428571
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MakerMan",
                    "index": "#7",
                    "likes": "0",
                    "time": "24/07/2020-19:49:20",
                    "content": "I don’t think the people putting value in the farming craze are doing it for any of your reasons above.   imo I think this is lack of token liquidity being driven by kind of a PnD craze.   I think holders of these things will find themselves holding very heavy bags but who am I to argue about irrationality of markets. Once enough people go ‘not a great idea’ then just bury it without replies.   I just thought it was an idea that perhaps could generate some value to the protocol in multiple ways without MKR losing any DAI over it other than implementing a distribution mechanism at this point. This whole farming crazy at some point will go away anyway. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.675000000000001
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#8",
                    "likes": "10",
                    "time": "24/07/2020-21:26:13",
                    "content": "Something of a tangent. We actually wanted SourceCred rewards to come in MKR, and I’m still hoping we move in that direction once the funding can come from the Protocol. It makes lots more sense to reward governance participants with the voting token than with Dai. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/freiza",
                    "index": "#9",
                    "likes": "1",
                    "time": "24/07/2020-22:29:31",
                    "content": "I’ve been thinking about this a bit as well, and only have a crazy half baked idea which may be useless or serve as some sort of inspiration. A part of me was thinking if we could do something like MKR.B (like Berkshire Hathaway has), which would be a more “affordable” MKR.A (current token) by having much more supply but has less weight when it comes to voting rights.  We can also make MKR A and B function similar to debt tranches, like MKR.A has priorities for getting burned first and then MKR.B gets burned after x% of MKR.A has been burned from fees collected.  MKR.B would be created from the model you’re describing; voters would get richer with this new token and it would incentive users of the CDP system to become stakeholders in governing the system as well.    I’m sure there are many other dynamics that need more research and would not work well using this model, but it is an idea. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.442676767676767
                },
                {
                    "author_link": "https://forum.makerdao.com/u/mario",
                    "index": "#10",
                    "likes": "4",
                    "time": "24/07/2020-22:29:55",
                    "content": "We already have a governance token and we are taking advantage of the farming craze without issuing a token, nobody thought dai would be > 270m a month ago or that we would have 2% of the eth supply. The reason we are not getting profit is because we assume all the risk at 0% fee because the only way we found to keep the peg was through the stability fee and it’s not working as intended so far (hard to say it isn’t working since who knows were would we be with high interest rates, perhaps at 10m dai yearly burned with a dai:usd of 1,07, who knows?). An additional token with sound economics would dilute maker token value and without it would be (sorry for the word here) almost a scam or at least not good PR from my personal perspective. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.565740740740741
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Jiecut",
                    "index": "#11",
                    "likes": "0",
                    "time": "25/07/2020-07:34:23",
                    "content": "I think the real lesson is that Maker needs to take advantage of the YFU craze.   twitter.com    Marc 'Half Billy' Zeller (lemiscate)  Meet Aave-ちゃん Capricorn Blood type A+ She's a Finnish ハフ  Her current hobby is to make fun of @DegenSpartan because he only has made 10% profits by insta selling his $YFI instead of holding the hardest form of money known to earth. https://t.co/y02EGW17wH   7:26 AM - 25 Jul 2020     18          2            ",
                    "links": [
                        "https://twitter.com/lemiscate/status/1286925831588257792",
                        "https://twitter.com/DegenSpartan",
                        "https://t.co/y02EGW17wH",
                        "https://twitter.com/lemiscate/status/1286925831588257792"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.333333333333333
                }
            ]
        }
    ]
}