{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/unable-to-withdraw-eth-collateral-from-cdp/1848",
            "title": "Unable to Withdraw ETH Collateral from CDP ",
            "index": 1848,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "tech-support"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/energyone",
                    "index": "#1",
                    "likes": "1",
                    "time": "29/03/2020-23:23:12",
                    "content": "Black Thursday victim here, Vault #6616. had 99ETH as collateral during the crash - tried all day to add ETH (I had 100 more ETH in my Ledger Live wallet) but the transaction sat as “Pending” most of the day. There is no apparent way to add gas using my Nano X/ LedgerLive while using the Oasis App to increase the chances of the transaction going through. Very disappointed that I spent most of the day trying to add collateral to the contract, but the system was overloaded. My contract got liquidated and ended up with only 11.22 ETH being sent back to my vault. The problem now is that I can not even withdraw the ETH, even though it says it’s available to withdraw. When trying to withdraw and verifying on the Nano, I notice that the Nano screen shows 0 ETH being sent, so the withdrawal fails every time. In the Oasis control panel, the withdrawal amount shows correctly. Can anyone help with this, or direct me to someone who can assist? Thanks! - Earl  https://etherscan.io/address/0x10bbb2a8917a529028b10cf250af467d54c0d3df ",
                    "links": [],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.181565656565656
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Sirlupinwatson1",
                    "index": "#2",
                    "likes": "0",
                    "time": "09/04/2020-18:21:05",
                    "content": "Hi @energyone , There is a thread here : Vault Owner Compensation Thread You can join chat here to have live interaction and you will get more chances to have a quicker reply there : MakerDAO Chat Here a more complete one , there is a lot of message but you will be up to date : Vault Compensation pool draft ",
                    "links": [
                        "https://chat.makerdao.com/home",
                        "https://forum.makerdao.com/t/on-chain-vault-compensation-poll-draft/1822"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.545454545454545
                }
            ]
        }
    ]
}