{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/forum-etiquette/12256",
            "title": "Forum Etiquette ",
            "index": 12256,
            "category": [
                "Governance"
            ],
            "tags": [
                "moderation"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/prose11",
                    "index": "#1",
                    "likes": "23",
                    "time": "16/12/2021-21:48:32",
                    "content": "I don’t want to belabor this point, but it feels worth reminding of some basic etiquette surrounding good faith discussions. We strive for scientific governance which means debating the issues, often when we are in complete disagreement. A good axiom is focus on the idea, not the person presenting it. It is okay to disagree, but it is not okay to disparage. Maker is one of the more mature DAOs around and it is very important that we don’t let aggressive and unhelpful posts tarnish that image. Moderators will continue to handle flagged content, with our preferred method  being to hide offending posts so people can see what content is not tolerated as well as have a transparent record of who the offending party is when moderation occurs. If you have questions or concerns please reach out to me either privately or if you’re comfortable on this thread so others can learn from the conversation. ",
                    "links": [],
                    "GPT-summary": "The post discusses the importance of good etiquette in discussions and debates within the Maker DAO community. The author emphasizes the need to focus on ideas rather than attacking the person presenting them and encourages constructive criticism. The author also mentions the role of moderators in handling flagged content and invites readers to reach out with any questions or concerns.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "3rd party or author is advertising proposal",
                        "None"
                    ],
                    "Sentiment": 6.487499999999999
                },
                {
                    "author_link": "https://forum.makerdao.com/u/williamr",
                    "index": "#3",
                    "likes": "0",
                    "time": "17/12/2021-04:18:46",
                    "content": "@prose11 Have you investigated whether any automated solution exists that can help with the moderation? I remember looking into some NLP + AI solutions for web chatting apps a little while ago. Maybe there is something that integrates with discourse. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party asking questions about proposal",
                        "3rd party extending to proposal",
                        "3rd party or author wants to collaborate on proposal",
                        "3rd party auditing and reviewing proposal",
                        "None of the topics listed match"
                    ],
                    "Sentiment": 4.0625
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "2",
                    "time": "17/12/2021-14:41:15",
                    "content": "great post. We can have respectful disagreements.  In fact we need to have them for Maker to succeed! You can also ask tough questions - just do so in a direct respectful manner. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 6.636111111111111
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/03/2022-20:42:09",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}