{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/good-faith-discussions-and-the-dao/8031",
            "title": "Good Faith Discussions and the DAO ",
            "index": 8031,
            "category": [
                "Governance"
            ],
            "tags": [
                "meta-governance",
                "discussion"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/Elihu",
                    "index": "#1",
                    "likes": "52",
                    "time": "12/05/2021-15:50:53",
                    "content": "With the debate getting heated around various issues as of late, I’d like to ask everyone to try and approach the conversations happening in the forum and rocket chat with good faith. Importantly, disagreements are healthy and lead the DAO forward. At the same time, we should strive to establish and protect mutual respect and merit-driven discussion as the foundations of our community. In dialectics, the principle of charity poses that to reach an agreement, all participants of a discussion should aim to interpret each other’s arguments in the most “charitable” way. Imagine a debate in which one side assumes that a premise is clear and doesn’t need to be elaborated on, skipping it over. The opposing side can then make a choice: apply the principle of charity and ask for clarification, trying to find the strongest version of the argument, or alternatively use that gap in argumentation to undermine all premises indiscriminately. The first option is the only way to reach consensus, while at the same time letting your opponent know you care for what they have to say, even when you still disagree at the end. We’re not a corporation. There’s no one entity deciding on the “right” interpretation of facts. We have on-chain tools to discover the will of the voters, but the off-chain discussion and consensus-seeking is the only tool to keep our community aligned. I’d also argue that there are tangible risks and opportunities directly relating to what I’m saying here. If we can foster a culture of respectful, merit-driven, and good-faith discussions, we can at worst find out the points where we disagree and at best reach consensus around them. On the other hand, if we lose the ability to communicate efficiently, we might end up facing a fork from a vector we often don’t consider, the human one. ",
                    "links": [
                        "https://forum.makerdao.com/t/maker-relay-ep-45/8127",
                        "https://forum.makerdao.com/t/maker-relay-ep-45-en-espanol/8141",
                        "https://forum.makerdao.com/t/sourcecred-distribution-for-week-ending-may-16th-2021/8248"
                    ],
                    "GPT-summary": "The author of the post is asking the community to approach discussions with good faith and mutual respect. They emphasize the importance of interpreting each other's arguments in the most charitable way and striving for consensus through respectful and merit-driven discussions. The author also highlights the risks and opportunities associated with fostering a culture of respectful discussions within the community.",
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": [
                        "Author of proposal is asking for feedback",
                        "None",
                        "None"
                    ],
                    "Sentiment": 5.928571428571429
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#3",
                    "likes": "14",
                    "time": "13/05/2021-00:02:33",
                    "content": "Going to global-pin this for a while, y’know, just for good measure. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 8.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Kathleen",
                    "index": "#4",
                    "likes": "7",
                    "time": "13/05/2021-11:03:47",
                    "content": "This is encouraging and thank you for posting. I believe the community is all for it. This is not anyone’s fault, but I am at risk of losing my team members because of what’s taking place on the forum. However, I am hopeful that we, including myself, will all get better at this. ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving constructive criticism of proposal"
                    ],
                    "Sentiment": 7.5
                },
                {
                    "author_link": "https://forum.makerdao.com/u/iammeeoh",
                    "index": "#6",
                    "likes": "5",
                    "time": "13/05/2021-17:28:33",
                    "content": "    Kathleen:  because of what’s taking place on the forum   Well, this is one of the ways governance is pushed forward.     Kathleen:  However, I am hopeful that we, including myself, will all get better at this.   Even if I voted NO, I’d like to thank you and your team for your efforts preparing the proposal(s) and for all the work you have done in the past! ",
                    "links": [],
                    "GPT-discussion-categories": [
                        "3rd party giving entirely positive feedback on proposal"
                    ],
                    "Sentiment": 5.46875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/LongForWisdom",
                    "index": "#7",
                    "likes": "0",
                    "time": "19/05/2021-14:30:04",
                    "content": "",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/system",
                    "index": "#8",
                    "likes": "0",
                    "time": "18/08/2021-20:31:02",
                    "content": "This topic was automatically closed 91 days after the last reply. New replies are no longer allowed. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0606060606060606
                }
            ]
        }
    ]
}