{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/poll-included-cdip30-voices-of-makerdao-podcast-updates-and-deliverables/4999",
            "title": "[POLL included] CDIP30: Voices of MakerDAO Podcast - Updates and Deliverables ",
            "index": 4999,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "update"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#1",
                    "likes": "2",
                    "time": "04/11/2020-21:09:34",
                    "content": "After proposing CDIP30 I have accomplished all that was initially set out for. My initial goals were: Report with answers to the research questions, and suggestions on:  Who should be the audience? How to format the show and possible segments to include. Plan for incorporating contributions, guests, and community-generated content. Branding, including; potential names, descriptions/summaries, ways to decide what the voice should be (figuratively, not the actual person’s voice), optimal cadence  Sample options for audio branding 10 - Sound drops/transitional breaks (4-8 seconds/per) 3 - Music/speaker Intro/Outro sounds (25-45 seconds/per) One example Podcast episode cut down from one of our previously recorded Community Calls A rough-cut 10-15min “episode,” based on my top recommended audience and segment idea.  This has led to the creation of an example episode of the Relay governance updates (about 10 mins in total), a proposal that lists my recommendations and specific ideas for plans/further framework, as well as a large research document containing a lot more options and potential. I also have created 3 different intro/outro songs, as well as 11 vocal samples for intro/outros, and 15 drops/transitional breaks (for future use more than current). All of the Example Episodes are the same for the Relay/governance updates section but are all different for intro/outro purposes. I would love to see this expand and grow into a lot more than it is, and I need feedback/approval for that to happen, so thanks for taking part!  Example Episode v1 Example Episode v2 Example Episode v3 Commercial for Presentation (a mashup of a lot of the varying samples/drops/vocal processing/intro/outro songs) Sound drops/Transitional Breaks Vocal Samples Proposal Research Document  I would love to get feedback on favorite intro/outro songs, as well as feedback on potential issues/favorites/preferences for the levels, drops, and vocal samples.    Which Example Intro/Outro Do You Prefer?  1 2 3     0 voters         Do You Think This Can Become a Useful Tool?  Yes (and my reason is in the comments) No (and my reason is in the comments) Abstain (and my reason is in the comments)     0 voters     ",
                    "links": [
                        "https://docs.google.com/document/d/1dTCPCrABSr9PnheEQd348_Gq1c1wrmo_F9GXcXIQ0Ow/edit#",
                        "https://docs.google.com/document/d/1s7rhHgSSxudAeo6jNSksNrGjPH5uvfK6MeWtI2yq5cc/edit",
                        "https://drive.google.com/file/d/105Z_-wVpf21lHsjJUtmkLoClHHTI2xlK/view?usp=sharing",
                        "https://drive.google.com/file/d/1QJgw_NITXQPfYK0Lex_a2Tvjw7_378SR/view?usp=sharing",
                        "https://drive.google.com/file/d/1k1vuD5Wy2YevtcUnwPQCwL9qEaI5Nuh_/view?usp=sharing",
                        "https://drive.google.com/file/d/1PKsgvtSD1Y6dg4iZJZu5IB1Knlo5Fhwu/view?usp=sharing",
                        "https://drive.google.com/file/d/1n_vEsbU2bMsAoApokXPvBMjgfxcCj8wB/view?usp=sharing",
                        "https://drive.google.com/file/d/1GL2m4HqE1fdFI8kEg1Hiza2y1GVY5ZfZ/view?usp=sharing",
                        "https://docs.google.com/document/d/1dTCPCrABSr9PnheEQd348_Gq1c1wrmo_F9GXcXIQ0Ow/edit#",
                        "https://docs.google.com/document/d/1s7rhHgSSxudAeo6jNSksNrGjPH5uvfK6MeWtI2yq5cc/edit",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-147-thursday-june-24-17-00-utc/8904/2",
                        "https://forum.makerdao.com/t/poll-discussion-voices-of-mkr-progressions/6456",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-118-thursday-november-12-16-00-utc/5008/2",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/5",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-118-thursday-november-12-16-00-utc/5008/8",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/7",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/5",
                        "https://forum.makerdao.com/t/g-r-snippets-en-espanol/4782/4",
                        "https://forum.makerdao.com/t/agenda-discussion-scientific-governance-and-risk-117-thursday-november-5-16-00-utc/4929/4"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.823677248677248
                },
                {
                    "author_link": "https://forum.makerdao.com/u/SebVentures",
                    "index": "#2",
                    "likes": "2",
                    "time": "04/11/2020-23:23:36",
                    "content": "Can we have the 3 but shortened like the 2?  More complicated, can we have something with more “meaning” and more fun? The example is quite good on the information side but it’s like reading the minutes of a shareholder meeting. MIP15, MIP16, … I want to know how the flash mint module is changing the world (take that Uniswap). Why Primoz is the man for the job. I want entertaining stories, not just the facts. Now the issue is that I’m asking for subjectivity and emotions which might lead to issues. I have something like Bankless in mind. People need to feel proud to be part of Maker at the end of the episode. That’s more important than knowing the details of the Dark Spell thing (but the explanation was good). Just a point of view. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.979166666666666
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#3",
                    "likes": "0",
                    "time": "04/11/2020-23:58:04",
                    "content": "Yes, we can! I can make a mockup of what that’d sound like. and yes!!! this is exactly the type of feedback I want/need. I would love to move the project in directions such as this, but for now this is what the scope of the project is. I would love to include something along those lines in the future plans, adding that to my notes, thank you. Part of the idea is to start somewhere and build into more learning and interactive/conversational things. Another part of the idea is to use a script so it doesn’t sound so choppy/there isn’t as much editing required. At least in terms of the specific governance updates. I absolutely appreciate the feedback/input and will take all of these things down in my notes. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.1060363247863245
                },
                {
                    "author_link": "https://forum.makerdao.com/u/JerryAG",
                    "index": "#4",
                    "likes": "3",
                    "time": "05/11/2020-00:37:29",
                    "content": "I also made a version of the community call about the flash loan issue (with @Davidutro and @Kurt_Barry) for example purposes, which you can listen to here; Flash Loan Community Call ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Davidutro",
                    "index": "#5",
                    "likes": "1",
                    "time": "05/11/2020-14:55:11",
                    "content": "I really like Seb’s suggestion to infuse a potential MakerDAO podcast with more stories and humanity. Often times informational stuff can be like white noise. Sometimes a quick audible update is a great idea, especially if there’s no time or opportunity to read the Maker Relay. A short 15 min readthrough of it might have utility to some people in the community. Curious how many people regularly listen to podcasts in our community. ",
                    "links": [
                        "https://forum.makerdao.com/t/informal-poll-media-production-for-makerdao/5313/27"
                    ],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.015151515151516
                }
            ]
        }
    ]
}