{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/informal-poll-long-term-stablecoin-competitive-advantage/16672",
            "title": "[Informal Poll] Long-Term Stablecoin Competitive Advantage ",
            "index": 16672,
            "category": [
                "Miscellaneous"
            ],
            "tags": [
                "informal-poll",
                "brainstorm"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#1",
                    "likes": "6",
                    "time": "18/07/2022-13:58:41",
                    "content": "Just as bank deposits have become commoditized in part due to FDIC insurance, regulations and technology, we should expect a similar situation to happen to crypto stablecoins.  Multiple new over-collateralized stablecoins will appear, transparent backing collateral metrics will transform the industry and push stablecoins to commodity status. In the future a competitive advantage will no longer only be that a stablecoin performed as a stablecoin, i.e. peg holding. In this world, what competitive advantage or value proposition would differentiate us from the rest. Below are a few options.     Established - Longest running stablecoin Decentralized - No intermediaries, ability to remain anonymous Globalization - Availability in the market via wallet integration, dapps, exchanges, L2s etc Interest - DSR is higher than other stablecoins Real World Integration - Accepted as currency by businesses and payment processors Insurance - Development of on chain deposit insurance similar to FDIC insurance but specific to DAI On-chain trading - On-chain DAI investment options Other - Leave in comments for brainstorming     0 voters     ",
                    "links": [
                        "https://forum.makerdao.com/t/sourcecreds-bi-weekly-happenings-11/16959",
                        "https://forum.makerdao.com/t/un-vistazo-al-foro-14-20-de-julio-del-2022/16911",
                        "https://forum.makerdao.com/t/weekly-forum-recap/16247/6"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.004370629370629
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rachel_G",
                    "index": "#2",
                    "likes": "2",
                    "time": "18/07/2022-14:17:36",
                    "content": "Some of these may be related - i.e., we can keep status as the longest running stablecoin while retaining our ability to be fully decentralized, and at the same time, we could be integrating with wallets. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Saludiego_201",
                    "index": "#3",
                    "likes": "5",
                    "time": "18/07/2022-14:19:10",
                    "content": "I think that from an objective point of view and basically from the experience in crypto for many years now, I have realized that users don’t care how it works, how decentralized it is or x and z that it goes with the speeches of freedom and resistance to censorship and being our own custodians. Users are looking for it to be present in their favorite chains and for real world companies to accept it for products and commodities, hence the popularity of USDT, USDC and currently BUSD. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.285714285714286
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#4",
                    "likes": "2",
                    "time": "18/07/2022-15:38:49",
                    "content": "well said Users want the stable coin to be the easiest to use, cheapest for liquidity and most usable… Maker does not pay enough attention to the DAI holders yet they are Maker’s core market ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.25
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#5",
                    "likes": "0",
                    "time": "18/07/2022-17:13:52",
                    "content": "Interest rate to attract new users and real world integration to retain them. The rapid UST growth was in part due to the 20% “guaranteed” rate, obviously not sustainable but proves the point that stablecoin users are rate sensitive ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.509469696969696
                },
                {
                    "author_link": "https://forum.makerdao.com/u/MarianoDP",
                    "index": "#6",
                    "likes": "1",
                    "time": "18/07/2022-17:32:22",
                    "content": "those who voted  Real World Integration - Accepted as currency by businesses and payment processors  Probably never talked to a payment processors or businesses or do not understand how the market flow works from OTC, Market Makers, to retail and Processors. People will always use the most liquid currency because it can get the best quote. The killer app for a stablecoin is and it always will be interest rates and investment options. Remember that money is just a tool to delay consumption, you need to get payed for said delay if you hold an stable asset. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.833333333333333
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#7",
                    "likes": "0",
                    "time": "18/07/2022-17:42:04",
                    "content": "Rock solid collateral and stability matter too Just ask Terra holders ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/CodeKnight",
                    "index": "#8",
                    "likes": "1",
                    "time": "18/07/2022-18:02:43",
                    "content": "I anticipate interest rates as the main differentiator. Eventually, governments and corporate partners(like Circle) are going to win the “guarunteed to be worth a dollar” differentiator. Dai will need to be able to safely provide interest to compete with that. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.888888888888889
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#9",
                    "likes": "3",
                    "time": "18/07/2022-19:04:48",
                    "content": "I was waiting a lot for someone to do this poll, I agree with those who voted for more exposure and different chains, we, the users with a little more “experience” love a stable coin, decentralized, collateralized correctly, with a good team behind, that the peg is always 1:1, but people who use stablecoins for their daily use do not pay 100% attention to that, they simply observe and think: “which coin has the most volume?” A fairly clear example is USDT has no support, its reports have been manipulated and despite all that people continue to use it, I am still in favor if DAI is more exposed to the real world it will be a fairly strong competitor against centralized stablecoins.     TRUEMAKER:  Real World Integration - Accepted as currency by businesses and payment processors   As a retailer in a country sanctioned with the impossibility of getting dollars in cash more cash than a stable coin, I accept cryptocurrencies and stable coins both BUSD, USDT and DAI, with what have I been paid more? With USDT There is the answer ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.337009803921569
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Federact",
                    "index": "#10",
                    "likes": "2",
                    "time": "18/07/2022-19:52:33",
                    "content": "    TRUEMAKER:  Other - Leave in comments for brainstorming   Stablecoin generation with tokenized Real World Assets collateral (stocks, reits, savings account, art, etc) not only for whales but for the ordinary person could be on the list ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.78125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#11",
                    "likes": "0",
                    "time": "19/07/2022-18:23:27",
                    "content": "L1/L2 integrations might help this become a reality due to lower gas costs coupled with a growing tokenized market ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 4.375
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#12",
                    "likes": "3",
                    "time": "20/07/2022-01:27:31",
                    "content": "Voted Globalization - network effects are everything and along with that - from a U.S. perspective avoiding characterization of DAI or MKR as a security and risk getting dropped by the regulated exchange platform and OTC dealers. My “other” would be “Identity” - we need a unique brand that gives DAI an emotional aura where people also want to hold and use it for non-technical, non-rational reasons. Just for the feeling and association. MakerDAO has a story no one new can replicate in that regard. @Nadia and team have a really good handle on what more we can be doing on this topic. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.321969696969697
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Matt_NZ",
                    "index": "#13",
                    "likes": "2",
                    "time": "20/07/2022-09:51:56",
                    "content": "    ACREinvest:  My “other” would be “Identity” - we need a unique brand that gives DAI an emotional aura where people also want to hold and use it for non-technical, non-rational reasons. Just for the feeling and association. MakerDAO has a story no one new can replicate in that regard. @Nadia and team have a really good handle on what more we can be doing on this topic.   This is a really interesting take and I think ties in nicely to the idea that DAI is the champion decentralised stablecoin, maybe even the ‘people’s choice’ compared to UST or USDC. We aren’t there just yet, but duration/Lindy will help, as does the fact that there really is a community (not a company) behind Maker. Personally, I also like initiatives like https://nature.makerdao.com/ from Growth. It’s nice to give the sense of a stablecoin with a soul, not just a balance sheet. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.2859848484848495
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#14",
                    "likes": "4",
                    "time": "20/07/2022-12:51:39",
                    "content": "The clear example of the identity of DAI is that I help Argentines a lot when it comes to safeguarding their money and not seeing it devalued, if DAI takes advantage of this type of campaign more, we can quite grow in the Latin American community that is booming, greater organic liquidity and higher volume in P2P markets would benefit DAI, and would have it as the “best safe option” among stablecoins ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 7.035714285714285
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#15",
                    "likes": "1",
                    "time": "20/07/2022-12:52:11",
                    "content": "    Matt_NZ:  Personally, I also like initiatives like https://nature.makerdao.com/  from Growth. It’s nice to give the sense of a stablecoin with a soul, not just a balance sheet.   Ditto!  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/ACREinvest",
                    "index": "#16",
                    "likes": "5",
                    "time": "20/07/2022-12:58:27",
                    "content": "Indeed, thank you. And congrats on being a top contributor! I loved reading the SourceCred report and the comments. You speak of the truly important and inspiring outcomes for what we are doing. We need two-way translation in the community so the English natives can fully appreciate to totality of MakerDAO, not just a small segment of politics that gets a lot of attention. I’d like a way to read more of what the LatAm community is saying real time. SourceCred Bi-Weekly Happenings #10 ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.671875
                },
                {
                    "author_link": "https://forum.makerdao.com/u/g_dip",
                    "index": "#17",
                    "likes": "2",
                    "time": "20/07/2022-15:20:21",
                    "content": "This is a great idea, but I think it needs to be re-run…   Globalization - Availability in the market via wallet integration, dapps, exchanges, L2s etc Real World Integration - Accepted as currency by businesses and payment processors On-chain trading - On-chain DAI investment options   These three items (of which two are incidentally the current winning outcomes) are effects, not causes. They are presuming that Dai has some kind of competitive advantage which caused it to be successful in these verticals - in short, they are begging the question. I would recommend re-running the poll with the following options (note that I’ve changed the language on some), and making it so that people can only choose one outcome (rather than two):  Interest - DSR is higher than other stablecoins and US short term government debt Clean - Dai collateral has a clear “green” impact Decentralized - uncensorable at the collateral level (in addition to Dai itself), ability to remain pseudonymous Insurance - Development of on chain deposit insurance similar to FDIC insurance but specific to DAI Other - Leave in comments for brainstorming  ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.865740740740741
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#18",
                    "likes": "0",
                    "time": "20/07/2022-15:36:49",
                    "content": "Those are valid points! I think that MKR can influence globalization with L1/L2 integrations, exchange and wallet partnerships, etc. I tend to agree that Real World Integration and On-Chain Trading might be more effects of being the stablecoin of choice but as those industries mature we can proactively partner with businessess, credit card and payment processors and market makers to position DAI appropriately. I think a re-run can be considered. There are a few other great ideas posted in the comment section. Might leave the poll running for a few more days to gather other ideas before reposting. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.9750000000000005
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#19",
                    "likes": "2",
                    "time": "20/07/2022-15:37:49",
                    "content": "Why isnt Maker asking the 5 billion plus of DAI holders what they value and want? Seriously ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.333333333333334
                },
                {
                    "author_link": "https://forum.makerdao.com/u/TRUEMAKER",
                    "index": "#20",
                    "likes": "0",
                    "time": "20/07/2022-15:44:40",
                    "content": "Definitely, at this time they represent our biggest stakeholders. I believe that was the goal of this poll, asking from a DAI holder point of view what is it that made you become a DAI holder, how can we keep you and if you you are thinking of leaving what are the reasons. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 5.0
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Eumenes",
                    "index": "#21",
                    "likes": "1",
                    "time": "20/07/2022-15:49:08",
                    "content": "I applaud your initiative but its not clear the survey population represent the DAI holders. My broader point is thay Maker needs to do a much better job understanding and representing DAI holder interests. MKR holders are the decision but do they know what DAI holders value and want? ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.125
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Moi",
                    "index": "#22",
                    "likes": "2",
                    "time": "21/07/2022-05:21:14",
                    "content": "Thank you very much, the entire LATAM community is adding a grain of sand so that the real knowledge of cryptocurrencies increases, if we could meet at some point so that each LATAM user can reflect their point of view, on how to make Maker and DAI is more recognized organically in our regions or also give us feedback so that the latam market enters Maker loans, it would be great. ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 6.76
                },
                {
                    "author_link": "https://forum.makerdao.com/u/Rahii",
                    "index": "#23",
                    "likes": "0",
                    "time": "21/07/2022-07:09:00",
                    "content": "Dai is safer than other stablecoins because it is not being controlled by a centralized issuer, makes it less vulnerable to a crash or attack ",
                    "links": [],
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.680555555555556
                }
            ]
        }
    ]
}