{
    "poll_list": [],
    "discourse_list": [
        {
            "thread_link": "https://forum.makerdao.com/t/sourcecred-de-delegados-traduccion/15479",
            "title": "SourceCred de Delegados [Traducci\\xc3\\xb3n] ",
            "index": 15479,
            "category": [
                "Discontinued Categories",
                "Misc Discontinued"
            ],
            "tags": [
                "sourcecred",
                "espa\\xc3\\xb1ol",
                "offch-govinc-set",
                "translate"
            ],
            "content": [
                {
                    "author_link": "https://forum.makerdao.com/u/brigith238",
                    "index": "#1",
                    "likes": "6",
                    "time": "31/05/2022-17:10:39",
                    "content": " Contexto El compromiso se ha convertido gradualmente en una parte esencial de las responsabilidades de los Delegados en el ecosistema de MakerDAO. Participar diariamente en nuestras discusiones de comunidad toma tiempo y aumenta los costos para los Delegados. Los Delegados reconocidos son compensados por la cantidad y calidad de su compromiso en el foro de MakerDAO juzgado por el resto de la comunidad vía el mecanismo del SourceCred. En adición, la partición activa de los Delegados con la comunidad y entre ellos genera una discusión más robusta y mayor compromiso de la comunidad. Esto indudablemente lleva a un mejor proceso de toma de decisiones para el protocolo.  Motivación La exclusión de los Delegados de los pagos en la instancia principal del SourceCred podría interrumpir este virtuoso proceso. Si el protocolo continua compensando a los Delegados Reconocidos por su compromiso activo continuaran incentivados a participar en la discusión regularmente para recibir su compensación. GovAlpha continúa buscando la mejor alternativa pero mientras tanto, creemos que es importante mantener los incentivos off-chain para un grupo en crecimiento de actores que desempeñan cada vez más un papel estratégico en nuestro ecosistema. Este post pretende presentar un nuevo mecanismo de recompensa de SourceCred para Delegados con el cual la Core Unit GovAlpha podrá evaluar y recompensar el compromiso y la participación de los Delegados Reconocidos en nuestra comunidad.  Compensación del SourCred para Delegados  Distribución del Cred Las razones detrás de la exclusión de los Delegados de los pagos en la instancia principal del SourceCred han sido extensamente explicadas y justificadas en el Reporte de SourceCred, de cualquier manera, GovAlpha continuará usando la distribución del Cred a través de los Delegados Reconocidos para evaluar su compromiso. Los desbalances detectados en el pasado tenían más que ver con las diferencias de los contribuyentes que con un problema de diseño en el algoritmo. Para mitigar los efectos generados por estas diferencias, GovAlpha ha diseñado dos cambios.   Un fondo separado de SourceCred para Delegados es creado para compensar el compromiso de los Delegados Reconocidos.   Las recompensas son  distribuidas fuera de la instancia existente del SourceCred y a través de una nueva fórmula de distribución.   Separar los presupuestos de compromiso de los Delegados Reconocidos y la comunidad previene a los Delegados Reconocidos de acaparar la distribución de DAI y nos permite mantener la dispersión y descentralización de los beneficios que el SourceCred ofrece a la comunidad. 52,000 DAI serán asignados anualmente al pool de recompensas de los  Delegados Reconocidos. Esto supone un total de 4,000 DAI distribuidos a los delegados por mes basado en su compromiso en el foro de MakerDAO. En meses de 5 semanas, el monto mensual a ser distribuido será de 5,000 DAI.  Cálculo del Cred El Cred para delegados es calculado usando un algoritmo personalizado basado en los resultados de Cred semanales brutos. Este algoritmo evalúa la actividad de los Delegados en una base semanal, midiendo el cred ganado por likes recibidos, las interacciones en los topics publicados, y las respuestas e interacciones en los post creados durante esa semana. Esto se realiza en un proceso de tres pasos:   Primero, el algoritmo selecciona la semana evaluada para un delegado específico.   Luego, filtra todas las acciones que no son relevantes para el ámbito de este cálculo (menciones de usuario, interacciones de cred entre semana, y pérdida de cred por likes dados).   Finalmente, cuenta y almacena el cred restante en la selección.   Esto hace el cálculo más viado hacia la actividad directa de los delegados y las contribuciones de calidad recientes, así los Delegados que contribuyan menos  (obtengan menos likes, respuestas, y link-backs) notaran que el DAI que reciban del SourceCred será significativamente reducido.  Proceso de Pago La compensación de compromiso en DAI en calculada en una base semanal y pagada a los Delegados Reconocidos una vez al mes. El cálculo semanal ajusta los parámetros de actividad para recompensar las contribuciones más recientes maximizando los incentivos para un compromiso continuo y consistente. Para clarificación y transparencia los cálculos de las compensaciones son públicas y se encuentran aquí: GovAlpha Observable. Finalmente, al final de cada mes, los pagos serán distribuidos por GovAlpha desde la GovAlpha multisig wallet.  Elegibilidad General Cualquier Delegado Reconocido con una o más cuentas oficiales del foro es elegible para recibir pagos por compromiso de delegados para una sola cuenta. Los Delegados Reconocidos deben registrarse y confirmar cual cuenta del foro está acumulando pagos por compromiso.  Elegibilidad Mensual Un Delegado Reconocido solo es elegible para pagos por compromiso en un es especifico si cumplen los criterios en MIP61 para recibir una compensación no nula por ese mes.  Exclusiones Los Facilitadores de GovAlpha pueden excluir a cualquier Delegado Reconocido de los pagos por compromiso en cualquier momento, por cualquier razón. Los Facilitadores de GovAlpha deben comunicar una razón públicamente si un Delegado Reconocido específico es excluido de los pagos de recompensa por propuesta off-chain.  Impacto Presupuestario El SourceCred de Delegados no requerirá ningún gasto extra-presupuestario. Estará financiado con 20% de los recursos actualmente asignados al fondo de contribuciones del SourceCred. Esto es parte de una estrategia de diversificación presupuestaria para el año 2022 donde GovAlpha intentará asignar incentivos monetarios más eficientemente en diferentes iniciativas complementarias para mejorar el manejo de los incentivos y al mismo tiempo cuidar los recursos de la DAO.  Comunicación El rendimiento de los Delegados será publicado en el Round-up de Delegados mensual junto con un resumen de su actividad en la Gobernanza de Maker.  Próximos Pasos GovAlpha Pretende comenzar a implementar el nuevo SourceCred de Delegados en junio. Créditos: @Recognized-Delegates  Esta es una traducción libre del topic Delegate SourceCred de @TheExistence ",
                    "links": [
                        "https://observablehq.com/@hernandoagf/makerdao-delegates-sc-calculated-cred-visualization",
                        "https://mips.makerdao.com/mips/details/MIP61#performance-modifier",
                        "https://forum.makerdao.com/t/delegate-sourcecred/15365",
                        "https://forum.makerdao.com/t/sourcecred-acontecimientos-bi-semanales-7-traduccion/15632"
                    ],
                    "GPT-summary": null,
                    "GPT-proposal-categories": null,
                    "GPT-discussion-categories": null,
                    "Sentiment": 3.4499999999999997
                }
            ]
        }
    ]
}